; ModuleID = '_collectionsmodule.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !410, globals: !1090)
!1 = !DIFile(filename: "./Modules/_collectionsmodule.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !350, !373, !11, !94, !374, !384, !402}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !7, line: 109, baseType: !8)
!7 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !7, line: 105, size: 128, align: 64, elements: !9)
!9 = !{!10, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !8, file: !7, line: 107, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !12, line: 177, baseType: !13)
!12 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !14, line: 102, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !16, line: 181, baseType: !17)
!16 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !8, file: !7, line: 108, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !7, line: 334, size: 3200, align: 64, elements: !21)
!21 = !{!22, !28, !32, !33, !34, !39, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !20, file: !7, line: 335, baseType: !23, size: 192, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !7, line: 114, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 111, size: 192, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !24, file: !7, line: 112, baseType: !6, size: 128, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !24, file: !7, line: 113, baseType: !11, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !20, file: !7, line: 336, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !20, file: !7, line: 341, baseType: !35, size: 64, align: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !7, line: 308, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !5}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !20, file: !7, line: 342, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !7, line: 314, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !5, !45, !44}
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !14, line: 48, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 246, size: 1728, align: 64, elements: !49)
!48 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!49 = !{!50, !51, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !71, !72, !73, !74, !76, !78, !80, !84, !87, !89, !90, !91, !92, !93, !97, !98}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !48, line: 247, baseType: !44, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !47, file: !48, line: 252, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !47, file: !48, line: 253, baseType: !52, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !47, file: !48, line: 254, baseType: !52, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !47, file: !48, line: 255, baseType: !52, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !47, file: !48, line: 256, baseType: !52, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !47, file: !48, line: 257, baseType: !52, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !47, file: !48, line: 258, baseType: !52, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !47, file: !48, line: 259, baseType: !52, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !47, file: !48, line: 261, baseType: !52, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !47, file: !48, line: 262, baseType: !52, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !47, file: !48, line: 263, baseType: !52, size: 64, align: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !47, file: !48, line: 265, baseType: !64, size: 64, align: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !48, line: 161, size: 192, align: 64, elements: !66)
!66 = !{!67, !68, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !65, file: !48, line: 162, baseType: !64, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !65, file: !48, line: 163, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !65, file: !48, line: 167, baseType: !44, size: 32, align: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !47, file: !48, line: 267, baseType: !69, size: 64, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !47, file: !48, line: 269, baseType: !44, size: 32, align: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !47, file: !48, line: 273, baseType: !44, size: 32, align: 32, offset: 928)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !47, file: !48, line: 275, baseType: !75, size: 64, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !16, line: 140, baseType: !17)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !47, file: !48, line: 279, baseType: !77, size: 16, align: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !47, file: !48, line: 280, baseType: !79, size: 8, align: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !47, file: !48, line: 281, baseType: !81, size: 8, align: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !47, file: !48, line: 285, baseType: !85, size: 64, align: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !48, line: 155, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !47, file: !48, line: 294, baseType: !88, size: 64, align: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !16, line: 141, baseType: !17)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !47, file: !48, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !47, file: !48, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !47, file: !48, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !47, file: !48, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !47, file: !48, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !47, file: !48, line: 309, baseType: !44, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !47, file: !48, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !20, file: !7, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !7, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!5, !5, !52}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !20, file: !7, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !7, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!44, !5, !52, !5}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !20, file: !7, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !20, file: !7, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !7, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!5, !5}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !20, file: !7, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !7, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !7, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !7, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!5, !5, !5}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !7, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !7, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !7, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !7, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !7, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !7, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!5, !5, !5, !5}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !7, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !7, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !7, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !7, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !7, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !7, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!44, !5}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !7, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !7, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !7, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !7, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !7, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !7, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !7, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !7, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !7, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !7, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !7, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !7, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !7, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !7, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !7, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !7, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !7, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !7, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !7, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !7, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !7, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !7, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !7, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !7, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !20, file: !7, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !7, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !7, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !7, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!11, !5}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !7, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !7, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !7, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!5, !5, !11}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !7, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !7, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !7, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !7, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!44, !5, !11, !5}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !7, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !7, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !7, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!44, !5, !5}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !7, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !7, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !20, file: !7, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !7, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !7, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !7, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !7, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !7, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!44, !5, !5, !5}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !20, file: !7, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !7, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !5}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !12, line: 186, baseType: !11)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !20, file: !7, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !20, file: !7, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !20, file: !7, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !7, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !20, file: !7, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !7, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !20, file: !7, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !7, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !7, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !7, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!44, !5, !235, !44}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !7, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !7, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !7, line: 179, baseType: !4, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !7, line: 180, baseType: !5, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !7, line: 181, baseType: !11, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !7, line: 182, baseType: !11, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !7, line: 184, baseType: !44, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !7, line: 185, baseType: !44, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !7, line: 186, baseType: !52, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !7, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !7, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !7, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !7, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !7, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !7, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !5, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !20, file: !7, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !20, file: !7, line: 368, baseType: !29, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !20, file: !7, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !7, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!44, !5, !263, !4}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !7, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!44, !5, !4}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !20, file: !7, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !20, file: !7, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !7, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!5, !5, !5, !44}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !20, file: !7, line: 382, baseType: !11, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !20, file: !7, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !7, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !20, file: !7, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !7, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !20, file: !7, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !29, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !44, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !29, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !20, file: !7, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !291, line: 18, size: 320, align: 64, elements: !292)
!291 = !DIFile(filename: "Include/structmember.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!292 = !{!293, !294, !295, !296, !297}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !291, line: 19, baseType: !52, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !290, file: !291, line: 20, baseType: !44, size: 32, align: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !290, file: !291, line: 21, baseType: !11, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !290, file: !291, line: 22, baseType: !44, size: 32, align: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !290, file: !291, line: 23, baseType: !52, size: 64, align: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !20, file: !7, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !52, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!5, !5, !4}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!44, !5, !5, !4}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !52, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !20, file: !7, line: 392, baseType: !19, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !20, file: !7, line: 393, baseType: !5, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !20, file: !7, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !7, line: 325, baseType: !134)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !20, file: !7, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !7, line: 326, baseType: !210)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !20, file: !7, line: 396, baseType: !11, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !20, file: !7, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !7, line: 327, baseType: !210)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !20, file: !7, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !7, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!5, !19, !11}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !20, file: !7, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !7, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!5, !19, !5, !5}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !20, file: !7, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !7, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !4}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !20, file: !7, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !20, file: !7, line: 402, baseType: !5, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !20, file: !7, line: 403, baseType: !5, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !20, file: !7, line: 404, baseType: !5, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !20, file: !7, line: 405, baseType: !5, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !20, file: !7, line: 406, baseType: !5, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !20, file: !7, line: 407, baseType: !35, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !20, file: !7, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !20, file: !7, line: 412, baseType: !35, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "dequeobject", file: !1, line: 128, baseType: !352)
!352 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 119, size: 640, align: 64, elements: !353)
!353 = !{!354, !355, !367, !368, !369, !370, !371, !372}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !352, file: !1, line: 120, baseType: !23, size: 192, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "leftblock", scope: !352, file: !1, line: 121, baseType: !356, size: 64, align: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "block", file: !1, line: 54, baseType: !358)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLOCK", file: !1, line: 50, size: 4096, align: 64, elements: !359)
!359 = !{!360, !362, !366}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "leftlink", scope: !358, file: !1, line: 51, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !358, file: !1, line: 52, baseType: !363, size: 3968, align: 64, offset: 64)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 3968, align: 64, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 62)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "rightlink", scope: !358, file: !1, line: 53, baseType: !361, size: 64, align: 64, offset: 4032)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "rightblock", scope: !352, file: !1, line: 122, baseType: !356, size: 64, align: 64, offset: 256)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "leftindex", scope: !352, file: !1, line: 123, baseType: !11, size: 64, align: 64, offset: 320)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "rightindex", scope: !352, file: !1, line: 124, baseType: !11, size: 64, align: 64, offset: 384)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !352, file: !1, line: 125, baseType: !17, size: 64, align: 64, offset: 448)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !352, file: !1, line: 126, baseType: !11, size: 64, align: 64, offset: 512)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !352, file: !1, line: 127, baseType: !5, size: 64, align: 64, offset: 576)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "dequeiterobject", file: !1, line: 1203, baseType: !376)
!376 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 1196, size: 448, align: 64, elements: !377)
!377 = !{!378, !379, !380, !381, !382, !383}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !376, file: !1, line: 1197, baseType: !6, size: 128, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !376, file: !1, line: 1198, baseType: !11, size: 64, align: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !376, file: !1, line: 1199, baseType: !356, size: 64, align: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "deque", scope: !376, file: !1, line: 1200, baseType: !350, size: 64, align: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !376, file: !1, line: 1201, baseType: !17, size: 64, align: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !376, file: !1, line: 1202, baseType: !11, size: 64, align: 64, offset: 384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "defdictobject", file: !1, line: 1486, baseType: !386)
!386 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 1483, size: 384, align: 64, elements: !387)
!387 = !{!388, !401}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !386, file: !1, line: 1484, baseType: !389, size: 320, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictObject", file: !390, line: 28, baseType: !391)
!390 = !DIFile(filename: "Include/dictobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!391 = !DICompositeType(tag: DW_TAG_structure_type, file: !390, line: 23, size: 320, align: 64, elements: !392)
!392 = !{!393, !394, !395, !399}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !391, file: !390, line: 24, baseType: !6, size: 128, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ma_used", scope: !391, file: !390, line: 25, baseType: !11, size: 64, align: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ma_keys", scope: !391, file: !390, line: 26, baseType: !396, size: 64, align: 64, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictKeysObject", file: !390, line: 18, baseType: !398)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "_dictkeysobject", file: !7, line: 461, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ma_values", scope: !391, file: !390, line: 27, baseType: !400, size: 64, align: 64, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "default_factory", scope: !386, file: !1, line: 1485, baseType: !5, size: 64, align: 64, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !404, line: 33, baseType: !405)
!404 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!405 = !DICompositeType(tag: DW_TAG_structure_type, file: !404, line: 25, size: 256, align: 64, elements: !406)
!406 = !{!407, !408}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !405, file: !404, line: 26, baseType: !23, size: 192, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !405, file: !404, line: 27, baseType: !409, size: 64, align: 64, offset: 192)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, align: 64, elements: !82)
!410 = !{!411, !416, !485, !490, !495, !503, !508, !518, !533, !542, !564, !570, !578, !585, !614, !623, !651, !658, !664, !710, !716, !728, !740, !743, !746, !758, !787, !807, !823, !827, !838, !843, !851, !854, !873, !888, !899, !924, !933, !944, !961, !964, !987, !1009, !1019, !1030, !1036, !1039, !1042, !1064, !1068}
!411 = !DISubprogram(name: "PyInit__collections", scope: !1, file: !1, line: 1885, type: !412, isLocal: false, isDefinition: true, scopeLine: 1886, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__collections, variables: !414)
!412 = !DISubroutineType(types: !413)
!413 = !{!5}
!414 = !{!415}
!415 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !411, file: !1, line: 1887, type: !5)
!416 = !DISubprogram(name: "_count_elements", scope: !1, file: !1, line: 1766, type: !126, isLocal: true, isDefinition: true, scopeLine: 1767, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @_count_elements, variables: !417)
!417 = !{!418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !440, !444, !446, !450, !452, !456, !458, !460, !462, !465, !467, !470, !472, !475, !477, !480, !482}
!418 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !416, file: !1, line: 1766, type: !5)
!419 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !416, file: !1, line: 1766, type: !5)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !416, file: !1, line: 1770, type: !5)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iterable", scope: !416, file: !1, line: 1770, type: !5)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapping", scope: !416, file: !1, line: 1770, type: !5)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldval", scope: !416, file: !1, line: 1770, type: !5)
!424 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newval", scope: !416, file: !1, line: 1771, type: !5)
!425 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !416, file: !1, line: 1772, type: !5)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zero", scope: !416, file: !1, line: 1773, type: !5)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "one", scope: !416, file: !1, line: 1774, type: !5)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bound_get", scope: !416, file: !1, line: 1775, type: !5)
!429 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapping_get", scope: !416, file: !1, line: 1776, type: !5)
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict_get", scope: !416, file: !1, line: 1777, type: !5)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapping_setitem", scope: !416, file: !1, line: 1778, type: !5)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict_setitem", scope: !416, file: !1, line: 1779, type: !5)
!433 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !434, file: !1, line: 1816, type: !5)
!434 = distinct !DILexicalBlock(scope: !435, file: !1, line: 1816, column: 17)
!435 = distinct !DILexicalBlock(scope: !436, file: !1, line: 1810, column: 20)
!436 = distinct !DILexicalBlock(scope: !437, file: !1, line: 1807, column: 17)
!437 = distinct !DILexicalBlock(scope: !438, file: !1, line: 1802, column: 19)
!438 = distinct !DILexicalBlock(scope: !439, file: !1, line: 1801, column: 69)
!439 = distinct !DILexicalBlock(scope: !416, file: !1, line: 1800, column: 9)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !441, file: !1, line: 1816, type: !5)
!441 = distinct !DILexicalBlock(scope: !442, file: !1, line: 1816, column: 17)
!442 = distinct !DILexicalBlock(scope: !443, file: !1, line: 1816, column: 17)
!443 = distinct !DILexicalBlock(scope: !434, file: !1, line: 1816, column: 17)
!444 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !445, file: !1, line: 1818, type: !5)
!445 = distinct !DILexicalBlock(scope: !437, file: !1, line: 1818, column: 13)
!446 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !447, file: !1, line: 1837, type: !5)
!447 = distinct !DILexicalBlock(scope: !448, file: !1, line: 1837, column: 13)
!448 = distinct !DILexicalBlock(scope: !449, file: !1, line: 1829, column: 19)
!449 = distinct !DILexicalBlock(scope: !439, file: !1, line: 1820, column: 12)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !451, file: !1, line: 1842, type: !5)
!451 = distinct !DILexicalBlock(scope: !448, file: !1, line: 1842, column: 13)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !453, file: !1, line: 1842, type: !5)
!453 = distinct !DILexicalBlock(scope: !454, file: !1, line: 1842, column: 13)
!454 = distinct !DILexicalBlock(scope: !455, file: !1, line: 1842, column: 13)
!455 = distinct !DILexicalBlock(scope: !451, file: !1, line: 1842, column: 13)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !457, file: !1, line: 1843, type: !5)
!457 = distinct !DILexicalBlock(scope: !448, file: !1, line: 1843, column: 13)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !459, file: !1, line: 1848, type: !5)
!459 = distinct !DILexicalBlock(scope: !416, file: !1, line: 1848, column: 5)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !461, file: !1, line: 1849, type: !5)
!461 = distinct !DILexicalBlock(scope: !416, file: !1, line: 1849, column: 5)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !463, file: !1, line: 1849, type: !5)
!463 = distinct !DILexicalBlock(scope: !464, file: !1, line: 1849, column: 5)
!464 = distinct !DILexicalBlock(scope: !461, file: !1, line: 1849, column: 5)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !466, file: !1, line: 1850, type: !5)
!466 = distinct !DILexicalBlock(scope: !416, file: !1, line: 1850, column: 5)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !468, file: !1, line: 1850, type: !5)
!468 = distinct !DILexicalBlock(scope: !469, file: !1, line: 1850, column: 5)
!469 = distinct !DILexicalBlock(scope: !466, file: !1, line: 1850, column: 5)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !471, file: !1, line: 1851, type: !5)
!471 = distinct !DILexicalBlock(scope: !416, file: !1, line: 1851, column: 5)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !473, file: !1, line: 1851, type: !5)
!473 = distinct !DILexicalBlock(scope: !474, file: !1, line: 1851, column: 5)
!474 = distinct !DILexicalBlock(scope: !471, file: !1, line: 1851, column: 5)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !476, file: !1, line: 1852, type: !5)
!476 = distinct !DILexicalBlock(scope: !416, file: !1, line: 1852, column: 5)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !478, file: !1, line: 1852, type: !5)
!478 = distinct !DILexicalBlock(scope: !479, file: !1, line: 1852, column: 5)
!479 = distinct !DILexicalBlock(scope: !476, file: !1, line: 1852, column: 5)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !481, file: !1, line: 1853, type: !5)
!481 = distinct !DILexicalBlock(scope: !416, file: !1, line: 1853, column: 5)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !483, file: !1, line: 1853, type: !5)
!483 = distinct !DILexicalBlock(scope: !484, file: !1, line: 1853, column: 5)
!484 = distinct !DILexicalBlock(scope: !481, file: !1, line: 1853, column: 5)
!485 = !DISubprogram(name: "deque_dealloc", scope: !1, file: !1, line: 841, type: !486, isLocal: true, isDefinition: true, scopeLine: 842, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.dequeobject*)* @deque_dealloc, variables: !488)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !350}
!488 = !{!489}
!489 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !485, file: !1, line: 841, type: !350)
!490 = !DISubprogram(name: "freeblock", scope: !1, file: !1, line: 109, type: !491, isLocal: true, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: true, variables: !493)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !356}
!493 = !{!494}
!494 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 1, scope: !490, file: !1, line: 109, type: !356)
!495 = !DISubprogram(name: "deque_repr", scope: !1, file: !1, line: 923, type: !116, isLocal: true, isDefinition: true, scopeLine: 924, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @deque_repr, variables: !496)
!496 = !{!497, !498, !499, !500, !501}
!497 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !495, file: !1, line: 923, type: !5)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aslist", scope: !495, file: !1, line: 925, type: !5)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !495, file: !1, line: 925, type: !5)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !495, file: !1, line: 926, type: !44)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !502, file: !1, line: 946, type: !5)
!502 = distinct !DILexicalBlock(scope: !495, file: !1, line: 946, column: 5)
!503 = !DISubprogram(name: "deque_len", scope: !1, file: !1, line: 679, type: !504, isLocal: true, isDefinition: true, scopeLine: 680, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.dequeobject*)* @deque_len, variables: !506)
!504 = !DISubroutineType(types: !505)
!505 = !{!11, !350}
!506 = !{!507}
!507 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !503, file: !1, line: 679, type: !350)
!508 = !DISubprogram(name: "deque_item", scope: !1, file: !1, line: 735, type: !509, isLocal: true, isDefinition: true, scopeLine: 736, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, i64)* @deque_item, variables: !511)
!509 = !DISubroutineType(types: !510)
!510 = !{!5, !350, !11}
!511 = !{!512, !513, !514, !515, !516, !517}
!512 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !508, file: !1, line: 735, type: !350)
!513 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !508, file: !1, line: 735, type: !11)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !508, file: !1, line: 737, type: !356)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !508, file: !1, line: 738, type: !5)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !508, file: !1, line: 739, type: !11)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !508, file: !1, line: 739, type: !11)
!518 = !DISubprogram(name: "deque_ass_item", scope: !1, file: !1, line: 797, type: !519, isLocal: true, isDefinition: true, scopeLine: 798, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.dequeobject*, i64, %struct._object*)* @deque_ass_item, variables: !521)
!519 = !DISubroutineType(types: !520)
!520 = !{!44, !350, !11, !5}
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530, !531}
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !518, file: !1, line: 797, type: !350)
!523 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !518, file: !1, line: 797, type: !11)
!524 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 3, scope: !518, file: !1, line: 797, type: !5)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_value", scope: !518, file: !1, line: 799, type: !5)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !518, file: !1, line: 800, type: !356)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !518, file: !1, line: 801, type: !11)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !518, file: !1, line: 801, type: !11)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halflen", scope: !518, file: !1, line: 801, type: !11)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !518, file: !1, line: 801, type: !11)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !532, file: !1, line: 827, type: !5)
!532 = distinct !DILexicalBlock(scope: !518, file: !1, line: 827, column: 5)
!533 = !DISubprogram(name: "deque_del_item", scope: !1, file: !1, line: 781, type: !534, isLocal: true, isDefinition: true, scopeLine: 782, flags: DIFlagPrototyped, isOptimized: true, variables: !536)
!534 = !DISubroutineType(types: !535)
!535 = !{!44, !350, !11}
!536 = !{!537, !538, !539, !540}
!537 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !533, file: !1, line: 781, type: !350)
!538 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !533, file: !1, line: 781, type: !11)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !533, file: !1, line: 783, type: !5)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !541, file: !1, line: 791, type: !5)
!541 = distinct !DILexicalBlock(scope: !533, file: !1, line: 791, column: 5)
!542 = !DISubprogram(name: "_deque_rotate", scope: !1, file: !1, line: 458, type: !534, isLocal: true, isDefinition: true, scopeLine: 459, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.dequeobject*, i64)* @_deque_rotate, variables: !543)
!543 = !{!544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !557, !558, !559, !562, !563}
!544 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !542, file: !1, line: 458, type: !350)
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !542, file: !1, line: 458, type: !11)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !542, file: !1, line: 460, type: !356)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "leftblock", scope: !542, file: !1, line: 461, type: !356)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rightblock", scope: !542, file: !1, line: 462, type: !356)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "leftindex", scope: !542, file: !1, line: 463, type: !11)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rightindex", scope: !542, file: !1, line: 464, type: !11)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !542, file: !1, line: 465, type: !11)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halflen", scope: !542, file: !1, line: 465, type: !11)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !542, file: !1, line: 466, type: !44)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "src", scope: !555, file: !1, line: 498, type: !400)
!555 = distinct !DILexicalBlock(scope: !556, file: !1, line: 497, column: 9)
!556 = distinct !DILexicalBlock(scope: !542, file: !1, line: 481, column: 19)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !555, file: !1, line: 498, type: !400)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !555, file: !1, line: 499, type: !11)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "src", scope: !560, file: !1, line: 542, type: !400)
!560 = distinct !DILexicalBlock(scope: !561, file: !1, line: 541, column: 9)
!561 = distinct !DILexicalBlock(scope: !542, file: !1, line: 525, column: 19)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !560, file: !1, line: 542, type: !400)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !560, file: !1, line: 543, type: !11)
!564 = !DISubprogram(name: "newblock", scope: !1, file: !1, line: 87, type: !565, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, variables: !567)
!565 = !DISubroutineType(types: !566)
!566 = !{!356, !11}
!567 = !{!568, !569}
!568 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 1, scope: !564, file: !1, line: 87, type: !11)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !564, file: !1, line: 88, type: !356)
!570 = !DISubprogram(name: "deque_popleft", scope: !1, file: !1, line: 218, type: !571, isLocal: true, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, %struct._object*)* @deque_popleft, variables: !573)
!571 = !DISubroutineType(types: !572)
!572 = !{!5, !350, !5}
!573 = !{!574, !575, !576, !577}
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !570, file: !1, line: 218, type: !350)
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !570, file: !1, line: 218, type: !5)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !570, file: !1, line: 220, type: !5)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prevblock", scope: !570, file: !1, line: 221, type: !356)
!578 = !DISubprogram(name: "deque_inplace_concat", scope: !1, file: !1, line: 445, type: !571, isLocal: true, isDefinition: true, scopeLine: 446, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, %struct._object*)* @deque_inplace_concat, variables: !579)
!579 = !{!580, !581, !582, !583}
!580 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !578, file: !1, line: 445, type: !350)
!581 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "other", arg: 2, scope: !578, file: !1, line: 445, type: !5)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !578, file: !1, line: 447, type: !5)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !584, file: !1, line: 452, type: !5)
!584 = distinct !DILexicalBlock(scope: !578, file: !1, line: 452, column: 5)
!585 = !DISubprogram(name: "deque_extend", scope: !1, file: !1, line: 323, type: !571, isLocal: true, isDefinition: true, scopeLine: 324, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, %struct._object*)* @deque_extend, variables: !586)
!586 = !{!587, !588, !589, !590, !591, !594, !595, !597, !601, !605, !607, !610, !612}
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !585, file: !1, line: 323, type: !350)
!588 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iterable", arg: 2, scope: !585, file: !1, line: 323, type: !5)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !585, file: !1, line: 325, type: !5)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !585, file: !1, line: 325, type: !5)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !592, file: !1, line: 329, type: !5)
!592 = distinct !DILexicalBlock(scope: !593, file: !1, line: 328, column: 40)
!593 = distinct !DILexicalBlock(scope: !585, file: !1, line: 328, column: 9)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !592, file: !1, line: 330, type: !5)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !596, file: !1, line: 334, type: !5)
!596 = distinct !DILexicalBlock(scope: !592, file: !1, line: 334, column: 9)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !598, file: !1, line: 356, type: !356)
!598 = distinct !DILexicalBlock(scope: !599, file: !1, line: 355, column: 46)
!599 = distinct !DILexicalBlock(scope: !600, file: !1, line: 355, column: 13)
!600 = distinct !DILexicalBlock(scope: !585, file: !1, line: 353, column: 46)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !602, file: !1, line: 358, type: !5)
!602 = distinct !DILexicalBlock(scope: !603, file: !1, line: 358, column: 17)
!603 = distinct !DILexicalBlock(scope: !604, file: !1, line: 357, column: 28)
!604 = distinct !DILexicalBlock(scope: !598, file: !1, line: 357, column: 17)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !606, file: !1, line: 359, type: !5)
!606 = distinct !DILexicalBlock(scope: !603, file: !1, line: 359, column: 17)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !608, file: !1, line: 372, type: !5)
!608 = distinct !DILexicalBlock(scope: !609, file: !1, line: 372, column: 9)
!609 = distinct !DILexicalBlock(scope: !600, file: !1, line: 372, column: 9)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !611, file: !1, line: 372, type: !5)
!611 = distinct !DILexicalBlock(scope: !608, file: !1, line: 372, column: 9)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !613, file: !1, line: 374, type: !5)
!613 = distinct !DILexicalBlock(scope: !585, file: !1, line: 374, column: 5)
!614 = !DISubprogram(name: "consume_iterator", scope: !1, file: !1, line: 309, type: !116, isLocal: true, isDefinition: true, scopeLine: 310, flags: DIFlagPrototyped, isOptimized: true, variables: !615)
!615 = !{!616, !617, !618, !621}
!616 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "it", arg: 1, scope: !614, file: !1, line: 309, type: !5)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !614, file: !1, line: 311, type: !5)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !619, file: !1, line: 314, type: !5)
!619 = distinct !DILexicalBlock(scope: !620, file: !1, line: 314, column: 9)
!620 = distinct !DILexicalBlock(scope: !614, file: !1, line: 313, column: 46)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !622, file: !1, line: 316, type: !5)
!622 = distinct !DILexicalBlock(scope: !614, file: !1, line: 316, column: 5)
!623 = !DISubprogram(name: "deque_traverse", scope: !1, file: !1, line: 857, type: !624, isLocal: true, isDefinition: true, scopeLine: 858, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.dequeobject*, i32 (%struct._object*, i8*)*, i8*)* @deque_traverse, variables: !626)
!624 = !DISubroutineType(types: !625)
!625 = !{!44, !350, !263, !4}
!626 = !{!627, !628, !629, !630, !631, !632, !633, !634, !644}
!627 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !623, file: !1, line: 857, type: !350)
!628 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !623, file: !1, line: 857, type: !263)
!629 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !623, file: !1, line: 857, type: !4)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !623, file: !1, line: 859, type: !356)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !623, file: !1, line: 860, type: !5)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !623, file: !1, line: 861, type: !11)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indexlo", scope: !623, file: !1, line: 862, type: !11)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !635, file: !1, line: 867, type: !44)
!635 = distinct !DILexicalBlock(scope: !636, file: !1, line: 867, column: 13)
!636 = distinct !DILexicalBlock(scope: !637, file: !1, line: 867, column: 13)
!637 = distinct !DILexicalBlock(scope: !638, file: !1, line: 867, column: 13)
!638 = distinct !DILexicalBlock(scope: !639, file: !1, line: 865, column: 59)
!639 = distinct !DILexicalBlock(scope: !640, file: !1, line: 865, column: 9)
!640 = distinct !DILexicalBlock(scope: !641, file: !1, line: 865, column: 9)
!641 = distinct !DILexicalBlock(scope: !642, file: !1, line: 864, column: 74)
!642 = distinct !DILexicalBlock(scope: !643, file: !1, line: 864, column: 5)
!643 = distinct !DILexicalBlock(scope: !623, file: !1, line: 864, column: 5)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !645, file: !1, line: 873, type: !44)
!645 = distinct !DILexicalBlock(scope: !646, file: !1, line: 873, column: 9)
!646 = distinct !DILexicalBlock(scope: !647, file: !1, line: 873, column: 9)
!647 = distinct !DILexicalBlock(scope: !648, file: !1, line: 873, column: 9)
!648 = distinct !DILexicalBlock(scope: !649, file: !1, line: 871, column: 64)
!649 = distinct !DILexicalBlock(scope: !650, file: !1, line: 871, column: 5)
!650 = distinct !DILexicalBlock(scope: !623, file: !1, line: 871, column: 5)
!651 = !DISubprogram(name: "deque_clear", scope: !1, file: !1, line: 720, type: !486, isLocal: true, isDefinition: true, scopeLine: 721, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.dequeobject*)* @deque_clear, variables: !652)
!652 = !{!653, !654, !655}
!653 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !651, file: !1, line: 720, type: !350)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !651, file: !1, line: 722, type: !5)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !656, file: !1, line: 727, type: !5)
!656 = distinct !DILexicalBlock(scope: !657, file: !1, line: 727, column: 9)
!657 = distinct !DILexicalBlock(scope: !651, file: !1, line: 724, column: 28)
!658 = !DISubprogram(name: "deque_pop", scope: !1, file: !1, line: 181, type: !571, isLocal: true, isDefinition: true, scopeLine: 182, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, %struct._object*)* @deque_pop, variables: !659)
!659 = !{!660, !661, !662, !663}
!660 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !658, file: !1, line: 181, type: !350)
!661 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !658, file: !1, line: 181, type: !5)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !658, file: !1, line: 183, type: !5)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prevblock", scope: !658, file: !1, line: 184, type: !356)
!664 = !DISubprogram(name: "deque_richcompare", scope: !1, file: !1, line: 952, type: !271, isLocal: true, isDefinition: true, scopeLine: 953, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @deque_richcompare, variables: !665)
!665 = !{!666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !684, !686, !688, !690, !692, !695, !697, !700, !702, !705, !707}
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !664, file: !1, line: 952, type: !5)
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !664, file: !1, line: 952, type: !5)
!668 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !664, file: !1, line: 952, type: !44)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it1", scope: !664, file: !1, line: 954, type: !5)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it2", scope: !664, file: !1, line: 954, type: !5)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !664, file: !1, line: 954, type: !5)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !664, file: !1, line: 954, type: !5)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vs", scope: !664, file: !1, line: 955, type: !11)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ws", scope: !664, file: !1, line: 955, type: !11)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !664, file: !1, line: 956, type: !44)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmp", scope: !664, file: !1, line: 956, type: !44)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !678, file: !1, line: 996, type: !5)
!678 = distinct !DILexicalBlock(scope: !679, file: !1, line: 996, column: 13)
!679 = distinct !DILexicalBlock(scope: !680, file: !1, line: 994, column: 21)
!680 = distinct !DILexicalBlock(scope: !681, file: !1, line: 994, column: 13)
!681 = distinct !DILexicalBlock(scope: !682, file: !1, line: 986, column: 14)
!682 = distinct !DILexicalBlock(scope: !683, file: !1, line: 986, column: 5)
!683 = distinct !DILexicalBlock(scope: !664, file: !1, line: 986, column: 5)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !685, file: !1, line: 997, type: !5)
!685 = distinct !DILexicalBlock(scope: !679, file: !1, line: 997, column: 13)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !687, file: !1, line: 1000, type: !5)
!687 = distinct !DILexicalBlock(scope: !681, file: !1, line: 1000, column: 9)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !689, file: !1, line: 1001, type: !5)
!689 = distinct !DILexicalBlock(scope: !681, file: !1, line: 1001, column: 9)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !691, file: !1, line: 1006, type: !5)
!691 = distinct !DILexicalBlock(scope: !664, file: !1, line: 1006, column: 5)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !693, file: !1, line: 1006, type: !5)
!693 = distinct !DILexicalBlock(scope: !694, file: !1, line: 1006, column: 5)
!694 = distinct !DILexicalBlock(scope: !691, file: !1, line: 1006, column: 5)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !696, file: !1, line: 1007, type: !5)
!696 = distinct !DILexicalBlock(scope: !664, file: !1, line: 1007, column: 5)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !698, file: !1, line: 1007, type: !5)
!698 = distinct !DILexicalBlock(scope: !699, file: !1, line: 1007, column: 5)
!699 = distinct !DILexicalBlock(scope: !696, file: !1, line: 1007, column: 5)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !701, file: !1, line: 1020, type: !5)
!701 = distinct !DILexicalBlock(scope: !664, file: !1, line: 1020, column: 5)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !703, file: !1, line: 1020, type: !5)
!703 = distinct !DILexicalBlock(scope: !704, file: !1, line: 1020, column: 5)
!704 = distinct !DILexicalBlock(scope: !701, file: !1, line: 1020, column: 5)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !706, file: !1, line: 1021, type: !5)
!706 = distinct !DILexicalBlock(scope: !664, file: !1, line: 1021, column: 5)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !708, file: !1, line: 1021, type: !5)
!708 = distinct !DILexicalBlock(scope: !709, file: !1, line: 1021, column: 5)
!709 = distinct !DILexicalBlock(scope: !706, file: !1, line: 1021, column: 5)
!710 = !DISubprogram(name: "deque_iter", scope: !1, file: !1, line: 1208, type: !711, isLocal: true, isDefinition: true, scopeLine: 1209, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*)* @deque_iter, variables: !713)
!711 = !DISubroutineType(types: !712)
!712 = !{!5, !350}
!713 = !{!714, !715}
!714 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !710, file: !1, line: 1208, type: !350)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !710, file: !1, line: 1210, type: !374)
!716 = !DISubprogram(name: "deque_append", scope: !1, file: !1, line: 256, type: !571, isLocal: true, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, %struct._object*)* @deque_append, variables: !717)
!717 = !{!718, !719, !720, !723, !726}
!718 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !716, file: !1, line: 256, type: !350)
!719 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 2, scope: !716, file: !1, line: 256, type: !5)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !721, file: !1, line: 260, type: !356)
!721 = distinct !DILexicalBlock(scope: !722, file: !1, line: 259, column: 42)
!722 = distinct !DILexicalBlock(scope: !716, file: !1, line: 259, column: 9)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !724, file: !1, line: 274, type: !5)
!724 = distinct !DILexicalBlock(scope: !725, file: !1, line: 274, column: 5)
!725 = distinct !DILexicalBlock(scope: !716, file: !1, line: 274, column: 5)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !727, file: !1, line: 274, type: !5)
!727 = distinct !DILexicalBlock(scope: !724, file: !1, line: 274, column: 5)
!728 = !DISubprogram(name: "deque_appendleft", scope: !1, file: !1, line: 281, type: !571, isLocal: true, isDefinition: true, scopeLine: 282, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, %struct._object*)* @deque_appendleft, variables: !729)
!729 = !{!730, !731, !732, !735, !738}
!730 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !728, file: !1, line: 281, type: !350)
!731 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 2, scope: !728, file: !1, line: 281, type: !5)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !733, file: !1, line: 285, type: !356)
!733 = distinct !DILexicalBlock(scope: !734, file: !1, line: 284, column: 32)
!734 = distinct !DILexicalBlock(scope: !728, file: !1, line: 284, column: 9)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !736, file: !1, line: 299, type: !5)
!736 = distinct !DILexicalBlock(scope: !737, file: !1, line: 299, column: 5)
!737 = distinct !DILexicalBlock(scope: !728, file: !1, line: 299, column: 5)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !739, file: !1, line: 299, type: !5)
!739 = distinct !DILexicalBlock(scope: !736, file: !1, line: 299, column: 5)
!740 = !DISubprogram(name: "deque_clearmethod", scope: !1, file: !1, line: 832, type: !711, isLocal: true, isDefinition: true, scopeLine: 833, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*)* @deque_clearmethod, variables: !741)
!741 = !{!742}
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !740, file: !1, line: 832, type: !350)
!743 = !DISubprogram(name: "deque_copy", scope: !1, file: !1, line: 879, type: !116, isLocal: true, isDefinition: true, scopeLine: 880, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @deque_copy, variables: !744)
!744 = !{!745}
!745 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !743, file: !1, line: 879, type: !5)
!746 = !DISubprogram(name: "deque_count", scope: !1, file: !1, line: 639, type: !571, isLocal: true, isDefinition: true, scopeLine: 640, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, %struct._object*)* @deque_count, variables: !747)
!747 = !{!748, !749, !750, !751, !752, !753, !754, !755, !756, !757}
!748 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !746, file: !1, line: 639, type: !350)
!749 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !746, file: !1, line: 639, type: !5)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !746, file: !1, line: 641, type: !356)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !746, file: !1, line: 642, type: !11)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !746, file: !1, line: 643, type: !11)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !746, file: !1, line: 644, type: !11)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !746, file: !1, line: 645, type: !11)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !746, file: !1, line: 646, type: !5)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start_state", scope: !746, file: !1, line: 647, type: !17)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmp", scope: !746, file: !1, line: 648, type: !44)
!758 = !DISubprogram(name: "deque_extendleft", scope: !1, file: !1, line: 384, type: !571, isLocal: true, isDefinition: true, scopeLine: 385, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, %struct._object*)* @deque_extendleft, variables: !759)
!759 = !{!760, !761, !762, !763, !764, !767, !768, !770, !774, !778, !780, !783, !785}
!760 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !758, file: !1, line: 384, type: !350)
!761 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iterable", arg: 2, scope: !758, file: !1, line: 384, type: !5)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !758, file: !1, line: 386, type: !5)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !758, file: !1, line: 386, type: !5)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !765, file: !1, line: 390, type: !5)
!765 = distinct !DILexicalBlock(scope: !766, file: !1, line: 389, column: 40)
!766 = distinct !DILexicalBlock(scope: !758, file: !1, line: 389, column: 9)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !765, file: !1, line: 391, type: !5)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !769, file: !1, line: 395, type: !5)
!769 = distinct !DILexicalBlock(scope: !765, file: !1, line: 395, column: 9)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !771, file: !1, line: 417, type: !356)
!771 = distinct !DILexicalBlock(scope: !772, file: !1, line: 416, column: 36)
!772 = distinct !DILexicalBlock(scope: !773, file: !1, line: 416, column: 13)
!773 = distinct !DILexicalBlock(scope: !758, file: !1, line: 414, column: 46)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !775, file: !1, line: 419, type: !5)
!775 = distinct !DILexicalBlock(scope: !776, file: !1, line: 419, column: 17)
!776 = distinct !DILexicalBlock(scope: !777, file: !1, line: 418, column: 28)
!777 = distinct !DILexicalBlock(scope: !771, file: !1, line: 418, column: 17)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !779, file: !1, line: 420, type: !5)
!779 = distinct !DILexicalBlock(scope: !776, file: !1, line: 420, column: 17)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !781, file: !1, line: 433, type: !5)
!781 = distinct !DILexicalBlock(scope: !782, file: !1, line: 433, column: 9)
!782 = distinct !DILexicalBlock(scope: !773, file: !1, line: 433, column: 9)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !784, file: !1, line: 433, type: !5)
!784 = distinct !DILexicalBlock(scope: !781, file: !1, line: 433, column: 9)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !786, file: !1, line: 435, type: !5)
!786 = distinct !DILexicalBlock(scope: !758, file: !1, line: 435, column: 5)
!787 = !DISubprogram(name: "deque_reduce", scope: !1, file: !1, line: 891, type: !711, isLocal: true, isDefinition: true, scopeLine: 892, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*)* @deque_reduce, variables: !788)
!788 = !{!789, !790, !791, !792, !793, !797, !800, !802, !805}
!789 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !787, file: !1, line: 891, type: !350)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !787, file: !1, line: 893, type: !5)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !787, file: !1, line: 893, type: !5)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aslist", scope: !787, file: !1, line: 893, type: !5)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !794, file: !1, line: 901, type: !5)
!794 = distinct !DILexicalBlock(scope: !795, file: !1, line: 901, column: 9)
!795 = distinct !DILexicalBlock(scope: !796, file: !1, line: 900, column: 25)
!796 = distinct !DILexicalBlock(scope: !787, file: !1, line: 900, column: 9)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !798, file: !1, line: 901, type: !5)
!798 = distinct !DILexicalBlock(scope: !799, file: !1, line: 901, column: 9)
!799 = distinct !DILexicalBlock(scope: !794, file: !1, line: 901, column: 9)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !801, file: !1, line: 915, type: !5)
!801 = distinct !DILexicalBlock(scope: !787, file: !1, line: 915, column: 5)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !803, file: !1, line: 915, type: !5)
!803 = distinct !DILexicalBlock(scope: !804, file: !1, line: 915, column: 5)
!804 = distinct !DILexicalBlock(scope: !801, file: !1, line: 915, column: 5)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !806, file: !1, line: 916, type: !5)
!806 = distinct !DILexicalBlock(scope: !787, file: !1, line: 916, column: 5)
!807 = !DISubprogram(name: "deque_remove", scope: !1, file: !1, line: 685, type: !571, isLocal: true, isDefinition: true, scopeLine: 686, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, %struct._object*)* @deque_remove, variables: !808)
!808 = !{!809, !810, !811, !812, !813, !817, !818, !821}
!809 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !807, file: !1, line: 685, type: !350)
!810 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !807, file: !1, line: 685, type: !5)
!811 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !807, file: !1, line: 687, type: !11)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !807, file: !1, line: 687, type: !11)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !814, file: !1, line: 690, type: !5)
!814 = distinct !DILexicalBlock(scope: !815, file: !1, line: 689, column: 27)
!815 = distinct !DILexicalBlock(scope: !816, file: !1, line: 689, column: 5)
!816 = distinct !DILexicalBlock(scope: !807, file: !1, line: 689, column: 5)
!817 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmp", scope: !814, file: !1, line: 691, type: !44)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tgt", scope: !819, file: !1, line: 699, type: !5)
!819 = distinct !DILexicalBlock(scope: !820, file: !1, line: 698, column: 22)
!820 = distinct !DILexicalBlock(scope: !814, file: !1, line: 698, column: 13)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !822, file: !1, line: 701, type: !5)
!822 = distinct !DILexicalBlock(scope: !819, file: !1, line: 701, column: 13)
!823 = !DISubprogram(name: "deque_reviter", scope: !1, file: !1, line: 1364, type: !711, isLocal: true, isDefinition: true, scopeLine: 1365, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*)* @deque_reviter, variables: !824)
!824 = !{!825, !826}
!825 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !823, file: !1, line: 1364, type: !350)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !823, file: !1, line: 1366, type: !374)
!827 = !DISubprogram(name: "deque_reverse", scope: !1, file: !1, line: 597, type: !571, isLocal: true, isDefinition: true, scopeLine: 598, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, %struct._object*)* @deque_reverse, variables: !828)
!828 = !{!829, !830, !831, !832, !833, !834, !835, !836, !837}
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !827, file: !1, line: 597, type: !350)
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !827, file: !1, line: 597, type: !5)
!831 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "leftblock", scope: !827, file: !1, line: 599, type: !356)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rightblock", scope: !827, file: !1, line: 600, type: !356)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "leftindex", scope: !827, file: !1, line: 601, type: !11)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rightindex", scope: !827, file: !1, line: 602, type: !11)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !827, file: !1, line: 603, type: !11)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !827, file: !1, line: 604, type: !11)
!837 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !827, file: !1, line: 605, type: !5)
!838 = !DISubprogram(name: "deque_rotate", scope: !1, file: !1, line: 582, type: !571, isLocal: true, isDefinition: true, scopeLine: 583, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, %struct._object*)* @deque_rotate, variables: !839)
!839 = !{!840, !841, !842}
!840 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !838, file: !1, line: 582, type: !350)
!841 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !838, file: !1, line: 582, type: !5)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !838, file: !1, line: 584, type: !11)
!843 = !DISubprogram(name: "deque_sizeof", scope: !1, file: !1, line: 1060, type: !844, isLocal: true, isDefinition: true, scopeLine: 1061, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, i8*)* @deque_sizeof, variables: !846)
!844 = !DISubroutineType(types: !845)
!845 = !{!5, !350, !4}
!846 = !{!847, !848, !849, !850}
!847 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !843, file: !1, line: 1060, type: !350)
!848 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !843, file: !1, line: 1060, type: !4)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !843, file: !1, line: 1062, type: !11)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blocks", scope: !843, file: !1, line: 1063, type: !11)
!851 = !DISubprogram(name: "deque_get_maxlen", scope: !1, file: !1, line: 1077, type: !711, isLocal: true, isDefinition: true, scopeLine: 1078, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*)* @deque_get_maxlen, variables: !852)
!852 = !{!853}
!853 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !851, file: !1, line: 1077, type: !350)
!854 = !DISubprogram(name: "deque_init", scope: !1, file: !1, line: 1030, type: !855, isLocal: true, isDefinition: true, scopeLine: 1031, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.dequeobject*, %struct._object*, %struct._object*)* @deque_init, variables: !857)
!855 = !DISubroutineType(types: !856)
!856 = !{!44, !350, !5, !5}
!857 = !{!858, !859, !860, !861, !862, !863, !864, !868, !871}
!858 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !854, file: !1, line: 1030, type: !350)
!859 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !854, file: !1, line: 1030, type: !5)
!860 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwdargs", arg: 3, scope: !854, file: !1, line: 1030, type: !5)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iterable", scope: !854, file: !1, line: 1032, type: !5)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxlenobj", scope: !854, file: !1, line: 1033, type: !5)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxlen", scope: !854, file: !1, line: 1034, type: !11)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kwlist", scope: !854, file: !1, line: 1035, type: !865)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 192, align: 64, elements: !866)
!866 = !{!867}
!867 = !DISubrange(count: 3)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !869, file: !1, line: 1051, type: !5)
!869 = distinct !DILexicalBlock(scope: !870, file: !1, line: 1050, column: 27)
!870 = distinct !DILexicalBlock(scope: !854, file: !1, line: 1050, column: 9)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !872, file: !1, line: 1054, type: !5)
!872 = distinct !DILexicalBlock(scope: !869, file: !1, line: 1054, column: 9)
!873 = !DISubprogram(name: "deque_new", scope: !1, file: !1, line: 149, type: !874, isLocal: true, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @deque_new, variables: !878)
!874 = !DISubroutineType(types: !875)
!875 = !{!5, !876, !5, !5}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64, align: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !7, line: 422, baseType: !20)
!878 = !{!879, !880, !881, !882, !883, !884}
!879 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !873, file: !1, line: 149, type: !876)
!880 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !873, file: !1, line: 149, type: !5)
!881 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !873, file: !1, line: 149, type: !5)
!882 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "deque", scope: !873, file: !1, line: 151, type: !350)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !873, file: !1, line: 152, type: !356)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !885, file: !1, line: 161, type: !5)
!885 = distinct !DILexicalBlock(scope: !886, file: !1, line: 161, column: 9)
!886 = distinct !DILexicalBlock(scope: !887, file: !1, line: 160, column: 20)
!887 = distinct !DILexicalBlock(scope: !873, file: !1, line: 160, column: 9)
!888 = !DISubprogram(name: "defdict_dealloc", scope: !1, file: !1, line: 1613, type: !889, isLocal: true, isDefinition: true, scopeLine: 1614, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.defdictobject*)* @defdict_dealloc, variables: !891)
!889 = !DISubroutineType(types: !890)
!890 = !{null, !384}
!891 = !{!892, !893, !895}
!892 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dd", arg: 1, scope: !888, file: !1, line: 1613, type: !384)
!893 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !894, file: !1, line: 1615, type: !5)
!894 = distinct !DILexicalBlock(scope: !888, file: !1, line: 1615, column: 5)
!895 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !896, file: !1, line: 1615, type: !5)
!896 = distinct !DILexicalBlock(scope: !897, file: !1, line: 1615, column: 5)
!897 = distinct !DILexicalBlock(scope: !898, file: !1, line: 1615, column: 5)
!898 = distinct !DILexicalBlock(scope: !894, file: !1, line: 1615, column: 5)
!899 = !DISubprogram(name: "defdict_repr", scope: !1, file: !1, line: 1620, type: !900, isLocal: true, isDefinition: true, scopeLine: 1621, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.defdictobject*)* @defdict_repr, variables: !902)
!900 = !DISubroutineType(types: !901)
!901 = !{!5, !384}
!902 = !{!903, !904, !905, !906, !907, !910, !916, !920, !922}
!903 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dd", arg: 1, scope: !899, file: !1, line: 1620, type: !384)
!904 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "baserepr", scope: !899, file: !1, line: 1622, type: !5)
!905 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "defrepr", scope: !899, file: !1, line: 1623, type: !5)
!906 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !899, file: !1, line: 1624, type: !5)
!907 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "status", scope: !908, file: !1, line: 1632, type: !44)
!908 = distinct !DILexicalBlock(scope: !909, file: !1, line: 1631, column: 5)
!909 = distinct !DILexicalBlock(scope: !899, file: !1, line: 1628, column: 9)
!910 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !911, file: !1, line: 1635, type: !5)
!911 = distinct !DILexicalBlock(scope: !912, file: !1, line: 1635, column: 17)
!912 = distinct !DILexicalBlock(scope: !913, file: !1, line: 1634, column: 29)
!913 = distinct !DILexicalBlock(scope: !914, file: !1, line: 1634, column: 17)
!914 = distinct !DILexicalBlock(scope: !915, file: !1, line: 1633, column: 26)
!915 = distinct !DILexicalBlock(scope: !908, file: !1, line: 1633, column: 13)
!916 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !917, file: !1, line: 1645, type: !5)
!917 = distinct !DILexicalBlock(scope: !918, file: !1, line: 1645, column: 9)
!918 = distinct !DILexicalBlock(scope: !919, file: !1, line: 1644, column: 26)
!919 = distinct !DILexicalBlock(scope: !899, file: !1, line: 1644, column: 9)
!920 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !921, file: !1, line: 1650, type: !5)
!921 = distinct !DILexicalBlock(scope: !899, file: !1, line: 1650, column: 5)
!922 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !923, file: !1, line: 1651, type: !5)
!923 = distinct !DILexicalBlock(scope: !899, file: !1, line: 1651, column: 5)
!924 = !DISubprogram(name: "defdict_traverse", scope: !1, file: !1, line: 1656, type: !261, isLocal: true, isDefinition: true, scopeLine: 1657, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)* @defdict_traverse, variables: !925)
!925 = !{!926, !927, !928, !929}
!926 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !924, file: !1, line: 1656, type: !5)
!927 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !924, file: !1, line: 1656, type: !263)
!928 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !924, file: !1, line: 1656, type: !4)
!929 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !930, file: !1, line: 1658, type: !44)
!930 = distinct !DILexicalBlock(scope: !931, file: !1, line: 1658, column: 5)
!931 = distinct !DILexicalBlock(scope: !932, file: !1, line: 1658, column: 5)
!932 = distinct !DILexicalBlock(scope: !924, file: !1, line: 1658, column: 5)
!933 = !DISubprogram(name: "defdict_tp_clear", scope: !1, file: !1, line: 1663, type: !934, isLocal: true, isDefinition: true, scopeLine: 1664, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.defdictobject*)* @defdict_tp_clear, variables: !936)
!934 = !DISubroutineType(types: !935)
!935 = !{!44, !384}
!936 = !{!937, !938, !940}
