; ModuleID = '_functoolsmodule.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !376, globals: !674)
!1 = !DIFile(filename: "./Modules/_functoolsmodule.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !350, !351, !359, !11, !94, !369}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !7, line: 109, baseType: !8)
!7 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !7, line: 105, size: 128, align: 64, elements: !9)
!9 = !{!10, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !8, file: !7, line: 107, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !12, line: 177, baseType: !13)
!12 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !14, line: 102, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !16, line: 181, baseType: !17)
!16 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !8, file: !7, line: 108, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !7, line: 334, size: 3200, align: 64, elements: !21)
!21 = !{!22, !28, !32, !33, !34, !39, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !20, file: !7, line: 335, baseType: !23, size: 192, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !7, line: 114, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 111, size: 192, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !24, file: !7, line: 112, baseType: !6, size: 128, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !24, file: !7, line: 113, baseType: !11, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !20, file: !7, line: 336, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !20, file: !7, line: 341, baseType: !35, size: 64, align: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !7, line: 308, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !5}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !20, file: !7, line: 342, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !7, line: 314, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !5, !45, !44}
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !14, line: 48, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 246, size: 1728, align: 64, elements: !49)
!48 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!49 = !{!50, !51, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !71, !72, !73, !74, !76, !78, !80, !84, !87, !89, !90, !91, !92, !93, !97, !98}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !48, line: 247, baseType: !44, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !47, file: !48, line: 252, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !47, file: !48, line: 253, baseType: !52, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !47, file: !48, line: 254, baseType: !52, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !47, file: !48, line: 255, baseType: !52, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !47, file: !48, line: 256, baseType: !52, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !47, file: !48, line: 257, baseType: !52, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !47, file: !48, line: 258, baseType: !52, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !47, file: !48, line: 259, baseType: !52, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !47, file: !48, line: 261, baseType: !52, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !47, file: !48, line: 262, baseType: !52, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !47, file: !48, line: 263, baseType: !52, size: 64, align: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !47, file: !48, line: 265, baseType: !64, size: 64, align: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !48, line: 161, size: 192, align: 64, elements: !66)
!66 = !{!67, !68, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !65, file: !48, line: 162, baseType: !64, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !65, file: !48, line: 163, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !65, file: !48, line: 167, baseType: !44, size: 32, align: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !47, file: !48, line: 267, baseType: !69, size: 64, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !47, file: !48, line: 269, baseType: !44, size: 32, align: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !47, file: !48, line: 273, baseType: !44, size: 32, align: 32, offset: 928)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !47, file: !48, line: 275, baseType: !75, size: 64, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !16, line: 140, baseType: !17)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !47, file: !48, line: 279, baseType: !77, size: 16, align: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !47, file: !48, line: 280, baseType: !79, size: 8, align: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !47, file: !48, line: 281, baseType: !81, size: 8, align: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !47, file: !48, line: 285, baseType: !85, size: 64, align: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !48, line: 155, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !47, file: !48, line: 294, baseType: !88, size: 64, align: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !16, line: 141, baseType: !17)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !47, file: !48, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !47, file: !48, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !47, file: !48, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !47, file: !48, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !47, file: !48, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !47, file: !48, line: 309, baseType: !44, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !47, file: !48, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !20, file: !7, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !7, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!5, !5, !52}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !20, file: !7, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !7, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!44, !5, !52, !5}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !20, file: !7, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !20, file: !7, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !7, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!5, !5}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !20, file: !7, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !7, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !7, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !7, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!5, !5, !5}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !7, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !7, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !7, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !7, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !7, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !7, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!5, !5, !5, !5}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !7, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !7, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !7, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !7, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !7, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !7, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!44, !5}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !7, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !7, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !7, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !7, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !7, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !7, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !7, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !7, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !7, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !7, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !7, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !7, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !7, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !7, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !7, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !7, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !7, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !7, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !7, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !7, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !7, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !7, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !7, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !7, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !20, file: !7, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !7, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !7, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !7, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!11, !5}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !7, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !7, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !7, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!5, !5, !11}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !7, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !7, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !7, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !7, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!44, !5, !11, !5}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !7, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !7, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !7, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!44, !5, !5}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !7, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !7, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !20, file: !7, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !7, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !7, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !7, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !7, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !7, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!44, !5, !5, !5}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !20, file: !7, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !7, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !5}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !12, line: 186, baseType: !11)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !20, file: !7, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !20, file: !7, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !20, file: !7, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !7, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !20, file: !7, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !7, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !20, file: !7, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !7, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !7, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !7, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!44, !5, !235, !44}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !7, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !7, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !7, line: 179, baseType: !4, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !7, line: 180, baseType: !5, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !7, line: 181, baseType: !11, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !7, line: 182, baseType: !11, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !7, line: 184, baseType: !44, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !7, line: 185, baseType: !44, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !7, line: 186, baseType: !52, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !7, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !7, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !7, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !7, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !7, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !7, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !5, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !20, file: !7, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !20, file: !7, line: 368, baseType: !29, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !20, file: !7, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !7, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!44, !5, !263, !4}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !7, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!44, !5, !4}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !20, file: !7, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !20, file: !7, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !7, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!5, !5, !5, !44}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !20, file: !7, line: 382, baseType: !11, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !20, file: !7, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !7, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !20, file: !7, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !7, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !20, file: !7, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !29, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !44, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !29, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !20, file: !7, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !291, line: 18, size: 320, align: 64, elements: !292)
!291 = !DIFile(filename: "Include/structmember.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!292 = !{!293, !294, !295, !296, !297}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !291, line: 19, baseType: !52, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !290, file: !291, line: 20, baseType: !44, size: 32, align: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !290, file: !291, line: 21, baseType: !11, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !290, file: !291, line: 22, baseType: !44, size: 32, align: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !290, file: !291, line: 23, baseType: !52, size: 64, align: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !20, file: !7, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !52, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!5, !5, !4}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!44, !5, !5, !4}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !52, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !20, file: !7, line: 392, baseType: !19, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !20, file: !7, line: 393, baseType: !5, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !20, file: !7, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !7, line: 325, baseType: !134)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !20, file: !7, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !7, line: 326, baseType: !210)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !20, file: !7, line: 396, baseType: !11, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !20, file: !7, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !7, line: 327, baseType: !210)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !20, file: !7, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !7, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!5, !19, !11}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !20, file: !7, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !7, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!5, !19, !5, !5}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !20, file: !7, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !7, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !4}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !20, file: !7, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !20, file: !7, line: 402, baseType: !5, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !20, file: !7, line: 403, baseType: !5, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !20, file: !7, line: 404, baseType: !5, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !20, file: !7, line: 405, baseType: !5, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !20, file: !7, line: 406, baseType: !5, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !20, file: !7, line: 407, baseType: !35, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !20, file: !7, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !20, file: !7, line: 412, baseType: !35, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !353, line: 33, baseType: !354)
!353 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!354 = !DICompositeType(tag: DW_TAG_structure_type, file: !353, line: 25, size: 256, align: 64, elements: !355)
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !354, file: !353, line: 26, baseType: !23, size: 192, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !354, file: !353, line: 27, baseType: !358, size: 64, align: 64, offset: 192)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, align: 64, elements: !82)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "partialobject", file: !1, line: 21, baseType: !361)
!361 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 14, size: 448, align: 64, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !361, file: !1, line: 15, baseType: !6, size: 128, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !361, file: !1, line: 16, baseType: !5, size: 64, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !361, file: !1, line: 17, baseType: !5, size: 64, align: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "kw", scope: !361, file: !1, line: 18, baseType: !5, size: 64, align: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !361, file: !1, line: 19, baseType: !5, size: 64, align: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !361, file: !1, line: 20, baseType: !5, size: 64, align: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "keyobject", file: !1, line: 303, baseType: !371)
!371 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 299, size: 256, align: 64, elements: !372)
!372 = !{!373, !374, !375}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !371, file: !1, line: 300, baseType: !6, size: 128, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !371, file: !1, line: 301, baseType: !5, size: 64, align: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !371, file: !1, line: 302, baseType: !5, size: 64, align: 64, offset: 192)
!376 = !{!377, !397, !422, !448, !482, !505, !511, !539, !558, !597, !604, !616, !625, !641, !659}
!377 = !DISubprogram(name: "PyInit__functools", scope: !1, file: !1, line: 569, type: !378, isLocal: false, isDefinition: true, scopeLine: 570, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__functools, variables: !380)
!378 = !DISubroutineType(types: !379)
!379 = !{!5}
!380 = !{!381, !382, !383, !384, !390}
!381 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !377, file: !1, line: 571, type: !44)
!382 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !377, file: !1, line: 572, type: !5)
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !377, file: !1, line: 573, type: !52)
!384 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typelist", scope: !377, file: !1, line: 574, type: !385)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 128, align: 64, elements: !388)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !7, line: 422, baseType: !20)
!388 = !{!389}
!389 = !DISubrange(count: 2)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !391, file: !1, line: 585, type: !5)
!391 = distinct !DILexicalBlock(scope: !392, file: !1, line: 585, column: 13)
!392 = distinct !DILexicalBlock(scope: !393, file: !1, line: 584, column: 44)
!393 = distinct !DILexicalBlock(scope: !394, file: !1, line: 584, column: 13)
!394 = distinct !DILexicalBlock(scope: !395, file: !1, line: 583, column: 43)
!395 = distinct !DILexicalBlock(scope: !396, file: !1, line: 583, column: 5)
!396 = distinct !DILexicalBlock(scope: !377, file: !1, line: 583, column: 5)
!397 = !DISubprogram(name: "partial_dealloc", scope: !1, file: !1, line: 75, type: !398, isLocal: true, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.partialobject*)* @partial_dealloc, variables: !400)
!398 = !DISubroutineType(types: !399)
!399 = !{null, !359}
!400 = !{!401, !402, !404, !407, !409, !412, !414, !417, !419}
!401 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pto", arg: 1, scope: !397, file: !1, line: 75, type: !359)
!402 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !403, file: !1, line: 80, type: !5)
!403 = distinct !DILexicalBlock(scope: !397, file: !1, line: 80, column: 5)
!404 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !405, file: !1, line: 80, type: !5)
!405 = distinct !DILexicalBlock(scope: !406, file: !1, line: 80, column: 5)
!406 = distinct !DILexicalBlock(scope: !403, file: !1, line: 80, column: 5)
!407 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !408, file: !1, line: 81, type: !5)
!408 = distinct !DILexicalBlock(scope: !397, file: !1, line: 81, column: 5)
!409 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !410, file: !1, line: 81, type: !5)
!410 = distinct !DILexicalBlock(scope: !411, file: !1, line: 81, column: 5)
!411 = distinct !DILexicalBlock(scope: !408, file: !1, line: 81, column: 5)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !413, file: !1, line: 82, type: !5)
!413 = distinct !DILexicalBlock(scope: !397, file: !1, line: 82, column: 5)
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !415, file: !1, line: 82, type: !5)
!415 = distinct !DILexicalBlock(scope: !416, file: !1, line: 82, column: 5)
!416 = distinct !DILexicalBlock(scope: !413, file: !1, line: 82, column: 5)
!417 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !418, file: !1, line: 83, type: !5)
!418 = distinct !DILexicalBlock(scope: !397, file: !1, line: 83, column: 5)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !420, file: !1, line: 83, type: !5)
!420 = distinct !DILexicalBlock(scope: !421, file: !1, line: 83, column: 5)
!421 = distinct !DILexicalBlock(scope: !418, file: !1, line: 83, column: 5)
!422 = !DISubprogram(name: "partial_repr", scope: !1, file: !1, line: 164, type: !423, isLocal: true, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.partialobject*)* @partial_repr, variables: !425)
!423 = !DISubroutineType(types: !424)
!424 = !{!5, !359}
!425 = !{!426, !427, !428, !429, !430, !431, !432, !437, !440, !441, !446}
!426 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pto", arg: 1, scope: !422, file: !1, line: 164, type: !359)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !422, file: !1, line: 166, type: !5)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arglist", scope: !422, file: !1, line: 167, type: !5)
!429 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !422, file: !1, line: 168, type: !5)
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !422, file: !1, line: 169, type: !11)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !422, file: !1, line: 169, type: !11)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !433, file: !1, line: 181, type: !5)
!433 = distinct !DILexicalBlock(scope: !434, file: !1, line: 181, column: 9)
!434 = distinct !DILexicalBlock(scope: !435, file: !1, line: 178, column: 29)
!435 = distinct !DILexicalBlock(scope: !436, file: !1, line: 178, column: 5)
!436 = distinct !DILexicalBlock(scope: !422, file: !1, line: 178, column: 5)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !438, file: !1, line: 189, type: !5)
!438 = distinct !DILexicalBlock(scope: !439, file: !1, line: 188, column: 29)
!439 = distinct !DILexicalBlock(scope: !422, file: !1, line: 188, column: 9)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !438, file: !1, line: 189, type: !5)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !442, file: !1, line: 193, type: !5)
!442 = distinct !DILexicalBlock(scope: !443, file: !1, line: 193, column: 13)
!443 = distinct !DILexicalBlock(scope: !444, file: !1, line: 190, column: 62)
!444 = distinct !DILexicalBlock(scope: !445, file: !1, line: 190, column: 9)
!445 = distinct !DILexicalBlock(scope: !438, file: !1, line: 190, column: 9)
!446 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !447, file: !1, line: 201, type: !5)
!447 = distinct !DILexicalBlock(scope: !422, file: !1, line: 201, column: 5)
!448 = !DISubprogram(name: "partial_call", scope: !1, file: !1, line: 88, type: !449, isLocal: true, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.partialobject*, %struct._object*, %struct._object*)* @partial_call, variables: !451)
!449 = !DISubroutineType(types: !450)
!450 = !{!5, !359, !5, !5}
!451 = !{!452, !453, !454, !455, !456, !457, !458, !462, !467, !473, !475, !477, !479}
!452 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pto", arg: 1, scope: !448, file: !1, line: 88, type: !359)
!453 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !448, file: !1, line: 88, type: !5)
!454 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !448, file: !1, line: 88, type: !5)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !448, file: !1, line: 90, type: !5)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "argappl", scope: !448, file: !1, line: 91, type: !5)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kwappl", scope: !448, file: !1, line: 91, type: !5)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !459, file: !1, line: 111, type: !5)
!459 = distinct !DILexicalBlock(scope: !460, file: !1, line: 111, column: 9)
!460 = distinct !DILexicalBlock(scope: !461, file: !1, line: 109, column: 29)
!461 = distinct !DILexicalBlock(scope: !448, file: !1, line: 109, column: 9)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !463, file: !1, line: 115, type: !5)
!463 = distinct !DILexicalBlock(scope: !464, file: !1, line: 115, column: 13)
!464 = distinct !DILexicalBlock(scope: !465, file: !1, line: 114, column: 29)
!465 = distinct !DILexicalBlock(scope: !466, file: !1, line: 114, column: 13)
!466 = distinct !DILexicalBlock(scope: !461, file: !1, line: 112, column: 12)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !468, file: !1, line: 120, type: !5)
!468 = distinct !DILexicalBlock(scope: !469, file: !1, line: 120, column: 17)
!469 = distinct !DILexicalBlock(scope: !470, file: !1, line: 119, column: 51)
!470 = distinct !DILexicalBlock(scope: !471, file: !1, line: 119, column: 17)
!471 = distinct !DILexicalBlock(scope: !472, file: !1, line: 118, column: 25)
!472 = distinct !DILexicalBlock(scope: !466, file: !1, line: 118, column: 13)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !474, file: !1, line: 121, type: !5)
!474 = distinct !DILexicalBlock(scope: !469, file: !1, line: 121, column: 17)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !476, file: !1, line: 128, type: !5)
!476 = distinct !DILexicalBlock(scope: !448, file: !1, line: 128, column: 5)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !478, file: !1, line: 129, type: !5)
!478 = distinct !DILexicalBlock(scope: !448, file: !1, line: 129, column: 5)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !480, file: !1, line: 129, type: !5)
!480 = distinct !DILexicalBlock(scope: !481, file: !1, line: 129, column: 5)
!481 = distinct !DILexicalBlock(scope: !478, file: !1, line: 129, column: 5)
!482 = !DISubprogram(name: "partial_traverse", scope: !1, file: !1, line: 134, type: !483, isLocal: true, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.partialobject*, i32 (%struct._object*, i8*)*, i8*)* @partial_traverse, variables: !485)
!483 = !DISubroutineType(types: !484)
!484 = !{!44, !359, !263, !4}
!485 = !{!486, !487, !488, !489, !493, !497, !501}
!486 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pto", arg: 1, scope: !482, file: !1, line: 134, type: !359)
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !482, file: !1, line: 134, type: !263)
!488 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !482, file: !1, line: 134, type: !4)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !490, file: !1, line: 136, type: !44)
!490 = distinct !DILexicalBlock(scope: !491, file: !1, line: 136, column: 5)
!491 = distinct !DILexicalBlock(scope: !492, file: !1, line: 136, column: 5)
!492 = distinct !DILexicalBlock(scope: !482, file: !1, line: 136, column: 5)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !494, file: !1, line: 137, type: !44)
!494 = distinct !DILexicalBlock(scope: !495, file: !1, line: 137, column: 5)
!495 = distinct !DILexicalBlock(scope: !496, file: !1, line: 137, column: 5)
!496 = distinct !DILexicalBlock(scope: !482, file: !1, line: 137, column: 5)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !498, file: !1, line: 138, type: !44)
!498 = distinct !DILexicalBlock(scope: !499, file: !1, line: 138, column: 5)
!499 = distinct !DILexicalBlock(scope: !500, file: !1, line: 138, column: 5)
!500 = distinct !DILexicalBlock(scope: !482, file: !1, line: 138, column: 5)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !502, file: !1, line: 139, type: !44)
!502 = distinct !DILexicalBlock(scope: !503, file: !1, line: 139, column: 5)
!503 = distinct !DILexicalBlock(scope: !504, file: !1, line: 139, column: 5)
!504 = distinct !DILexicalBlock(scope: !482, file: !1, line: 139, column: 5)
!505 = !DISubprogram(name: "partial_reduce", scope: !1, file: !1, line: 213, type: !506, isLocal: true, isDefinition: true, scopeLine: 214, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.partialobject*, %struct._object*)* @partial_reduce, variables: !508)
!506 = !DISubroutineType(types: !507)
!507 = !{!5, !359, !5}
!508 = !{!509, !510}
!509 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pto", arg: 1, scope: !505, file: !1, line: 213, type: !359)
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !505, file: !1, line: 213, type: !5)
!511 = !DISubprogram(name: "partial_setstate", scope: !1, file: !1, line: 221, type: !506, isLocal: true, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.partialobject*, %struct._object*)* @partial_setstate, variables: !512)
!512 = !{!513, !514, !515, !516, !517, !518, !519, !521, !524, !526, !529, !531, !534, !536}
!513 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pto", arg: 1, scope: !511, file: !1, line: 221, type: !359)
!514 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 2, scope: !511, file: !1, line: 221, type: !5)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fn", scope: !511, file: !1, line: 223, type: !5)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fnargs", scope: !511, file: !1, line: 223, type: !5)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kw", scope: !511, file: !1, line: 223, type: !5)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !511, file: !1, line: 223, type: !5)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !520, file: !1, line: 227, type: !5)
!520 = distinct !DILexicalBlock(scope: !511, file: !1, line: 227, column: 5)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !522, file: !1, line: 227, type: !5)
!522 = distinct !DILexicalBlock(scope: !523, file: !1, line: 227, column: 5)
!523 = distinct !DILexicalBlock(scope: !520, file: !1, line: 227, column: 5)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !525, file: !1, line: 228, type: !5)
!525 = distinct !DILexicalBlock(scope: !511, file: !1, line: 228, column: 5)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !527, file: !1, line: 228, type: !5)
!527 = distinct !DILexicalBlock(scope: !528, file: !1, line: 228, column: 5)
!528 = distinct !DILexicalBlock(scope: !525, file: !1, line: 228, column: 5)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !530, file: !1, line: 229, type: !5)
!530 = distinct !DILexicalBlock(scope: !511, file: !1, line: 229, column: 5)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !532, file: !1, line: 229, type: !5)
!532 = distinct !DILexicalBlock(scope: !533, file: !1, line: 229, column: 5)
!533 = distinct !DILexicalBlock(scope: !530, file: !1, line: 229, column: 5)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !535, file: !1, line: 230, type: !5)
!535 = distinct !DILexicalBlock(scope: !511, file: !1, line: 230, column: 5)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !537, file: !1, line: 230, type: !5)
!537 = distinct !DILexicalBlock(scope: !538, file: !1, line: 230, column: 5)
!538 = distinct !DILexicalBlock(scope: !535, file: !1, line: 230, column: 5)
!539 = !DISubprogram(name: "partial_new", scope: !1, file: !1, line: 26, type: !540, isLocal: true, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @partial_new, variables: !542)
!540 = !DISubroutineType(types: !541)
!541 = !{!5, !386, !5, !5}
!542 = !{!543, !544, !545, !546, !547, !548, !552}
!543 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !539, file: !1, line: 26, type: !386)
!544 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !539, file: !1, line: 26, type: !5)
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !539, file: !1, line: 26, type: !5)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !539, file: !1, line: 28, type: !5)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pto", scope: !539, file: !1, line: 29, type: !359)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !549, file: !1, line: 54, type: !5)
!549 = distinct !DILexicalBlock(scope: !550, file: !1, line: 54, column: 9)
!550 = distinct !DILexicalBlock(scope: !551, file: !1, line: 52, column: 28)
!551 = distinct !DILexicalBlock(scope: !539, file: !1, line: 52, column: 9)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !553, file: !1, line: 60, type: !5)
!553 = distinct !DILexicalBlock(scope: !554, file: !1, line: 60, column: 13)
!554 = distinct !DILexicalBlock(scope: !555, file: !1, line: 59, column: 30)
!555 = distinct !DILexicalBlock(scope: !556, file: !1, line: 59, column: 13)
!556 = distinct !DILexicalBlock(scope: !557, file: !1, line: 57, column: 21)
!557 = distinct !DILexicalBlock(scope: !539, file: !1, line: 57, column: 9)
!558 = !DISubprogram(name: "functools_reduce", scope: !1, file: !1, line: 470, type: !126, isLocal: true, isDefinition: true, scopeLine: 471, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @functools_reduce, variables: !559)
!559 = !{!560, !561, !562, !563, !564, !565, !566, !570, !573, !577, !581, !583, !585, !587, !590, !592, !595}
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !558, file: !1, line: 470, type: !5)
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !558, file: !1, line: 470, type: !5)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seq", scope: !558, file: !1, line: 472, type: !5)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !558, file: !1, line: 472, type: !5)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !558, file: !1, line: 472, type: !5)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !558, file: !1, line: 472, type: !5)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !567, file: !1, line: 484, type: !5)
!567 = distinct !DILexicalBlock(scope: !568, file: !1, line: 484, column: 9)
!568 = distinct !DILexicalBlock(scope: !569, file: !1, line: 480, column: 21)
!569 = distinct !DILexicalBlock(scope: !558, file: !1, line: 480, column: 9)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !571, file: !1, line: 484, type: !5)
!571 = distinct !DILexicalBlock(scope: !572, file: !1, line: 484, column: 9)
!572 = distinct !DILexicalBlock(scope: !567, file: !1, line: 484, column: 9)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op2", scope: !574, file: !1, line: 492, type: !5)
!574 = distinct !DILexicalBlock(scope: !575, file: !1, line: 491, column: 14)
!575 = distinct !DILexicalBlock(scope: !576, file: !1, line: 491, column: 5)
!576 = distinct !DILexicalBlock(scope: !558, file: !1, line: 491, column: 5)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !578, file: !1, line: 495, type: !5)
!578 = distinct !DILexicalBlock(scope: !579, file: !1, line: 495, column: 13)
!579 = distinct !DILexicalBlock(scope: !580, file: !1, line: 494, column: 34)
!580 = distinct !DILexicalBlock(scope: !574, file: !1, line: 494, column: 13)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !582, file: !1, line: 517, type: !5)
!582 = distinct !DILexicalBlock(scope: !558, file: !1, line: 517, column: 5)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !584, file: !1, line: 523, type: !5)
!584 = distinct !DILexicalBlock(scope: !558, file: !1, line: 523, column: 5)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !586, file: !1, line: 527, type: !5)
!586 = distinct !DILexicalBlock(scope: !558, file: !1, line: 527, column: 5)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !588, file: !1, line: 527, type: !5)
!588 = distinct !DILexicalBlock(scope: !589, file: !1, line: 527, column: 5)
!589 = distinct !DILexicalBlock(scope: !586, file: !1, line: 527, column: 5)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !591, file: !1, line: 528, type: !5)
!591 = distinct !DILexicalBlock(scope: !558, file: !1, line: 528, column: 5)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !593, file: !1, line: 528, type: !5)
!593 = distinct !DILexicalBlock(scope: !594, file: !1, line: 528, column: 5)
!594 = distinct !DILexicalBlock(scope: !591, file: !1, line: 528, column: 5)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !596, file: !1, line: 529, type: !5)
!596 = distinct !DILexicalBlock(scope: !558, file: !1, line: 529, column: 5)
!597 = !DISubprogram(name: "functools_cmp_to_key", scope: !1, file: !1, line: 447, type: !135, isLocal: true, isDefinition: true, scopeLine: 448, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @functools_cmp_to_key, variables: !598)
!598 = !{!599, !600, !601, !602, !603}
!599 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !597, file: !1, line: 447, type: !5)
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !597, file: !1, line: 447, type: !5)
!601 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !597, file: !1, line: 447, type: !5)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmp", scope: !597, file: !1, line: 449, type: !5)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "object", scope: !597, file: !1, line: 451, type: !369)
!604 = !DISubprogram(name: "keyobject_dealloc", scope: !1, file: !1, line: 306, type: !605, isLocal: true, isDefinition: true, scopeLine: 307, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.keyobject*)* @keyobject_dealloc, variables: !607)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !369}
!607 = !{!608, !609, !611, !613}
!608 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ko", arg: 1, scope: !604, file: !1, line: 306, type: !369)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !610, file: !1, line: 308, type: !5)
!610 = distinct !DILexicalBlock(scope: !604, file: !1, line: 308, column: 5)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !612, file: !1, line: 309, type: !5)
!612 = distinct !DILexicalBlock(scope: !604, file: !1, line: 309, column: 5)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !614, file: !1, line: 309, type: !5)
!614 = distinct !DILexicalBlock(scope: !615, file: !1, line: 309, column: 5)
!615 = distinct !DILexicalBlock(scope: !612, file: !1, line: 309, column: 5)
!616 = !DISubprogram(name: "keyobject_call", scope: !1, file: !1, line: 379, type: !617, isLocal: true, isDefinition: true, scopeLine: 380, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.keyobject*, %struct._object*, %struct._object*)* @keyobject_call, variables: !619)
!617 = !DISubroutineType(types: !618)
!618 = !{!5, !369, !5, !5}
!619 = !{!620, !621, !622, !623, !624}
!620 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ko", arg: 1, scope: !616, file: !1, line: 379, type: !369)
!621 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !616, file: !1, line: 379, type: !5)
!622 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !616, file: !1, line: 379, type: !5)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "object", scope: !616, file: !1, line: 381, type: !5)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !616, file: !1, line: 382, type: !369)
!625 = !DISubprogram(name: "keyobject_traverse", scope: !1, file: !1, line: 314, type: !626, isLocal: true, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.keyobject*, i32 (%struct._object*, i8*)*, i8*)* @keyobject_traverse, variables: !628)
!626 = !DISubroutineType(types: !627)
!627 = !{!44, !369, !263, !4}
!628 = !{!629, !630, !631, !632, !636}
!629 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ko", arg: 1, scope: !625, file: !1, line: 314, type: !369)
!630 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !625, file: !1, line: 314, type: !263)
!631 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !625, file: !1, line: 314, type: !4)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !633, file: !1, line: 316, type: !44)
!633 = distinct !DILexicalBlock(scope: !634, file: !1, line: 316, column: 5)
!634 = distinct !DILexicalBlock(scope: !635, file: !1, line: 316, column: 5)
!635 = distinct !DILexicalBlock(scope: !625, file: !1, line: 316, column: 5)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !637, file: !1, line: 318, type: !44)
!637 = distinct !DILexicalBlock(scope: !638, file: !1, line: 318, column: 9)
!638 = distinct !DILexicalBlock(scope: !639, file: !1, line: 318, column: 9)
!639 = distinct !DILexicalBlock(scope: !640, file: !1, line: 318, column: 9)
!640 = distinct !DILexicalBlock(scope: !625, file: !1, line: 317, column: 9)
!641 = !DISubprogram(name: "keyobject_clear", scope: !1, file: !1, line: 323, type: !642, isLocal: true, isDefinition: true, scopeLine: 324, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.keyobject*)* @keyobject_clear, variables: !644)
!642 = !DISubroutineType(types: !643)
!643 = !{!44, !369}
!644 = !{!645, !646, !648, !652, !655}
!645 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ko", arg: 1, scope: !641, file: !1, line: 323, type: !369)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !647, file: !1, line: 325, type: !5)
!647 = distinct !DILexicalBlock(scope: !641, file: !1, line: 325, column: 5)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !649, file: !1, line: 325, type: !5)
!649 = distinct !DILexicalBlock(scope: !650, file: !1, line: 325, column: 5)
!650 = distinct !DILexicalBlock(scope: !651, file: !1, line: 325, column: 5)
!651 = distinct !DILexicalBlock(scope: !647, file: !1, line: 325, column: 5)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !653, file: !1, line: 327, type: !5)
!653 = distinct !DILexicalBlock(scope: !654, file: !1, line: 327, column: 9)
!654 = distinct !DILexicalBlock(scope: !641, file: !1, line: 326, column: 9)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !656, file: !1, line: 327, type: !5)
!656 = distinct !DILexicalBlock(scope: !657, file: !1, line: 327, column: 9)
!657 = distinct !DILexicalBlock(scope: !658, file: !1, line: 327, column: 9)
!658 = distinct !DILexicalBlock(scope: !653, file: !1, line: 327, column: 9)
!659 = !DISubprogram(name: "keyobject_richcompare", scope: !1, file: !1, line: 398, type: !271, isLocal: true, isDefinition: true, scopeLine: 399, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @keyobject_richcompare, variables: !660)
!660 = !{!661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !672}
!661 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ko", arg: 1, scope: !659, file: !1, line: 398, type: !5)
!662 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "other", arg: 2, scope: !659, file: !1, line: 398, type: !5)
!663 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !659, file: !1, line: 398, type: !44)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !659, file: !1, line: 400, type: !5)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !659, file: !1, line: 401, type: !5)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !659, file: !1, line: 402, type: !5)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !659, file: !1, line: 403, type: !5)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "compare", scope: !659, file: !1, line: 404, type: !5)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "answer", scope: !659, file: !1, line: 405, type: !5)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !671, file: !1, line: 438, type: !5)
!671 = distinct !DILexicalBlock(scope: !659, file: !1, line: 438, column: 5)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !673, file: !1, line: 442, type: !5)
!673 = distinct !DILexicalBlock(scope: !659, file: !1, line: 442, column: 5)
!674 = !{!675, !676, !680, !685, !690, !693, !715, !719, !720, !724, !726, !727, !728, !729, !731}
!675 = !DIGlobalVariable(name: "partial_type", scope: !0, file: !1, line: 252, type: !387, isLocal: true, isDefinition: true, variable: %struct._typeobject* @partial_type)
!676 = !DIGlobalVariable(name: "partial_doc", scope: !0, file: !1, line: 143, type: !677, isLocal: true, isDefinition: true, variable: [115 x i8]* @partial_doc)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 920, align: 8, elements: !678)
!678 = !{!679}
!679 = !DISubrange(count: 115)
!680 = !DIGlobalVariable(name: "partial_methods", scope: !0, file: !1, line: 246, type: !681, isLocal: true, isDefinition: true, variable: [3 x %struct.PyMethodDef]* @partial_methods)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 768, align: 64, elements: !683)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !281, line: 47, baseType: !280)
!683 = !{!684}
!684 = !DISubrange(count: 3)
!685 = !DIGlobalVariable(name: "partial_memberlist", scope: !0, file: !1, line: 148, type: !686, isLocal: true, isDefinition: true, variable: [4 x %struct.PyMemberDef]* @partial_memberlist)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !687, size: 1280, align: 64, elements: !688)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !291, line: 24, baseType: !290)
!688 = !{!689}
!689 = !DISubrange(count: 4)
!690 = !DIGlobalVariable(name: "partial_getsetlist", scope: !0, file: !1, line: 158, type: !691, isLocal: true, isDefinition: true, variable: [2 x %struct.PyGetSetDef]* @partial_getsetlist)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !692, size: 640, align: 64, elements: !388)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !301, line: 17, baseType: !300)
!693 = !DIGlobalVariable(name: "_functoolsmodule", scope: !0, file: !1, line: 556, type: !694, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @_functoolsmodule)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !695, line: 47, size: 832, align: 64, elements: !696)
!695 = !DIFile(filename: "Include/moduleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!696 = !{!697, !706, !707, !708, !709, !711, !712, !713, !714}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !694, file: !695, line: 48, baseType: !698, size: 320, align: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !695, line: 38, baseType: !699)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !695, line: 33, size: 320, align: 64, elements: !700)
!700 = !{!701, !702, !704, !705}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !699, file: !695, line: 34, baseType: !6, size: 128, align: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !699, file: !695, line: 35, baseType: !703, size: 64, align: 64, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !699, file: !695, line: 36, baseType: !11, size: 64, align: 64, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !699, file: !695, line: 37, baseType: !5, size: 64, align: 64, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !694, file: !695, line: 49, baseType: !29, size: 64, align: 64, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !694, file: !695, line: 50, baseType: !29, size: 64, align: 64, offset: 384)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !694, file: !695, line: 51, baseType: !11, size: 64, align: 64, offset: 448)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !694, file: !695, line: 52, baseType: !710, size: 64, align: 64, offset: 512)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64, align: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !694, file: !695, line: 53, baseType: !142, size: 64, align: 64, offset: 576)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !694, file: !695, line: 54, baseType: !259, size: 64, align: 64, offset: 640)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !694, file: !695, line: 55, baseType: !142, size: 64, align: 64, offset: 704)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !694, file: !695, line: 56, baseType: !336, size: 64, align: 64, offset: 768)
!715 = !DIGlobalVariable(name: "module_doc", scope: !0, file: !1, line: 545, type: !716, isLocal: true, isDefinition: true, variable: [33 x i8]* @module_doc)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 264, align: 8, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 33)
!719 = !DIGlobalVariable(name: "module_methods", scope: !0, file: !1, line: 548, type: !681, isLocal: true, isDefinition: true, variable: [3 x %struct.PyMethodDef]* @module_methods)
!720 = !DIGlobalVariable(name: "functools_reduce_doc", scope: !0, file: !1, line: 533, type: !721, isLocal: true, isDefinition: true, variable: [418 x i8]* @functools_reduce_doc)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 3344, align: 8, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 418)
!724 = !DIGlobalVariable(name: "kwargs", scope: !597, file: !1, line: 450, type: !725, isLocal: true, isDefinition: true, variable: [2 x i8*]* @functools_cmp_to_key.kwargs)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 128, align: 64, elements: !388)
!726 = !DIGlobalVariable(name: "keyobject_type", scope: !0, file: !1, line: 344, type: !387, isLocal: true, isDefinition: true, variable: %struct._typeobject* @keyobject_type)
!727 = !DIGlobalVariable(name: "kwargs", scope: !616, file: !1, line: 383, type: !725, isLocal: true, isDefinition: true, variable: [2 x i8*]* @keyobject_call.kwargs)
!728 = !DIGlobalVariable(name: "zero", scope: !659, file: !1, line: 406, type: !5, isLocal: true, isDefinition: true, variable: %struct._object** @keyobject_richcompare.zero)
!729 = !DIGlobalVariable(name: "keyobject_members", scope: !0, file: !1, line: 331, type: !730, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMemberDef]* @keyobject_members)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !687, size: 640, align: 64, elements: !388)
!731 = !DIGlobalVariable(name: "functools_cmp_to_key_doc", scope: !0, file: !1, line: 464, type: !732, isLocal: true, isDefinition: true, variable: [46 x i8]* @functools_cmp_to_key_doc)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 368, align: 8, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 46)
!735 = !{i32 2, !"Dwarf Version", i32 4}
!736 = !{i32 2, !"Debug Info Version", i32 3}
!737 = !{!"clang version 3.7.0 (tags/RELEASE_370/final)"}
!738 = !DIExpression()
!739 = !DILocation(line: 574, column: 19, scope: !377)
!740 = !DILocation(line: 579, column: 9, scope: !377)
!741 = !DILocation(line: 572, column: 15, scope: !377)
!742 = !DILocation(line: 580, column: 11, scope: !743)
!743 = distinct !DILexicalBlock(scope: !377, file: !1, line: 580, column: 9)
!744 = !DILocation(line: 580, column: 9, scope: !377)
!745 = !DILocation(line: 584, column: 13, scope: !393)
!746 = !DILocation(line: 584, column: 39, scope: !393)
!747 = !DILocation(line: 584, column: 13, scope: !394)
!748 = !DILocation(line: 585, column: 13, scope: !749)
!749 = !DILexicalBlockFile(scope: !391, file: !1, discriminator: 1)
!750 = !DILocation(line: 585, column: 13, scope: !751)
!751 = distinct !DILexicalBlock(scope: !391, file: !1, line: 585, column: 13)
!752 = !{!753, !754, i64 0}
!753 = !{!"_object", !754, i64 0, !757, i64 8}
!754 = !{!"long", !755, i64 0}
!755 = !{!"omnipotent char", !756, i64 0}
!756 = !{!"Simple C/C++ TBAA"}
!757 = !{!"any pointer", !755, i64 0}
!758 = !DILocation(line: 585, column: 13, scope: !391)
!759 = !DILocation(line: 585, column: 13, scope: !760)
!760 = !DILexicalBlockFile(scope: !751, file: !1, discriminator: 3)
!761 = !{!753, !757, i64 8}
!762 = !{!763, !757, i64 48}
