; ModuleID = '_iomodule.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !369, globals: !673)
!1 = !DIFile(filename: "./Modules/_io/_iomodule.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !12, !15, !247, !350, !358, !55}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !6, line: 177, baseType: !7)
!6 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !8, line: 102, baseType: !9)
!8 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !10, line: 181, baseType: !11)
!10 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!11 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !13, line: 62, baseType: !14)
!13 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!14 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !17, line: 109, baseType: !18)
!17 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !17, line: 105, size: 128, align: 64, elements: !19)
!19 = !{!20, !21}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !18, file: !17, line: 107, baseType: !5, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !18, file: !17, line: 108, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !17, line: 334, size: 3200, align: 64, elements: !24)
!24 = !{!25, !31, !35, !36, !37, !42, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !23, file: !17, line: 335, baseType: !26, size: 192, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !17, line: 114, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 111, size: 192, align: 64, elements: !28)
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !27, file: !17, line: 112, baseType: !16, size: 128, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !27, file: !17, line: 113, baseType: !5, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !23, file: !17, line: 336, baseType: !32, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !23, file: !17, line: 337, baseType: !5, size: 64, align: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !23, file: !17, line: 337, baseType: !5, size: 64, align: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !23, file: !17, line: 341, baseType: !38, size: 64, align: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !17, line: 308, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !15}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !23, file: !17, line: 342, baseType: !43, size: 64, align: 64, offset: 448)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !17, line: 314, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !15, !48, !47}
!47 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !8, line: 48, baseType: !50)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !51, line: 246, size: 1728, align: 64, elements: !52)
!51 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!52 = !{!53, !54, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !74, !75, !76, !77, !79, !81, !83, !87, !90, !92, !93, !94, !95, !96, !97, !98}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !50, file: !51, line: 247, baseType: !47, size: 32, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !50, file: !51, line: 252, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !50, file: !51, line: 253, baseType: !55, size: 64, align: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !50, file: !51, line: 254, baseType: !55, size: 64, align: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !50, file: !51, line: 255, baseType: !55, size: 64, align: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !50, file: !51, line: 256, baseType: !55, size: 64, align: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !50, file: !51, line: 257, baseType: !55, size: 64, align: 64, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !50, file: !51, line: 258, baseType: !55, size: 64, align: 64, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !50, file: !51, line: 259, baseType: !55, size: 64, align: 64, offset: 512)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !50, file: !51, line: 261, baseType: !55, size: 64, align: 64, offset: 576)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !50, file: !51, line: 262, baseType: !55, size: 64, align: 64, offset: 640)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !50, file: !51, line: 263, baseType: !55, size: 64, align: 64, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !50, file: !51, line: 265, baseType: !67, size: 64, align: 64, offset: 768)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !51, line: 161, size: 192, align: 64, elements: !69)
!69 = !{!70, !71, !73}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !68, file: !51, line: 162, baseType: !67, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !68, file: !51, line: 163, baseType: !72, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !68, file: !51, line: 167, baseType: !47, size: 32, align: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !50, file: !51, line: 267, baseType: !72, size: 64, align: 64, offset: 832)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !50, file: !51, line: 269, baseType: !47, size: 32, align: 32, offset: 896)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !50, file: !51, line: 273, baseType: !47, size: 32, align: 32, offset: 928)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !50, file: !51, line: 275, baseType: !78, size: 64, align: 64, offset: 960)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !10, line: 140, baseType: !11)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !50, file: !51, line: 279, baseType: !80, size: 16, align: 16, offset: 1024)
!80 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !50, file: !51, line: 280, baseType: !82, size: 8, align: 8, offset: 1040)
!82 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !50, file: !51, line: 281, baseType: !84, size: 8, align: 8, offset: 1048)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 8, align: 8, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 1)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !50, file: !51, line: 285, baseType: !88, size: 64, align: 64, offset: 1088)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !51, line: 155, baseType: null)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !50, file: !51, line: 294, baseType: !91, size: 64, align: 64, offset: 1152)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !10, line: 141, baseType: !11)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !50, file: !51, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !50, file: !51, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !50, file: !51, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !50, file: !51, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !50, file: !51, line: 307, baseType: !12, size: 64, align: 64, offset: 1472)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !50, file: !51, line: 309, baseType: !47, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !50, file: !51, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !23, file: !17, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !17, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!15, !15, !55}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !23, file: !17, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !17, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!47, !15, !55, !15}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !23, file: !17, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !23, file: !17, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !17, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!15, !15}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !23, file: !17, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !17, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !17, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !17, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!15, !15, !15}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !17, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !17, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !17, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !17, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !17, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !17, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!15, !15, !15, !15}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !17, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !17, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !17, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !17, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !17, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !17, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!47, !15}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !17, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !17, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !17, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !17, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !17, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !17, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !17, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !17, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !17, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !17, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !17, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !17, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !17, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !17, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !17, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !17, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !17, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !17, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !17, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !17, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !17, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !17, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !17, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !17, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !23, file: !17, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !17, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !17, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !17, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!5, !15}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !17, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !17, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !17, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!15, !15, !5}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !17, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !17, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !17, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !17, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!47, !15, !5, !15}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !17, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !17, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !17, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!47, !15, !15}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !17, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !17, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !23, file: !17, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !17, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !17, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !17, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !17, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !17, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!47, !15, !15, !15}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !23, file: !17, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !17, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !15}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !6, line: 186, baseType: !5)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !23, file: !17, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !23, file: !17, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !23, file: !17, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !17, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !23, file: !17, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !17, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !23, file: !17, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !17, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !17, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !17, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!47, !15, !235, !47}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !17, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !17, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !17, line: 179, baseType: !4, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !17, line: 180, baseType: !15, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !17, line: 181, baseType: !5, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !17, line: 182, baseType: !5, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !17, line: 184, baseType: !47, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !17, line: 185, baseType: !47, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !17, line: 186, baseType: !55, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !17, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !17, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !17, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !17, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !17, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !17, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !15, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !23, file: !17, line: 366, baseType: !14, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !23, file: !17, line: 368, baseType: !32, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !23, file: !17, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !17, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!47, !15, !263, !4}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !17, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!47, !15, !4}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !23, file: !17, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !23, file: !17, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !17, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!15, !15, !15, !47}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !23, file: !17, line: 382, baseType: !5, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !23, file: !17, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !17, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !23, file: !17, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !17, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !23, file: !17, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !32, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !47, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !32, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !23, file: !17, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !291, line: 18, size: 320, align: 64, elements: !292)
!291 = !DIFile(filename: "Include/structmember.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!292 = !{!293, !294, !295, !296, !297}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !291, line: 19, baseType: !55, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !290, file: !291, line: 20, baseType: !47, size: 32, align: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !290, file: !291, line: 21, baseType: !5, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !290, file: !291, line: 22, baseType: !47, size: 32, align: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !290, file: !291, line: 23, baseType: !55, size: 64, align: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !23, file: !17, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !55, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!15, !15, !4}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!47, !15, !15, !4}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !55, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !23, file: !17, line: 392, baseType: !22, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !23, file: !17, line: 393, baseType: !15, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !23, file: !17, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !17, line: 325, baseType: !134)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !23, file: !17, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !17, line: 326, baseType: !210)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !23, file: !17, line: 396, baseType: !5, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !23, file: !17, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !17, line: 327, baseType: !210)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !23, file: !17, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !17, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!15, !22, !5}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !23, file: !17, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !17, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!15, !22, !15, !15}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !23, file: !17, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !17, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !4}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !23, file: !17, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !23, file: !17, line: 402, baseType: !15, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !23, file: !17, line: 403, baseType: !15, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !23, file: !17, line: 404, baseType: !15, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !23, file: !17, line: 405, baseType: !15, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !23, file: !17, line: 406, baseType: !15, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !23, file: !17, line: 407, baseType: !38, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !23, file: !17, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !23, file: !17, line: 412, baseType: !38, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyIO_State", file: !352, line: 135, baseType: !353)
!352 = !DIFile(filename: "./Modules/_io/_iomodule.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!353 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 130, size: 192, align: 64, elements: !354)
!354 = !{!355, !356, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !353, file: !352, line: 131, baseType: !47, size: 32, align: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "locale_module", scope: !353, file: !352, line: 132, baseType: !15, size: 64, align: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "unsupported_operation", scope: !353, file: !352, line: 134, baseType: !15, size: 64, align: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyWeakReference", file: !360, line: 10, baseType: !361)
!360 = !DIFile(filename: "Include/weakrefobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyWeakReference", file: !360, line: 16, size: 448, align: 64, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !361, file: !360, line: 17, baseType: !16, size: 128, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "wr_object", scope: !361, file: !360, line: 23, baseType: !15, size: 64, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "wr_callback", scope: !361, file: !360, line: 26, baseType: !15, size: 64, align: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !361, file: !360, line: 31, baseType: !218, size: 64, align: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "wr_prev", scope: !361, file: !360, line: 38, baseType: !358, size: 64, align: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "wr_next", scope: !361, file: !360, line: 39, baseType: !358, size: 64, align: 64, offset: 384)
!369 = !{!370, !383, !388, !394, !412, !477, !610, !637, !653, !670}
!370 = !DISubprogram(name: "PyNumber_AsOff_t", scope: !1, file: !1, line: 475, type: !371, isLocal: false, isDefinition: true, scopeLine: 476, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*, %struct._object*)* @PyNumber_AsOff_t, variables: !375)
!371 = !DISubroutineType(types: !372)
!372 = !{!373, !15, !15}
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_off_t", file: !352, line: 94, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !8, line: 92, baseType: !91)
!375 = !{!376, !377, !378, !379, !380, !381}
!376 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 1, scope: !370, file: !1, line: 475, type: !15)
!377 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "err", arg: 2, scope: !370, file: !1, line: 475, type: !15)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !370, file: !1, line: 477, type: !373)
!379 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "runerr", scope: !370, file: !1, line: 478, type: !15)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !370, file: !1, line: 479, type: !15)
!381 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !382, file: !1, line: 514, type: !15)
!382 = distinct !DILexicalBlock(scope: !370, file: !1, line: 514, column: 5)
!383 = !DISubprogram(name: "_PyIO_ConvertSsize_t", scope: !1, file: !1, line: 521, type: !265, isLocal: false, isDefinition: true, scopeLine: 521, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*)* @_PyIO_ConvertSsize_t, variables: !384)
!384 = !{!385, !386, !387}
!385 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !383, file: !1, line: 521, type: !15)
!386 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "result", arg: 2, scope: !383, file: !1, line: 521, type: !4)
!387 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "limit", scope: !383, file: !1, line: 522, type: !5)
!388 = !DISubprogram(name: "_PyIO_get_module_state", scope: !1, file: !1, line: 543, type: !389, isLocal: false, isDefinition: true, scopeLine: 544, flags: DIFlagPrototyped, isOptimized: true, function: %struct._PyIO_State* ()* @_PyIO_get_module_state, variables: !391)
!389 = !DISubroutineType(types: !390)
!390 = !{!350}
!391 = !{!392, !393}
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !388, file: !1, line: 545, type: !15)
!393 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !388, file: !1, line: 546, type: !350)
!394 = !DISubprogram(name: "_PyIO_get_locale_module", scope: !1, file: !1, line: 557, type: !395, isLocal: false, isDefinition: true, scopeLine: 558, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._PyIO_State*)* @_PyIO_get_locale_module, variables: !397)
!395 = !DISubroutineType(types: !396)
!396 = !{!15, !350}
!397 = !{!398, !399, !400, !404, !408}
!398 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !394, file: !1, line: 557, type: !350)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !394, file: !1, line: 559, type: !15)
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !401, file: !1, line: 567, type: !15)
!401 = distinct !DILexicalBlock(scope: !402, file: !1, line: 567, column: 9)
!402 = distinct !DILexicalBlock(scope: !403, file: !1, line: 560, column: 39)
!403 = distinct !DILexicalBlock(scope: !394, file: !1, line: 560, column: 9)
!404 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !405, file: !1, line: 567, type: !15)
!405 = distinct !DILexicalBlock(scope: !406, file: !1, line: 567, column: 9)
!406 = distinct !DILexicalBlock(scope: !407, file: !1, line: 567, column: 9)
!407 = distinct !DILexicalBlock(scope: !401, file: !1, line: 567, column: 9)
!408 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !409, file: !1, line: 574, type: !15)
!409 = distinct !DILexicalBlock(scope: !410, file: !1, line: 574, column: 9)
!410 = distinct !DILexicalBlock(scope: !411, file: !1, line: 573, column: 39)
!411 = distinct !DILexicalBlock(scope: !394, file: !1, line: 573, column: 9)
!412 = !DISubprogram(name: "PyInit__io", scope: !1, file: !1, line: 633, type: !413, isLocal: false, isDefinition: true, scopeLine: 634, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__io, variables: !415)
!413 = !DISubroutineType(types: !414)
!414 = !{!15}
!415 = !{!416, !417, !418, !422, !426, !430, !434, !438, !442, !446, !450, !454, !458, !462, !466, !470, !472, !475}
!416 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !412, file: !1, line: 635, type: !15)
!417 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !412, file: !1, line: 636, type: !350)
!418 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !419, file: !1, line: 675, type: !15)
!419 = distinct !DILexicalBlock(scope: !420, file: !1, line: 675, column: 5)
!420 = distinct !DILexicalBlock(scope: !421, file: !1, line: 675, column: 5)
!421 = distinct !DILexicalBlock(scope: !412, file: !1, line: 675, column: 5)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !423, file: !1, line: 676, type: !15)
!423 = distinct !DILexicalBlock(scope: !424, file: !1, line: 676, column: 5)
!424 = distinct !DILexicalBlock(scope: !425, file: !1, line: 676, column: 5)
!425 = distinct !DILexicalBlock(scope: !412, file: !1, line: 676, column: 5)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !427, file: !1, line: 677, type: !15)
!427 = distinct !DILexicalBlock(scope: !428, file: !1, line: 677, column: 5)
!428 = distinct !DILexicalBlock(scope: !429, file: !1, line: 677, column: 5)
!429 = distinct !DILexicalBlock(scope: !412, file: !1, line: 677, column: 5)
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !431, file: !1, line: 678, type: !15)
!431 = distinct !DILexicalBlock(scope: !432, file: !1, line: 678, column: 5)
!432 = distinct !DILexicalBlock(scope: !433, file: !1, line: 678, column: 5)
!433 = distinct !DILexicalBlock(scope: !412, file: !1, line: 678, column: 5)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !435, file: !1, line: 683, type: !15)
!435 = distinct !DILexicalBlock(scope: !436, file: !1, line: 683, column: 5)
!436 = distinct !DILexicalBlock(scope: !437, file: !1, line: 683, column: 5)
!437 = distinct !DILexicalBlock(scope: !412, file: !1, line: 683, column: 5)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !439, file: !1, line: 687, type: !15)
!439 = distinct !DILexicalBlock(scope: !440, file: !1, line: 687, column: 5)
!440 = distinct !DILexicalBlock(scope: !441, file: !1, line: 687, column: 5)
!441 = distinct !DILexicalBlock(scope: !412, file: !1, line: 687, column: 5)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !443, file: !1, line: 693, type: !15)
!443 = distinct !DILexicalBlock(scope: !444, file: !1, line: 693, column: 5)
!444 = distinct !DILexicalBlock(scope: !445, file: !1, line: 693, column: 5)
!445 = distinct !DILexicalBlock(scope: !412, file: !1, line: 693, column: 5)
!446 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !447, file: !1, line: 697, type: !15)
!447 = distinct !DILexicalBlock(scope: !448, file: !1, line: 697, column: 5)
!448 = distinct !DILexicalBlock(scope: !449, file: !1, line: 697, column: 5)
!449 = distinct !DILexicalBlock(scope: !412, file: !1, line: 697, column: 5)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !451, file: !1, line: 701, type: !15)
!451 = distinct !DILexicalBlock(scope: !452, file: !1, line: 701, column: 5)
!452 = distinct !DILexicalBlock(scope: !453, file: !1, line: 701, column: 5)
!453 = distinct !DILexicalBlock(scope: !412, file: !1, line: 701, column: 5)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !455, file: !1, line: 705, type: !15)
!455 = distinct !DILexicalBlock(scope: !456, file: !1, line: 705, column: 5)
!456 = distinct !DILexicalBlock(scope: !457, file: !1, line: 705, column: 5)
!457 = distinct !DILexicalBlock(scope: !412, file: !1, line: 705, column: 5)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !459, file: !1, line: 709, type: !15)
!459 = distinct !DILexicalBlock(scope: !460, file: !1, line: 709, column: 5)
!460 = distinct !DILexicalBlock(scope: !461, file: !1, line: 709, column: 5)
!461 = distinct !DILexicalBlock(scope: !412, file: !1, line: 709, column: 5)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !463, file: !1, line: 713, type: !15)
!463 = distinct !DILexicalBlock(scope: !464, file: !1, line: 713, column: 5)
!464 = distinct !DILexicalBlock(scope: !465, file: !1, line: 713, column: 5)
!465 = distinct !DILexicalBlock(scope: !412, file: !1, line: 713, column: 5)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !467, file: !1, line: 716, type: !15)
!467 = distinct !DILexicalBlock(scope: !468, file: !1, line: 716, column: 5)
!468 = distinct !DILexicalBlock(scope: !469, file: !1, line: 716, column: 5)
!469 = distinct !DILexicalBlock(scope: !412, file: !1, line: 716, column: 5)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !471, file: !1, line: 767, type: !15)
!471 = distinct !DILexicalBlock(scope: !412, file: !1, line: 767, column: 5)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !473, file: !1, line: 767, type: !15)
!473 = distinct !DILexicalBlock(scope: !474, file: !1, line: 767, column: 5)
!474 = distinct !DILexicalBlock(scope: !471, file: !1, line: 767, column: 5)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !476, file: !1, line: 768, type: !15)
!476 = distinct !DILexicalBlock(scope: !412, file: !1, line: 768, column: 5)
!477 = !DISubprogram(name: "io_open", scope: !1, file: !1, line: 221, type: !135, isLocal: true, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @io_open, variables: !478)
!478 = !{!479, !480, !481, !482, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !507, !508, !509, !510, !511, !512, !513, !514, !518, !520, !522, !562, !563, !564, !566, !570, !572, !574, !578, !582, !584, !588, !590, !592, !595, !597, !600, !602, !605, !607}
!479 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !477, file: !1, line: 221, type: !15)
!480 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !477, file: !1, line: 221, type: !15)
!481 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !477, file: !1, line: 221, type: !15)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kwlist", scope: !477, file: !1, line: 223, type: !483)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 576, align: 64, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 9)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file", scope: !477, file: !1, line: 226, type: !15)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "opener", scope: !477, file: !1, line: 226, type: !15)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !477, file: !1, line: 227, type: !55)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffering", scope: !477, file: !1, line: 228, type: !47)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "closefd", scope: !477, file: !1, line: 228, type: !47)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "encoding", scope: !477, file: !1, line: 229, type: !55)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !477, file: !1, line: 229, type: !55)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newline", scope: !477, file: !1, line: 229, type: !55)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !477, file: !1, line: 230, type: !348)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "creating", scope: !477, file: !1, line: 232, type: !47)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reading", scope: !477, file: !1, line: 232, type: !47)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "writing", scope: !477, file: !1, line: 232, type: !47)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "appending", scope: !477, file: !1, line: 232, type: !47)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "updating", scope: !477, file: !1, line: 232, type: !47)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "text", scope: !477, file: !1, line: 233, type: !47)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "binary", scope: !477, file: !1, line: 233, type: !47)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "universal", scope: !477, file: !1, line: 233, type: !47)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rawmode", scope: !477, file: !1, line: 235, type: !504)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 48, align: 8, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 6)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !477, file: !1, line: 235, type: !55)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line_buffering", scope: !477, file: !1, line: 236, type: !47)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "isatty", scope: !477, file: !1, line: 236, type: !47)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "raw", scope: !477, file: !1, line: 238, type: !15)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modeobj", scope: !477, file: !1, line: 238, type: !15)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !477, file: !1, line: 238, type: !15)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wrapper", scope: !477, file: !1, line: 238, type: !15)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !515, file: !1, line: 260, type: !34)
!515 = distinct !DILexicalBlock(scope: !516, file: !1, line: 259, column: 40)
!516 = distinct !DILexicalBlock(scope: !517, file: !1, line: 259, column: 5)
!517 = distinct !DILexicalBlock(scope: !477, file: !1, line: 259, column: 5)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !519, file: !1, line: 364, type: !15)
!519 = distinct !DILexicalBlock(scope: !477, file: !1, line: 363, column: 5)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !521, file: !1, line: 368, type: !15)
!521 = distinct !DILexicalBlock(scope: !519, file: !1, line: 368, column: 9)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !523, file: !1, line: 384, type: !526)
!523 = distinct !DILexicalBlock(scope: !524, file: !1, line: 383, column: 9)
!524 = distinct !DILexicalBlock(scope: !525, file: !1, line: 380, column: 24)
!525 = distinct !DILexicalBlock(scope: !477, file: !1, line: 380, column: 9)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !527, line: 46, size: 1152, align: 64, elements: !528)
!527 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!528 = !{!529, !531, !533, !535, !537, !539, !541, !542, !543, !544, !546, !548, !556, !557, !558}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !526, file: !527, line: 48, baseType: !530, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !10, line: 133, baseType: !14)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !526, file: !527, line: 53, baseType: !532, size: 64, align: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !10, line: 136, baseType: !14)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !526, file: !527, line: 61, baseType: !534, size: 64, align: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !10, line: 139, baseType: !14)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !526, file: !527, line: 62, baseType: !536, size: 32, align: 32, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !10, line: 138, baseType: !348)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !526, file: !527, line: 64, baseType: !538, size: 32, align: 32, offset: 224)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !10, line: 134, baseType: !348)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !526, file: !527, line: 65, baseType: !540, size: 32, align: 32, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !10, line: 135, baseType: !348)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !526, file: !527, line: 67, baseType: !47, size: 32, align: 32, offset: 288)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !526, file: !527, line: 69, baseType: !530, size: 64, align: 64, offset: 320)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !526, file: !527, line: 74, baseType: !78, size: 64, align: 64, offset: 384)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !526, file: !527, line: 78, baseType: !545, size: 64, align: 64, offset: 448)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !10, line: 162, baseType: !11)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !526, file: !527, line: 80, baseType: !547, size: 64, align: 64, offset: 512)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !10, line: 167, baseType: !11)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !526, file: !527, line: 91, baseType: !549, size: 128, align: 64, offset: 576)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !550, line: 120, size: 128, align: 64, elements: !551)
!550 = !DIFile(filename: "/usr/include/time.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!551 = !{!552, !554}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !549, file: !550, line: 122, baseType: !553, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !10, line: 148, baseType: !11)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !549, file: !550, line: 123, baseType: !555, size: 64, align: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !10, line: 184, baseType: !11)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !526, file: !527, line: 92, baseType: !549, size: 128, align: 64, offset: 704)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !526, file: !527, line: 93, baseType: !549, size: 128, align: 64, offset: 832)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !526, file: !527, line: 106, baseType: !559, size: 192, align: 64, offset: 960)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 192, align: 64, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 3)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fileno", scope: !523, file: !1, line: 385, type: !11)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !523, file: !1, line: 386, type: !15)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !565, file: !1, line: 391, type: !15)
!565 = distinct !DILexicalBlock(scope: !523, file: !1, line: 391, column: 13)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !567, file: !1, line: 414, type: !15)
!567 = distinct !DILexicalBlock(scope: !568, file: !1, line: 414, column: 9)
!568 = distinct !DILexicalBlock(scope: !569, file: !1, line: 407, column: 25)
!569 = distinct !DILexicalBlock(scope: !477, file: !1, line: 407, column: 9)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Buffered_class", scope: !571, file: !1, line: 420, type: !15)
!571 = distinct !DILexicalBlock(scope: !477, file: !1, line: 419, column: 5)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !573, file: !1, line: 436, type: !15)
!573 = distinct !DILexicalBlock(scope: !477, file: !1, line: 436, column: 5)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !575, file: !1, line: 436, type: !15)
!575 = distinct !DILexicalBlock(scope: !576, file: !1, line: 436, column: 5)
!576 = distinct !DILexicalBlock(scope: !577, file: !1, line: 436, column: 5)
!577 = distinct !DILexicalBlock(scope: !573, file: !1, line: 436, column: 5)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !579, file: !1, line: 443, type: !15)
!579 = distinct !DILexicalBlock(scope: !580, file: !1, line: 443, column: 9)
!580 = distinct !DILexicalBlock(scope: !581, file: !1, line: 442, column: 17)
!581 = distinct !DILexicalBlock(scope: !477, file: !1, line: 442, column: 9)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !583, file: !1, line: 453, type: !15)
!583 = distinct !DILexicalBlock(scope: !477, file: !1, line: 453, column: 5)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !585, file: !1, line: 453, type: !15)
!585 = distinct !DILexicalBlock(scope: !586, file: !1, line: 453, column: 5)
!586 = distinct !DILexicalBlock(scope: !587, file: !1, line: 453, column: 5)
!587 = distinct !DILexicalBlock(scope: !583, file: !1, line: 453, column: 5)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !589, file: !1, line: 459, type: !15)
!589 = distinct !DILexicalBlock(scope: !477, file: !1, line: 459, column: 5)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !591, file: !1, line: 463, type: !15)
!591 = distinct !DILexicalBlock(scope: !477, file: !1, line: 463, column: 5)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !593, file: !1, line: 463, type: !15)
!593 = distinct !DILexicalBlock(scope: !594, file: !1, line: 463, column: 5)
!594 = distinct !DILexicalBlock(scope: !591, file: !1, line: 463, column: 5)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !596, file: !1, line: 464, type: !15)
!596 = distinct !DILexicalBlock(scope: !477, file: !1, line: 464, column: 5)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !598, file: !1, line: 464, type: !15)
!598 = distinct !DILexicalBlock(scope: !599, file: !1, line: 464, column: 5)
!599 = distinct !DILexicalBlock(scope: !596, file: !1, line: 464, column: 5)
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !601, file: !1, line: 465, type: !15)
!601 = distinct !DILexicalBlock(scope: !477, file: !1, line: 465, column: 5)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !603, file: !1, line: 465, type: !15)
!603 = distinct !DILexicalBlock(scope: !604, file: !1, line: 465, column: 5)
!604 = distinct !DILexicalBlock(scope: !601, file: !1, line: 465, column: 5)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !606, file: !1, line: 466, type: !15)
!606 = distinct !DILexicalBlock(scope: !477, file: !1, line: 466, column: 5)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !608, file: !1, line: 466, type: !15)
!608 = distinct !DILexicalBlock(scope: !609, file: !1, line: 466, column: 5)
!609 = distinct !DILexicalBlock(scope: !606, file: !1, line: 466, column: 5)
!610 = !DISubprogram(name: "fstat64", scope: !611, file: !611, line: 517, type: !612, isLocal: false, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: true, variables: !634)
!611 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!612 = !DISubroutineType(types: !613)
!613 = !{!47, !47, !614}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !527, line: 119, size: 1152, align: 64, elements: !616)
!616 = !{!617, !618, !620, !621, !622, !623, !624, !625, !626, !627, !628, !630, !631, !632, !633}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !615, file: !527, line: 121, baseType: !530, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !615, file: !527, line: 123, baseType: !619, size: 64, align: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !10, line: 137, baseType: !14)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !615, file: !527, line: 124, baseType: !534, size: 64, align: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !615, file: !527, line: 125, baseType: !536, size: 32, align: 32, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !615, file: !527, line: 132, baseType: !538, size: 32, align: 32, offset: 224)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !615, file: !527, line: 133, baseType: !540, size: 32, align: 32, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !615, file: !527, line: 135, baseType: !47, size: 32, align: 32, offset: 288)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !615, file: !527, line: 136, baseType: !530, size: 64, align: 64, offset: 320)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !615, file: !527, line: 137, baseType: !78, size: 64, align: 64, offset: 384)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !615, file: !527, line: 143, baseType: !545, size: 64, align: 64, offset: 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !615, file: !527, line: 144, baseType: !629, size: 64, align: 64, offset: 512)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !10, line: 168, baseType: !11)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !615, file: !527, line: 152, baseType: !549, size: 128, align: 64, offset: 576)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !615, file: !527, line: 153, baseType: !549, size: 128, align: 64, offset: 704)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !615, file: !527, line: 154, baseType: !549, size: 128, align: 64, offset: 832)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !615, file: !527, line: 164, baseType: !559, size: 192, align: 64, offset: 960)
!634 = !{!635, !636}
!635 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__fd", arg: 1, scope: !610, file: !611, line: 517, type: !47)
!636 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__statbuf", arg: 2, scope: !610, file: !611, line: 517, type: !614)
!637 = !DISubprogram(name: "iomodule_traverse", scope: !1, file: !1, line: 582, type: !261, isLocal: true, isDefinition: true, scopeLine: 582, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)* @iomodule_traverse, variables: !638)
!638 = !{!639, !640, !641, !642, !643, !649}
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mod", arg: 1, scope: !637, file: !1, line: 582, type: !15)
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !637, file: !1, line: 582, type: !263)
!641 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !637, file: !1, line: 582, type: !4)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !637, file: !1, line: 583, type: !350)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !644, file: !1, line: 587, type: !47)
!644 = distinct !DILexicalBlock(scope: !645, file: !1, line: 587, column: 9)
!645 = distinct !DILexicalBlock(scope: !646, file: !1, line: 587, column: 9)
!646 = distinct !DILexicalBlock(scope: !647, file: !1, line: 587, column: 9)
!647 = distinct !DILexicalBlock(scope: !648, file: !1, line: 586, column: 39)
!648 = distinct !DILexicalBlock(scope: !637, file: !1, line: 586, column: 9)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !650, file: !1, line: 589, type: !47)
!650 = distinct !DILexicalBlock(scope: !651, file: !1, line: 589, column: 5)
!651 = distinct !DILexicalBlock(scope: !652, file: !1, line: 589, column: 5)
!652 = distinct !DILexicalBlock(scope: !637, file: !1, line: 589, column: 5)
!653 = !DISubprogram(name: "iomodule_clear", scope: !1, file: !1, line: 595, type: !144, isLocal: true, isDefinition: true, scopeLine: 595, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @iomodule_clear, variables: !654)
!654 = !{!655, !656, !657, !660, !664, !666}
!655 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mod", arg: 1, scope: !653, file: !1, line: 595, type: !15)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !653, file: !1, line: 596, type: !350)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !658, file: !1, line: 600, type: !15)
!658 = distinct !DILexicalBlock(scope: !659, file: !1, line: 600, column: 9)
!659 = distinct !DILexicalBlock(scope: !653, file: !1, line: 599, column: 9)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !661, file: !1, line: 600, type: !15)
!661 = distinct !DILexicalBlock(scope: !662, file: !1, line: 600, column: 9)
!662 = distinct !DILexicalBlock(scope: !663, file: !1, line: 600, column: 9)
!663 = distinct !DILexicalBlock(scope: !658, file: !1, line: 600, column: 9)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !665, file: !1, line: 601, type: !15)
!665 = distinct !DILexicalBlock(scope: !653, file: !1, line: 601, column: 5)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !667, file: !1, line: 601, type: !15)
!667 = distinct !DILexicalBlock(scope: !668, file: !1, line: 601, column: 5)
!668 = distinct !DILexicalBlock(scope: !669, file: !1, line: 601, column: 5)
!669 = distinct !DILexicalBlock(scope: !665, file: !1, line: 601, column: 5)
!670 = !DISubprogram(name: "iomodule_free", scope: !1, file: !1, line: 606, type: !40, isLocal: true, isDefinition: true, scopeLine: 606, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @iomodule_free, variables: !671)
!671 = !{!672}
!672 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mod", arg: 1, scope: !670, file: !1, line: 606, type: !15)
!673 = !{!674, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !728, !732, !740, !741, !742}
!674 = !DIGlobalVariable(name: "_PyIO_Module", scope: !0, file: !1, line: 620, type: !675, isLocal: false, isDefinition: true, variable: %struct.PyModuleDef* @_PyIO_Module)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !676, line: 47, size: 832, align: 64, elements: !677)
!676 = !DIFile(filename: "Include/moduleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!677 = !{!678, !687, !688, !689, !690, !693, !694, !695, !696}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !675, file: !676, line: 48, baseType: !679, size: 320, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !676, line: 38, baseType: !680)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !676, line: 33, size: 320, align: 64, elements: !681)
!681 = !{!682, !683, !685, !686}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !680, file: !676, line: 34, baseType: !16, size: 128, align: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !680, file: !676, line: 35, baseType: !684, size: 64, align: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !680, file: !676, line: 36, baseType: !5, size: 64, align: 64, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !680, file: !676, line: 37, baseType: !15, size: 64, align: 64, offset: 256)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !675, file: !676, line: 49, baseType: !32, size: 64, align: 64, offset: 320)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !675, file: !676, line: 50, baseType: !32, size: 64, align: 64, offset: 384)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !675, file: !676, line: 51, baseType: !5, size: 64, align: 64, offset: 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !675, file: !676, line: 52, baseType: !691, size: 64, align: 64, offset: 512)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64, align: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !281, line: 47, baseType: !280)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !675, file: !676, line: 53, baseType: !142, size: 64, align: 64, offset: 576)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !675, file: !676, line: 54, baseType: !259, size: 64, align: 64, offset: 640)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !675, file: !676, line: 55, baseType: !142, size: 64, align: 64, offset: 704)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !675, file: !676, line: 56, baseType: !336, size: 64, align: 64, offset: 768)
!697 = !DIGlobalVariable(name: "_PyIO_str_close", scope: !0, file: !1, line: 26, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_close)
!698 = !DIGlobalVariable(name: "_PyIO_str_closed", scope: !0, file: !1, line: 27, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_closed)
!699 = !DIGlobalVariable(name: "_PyIO_str_decode", scope: !0, file: !1, line: 28, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_decode)
!700 = !DIGlobalVariable(name: "_PyIO_str_encode", scope: !0, file: !1, line: 29, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_encode)
!701 = !DIGlobalVariable(name: "_PyIO_str_fileno", scope: !0, file: !1, line: 30, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_fileno)
!702 = !DIGlobalVariable(name: "_PyIO_str_flush", scope: !0, file: !1, line: 31, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_flush)
!703 = !DIGlobalVariable(name: "_PyIO_str_getstate", scope: !0, file: !1, line: 32, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_getstate)
!704 = !DIGlobalVariable(name: "_PyIO_str_isatty", scope: !0, file: !1, line: 33, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_isatty)
!705 = !DIGlobalVariable(name: "_PyIO_str_newlines", scope: !0, file: !1, line: 34, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_newlines)
!706 = !DIGlobalVariable(name: "_PyIO_str_nl", scope: !0, file: !1, line: 35, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_nl)
!707 = !DIGlobalVariable(name: "_PyIO_str_read", scope: !0, file: !1, line: 36, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_read)
!708 = !DIGlobalVariable(name: "_PyIO_str_read1", scope: !0, file: !1, line: 37, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_read1)
!709 = !DIGlobalVariable(name: "_PyIO_str_readable", scope: !0, file: !1, line: 38, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_readable)
!710 = !DIGlobalVariable(name: "_PyIO_str_readall", scope: !0, file: !1, line: 39, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_readall)
!711 = !DIGlobalVariable(name: "_PyIO_str_readinto", scope: !0, file: !1, line: 40, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_readinto)
!712 = !DIGlobalVariable(name: "_PyIO_str_readline", scope: !0, file: !1, line: 41, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_readline)
!713 = !DIGlobalVariable(name: "_PyIO_str_reset", scope: !0, file: !1, line: 42, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_reset)
!714 = !DIGlobalVariable(name: "_PyIO_str_seek", scope: !0, file: !1, line: 43, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_seek)
!715 = !DIGlobalVariable(name: "_PyIO_str_seekable", scope: !0, file: !1, line: 44, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_seekable)
!716 = !DIGlobalVariable(name: "_PyIO_str_setstate", scope: !0, file: !1, line: 45, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_setstate)
!717 = !DIGlobalVariable(name: "_PyIO_str_tell", scope: !0, file: !1, line: 46, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_tell)
!718 = !DIGlobalVariable(name: "_PyIO_str_truncate", scope: !0, file: !1, line: 47, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_truncate)
!719 = !DIGlobalVariable(name: "_PyIO_str_writable", scope: !0, file: !1, line: 48, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_writable)
!720 = !DIGlobalVariable(name: "_PyIO_str_write", scope: !0, file: !1, line: 49, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_write)
!721 = !DIGlobalVariable(name: "_PyIO_empty_str", scope: !0, file: !1, line: 51, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_empty_str)
!722 = !DIGlobalVariable(name: "_PyIO_empty_bytes", scope: !0, file: !1, line: 52, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_empty_bytes)
!723 = !DIGlobalVariable(name: "_PyIO_zero", scope: !0, file: !1, line: 53, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_zero)
!724 = !DIGlobalVariable(name: "module_doc", scope: !0, file: !1, line: 56, type: !725, isLocal: true, isDefinition: true, variable: [1473 x i8]* @module_doc)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 11784, align: 8, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 1473)
!728 = !DIGlobalVariable(name: "module_methods", scope: !0, file: !1, line: 615, type: !729, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMethodDef]* @module_methods)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !692, size: 512, align: 64, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 2)
!732 = !DIGlobalVariable(name: "PyId_isatty", scope: !477, file: !1, line: 240, type: !733, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @io_open.PyId_isatty)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !17, line: 144, baseType: !734)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !17, line: 140, size: 192, align: 64, elements: !735)
!735 = !{!736, !738, !739}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !734, file: !17, line: 141, baseType: !737, size: 64, align: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64, align: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !734, file: !17, line: 142, baseType: !32, size: 64, align: 64, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !734, file: !17, line: 143, baseType: !15, size: 64, align: 64, offset: 128)
!740 = !DIGlobalVariable(name: "PyId_fileno", scope: !477, file: !1, line: 241, type: !733, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @io_open.PyId_fileno)
!741 = !DIGlobalVariable(name: "PyId_mode", scope: !477, file: !1, line: 242, type: !733, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @io_open.PyId_mode)
!742 = !DIGlobalVariable(name: "open_doc", scope: !0, file: !1, line: 96, type: !743, isLocal: true, isDefinition: true, variable: [6355 x i8]* @open_doc)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 50840, align: 8, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 6355)
!746 = !{i32 2, !"Dwarf Version", i32 4}
!747 = !{i32 2, !"Debug Info Version", i32 3}
!748 = !{!"clang version 3.7.0 (tags/RELEASE_370/final)"}
!749 = !DIExpression()
!750 = !DILocation(line: 475, column: 28, scope: !370)
!751 = !DILocation(line: 475, column: 44, scope: !370)
!752 = !DILocation(line: 479, column: 23, scope: !370)
!753 = !DILocation(line: 479, column: 15, scope: !370)
!754 = !DILocation(line: 480, column: 15, scope: !755)
!755 = distinct !DILexicalBlock(scope: !370, file: !1, line: 480, column: 9)
!756 = !DILocation(line: 480, column: 9, scope: !370)
!757 = !DILocation(line: 484, column: 14, scope: !370)
!758 = !DILocation(line: 477, column: 14, scope: !370)
!759 = !DILocation(line: 485, column: 16, scope: !760)
!760 = distinct !DILexicalBlock(scope: !370, file: !1, line: 485, column: 9)
!761 = !DILocation(line: 485, column: 22, scope: !760)
!762 = !DILocation(line: 485, column: 36, scope: !763)
!763 = !DILexicalBlockFile(scope: !760, file: !1, discriminator: 1)
!764 = !DILocation(line: 478, column: 15, scope: !370)
!765 = !DILocation(line: 485, column: 34, scope: !760)
!766 = !DILocation(line: 485, column: 9, scope: !370)
!767 = !DILocation(line: 489, column: 46, scope: !768)
!768 = distinct !DILexicalBlock(scope: !370, file: !1, line: 489, column: 9)
!769 = !{!770, !770, i64 0}
!770 = !{!"any pointer", !771, i64 0}
!771 = !{!"omnipotent char", !772, i64 0}
!772 = !{!"Simple C/C++ TBAA"}
!773 = !DILocation(line: 489, column: 10, scope: !768)
!774 = !DILocation(line: 489, column: 9, scope: !370)
!775 = !DILocation(line: 492, column: 5, scope: !370)
!776 = !DILocation(line: 496, column: 10, scope: !777)
!777 = distinct !DILexicalBlock(scope: !370, file: !1, line: 496, column: 9)
!778 = !DILocation(line: 496, column: 9, scope: !370)
!779 = !DILocation(line: 501, column: 13, scope: !780)
!780 = distinct !DILexicalBlock(scope: !781, file: !1, line: 501, column: 13)
!781 = distinct !DILexicalBlock(scope: !777, file: !1, line: 496, column: 15)
!782 = !DILocation(line: 501, column: 33, scope: !780)
!783 = !DILocation(line: 502, column: 13, scope: !780)
!784 = !DILocation(line: 510, column: 28, scope: !785)
!785 = distinct !DILexicalBlock(scope: !777, file: !1, line: 506, column: 10)
!786 = !{!787, !770, i64 8}
!787 = !{!"_object", !788, i64 0, !770, i64 8}
!788 = !{!"long", !771, i64 0}
!789 = !DILocation(line: 510, column: 37, scope: !785)
!790 = !{!791, !770, i64 24}
!791 = !{!"_typeobject", !792, i64 0, !770, i64 24, !788, i64 32, !788, i64 40, !770, i64 48, !770, i64 56, !770, i64 64, !770, i64 72, !770, i64 80, !770, i64 88, !770, i64 96, !770, i64 104, !770, i64 112, !770, i64 120, !770, i64 128, !770, i64 136, !770, i64 144, !770, i64 152, !770, i64 160, !788, i64 168, !770, i64 176, !770, i64 184, !770, i64 192, !770, i64 200, !788, i64 208, !770, i64 216, !770, i64 224, !770, i64 232, !770, i64 240, !770, i64 248, !770, i64 256, !770, i64 264, !770, i64 272, !770, i64 280, !788, i64 288, !770, i64 296, !770, i64 304, !770, i64 312, !770, i64 320, !770, i64 328, !770, i64 336, !770, i64 344, !770, i64 352, !770, i64 360, !770, i64 368, !770, i64 376, !793, i64 384, !770, i64 392}
!792 = !{!"", !787, i64 0, !788, i64 16}
