; ModuleID = '_localemodule.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !343, globals: !684)
!1 = !DIFile(filename: "./Modules/_localemodule.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !94}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !7, line: 109, baseType: !8)
!7 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !7, line: 105, size: 128, align: 64, elements: !9)
!9 = !{!10, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !8, file: !7, line: 107, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !12, line: 177, baseType: !13)
!12 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !14, line: 102, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !16, line: 181, baseType: !17)
!16 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !8, file: !7, line: 108, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !7, line: 334, size: 3200, align: 64, elements: !21)
!21 = !{!22, !28, !32, !33, !34, !39, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !291, !309, !310, !311, !313, !315, !316, !318, !323, !328, !333, !334, !335, !336, !337, !338, !339, !340, !342}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !20, file: !7, line: 335, baseType: !23, size: 192, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !7, line: 114, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 111, size: 192, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !24, file: !7, line: 112, baseType: !6, size: 128, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !24, file: !7, line: 113, baseType: !11, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !20, file: !7, line: 336, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !20, file: !7, line: 341, baseType: !35, size: 64, align: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !7, line: 308, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !5}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !20, file: !7, line: 342, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !7, line: 314, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !5, !45, !44}
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !14, line: 48, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 246, size: 1728, align: 64, elements: !49)
!48 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!49 = !{!50, !51, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !71, !72, !73, !74, !76, !78, !80, !84, !87, !89, !90, !91, !92, !93, !97, !98}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !48, line: 247, baseType: !44, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !47, file: !48, line: 252, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !47, file: !48, line: 253, baseType: !52, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !47, file: !48, line: 254, baseType: !52, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !47, file: !48, line: 255, baseType: !52, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !47, file: !48, line: 256, baseType: !52, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !47, file: !48, line: 257, baseType: !52, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !47, file: !48, line: 258, baseType: !52, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !47, file: !48, line: 259, baseType: !52, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !47, file: !48, line: 261, baseType: !52, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !47, file: !48, line: 262, baseType: !52, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !47, file: !48, line: 263, baseType: !52, size: 64, align: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !47, file: !48, line: 265, baseType: !64, size: 64, align: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !48, line: 161, size: 192, align: 64, elements: !66)
!66 = !{!67, !68, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !65, file: !48, line: 162, baseType: !64, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !65, file: !48, line: 163, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !65, file: !48, line: 167, baseType: !44, size: 32, align: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !47, file: !48, line: 267, baseType: !69, size: 64, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !47, file: !48, line: 269, baseType: !44, size: 32, align: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !47, file: !48, line: 273, baseType: !44, size: 32, align: 32, offset: 928)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !47, file: !48, line: 275, baseType: !75, size: 64, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !16, line: 140, baseType: !17)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !47, file: !48, line: 279, baseType: !77, size: 16, align: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !47, file: !48, line: 280, baseType: !79, size: 8, align: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !47, file: !48, line: 281, baseType: !81, size: 8, align: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !47, file: !48, line: 285, baseType: !85, size: 64, align: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !48, line: 155, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !47, file: !48, line: 294, baseType: !88, size: 64, align: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !16, line: 141, baseType: !17)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !47, file: !48, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !47, file: !48, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !47, file: !48, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !47, file: !48, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !47, file: !48, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !47, file: !48, line: 309, baseType: !44, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !47, file: !48, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !20, file: !7, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !7, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!5, !5, !52}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !20, file: !7, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !7, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!44, !5, !52, !5}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !20, file: !7, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !20, file: !7, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !7, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!5, !5}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !20, file: !7, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !7, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !7, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !7, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!5, !5, !5}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !7, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !7, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !7, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !7, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !7, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !7, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!5, !5, !5, !5}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !7, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !7, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !7, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !7, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !7, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !7, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!44, !5}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !7, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !7, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !7, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !7, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !7, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !7, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !7, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !7, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !7, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !7, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !7, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !7, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !7, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !7, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !7, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !7, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !7, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !7, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !7, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !7, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !7, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !7, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !7, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !7, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !20, file: !7, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !7, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !7, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !7, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!11, !5}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !7, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !7, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !7, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!5, !5, !11}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !7, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !7, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !7, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !7, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!44, !5, !11, !5}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !7, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !7, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !7, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!44, !5, !5}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !7, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !7, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !20, file: !7, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !7, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !7, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !7, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !7, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !7, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!44, !5, !5, !5}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !20, file: !7, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !7, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !5}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !12, line: 186, baseType: !11)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !20, file: !7, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !20, file: !7, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !20, file: !7, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !7, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !20, file: !7, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !7, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !20, file: !7, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !7, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !7, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !7, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!44, !5, !235, !44}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !7, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !7, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !7, line: 179, baseType: !4, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !7, line: 180, baseType: !5, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !7, line: 181, baseType: !11, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !7, line: 182, baseType: !11, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !7, line: 184, baseType: !44, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !7, line: 185, baseType: !44, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !7, line: 186, baseType: !52, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !7, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !7, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !7, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !7, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !7, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !7, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !5, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !20, file: !7, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !20, file: !7, line: 368, baseType: !29, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !20, file: !7, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !7, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!44, !5, !263, !4}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !7, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!44, !5, !4}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !20, file: !7, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !20, file: !7, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !7, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!5, !5, !5, !44}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !20, file: !7, line: 382, baseType: !11, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !20, file: !7, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !7, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !20, file: !7, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !7, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !20, file: !7, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !29, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !44, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !29, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !20, file: !7, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !7, line: 390, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !20, file: !7, line: 391, baseType: !292, size: 64, align: 64, offset: 1984)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !294, line: 11, size: 320, align: 64, elements: !295)
!294 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!295 = !{!296, !297, !302, !307, !308}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !293, file: !294, line: 12, baseType: !52, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !293, file: !294, line: 13, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !294, line: 8, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!5, !5, !4}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !293, file: !294, line: 14, baseType: !303, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !294, line: 9, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!44, !5, !5, !4}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !293, file: !294, line: 15, baseType: !52, size: 64, align: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !293, file: !294, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !20, file: !7, line: 392, baseType: !19, size: 64, align: 64, offset: 2048)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !20, file: !7, line: 393, baseType: !5, size: 64, align: 64, offset: 2112)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !20, file: !7, line: 394, baseType: !312, size: 64, align: 64, offset: 2176)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !7, line: 325, baseType: !134)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !20, file: !7, line: 395, baseType: !314, size: 64, align: 64, offset: 2240)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !7, line: 326, baseType: !210)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !20, file: !7, line: 396, baseType: !11, size: 64, align: 64, offset: 2304)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !20, file: !7, line: 397, baseType: !317, size: 64, align: 64, offset: 2368)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !7, line: 327, baseType: !210)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !20, file: !7, line: 398, baseType: !319, size: 64, align: 64, offset: 2432)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !7, line: 329, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!5, !19, !11}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !20, file: !7, line: 399, baseType: !324, size: 64, align: 64, offset: 2496)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !7, line: 328, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!5, !19, !5, !5}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !20, file: !7, line: 400, baseType: !329, size: 64, align: 64, offset: 2560)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !7, line: 307, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !4}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !20, file: !7, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !20, file: !7, line: 402, baseType: !5, size: 64, align: 64, offset: 2688)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !20, file: !7, line: 403, baseType: !5, size: 64, align: 64, offset: 2752)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !20, file: !7, line: 404, baseType: !5, size: 64, align: 64, offset: 2816)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !20, file: !7, line: 405, baseType: !5, size: 64, align: 64, offset: 2880)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !20, file: !7, line: 406, baseType: !5, size: 64, align: 64, offset: 2944)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !20, file: !7, line: 407, baseType: !35, size: 64, align: 64, offset: 3008)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !20, file: !7, line: 410, baseType: !341, size: 32, align: 32, offset: 3072)
!341 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !20, file: !7, line: 412, baseType: !35, size: 64, align: 64, offset: 3136)
!343 = !{!344, !392, !400, !581, !598, !609, !622, !633, !638, !644, !651, !656, !678}
!344 = !DISubprogram(name: "PyInit__locale", scope: !1, file: !1, line: 622, type: !345, isLocal: false, isDefinition: true, scopeLine: 623, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__locale, variables: !347)
!345 = !DISubroutineType(types: !346)
!346 = !{!5}
!347 = !{!348, !349, !350, !351, !352, !354, !357, !359, !362, !364, !367, !369, !372, !374, !377, !379, !382, !384, !387, !389}
!348 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !344, file: !1, line: 624, type: !5)
!349 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !344, file: !1, line: 624, type: !5)
!350 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !344, file: !1, line: 624, type: !5)
!351 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !344, file: !1, line: 626, type: !44)
!352 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !353, file: !1, line: 637, type: !5)
!353 = distinct !DILexicalBlock(scope: !344, file: !1, line: 637, column: 5)
!354 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !355, file: !1, line: 637, type: !5)
!355 = distinct !DILexicalBlock(scope: !356, file: !1, line: 637, column: 5)
!356 = distinct !DILexicalBlock(scope: !353, file: !1, line: 637, column: 5)
!357 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !358, file: !1, line: 641, type: !5)
!358 = distinct !DILexicalBlock(scope: !344, file: !1, line: 641, column: 5)
!359 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !360, file: !1, line: 641, type: !5)
!360 = distinct !DILexicalBlock(scope: !361, file: !1, line: 641, column: 5)
!361 = distinct !DILexicalBlock(scope: !358, file: !1, line: 641, column: 5)
!362 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !363, file: !1, line: 645, type: !5)
!363 = distinct !DILexicalBlock(scope: !344, file: !1, line: 645, column: 5)
!364 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !365, file: !1, line: 645, type: !5)
!365 = distinct !DILexicalBlock(scope: !366, file: !1, line: 645, column: 5)
!366 = distinct !DILexicalBlock(scope: !363, file: !1, line: 645, column: 5)
!367 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !368, file: !1, line: 649, type: !5)
!368 = distinct !DILexicalBlock(scope: !344, file: !1, line: 649, column: 5)
!369 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !370, file: !1, line: 649, type: !5)
!370 = distinct !DILexicalBlock(scope: !371, file: !1, line: 649, column: 5)
!371 = distinct !DILexicalBlock(scope: !368, file: !1, line: 649, column: 5)
!372 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !373, file: !1, line: 654, type: !5)
!373 = distinct !DILexicalBlock(scope: !344, file: !1, line: 654, column: 5)
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !375, file: !1, line: 654, type: !5)
!375 = distinct !DILexicalBlock(scope: !376, file: !1, line: 654, column: 5)
!376 = distinct !DILexicalBlock(scope: !373, file: !1, line: 654, column: 5)
!377 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !378, file: !1, line: 659, type: !5)
!378 = distinct !DILexicalBlock(scope: !344, file: !1, line: 659, column: 5)
!379 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !380, file: !1, line: 659, type: !5)
!380 = distinct !DILexicalBlock(scope: !381, file: !1, line: 659, column: 5)
!381 = distinct !DILexicalBlock(scope: !378, file: !1, line: 659, column: 5)
!382 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !383, file: !1, line: 663, type: !5)
!383 = distinct !DILexicalBlock(scope: !344, file: !1, line: 663, column: 5)
!384 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !385, file: !1, line: 663, type: !5)
!385 = distinct !DILexicalBlock(scope: !386, file: !1, line: 663, column: 5)
!386 = distinct !DILexicalBlock(scope: !383, file: !1, line: 663, column: 5)
!387 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !388, file: !1, line: 667, type: !5)
!388 = distinct !DILexicalBlock(scope: !344, file: !1, line: 667, column: 5)
!389 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !390, file: !1, line: 667, type: !5)
!390 = distinct !DILexicalBlock(scope: !391, file: !1, line: 667, column: 5)
!391 = distinct !DILexicalBlock(scope: !388, file: !1, line: 667, column: 5)
!392 = !DISubprogram(name: "PyLocale_setlocale", scope: !1, file: !1, line: 90, type: !126, isLocal: true, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyLocale_setlocale, variables: !393)
!393 = !{!394, !395, !396, !397, !398, !399}
!394 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !392, file: !1, line: 90, type: !5)
!395 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !392, file: !1, line: 90, type: !5)
!396 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "category", scope: !392, file: !1, line: 92, type: !44)
!397 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "locale", scope: !392, file: !1, line: 93, type: !52)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !392, file: !1, line: 93, type: !52)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result_object", scope: !392, file: !1, line: 94, type: !5)
!400 = !DISubprogram(name: "PyLocale_localeconv", scope: !1, file: !1, line: 134, type: !116, isLocal: true, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyLocale_localeconv, variables: !401)
!401 = !{!402, !403, !404, !433, !434, !440, !442, !448, !450, !455, !457, !463, !465, !471, !473, !479, !481, !487, !489, !494, !496, !502, !504, !510, !512, !518, !520, !526, !528, !534, !536, !542, !544, !550, !552, !558, !560, !566, !568, !574, !576, !578}
!402 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !400, file: !1, line: 134, type: !5)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !400, file: !1, line: 136, type: !5)
!404 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !400, file: !1, line: 137, type: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !407, line: 54, size: 768, align: 64, elements: !408)
!407 = !DIFile(filename: "/usr/include/locale.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!408 = !{!409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !406, file: !407, line: 58, baseType: !52, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !406, file: !407, line: 59, baseType: !52, size: 64, align: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !406, file: !407, line: 65, baseType: !52, size: 64, align: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !406, file: !407, line: 71, baseType: !52, size: 64, align: 64, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !406, file: !407, line: 72, baseType: !52, size: 64, align: 64, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !406, file: !407, line: 73, baseType: !52, size: 64, align: 64, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !406, file: !407, line: 74, baseType: !52, size: 64, align: 64, offset: 384)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !406, file: !407, line: 75, baseType: !52, size: 64, align: 64, offset: 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !406, file: !407, line: 76, baseType: !52, size: 64, align: 64, offset: 512)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !406, file: !407, line: 77, baseType: !52, size: 64, align: 64, offset: 576)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !406, file: !407, line: 78, baseType: !31, size: 8, align: 8, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !406, file: !407, line: 79, baseType: !31, size: 8, align: 8, offset: 648)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !406, file: !407, line: 81, baseType: !31, size: 8, align: 8, offset: 656)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !406, file: !407, line: 83, baseType: !31, size: 8, align: 8, offset: 664)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !406, file: !407, line: 85, baseType: !31, size: 8, align: 8, offset: 672)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !406, file: !407, line: 87, baseType: !31, size: 8, align: 8, offset: 680)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !406, file: !407, line: 94, baseType: !31, size: 8, align: 8, offset: 688)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !406, file: !407, line: 95, baseType: !31, size: 8, align: 8, offset: 696)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !406, file: !407, line: 98, baseType: !31, size: 8, align: 8, offset: 704)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !406, file: !407, line: 100, baseType: !31, size: 8, align: 8, offset: 712)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !406, file: !407, line: 102, baseType: !31, size: 8, align: 8, offset: 720)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !406, file: !407, line: 104, baseType: !31, size: 8, align: 8, offset: 728)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !406, file: !407, line: 111, baseType: !31, size: 8, align: 8, offset: 736)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !406, file: !407, line: 112, baseType: !31, size: 8, align: 8, offset: 744)
!433 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !400, file: !1, line: 138, type: !5)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !435, file: !1, line: 174, type: !5)
!435 = distinct !DILexicalBlock(scope: !436, file: !1, line: 174, column: 5)
!436 = distinct !DILexicalBlock(scope: !437, file: !1, line: 174, column: 5)
!437 = distinct !DILexicalBlock(scope: !438, file: !1, line: 174, column: 5)
!438 = distinct !DILexicalBlock(scope: !439, file: !1, line: 174, column: 5)
!439 = distinct !DILexicalBlock(scope: !400, file: !1, line: 174, column: 5)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !441, file: !1, line: 174, type: !5)
!441 = distinct !DILexicalBlock(scope: !438, file: !1, line: 174, column: 5)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !443, file: !1, line: 175, type: !5)
!443 = distinct !DILexicalBlock(scope: !444, file: !1, line: 175, column: 5)
!444 = distinct !DILexicalBlock(scope: !445, file: !1, line: 175, column: 5)
!445 = distinct !DILexicalBlock(scope: !446, file: !1, line: 175, column: 5)
!446 = distinct !DILexicalBlock(scope: !447, file: !1, line: 175, column: 5)
!447 = distinct !DILexicalBlock(scope: !400, file: !1, line: 175, column: 5)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !449, file: !1, line: 175, type: !5)
!449 = distinct !DILexicalBlock(scope: !446, file: !1, line: 175, column: 5)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !451, file: !1, line: 177, type: !5)
!451 = distinct !DILexicalBlock(scope: !452, file: !1, line: 177, column: 5)
!452 = distinct !DILexicalBlock(scope: !453, file: !1, line: 177, column: 5)
!453 = distinct !DILexicalBlock(scope: !454, file: !1, line: 177, column: 5)
!454 = distinct !DILexicalBlock(scope: !400, file: !1, line: 177, column: 5)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !456, file: !1, line: 177, type: !5)
!456 = distinct !DILexicalBlock(scope: !454, file: !1, line: 177, column: 5)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !458, file: !1, line: 180, type: !5)
!458 = distinct !DILexicalBlock(scope: !459, file: !1, line: 180, column: 5)
!459 = distinct !DILexicalBlock(scope: !460, file: !1, line: 180, column: 5)
!460 = distinct !DILexicalBlock(scope: !461, file: !1, line: 180, column: 5)
!461 = distinct !DILexicalBlock(scope: !462, file: !1, line: 180, column: 5)
!462 = distinct !DILexicalBlock(scope: !400, file: !1, line: 180, column: 5)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !464, file: !1, line: 180, type: !5)
!464 = distinct !DILexicalBlock(scope: !461, file: !1, line: 180, column: 5)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !466, file: !1, line: 181, type: !5)
!466 = distinct !DILexicalBlock(scope: !467, file: !1, line: 181, column: 5)
!467 = distinct !DILexicalBlock(scope: !468, file: !1, line: 181, column: 5)
!468 = distinct !DILexicalBlock(scope: !469, file: !1, line: 181, column: 5)
!469 = distinct !DILexicalBlock(scope: !470, file: !1, line: 181, column: 5)
!470 = distinct !DILexicalBlock(scope: !400, file: !1, line: 181, column: 5)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !472, file: !1, line: 181, type: !5)
!472 = distinct !DILexicalBlock(scope: !469, file: !1, line: 181, column: 5)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !474, file: !1, line: 182, type: !5)
!474 = distinct !DILexicalBlock(scope: !475, file: !1, line: 182, column: 5)
!475 = distinct !DILexicalBlock(scope: !476, file: !1, line: 182, column: 5)
!476 = distinct !DILexicalBlock(scope: !477, file: !1, line: 182, column: 5)
!477 = distinct !DILexicalBlock(scope: !478, file: !1, line: 182, column: 5)
!478 = distinct !DILexicalBlock(scope: !400, file: !1, line: 182, column: 5)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !480, file: !1, line: 182, type: !5)
!480 = distinct !DILexicalBlock(scope: !477, file: !1, line: 182, column: 5)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !482, file: !1, line: 183, type: !5)
!482 = distinct !DILexicalBlock(scope: !483, file: !1, line: 183, column: 5)
!483 = distinct !DILexicalBlock(scope: !484, file: !1, line: 183, column: 5)
!484 = distinct !DILexicalBlock(scope: !485, file: !1, line: 183, column: 5)
!485 = distinct !DILexicalBlock(scope: !486, file: !1, line: 183, column: 5)
!486 = distinct !DILexicalBlock(scope: !400, file: !1, line: 183, column: 5)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !488, file: !1, line: 183, type: !5)
!488 = distinct !DILexicalBlock(scope: !485, file: !1, line: 183, column: 5)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !490, file: !1, line: 185, type: !5)
!490 = distinct !DILexicalBlock(scope: !491, file: !1, line: 185, column: 5)
!491 = distinct !DILexicalBlock(scope: !492, file: !1, line: 185, column: 5)
!492 = distinct !DILexicalBlock(scope: !493, file: !1, line: 185, column: 5)
!493 = distinct !DILexicalBlock(scope: !400, file: !1, line: 185, column: 5)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !495, file: !1, line: 185, type: !5)
!495 = distinct !DILexicalBlock(scope: !493, file: !1, line: 185, column: 5)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !497, file: !1, line: 187, type: !5)
!497 = distinct !DILexicalBlock(scope: !498, file: !1, line: 187, column: 5)
!498 = distinct !DILexicalBlock(scope: !499, file: !1, line: 187, column: 5)
!499 = distinct !DILexicalBlock(scope: !500, file: !1, line: 187, column: 5)
!500 = distinct !DILexicalBlock(scope: !501, file: !1, line: 187, column: 5)
!501 = distinct !DILexicalBlock(scope: !400, file: !1, line: 187, column: 5)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !503, file: !1, line: 187, type: !5)
!503 = distinct !DILexicalBlock(scope: !500, file: !1, line: 187, column: 5)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !505, file: !1, line: 188, type: !5)
!505 = distinct !DILexicalBlock(scope: !506, file: !1, line: 188, column: 5)
!506 = distinct !DILexicalBlock(scope: !507, file: !1, line: 188, column: 5)
!507 = distinct !DILexicalBlock(scope: !508, file: !1, line: 188, column: 5)
!508 = distinct !DILexicalBlock(scope: !509, file: !1, line: 188, column: 5)
!509 = distinct !DILexicalBlock(scope: !400, file: !1, line: 188, column: 5)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !511, file: !1, line: 188, type: !5)
!511 = distinct !DILexicalBlock(scope: !508, file: !1, line: 188, column: 5)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !513, file: !1, line: 189, type: !5)
!513 = distinct !DILexicalBlock(scope: !514, file: !1, line: 189, column: 5)
!514 = distinct !DILexicalBlock(scope: !515, file: !1, line: 189, column: 5)
!515 = distinct !DILexicalBlock(scope: !516, file: !1, line: 189, column: 5)
!516 = distinct !DILexicalBlock(scope: !517, file: !1, line: 189, column: 5)
!517 = distinct !DILexicalBlock(scope: !400, file: !1, line: 189, column: 5)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !519, file: !1, line: 189, type: !5)
!519 = distinct !DILexicalBlock(scope: !516, file: !1, line: 189, column: 5)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !521, file: !1, line: 190, type: !5)
!521 = distinct !DILexicalBlock(scope: !522, file: !1, line: 190, column: 5)
!522 = distinct !DILexicalBlock(scope: !523, file: !1, line: 190, column: 5)
!523 = distinct !DILexicalBlock(scope: !524, file: !1, line: 190, column: 5)
!524 = distinct !DILexicalBlock(scope: !525, file: !1, line: 190, column: 5)
!525 = distinct !DILexicalBlock(scope: !400, file: !1, line: 190, column: 5)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !527, file: !1, line: 190, type: !5)
!527 = distinct !DILexicalBlock(scope: !524, file: !1, line: 190, column: 5)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !529, file: !1, line: 191, type: !5)
!529 = distinct !DILexicalBlock(scope: !530, file: !1, line: 191, column: 5)
!530 = distinct !DILexicalBlock(scope: !531, file: !1, line: 191, column: 5)
!531 = distinct !DILexicalBlock(scope: !532, file: !1, line: 191, column: 5)
!532 = distinct !DILexicalBlock(scope: !533, file: !1, line: 191, column: 5)
!533 = distinct !DILexicalBlock(scope: !400, file: !1, line: 191, column: 5)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !535, file: !1, line: 191, type: !5)
!535 = distinct !DILexicalBlock(scope: !532, file: !1, line: 191, column: 5)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !537, file: !1, line: 192, type: !5)
!537 = distinct !DILexicalBlock(scope: !538, file: !1, line: 192, column: 5)
!538 = distinct !DILexicalBlock(scope: !539, file: !1, line: 192, column: 5)
!539 = distinct !DILexicalBlock(scope: !540, file: !1, line: 192, column: 5)
!540 = distinct !DILexicalBlock(scope: !541, file: !1, line: 192, column: 5)
!541 = distinct !DILexicalBlock(scope: !400, file: !1, line: 192, column: 5)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !543, file: !1, line: 192, type: !5)
!543 = distinct !DILexicalBlock(scope: !540, file: !1, line: 192, column: 5)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !545, file: !1, line: 193, type: !5)
!545 = distinct !DILexicalBlock(scope: !546, file: !1, line: 193, column: 5)
!546 = distinct !DILexicalBlock(scope: !547, file: !1, line: 193, column: 5)
!547 = distinct !DILexicalBlock(scope: !548, file: !1, line: 193, column: 5)
!548 = distinct !DILexicalBlock(scope: !549, file: !1, line: 193, column: 5)
!549 = distinct !DILexicalBlock(scope: !400, file: !1, line: 193, column: 5)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !551, file: !1, line: 193, type: !5)
!551 = distinct !DILexicalBlock(scope: !548, file: !1, line: 193, column: 5)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !553, file: !1, line: 194, type: !5)
!553 = distinct !DILexicalBlock(scope: !554, file: !1, line: 194, column: 5)
!554 = distinct !DILexicalBlock(scope: !555, file: !1, line: 194, column: 5)
!555 = distinct !DILexicalBlock(scope: !556, file: !1, line: 194, column: 5)
!556 = distinct !DILexicalBlock(scope: !557, file: !1, line: 194, column: 5)
!557 = distinct !DILexicalBlock(scope: !400, file: !1, line: 194, column: 5)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !559, file: !1, line: 194, type: !5)
!559 = distinct !DILexicalBlock(scope: !556, file: !1, line: 194, column: 5)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !561, file: !1, line: 195, type: !5)
!561 = distinct !DILexicalBlock(scope: !562, file: !1, line: 195, column: 5)
!562 = distinct !DILexicalBlock(scope: !563, file: !1, line: 195, column: 5)
!563 = distinct !DILexicalBlock(scope: !564, file: !1, line: 195, column: 5)
!564 = distinct !DILexicalBlock(scope: !565, file: !1, line: 195, column: 5)
!565 = distinct !DILexicalBlock(scope: !400, file: !1, line: 195, column: 5)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !567, file: !1, line: 195, type: !5)
!567 = distinct !DILexicalBlock(scope: !564, file: !1, line: 195, column: 5)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !569, file: !1, line: 196, type: !5)
!569 = distinct !DILexicalBlock(scope: !570, file: !1, line: 196, column: 5)
!570 = distinct !DILexicalBlock(scope: !571, file: !1, line: 196, column: 5)
!571 = distinct !DILexicalBlock(scope: !572, file: !1, line: 196, column: 5)
!572 = distinct !DILexicalBlock(scope: !573, file: !1, line: 196, column: 5)
!573 = distinct !DILexicalBlock(scope: !400, file: !1, line: 196, column: 5)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !575, file: !1, line: 196, type: !5)
!575 = distinct !DILexicalBlock(scope: !572, file: !1, line: 196, column: 5)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !577, file: !1, line: 200, type: !5)
!577 = distinct !DILexicalBlock(scope: !400, file: !1, line: 200, column: 5)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !579, file: !1, line: 200, type: !5)
!579 = distinct !DILexicalBlock(scope: !580, file: !1, line: 200, column: 5)
!580 = distinct !DILexicalBlock(scope: !577, file: !1, line: 200, column: 5)
!581 = !DISubprogram(name: "copy_grouping", scope: !1, file: !1, line: 52, type: !582, isLocal: true, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @copy_grouping, variables: !584)
!582 = !DISubroutineType(types: !583)
!583 = !{!5, !52}
!584 = !{!585, !586, !587, !588, !589, !594}
!585 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !581, file: !1, line: 52, type: !52)
!586 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !581, file: !1, line: 54, type: !44)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !581, file: !1, line: 55, type: !5)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !581, file: !1, line: 55, type: !5)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !590, file: !1, line: 75, type: !5)
!590 = distinct !DILexicalBlock(scope: !591, file: !1, line: 75, column: 13)
!591 = distinct !DILexicalBlock(scope: !592, file: !1, line: 74, column: 45)
!592 = distinct !DILexicalBlock(scope: !593, file: !1, line: 74, column: 13)
!593 = distinct !DILexicalBlock(scope: !581, file: !1, line: 69, column: 8)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !595, file: !1, line: 82, type: !5)
!595 = distinct !DILexicalBlock(scope: !596, file: !1, line: 82, column: 9)
!596 = distinct !DILexicalBlock(scope: !597, file: !1, line: 81, column: 15)
!597 = distinct !DILexicalBlock(scope: !581, file: !1, line: 81, column: 9)
!598 = !DISubprogram(name: "PyLocale_strcoll", scope: !1, file: !1, line: 209, type: !126, isLocal: true, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyLocale_strcoll, variables: !599)
!599 = !{!600, !601, !602, !603, !604, !605, !608}
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !598, file: !1, line: 209, type: !5)
!601 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !598, file: !1, line: 209, type: !5)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "os1", scope: !598, file: !1, line: 211, type: !5)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "os2", scope: !598, file: !1, line: 211, type: !5)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !598, file: !1, line: 211, type: !5)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ws1", scope: !598, file: !1, line: 212, type: !606)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64, align: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !95, line: 90, baseType: !44)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ws2", scope: !598, file: !1, line: 212, type: !606)
!609 = !DISubprogram(name: "PyLocale_strxfrm", scope: !1, file: !1, line: 240, type: !126, isLocal: true, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyLocale_strxfrm, variables: !610)
!610 = !{!611, !612, !613, !614, !615, !616, !617, !618, !619}
!611 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !609, file: !1, line: 240, type: !5)
!612 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !609, file: !1, line: 240, type: !5)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !609, file: !1, line: 242, type: !5)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n1", scope: !609, file: !1, line: 243, type: !11)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !609, file: !1, line: 244, type: !606)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !609, file: !1, line: 244, type: !606)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n2", scope: !609, file: !1, line: 245, type: !94)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !609, file: !1, line: 246, type: !5)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_buf", scope: !620, file: !1, line: 265, type: !606)
!620 = distinct !DILexicalBlock(scope: !621, file: !1, line: 263, column: 27)
!621 = distinct !DILexicalBlock(scope: !609, file: !1, line: 263, column: 9)
!622 = !DISubprogram(name: "PyLocale_nl_langinfo", scope: !1, file: !1, line: 434, type: !126, isLocal: true, isDefinition: true, scopeLine: 435, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyLocale_nl_langinfo, variables: !623)
!623 = !{!624, !625, !626, !627, !628}
!624 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !622, file: !1, line: 434, type: !5)
!625 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !622, file: !1, line: 434, type: !5)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !622, file: !1, line: 436, type: !44)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !622, file: !1, line: 436, type: !44)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !629, file: !1, line: 446, type: !29)
!629 = distinct !DILexicalBlock(scope: !630, file: !1, line: 443, column: 50)
!630 = distinct !DILexicalBlock(scope: !631, file: !1, line: 443, column: 13)
!631 = distinct !DILexicalBlock(scope: !632, file: !1, line: 442, column: 5)
!632 = distinct !DILexicalBlock(scope: !622, file: !1, line: 442, column: 5)
!633 = !DISubprogram(name: "PyIntl_gettext", scope: !1, file: !1, line: 462, type: !126, isLocal: true, isDefinition: true, scopeLine: 463, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyIntl_gettext, variables: !634)
!634 = !{!635, !636, !637}
!635 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !633, file: !1, line: 462, type: !5)
!636 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !633, file: !1, line: 462, type: !5)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !633, file: !1, line: 464, type: !52)
!638 = !DISubprogram(name: "PyIntl_dgettext", scope: !1, file: !1, line: 475, type: !126, isLocal: true, isDefinition: true, scopeLine: 476, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyIntl_dgettext, variables: !639)
!639 = !{!640, !641, !642, !643}
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !638, file: !1, line: 475, type: !5)
!641 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !638, file: !1, line: 475, type: !5)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "domain", scope: !638, file: !1, line: 477, type: !52)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !638, file: !1, line: 477, type: !52)
!644 = !DISubprogram(name: "PyIntl_dcgettext", scope: !1, file: !1, line: 488, type: !126, isLocal: true, isDefinition: true, scopeLine: 489, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyIntl_dcgettext, variables: !645)
!645 = !{!646, !647, !648, !649, !650}
!646 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !644, file: !1, line: 488, type: !5)
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !644, file: !1, line: 488, type: !5)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "domain", scope: !644, file: !1, line: 490, type: !52)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msgid", scope: !644, file: !1, line: 490, type: !52)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "category", scope: !644, file: !1, line: 491, type: !44)
!651 = !DISubprogram(name: "PyIntl_textdomain", scope: !1, file: !1, line: 502, type: !126, isLocal: true, isDefinition: true, scopeLine: 503, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyIntl_textdomain, variables: !652)
!652 = !{!653, !654, !655}
!653 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !651, file: !1, line: 502, type: !5)
!654 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !651, file: !1, line: 502, type: !5)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "domain", scope: !651, file: !1, line: 504, type: !52)
!656 = !DISubprogram(name: "PyIntl_bindtextdomain", scope: !1, file: !1, line: 520, type: !126, isLocal: true, isDefinition: true, scopeLine: 521, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyIntl_bindtextdomain, variables: !657)
!657 = !{!658, !659, !660, !661, !662, !663, !664, !665, !666, !670, !673, !675}
!658 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !656, file: !1, line: 520, type: !5)
!659 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !656, file: !1, line: 520, type: !5)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "domain", scope: !656, file: !1, line: 522, type: !52)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dirname", scope: !656, file: !1, line: 522, type: !52)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "current_dirname", scope: !656, file: !1, line: 522, type: !52)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dirname_obj", scope: !656, file: !1, line: 523, type: !5)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dirname_bytes", scope: !656, file: !1, line: 523, type: !5)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !656, file: !1, line: 523, type: !5)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !667, file: !1, line: 540, type: !5)
!667 = distinct !DILexicalBlock(scope: !668, file: !1, line: 540, column: 9)
!668 = distinct !DILexicalBlock(scope: !669, file: !1, line: 539, column: 34)
!669 = distinct !DILexicalBlock(scope: !656, file: !1, line: 539, column: 9)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !671, file: !1, line: 540, type: !5)
!671 = distinct !DILexicalBlock(scope: !672, file: !1, line: 540, column: 9)
!672 = distinct !DILexicalBlock(scope: !667, file: !1, line: 540, column: 9)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !674, file: !1, line: 545, type: !5)
!674 = distinct !DILexicalBlock(scope: !656, file: !1, line: 545, column: 5)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !676, file: !1, line: 545, type: !5)
!676 = distinct !DILexicalBlock(scope: !677, file: !1, line: 545, column: 5)
!677 = distinct !DILexicalBlock(scope: !674, file: !1, line: 545, column: 5)
!678 = !DISubprogram(name: "PyIntl_bind_textdomain_codeset", scope: !1, file: !1, line: 555, type: !126, isLocal: true, isDefinition: true, scopeLine: 556, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyIntl_bind_textdomain_codeset, variables: !679)
!679 = !{!680, !681, !682, !683}
!680 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !678, file: !1, line: 555, type: !5)
!681 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !678, file: !1, line: 555, type: !5)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "domain", scope: !678, file: !1, line: 557, type: !52)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codeset", scope: !678, file: !1, line: 557, type: !52)
!684 = !{!685, !686, !709, !713, !717, !721, !725, !729, !733, !737, !741, !742, !746, !750, !754, !758}
!685 = !DIGlobalVariable(name: "Error", scope: !0, file: !1, line: 43, type: !5, isLocal: true, isDefinition: true, variable: %struct._object** @Error)
!686 = !DIGlobalVariable(name: "_localemodule", scope: !0, file: !1, line: 609, type: !687, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @_localemodule)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !688, line: 47, size: 832, align: 64, elements: !689)
!688 = !DIFile(filename: "Include/moduleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!689 = !{!690, !699, !700, !701, !702, !705, !706, !707, !708}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !687, file: !688, line: 48, baseType: !691, size: 320, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !688, line: 38, baseType: !692)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !688, line: 33, size: 320, align: 64, elements: !693)
!693 = !{!694, !695, !697, !698}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !692, file: !688, line: 34, baseType: !6, size: 128, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !692, file: !688, line: 35, baseType: !696, size: 64, align: 64, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !692, file: !688, line: 36, baseType: !11, size: 64, align: 64, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !692, file: !688, line: 37, baseType: !5, size: 64, align: 64, offset: 256)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !687, file: !688, line: 49, baseType: !29, size: 64, align: 64, offset: 320)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !687, file: !688, line: 50, baseType: !29, size: 64, align: 64, offset: 384)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !687, file: !688, line: 51, baseType: !11, size: 64, align: 64, offset: 448)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !687, file: !688, line: 52, baseType: !703, size: 64, align: 64, offset: 512)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64, align: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !281, line: 47, baseType: !280)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !687, file: !688, line: 53, baseType: !142, size: 64, align: 64, offset: 576)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !687, file: !688, line: 54, baseType: !259, size: 64, align: 64, offset: 640)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !687, file: !688, line: 55, baseType: !142, size: 64, align: 64, offset: 704)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !687, file: !688, line: 56, baseType: !329, size: 64, align: 64, offset: 768)
!709 = !DIGlobalVariable(name: "locale__doc__", scope: !0, file: !1, line: 41, type: !710, isLocal: true, isDefinition: true, variable: [27 x i8]* @locale__doc__)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 216, align: 8, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 27)
!713 = !DIGlobalVariable(name: "PyLocale_Methods", scope: !0, file: !1, line: 569, type: !714, isLocal: true, isDefinition: true, variable: [12 x %struct.PyMethodDef]* @PyLocale_Methods)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 3072, align: 64, elements: !715)
!715 = !{!716}
!716 = !DISubrange(count: 12)
!717 = !DIGlobalVariable(name: "setlocale__doc__", scope: !0, file: !1, line: 47, type: !718, isLocal: true, isDefinition: true, variable: [70 x i8]* @setlocale__doc__)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 560, align: 8, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 70)
!721 = !DIGlobalVariable(name: "localeconv__doc__", scope: !0, file: !1, line: 130, type: !722, isLocal: true, isDefinition: true, variable: [69 x i8]* @localeconv__doc__)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 552, align: 8, elements: !723)
!723 = !{!724}
!724 = !DISubrange(count: 69)
!725 = !DIGlobalVariable(name: "strcoll__doc__", scope: !0, file: !1, line: 205, type: !726, isLocal: true, isDefinition: true, variable: [68 x i8]* @strcoll__doc__)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 544, align: 8, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 68)
!729 = !DIGlobalVariable(name: "strxfrm__doc__", scope: !0, file: !1, line: 234, type: !730, isLocal: true, isDefinition: true, variable: [100 x i8]* @strxfrm__doc__)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 800, align: 8, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 100)
!733 = !DIGlobalVariable(name: "nl_langinfo__doc__", scope: !0, file: !1, line: 429, type: !734, isLocal: true, isDefinition: true, variable: [92 x i8]* @nl_langinfo__doc__)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 736, align: 8, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 92)
!737 = !DIGlobalVariable(name: "gettext__doc__", scope: !0, file: !1, line: 457, type: !738, isLocal: true, isDefinition: true, variable: [50 x i8]* @gettext__doc__)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 400, align: 8, elements: !739)
!739 = !{!740}
!740 = !DISubrange(count: 50)
!741 = !DIGlobalVariable(name: "dgettext__doc__", scope: !0, file: !1, line: 470, type: !722, isLocal: true, isDefinition: true, variable: [69 x i8]* @dgettext__doc__)
!742 = !DIGlobalVariable(name: "dcgettext__doc__", scope: !0, file: !1, line: 483, type: !743, isLocal: true, isDefinition: true, variable: [93 x i8]* @dcgettext__doc__)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 744, align: 8, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 93)
!746 = !DIGlobalVariable(name: "textdomain__doc__", scope: !0, file: !1, line: 497, type: !747, isLocal: true, isDefinition: true, variable: [96 x i8]* @textdomain__doc__)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 768, align: 8, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: 96)
!750 = !DIGlobalVariable(name: "bindtextdomain__doc__", scope: !0, file: !1, line: 515, type: !751, isLocal: true, isDefinition: true, variable: [74 x i8]* @bindtextdomain__doc__)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 592, align: 8, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 74)
!754 = !DIGlobalVariable(name: "bind_textdomain_codeset__doc__", scope: !0, file: !1, line: 550, type: !755, isLocal: true, isDefinition: true, variable: [91 x i8]* @bind_textdomain_codeset__doc__)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 728, align: 8, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 91)
!758 = !DIGlobalVariable(name: "langinfo_constants", scope: !0, file: !1, line: 325, type: !759, isLocal: true, isDefinition: true, variable: [57 x %struct.langinfo_constant]* @langinfo_constants)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !760, size: 7296, align: 64, elements: !764)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "langinfo_constant", file: !1, line: 322, size: 128, align: 64, elements: !761)
!761 = !{!762, !763}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !760, file: !1, line: 323, baseType: !52, size: 64, align: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !760, file: !1, line: 324, baseType: !44, size: 32, align: 32, offset: 64)
!764 = !{!765}
!765 = !DISubrange(count: 57)
!766 = !{i32 2, !"Dwarf Version", i32 4}
!767 = !{i32 2, !"Debug Info Version", i32 3}
!768 = !{!"clang version 3.7.0 (tags/RELEASE_370/final)"}
!769 = !DILocation(line: 629, column: 9, scope: !344)
!770 = !DIExpression()
!771 = !DILocation(line: 624, column: 15, scope: !344)
!772 = !DILocation(line: 630, column: 11, scope: !773)
!773 = distinct !DILexicalBlock(scope: !344, file: !1, line: 630, column: 9)
!774 = !DILocation(line: 630, column: 9, scope: !344)
!775 = !DILocation(line: 633, column: 9, scope: !344)
!776 = !DILocation(line: 624, column: 19, scope: !344)
!777 = !DILocation(line: 635, column: 9, scope: !344)
!778 = !DILocation(line: 624, column: 23, scope: !344)
!779 = !DILocation(line: 636, column: 5, scope: !344)
!780 = !DILocation(line: 637, column: 5, scope: !781)
!781 = !DILexicalBlockFile(scope: !353, file: !1, discriminator: 1)
!782 = !DILocation(line: 637, column: 5, scope: !356)
!783 = !DILocation(line: 637, column: 5, scope: !353)
!784 = !DILocation(line: 637, column: 5, scope: !785)
!785 = !DILexicalBlockFile(scope: !355, file: !1, discriminator: 4)
!786 = !DILocation(line: 637, column: 5, scope: !787)
!787 = distinct !DILexicalBlock(scope: !355, file: !1, line: 637, column: 5)
!788 = !{!789, !790, i64 0}
!789 = !{!"_object", !790, i64 0, !793, i64 8}
!790 = !{!"long", !791, i64 0}
!791 = !{!"omnipotent char", !792, i64 0}
!792 = !{!"Simple C/C++ TBAA"}
!793 = !{!"any pointer", !791, i64 0}
!794 = !DILocation(line: 637, column: 5, scope: !355)
!795 = !DILocation(line: 637, column: 5, scope: !796)
!796 = !DILexicalBlockFile(scope: !787, file: !1, discriminator: 6)
!797 = !{!789, !793, i64 8}
!798 = !{!799, !793, i64 48}
!799 = !{!"_typeobject", !800, i64 0, !793, i64 24, !790, i64 32, !790, i64 40, !793, i64 48, !793, i64 56, !793, i64 64, !793, i64 72, !793, i64 80, !793, i64 88, !793, i64 96, !793, i64 104, !793, i64 112, !793, i64 120, !793, i64 128, !793, i64 136, !793, i64 144, !793, i64 152, !793, i64 160, !790, i64 168, !793, i64 176, !793, i64 184, !793, i64 192, !793, i64 200, !790, i64 208, !793, i64 216, !793, i64 224, !793, i64 232, !793, i64 240, !793, i64 248, !793, i64 256, !793, i64 264, !793, i64 272, !793, i64 280, !790, i64 288, !793, i64 296, !793, i64 304, !793, i64 312, !793, i64 320, !793, i64 328, !793, i64 336, !793, i64 344, !793, i64 352, !793, i64 360, !793, i64 368, !793, i64 376, !801, i64 384, !793, i64 392}
!800 = !{!"", !789, i64 0, !790, i64 16}
!801 = !{!"int", !791, i64 0}
!802 = !DILocation(line: 639, column: 9, scope: !344)
!803 = !DILocation(line: 640, column: 5, scope: !344)
!804 = !DILocation(line: 641, column: 5, scope: !805)
!805 = !DILexicalBlockFile(scope: !358, file: !1, discriminator: 1)
!806 = !DILocation(line: 641, column: 5, scope: !361)
!807 = !DILocation(line: 641, column: 5, scope: !358)
!808 = !DILocation(line: 641, column: 5, scope: !809)
!809 = !DILexicalBlockFile(scope: !360, file: !1, discriminator: 4)
!810 = !DILocation(line: 641, column: 5, scope: !811)
!811 = distinct !DILexicalBlock(scope: !360, file: !1, line: 641, column: 5)
!812 = !DILocation(line: 641, column: 5, scope: !360)
!813 = !DILocation(line: 641, column: 5, scope: !814)
!814 = !DILexicalBlockFile(scope: !811, file: !1, discriminator: 6)
!815 = !DILocation(line: 643, column: 9, scope: !344)
!816 = !DILocation(line: 644, column: 5, scope: !344)
!817 = !DILocation(line: 645, column: 5, scope: !818)
!818 = !DILexicalBlockFile(scope: !363, file: !1, discriminator: 1)
!819 = !DILocation(line: 645, column: 5, scope: !366)
!820 = !DILocation(line: 645, column: 5, scope: !363)
!821 = !DILocation(line: 645, column: 5, scope: !822)
!822 = !DILexicalBlockFile(scope: !365, file: !1, discriminator: 4)
!823 = !DILocation(line: 645, column: 5, scope: !824)
!824 = distinct !DILexicalBlock(scope: !365, file: !1, line: 645, column: 5)
