; ModuleID = '_operator.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !438, globals: !982)
!1 = !DIFile(filename: "./Modules/_operator.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !12, !350, !368, !376, !395, !397, !401, !409, !410, !394, !417, !419, !421, !423, !430}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !14, line: 109, baseType: !15)
!14 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !14, line: 105, size: 128, align: 64, elements: !16)
!16 = !{!17, !25}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !15, file: !14, line: 107, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !19, line: 177, baseType: !20)
!19 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !21, line: 102, baseType: !22)
!21 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !23, line: 181, baseType: !24)
!23 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!24 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !15, file: !14, line: 108, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !14, line: 334, size: 3200, align: 64, elements: !28)
!28 = !{!29, !35, !39, !40, !41, !46, !109, !114, !119, !120, !125, !177, !208, !220, !226, !227, !228, !230, !232, !263, !264, !265, !274, !275, !280, !281, !283, !285, !295, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !27, file: !14, line: 335, baseType: !30, size: 192, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !14, line: 114, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 111, size: 192, align: 64, elements: !32)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !14, line: 112, baseType: !13, size: 128, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !31, file: !14, line: 113, baseType: !18, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !27, file: !14, line: 336, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !27, file: !14, line: 341, baseType: !42, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !14, line: 308, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !12}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !27, file: !14, line: 342, baseType: !47, size: 64, align: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !14, line: 314, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !12, !52, !51}
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !21, line: 48, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !55, line: 246, size: 1728, align: 64, elements: !56)
!55 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!56 = !{!57, !58, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !78, !79, !80, !81, !83, !85, !87, !91, !94, !96, !97, !98, !99, !100, !104, !105}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !54, file: !55, line: 247, baseType: !51, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !54, file: !55, line: 252, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !54, file: !55, line: 253, baseType: !59, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !54, file: !55, line: 254, baseType: !59, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !54, file: !55, line: 255, baseType: !59, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !54, file: !55, line: 256, baseType: !59, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !54, file: !55, line: 257, baseType: !59, size: 64, align: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !54, file: !55, line: 258, baseType: !59, size: 64, align: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !54, file: !55, line: 259, baseType: !59, size: 64, align: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !54, file: !55, line: 261, baseType: !59, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !54, file: !55, line: 262, baseType: !59, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !54, file: !55, line: 263, baseType: !59, size: 64, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !54, file: !55, line: 265, baseType: !71, size: 64, align: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !55, line: 161, size: 192, align: 64, elements: !73)
!73 = !{!74, !75, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !72, file: !55, line: 162, baseType: !71, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !72, file: !55, line: 163, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !72, file: !55, line: 167, baseType: !51, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !54, file: !55, line: 267, baseType: !76, size: 64, align: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !54, file: !55, line: 269, baseType: !51, size: 32, align: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !54, file: !55, line: 273, baseType: !51, size: 32, align: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !54, file: !55, line: 275, baseType: !82, size: 64, align: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !23, line: 140, baseType: !24)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !54, file: !55, line: 279, baseType: !84, size: 16, align: 16, offset: 1024)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !54, file: !55, line: 280, baseType: !86, size: 8, align: 8, offset: 1040)
!86 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !54, file: !55, line: 281, baseType: !88, size: 8, align: 8, offset: 1048)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !54, file: !55, line: 285, baseType: !92, size: 64, align: 64, offset: 1088)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !55, line: 155, baseType: null)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !54, file: !55, line: 294, baseType: !95, size: 64, align: 64, offset: 1152)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !23, line: 141, baseType: !24)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !54, file: !55, line: 303, baseType: !11, size: 64, align: 64, offset: 1216)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !54, file: !55, line: 304, baseType: !11, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !54, file: !55, line: 305, baseType: !11, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !54, file: !55, line: 306, baseType: !11, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !54, file: !55, line: 307, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !54, file: !55, line: 309, baseType: !51, size: 32, align: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !54, file: !55, line: 311, baseType: !106, size: 160, align: 8, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !27, file: !14, line: 343, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !14, line: 316, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!12, !12, !59}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !27, file: !14, line: 344, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !14, line: 318, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!51, !12, !59, !12}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !27, file: !14, line: 345, baseType: !11, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !27, file: !14, line: 346, baseType: !121, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !14, line: 320, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!12, !12}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !27, file: !14, line: 350, baseType: !126, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !14, line: 278, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 236, size: 2176, align: 64, elements: !129)
!129 = !{!130, !135, !136, !137, !138, !139, !144, !146, !147, !148, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !128, file: !14, line: 241, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !14, line: 166, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!12, !12, !12}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !128, file: !14, line: 242, baseType: !131, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !128, file: !14, line: 243, baseType: !131, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !128, file: !14, line: 244, baseType: !131, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !128, file: !14, line: 245, baseType: !131, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !128, file: !14, line: 246, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !14, line: 167, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!12, !12, !12, !12}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !128, file: !14, line: 247, baseType: !145, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !14, line: 165, baseType: !122)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !128, file: !14, line: 248, baseType: !145, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !128, file: !14, line: 249, baseType: !145, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !128, file: !14, line: 250, baseType: !149, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !14, line: 168, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!51, !12}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !128, file: !14, line: 251, baseType: !145, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !128, file: !14, line: 252, baseType: !131, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !128, file: !14, line: 253, baseType: !131, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !128, file: !14, line: 254, baseType: !131, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !128, file: !14, line: 255, baseType: !131, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !128, file: !14, line: 256, baseType: !131, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !128, file: !14, line: 257, baseType: !145, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !128, file: !14, line: 258, baseType: !11, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !128, file: !14, line: 259, baseType: !145, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !128, file: !14, line: 261, baseType: !131, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !128, file: !14, line: 262, baseType: !131, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !128, file: !14, line: 263, baseType: !131, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !128, file: !14, line: 264, baseType: !131, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !128, file: !14, line: 265, baseType: !140, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !128, file: !14, line: 266, baseType: !131, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !128, file: !14, line: 267, baseType: !131, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !128, file: !14, line: 268, baseType: !131, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !128, file: !14, line: 269, baseType: !131, size: 64, align: 64, offset: 1728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !128, file: !14, line: 270, baseType: !131, size: 64, align: 64, offset: 1792)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !128, file: !14, line: 272, baseType: !131, size: 64, align: 64, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !128, file: !14, line: 273, baseType: !131, size: 64, align: 64, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !128, file: !14, line: 274, baseType: !131, size: 64, align: 64, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !128, file: !14, line: 275, baseType: !131, size: 64, align: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !128, file: !14, line: 277, baseType: !145, size: 64, align: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !27, file: !14, line: 351, baseType: !178, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !14, line: 292, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 280, size: 640, align: 64, elements: !181)
!181 = !{!182, !187, !188, !193, !194, !195, !200, !201, !206, !207}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !180, file: !14, line: 281, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !14, line: 169, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!18, !12}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !180, file: !14, line: 282, baseType: !131, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !180, file: !14, line: 283, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !14, line: 170, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!12, !12, !18}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !180, file: !14, line: 284, baseType: !189, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !180, file: !14, line: 285, baseType: !11, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !180, file: !14, line: 286, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !14, line: 172, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!51, !12, !18, !12}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !180, file: !14, line: 287, baseType: !11, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !180, file: !14, line: 288, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !14, line: 231, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!51, !12, !12}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !180, file: !14, line: 290, baseType: !131, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !180, file: !14, line: 291, baseType: !189, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !27, file: !14, line: 352, baseType: !209, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !14, line: 298, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 294, size: 192, align: 64, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !211, file: !14, line: 295, baseType: !183, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !211, file: !14, line: 296, baseType: !131, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !211, file: !14, line: 297, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !14, line: 174, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!51, !12, !12, !12}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !27, file: !14, line: 356, baseType: !221, size: 64, align: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !14, line: 321, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !12}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !19, line: 186, baseType: !18)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !27, file: !14, line: 357, baseType: !140, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !27, file: !14, line: 358, baseType: !121, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !27, file: !14, line: 359, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !14, line: 317, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !27, file: !14, line: 360, baseType: !231, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !14, line: 319, baseType: !217)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !27, file: !14, line: 363, baseType: !233, size: 64, align: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !14, line: 304, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 301, size: 128, align: 64, elements: !236)
!236 = !{!237, !258}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !235, file: !14, line: 302, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !14, line: 193, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!51, !12, !242, !51}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !14, line: 191, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !14, line: 178, size: 640, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !255, !256, !257}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !244, file: !14, line: 179, baseType: !11, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !244, file: !14, line: 180, baseType: !12, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !14, line: 181, baseType: !18, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !244, file: !14, line: 182, baseType: !18, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !244, file: !14, line: 184, baseType: !51, size: 32, align: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !244, file: !14, line: 185, baseType: !51, size: 32, align: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !244, file: !14, line: 186, baseType: !59, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !244, file: !14, line: 187, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !244, file: !14, line: 188, baseType: !254, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !244, file: !14, line: 189, baseType: !254, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !244, file: !14, line: 190, baseType: !11, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !235, file: !14, line: 303, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !14, line: 194, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !12, !242}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !27, file: !14, line: 366, baseType: !103, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !27, file: !14, line: 368, baseType: !36, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !27, file: !14, line: 372, baseType: !266, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !14, line: 233, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!51, !12, !270, !11}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !14, line: 232, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!51, !12, !11}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !27, file: !14, line: 375, baseType: !149, size: 64, align: 64, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !27, file: !14, line: 379, baseType: !276, size: 64, align: 64, offset: 1600)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !14, line: 322, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!12, !12, !12, !51}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !27, file: !14, line: 382, baseType: !18, size: 64, align: 64, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !27, file: !14, line: 385, baseType: !282, size: 64, align: 64, offset: 1728)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !14, line: 323, baseType: !122)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !27, file: !14, line: 386, baseType: !284, size: 64, align: 64, offset: 1792)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !14, line: 324, baseType: !122)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !27, file: !14, line: 389, baseType: !286, size: 64, align: 64, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 40, size: 256, align: 64, elements: !289)
!288 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 41, baseType: !36, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 18, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 43, baseType: !51, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 45, baseType: !36, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !27, file: !14, line: 390, baseType: !296, size: 64, align: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !14, line: 390, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !27, file: !14, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !59, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!12, !12, !11}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!51, !12, !12, !11}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !59, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !11, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !27, file: !14, line: 392, baseType: !26, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !27, file: !14, line: 393, baseType: !12, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !27, file: !14, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !14, line: 325, baseType: !141)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !27, file: !14, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !14, line: 326, baseType: !217)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !27, file: !14, line: 396, baseType: !18, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !27, file: !14, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !14, line: 327, baseType: !217)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !27, file: !14, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !14, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!12, !26, !18}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !27, file: !14, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !14, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!12, !26, !12, !12}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !27, file: !14, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !14, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !11}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !27, file: !14, line: 401, baseType: !149, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !27, file: !14, line: 402, baseType: !12, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !27, file: !14, line: 403, baseType: !12, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !27, file: !14, line: 404, baseType: !12, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !27, file: !14, line: 405, baseType: !12, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !27, file: !14, line: 406, baseType: !12, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !27, file: !14, line: 407, baseType: !42, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !27, file: !14, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !27, file: !14, line: 412, baseType: !42, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !352)
!352 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !353)
!353 = !{!354, !355, !356, !357, !365}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !352, file: !4, line: 291, baseType: !13, size: 128, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !352, file: !4, line: 292, baseType: !18, size: 64, align: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !352, file: !4, line: 293, baseType: !225, size: 64, align: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !352, file: !4, line: 349, baseType: !358, size: 32, align: 32, offset: 256)
!358 = !DICompositeType(tag: DW_TAG_structure_type, scope: !352, file: !4, line: 294, size: 32, align: 32, elements: !359)
!359 = !{!360, !361, !362, !363, !364}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !358, file: !4, line: 303, baseType: !348, size: 2, align: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !358, file: !4, line: 331, baseType: !348, size: 3, align: 32, offset: 2)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !358, file: !4, line: 336, baseType: !348, size: 1, align: 32, offset: 5)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !358, file: !4, line: 340, baseType: !348, size: 1, align: 32, offset: 6)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !358, file: !4, line: 345, baseType: !348, size: 1, align: 32, offset: 7)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !352, file: !4, line: 350, baseType: !366, size: 64, align: 64, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !102, line: 90, baseType: !51)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !370)
!370 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !371)
!371 = !{!372, !373, !374, !375}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !370, file: !4, line: 357, baseType: !351, size: 384, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !370, file: !4, line: 358, baseType: !18, size: 64, align: 64, offset: 384)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !370, file: !4, line: 360, baseType: !59, size: 64, align: 64, offset: 448)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !370, file: !4, line: 361, baseType: !18, size: 64, align: 64, offset: 512)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !378)
!378 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !379)
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !378, file: !4, line: 369, baseType: !369, size: 576, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !378, file: !4, line: 375, baseType: !382, size: 64, align: 64, offset: 576)
!382 = !DICompositeType(tag: DW_TAG_union_type, scope: !378, file: !4, line: 370, size: 64, align: 64, elements: !383)
!383 = !{!384, !385, !389, !392}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !382, file: !4, line: 371, baseType: !11, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !382, file: !4, line: 372, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !388)
!388 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !382, file: !4, line: 373, baseType: !390, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !84)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !382, file: !4, line: 374, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !348)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !388)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !403, line: 33, baseType: !404)
!403 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!404 = !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 25, size: 256, align: 64, elements: !405)
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !404, file: !403, line: 26, baseType: !30, size: 192, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !404, file: !403, line: 27, baseType: !408, size: 64, align: 64, offset: 192)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, align: 64, elements: !89)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "itemgetterobject", file: !1, line: 404, baseType: !412)
!412 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 400, size: 256, align: 64, elements: !413)
!413 = !{!414, !415, !416}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !412, file: !1, line: 401, baseType: !13, size: 128, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "nitems", scope: !412, file: !1, line: 402, baseType: !18, size: 64, align: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !412, file: !1, line: 403, baseType: !12, size: 64, align: 64, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !387)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "attrgetterobject", file: !1, line: 541, baseType: !425)
!425 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 537, size: 256, align: 64, elements: !426)
!426 = !{!427, !428, !429}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !425, file: !1, line: 538, baseType: !13, size: 128, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "nattrs", scope: !425, file: !1, line: 539, baseType: !18, size: 64, align: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !425, file: !1, line: 540, baseType: !12, size: 64, align: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "methodcallerobject", file: !1, line: 796, baseType: !432)
!432 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 791, size: 320, align: 64, elements: !433)
!433 = !{!434, !435, !436, !437}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !432, file: !1, line: 792, baseType: !13, size: 128, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !432, file: !1, line: 793, baseType: !12, size: 64, align: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !432, file: !1, line: 794, baseType: !12, size: 64, align: 64, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "kwds", scope: !432, file: !1, line: 795, baseType: !12, size: 64, align: 64, offset: 256)
!438 = !{!439, !444, !449, !456, !463, !470, !477, !484, !488, !494, !500, !506, !512, !518, !524, !528, !532, !536, !540, !544, !550, !556, !561, !567, !573, !579, !585, !591, !597, !603, !609, !615, !621, !627, !633, !639, !645, !651, !657, !663, !670, !676, !682, !688, !694, !700, !706, !712, !718, !724, !735, !749, !756, !766, !786, !797, !809, !819, !839, !854, !865, !921, !941, !953, !968}
!439 = !DISubprogram(name: "PyInit__operator", scope: !1, file: !1, line: 936, type: !440, isLocal: false, isDefinition: true, scopeLine: 937, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__operator, variables: !442)
!440 = !DISubroutineType(types: !441)
!441 = !{!12}
!442 = !{!443}
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !439, file: !1, line: 938, type: !12)
!444 = !DISubprogram(name: "truth", scope: !1, file: !1, line: 68, type: !133, isLocal: true, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @truth, variables: !445)
!445 = !{!446, !447, !448}
!446 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !444, file: !1, line: 68, type: !12)
!447 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a1", arg: 2, scope: !444, file: !1, line: 68, type: !12)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !444, file: !1, line: 68, type: !24)
!449 = !DISubprogram(name: "op_contains", scope: !1, file: !1, line: 99, type: !133, isLocal: true, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_contains, variables: !450)
!450 = !{!451, !452, !453, !454, !455}
!451 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !449, file: !1, line: 99, type: !12)
!452 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !449, file: !1, line: 99, type: !12)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !449, file: !1, line: 99, type: !12)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !449, file: !1, line: 99, type: !12)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !449, file: !1, line: 99, type: !24)
!456 = !DISubprogram(name: "indexOf", scope: !1, file: !1, line: 100, type: !133, isLocal: true, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @indexOf, variables: !457)
!457 = !{!458, !459, !460, !461, !462}
!458 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !456, file: !1, line: 100, type: !12)
!459 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !456, file: !1, line: 100, type: !12)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !456, file: !1, line: 100, type: !12)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !456, file: !1, line: 100, type: !12)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !456, file: !1, line: 100, type: !18)
!463 = !DISubprogram(name: "countOf", scope: !1, file: !1, line: 101, type: !133, isLocal: true, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @countOf, variables: !464)
!464 = !{!465, !466, !467, !468, !469}
!465 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !463, file: !1, line: 101, type: !12)
!466 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !463, file: !1, line: 101, type: !12)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !463, file: !1, line: 101, type: !12)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !463, file: !1, line: 101, type: !12)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !463, file: !1, line: 101, type: !18)
!470 = !DISubprogram(name: "is_", scope: !1, file: !1, line: 137, type: !133, isLocal: true, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @is_, variables: !471)
!471 = !{!472, !473, !474, !475, !476}
!472 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !470, file: !1, line: 137, type: !12)
!473 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !470, file: !1, line: 137, type: !12)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !470, file: !1, line: 139, type: !12)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !470, file: !1, line: 139, type: !12)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !470, file: !1, line: 139, type: !12)
!477 = !DISubprogram(name: "is_not", scope: !1, file: !1, line: 148, type: !133, isLocal: true, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @is_not, variables: !478)
!478 = !{!479, !480, !481, !482, !483}
!479 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !477, file: !1, line: 148, type: !12)
!480 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !477, file: !1, line: 148, type: !12)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !477, file: !1, line: 150, type: !12)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !477, file: !1, line: 150, type: !12)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !477, file: !1, line: 150, type: !12)
!484 = !DISubprogram(name: "op_index", scope: !1, file: !1, line: 131, type: !133, isLocal: true, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_index, variables: !485)
!485 = !{!486, !487}
!486 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !484, file: !1, line: 131, type: !12)
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !484, file: !1, line: 131, type: !12)
!488 = !DISubprogram(name: "op_add", scope: !1, file: !1, line: 69, type: !133, isLocal: true, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_add, variables: !489)
!489 = !{!490, !491, !492, !493}
!490 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !488, file: !1, line: 69, type: !12)
!491 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !488, file: !1, line: 69, type: !12)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !488, file: !1, line: 69, type: !12)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !488, file: !1, line: 69, type: !12)
!494 = !DISubprogram(name: "op_sub", scope: !1, file: !1, line: 70, type: !133, isLocal: true, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_sub, variables: !495)
!495 = !{!496, !497, !498, !499}
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !494, file: !1, line: 70, type: !12)
!497 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !494, file: !1, line: 70, type: !12)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !494, file: !1, line: 70, type: !12)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !494, file: !1, line: 70, type: !12)
!500 = !DISubprogram(name: "op_mul", scope: !1, file: !1, line: 71, type: !133, isLocal: true, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_mul, variables: !501)
!501 = !{!502, !503, !504, !505}
!502 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !500, file: !1, line: 71, type: !12)
!503 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !500, file: !1, line: 71, type: !12)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !500, file: !1, line: 71, type: !12)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !500, file: !1, line: 71, type: !12)
!506 = !DISubprogram(name: "op_floordiv", scope: !1, file: !1, line: 72, type: !133, isLocal: true, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_floordiv, variables: !507)
!507 = !{!508, !509, !510, !511}
!508 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !506, file: !1, line: 72, type: !12)
!509 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !506, file: !1, line: 72, type: !12)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !506, file: !1, line: 72, type: !12)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !506, file: !1, line: 72, type: !12)
!512 = !DISubprogram(name: "op_truediv", scope: !1, file: !1, line: 73, type: !133, isLocal: true, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_truediv, variables: !513)
!513 = !{!514, !515, !516, !517}
!514 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !512, file: !1, line: 73, type: !12)
!515 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !512, file: !1, line: 73, type: !12)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !512, file: !1, line: 73, type: !12)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !512, file: !1, line: 73, type: !12)
!518 = !DISubprogram(name: "op_mod", scope: !1, file: !1, line: 74, type: !133, isLocal: true, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_mod, variables: !519)
!519 = !{!520, !521, !522, !523}
!520 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !518, file: !1, line: 74, type: !12)
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !518, file: !1, line: 74, type: !12)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !518, file: !1, line: 74, type: !12)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !518, file: !1, line: 74, type: !12)
!524 = !DISubprogram(name: "op_neg", scope: !1, file: !1, line: 75, type: !133, isLocal: true, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_neg, variables: !525)
!525 = !{!526, !527}
!526 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !524, file: !1, line: 75, type: !12)
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a1", arg: 2, scope: !524, file: !1, line: 75, type: !12)
!528 = !DISubprogram(name: "op_pos", scope: !1, file: !1, line: 76, type: !133, isLocal: true, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_pos, variables: !529)
!529 = !{!530, !531}
!530 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !528, file: !1, line: 76, type: !12)
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a1", arg: 2, scope: !528, file: !1, line: 76, type: !12)
!532 = !DISubprogram(name: "op_abs", scope: !1, file: !1, line: 77, type: !133, isLocal: true, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_abs, variables: !533)
!533 = !{!534, !535}
!534 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !532, file: !1, line: 77, type: !12)
!535 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a1", arg: 2, scope: !532, file: !1, line: 77, type: !12)
!536 = !DISubprogram(name: "op_inv", scope: !1, file: !1, line: 78, type: !133, isLocal: true, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_inv, variables: !537)
!537 = !{!538, !539}
!538 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !536, file: !1, line: 78, type: !12)
!539 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a1", arg: 2, scope: !536, file: !1, line: 78, type: !12)
!540 = !DISubprogram(name: "op_invert", scope: !1, file: !1, line: 79, type: !133, isLocal: true, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_invert, variables: !541)
!541 = !{!542, !543}
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !540, file: !1, line: 79, type: !12)
!543 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a1", arg: 2, scope: !540, file: !1, line: 79, type: !12)
!544 = !DISubprogram(name: "op_lshift", scope: !1, file: !1, line: 80, type: !133, isLocal: true, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_lshift, variables: !545)
!545 = !{!546, !547, !548, !549}
!546 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !544, file: !1, line: 80, type: !12)
!547 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !544, file: !1, line: 80, type: !12)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !544, file: !1, line: 80, type: !12)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !544, file: !1, line: 80, type: !12)
!550 = !DISubprogram(name: "op_rshift", scope: !1, file: !1, line: 81, type: !133, isLocal: true, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_rshift, variables: !551)
!551 = !{!552, !553, !554, !555}
!552 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !550, file: !1, line: 81, type: !12)
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !550, file: !1, line: 81, type: !12)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !550, file: !1, line: 81, type: !12)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !550, file: !1, line: 81, type: !12)
!556 = !DISubprogram(name: "op_not_", scope: !1, file: !1, line: 82, type: !133, isLocal: true, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_not_, variables: !557)
!557 = !{!558, !559, !560}
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !556, file: !1, line: 82, type: !12)
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a1", arg: 2, scope: !556, file: !1, line: 82, type: !12)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !556, file: !1, line: 82, type: !24)
!561 = !DISubprogram(name: "op_and_", scope: !1, file: !1, line: 83, type: !133, isLocal: true, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_and_, variables: !562)
!562 = !{!563, !564, !565, !566}
!563 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !561, file: !1, line: 83, type: !12)
!564 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !561, file: !1, line: 83, type: !12)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !561, file: !1, line: 83, type: !12)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !561, file: !1, line: 83, type: !12)
!567 = !DISubprogram(name: "op_xor", scope: !1, file: !1, line: 84, type: !133, isLocal: true, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_xor, variables: !568)
!568 = !{!569, !570, !571, !572}
!569 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !567, file: !1, line: 84, type: !12)
!570 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !567, file: !1, line: 84, type: !12)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !567, file: !1, line: 84, type: !12)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !567, file: !1, line: 84, type: !12)
!573 = !DISubprogram(name: "op_or_", scope: !1, file: !1, line: 85, type: !133, isLocal: true, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_or_, variables: !574)
!574 = !{!575, !576, !577, !578}
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !573, file: !1, line: 85, type: !12)
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !573, file: !1, line: 85, type: !12)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !573, file: !1, line: 85, type: !12)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !573, file: !1, line: 85, type: !12)
!579 = !DISubprogram(name: "op_iadd", scope: !1, file: !1, line: 86, type: !133, isLocal: true, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_iadd, variables: !580)
!580 = !{!581, !582, !583, !584}
!581 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !579, file: !1, line: 86, type: !12)
!582 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !579, file: !1, line: 86, type: !12)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !579, file: !1, line: 86, type: !12)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !579, file: !1, line: 86, type: !12)
!585 = !DISubprogram(name: "op_isub", scope: !1, file: !1, line: 87, type: !133, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_isub, variables: !586)
!586 = !{!587, !588, !589, !590}
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !585, file: !1, line: 87, type: !12)
!588 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !585, file: !1, line: 87, type: !12)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !585, file: !1, line: 87, type: !12)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !585, file: !1, line: 87, type: !12)
!591 = !DISubprogram(name: "op_imul", scope: !1, file: !1, line: 88, type: !133, isLocal: true, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_imul, variables: !592)
!592 = !{!593, !594, !595, !596}
!593 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !591, file: !1, line: 88, type: !12)
!594 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !591, file: !1, line: 88, type: !12)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !591, file: !1, line: 88, type: !12)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !591, file: !1, line: 88, type: !12)
!597 = !DISubprogram(name: "op_ifloordiv", scope: !1, file: !1, line: 89, type: !133, isLocal: true, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_ifloordiv, variables: !598)
!598 = !{!599, !600, !601, !602}
!599 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !597, file: !1, line: 89, type: !12)
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !597, file: !1, line: 89, type: !12)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !597, file: !1, line: 89, type: !12)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !597, file: !1, line: 89, type: !12)
!603 = !DISubprogram(name: "op_itruediv", scope: !1, file: !1, line: 90, type: !133, isLocal: true, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_itruediv, variables: !604)
!604 = !{!605, !606, !607, !608}
!605 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !603, file: !1, line: 90, type: !12)
!606 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !603, file: !1, line: 90, type: !12)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !603, file: !1, line: 90, type: !12)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !603, file: !1, line: 90, type: !12)
!609 = !DISubprogram(name: "op_imod", scope: !1, file: !1, line: 91, type: !133, isLocal: true, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_imod, variables: !610)
!610 = !{!611, !612, !613, !614}
!611 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !609, file: !1, line: 91, type: !12)
!612 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !609, file: !1, line: 91, type: !12)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !609, file: !1, line: 91, type: !12)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !609, file: !1, line: 91, type: !12)
!615 = !DISubprogram(name: "op_ilshift", scope: !1, file: !1, line: 92, type: !133, isLocal: true, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_ilshift, variables: !616)
!616 = !{!617, !618, !619, !620}
!617 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !615, file: !1, line: 92, type: !12)
!618 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !615, file: !1, line: 92, type: !12)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !615, file: !1, line: 92, type: !12)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !615, file: !1, line: 92, type: !12)
!621 = !DISubprogram(name: "op_irshift", scope: !1, file: !1, line: 93, type: !133, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_irshift, variables: !622)
!622 = !{!623, !624, !625, !626}
!623 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !621, file: !1, line: 93, type: !12)
!624 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !621, file: !1, line: 93, type: !12)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !621, file: !1, line: 93, type: !12)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !621, file: !1, line: 93, type: !12)
!627 = !DISubprogram(name: "op_iand", scope: !1, file: !1, line: 94, type: !133, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_iand, variables: !628)
!628 = !{!629, !630, !631, !632}
!629 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !627, file: !1, line: 94, type: !12)
!630 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !627, file: !1, line: 94, type: !12)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !627, file: !1, line: 94, type: !12)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !627, file: !1, line: 94, type: !12)
!633 = !DISubprogram(name: "op_ixor", scope: !1, file: !1, line: 95, type: !133, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_ixor, variables: !634)
!634 = !{!635, !636, !637, !638}
!635 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !633, file: !1, line: 95, type: !12)
!636 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !633, file: !1, line: 95, type: !12)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !633, file: !1, line: 95, type: !12)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !633, file: !1, line: 95, type: !12)
!639 = !DISubprogram(name: "op_ior", scope: !1, file: !1, line: 96, type: !133, isLocal: true, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_ior, variables: !640)
!640 = !{!641, !642, !643, !644}
!641 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !639, file: !1, line: 96, type: !12)
!642 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !639, file: !1, line: 96, type: !12)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !639, file: !1, line: 96, type: !12)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !639, file: !1, line: 96, type: !12)
!645 = !DISubprogram(name: "op_concat", scope: !1, file: !1, line: 97, type: !133, isLocal: true, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_concat, variables: !646)
!646 = !{!647, !648, !649, !650}
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !645, file: !1, line: 97, type: !12)
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !645, file: !1, line: 97, type: !12)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !645, file: !1, line: 97, type: !12)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !645, file: !1, line: 97, type: !12)
!651 = !DISubprogram(name: "op_iconcat", scope: !1, file: !1, line: 98, type: !133, isLocal: true, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_iconcat, variables: !652)
!652 = !{!653, !654, !655, !656}
!653 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !651, file: !1, line: 98, type: !12)
!654 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !651, file: !1, line: 98, type: !12)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !651, file: !1, line: 98, type: !12)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !651, file: !1, line: 98, type: !12)
!657 = !DISubprogram(name: "op_getitem", scope: !1, file: !1, line: 102, type: !133, isLocal: true, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_getitem, variables: !658)
!658 = !{!659, !660, !661, !662}
!659 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !657, file: !1, line: 102, type: !12)
!660 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !657, file: !1, line: 102, type: !12)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !657, file: !1, line: 102, type: !12)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !657, file: !1, line: 102, type: !12)
!663 = !DISubprogram(name: "op_setitem", scope: !1, file: !1, line: 104, type: !133, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_setitem, variables: !664)
!664 = !{!665, !666, !667, !668, !669}
!665 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !663, file: !1, line: 104, type: !12)
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !663, file: !1, line: 104, type: !12)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !663, file: !1, line: 104, type: !12)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !663, file: !1, line: 104, type: !12)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a3", scope: !663, file: !1, line: 104, type: !12)
!670 = !DISubprogram(name: "op_delitem", scope: !1, file: !1, line: 103, type: !133, isLocal: true, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_delitem, variables: !671)
!671 = !{!672, !673, !674, !675}
!672 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !670, file: !1, line: 103, type: !12)
!673 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !670, file: !1, line: 103, type: !12)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !670, file: !1, line: 103, type: !12)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !670, file: !1, line: 103, type: !12)
!676 = !DISubprogram(name: "op_pow", scope: !1, file: !1, line: 113, type: !133, isLocal: true, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_pow, variables: !677)
!677 = !{!678, !679, !680, !681}
!678 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !676, file: !1, line: 113, type: !12)
!679 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !676, file: !1, line: 113, type: !12)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !676, file: !1, line: 115, type: !12)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !676, file: !1, line: 115, type: !12)
!682 = !DISubprogram(name: "op_ipow", scope: !1, file: !1, line: 122, type: !133, isLocal: true, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_ipow, variables: !683)
!683 = !{!684, !685, !686, !687}
!684 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !682, file: !1, line: 122, type: !12)
!685 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !682, file: !1, line: 122, type: !12)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !682, file: !1, line: 124, type: !12)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !682, file: !1, line: 124, type: !12)
!688 = !DISubprogram(name: "op_lt", scope: !1, file: !1, line: 105, type: !133, isLocal: true, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_lt, variables: !689)
!689 = !{!690, !691, !692, !693}
!690 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !688, file: !1, line: 105, type: !12)
!691 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !688, file: !1, line: 105, type: !12)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !688, file: !1, line: 105, type: !12)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !688, file: !1, line: 105, type: !12)
!694 = !DISubprogram(name: "op_le", scope: !1, file: !1, line: 106, type: !133, isLocal: true, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_le, variables: !695)
!695 = !{!696, !697, !698, !699}
!696 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !694, file: !1, line: 106, type: !12)
!697 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !694, file: !1, line: 106, type: !12)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !694, file: !1, line: 106, type: !12)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !694, file: !1, line: 106, type: !12)
!700 = !DISubprogram(name: "op_eq", scope: !1, file: !1, line: 107, type: !133, isLocal: true, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_eq, variables: !701)
!701 = !{!702, !703, !704, !705}
!702 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !700, file: !1, line: 107, type: !12)
!703 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !700, file: !1, line: 107, type: !12)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !700, file: !1, line: 107, type: !12)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !700, file: !1, line: 107, type: !12)
!706 = !DISubprogram(name: "op_ne", scope: !1, file: !1, line: 108, type: !133, isLocal: true, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_ne, variables: !707)
!707 = !{!708, !709, !710, !711}
!708 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !706, file: !1, line: 108, type: !12)
!709 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !706, file: !1, line: 108, type: !12)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !706, file: !1, line: 108, type: !12)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !706, file: !1, line: 108, type: !12)
!712 = !DISubprogram(name: "op_gt", scope: !1, file: !1, line: 109, type: !133, isLocal: true, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_gt, variables: !713)
!713 = !{!714, !715, !716, !717}
!714 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !712, file: !1, line: 109, type: !12)
!715 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !712, file: !1, line: 109, type: !12)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !712, file: !1, line: 109, type: !12)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !712, file: !1, line: 109, type: !12)
!718 = !DISubprogram(name: "op_ge", scope: !1, file: !1, line: 110, type: !133, isLocal: true, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_ge, variables: !719)
!719 = !{!720, !721, !722, !723}
!720 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !718, file: !1, line: 110, type: !12)
!721 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !718, file: !1, line: 110, type: !12)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !718, file: !1, line: 110, type: !12)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !718, file: !1, line: 110, type: !12)
!724 = !DISubprogram(name: "compare_digest", scope: !1, file: !1, line: 249, type: !133, isLocal: true, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @compare_digest, variables: !725)
!725 = !{!726, !727, !728, !729, !730, !731, !734}
!726 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !724, file: !1, line: 249, type: !12)
!727 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !724, file: !1, line: 249, type: !12)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !724, file: !1, line: 251, type: !12)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !724, file: !1, line: 251, type: !12)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !724, file: !1, line: 252, type: !51)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view_a", scope: !732, file: !1, line: 277, type: !243)
!732 = distinct !DILexicalBlock(scope: !733, file: !1, line: 276, column: 10)
!733 = distinct !DILexicalBlock(scope: !724, file: !1, line: 259, column: 8)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view_b", scope: !732, file: !1, line: 278, type: !243)
!735 = !DISubprogram(name: "_tscmp", scope: !1, file: !1, line: 174, type: !736, isLocal: true, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: true, variables: !738)
!736 = !DISubroutineType(types: !737)
!737 = !{!51, !395, !395, !18, !18}
!738 = !{!739, !740, !741, !742, !743, !745, !746, !747, !748}
!739 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !735, file: !1, line: 174, type: !395)
!740 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !735, file: !1, line: 174, type: !395)
!741 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len_a", arg: 3, scope: !735, file: !1, line: 175, type: !18)
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len_b", arg: 4, scope: !735, file: !1, line: 175, type: !18)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !735, file: !1, line: 181, type: !744)
!744 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !18)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left", scope: !735, file: !1, line: 182, type: !398)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "right", scope: !735, file: !1, line: 183, type: !398)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !735, file: !1, line: 184, type: !18)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !735, file: !1, line: 185, type: !388)
!749 = !DISubprogram(name: "length_hint", scope: !1, file: !1, line: 221, type: !133, isLocal: true, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @length_hint, variables: !750)
!750 = !{!751, !752, !753, !754, !755}
!751 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !749, file: !1, line: 221, type: !12)
!752 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !749, file: !1, line: 221, type: !12)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !749, file: !1, line: 223, type: !12)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "defaultvalue", scope: !749, file: !1, line: 224, type: !18)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !749, file: !1, line: 224, type: !18)
!756 = !DISubprogram(name: "itemgetter_dealloc", scope: !1, file: !1, line: 439, type: !757, isLocal: true, isDefinition: true, scopeLine: 440, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.itemgetterobject*)* @itemgetter_dealloc, variables: !759)
!757 = !DISubroutineType(types: !758)
!758 = !{null, !410}
!759 = !{!760, !761, !763}
!760 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ig", arg: 1, scope: !756, file: !1, line: 439, type: !410)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !762, file: !1, line: 442, type: !12)
!762 = distinct !DILexicalBlock(scope: !756, file: !1, line: 442, column: 5)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !764, file: !1, line: 442, type: !12)
!764 = distinct !DILexicalBlock(scope: !765, file: !1, line: 442, column: 5)
!765 = distinct !DILexicalBlock(scope: !762, file: !1, line: 442, column: 5)
!766 = !DISubprogram(name: "itemgetter_call", scope: !1, file: !1, line: 454, type: !767, isLocal: true, isDefinition: true, scopeLine: 455, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.itemgetterobject*, %struct._object*, %struct._object*)* @itemgetter_call, variables: !769)
!767 = !DISubroutineType(types: !768)
!768 = !{!12, !410, !12, !12}
!769 = !{!770, !771, !772, !773, !774, !775, !776, !777, !781, !782}
!770 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ig", arg: 1, scope: !766, file: !1, line: 454, type: !410)
!771 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !766, file: !1, line: 454, type: !12)
!772 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !766, file: !1, line: 454, type: !12)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !766, file: !1, line: 456, type: !12)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !766, file: !1, line: 456, type: !12)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !766, file: !1, line: 457, type: !18)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nitems", scope: !766, file: !1, line: 457, type: !18)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !778, file: !1, line: 472, type: !12)
!778 = distinct !DILexicalBlock(scope: !779, file: !1, line: 471, column: 34)
!779 = distinct !DILexicalBlock(scope: !780, file: !1, line: 471, column: 5)
!780 = distinct !DILexicalBlock(scope: !766, file: !1, line: 471, column: 5)
!781 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !778, file: !1, line: 472, type: !12)
!782 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !783, file: !1, line: 476, type: !12)
!783 = distinct !DILexicalBlock(scope: !784, file: !1, line: 476, column: 13)
!784 = distinct !DILexicalBlock(scope: !785, file: !1, line: 475, column: 26)
!785 = distinct !DILexicalBlock(scope: !778, file: !1, line: 475, column: 13)
!786 = !DISubprogram(name: "itemgetter_traverse", scope: !1, file: !1, line: 447, type: !787, isLocal: true, isDefinition: true, scopeLine: 448, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.itemgetterobject*, i32 (%struct._object*, i8*)*, i8*)* @itemgetter_traverse, variables: !789)
!787 = !DISubroutineType(types: !788)
!788 = !{!51, !410, !270, !11}
!789 = !{!790, !791, !792, !793}
!790 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ig", arg: 1, scope: !786, file: !1, line: 447, type: !410)
!791 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !786, file: !1, line: 447, type: !270)
!792 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !786, file: !1, line: 447, type: !11)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !794, file: !1, line: 449, type: !51)
!794 = distinct !DILexicalBlock(scope: !795, file: !1, line: 449, column: 5)
!795 = distinct !DILexicalBlock(scope: !796, file: !1, line: 449, column: 5)
!796 = distinct !DILexicalBlock(scope: !786, file: !1, line: 449, column: 5)
!797 = !DISubprogram(name: "itemgetter_new", scope: !1, file: !1, line: 409, type: !798, isLocal: true, isDefinition: true, scopeLine: 410, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @itemgetter_new, variables: !802)
!798 = !DISubroutineType(types: !799)
!799 = !{!12, !800, !12, !12}
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64, align: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !14, line: 422, baseType: !27)
!802 = !{!803, !804, !805, !806, !807, !808}
!803 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !797, file: !1, line: 409, type: !800)
!804 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !797, file: !1, line: 409, type: !12)
!805 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !797, file: !1, line: 409, type: !12)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ig", scope: !797, file: !1, line: 411, type: !410)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !797, file: !1, line: 412, type: !12)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nitems", scope: !797, file: !1, line: 413, type: !18)
!809 = !DISubprogram(name: "attrgetter_dealloc", scope: !1, file: !1, line: 658, type: !810, isLocal: true, isDefinition: true, scopeLine: 659, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.attrgetterobject*)* @attrgetter_dealloc, variables: !812)
!810 = !DISubroutineType(types: !811)
!811 = !{null, !423}
!812 = !{!813, !814, !816}
!813 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ag", arg: 1, scope: !809, file: !1, line: 658, type: !423)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !815, file: !1, line: 661, type: !12)
!815 = distinct !DILexicalBlock(scope: !809, file: !1, line: 661, column: 5)
!816 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !817, file: !1, line: 661, type: !12)
!817 = distinct !DILexicalBlock(scope: !818, file: !1, line: 661, column: 5)
!818 = distinct !DILexicalBlock(scope: !815, file: !1, line: 661, column: 5)
!819 = !DISubprogram(name: "attrgetter_call", scope: !1, file: !1, line: 706, type: !820, isLocal: true, isDefinition: true, scopeLine: 707, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.attrgetterobject*, %struct._object*, %struct._object*)* @attrgetter_call, variables: !822)
!820 = !DISubroutineType(types: !821)
!821 = !{!12, !423, !12, !12}
!822 = !{!823, !824, !825, !826, !827, !828, !829, !830, !834, !835}
!823 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ag", arg: 1, scope: !819, file: !1, line: 706, type: !423)
!824 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !819, file: !1, line: 706, type: !12)
!825 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !819, file: !1, line: 706, type: !12)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !819, file: !1, line: 708, type: !12)
!827 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !819, file: !1, line: 708, type: !12)
!828 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !819, file: !1, line: 709, type: !18)
!829 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nattrs", scope: !819, file: !1, line: 709, type: !18)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "attr", scope: !831, file: !1, line: 724, type: !12)
!831 = distinct !DILexicalBlock(scope: !832, file: !1, line: 723, column: 34)
!832 = distinct !DILexicalBlock(scope: !833, file: !1, line: 723, column: 5)
!833 = distinct !DILexicalBlock(scope: !819, file: !1, line: 723, column: 5)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !831, file: !1, line: 724, type: !12)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !836, file: !1, line: 728, type: !12)
!836 = distinct !DILexicalBlock(scope: !837, file: !1, line: 728, column: 13)
!837 = distinct !DILexicalBlock(scope: !838, file: !1, line: 727, column: 26)
!838 = distinct !DILexicalBlock(scope: !831, file: !1, line: 727, column: 13)
!839 = !DISubprogram(name: "dotted_getattr", scope: !1, file: !1, line: 673, type: !133, isLocal: true, isDefinition: true, scopeLine: 674, flags: DIFlagPrototyped, isOptimized: true, variables: !840)
!840 = !{!841, !842, !843, !844, !847, !848, !849}
!841 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !839, file: !1, line: 673, type: !12)
!842 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !839, file: !1, line: 673, type: !12)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newobj", scope: !839, file: !1, line: 675, type: !12)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name_idx", scope: !845, file: !1, line: 680, type: !18)
!845 = distinct !DILexicalBlock(scope: !846, file: !1, line: 679, column: 35)
!846 = distinct !DILexicalBlock(scope: !839, file: !1, line: 679, column: 9)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name_count", scope: !845, file: !1, line: 680, type: !18)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "attr_name", scope: !845, file: !1, line: 681, type: !12)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !850, file: !1, line: 688, type: !12)
!850 = distinct !DILexicalBlock(scope: !851, file: !1, line: 688, column: 13)
!851 = distinct !DILexicalBlock(scope: !852, file: !1, line: 685, column: 63)
!852 = distinct !DILexicalBlock(scope: !853, file: !1, line: 685, column: 9)
!853 = distinct !DILexicalBlock(scope: !845, file: !1, line: 685, column: 9)
!854 = !DISubprogram(name: "attrgetter_traverse", scope: !1, file: !1, line: 666, type: !855, isLocal: true, isDefinition: true, scopeLine: 667, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.attrgetterobject*, i32 (%struct._object*, i8*)*, i8*)* @attrgetter_traverse, variables: !857)
!855 = !DISubroutineType(types: !856)
!856 = !{!51, !423, !270, !11}
!857 = !{!858, !859, !860, !861}
!858 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ag", arg: 1, scope: !854, file: !1, line: 666, type: !423)
!859 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !854, file: !1, line: 666, type: !270)
!860 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !854, file: !1, line: 666, type: !11)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !862, file: !1, line: 668, type: !51)
!862 = distinct !DILexicalBlock(scope: !863, file: !1, line: 668, column: 5)
!863 = distinct !DILexicalBlock(scope: !864, file: !1, line: 668, column: 5)
!864 = distinct !DILexicalBlock(scope: !854, file: !1, line: 668, column: 5)
!865 = !DISubprogram(name: "attrgetter_new", scope: !1, file: !1, line: 546, type: !798, isLocal: true, isDefinition: true, scopeLine: 547, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @attrgetter_new, variables: !866)
!866 = !{!867, !868, !869, !870, !871, !872, !873, !874, !875, !879, !880, !881, !882, !883, !887, !891, !894, !895, !896, !897, !898, !902, !909, !911, !915, !917}
!867 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !865, file: !1, line: 546, type: !800)
!868 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !865, file: !1, line: 546, type: !12)
!869 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !865, file: !1, line: 546, type: !12)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ag", scope: !865, file: !1, line: 548, type: !423)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "attr", scope: !865, file: !1, line: 549, type: !12)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nattrs", scope: !865, file: !1, line: 550, type: !18)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !865, file: !1, line: 550, type: !18)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "char_idx", scope: !865, file: !1, line: 550, type: !18)
!875 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !876, file: !1, line: 567, type: !12)
!876 = distinct !DILexicalBlock(scope: !877, file: !1, line: 566, column: 40)
!877 = distinct !DILexicalBlock(scope: !878, file: !1, line: 566, column: 5)
!878 = distinct !DILexicalBlock(scope: !865, file: !1, line: 566, column: 5)
!879 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item_len", scope: !876, file: !1, line: 568, type: !18)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !876, file: !1, line: 569, type: !11)
!881 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !876, file: !1, line: 570, type: !348)
!882 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dot_count", scope: !876, file: !1, line: 571, type: !51)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !884, file: !1, line: 576, type: !12)
!884 = distinct !DILexicalBlock(scope: !885, file: !1, line: 576, column: 13)
