; ModuleID = '_stat.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !11, globals: !439)
!1 = !DIFile(filename: "./Modules/_stat.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !10}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !6, line: 70, baseType: !7)
!6 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !8, line: 138, baseType: !9)
!8 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!9 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!10 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!11 = !{!12, !352, !357, !364, !369, !374, !379, !384, !389, !394, !399, !404, !409, !414, !419, !428, !433}
!12 = !DISubprogram(name: "PyInit__stat", scope: !1, file: !1, line: 492, type: !13, isLocal: false, isDefinition: true, scopeLine: 493, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__stat, variables: !350)
!13 = !DISubroutineType(types: !14)
!14 = !{!15}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !17, line: 109, baseType: !18)
!17 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !17, line: 105, size: 128, align: 64, elements: !19)
!19 = !{!20, !27}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !18, file: !17, line: 107, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !22, line: 177, baseType: !23)
!22 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !24, line: 102, baseType: !25)
!24 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !8, line: 181, baseType: !26)
!26 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !18, file: !17, line: 108, baseType: !28, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !17, line: 334, size: 3200, align: 64, elements: !30)
!30 = !{!31, !37, !41, !42, !43, !48, !110, !115, !120, !121, !126, !178, !209, !221, !227, !228, !229, !231, !233, !264, !265, !266, !275, !276, !281, !282, !284, !286, !296, !299, !317, !318, !319, !321, !323, !324, !326, !331, !336, !341, !342, !343, !344, !345, !346, !347, !348, !349}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !29, file: !17, line: 335, baseType: !32, size: 192, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !17, line: 114, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 111, size: 192, align: 64, elements: !34)
!34 = !{!35, !36}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !33, file: !17, line: 112, baseType: !16, size: 128, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !33, file: !17, line: 113, baseType: !21, size: 64, align: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !29, file: !17, line: 336, baseType: !38, size: 64, align: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !29, file: !17, line: 337, baseType: !21, size: 64, align: 64, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !29, file: !17, line: 337, baseType: !21, size: 64, align: 64, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !29, file: !17, line: 341, baseType: !44, size: 64, align: 64, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !17, line: 308, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !15}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !29, file: !17, line: 342, baseType: !49, size: 64, align: 64, offset: 448)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !17, line: 314, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !15, !54, !53}
!53 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !24, line: 48, baseType: !56)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 246, size: 1728, align: 64, elements: !58)
!57 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!58 = !{!59, !60, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !80, !81, !82, !83, !85, !87, !89, !93, !96, !98, !99, !100, !101, !102, !105, !106}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !56, file: !57, line: 247, baseType: !53, size: 32, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !56, file: !57, line: 252, baseType: !61, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !56, file: !57, line: 253, baseType: !61, size: 64, align: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !56, file: !57, line: 254, baseType: !61, size: 64, align: 64, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !56, file: !57, line: 255, baseType: !61, size: 64, align: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !56, file: !57, line: 256, baseType: !61, size: 64, align: 64, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !56, file: !57, line: 257, baseType: !61, size: 64, align: 64, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !56, file: !57, line: 258, baseType: !61, size: 64, align: 64, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !56, file: !57, line: 259, baseType: !61, size: 64, align: 64, offset: 512)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !56, file: !57, line: 261, baseType: !61, size: 64, align: 64, offset: 576)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !56, file: !57, line: 262, baseType: !61, size: 64, align: 64, offset: 640)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !56, file: !57, line: 263, baseType: !61, size: 64, align: 64, offset: 704)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !56, file: !57, line: 265, baseType: !73, size: 64, align: 64, offset: 768)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !57, line: 161, size: 192, align: 64, elements: !75)
!75 = !{!76, !77, !79}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !74, file: !57, line: 162, baseType: !73, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !74, file: !57, line: 163, baseType: !78, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !74, file: !57, line: 167, baseType: !53, size: 32, align: 32, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !56, file: !57, line: 267, baseType: !78, size: 64, align: 64, offset: 832)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !56, file: !57, line: 269, baseType: !53, size: 32, align: 32, offset: 896)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !56, file: !57, line: 273, baseType: !53, size: 32, align: 32, offset: 928)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !56, file: !57, line: 275, baseType: !84, size: 64, align: 64, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !8, line: 140, baseType: !26)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !56, file: !57, line: 279, baseType: !86, size: 16, align: 16, offset: 1024)
!86 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !56, file: !57, line: 280, baseType: !88, size: 8, align: 8, offset: 1040)
!88 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !56, file: !57, line: 281, baseType: !90, size: 8, align: 8, offset: 1048)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 8, align: 8, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 1)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !56, file: !57, line: 285, baseType: !94, size: 64, align: 64, offset: 1088)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !57, line: 155, baseType: null)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !56, file: !57, line: 294, baseType: !97, size: 64, align: 64, offset: 1152)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !8, line: 141, baseType: !26)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !56, file: !57, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !56, file: !57, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !56, file: !57, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !56, file: !57, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !56, file: !57, line: 307, baseType: !103, size: 64, align: 64, offset: 1472)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !104, line: 62, baseType: !10)
!104 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !56, file: !57, line: 309, baseType: !53, size: 32, align: 32, offset: 1536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !56, file: !57, line: 311, baseType: !107, size: 160, align: 8, offset: 1568)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 160, align: 8, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 20)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !29, file: !17, line: 343, baseType: !111, size: 64, align: 64, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !17, line: 316, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!15, !15, !61}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !29, file: !17, line: 344, baseType: !116, size: 64, align: 64, offset: 576)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !17, line: 318, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!53, !15, !61, !15}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !29, file: !17, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !29, file: !17, line: 346, baseType: !122, size: 64, align: 64, offset: 704)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !17, line: 320, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!15, !15}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !29, file: !17, line: 350, baseType: !127, size: 64, align: 64, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !17, line: 278, baseType: !129)
!129 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 236, size: 2176, align: 64, elements: !130)
!130 = !{!131, !136, !137, !138, !139, !140, !145, !147, !148, !149, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !129, file: !17, line: 241, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !17, line: 166, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!15, !15, !15}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !129, file: !17, line: 242, baseType: !132, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !129, file: !17, line: 243, baseType: !132, size: 64, align: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !129, file: !17, line: 244, baseType: !132, size: 64, align: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !129, file: !17, line: 245, baseType: !132, size: 64, align: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !129, file: !17, line: 246, baseType: !141, size: 64, align: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !17, line: 167, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!15, !15, !15, !15}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !129, file: !17, line: 247, baseType: !146, size: 64, align: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !17, line: 165, baseType: !123)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !129, file: !17, line: 248, baseType: !146, size: 64, align: 64, offset: 448)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !129, file: !17, line: 249, baseType: !146, size: 64, align: 64, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !129, file: !17, line: 250, baseType: !150, size: 64, align: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !17, line: 168, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!53, !15}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !129, file: !17, line: 251, baseType: !146, size: 64, align: 64, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !129, file: !17, line: 252, baseType: !132, size: 64, align: 64, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !129, file: !17, line: 253, baseType: !132, size: 64, align: 64, offset: 768)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !129, file: !17, line: 254, baseType: !132, size: 64, align: 64, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !129, file: !17, line: 255, baseType: !132, size: 64, align: 64, offset: 896)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !129, file: !17, line: 256, baseType: !132, size: 64, align: 64, offset: 960)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !129, file: !17, line: 257, baseType: !146, size: 64, align: 64, offset: 1024)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !129, file: !17, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !129, file: !17, line: 259, baseType: !146, size: 64, align: 64, offset: 1152)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !129, file: !17, line: 261, baseType: !132, size: 64, align: 64, offset: 1216)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !129, file: !17, line: 262, baseType: !132, size: 64, align: 64, offset: 1280)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !129, file: !17, line: 263, baseType: !132, size: 64, align: 64, offset: 1344)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !129, file: !17, line: 264, baseType: !132, size: 64, align: 64, offset: 1408)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !129, file: !17, line: 265, baseType: !141, size: 64, align: 64, offset: 1472)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !129, file: !17, line: 266, baseType: !132, size: 64, align: 64, offset: 1536)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !129, file: !17, line: 267, baseType: !132, size: 64, align: 64, offset: 1600)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !129, file: !17, line: 268, baseType: !132, size: 64, align: 64, offset: 1664)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !129, file: !17, line: 269, baseType: !132, size: 64, align: 64, offset: 1728)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !129, file: !17, line: 270, baseType: !132, size: 64, align: 64, offset: 1792)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !129, file: !17, line: 272, baseType: !132, size: 64, align: 64, offset: 1856)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !129, file: !17, line: 273, baseType: !132, size: 64, align: 64, offset: 1920)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !129, file: !17, line: 274, baseType: !132, size: 64, align: 64, offset: 1984)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !129, file: !17, line: 275, baseType: !132, size: 64, align: 64, offset: 2048)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !129, file: !17, line: 277, baseType: !146, size: 64, align: 64, offset: 2112)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !29, file: !17, line: 351, baseType: !179, size: 64, align: 64, offset: 832)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !17, line: 292, baseType: !181)
!181 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 280, size: 640, align: 64, elements: !182)
!182 = !{!183, !188, !189, !194, !195, !196, !201, !202, !207, !208}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !181, file: !17, line: 281, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !17, line: 169, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!21, !15}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !181, file: !17, line: 282, baseType: !132, size: 64, align: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !181, file: !17, line: 283, baseType: !190, size: 64, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !17, line: 170, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!15, !15, !21}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !181, file: !17, line: 284, baseType: !190, size: 64, align: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !181, file: !17, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !181, file: !17, line: 286, baseType: !197, size: 64, align: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !17, line: 172, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!53, !15, !21, !15}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !181, file: !17, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !181, file: !17, line: 288, baseType: !203, size: 64, align: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !17, line: 231, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!53, !15, !15}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !181, file: !17, line: 290, baseType: !132, size: 64, align: 64, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !181, file: !17, line: 291, baseType: !190, size: 64, align: 64, offset: 576)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !29, file: !17, line: 352, baseType: !210, size: 64, align: 64, offset: 896)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !17, line: 298, baseType: !212)
!212 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 294, size: 192, align: 64, elements: !213)
!213 = !{!214, !215, !216}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !212, file: !17, line: 295, baseType: !184, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !212, file: !17, line: 296, baseType: !132, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !212, file: !17, line: 297, baseType: !217, size: 64, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !17, line: 174, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!53, !15, !15, !15}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !29, file: !17, line: 356, baseType: !222, size: 64, align: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !17, line: 321, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!226, !15}
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !22, line: 186, baseType: !21)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !29, file: !17, line: 357, baseType: !141, size: 64, align: 64, offset: 1024)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !29, file: !17, line: 358, baseType: !122, size: 64, align: 64, offset: 1088)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !29, file: !17, line: 359, baseType: !230, size: 64, align: 64, offset: 1152)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !17, line: 317, baseType: !133)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !29, file: !17, line: 360, baseType: !232, size: 64, align: 64, offset: 1216)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !17, line: 319, baseType: !218)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !29, file: !17, line: 363, baseType: !234, size: 64, align: 64, offset: 1280)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !17, line: 304, baseType: !236)
!236 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 301, size: 128, align: 64, elements: !237)
!237 = !{!238, !259}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !236, file: !17, line: 302, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !17, line: 193, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!53, !15, !243, !53}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !17, line: 191, baseType: !245)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !17, line: 178, size: 640, align: 64, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254, !256, !257, !258}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !245, file: !17, line: 179, baseType: !4, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !245, file: !17, line: 180, baseType: !15, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !245, file: !17, line: 181, baseType: !21, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !245, file: !17, line: 182, baseType: !21, size: 64, align: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !245, file: !17, line: 184, baseType: !53, size: 32, align: 32, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !245, file: !17, line: 185, baseType: !53, size: 32, align: 32, offset: 288)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !245, file: !17, line: 186, baseType: !61, size: 64, align: 64, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !245, file: !17, line: 187, baseType: !255, size: 64, align: 64, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !245, file: !17, line: 188, baseType: !255, size: 64, align: 64, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !245, file: !17, line: 189, baseType: !255, size: 64, align: 64, offset: 512)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !245, file: !17, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !236, file: !17, line: 303, baseType: !260, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !17, line: 194, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !15, !243}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !29, file: !17, line: 366, baseType: !10, size: 64, align: 64, offset: 1344)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !29, file: !17, line: 368, baseType: !38, size: 64, align: 64, offset: 1408)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !29, file: !17, line: 372, baseType: !267, size: 64, align: 64, offset: 1472)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !17, line: 233, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!53, !15, !271, !4}
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !17, line: 232, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!53, !15, !4}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !29, file: !17, line: 375, baseType: !150, size: 64, align: 64, offset: 1536)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !29, file: !17, line: 379, baseType: !277, size: 64, align: 64, offset: 1600)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !17, line: 322, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!15, !15, !15, !53}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !29, file: !17, line: 382, baseType: !21, size: 64, align: 64, offset: 1664)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !29, file: !17, line: 385, baseType: !283, size: 64, align: 64, offset: 1728)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !17, line: 323, baseType: !123)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !29, file: !17, line: 386, baseType: !285, size: 64, align: 64, offset: 1792)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !17, line: 324, baseType: !123)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !29, file: !17, line: 389, baseType: !287, size: 64, align: 64, offset: 1856)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !289, line: 40, size: 256, align: 64, elements: !290)
!289 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!290 = !{!291, !292, !294, !295}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !288, file: !289, line: 41, baseType: !38, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !288, file: !289, line: 42, baseType: !293, size: 64, align: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !289, line: 18, baseType: !133)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !288, file: !289, line: 43, baseType: !53, size: 32, align: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !288, file: !289, line: 45, baseType: !38, size: 64, align: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !29, file: !17, line: 390, baseType: !297, size: 64, align: 64, offset: 1920)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !17, line: 390, flags: DIFlagFwdDecl)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !29, file: !17, line: 391, baseType: !300, size: 64, align: 64, offset: 1984)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !302, line: 11, size: 320, align: 64, elements: !303)
!302 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!303 = !{!304, !305, !310, !315, !316}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !301, file: !302, line: 12, baseType: !61, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !301, file: !302, line: 13, baseType: !306, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !302, line: 8, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!15, !15, !4}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !301, file: !302, line: 14, baseType: !311, size: 64, align: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !302, line: 9, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!53, !15, !15, !4}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !301, file: !302, line: 15, baseType: !61, size: 64, align: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !301, file: !302, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !29, file: !17, line: 392, baseType: !28, size: 64, align: 64, offset: 2048)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !29, file: !17, line: 393, baseType: !15, size: 64, align: 64, offset: 2112)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !29, file: !17, line: 394, baseType: !320, size: 64, align: 64, offset: 2176)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !17, line: 325, baseType: !142)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !29, file: !17, line: 395, baseType: !322, size: 64, align: 64, offset: 2240)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !17, line: 326, baseType: !218)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !29, file: !17, line: 396, baseType: !21, size: 64, align: 64, offset: 2304)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !29, file: !17, line: 397, baseType: !325, size: 64, align: 64, offset: 2368)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !17, line: 327, baseType: !218)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !29, file: !17, line: 398, baseType: !327, size: 64, align: 64, offset: 2432)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !17, line: 329, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!15, !28, !21}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !29, file: !17, line: 399, baseType: !332, size: 64, align: 64, offset: 2496)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !17, line: 328, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!15, !28, !15, !15}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !29, file: !17, line: 400, baseType: !337, size: 64, align: 64, offset: 2560)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !17, line: 307, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !4}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !29, file: !17, line: 401, baseType: !150, size: 64, align: 64, offset: 2624)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !29, file: !17, line: 402, baseType: !15, size: 64, align: 64, offset: 2688)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !29, file: !17, line: 403, baseType: !15, size: 64, align: 64, offset: 2752)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !29, file: !17, line: 404, baseType: !15, size: 64, align: 64, offset: 2816)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !29, file: !17, line: 405, baseType: !15, size: 64, align: 64, offset: 2880)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !29, file: !17, line: 406, baseType: !15, size: 64, align: 64, offset: 2944)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !29, file: !17, line: 407, baseType: !44, size: 64, align: 64, offset: 3008)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !29, file: !17, line: 410, baseType: !9, size: 32, align: 32, offset: 3072)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !29, file: !17, line: 412, baseType: !44, size: 64, align: 64, offset: 3136)
!350 = !{!351}
!351 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !12, file: !1, line: 494, type: !15)
!352 = !DISubprogram(name: "stat_S_ISDIR", scope: !1, file: !1, line: 265, type: !134, isLocal: true, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_ISDIR, variables: !353)
!353 = !{!354, !355, !356}
!354 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !352, file: !1, line: 265, type: !15)
!355 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !352, file: !1, line: 265, type: !15)
!356 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !352, file: !1, line: 265, type: !5)
!357 = !DISubprogram(name: "_PyLong_AsMode_t", scope: !1, file: !1, line: 236, type: !358, isLocal: true, isDefinition: true, scopeLine: 237, flags: DIFlagPrototyped, isOptimized: true, variables: !360)
!358 = !DISubroutineType(types: !359)
!359 = !{!5, !15}
!360 = !{!361, !362, !363}
!361 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !357, file: !1, line: 236, type: !15)
!362 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !357, file: !1, line: 238, type: !10)
!363 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !357, file: !1, line: 239, type: !5)
!364 = !DISubprogram(name: "stat_S_ISCHR", scope: !1, file: !1, line: 269, type: !134, isLocal: true, isDefinition: true, scopeLine: 269, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_ISCHR, variables: !365)
!365 = !{!366, !367, !368}
!366 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !364, file: !1, line: 269, type: !15)
!367 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !364, file: !1, line: 269, type: !15)
!368 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !364, file: !1, line: 269, type: !5)
!369 = !DISubprogram(name: "stat_S_ISBLK", scope: !1, file: !1, line: 273, type: !134, isLocal: true, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_ISBLK, variables: !370)
!370 = !{!371, !372, !373}
!371 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !369, file: !1, line: 273, type: !15)
!372 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !369, file: !1, line: 273, type: !15)
!373 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !369, file: !1, line: 273, type: !5)
!374 = !DISubprogram(name: "stat_S_ISREG", scope: !1, file: !1, line: 277, type: !134, isLocal: true, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_ISREG, variables: !375)
!375 = !{!376, !377, !378}
!376 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !374, file: !1, line: 277, type: !15)
!377 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !374, file: !1, line: 277, type: !15)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !374, file: !1, line: 277, type: !5)
!379 = !DISubprogram(name: "stat_S_ISFIFO", scope: !1, file: !1, line: 281, type: !134, isLocal: true, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_ISFIFO, variables: !380)
!380 = !{!381, !382, !383}
!381 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !379, file: !1, line: 281, type: !15)
!382 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !379, file: !1, line: 281, type: !15)
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !379, file: !1, line: 281, type: !5)
!384 = !DISubprogram(name: "stat_S_ISLNK", scope: !1, file: !1, line: 285, type: !134, isLocal: true, isDefinition: true, scopeLine: 285, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_ISLNK, variables: !385)
!385 = !{!386, !387, !388}
!386 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !384, file: !1, line: 285, type: !15)
!387 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !384, file: !1, line: 285, type: !15)
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !384, file: !1, line: 285, type: !5)
!389 = !DISubprogram(name: "stat_S_ISSOCK", scope: !1, file: !1, line: 289, type: !134, isLocal: true, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_ISSOCK, variables: !390)
!390 = !{!391, !392, !393}
!391 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !389, file: !1, line: 289, type: !15)
!392 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !389, file: !1, line: 289, type: !15)
!393 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !389, file: !1, line: 289, type: !5)
!394 = !DISubprogram(name: "stat_S_ISDOOR", scope: !1, file: !1, line: 293, type: !134, isLocal: true, isDefinition: true, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_ISDOOR, variables: !395)
!395 = !{!396, !397, !398}
!396 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !394, file: !1, line: 293, type: !15)
!397 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !394, file: !1, line: 293, type: !15)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !394, file: !1, line: 293, type: !5)
!399 = !DISubprogram(name: "stat_S_ISPORT", scope: !1, file: !1, line: 297, type: !134, isLocal: true, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_ISPORT, variables: !400)
!400 = !{!401, !402, !403}
!401 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !399, file: !1, line: 297, type: !15)
!402 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !399, file: !1, line: 297, type: !15)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !399, file: !1, line: 297, type: !5)
!404 = !DISubprogram(name: "stat_S_ISWHT", scope: !1, file: !1, line: 301, type: !134, isLocal: true, isDefinition: true, scopeLine: 301, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_ISWHT, variables: !405)
!405 = !{!406, !407, !408}
!406 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !404, file: !1, line: 301, type: !15)
!407 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !404, file: !1, line: 301, type: !15)
!408 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !404, file: !1, line: 301, type: !5)
!409 = !DISubprogram(name: "stat_S_IMODE", scope: !1, file: !1, line: 310, type: !134, isLocal: true, isDefinition: true, scopeLine: 311, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_IMODE, variables: !410)
!410 = !{!411, !412, !413}
!411 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !409, file: !1, line: 310, type: !15)
!412 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !409, file: !1, line: 310, type: !15)
!413 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !409, file: !1, line: 312, type: !5)
!414 = !DISubprogram(name: "stat_S_IFMT", scope: !1, file: !1, line: 323, type: !134, isLocal: true, isDefinition: true, scopeLine: 324, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_IFMT, variables: !415)
!415 = !{!416, !417, !418}
!416 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !414, file: !1, line: 323, type: !15)
!417 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !414, file: !1, line: 323, type: !15)
!418 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !414, file: !1, line: 325, type: !5)
!419 = !DISubprogram(name: "stat_filemode", scope: !1, file: !1, line: 384, type: !134, isLocal: true, isDefinition: true, scopeLine: 385, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_filemode, variables: !420)
!420 = !{!421, !422, !423, !427}
!421 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !419, file: !1, line: 384, type: !15)
!422 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !419, file: !1, line: 384, type: !15)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !419, file: !1, line: 386, type: !424)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 80, align: 8, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 10)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !419, file: !1, line: 387, type: !5)
!428 = !DISubprogram(name: "filetype", scope: !1, file: !1, line: 335, type: !429, isLocal: true, isDefinition: true, scopeLine: 336, flags: DIFlagPrototyped, isOptimized: true, variables: !431)
!429 = !DISubroutineType(types: !430)
!430 = !{!40, !5}
!431 = !{!432}
!432 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 1, scope: !428, file: !1, line: 335, type: !5)
!433 = !DISubprogram(name: "fileperm", scope: !1, file: !1, line: 355, type: !434, isLocal: true, isDefinition: true, scopeLine: 356, flags: DIFlagPrototyped, isOptimized: true, variables: !436)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !5, !61}
!436 = !{!437, !438}
!437 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 1, scope: !433, file: !1, line: 355, type: !5)
!438 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 2, scope: !433, file: !1, line: 355, type: !61)
!439 = !{!440, !463, !467, !471, !475, !479, !483, !487, !491, !495, !499, !503, !504, !508, !512, !513}
!440 = !DIGlobalVariable(name: "statmodule", scope: !0, file: !1, line: 479, type: !441, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @statmodule)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !442, line: 47, size: 832, align: 64, elements: !443)
!442 = !DIFile(filename: "Include/moduleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!443 = !{!444, !453, !454, !455, !456, !459, !460, !461, !462}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !441, file: !442, line: 48, baseType: !445, size: 320, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !442, line: 38, baseType: !446)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !442, line: 33, size: 320, align: 64, elements: !447)
!447 = !{!448, !449, !451, !452}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !446, file: !442, line: 34, baseType: !16, size: 128, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !446, file: !442, line: 35, baseType: !450, size: 64, align: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !446, file: !442, line: 36, baseType: !21, size: 64, align: 64, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !446, file: !442, line: 37, baseType: !15, size: 64, align: 64, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !441, file: !442, line: 49, baseType: !38, size: 64, align: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !441, file: !442, line: 50, baseType: !38, size: 64, align: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !441, file: !442, line: 51, baseType: !21, size: 64, align: 64, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !441, file: !442, line: 52, baseType: !457, size: 64, align: 64, offset: 512)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !289, line: 47, baseType: !288)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !441, file: !442, line: 53, baseType: !150, size: 64, align: 64, offset: 576)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !441, file: !442, line: 54, baseType: !267, size: 64, align: 64, offset: 640)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !441, file: !442, line: 55, baseType: !150, size: 64, align: 64, offset: 704)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !441, file: !442, line: 56, baseType: !337, size: 64, align: 64, offset: 768)
!463 = !DIGlobalVariable(name: "module_doc", scope: !0, file: !1, line: 417, type: !464, isLocal: true, isDefinition: true, variable: [1383 x i8]* @module_doc)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 11064, align: 8, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 1383)
!467 = !DIGlobalVariable(name: "stat_methods", scope: !0, file: !1, line: 399, type: !468, isLocal: true, isDefinition: true, variable: [14 x %struct.PyMethodDef]* @stat_methods)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 3584, align: 64, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 14)
!471 = !DIGlobalVariable(name: "stat_S_ISDIR_doc", scope: !0, file: !1, line: 265, type: !472, isLocal: true, isDefinition: true, variable: [64 x i8]* @stat_S_ISDIR_doc)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 512, align: 8, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 64)
!475 = !DIGlobalVariable(name: "stat_S_ISCHR_doc", scope: !0, file: !1, line: 269, type: !476, isLocal: true, isDefinition: true, variable: [84 x i8]* @stat_S_ISCHR_doc)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 672, align: 8, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 84)
!479 = !DIGlobalVariable(name: "stat_S_ISBLK_doc", scope: !0, file: !1, line: 273, type: !480, isLocal: true, isDefinition: true, variable: [80 x i8]* @stat_S_ISBLK_doc)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 640, align: 8, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 80)
!483 = !DIGlobalVariable(name: "stat_S_ISREG_doc", scope: !0, file: !1, line: 277, type: !484, isLocal: true, isDefinition: true, variable: [67 x i8]* @stat_S_ISREG_doc)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 536, align: 8, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 67)
!487 = !DIGlobalVariable(name: "stat_S_ISFIFO_doc", scope: !0, file: !1, line: 281, type: !488, isLocal: true, isDefinition: true, variable: [73 x i8]* @stat_S_ISFIFO_doc)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 584, align: 8, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 73)
!491 = !DIGlobalVariable(name: "stat_S_ISLNK_doc", scope: !0, file: !1, line: 285, type: !492, isLocal: true, isDefinition: true, variable: [68 x i8]* @stat_S_ISLNK_doc)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 544, align: 8, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 68)
!495 = !DIGlobalVariable(name: "stat_S_ISSOCK_doc", scope: !0, file: !1, line: 289, type: !496, isLocal: true, isDefinition: true, variable: [62 x i8]* @stat_S_ISSOCK_doc)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 496, align: 8, elements: !497)
!497 = !{!498}
!498 = !DISubrange(count: 62)
!499 = !DIGlobalVariable(name: "stat_S_ISDOOR_doc", scope: !0, file: !1, line: 293, type: !500, isLocal: true, isDefinition: true, variable: [60 x i8]* @stat_S_ISDOOR_doc)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 480, align: 8, elements: !501)
!501 = !{!502}
!502 = !DISubrange(count: 60)
!503 = !DIGlobalVariable(name: "stat_S_ISPORT_doc", scope: !0, file: !1, line: 297, type: !484, isLocal: true, isDefinition: true, variable: [67 x i8]* @stat_S_ISPORT_doc)
!504 = !DIGlobalVariable(name: "stat_S_ISWHT_doc", scope: !0, file: !1, line: 301, type: !505, isLocal: true, isDefinition: true, variable: [63 x i8]* @stat_S_ISWHT_doc)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 504, align: 8, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 63)
!508 = !DIGlobalVariable(name: "stat_S_IMODE_doc", scope: !0, file: !1, line: 306, type: !509, isLocal: true, isDefinition: true, variable: [69 x i8]* @stat_S_IMODE_doc)
