; ModuleID = '_threadmodule.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !17, subprograms: !479, globals: !890)
!1 = !DIFile(filename: "./Modules/_threadmodule.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyLockStatus", file: !4, line: 14, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pythread.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "PY_LOCK_FAILURE", value: 0)
!7 = !DIEnumerator(name: "PY_LOCK_ACQUIRED", value: 1)
!8 = !DIEnumerator(name: "PY_LOCK_INTR", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !10, line: 23, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!11 = !{!12, !13, !14, !15, !16}
!12 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!13 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!14 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!15 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!16 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!17 = !{!18, !19, !364, !371, !382, !393, !394, !31, !395, !405, !469, !471, !108, !25}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !21, line: 109, baseType: !22)
!21 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !21, line: 105, size: 128, align: 64, elements: !23)
!23 = !{!24, !32}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !22, file: !21, line: 107, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !26, line: 177, baseType: !27)
!26 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !28, line: 102, baseType: !29)
!28 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !30, line: 181, baseType: !31)
!30 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!31 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !22, file: !21, line: 108, baseType: !33, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !21, line: 334, size: 3200, align: 64, elements: !35)
!35 = !{!36, !42, !46, !47, !48, !53, !116, !121, !126, !127, !132, !184, !215, !227, !233, !234, !235, !237, !239, !270, !271, !272, !281, !282, !287, !288, !290, !292, !302, !312, !330, !331, !332, !334, !336, !337, !339, !344, !349, !354, !355, !356, !357, !358, !359, !360, !361, !363}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !34, file: !21, line: 335, baseType: !37, size: 192, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !21, line: 114, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 111, size: 192, align: 64, elements: !39)
!39 = !{!40, !41}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !38, file: !21, line: 112, baseType: !20, size: 128, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !38, file: !21, line: 113, baseType: !25, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !34, file: !21, line: 336, baseType: !43, size: 64, align: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !34, file: !21, line: 337, baseType: !25, size: 64, align: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !34, file: !21, line: 337, baseType: !25, size: 64, align: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !34, file: !21, line: 341, baseType: !49, size: 64, align: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !21, line: 308, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{null, !19}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !34, file: !21, line: 342, baseType: !54, size: 64, align: 64, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !21, line: 314, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !19, !59, !58}
!58 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !28, line: 48, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 246, size: 1728, align: 64, elements: !63)
!62 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!63 = !{!64, !65, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !85, !86, !87, !88, !90, !92, !94, !98, !101, !103, !104, !105, !106, !107, !111, !112}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !61, file: !62, line: 247, baseType: !58, size: 32, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !61, file: !62, line: 252, baseType: !66, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !61, file: !62, line: 253, baseType: !66, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !61, file: !62, line: 254, baseType: !66, size: 64, align: 64, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !61, file: !62, line: 255, baseType: !66, size: 64, align: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !61, file: !62, line: 256, baseType: !66, size: 64, align: 64, offset: 320)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !61, file: !62, line: 257, baseType: !66, size: 64, align: 64, offset: 384)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !61, file: !62, line: 258, baseType: !66, size: 64, align: 64, offset: 448)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !61, file: !62, line: 259, baseType: !66, size: 64, align: 64, offset: 512)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !61, file: !62, line: 261, baseType: !66, size: 64, align: 64, offset: 576)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !61, file: !62, line: 262, baseType: !66, size: 64, align: 64, offset: 640)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !61, file: !62, line: 263, baseType: !66, size: 64, align: 64, offset: 704)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !61, file: !62, line: 265, baseType: !78, size: 64, align: 64, offset: 768)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !62, line: 161, size: 192, align: 64, elements: !80)
!80 = !{!81, !82, !84}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !79, file: !62, line: 162, baseType: !78, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !79, file: !62, line: 163, baseType: !83, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !79, file: !62, line: 167, baseType: !58, size: 32, align: 32, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !61, file: !62, line: 267, baseType: !83, size: 64, align: 64, offset: 832)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !61, file: !62, line: 269, baseType: !58, size: 32, align: 32, offset: 896)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !61, file: !62, line: 273, baseType: !58, size: 32, align: 32, offset: 928)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !61, file: !62, line: 275, baseType: !89, size: 64, align: 64, offset: 960)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !30, line: 140, baseType: !31)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !61, file: !62, line: 279, baseType: !91, size: 16, align: 16, offset: 1024)
!91 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !61, file: !62, line: 280, baseType: !93, size: 8, align: 8, offset: 1040)
!93 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !61, file: !62, line: 281, baseType: !95, size: 8, align: 8, offset: 1048)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8, align: 8, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 1)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !61, file: !62, line: 285, baseType: !99, size: 64, align: 64, offset: 1088)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !62, line: 155, baseType: null)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !61, file: !62, line: 294, baseType: !102, size: 64, align: 64, offset: 1152)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !30, line: 141, baseType: !31)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !61, file: !62, line: 303, baseType: !18, size: 64, align: 64, offset: 1216)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !61, file: !62, line: 304, baseType: !18, size: 64, align: 64, offset: 1280)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !61, file: !62, line: 305, baseType: !18, size: 64, align: 64, offset: 1344)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !61, file: !62, line: 306, baseType: !18, size: 64, align: 64, offset: 1408)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !61, file: !62, line: 307, baseType: !108, size: 64, align: 64, offset: 1472)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !109, line: 62, baseType: !110)
!109 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!110 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !61, file: !62, line: 309, baseType: !58, size: 32, align: 32, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !61, file: !62, line: 311, baseType: !113, size: 160, align: 8, offset: 1568)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 160, align: 8, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 20)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !34, file: !21, line: 343, baseType: !117, size: 64, align: 64, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !21, line: 316, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!19, !19, !66}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !34, file: !21, line: 344, baseType: !122, size: 64, align: 64, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !21, line: 318, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!58, !19, !66, !19}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !34, file: !21, line: 345, baseType: !18, size: 64, align: 64, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !34, file: !21, line: 346, baseType: !128, size: 64, align: 64, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !21, line: 320, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!19, !19}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !34, file: !21, line: 350, baseType: !133, size: 64, align: 64, offset: 768)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !21, line: 278, baseType: !135)
!135 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 236, size: 2176, align: 64, elements: !136)
!136 = !{!137, !142, !143, !144, !145, !146, !151, !153, !154, !155, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !135, file: !21, line: 241, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !21, line: 166, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!19, !19, !19}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !135, file: !21, line: 242, baseType: !138, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !135, file: !21, line: 243, baseType: !138, size: 64, align: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !135, file: !21, line: 244, baseType: !138, size: 64, align: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !135, file: !21, line: 245, baseType: !138, size: 64, align: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !135, file: !21, line: 246, baseType: !147, size: 64, align: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !21, line: 167, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!19, !19, !19, !19}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !135, file: !21, line: 247, baseType: !152, size: 64, align: 64, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !21, line: 165, baseType: !129)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !135, file: !21, line: 248, baseType: !152, size: 64, align: 64, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !135, file: !21, line: 249, baseType: !152, size: 64, align: 64, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !135, file: !21, line: 250, baseType: !156, size: 64, align: 64, offset: 576)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !21, line: 168, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!58, !19}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !135, file: !21, line: 251, baseType: !152, size: 64, align: 64, offset: 640)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !135, file: !21, line: 252, baseType: !138, size: 64, align: 64, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !135, file: !21, line: 253, baseType: !138, size: 64, align: 64, offset: 768)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !135, file: !21, line: 254, baseType: !138, size: 64, align: 64, offset: 832)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !135, file: !21, line: 255, baseType: !138, size: 64, align: 64, offset: 896)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !135, file: !21, line: 256, baseType: !138, size: 64, align: 64, offset: 960)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !135, file: !21, line: 257, baseType: !152, size: 64, align: 64, offset: 1024)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !135, file: !21, line: 258, baseType: !18, size: 64, align: 64, offset: 1088)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !135, file: !21, line: 259, baseType: !152, size: 64, align: 64, offset: 1152)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !135, file: !21, line: 261, baseType: !138, size: 64, align: 64, offset: 1216)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !135, file: !21, line: 262, baseType: !138, size: 64, align: 64, offset: 1280)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !135, file: !21, line: 263, baseType: !138, size: 64, align: 64, offset: 1344)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !135, file: !21, line: 264, baseType: !138, size: 64, align: 64, offset: 1408)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !135, file: !21, line: 265, baseType: !147, size: 64, align: 64, offset: 1472)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !135, file: !21, line: 266, baseType: !138, size: 64, align: 64, offset: 1536)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !135, file: !21, line: 267, baseType: !138, size: 64, align: 64, offset: 1600)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !135, file: !21, line: 268, baseType: !138, size: 64, align: 64, offset: 1664)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !135, file: !21, line: 269, baseType: !138, size: 64, align: 64, offset: 1728)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !135, file: !21, line: 270, baseType: !138, size: 64, align: 64, offset: 1792)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !135, file: !21, line: 272, baseType: !138, size: 64, align: 64, offset: 1856)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !135, file: !21, line: 273, baseType: !138, size: 64, align: 64, offset: 1920)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !135, file: !21, line: 274, baseType: !138, size: 64, align: 64, offset: 1984)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !135, file: !21, line: 275, baseType: !138, size: 64, align: 64, offset: 2048)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !135, file: !21, line: 277, baseType: !152, size: 64, align: 64, offset: 2112)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !34, file: !21, line: 351, baseType: !185, size: 64, align: 64, offset: 832)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !21, line: 292, baseType: !187)
!187 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 280, size: 640, align: 64, elements: !188)
!188 = !{!189, !194, !195, !200, !201, !202, !207, !208, !213, !214}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !187, file: !21, line: 281, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !21, line: 169, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!25, !19}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !187, file: !21, line: 282, baseType: !138, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !187, file: !21, line: 283, baseType: !196, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !21, line: 170, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!19, !19, !25}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !187, file: !21, line: 284, baseType: !196, size: 64, align: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !187, file: !21, line: 285, baseType: !18, size: 64, align: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !187, file: !21, line: 286, baseType: !203, size: 64, align: 64, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !21, line: 172, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!58, !19, !25, !19}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !187, file: !21, line: 287, baseType: !18, size: 64, align: 64, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !187, file: !21, line: 288, baseType: !209, size: 64, align: 64, offset: 448)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !21, line: 231, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!58, !19, !19}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !187, file: !21, line: 290, baseType: !138, size: 64, align: 64, offset: 512)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !187, file: !21, line: 291, baseType: !196, size: 64, align: 64, offset: 576)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !34, file: !21, line: 352, baseType: !216, size: 64, align: 64, offset: 896)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !21, line: 298, baseType: !218)
!218 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 294, size: 192, align: 64, elements: !219)
!219 = !{!220, !221, !222}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !218, file: !21, line: 295, baseType: !190, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !218, file: !21, line: 296, baseType: !138, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !218, file: !21, line: 297, baseType: !223, size: 64, align: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !21, line: 174, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!58, !19, !19, !19}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !34, file: !21, line: 356, baseType: !228, size: 64, align: 64, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !21, line: 321, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!232, !19}
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !26, line: 186, baseType: !25)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !34, file: !21, line: 357, baseType: !147, size: 64, align: 64, offset: 1024)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !34, file: !21, line: 358, baseType: !128, size: 64, align: 64, offset: 1088)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !34, file: !21, line: 359, baseType: !236, size: 64, align: 64, offset: 1152)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !21, line: 317, baseType: !139)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !34, file: !21, line: 360, baseType: !238, size: 64, align: 64, offset: 1216)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !21, line: 319, baseType: !224)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !34, file: !21, line: 363, baseType: !240, size: 64, align: 64, offset: 1280)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !21, line: 304, baseType: !242)
!242 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 301, size: 128, align: 64, elements: !243)
!243 = !{!244, !265}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !242, file: !21, line: 302, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !21, line: 193, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!58, !19, !249, !58}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !21, line: 191, baseType: !251)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !21, line: 178, size: 640, align: 64, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260, !262, !263, !264}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !251, file: !21, line: 179, baseType: !18, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !251, file: !21, line: 180, baseType: !19, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !251, file: !21, line: 181, baseType: !25, size: 64, align: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !251, file: !21, line: 182, baseType: !25, size: 64, align: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !251, file: !21, line: 184, baseType: !58, size: 32, align: 32, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !251, file: !21, line: 185, baseType: !58, size: 32, align: 32, offset: 288)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !251, file: !21, line: 186, baseType: !66, size: 64, align: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !251, file: !21, line: 187, baseType: !261, size: 64, align: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !251, file: !21, line: 188, baseType: !261, size: 64, align: 64, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !251, file: !21, line: 189, baseType: !261, size: 64, align: 64, offset: 512)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !251, file: !21, line: 190, baseType: !18, size: 64, align: 64, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !242, file: !21, line: 303, baseType: !266, size: 64, align: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !21, line: 194, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !19, !249}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !34, file: !21, line: 366, baseType: !110, size: 64, align: 64, offset: 1344)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !34, file: !21, line: 368, baseType: !43, size: 64, align: 64, offset: 1408)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !34, file: !21, line: 372, baseType: !273, size: 64, align: 64, offset: 1472)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !21, line: 233, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!58, !19, !277, !18}
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !21, line: 232, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!58, !19, !18}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !34, file: !21, line: 375, baseType: !156, size: 64, align: 64, offset: 1536)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !34, file: !21, line: 379, baseType: !283, size: 64, align: 64, offset: 1600)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !21, line: 322, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!19, !19, !19, !58}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !34, file: !21, line: 382, baseType: !25, size: 64, align: 64, offset: 1664)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !34, file: !21, line: 385, baseType: !289, size: 64, align: 64, offset: 1728)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !21, line: 323, baseType: !129)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !34, file: !21, line: 386, baseType: !291, size: 64, align: 64, offset: 1792)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !21, line: 324, baseType: !129)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !34, file: !21, line: 389, baseType: !293, size: 64, align: 64, offset: 1856)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !295, line: 40, size: 256, align: 64, elements: !296)
!295 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!296 = !{!297, !298, !300, !301}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !294, file: !295, line: 41, baseType: !43, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !294, file: !295, line: 42, baseType: !299, size: 64, align: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !295, line: 18, baseType: !139)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !294, file: !295, line: 43, baseType: !58, size: 32, align: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !294, file: !295, line: 45, baseType: !43, size: 64, align: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !34, file: !21, line: 390, baseType: !303, size: 64, align: 64, offset: 1920)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !305, line: 18, size: 320, align: 64, elements: !306)
!305 = !DIFile(filename: "Include/structmember.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!306 = !{!307, !308, !309, !310, !311}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !304, file: !305, line: 19, baseType: !66, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !304, file: !305, line: 20, baseType: !58, size: 32, align: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !304, file: !305, line: 21, baseType: !25, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !304, file: !305, line: 22, baseType: !58, size: 32, align: 32, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !304, file: !305, line: 23, baseType: !66, size: 64, align: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !34, file: !21, line: 391, baseType: !313, size: 64, align: 64, offset: 1984)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !315, line: 11, size: 320, align: 64, elements: !316)
!315 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!316 = !{!317, !318, !323, !328, !329}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !314, file: !315, line: 12, baseType: !66, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !314, file: !315, line: 13, baseType: !319, size: 64, align: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !315, line: 8, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!19, !19, !18}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !314, file: !315, line: 14, baseType: !324, size: 64, align: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !315, line: 9, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!58, !19, !19, !18}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !314, file: !315, line: 15, baseType: !66, size: 64, align: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !314, file: !315, line: 16, baseType: !18, size: 64, align: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !34, file: !21, line: 392, baseType: !33, size: 64, align: 64, offset: 2048)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !34, file: !21, line: 393, baseType: !19, size: 64, align: 64, offset: 2112)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !34, file: !21, line: 394, baseType: !333, size: 64, align: 64, offset: 2176)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !21, line: 325, baseType: !148)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !34, file: !21, line: 395, baseType: !335, size: 64, align: 64, offset: 2240)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !21, line: 326, baseType: !224)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !34, file: !21, line: 396, baseType: !25, size: 64, align: 64, offset: 2304)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !34, file: !21, line: 397, baseType: !338, size: 64, align: 64, offset: 2368)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !21, line: 327, baseType: !224)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !34, file: !21, line: 398, baseType: !340, size: 64, align: 64, offset: 2432)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !21, line: 329, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!19, !33, !25}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !34, file: !21, line: 399, baseType: !345, size: 64, align: 64, offset: 2496)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !21, line: 328, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!19, !33, !19, !19}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !34, file: !21, line: 400, baseType: !350, size: 64, align: 64, offset: 2560)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !21, line: 307, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !18}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !34, file: !21, line: 401, baseType: !156, size: 64, align: 64, offset: 2624)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !34, file: !21, line: 402, baseType: !19, size: 64, align: 64, offset: 2688)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !34, file: !21, line: 403, baseType: !19, size: 64, align: 64, offset: 2752)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !34, file: !21, line: 404, baseType: !19, size: 64, align: 64, offset: 2816)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !34, file: !21, line: 405, baseType: !19, size: 64, align: 64, offset: 2880)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !34, file: !21, line: 406, baseType: !19, size: 64, align: 64, offset: 2944)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !34, file: !21, line: 407, baseType: !49, size: 64, align: 64, offset: 3008)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !34, file: !21, line: 410, baseType: !362, size: 32, align: 32, offset: 3072)
!362 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !34, file: !21, line: 412, baseType: !49, size: 64, align: 64, offset: 3136)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "localdummyobject", file: !1, line: 609, baseType: !366)
!366 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 605, size: 256, align: 64, elements: !367)
!367 = !{!368, !369, !370}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !366, file: !1, line: 606, baseType: !20, size: 128, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "localdict", scope: !366, file: !1, line: 607, baseType: !19, size: 64, align: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !366, file: !1, line: 608, baseType: !19, size: 64, align: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "localobject", file: !1, line: 658, baseType: !373)
!373 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 648, size: 512, align: 64, elements: !374)
!374 = !{!375, !376, !377, !378, !379, !380, !381}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !373, file: !1, line: 649, baseType: !20, size: 128, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !373, file: !1, line: 650, baseType: !19, size: 64, align: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !373, file: !1, line: 651, baseType: !19, size: 64, align: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "kw", scope: !373, file: !1, line: 652, baseType: !19, size: 64, align: 64, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !373, file: !1, line: 653, baseType: !19, size: 64, align: 64, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "dummies", scope: !373, file: !1, line: 655, baseType: !19, size: 64, align: 64, offset: 384)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "wr_callback", scope: !373, file: !1, line: 657, baseType: !19, size: 64, align: 64, offset: 448)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyWeakReference", file: !384, line: 10, baseType: !385)
!384 = !DIFile(filename: "Include/weakrefobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyWeakReference", file: !384, line: 16, size: 448, align: 64, elements: !386)
!386 = !{!387, !388, !389, !390, !391, !392}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !385, file: !384, line: 17, baseType: !20, size: 128, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "wr_object", scope: !385, file: !384, line: 23, baseType: !19, size: 64, align: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "wr_callback", scope: !385, file: !384, line: 26, baseType: !19, size: 64, align: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !385, file: !384, line: 31, baseType: !232, size: 64, align: 64, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "wr_prev", scope: !385, file: !384, line: 38, baseType: !382, size: 64, align: 64, offset: 320)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "wr_next", scope: !385, file: !384, line: 39, baseType: !382, size: 64, align: 64, offset: 384)
!393 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!394 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "rlockobject", file: !1, line: 255, baseType: !397)
!397 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 249, size: 384, align: 64, elements: !398)
!398 = !{!399, !400, !402, !403, !404}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !397, file: !1, line: 250, baseType: !20, size: 128, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "rlock_lock", scope: !397, file: !1, line: 251, baseType: !401, size: 64, align: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThread_type_lock", file: !4, line: 5, baseType: !18)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "rlock_owner", scope: !397, file: !1, line: 252, baseType: !31, size: 64, align: 64, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "rlock_count", scope: !397, file: !1, line: 253, baseType: !110, size: 64, align: 64, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "in_weakreflist", scope: !397, file: !1, line: 254, baseType: !19, size: 64, align: 64, offset: 320)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "bootstate", file: !1, line: 979, size: 320, align: 64, elements: !407)
!407 = !{!408, !465, !466, !467, !468}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !406, file: !1, line: 980, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !411, line: 44, baseType: !412)
!411 = !DIFile(filename: "Include/pystate.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !411, line: 19, size: 832, align: 64, elements: !413)
!413 = !{!414, !416, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !412, file: !411, line: 21, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !412, file: !411, line: 22, baseType: !417, size: 64, align: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !411, line: 69, size: 1536, align: 64, elements: !419)
!419 = !{!420, !421, !422, !423, !426, !427, !428, !429, !430, !431, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !418, file: !411, line: 72, baseType: !417, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !418, file: !411, line: 73, baseType: !417, size: 64, align: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !418, file: !411, line: 74, baseType: !409, size: 64, align: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !418, file: !411, line: 76, baseType: !424, size: 64, align: 64, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !411, line: 50, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !418, file: !411, line: 77, baseType: !58, size: 32, align: 32, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !418, file: !411, line: 78, baseType: !45, size: 8, align: 8, offset: 288)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !418, file: !411, line: 80, baseType: !45, size: 8, align: 8, offset: 296)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !418, file: !411, line: 85, baseType: !58, size: 32, align: 32, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !418, file: !411, line: 86, baseType: !58, size: 32, align: 32, offset: 352)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !418, file: !411, line: 88, baseType: !432, size: 64, align: 64, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !411, line: 54, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!58, !19, !424, !58, !19}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !418, file: !411, line: 89, baseType: !432, size: 64, align: 64, offset: 448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !418, file: !411, line: 90, baseType: !19, size: 64, align: 64, offset: 512)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !418, file: !411, line: 91, baseType: !19, size: 64, align: 64, offset: 576)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !418, file: !411, line: 93, baseType: !19, size: 64, align: 64, offset: 640)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !418, file: !411, line: 94, baseType: !19, size: 64, align: 64, offset: 704)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !418, file: !411, line: 95, baseType: !19, size: 64, align: 64, offset: 768)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !418, file: !411, line: 97, baseType: !19, size: 64, align: 64, offset: 832)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !418, file: !411, line: 98, baseType: !19, size: 64, align: 64, offset: 896)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !418, file: !411, line: 99, baseType: !19, size: 64, align: 64, offset: 960)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !418, file: !411, line: 101, baseType: !19, size: 64, align: 64, offset: 1024)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !418, file: !411, line: 103, baseType: !58, size: 32, align: 32, offset: 1088)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !418, file: !411, line: 105, baseType: !19, size: 64, align: 64, offset: 1152)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !418, file: !411, line: 106, baseType: !31, size: 64, align: 64, offset: 1216)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !418, file: !411, line: 108, baseType: !58, size: 32, align: 32, offset: 1280)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !418, file: !411, line: 109, baseType: !19, size: 64, align: 64, offset: 1344)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !418, file: !411, line: 134, baseType: !351, size: 64, align: 64, offset: 1408)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !418, file: !411, line: 135, baseType: !18, size: 64, align: 64, offset: 1472)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !412, file: !411, line: 24, baseType: !19, size: 64, align: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !412, file: !411, line: 25, baseType: !19, size: 64, align: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !412, file: !411, line: 26, baseType: !19, size: 64, align: 64, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !412, file: !411, line: 27, baseType: !19, size: 64, align: 64, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !412, file: !411, line: 28, baseType: !19, size: 64, align: 64, offset: 384)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !412, file: !411, line: 30, baseType: !19, size: 64, align: 64, offset: 448)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !412, file: !411, line: 31, baseType: !19, size: 64, align: 64, offset: 512)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !412, file: !411, line: 32, baseType: !19, size: 64, align: 64, offset: 576)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !412, file: !411, line: 33, baseType: !58, size: 32, align: 32, offset: 640)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !412, file: !411, line: 34, baseType: !58, size: 32, align: 32, offset: 672)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !412, file: !411, line: 37, baseType: !58, size: 32, align: 32, offset: 704)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !412, file: !411, line: 43, baseType: !19, size: 64, align: 64, offset: 768)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !406, file: !1, line: 981, baseType: !19, size: 64, align: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !406, file: !1, line: 982, baseType: !19, size: 64, align: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "keyw", scope: !406, file: !1, line: 983, baseType: !19, size: 64, align: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "tstate", scope: !406, file: !1, line: 984, baseType: !469, size: 64, align: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !411, line: 139, baseType: !418)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "lockobject", file: !1, line: 29, baseType: !473)
!473 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 24, size: 320, align: 64, elements: !474)
!474 = !{!475, !476, !477, !478}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !473, file: !1, line: 25, baseType: !20, size: 128, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "lock_lock", scope: !473, file: !1, line: 26, baseType: !401, size: 64, align: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "in_weakreflist", scope: !473, file: !1, line: 27, baseType: !19, size: 64, align: 64, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !473, file: !1, line: 28, baseType: !45, size: 8, align: 8, offset: 256)
!479 = !{!480, !487, !492, !502, !511, !519, !556, !565, !584, !614, !633, !644, !649, !665, !688, !693, !696, !701, !706, !722, !726, !730, !743, !748, !760, !795, !804, !809, !812, !837, !840, !849, !852, !855, !859, !862, !869, !883}
!480 = !DISubprogram(name: "PyInit__thread", scope: !1, file: !1, line: 1354, type: !481, isLocal: false, isDefinition: true, scopeLine: 1355, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__thread, variables: !483)
!481 = !DISubroutineType(types: !482)
!482 = !{!19}
!483 = !{!484, !485, !486}
!484 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !480, file: !1, line: 1356, type: !19)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !480, file: !1, line: 1356, type: !19)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timeout_max", scope: !480, file: !1, line: 1356, type: !19)
!487 = !DISubprogram(name: "localdummy_dealloc", scope: !1, file: !1, line: 612, type: !488, isLocal: true, isDefinition: true, scopeLine: 613, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.localdummyobject*)* @localdummy_dealloc, variables: !490)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !364}
!490 = !{!491}
!491 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !487, file: !1, line: 612, type: !364)
!492 = !DISubprogram(name: "local_dealloc", scope: !1, file: !1, line: 797, type: !493, isLocal: true, isDefinition: true, scopeLine: 798, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.localobject*)* @local_dealloc, variables: !495)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !371}
!495 = !{!496, !497, !499}
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !492, file: !1, line: 797, type: !371)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !498, file: !1, line: 807, type: !19)
!498 = distinct !DILexicalBlock(scope: !492, file: !1, line: 807, column: 5)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !500, file: !1, line: 807, type: !19)
!500 = distinct !DILexicalBlock(scope: !501, file: !1, line: 807, column: 5)
!501 = distinct !DILexicalBlock(scope: !498, file: !1, line: 807, column: 5)
!502 = !DISubprogram(name: "local_getattro", scope: !1, file: !1, line: 918, type: !503, isLocal: true, isDefinition: true, scopeLine: 919, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.localobject*, %struct._object*)* @local_getattro, variables: !505)
!503 = !DISubroutineType(types: !504)
!504 = !{!19, !371, !19}
!505 = !{!506, !507, !508, !509, !510}
!506 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !502, file: !1, line: 918, type: !371)
!507 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !502, file: !1, line: 918, type: !19)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ldict", scope: !502, file: !1, line: 920, type: !19)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !502, file: !1, line: 920, type: !19)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !502, file: !1, line: 921, type: !58)
!511 = !DISubprogram(name: "_ldict", scope: !1, file: !1, line: 813, type: !512, isLocal: true, isDefinition: true, scopeLine: 814, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.localobject*)* @_ldict, variables: !514)
!512 = !DISubroutineType(types: !513)
!513 = !{!19, !371}
!514 = !{!515, !516, !517, !518}
!515 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !511, file: !1, line: 813, type: !371)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tdict", scope: !511, file: !1, line: 815, type: !19)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ldict", scope: !511, file: !1, line: 815, type: !19)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dummy", scope: !511, file: !1, line: 815, type: !19)
!519 = !DISubprogram(name: "_local_create_dummy", scope: !1, file: !1, line: 667, type: !512, isLocal: true, isDefinition: true, scopeLine: 668, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.localobject*)* @_local_create_dummy, variables: !520)
!520 = !{!521, !522, !523, !524, !525, !526, !527, !529, !533, !535, !539, !541, !543, !546, !548, !551, !553}
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !519, file: !1, line: 667, type: !371)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tdict", scope: !519, file: !1, line: 669, type: !19)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ldict", scope: !519, file: !1, line: 669, type: !19)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wr", scope: !519, file: !1, line: 669, type: !19)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dummy", scope: !519, file: !1, line: 670, type: !364)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !519, file: !1, line: 671, type: !58)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !528, file: !1, line: 696, type: !19)
!528 = distinct !DILexicalBlock(scope: !519, file: !1, line: 696, column: 5)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !530, file: !1, line: 696, type: !19)
!530 = distinct !DILexicalBlock(scope: !531, file: !1, line: 696, column: 5)
!531 = distinct !DILexicalBlock(scope: !532, file: !1, line: 696, column: 5)
!532 = distinct !DILexicalBlock(scope: !528, file: !1, line: 696, column: 5)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !534, file: !1, line: 700, type: !19)
!534 = distinct !DILexicalBlock(scope: !519, file: !1, line: 700, column: 5)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !536, file: !1, line: 700, type: !19)
!536 = distinct !DILexicalBlock(scope: !537, file: !1, line: 700, column: 5)
!537 = distinct !DILexicalBlock(scope: !538, file: !1, line: 700, column: 5)
!538 = distinct !DILexicalBlock(scope: !534, file: !1, line: 700, column: 5)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !540, file: !1, line: 702, type: !19)
!540 = distinct !DILexicalBlock(scope: !519, file: !1, line: 702, column: 5)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !542, file: !1, line: 706, type: !19)
!542 = distinct !DILexicalBlock(scope: !519, file: !1, line: 706, column: 5)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !544, file: !1, line: 706, type: !19)
!544 = distinct !DILexicalBlock(scope: !545, file: !1, line: 706, column: 5)
!545 = distinct !DILexicalBlock(scope: !542, file: !1, line: 706, column: 5)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !547, file: !1, line: 707, type: !19)
!547 = distinct !DILexicalBlock(scope: !519, file: !1, line: 707, column: 5)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !549, file: !1, line: 707, type: !19)
!549 = distinct !DILexicalBlock(scope: !550, file: !1, line: 707, column: 5)
!550 = distinct !DILexicalBlock(scope: !547, file: !1, line: 707, column: 5)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !552, file: !1, line: 708, type: !19)
!552 = distinct !DILexicalBlock(scope: !519, file: !1, line: 708, column: 5)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !554, file: !1, line: 708, type: !19)
!554 = distinct !DILexicalBlock(scope: !555, file: !1, line: 708, column: 5)
!555 = distinct !DILexicalBlock(scope: !552, file: !1, line: 708, column: 5)
!556 = !DISubprogram(name: "local_setattro", scope: !1, file: !1, line: 849, type: !557, isLocal: true, isDefinition: true, scopeLine: 850, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.localobject*, %struct._object*, %struct._object*)* @local_setattro, variables: !559)
!557 = !DISubroutineType(types: !558)
!558 = !{!58, !371, !19, !19}
!559 = !{!560, !561, !562, !563, !564}
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !556, file: !1, line: 849, type: !371)
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !556, file: !1, line: 849, type: !19)
!562 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 3, scope: !556, file: !1, line: 849, type: !19)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ldict", scope: !556, file: !1, line: 851, type: !19)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !556, file: !1, line: 852, type: !58)
!565 = !DISubprogram(name: "local_traverse", scope: !1, file: !1, line: 766, type: !566, isLocal: true, isDefinition: true, scopeLine: 767, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.localobject*, i32 (%struct._object*, i8*)*, i8*)* @local_traverse, variables: !568)
!566 = !DISubroutineType(types: !567)
!567 = !{!58, !371, !277, !18}
!568 = !{!569, !570, !571, !572, !576, !580}
!569 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !565, file: !1, line: 766, type: !371)
!570 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !565, file: !1, line: 766, type: !277)
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !565, file: !1, line: 766, type: !18)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !573, file: !1, line: 768, type: !58)
!573 = distinct !DILexicalBlock(scope: !574, file: !1, line: 768, column: 5)
!574 = distinct !DILexicalBlock(scope: !575, file: !1, line: 768, column: 5)
!575 = distinct !DILexicalBlock(scope: !565, file: !1, line: 768, column: 5)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !577, file: !1, line: 769, type: !58)
!577 = distinct !DILexicalBlock(scope: !578, file: !1, line: 769, column: 5)
!578 = distinct !DILexicalBlock(scope: !579, file: !1, line: 769, column: 5)
!579 = distinct !DILexicalBlock(scope: !565, file: !1, line: 769, column: 5)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !581, file: !1, line: 770, type: !58)
!581 = distinct !DILexicalBlock(scope: !582, file: !1, line: 770, column: 5)
!582 = distinct !DILexicalBlock(scope: !583, file: !1, line: 770, column: 5)
!583 = distinct !DILexicalBlock(scope: !565, file: !1, line: 770, column: 5)
!584 = !DISubprogram(name: "local_clear", scope: !1, file: !1, line: 775, type: !585, isLocal: true, isDefinition: true, scopeLine: 776, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.localobject*)* @local_clear, variables: !587)
!585 = !DISubroutineType(types: !586)
!586 = !{!58, !371}
!587 = !{!588, !589, !590, !592, !596, !598, !602, !604, !608, !610}
!588 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !584, file: !1, line: 775, type: !371)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !584, file: !1, line: 777, type: !469)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !591, file: !1, line: 778, type: !19)
!591 = distinct !DILexicalBlock(scope: !584, file: !1, line: 778, column: 5)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !593, file: !1, line: 778, type: !19)
!593 = distinct !DILexicalBlock(scope: !594, file: !1, line: 778, column: 5)
!594 = distinct !DILexicalBlock(scope: !595, file: !1, line: 778, column: 5)
!595 = distinct !DILexicalBlock(scope: !591, file: !1, line: 778, column: 5)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !597, file: !1, line: 779, type: !19)
!597 = distinct !DILexicalBlock(scope: !584, file: !1, line: 779, column: 5)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !599, file: !1, line: 779, type: !19)
!599 = distinct !DILexicalBlock(scope: !600, file: !1, line: 779, column: 5)
!600 = distinct !DILexicalBlock(scope: !601, file: !1, line: 779, column: 5)
!601 = distinct !DILexicalBlock(scope: !597, file: !1, line: 779, column: 5)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !603, file: !1, line: 780, type: !19)
!603 = distinct !DILexicalBlock(scope: !584, file: !1, line: 780, column: 5)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !605, file: !1, line: 780, type: !19)
!605 = distinct !DILexicalBlock(scope: !606, file: !1, line: 780, column: 5)
!606 = distinct !DILexicalBlock(scope: !607, file: !1, line: 780, column: 5)
!607 = distinct !DILexicalBlock(scope: !603, file: !1, line: 780, column: 5)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !609, file: !1, line: 781, type: !19)
!609 = distinct !DILexicalBlock(scope: !584, file: !1, line: 781, column: 5)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !611, file: !1, line: 781, type: !19)
!611 = distinct !DILexicalBlock(scope: !612, file: !1, line: 781, column: 5)
!612 = distinct !DILexicalBlock(scope: !613, file: !1, line: 781, column: 5)
!613 = distinct !DILexicalBlock(scope: !609, file: !1, line: 781, column: 5)
!614 = !DISubprogram(name: "local_new", scope: !1, file: !1, line: 713, type: !615, isLocal: true, isDefinition: true, scopeLine: 714, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @local_new, variables: !619)
!615 = !DISubroutineType(types: !616)
!616 = !{!19, !617, !19, !19}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !21, line: 422, baseType: !34)
!619 = !{!620, !621, !622, !623, !624, !625, !627, !629, !631}
!620 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !614, file: !1, line: 713, type: !617)
!621 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !614, file: !1, line: 713, type: !19)
!622 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !614, file: !1, line: 713, type: !19)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !614, file: !1, line: 715, type: !371)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wr", scope: !614, file: !1, line: 716, type: !19)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !626, file: !1, line: 733, type: !19)
!626 = distinct !DILexicalBlock(scope: !614, file: !1, line: 733, column: 5)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !628, file: !1, line: 735, type: !19)
!628 = distinct !DILexicalBlock(scope: !614, file: !1, line: 735, column: 5)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !630, file: !1, line: 751, type: !19)
!630 = distinct !DILexicalBlock(scope: !614, file: !1, line: 751, column: 5)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !632, file: !1, line: 761, type: !19)
!632 = distinct !DILexicalBlock(scope: !614, file: !1, line: 761, column: 5)
!633 = !DISubprogram(name: "_localdummy_destroyed", scope: !1, file: !1, line: 951, type: !140, isLocal: true, isDefinition: true, scopeLine: 952, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @_localdummy_destroyed, variables: !634)
!634 = !{!635, !636, !637, !638, !639, !642}
!635 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "localweakref", arg: 1, scope: !633, file: !1, line: 951, type: !19)
!636 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dummyweakref", arg: 2, scope: !633, file: !1, line: 951, type: !19)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !633, file: !1, line: 953, type: !19)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !633, file: !1, line: 954, type: !371)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ldict", scope: !640, file: !1, line: 965, type: !19)
!640 = distinct !DILexicalBlock(scope: !641, file: !1, line: 964, column: 32)
!641 = distinct !DILexicalBlock(scope: !633, file: !1, line: 964, column: 9)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !643, file: !1, line: 973, type: !19)
!643 = distinct !DILexicalBlock(scope: !633, file: !1, line: 973, column: 5)
!644 = !DISubprogram(name: "lock_dealloc", scope: !1, file: !1, line: 32, type: !645, isLocal: true, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.lockobject*)* @lock_dealloc, variables: !647)
!645 = !DISubroutineType(types: !646)
!646 = !{null, !471}
!647 = !{!648}
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !644, file: !1, line: 32, type: !471)
!649 = !DISubprogram(name: "lock_PyThread_acquire_lock", scope: !1, file: !1, line: 103, type: !650, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.lockobject*, %struct._object*, %struct._object*)* @lock_PyThread_acquire_lock, variables: !652)
!650 = !DISubroutineType(types: !651)
!651 = !{!19, !471, !19, !19}
!652 = !{!653, !654, !655, !656, !660, !661, !662, !663}
!653 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !649, file: !1, line: 103, type: !471)
!654 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !649, file: !1, line: 103, type: !19)
!655 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !649, file: !1, line: 103, type: !19)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kwlist", scope: !649, file: !1, line: 105, type: !657)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 192, align: 64, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 3)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blocking", scope: !649, file: !1, line: 106, type: !58)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timeout", scope: !649, file: !1, line: 107, type: !393)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "microseconds", scope: !649, file: !1, line: 108, type: !394)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !649, file: !1, line: 109, type: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLockStatus", file: !4, line: 18, baseType: !3)
!665 = !DISubprogram(name: "acquire_timed", scope: !1, file: !1, line: 52, type: !666, isLocal: true, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i64)* @acquire_timed, variables: !668)
!666 = !DISubroutineType(types: !667)
!667 = !{!664, !401, !394}
!668 = !{!669, !670, !671, !672, !682, !683}
!669 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lock", arg: 1, scope: !665, file: !1, line: 52, type: !401)
!670 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "microseconds", arg: 2, scope: !665, file: !1, line: 52, type: !394)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !665, file: !1, line: 54, type: !664)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curtime", scope: !665, file: !1, line: 55, type: !673)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyTime_timeval", file: !674, line: 17, baseType: !675)
!674 = !DIFile(filename: "Include/pytime.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !676, line: 30, size: 128, align: 64, elements: !677)
!676 = !DIFile(filename: "/usr/include/bits/time.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!677 = !{!678, !680}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !675, file: !676, line: 32, baseType: !679, size: 64, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !30, line: 148, baseType: !31)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !675, file: !676, line: 33, baseType: !681, size: 64, align: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !30, line: 150, baseType: !31)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "endtime", scope: !665, file: !1, line: 56, type: !673)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !684, file: !1, line: 70, type: !469)
!684 = distinct !DILexicalBlock(scope: !685, file: !1, line: 70, column: 13)
!685 = distinct !DILexicalBlock(scope: !686, file: !1, line: 69, column: 56)
!686 = distinct !DILexicalBlock(scope: !687, file: !1, line: 69, column: 13)
!687 = distinct !DILexicalBlock(scope: !665, file: !1, line: 66, column: 8)
!688 = !DISubprogram(name: "lock_PyThread_release_lock", scope: !1, file: !1, line: 161, type: !689, isLocal: true, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.lockobject*)* @lock_PyThread_release_lock, variables: !691)
!689 = !DISubroutineType(types: !690)
!690 = !{!19, !471}
!691 = !{!692}
!692 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !688, file: !1, line: 161, type: !471)
!693 = !DISubprogram(name: "lock_locked_lock", scope: !1, file: !1, line: 184, type: !689, isLocal: true, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.lockobject*)* @lock_locked_lock, variables: !694)
!694 = !{!695}
!695 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !693, file: !1, line: 184, type: !471)
!696 = !DISubprogram(name: "rlock_dealloc", scope: !1, file: !1, line: 258, type: !697, isLocal: true, isDefinition: true, scopeLine: 259, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.rlockobject*)* @rlock_dealloc, variables: !699)
!697 = !DISubroutineType(types: !698)
!698 = !{null, !395}
!699 = !{!700}
!700 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !696, file: !1, line: 258, type: !395)
!701 = !DISubprogram(name: "rlock_repr", scope: !1, file: !1, line: 476, type: !702, isLocal: true, isDefinition: true, scopeLine: 477, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.rlockobject*)* @rlock_repr, variables: !704)
!702 = !DISubroutineType(types: !703)
!703 = !{!19, !395}
!704 = !{!705}
!705 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !701, file: !1, line: 476, type: !395)
!706 = !DISubprogram(name: "rlock_acquire", scope: !1, file: !1, line: 275, type: !707, isLocal: true, isDefinition: true, scopeLine: 276, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.rlockobject*, %struct._object*, %struct._object*)* @rlock_acquire, variables: !709)
!707 = !DISubroutineType(types: !708)
!708 = !{!19, !395, !19, !19}
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717, !718, !719}
!710 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !706, file: !1, line: 275, type: !395)
!711 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !706, file: !1, line: 275, type: !19)
!712 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !706, file: !1, line: 275, type: !19)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kwlist", scope: !706, file: !1, line: 277, type: !657)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blocking", scope: !706, file: !1, line: 278, type: !58)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timeout", scope: !706, file: !1, line: 279, type: !393)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "microseconds", scope: !706, file: !1, line: 280, type: !394)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tid", scope: !706, file: !1, line: 281, type: !31)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !706, file: !1, line: 282, type: !664)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !720, file: !1, line: 314, type: !110)
!720 = distinct !DILexicalBlock(scope: !721, file: !1, line: 313, column: 60)
!721 = distinct !DILexicalBlock(scope: !706, file: !1, line: 313, column: 9)
!722 = !DISubprogram(name: "rlock_release", scope: !1, file: !1, line: 353, type: !702, isLocal: true, isDefinition: true, scopeLine: 354, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.rlockobject*)* @rlock_release, variables: !723)
!723 = !{!724, !725}
!724 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !722, file: !1, line: 353, type: !395)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tid", scope: !722, file: !1, line: 355, type: !31)
!726 = !DISubprogram(name: "rlock_is_owned", scope: !1, file: !1, line: 438, type: !702, isLocal: true, isDefinition: true, scopeLine: 439, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.rlockobject*)* @rlock_is_owned, variables: !727)
!727 = !{!728, !729}
!728 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !726, file: !1, line: 438, type: !395)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tid", scope: !726, file: !1, line: 440, type: !31)
!730 = !DISubprogram(name: "rlock_acquire_restore", scope: !1, file: !1, line: 382, type: !731, isLocal: true, isDefinition: true, scopeLine: 383, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.rlockobject*, %struct._object*)* @rlock_acquire_restore, variables: !733)
!731 = !DISubroutineType(types: !732)
!732 = !{!19, !395, !19}
!733 = !{!734, !735, !736, !737, !738, !739}
!734 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !730, file: !1, line: 382, type: !395)
!735 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !730, file: !1, line: 382, type: !19)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "owner", scope: !730, file: !1, line: 384, type: !31)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !730, file: !1, line: 385, type: !110)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !730, file: !1, line: 386, type: !58)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !740, file: !1, line: 392, type: !469)
!740 = distinct !DILexicalBlock(scope: !741, file: !1, line: 392, column: 9)
!741 = distinct !DILexicalBlock(scope: !742, file: !1, line: 391, column: 54)
!742 = distinct !DILexicalBlock(scope: !730, file: !1, line: 391, column: 9)
!743 = !DISubprogram(name: "rlock_release_save", scope: !1, file: !1, line: 412, type: !702, isLocal: true, isDefinition: true, scopeLine: 413, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.rlockobject*)* @rlock_release_save, variables: !744)
!744 = !{!745, !746, !747}
!745 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !743, file: !1, line: 412, type: !395)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "owner", scope: !743, file: !1, line: 414, type: !31)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !743, file: !1, line: 415, type: !110)
!748 = !DISubprogram(name: "rlock_new", scope: !1, file: !1, line: 454, type: !615, isLocal: true, isDefinition: true, scopeLine: 455, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @rlock_new, variables: !749)
!749 = !{!750, !751, !752, !753, !754}
!750 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !748, file: !1, line: 454, type: !617)
!751 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !748, file: !1, line: 454, type: !19)
!752 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !748, file: !1, line: 454, type: !19)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !748, file: !1, line: 456, type: !395)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !755, file: !1, line: 466, type: !19)
!755 = distinct !DILexicalBlock(scope: !756, file: !1, line: 466, column: 13)
!756 = distinct !DILexicalBlock(scope: !757, file: !1, line: 465, column: 39)
!757 = distinct !DILexicalBlock(scope: !758, file: !1, line: 465, column: 13)
!758 = distinct !DILexicalBlock(scope: !759, file: !1, line: 459, column: 23)
!759 = distinct !DILexicalBlock(scope: !748, file: !1, line: 459, column: 9)
!760 = !DISubprogram(name: "thread_PyThread_start_new_thread", scope: !1, file: !1, line: 1033, type: !140, isLocal: true, isDefinition: true, scopeLine: 1034, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @thread_PyThread_start_new_thread, variables: !761)
!761 = !{!762, !763, !764, !765, !766, !767, !768, !769, !776, !777, !780, !782, !784, !788, !790, !792}
!762 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !760, file: !1, line: 1033, type: !19)
!763 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fargs", arg: 2, scope: !760, file: !1, line: 1033, type: !19)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !760, file: !1, line: 1035, type: !19)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !760, file: !1, line: 1035, type: !19)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "keyw", scope: !760, file: !1, line: 1035, type: !19)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "boot", scope: !760, file: !1, line: 1036, type: !405)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ident", scope: !760, file: !1, line: 1037, type: !31)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !770, file: !1, line: 1060, type: !771)
!770 = distinct !DILexicalBlock(scope: !760, file: !1, line: 1060, column: 20)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64, align: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !10, line: 33, baseType: !773)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !10, line: 31, size: 64, align: 64, elements: !774)
!774 = !{!775}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !773, file: !10, line: 32, baseType: !18, size: 64, align: 64)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !770, file: !1, line: 1060, type: !18)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !770, file: !1, line: 1060, type: !778)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64, align: 64)
!779 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !18)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !770, file: !1, line: 1060, type: !781)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !10, line: 29, baseType: !9)
!782 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !783, file: !1, line: 1071, type: !19)
!783 = distinct !DILexicalBlock(scope: !760, file: !1, line: 1071, column: 5)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !785, file: !1, line: 1076, type: !19)
!785 = distinct !DILexicalBlock(scope: !786, file: !1, line: 1076, column: 9)
!786 = distinct !DILexicalBlock(scope: !787, file: !1, line: 1074, column: 22)
!787 = distinct !DILexicalBlock(scope: !760, file: !1, line: 1074, column: 9)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !789, file: !1, line: 1077, type: !19)
!789 = distinct !DILexicalBlock(scope: !786, file: !1, line: 1077, column: 9)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !791, file: !1, line: 1078, type: !19)
!791 = distinct !DILexicalBlock(scope: !786, file: !1, line: 1078, column: 9)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !793, file: !1, line: 1078, type: !19)
!793 = distinct !DILexicalBlock(scope: !794, file: !1, line: 1078, column: 9)
!794 = distinct !DILexicalBlock(scope: !791, file: !1, line: 1078, column: 9)
!795 = !DISubprogram(name: "_Py_ANNOTATE_MEMORY_ORDER", scope: !10, file: !10, line: 59, type: !796, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, variables: !801)
!796 = !DISubroutineType(types: !797)
!797 = !{null, !798, !781}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64, align: 64)
!799 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!801 = !{!802, !803}
!802 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "address", arg: 1, scope: !795, file: !10, line: 59, type: !798)
!803 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 2, scope: !795, file: !10, line: 59, type: !781)
!804 = !DISubprogram(name: "_Py_atomic_thread_fence", scope: !10, file: !10, line: 51, type: !805, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, variables: !807)
!805 = !DISubroutineType(types: !806)
!806 = !{null, !781}
!807 = !{!808}
!808 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !804, file: !10, line: 51, type: !781)
!809 = !DISubprogram(name: "_Py_atomic_signal_fence", scope: !10, file: !10, line: 44, type: !805, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, variables: !810)
!810 = !{!811}
!811 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !809, file: !10, line: 44, type: !781)
!812 = !DISubprogram(name: "t_bootstrap", scope: !1, file: !1, line: 988, type: !352, isLocal: true, isDefinition: true, scopeLine: 989, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @t_bootstrap, variables: !813)
!813 = !{!814, !815, !816, !817, !818, !823, !824, !825, !826, !828, !830, !832, !834}
!814 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "boot_raw", arg: 1, scope: !812, file: !1, line: 988, type: !18)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "boot", scope: !812, file: !1, line: 990, type: !405)
!816 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !812, file: !1, line: 991, type: !469)
!817 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !812, file: !1, line: 992, type: !19)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file", scope: !819, file: !1, line: 1005, type: !19)
!819 = distinct !DILexicalBlock(scope: !820, file: !1, line: 1004, column: 14)
!820 = distinct !DILexicalBlock(scope: !821, file: !1, line: 1002, column: 13)
!821 = distinct !DILexicalBlock(scope: !822, file: !1, line: 1001, column: 22)
!822 = distinct !DILexicalBlock(scope: !812, file: !1, line: 1001, column: 9)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc", scope: !819, file: !1, line: 1006, type: !19)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !819, file: !1, line: 1006, type: !19)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !819, file: !1, line: 1006, type: !19)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !827, file: !1, line: 1021, type: !19)
!827 = distinct !DILexicalBlock(scope: !822, file: !1, line: 1021, column: 9)
!828 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !829, file: !1, line: 1022, type: !19)
!829 = distinct !DILexicalBlock(scope: !812, file: !1, line: 1022, column: 5)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !831, file: !1, line: 1023, type: !19)
!831 = distinct !DILexicalBlock(scope: !812, file: !1, line: 1023, column: 5)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !833, file: !1, line: 1024, type: !19)
!833 = distinct !DILexicalBlock(scope: !812, file: !1, line: 1024, column: 5)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !835, file: !1, line: 1024, type: !19)
!835 = distinct !DILexicalBlock(scope: !836, file: !1, line: 1024, column: 5)
!836 = distinct !DILexicalBlock(scope: !833, file: !1, line: 1024, column: 5)
!837 = !DISubprogram(name: "thread_PyThread_allocate_lock", scope: !1, file: !1, line: 1129, type: !130, isLocal: true, isDefinition: true, scopeLine: 1130, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @thread_PyThread_allocate_lock, variables: !838)
!838 = !{!839}
!839 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !837, file: !1, line: 1129, type: !19)
!840 = !DISubprogram(name: "newlockobject", scope: !1, file: !1, line: 545, type: !841, isLocal: true, isDefinition: true, scopeLine: 546, flags: DIFlagPrototyped, isOptimized: true, variables: !843)
!841 = !DISubroutineType(types: !842)
!842 = !{!471}
!843 = !{!844, !845}
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !840, file: !1, line: 547, type: !471)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !846, file: !1, line: 555, type: !19)
!846 = distinct !DILexicalBlock(scope: !847, file: !1, line: 555, column: 9)
!847 = distinct !DILexicalBlock(scope: !848, file: !1, line: 554, column: 34)
!848 = distinct !DILexicalBlock(scope: !840, file: !1, line: 554, column: 9)
!849 = !DISubprogram(name: "thread_PyThread_exit_thread", scope: !1, file: !1, line: 1098, type: !130, isLocal: true, isDefinition: true, scopeLine: 1099, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @thread_PyThread_exit_thread, variables: !850)
!850 = !{!851}
!851 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !849, file: !1, line: 1098, type: !19)
!852 = !DISubprogram(name: "thread_PyThread_interrupt_main", scope: !1, file: !1, line: 1112, type: !130, isLocal: true, isDefinition: true, scopeLine: 1113, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @thread_PyThread_interrupt_main, variables: !853)
!853 = !{!854}
!854 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !852, file: !1, line: 1112, type: !19)
!855 = !DISubprogram(name: "thread_get_ident", scope: !1, file: !1, line: 1141, type: !130, isLocal: true, isDefinition: true, scopeLine: 1142, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @thread_get_ident, variables: !856)
!856 = !{!857, !858}
!857 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !855, file: !1, line: 1141, type: !19)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ident", scope: !855, file: !1, line: 1143, type: !31)
!859 = !DISubprogram(name: "thread__count", scope: !1, file: !1, line: 1164, type: !130, isLocal: true, isDefinition: true, scopeLine: 1165, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @thread__count, variables: !860)
!860 = !{!861}
!861 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !859, file: !1, line: 1164, type: !19)
!862 = !DISubprogram(name: "thread_stack_size", scope: !1, file: !1, line: 1242, type: !140, isLocal: true, isDefinition: true, scopeLine: 1243, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @thread_stack_size, variables: !863)
!863 = !{!864, !865, !866, !867, !868}
!864 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !862, file: !1, line: 1242, type: !19)
!865 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !862, file: !1, line: 1242, type: !19)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_size", scope: !862, file: !1, line: 1244, type: !108)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_size", scope: !862, file: !1, line: 1245, type: !25)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !862, file: !1, line: 1246, type: !58)
!869 = !DISubprogram(name: "thread__set_sentinel", scope: !1, file: !1, line: 1203, type: !130, isLocal: true, isDefinition: true, scopeLine: 1204, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @thread__set_sentinel, variables: !870)
!870 = !{!871, !872, !873, !874, !875, !879}
!871 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !869, file: !1, line: 1203, type: !19)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wr", scope: !869, file: !1, line: 1205, type: !19)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !869, file: !1, line: 1206, type: !469)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lock", scope: !869, file: !1, line: 1207, type: !471)
!875 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !876, file: !1, line: 1216, type: !19)
!876 = distinct !DILexicalBlock(scope: !877, file: !1, line: 1216, column: 9)
!877 = distinct !DILexicalBlock(scope: !878, file: !1, line: 1209, column: 41)
!878 = distinct !DILexicalBlock(scope: !869, file: !1, line: 1209, column: 9)
!879 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !880, file: !1, line: 1225, type: !19)
!880 = distinct !DILexicalBlock(scope: !881, file: !1, line: 1225, column: 9)
!881 = distinct !DILexicalBlock(scope: !882, file: !1, line: 1224, column: 21)
!882 = distinct !DILexicalBlock(scope: !869, file: !1, line: 1224, column: 9)
!883 = !DISubprogram(name: "release_sentinel", scope: !1, file: !1, line: 1182, type: !352, isLocal: true, isDefinition: true, scopeLine: 1183, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @release_sentinel, variables: !884)
!884 = !{!885, !886, !887, !888}
!885 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "wr", arg: 1, scope: !883, file: !1, line: 1182, type: !18)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !883, file: !1, line: 1187, type: !19)
!887 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lock", scope: !883, file: !1, line: 1188, type: !471)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !889, file: !1, line: 1199, type: !19)
!889 = distinct !DILexicalBlock(scope: !883, file: !1, line: 1199, column: 5)
!890 = !{!891, !892, !893, !894, !895, !897, !898, !902, !906, !910, !914, !915, !919, !923, !927, !931, !935, !939, !961, !965, !969, !977, !981, !985, !989, !993, !997, !1001, !1005, !1009, !1013}
!891 = !DIGlobalVariable(name: "ThreadError", scope: !0, file: !1, line: 16, type: !19, isLocal: true, isDefinition: true, variable: %struct._object** @ThreadError)
!892 = !DIGlobalVariable(name: "str_dict", scope: !0, file: !1, line: 18, type: !19, isLocal: true, isDefinition: true, variable: %struct._object** @str_dict)
!893 = !DIGlobalVariable(name: "localdummytype", scope: !0, file: !1, line: 619, type: !618, isLocal: true, isDefinition: true, variable: %struct._typeobject* @localdummytype)
!894 = !DIGlobalVariable(name: "localtype", scope: !0, file: !1, line: 873, type: !618, isLocal: true, isDefinition: true, variable: %struct._typeobject* @localtype)
!895 = !DIGlobalVariable(name: "wr_callback_def", scope: !614, file: !1, line: 717, type: !896, isLocal: true, isDefinition: true, variable: %struct.PyMethodDef* @local_new.wr_callback_def)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !295, line: 47, baseType: !294)
!897 = !DIGlobalVariable(name: "Locktype", scope: !0, file: !1, line: 215, type: !618, isLocal: true, isDefinition: true, variable: %struct._typeobject* @Locktype)
!898 = !DIGlobalVariable(name: "lock_methods", scope: !0, file: !1, line: 195, type: !899, isLocal: true, isDefinition: true, variable: [9 x %struct.PyMethodDef]* @lock_methods)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !896, size: 2304, align: 64, elements: !900)
!900 = !{!901}
!901 = !DISubrange(count: 9)
!902 = !DIGlobalVariable(name: "acquire_doc", scope: !0, file: !1, line: 149, type: !903, isLocal: true, isDefinition: true, variable: [424 x i8]* @acquire_doc)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 3392, align: 8, elements: !904)
!904 = !{!905}
!905 = !DISubrange(count: 424)
!906 = !DIGlobalVariable(name: "release_doc", scope: !0, file: !1, line: 175, type: !907, isLocal: true, isDefinition: true, variable: [251 x i8]* @release_doc)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 2008, align: 8, elements: !908)
!908 = !{!909}
!909 = !DISubrange(count: 251)
!910 = !DIGlobalVariable(name: "locked_doc", scope: !0, file: !1, line: 189, type: !911, isLocal: true, isDefinition: true, variable: [105 x i8]* @locked_doc)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 840, align: 8, elements: !912)
!912 = !{!913}
!913 = !DISubrange(count: 105)
!914 = !DIGlobalVariable(name: "RLocktype", scope: !0, file: !1, line: 502, type: !618, isLocal: true, isDefinition: true, variable: %struct._typeobject* @RLocktype)
!915 = !DIGlobalVariable(name: "rlock_methods", scope: !0, file: !1, line: 483, type: !916, isLocal: true, isDefinition: true, variable: [8 x %struct.PyMethodDef]* @rlock_methods)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !896, size: 2048, align: 64, elements: !917)
!917 = !{!918}
!918 = !DISubrange(count: 8)
!919 = !DIGlobalVariable(name: "rlock_acquire_doc", scope: !0, file: !1, line: 336, type: !920, isLocal: true, isDefinition: true, variable: [667 x i8]* @rlock_acquire_doc)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 5336, align: 8, elements: !921)
!921 = !{!922}
!922 = !DISubrange(count: 667)
