; ModuleID = '_tracemalloc.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !25, subprograms: !453, globals: !956)
!1 = !DIFile(filename: "./Modules/_tracemalloc.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3, !14, !20}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !4, file: !1, line: 32, size: 32, align: 32, elements: !10)
!4 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 29, size: 96, align: 32, elements: !5)
!5 = !{!6, !7, !9}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !4, file: !1, line: 36, baseType: !3, size: 32, align: 32)
!7 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !4, file: !1, line: 40, baseType: !8, size: 32, align: 32, offset: 32)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "max_nframe", scope: !4, file: !1, line: 44, baseType: !8, size: 32, align: 32, offset: 64)
!10 = !{!11, !12, !13}
!11 = !DIEnumerator(name: "TRACEMALLOC_NOT_INITIALIZED", value: 0)
!12 = !DIEnumerator(name: "TRACEMALLOC_INITIALIZED", value: 1)
!13 = !DIEnumerator(name: "TRACEMALLOC_FINALIZED", value: 2)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 117, size: 32, align: 32, elements: !16)
!15 = !DIFile(filename: "Include/pymem.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!16 = !{!17, !18, !19}
!17 = !DIEnumerator(name: "PYMEM_DOMAIN_RAW", value: 0)
!18 = !DIEnumerator(name: "PYMEM_DOMAIN_MEM", value: 1)
!19 = !DIEnumerator(name: "PYMEM_DOMAIN_OBJ", value: 2)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 190, size: 32, align: 32, elements: !22)
!21 = !DIFile(filename: "Include/pystate.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!22 = !{!23, !24}
!23 = !DIEnumerator(name: "PyGILState_LOCKED", value: 0)
!24 = !DIEnumerator(name: "PyGILState_UNLOCKED", value: 1)
!25 = !{!26, !8, !27, !364, !378, !73, !384, !392, !393, !400, !369, !417, !434}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !29, line: 109, baseType: !30)
!29 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !29, line: 105, size: 128, align: 64, elements: !31)
!31 = !{!32, !40}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !30, file: !29, line: 107, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !34, line: 177, baseType: !35)
!34 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !36, line: 102, baseType: !37)
!36 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !38, line: 181, baseType: !39)
!38 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!39 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !30, file: !29, line: 108, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !29, line: 334, size: 3200, align: 64, elements: !43)
!43 = !{!44, !50, !54, !55, !56, !61, !123, !128, !133, !134, !139, !191, !222, !234, !240, !241, !242, !244, !246, !277, !278, !279, !288, !289, !294, !295, !297, !299, !309, !312, !330, !331, !332, !334, !336, !337, !339, !344, !349, !354, !355, !356, !357, !358, !359, !360, !361, !363}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !42, file: !29, line: 335, baseType: !45, size: 192, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !29, line: 114, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 111, size: 192, align: 64, elements: !47)
!47 = !{!48, !49}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !46, file: !29, line: 112, baseType: !28, size: 128, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !46, file: !29, line: 113, baseType: !33, size: 64, align: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !42, file: !29, line: 336, baseType: !51, size: 64, align: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!53 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !42, file: !29, line: 337, baseType: !33, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !42, file: !29, line: 337, baseType: !33, size: 64, align: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !42, file: !29, line: 341, baseType: !57, size: 64, align: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !29, line: 308, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !27}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !42, file: !29, line: 342, baseType: !62, size: 64, align: 64, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !29, line: 314, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!8, !27, !66, !8}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !36, line: 48, baseType: !68)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !69, line: 246, size: 1728, align: 64, elements: !70)
!69 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!70 = !{!71, !72, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !92, !93, !94, !95, !97, !99, !101, !105, !108, !110, !111, !112, !113, !114, !118, !119}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !68, file: !69, line: 247, baseType: !8, size: 32, align: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !68, file: !69, line: 252, baseType: !73, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !68, file: !69, line: 253, baseType: !73, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !68, file: !69, line: 254, baseType: !73, size: 64, align: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !68, file: !69, line: 255, baseType: !73, size: 64, align: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !68, file: !69, line: 256, baseType: !73, size: 64, align: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !68, file: !69, line: 257, baseType: !73, size: 64, align: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !68, file: !69, line: 258, baseType: !73, size: 64, align: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !68, file: !69, line: 259, baseType: !73, size: 64, align: 64, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !68, file: !69, line: 261, baseType: !73, size: 64, align: 64, offset: 576)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !68, file: !69, line: 262, baseType: !73, size: 64, align: 64, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !68, file: !69, line: 263, baseType: !73, size: 64, align: 64, offset: 704)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !68, file: !69, line: 265, baseType: !85, size: 64, align: 64, offset: 768)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !69, line: 161, size: 192, align: 64, elements: !87)
!87 = !{!88, !89, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !86, file: !69, line: 162, baseType: !85, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !86, file: !69, line: 163, baseType: !90, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !86, file: !69, line: 167, baseType: !8, size: 32, align: 32, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !68, file: !69, line: 267, baseType: !90, size: 64, align: 64, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !68, file: !69, line: 269, baseType: !8, size: 32, align: 32, offset: 896)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !68, file: !69, line: 273, baseType: !8, size: 32, align: 32, offset: 928)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !68, file: !69, line: 275, baseType: !96, size: 64, align: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !38, line: 140, baseType: !39)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !68, file: !69, line: 279, baseType: !98, size: 16, align: 16, offset: 1024)
!98 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !68, file: !69, line: 280, baseType: !100, size: 8, align: 8, offset: 1040)
!100 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !68, file: !69, line: 281, baseType: !102, size: 8, align: 8, offset: 1048)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 8, align: 8, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 1)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !68, file: !69, line: 285, baseType: !106, size: 64, align: 64, offset: 1088)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !69, line: 155, baseType: null)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !68, file: !69, line: 294, baseType: !109, size: 64, align: 64, offset: 1152)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !38, line: 141, baseType: !39)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !68, file: !69, line: 303, baseType: !26, size: 64, align: 64, offset: 1216)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !68, file: !69, line: 304, baseType: !26, size: 64, align: 64, offset: 1280)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !68, file: !69, line: 305, baseType: !26, size: 64, align: 64, offset: 1344)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !68, file: !69, line: 306, baseType: !26, size: 64, align: 64, offset: 1408)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !68, file: !69, line: 307, baseType: !115, size: 64, align: 64, offset: 1472)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !116, line: 62, baseType: !117)
!116 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!117 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !68, file: !69, line: 309, baseType: !8, size: 32, align: 32, offset: 1536)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !68, file: !69, line: 311, baseType: !120, size: 160, align: 8, offset: 1568)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 160, align: 8, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 20)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !42, file: !29, line: 343, baseType: !124, size: 64, align: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !29, line: 316, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!27, !27, !73}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !42, file: !29, line: 344, baseType: !129, size: 64, align: 64, offset: 576)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !29, line: 318, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!8, !27, !73, !27}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !42, file: !29, line: 345, baseType: !26, size: 64, align: 64, offset: 640)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !42, file: !29, line: 346, baseType: !135, size: 64, align: 64, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !29, line: 320, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!27, !27}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !42, file: !29, line: 350, baseType: !140, size: 64, align: 64, offset: 768)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !29, line: 278, baseType: !142)
!142 = !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 236, size: 2176, align: 64, elements: !143)
!143 = !{!144, !149, !150, !151, !152, !153, !158, !160, !161, !162, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !142, file: !29, line: 241, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !29, line: 166, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!27, !27, !27}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !142, file: !29, line: 242, baseType: !145, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !142, file: !29, line: 243, baseType: !145, size: 64, align: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !142, file: !29, line: 244, baseType: !145, size: 64, align: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !142, file: !29, line: 245, baseType: !145, size: 64, align: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !142, file: !29, line: 246, baseType: !154, size: 64, align: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !29, line: 167, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!27, !27, !27, !27}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !142, file: !29, line: 247, baseType: !159, size: 64, align: 64, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !29, line: 165, baseType: !136)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !142, file: !29, line: 248, baseType: !159, size: 64, align: 64, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !142, file: !29, line: 249, baseType: !159, size: 64, align: 64, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !142, file: !29, line: 250, baseType: !163, size: 64, align: 64, offset: 576)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !29, line: 168, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!8, !27}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !142, file: !29, line: 251, baseType: !159, size: 64, align: 64, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !142, file: !29, line: 252, baseType: !145, size: 64, align: 64, offset: 704)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !142, file: !29, line: 253, baseType: !145, size: 64, align: 64, offset: 768)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !142, file: !29, line: 254, baseType: !145, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !142, file: !29, line: 255, baseType: !145, size: 64, align: 64, offset: 896)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !142, file: !29, line: 256, baseType: !145, size: 64, align: 64, offset: 960)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !142, file: !29, line: 257, baseType: !159, size: 64, align: 64, offset: 1024)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !142, file: !29, line: 258, baseType: !26, size: 64, align: 64, offset: 1088)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !142, file: !29, line: 259, baseType: !159, size: 64, align: 64, offset: 1152)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !142, file: !29, line: 261, baseType: !145, size: 64, align: 64, offset: 1216)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !142, file: !29, line: 262, baseType: !145, size: 64, align: 64, offset: 1280)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !142, file: !29, line: 263, baseType: !145, size: 64, align: 64, offset: 1344)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !142, file: !29, line: 264, baseType: !145, size: 64, align: 64, offset: 1408)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !142, file: !29, line: 265, baseType: !154, size: 64, align: 64, offset: 1472)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !142, file: !29, line: 266, baseType: !145, size: 64, align: 64, offset: 1536)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !142, file: !29, line: 267, baseType: !145, size: 64, align: 64, offset: 1600)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !142, file: !29, line: 268, baseType: !145, size: 64, align: 64, offset: 1664)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !142, file: !29, line: 269, baseType: !145, size: 64, align: 64, offset: 1728)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !142, file: !29, line: 270, baseType: !145, size: 64, align: 64, offset: 1792)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !142, file: !29, line: 272, baseType: !145, size: 64, align: 64, offset: 1856)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !142, file: !29, line: 273, baseType: !145, size: 64, align: 64, offset: 1920)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !142, file: !29, line: 274, baseType: !145, size: 64, align: 64, offset: 1984)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !142, file: !29, line: 275, baseType: !145, size: 64, align: 64, offset: 2048)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !142, file: !29, line: 277, baseType: !159, size: 64, align: 64, offset: 2112)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !42, file: !29, line: 351, baseType: !192, size: 64, align: 64, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !29, line: 292, baseType: !194)
!194 = !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 280, size: 640, align: 64, elements: !195)
!195 = !{!196, !201, !202, !207, !208, !209, !214, !215, !220, !221}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !194, file: !29, line: 281, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !29, line: 169, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!33, !27}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !194, file: !29, line: 282, baseType: !145, size: 64, align: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !194, file: !29, line: 283, baseType: !203, size: 64, align: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !29, line: 170, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!27, !27, !33}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !194, file: !29, line: 284, baseType: !203, size: 64, align: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !194, file: !29, line: 285, baseType: !26, size: 64, align: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !194, file: !29, line: 286, baseType: !210, size: 64, align: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !29, line: 172, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!8, !27, !33, !27}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !194, file: !29, line: 287, baseType: !26, size: 64, align: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !194, file: !29, line: 288, baseType: !216, size: 64, align: 64, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !29, line: 231, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!8, !27, !27}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !194, file: !29, line: 290, baseType: !145, size: 64, align: 64, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !194, file: !29, line: 291, baseType: !203, size: 64, align: 64, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !42, file: !29, line: 352, baseType: !223, size: 64, align: 64, offset: 896)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !29, line: 298, baseType: !225)
!225 = !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 294, size: 192, align: 64, elements: !226)
!226 = !{!227, !228, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !225, file: !29, line: 295, baseType: !197, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !225, file: !29, line: 296, baseType: !145, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !225, file: !29, line: 297, baseType: !230, size: 64, align: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !29, line: 174, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!8, !27, !27, !27}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !42, file: !29, line: 356, baseType: !235, size: 64, align: 64, offset: 960)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !29, line: 321, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!239, !27}
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !34, line: 186, baseType: !33)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !42, file: !29, line: 357, baseType: !154, size: 64, align: 64, offset: 1024)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !42, file: !29, line: 358, baseType: !135, size: 64, align: 64, offset: 1088)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !42, file: !29, line: 359, baseType: !243, size: 64, align: 64, offset: 1152)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !29, line: 317, baseType: !146)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !42, file: !29, line: 360, baseType: !245, size: 64, align: 64, offset: 1216)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !29, line: 319, baseType: !231)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !42, file: !29, line: 363, baseType: !247, size: 64, align: 64, offset: 1280)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !29, line: 304, baseType: !249)
!249 = !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 301, size: 128, align: 64, elements: !250)
!250 = !{!251, !272}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !249, file: !29, line: 302, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !29, line: 193, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!8, !27, !256, !8}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !29, line: 191, baseType: !258)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !29, line: 178, size: 640, align: 64, elements: !259)
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !269, !270, !271}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !258, file: !29, line: 179, baseType: !26, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !258, file: !29, line: 180, baseType: !27, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !258, file: !29, line: 181, baseType: !33, size: 64, align: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !258, file: !29, line: 182, baseType: !33, size: 64, align: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !258, file: !29, line: 184, baseType: !8, size: 32, align: 32, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !258, file: !29, line: 185, baseType: !8, size: 32, align: 32, offset: 288)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !258, file: !29, line: 186, baseType: !73, size: 64, align: 64, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !258, file: !29, line: 187, baseType: !268, size: 64, align: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !258, file: !29, line: 188, baseType: !268, size: 64, align: 64, offset: 448)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !258, file: !29, line: 189, baseType: !268, size: 64, align: 64, offset: 512)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !258, file: !29, line: 190, baseType: !26, size: 64, align: 64, offset: 576)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !249, file: !29, line: 303, baseType: !273, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !29, line: 194, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !27, !256}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !42, file: !29, line: 366, baseType: !117, size: 64, align: 64, offset: 1344)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !42, file: !29, line: 368, baseType: !51, size: 64, align: 64, offset: 1408)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !42, file: !29, line: 372, baseType: !280, size: 64, align: 64, offset: 1472)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !29, line: 233, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!8, !27, !284, !26}
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !29, line: 232, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!8, !27, !26}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !42, file: !29, line: 375, baseType: !163, size: 64, align: 64, offset: 1536)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !42, file: !29, line: 379, baseType: !290, size: 64, align: 64, offset: 1600)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !29, line: 322, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!27, !27, !27, !8}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !42, file: !29, line: 382, baseType: !33, size: 64, align: 64, offset: 1664)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !42, file: !29, line: 385, baseType: !296, size: 64, align: 64, offset: 1728)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !29, line: 323, baseType: !136)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !42, file: !29, line: 386, baseType: !298, size: 64, align: 64, offset: 1792)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !29, line: 324, baseType: !136)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !42, file: !29, line: 389, baseType: !300, size: 64, align: 64, offset: 1856)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !302, line: 40, size: 256, align: 64, elements: !303)
!302 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!303 = !{!304, !305, !307, !308}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !301, file: !302, line: 41, baseType: !51, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !301, file: !302, line: 42, baseType: !306, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !302, line: 18, baseType: !146)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !301, file: !302, line: 43, baseType: !8, size: 32, align: 32, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !301, file: !302, line: 45, baseType: !51, size: 64, align: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !42, file: !29, line: 390, baseType: !310, size: 64, align: 64, offset: 1920)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !29, line: 390, flags: DIFlagFwdDecl)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !42, file: !29, line: 391, baseType: !313, size: 64, align: 64, offset: 1984)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !315, line: 11, size: 320, align: 64, elements: !316)
!315 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!316 = !{!317, !318, !323, !328, !329}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !314, file: !315, line: 12, baseType: !73, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !314, file: !315, line: 13, baseType: !319, size: 64, align: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !315, line: 8, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!27, !27, !26}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !314, file: !315, line: 14, baseType: !324, size: 64, align: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !315, line: 9, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!8, !27, !27, !26}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !314, file: !315, line: 15, baseType: !73, size: 64, align: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !314, file: !315, line: 16, baseType: !26, size: 64, align: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !42, file: !29, line: 392, baseType: !41, size: 64, align: 64, offset: 2048)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !42, file: !29, line: 393, baseType: !27, size: 64, align: 64, offset: 2112)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !42, file: !29, line: 394, baseType: !333, size: 64, align: 64, offset: 2176)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !29, line: 325, baseType: !155)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !42, file: !29, line: 395, baseType: !335, size: 64, align: 64, offset: 2240)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !29, line: 326, baseType: !231)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !42, file: !29, line: 396, baseType: !33, size: 64, align: 64, offset: 2304)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !42, file: !29, line: 397, baseType: !338, size: 64, align: 64, offset: 2368)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !29, line: 327, baseType: !231)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !42, file: !29, line: 398, baseType: !340, size: 64, align: 64, offset: 2432)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !29, line: 329, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!27, !41, !33}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !42, file: !29, line: 399, baseType: !345, size: 64, align: 64, offset: 2496)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !29, line: 328, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!27, !41, !27, !27}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !42, file: !29, line: 400, baseType: !350, size: 64, align: 64, offset: 2560)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !29, line: 307, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !26}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !42, file: !29, line: 401, baseType: !163, size: 64, align: 64, offset: 2624)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !42, file: !29, line: 402, baseType: !27, size: 64, align: 64, offset: 2688)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !42, file: !29, line: 403, baseType: !27, size: 64, align: 64, offset: 2752)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !42, file: !29, line: 404, baseType: !27, size: 64, align: 64, offset: 2816)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !42, file: !29, line: 405, baseType: !27, size: 64, align: 64, offset: 2880)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !42, file: !29, line: 406, baseType: !27, size: 64, align: 64, offset: 2944)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !42, file: !29, line: 407, baseType: !57, size: 64, align: 64, offset: 3008)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !42, file: !29, line: 410, baseType: !362, size: 32, align: 32, offset: 3072)
!362 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !42, file: !29, line: 412, baseType: !57, size: 64, align: 64, offset: 3136)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "traceback_t", file: !1, line: 79, baseType: !366)
!366 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 75, size: 192, align: 64, elements: !367)
!367 = !{!368, !370, !371}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !366, file: !1, line: 76, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_uhash_t", file: !34, line: 189, baseType: !115)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "nframe", scope: !366, file: !1, line: 77, baseType: !8, size: 32, align: 32, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !366, file: !1, line: 78, baseType: !372, size: 96, align: 8, offset: 96)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 96, align: 8, elements: !103)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "frame_t", file: !1, line: 73, baseType: !374)
!374 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 64, size: 96, align: 8, elements: !375)
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !374, file: !1, line: 71, baseType: !27, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !374, file: !1, line: 72, baseType: !8, size: 32, align: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "trace_t", file: !1, line: 97, baseType: !380)
!380 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 91, size: 128, align: 64, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !380, file: !1, line: 93, baseType: !115, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !380, file: !1, line: 96, baseType: !364, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !386, line: 33, baseType: !387)
!386 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!387 = !DICompositeType(tag: DW_TAG_structure_type, file: !386, line: 25, size: 256, align: 64, elements: !388)
!388 = !{!389, !390}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !387, file: !386, line: 26, baseType: !45, size: 192, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !387, file: !386, line: 27, baseType: !391, size: 64, align: 64, offset: 192)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 64, align: 64, elements: !103)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_hash_func", file: !394, line: 41, baseType: !395)
!394 = !DIFile(filename: "./Modules/hashtable.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!369, !398}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_compare_func", file: !394, line: 42, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!8, !398, !404}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_entry_t", file: !394, line: 27, baseType: !407)
!407 = !DICompositeType(tag: DW_TAG_structure_type, file: !394, line: 19, size: 192, align: 64, elements: !408)
!408 = !{!409, !415, !416}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_Py_slist_item", scope: !407, file: !394, line: 21, baseType: !410, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_slist_item_t", file: !394, line: 9, baseType: !411)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_slist_item_s", file: !394, line: 7, size: 64, align: 64, elements: !412)
!412 = !{!413}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !411, file: !394, line: 8, baseType: !414, size: 64, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !407, file: !394, line: 23, baseType: !398, size: 64, align: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "key_hash", scope: !407, file: !394, line: 24, baseType: !369, size: 64, align: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemAllocator", file: !15, line: 140, baseType: !419)
!419 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 128, size: 256, align: 64, elements: !420)
!420 = !{!421, !422, !426, !430}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !419, file: !15, line: 130, baseType: !26, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !419, file: !15, line: 133, baseType: !423, size: 64, align: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!26, !26, !115}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !419, file: !15, line: 136, baseType: !427, size: 64, align: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!26, !26, !26, !115}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !419, file: !15, line: 139, baseType: !431, size: 64, align: 64, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{null, !26, !26}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !436, line: 351, baseType: !437)
!436 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!437 = !DICompositeType(tag: DW_TAG_structure_type, file: !436, line: 217, size: 384, align: 64, elements: !438)
!438 = !{!439, !440, !441, !442, !450}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !437, file: !436, line: 291, baseType: !28, size: 128, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !437, file: !436, line: 292, baseType: !33, size: 64, align: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !437, file: !436, line: 293, baseType: !239, size: 64, align: 64, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !437, file: !436, line: 349, baseType: !443, size: 32, align: 32, offset: 256)
!443 = !DICompositeType(tag: DW_TAG_structure_type, scope: !437, file: !436, line: 294, size: 32, align: 32, elements: !444)
!444 = !{!445, !446, !447, !448, !449}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !443, file: !436, line: 303, baseType: !362, size: 2, align: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !443, file: !436, line: 331, baseType: !362, size: 3, align: 32, offset: 2)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !443, file: !436, line: 336, baseType: !362, size: 1, align: 32, offset: 5)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !443, file: !436, line: 340, baseType: !362, size: 1, align: 32, offset: 6)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !443, file: !436, line: 345, baseType: !362, size: 1, align: 32, offset: 7)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !437, file: !436, line: 350, baseType: !451, size: 64, align: 64, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !116, line: 90, baseType: !8)
!453 = !{!454, !459, !477, !481, !484, !487, !492, !493, !501, !504, !511, !566, !573, !584, !601, !623, !635, !640, !647, !657, !663, !666, !667, !670, !675, !682, !683, !687, !693, !705, !715, !722, !729, !732, !742, !745, !751, !760, !770, !891, !906, !916, !920, !927, !932, !940, !949}
!454 = !DISubprogram(name: "PyInit__tracemalloc", scope: !1, file: !1, line: 1322, type: !455, isLocal: false, isDefinition: true, scopeLine: 1323, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__tracemalloc, variables: !457)
!455 = !DISubroutineType(types: !456)
!456 = !{!27}
!457 = !{!458}
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !454, file: !1, line: 1324, type: !27)
!459 = !DISubprogram(name: "_PyTraceMalloc_Init", scope: !1, file: !1, line: 1364, type: !460, isLocal: false, isDefinition: true, scopeLine: 1365, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @_PyTraceMalloc_Init, variables: !462)
!460 = !DISubroutineType(types: !461)
!461 = !{!8}
!462 = !{!463, !464, !465, !468, !469, !471, !472, !473, !475}
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !459, file: !1, line: 1366, type: !73)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nframe", scope: !459, file: !1, line: 1367, type: !8)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "endptr", scope: !466, file: !1, line: 1374, type: !73)
!466 = distinct !DILexicalBlock(scope: !467, file: !1, line: 1373, column: 61)
!467 = distinct !DILexicalBlock(scope: !459, file: !1, line: 1373, column: 9)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !466, file: !1, line: 1375, type: !39)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xoptions", scope: !470, file: !1, line: 1391, type: !27)
!470 = distinct !DILexicalBlock(scope: !467, file: !1, line: 1390, column: 10)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !470, file: !1, line: 1391, type: !27)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !470, file: !1, line: 1391, type: !27)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !474, file: !1, line: 1402, type: !27)
!474 = distinct !DILexicalBlock(scope: !470, file: !1, line: 1402, column: 9)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !476, file: !1, line: 1412, type: !27)
!476 = distinct !DILexicalBlock(scope: !470, file: !1, line: 1412, column: 9)
!477 = !DISubprogram(name: "_PyTraceMalloc_Fini", scope: !1, file: !1, line: 1422, type: !478, isLocal: false, isDefinition: true, scopeLine: 1423, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_PyTraceMalloc_Fini, variables: !480)
!478 = !DISubroutineType(types: !479)
!479 = !{null}
!480 = !{}
!481 = !DISubprogram(name: "py_tracemalloc_is_tracing", scope: !1, file: !1, line: 928, type: !137, isLocal: true, isDefinition: true, scopeLine: 929, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @py_tracemalloc_is_tracing, variables: !482)
!482 = !{!483}
!483 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !481, file: !1, line: 928, type: !27)
!484 = !DISubprogram(name: "py_tracemalloc_clear_traces", scope: !1, file: !1, line: 939, type: !137, isLocal: true, isDefinition: true, scopeLine: 940, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @py_tracemalloc_clear_traces, variables: !485)
!485 = !{!486}
!486 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !484, file: !1, line: 939, type: !27)
!487 = !DISubprogram(name: "set_reentrant", scope: !1, file: !1, line: 167, type: !488, isLocal: true, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: true, variables: !490)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !8}
!490 = !{!491}
!491 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "reentrant", arg: 1, scope: !487, file: !1, line: 167, type: !8)
!492 = !DISubprogram(name: "tracemalloc_clear_traces", scope: !1, file: !1, line: 704, type: !478, isLocal: true, isDefinition: true, scopeLine: 705, flags: DIFlagPrototyped, isOptimized: true, variables: !480)
!493 = !DISubprogram(name: "traceback_free_traceback", scope: !1, file: !1, line: 695, type: !494, isLocal: true, isDefinition: true, scopeLine: 696, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Py_hashtable_entry_t*, i8*)* @traceback_free_traceback, variables: !497)
!494 = !DISubroutineType(types: !495)
!495 = !{!8, !496, !26}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!497 = !{!498, !499, !500}
!498 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "entry", arg: 1, scope: !493, file: !1, line: 695, type: !496)
!499 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "user_data", arg: 2, scope: !493, file: !1, line: 695, type: !26)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "traceback", scope: !493, file: !1, line: 697, type: !364)
!501 = !DISubprogram(name: "raw_free", scope: !1, file: !1, line: 228, type: !352, isLocal: true, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: true, variables: !502)
!502 = !{!503}
!503 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !501, file: !1, line: 228, type: !26)
!504 = !DISubprogram(name: "tracemalloc_clear_filename", scope: !1, file: !1, line: 687, type: !494, isLocal: true, isDefinition: true, scopeLine: 688, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Py_hashtable_entry_t*, i8*)* @tracemalloc_clear_filename, variables: !505)
!505 = !{!506, !507, !508, !509}
!506 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "entry", arg: 1, scope: !504, file: !1, line: 687, type: !496)
!507 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "user_data", arg: 2, scope: !504, file: !1, line: 687, type: !26)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filename", scope: !504, file: !1, line: 689, type: !27)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !510, file: !1, line: 690, type: !27)
!510 = distinct !DILexicalBlock(scope: !504, file: !1, line: 690, column: 5)
!511 = !DISubprogram(name: "py_tracemalloc_get_traces", scope: !1, file: !1, line: 1087, type: !147, isLocal: true, isDefinition: true, scopeLine: 1088, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @py_tracemalloc_get_traces, variables: !512)
!512 = !{!513, !514, !515, !559, !560, !562}
!513 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !511, file: !1, line: 1087, type: !27)
!514 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !511, file: !1, line: 1087, type: !27)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "get_traces", scope: !511, file: !1, line: 1089, type: !516)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_traces_t", file: !1, line: 1045, baseType: !517)
!517 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 1041, size: 192, align: 64, elements: !518)
!518 = !{!519, !557, !558}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "traces", scope: !517, file: !1, line: 1042, baseType: !520, size: 64, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_t", file: !394, line: 67, baseType: !522)
!522 = !DICompositeType(tag: DW_TAG_structure_type, file: !394, line: 55, size: 704, align: 64, elements: !523)
!523 = !{!524, !525, !526, !533, !534, !535, !536, !541, !543, !548}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "num_buckets", scope: !522, file: !394, line: 56, baseType: !115, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !522, file: !394, line: 57, baseType: !115, size: 64, align: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !522, file: !394, line: 58, baseType: !527, size: 64, align: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_slist_t", file: !394, line: 13, baseType: !529)
!529 = !DICompositeType(tag: DW_TAG_structure_type, file: !394, line: 11, size: 64, align: 64, elements: !530)
!530 = !{!531}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !529, file: !394, line: 12, baseType: !532, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !522, file: !394, line: 59, baseType: !115, size: 64, align: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "hash_func", scope: !522, file: !394, line: 61, baseType: !393, size: 64, align: 64, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "compare_func", scope: !522, file: !394, line: 62, baseType: !400, size: 64, align: 64, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "copy_data_func", scope: !522, file: !394, line: 63, baseType: !537, size: 64, align: 64, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_copy_data_func", file: !394, line: 43, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64, align: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!26, !26}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "free_data_func", scope: !522, file: !394, line: 64, baseType: !542, size: 64, align: 64, offset: 448)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_free_data_func", file: !394, line: 44, baseType: !351)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "get_data_size_func", scope: !522, file: !394, line: 65, baseType: !544, size: 64, align: 64, offset: 512)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_get_data_size_func", file: !394, line: 45, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, align: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!115, !26}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !522, file: !394, line: 66, baseType: !549, size: 128, align: 64, offset: 576)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_allocator_t", file: !394, line: 53, baseType: !550)
!550 = !DICompositeType(tag: DW_TAG_structure_type, file: !394, line: 47, size: 128, align: 64, elements: !551)
!551 = !{!552, !556}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !550, file: !394, line: 49, baseType: !553, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64, align: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!26, !115}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !550, file: !394, line: 52, baseType: !351, size: 64, align: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "tracebacks", scope: !517, file: !1, line: 1043, baseType: !520, size: 64, align: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !517, file: !1, line: 1044, baseType: !27, size: 64, align: 64, offset: 128)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !511, file: !1, line: 1090, type: !8)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !561, file: !1, line: 1130, type: !27)
!561 = distinct !DILexicalBlock(scope: !511, file: !1, line: 1130, column: 5)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !563, file: !1, line: 1130, type: !27)
!563 = distinct !DILexicalBlock(scope: !564, file: !1, line: 1130, column: 5)
!564 = distinct !DILexicalBlock(scope: !565, file: !1, line: 1130, column: 5)
!565 = distinct !DILexicalBlock(scope: !561, file: !1, line: 1130, column: 5)
!566 = !DISubprogram(name: "hashtable_new", scope: !1, file: !1, line: 212, type: !567, isLocal: true, isDefinition: true, scopeLine: 215, flags: DIFlagPrototyped, isOptimized: true, variables: !569)
!567 = !DISubroutineType(types: !568)
!568 = !{!520, !115, !393, !400}
!569 = !{!570, !571, !572}
!570 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data_size", arg: 1, scope: !566, file: !1, line: 212, type: !115)
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hash_func", arg: 2, scope: !566, file: !1, line: 213, type: !393)
!572 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "compare_func", arg: 3, scope: !566, file: !1, line: 214, type: !400)
!573 = !DISubprogram(name: "tracemalloc_get_traces_fill", scope: !1, file: !1, line: 1048, type: !494, isLocal: true, isDefinition: true, scopeLine: 1049, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Py_hashtable_entry_t*, i8*)* @tracemalloc_get_traces_fill, variables: !574)
!574 = !{!575, !576, !577, !579, !580, !581, !582}
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "entry", arg: 1, scope: !573, file: !1, line: 1048, type: !496)
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "user_data", arg: 2, scope: !573, file: !1, line: 1048, type: !26)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "get_traces", scope: !573, file: !1, line: 1050, type: !578)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64, align: 64)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "trace", scope: !573, file: !1, line: 1051, type: !378)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tracemalloc_obj", scope: !573, file: !1, line: 1052, type: !27)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !573, file: !1, line: 1053, type: !8)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !583, file: !1, line: 1062, type: !27)
!583 = distinct !DILexicalBlock(scope: !573, file: !1, line: 1062, column: 5)
!584 = !DISubprogram(name: "trace_to_pyobject", scope: !1, file: !1, line: 1015, type: !585, isLocal: true, isDefinition: true, scopeLine: 1016, flags: DIFlagPrototyped, isOptimized: true, variables: !587)
!585 = !DISubroutineType(types: !586)
!586 = !{!27, !378, !520}
!587 = !{!588, !589, !590, !591, !592, !593, !597}
!588 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "trace", arg: 1, scope: !584, file: !1, line: 1015, type: !378)
!589 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "intern_tracebacks", arg: 2, scope: !584, file: !1, line: 1015, type: !520)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "trace_obj", scope: !584, file: !1, line: 1017, type: !27)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !584, file: !1, line: 1018, type: !27)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "traceback", scope: !584, file: !1, line: 1018, type: !27)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !594, file: !1, line: 1026, type: !27)
!594 = distinct !DILexicalBlock(scope: !595, file: !1, line: 1026, column: 9)
!595 = distinct !DILexicalBlock(scope: !596, file: !1, line: 1025, column: 23)
!596 = distinct !DILexicalBlock(scope: !584, file: !1, line: 1025, column: 9)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !598, file: !1, line: 1033, type: !27)
!598 = distinct !DILexicalBlock(scope: !599, file: !1, line: 1033, column: 9)
!599 = distinct !DILexicalBlock(scope: !600, file: !1, line: 1032, column: 28)
!600 = distinct !DILexicalBlock(scope: !584, file: !1, line: 1032, column: 9)
!601 = !DISubprogram(name: "traceback_to_pyobject", scope: !1, file: !1, line: 977, type: !602, isLocal: true, isDefinition: true, scopeLine: 978, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.traceback_t*, %struct._Py_hashtable_t*)* @traceback_to_pyobject, variables: !604)
!602 = !DISubroutineType(types: !603)
!603 = !{!27, !364, !520}
!604 = !{!605, !606, !607, !608, !609, !610, !617}
!605 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "traceback", arg: 1, scope: !601, file: !1, line: 977, type: !364)
!606 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "intern_table", arg: 2, scope: !601, file: !1, line: 977, type: !520)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !601, file: !1, line: 979, type: !8)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frames", scope: !601, file: !1, line: 980, type: !27)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frame", scope: !601, file: !1, line: 980, type: !27)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !611, file: !1, line: 996, type: !27)
!611 = distinct !DILexicalBlock(scope: !612, file: !1, line: 996, column: 13)
!612 = distinct !DILexicalBlock(scope: !613, file: !1, line: 995, column: 28)
!613 = distinct !DILexicalBlock(scope: !614, file: !1, line: 995, column: 13)
!614 = distinct !DILexicalBlock(scope: !615, file: !1, line: 993, column: 43)
!615 = distinct !DILexicalBlock(scope: !616, file: !1, line: 993, column: 5)
!616 = distinct !DILexicalBlock(scope: !601, file: !1, line: 993, column: 5)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !618, file: !1, line: 1004, type: !27)
!618 = distinct !DILexicalBlock(scope: !619, file: !1, line: 1004, column: 13)
!619 = distinct !DILexicalBlock(scope: !620, file: !1, line: 1003, column: 69)
!620 = distinct !DILexicalBlock(scope: !621, file: !1, line: 1003, column: 13)
!621 = distinct !DILexicalBlock(scope: !622, file: !1, line: 1002, column: 31)
!622 = distinct !DILexicalBlock(scope: !601, file: !1, line: 1002, column: 9)
!623 = !DISubprogram(name: "frame_to_pyobject", scope: !1, file: !1, line: 952, type: !624, isLocal: true, isDefinition: true, scopeLine: 953, flags: DIFlagPrototyped, isOptimized: true, variables: !627)
!624 = !DISubroutineType(types: !625)
!625 = !{!27, !626}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!627 = !{!628, !629, !630, !631}
!628 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frame", arg: 1, scope: !623, file: !1, line: 952, type: !626)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frame_obj", scope: !623, file: !1, line: 954, type: !27)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lineno_obj", scope: !623, file: !1, line: 954, type: !27)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !632, file: !1, line: 968, type: !27)
!632 = distinct !DILexicalBlock(scope: !633, file: !1, line: 968, column: 9)
!633 = distinct !DILexicalBlock(scope: !634, file: !1, line: 967, column: 29)
!634 = distinct !DILexicalBlock(scope: !623, file: !1, line: 967, column: 9)
!635 = !DISubprogram(name: "lineno_as_obj", scope: !1, file: !1, line: 913, type: !636, isLocal: true, isDefinition: true, scopeLine: 914, flags: DIFlagPrototyped, isOptimized: true, variables: !638)
!636 = !DISubroutineType(types: !637)
!637 = !{!27, !8}
!638 = !{!639}
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 1, scope: !635, file: !1, line: 913, type: !8)
!640 = !DISubprogram(name: "tracemalloc_pyobject_decref_cb", scope: !1, file: !1, line: 1070, type: !494, isLocal: true, isDefinition: true, scopeLine: 1071, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Py_hashtable_entry_t*, i8*)* @tracemalloc_pyobject_decref_cb, variables: !641)
!641 = !{!642, !643, !644, !645}
!642 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "entry", arg: 1, scope: !640, file: !1, line: 1070, type: !496)
!643 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "user_data", arg: 2, scope: !640, file: !1, line: 1070, type: !26)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !640, file: !1, line: 1072, type: !27)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !646, file: !1, line: 1073, type: !27)
!646 = distinct !DILexicalBlock(scope: !640, file: !1, line: 1073, column: 5)
!647 = !DISubprogram(name: "py_tracemalloc_get_object_traceback", scope: !1, file: !1, line: 1154, type: !147, isLocal: true, isDefinition: true, scopeLine: 1155, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @py_tracemalloc_get_object_traceback, variables: !648)
!648 = !{!649, !650, !651, !654, !655, !656}
!649 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !647, file: !1, line: 1154, type: !27)
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !647, file: !1, line: 1154, type: !27)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !647, file: !1, line: 1156, type: !652)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !29, line: 422, baseType: !42)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !647, file: !1, line: 1157, type: !26)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "trace", scope: !647, file: !1, line: 1158, type: !379)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "found", scope: !647, file: !1, line: 1159, type: !8)
!657 = !DISubprogram(name: "py_tracemalloc_start", scope: !1, file: !1, line: 1187, type: !147, isLocal: true, isDefinition: true, scopeLine: 1188, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @py_tracemalloc_start, variables: !658)
!658 = !{!659, !660, !661, !662}
!659 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !657, file: !1, line: 1187, type: !27)
!660 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !657, file: !1, line: 1187, type: !27)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nframe", scope: !657, file: !1, line: 1189, type: !33)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nframe_int", scope: !657, file: !1, line: 1190, type: !8)
!663 = !DISubprogram(name: "py_tracemalloc_stop", scope: !1, file: !1, line: 1216, type: !137, isLocal: true, isDefinition: true, scopeLine: 1217, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @py_tracemalloc_stop, variables: !664)
!664 = !{!665}
!665 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !663, file: !1, line: 1216, type: !27)
!666 = !DISubprogram(name: "tracemalloc_stop", scope: !1, file: !1, line: 887, type: !478, isLocal: true, isDefinition: true, scopeLine: 888, flags: DIFlagPrototyped, isOptimized: true, variables: !480)
!667 = !DISubprogram(name: "py_tracemalloc_get_traceback_limit", scope: !1, file: !1, line: 1232, type: !137, isLocal: true, isDefinition: true, scopeLine: 1233, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @py_tracemalloc_get_traceback_limit, variables: !668)
!668 = !{!669}
!669 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !667, file: !1, line: 1232, type: !27)
!670 = !DISubprogram(name: "tracemalloc_get_tracemalloc_memory", scope: !1, file: !1, line: 1244, type: !137, isLocal: true, isDefinition: true, scopeLine: 1245, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @tracemalloc_get_tracemalloc_memory, variables: !671)
!671 = !{!672, !673, !674}
!672 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !670, file: !1, line: 1244, type: !27)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !670, file: !1, line: 1246, type: !115)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size_obj", scope: !670, file: !1, line: 1247, type: !27)
!675 = !DISubprogram(name: "tracemalloc_get_traced_memory", scope: !1, file: !1, line: 1267, type: !137, isLocal: true, isDefinition: true, scopeLine: 1268, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @tracemalloc_get_traced_memory, variables: !676)
!676 = !{!677, !678, !679, !680, !681}
!677 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !675, file: !1, line: 1267, type: !27)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !675, file: !1, line: 1269, type: !33)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "peak_size", scope: !675, file: !1, line: 1269, type: !33)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size_obj", scope: !675, file: !1, line: 1270, type: !27)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "peak_size_obj", scope: !675, file: !1, line: 1270, type: !27)
!682 = !DISubprogram(name: "tracemalloc_init", scope: !1, file: !1, line: 729, type: !460, isLocal: true, isDefinition: true, scopeLine: 730, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @tracemalloc_init, variables: !480)
!683 = !DISubprogram(name: "hashtable_compare_unicode", scope: !1, file: !1, line: 201, type: !402, isLocal: true, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._Py_hashtable_entry_t*)* @hashtable_compare_unicode, variables: !684)
!684 = !{!685, !686}
!685 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !683, file: !1, line: 201, type: !398)
!686 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "entry", arg: 2, scope: !683, file: !1, line: 201, type: !404)
!687 = !DISubprogram(name: "hashtable_hash_traceback", scope: !1, file: !1, line: 234, type: !396, isLocal: true, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8*)* @hashtable_hash_traceback, variables: !688)
!688 = !{!689, !690}
!689 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !687, file: !1, line: 234, type: !398)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "traceback", scope: !687, file: !1, line: 236, type: !691)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64, align: 64)
!692 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!693 = !DISubprogram(name: "hashtable_compare_traceback", scope: !1, file: !1, line: 241, type: !694, isLocal: true, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.traceback_t*, %struct._Py_hashtable_entry_t*)* @hashtable_compare_traceback, variables: !696)
!694 = !DISubroutineType(types: !695)
!695 = !{!8, !691, !404}
!696 = !{!697, !698, !699, !700, !703, !704}
!697 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "traceback1", arg: 1, scope: !693, file: !1, line: 241, type: !691)
!698 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "he", arg: 2, scope: !693, file: !1, line: 242, type: !404)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "traceback2", scope: !693, file: !1, line: 244, type: !691)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frame1", scope: !693, file: !1, line: 245, type: !701)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64, align: 64)
!702 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frame2", scope: !693, file: !1, line: 245, type: !701)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !693, file: !1, line: 246, type: !8)
!705 = !DISubprogram(name: "traceback_hash", scope: !1, file: !1, line: 337, type: !706, isLocal: true, isDefinition: true, scopeLine: 338, flags: DIFlagPrototyped, isOptimized: true, variables: !708)
!706 = !DISubroutineType(types: !707)
!707 = !{!369, !364}
!708 = !{!709, !710, !711, !712, !713, !714}
!709 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "traceback", arg: 1, scope: !705, file: !1, line: 337, type: !364)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !705, file: !1, line: 340, type: !369)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !705, file: !1, line: 340, type: !369)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !705, file: !1, line: 341, type: !8)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mult", scope: !705, file: !1, line: 342, type: !369)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frame", scope: !705, file: !1, line: 343, type: !626)
!715 = !DISubprogram(name: "parse_sys_xoptions", scope: !1, file: !1, line: 1336, type: !165, isLocal: true, isDefinition: true, scopeLine: 1337, flags: DIFlagPrototyped, isOptimized: true, variables: !716)
!716 = !{!717, !718, !719, !720}
!717 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 1, scope: !715, file: !1, line: 1336, type: !27)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "valuelong", scope: !715, file: !1, line: 1338, type: !27)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nframe", scope: !715, file: !1, line: 1339, type: !39)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !721, file: !1, line: 1353, type: !27)
!721 = distinct !DILexicalBlock(scope: !715, file: !1, line: 1353, column: 5)
!722 = !DISubprogram(name: "tracemalloc_start", scope: !1, file: !1, line: 832, type: !723, isLocal: true, isDefinition: true, scopeLine: 833, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @tracemalloc_start, variables: !725)
!723 = !DISubroutineType(types: !724)
!724 = !{!8, !8}
!725 = !{!726, !727, !728}
!726 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "max_nframe", arg: 1, scope: !722, file: !1, line: 832, type: !8)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alloc", scope: !722, file: !1, line: 834, type: !418)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !722, file: !1, line: 835, type: !115)
!729 = !DISubprogram(name: "raw_malloc", scope: !1, file: !1, line: 222, type: !554, isLocal: true, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: true, variables: !730)
!730 = !{!731}
!731 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !729, file: !1, line: 222, type: !115)
!732 = !DISubprogram(name: "tracemalloc_raw_malloc", scope: !1, file: !1, line: 617, type: !424, isLocal: true, isDefinition: true, scopeLine: 618, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i64)* @tracemalloc_raw_malloc, variables: !733)
!733 = !{!734, !735, !736, !738, !739}
!734 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !732, file: !1, line: 617, type: !26)
!735 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !732, file: !1, line: 617, type: !115)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gil_state", scope: !732, file: !1, line: 620, type: !737)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGILState_STATE", file: !21, line: 191, baseType: !20)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !732, file: !1, line: 622, type: !26)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alloc", scope: !740, file: !1, line: 625, type: !417)
!740 = distinct !DILexicalBlock(scope: !741, file: !1, line: 624, column: 26)
!741 = distinct !DILexicalBlock(scope: !732, file: !1, line: 624, column: 9)
!742 = !DISubprogram(name: "get_reentrant", scope: !1, file: !1, line: 155, type: !460, isLocal: true, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: true, variables: !743)
!743 = !{!744}
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !742, file: !1, line: 157, type: !26)
!745 = !DISubprogram(name: "tracemalloc_malloc", scope: !1, file: !1, line: 479, type: !424, isLocal: true, isDefinition: true, scopeLine: 480, flags: DIFlagPrototyped, isOptimized: true, variables: !746)
!746 = !{!747, !748, !749, !750}
!747 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !745, file: !1, line: 479, type: !26)
!748 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !745, file: !1, line: 479, type: !115)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alloc", scope: !745, file: !1, line: 481, type: !417)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !745, file: !1, line: 482, type: !26)
!751 = !DISubprogram(name: "tracemalloc_add_trace", scope: !1, file: !1, line: 439, type: !752, isLocal: true, isDefinition: true, scopeLine: 440, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i64)* @tracemalloc_add_trace, variables: !754)
!752 = !DISubroutineType(types: !753)
!753 = !{!8, !26, !115}
!754 = !{!755, !756, !757, !758, !759}
!755 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !751, file: !1, line: 439, type: !26)
!756 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !751, file: !1, line: 439, type: !115)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "traceback", scope: !751, file: !1, line: 441, type: !364)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "trace", scope: !751, file: !1, line: 442, type: !379)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !751, file: !1, line: 443, type: !8)
!760 = !DISubprogram(name: "traceback_new", scope: !1, file: !1, line: 389, type: !761, isLocal: true, isDefinition: true, scopeLine: 390, flags: DIFlagPrototyped, isOptimized: true, variables: !763)
!761 = !DISubroutineType(types: !762)
!762 = !{!364}
!763 = !{!764, !765, !766, !769}
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "traceback", scope: !760, file: !1, line: 391, type: !364)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !760, file: !1, line: 392, type: !496)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "copy", scope: !767, file: !1, line: 412, type: !364)
!767 = distinct !DILexicalBlock(scope: !768, file: !1, line: 411, column: 10)
!768 = distinct !DILexicalBlock(scope: !760, file: !1, line: 408, column: 9)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "traceback_size", scope: !767, file: !1, line: 413, type: !115)
!770 = !DISubprogram(name: "traceback_get_frames", scope: !1, file: !1, line: 361, type: !771, isLocal: true, isDefinition: true, scopeLine: 362, flags: DIFlagPrototyped, isOptimized: true, variables: !773)
!771 = !DISubroutineType(types: !772)
!772 = !{null, !364}
!773 = !{!774, !775, !888}
!774 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "traceback", arg: 1, scope: !770, file: !1, line: 361, type: !364)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !770, file: !1, line: 363, type: !776)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64, align: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !21, line: 139, baseType: !778)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !21, line: 69, size: 1536, align: 64, elements: !779)
!779 = !{!780, !782, !783, !803, !861, !862, !863, !864, !865, !866, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !778, file: !21, line: 72, baseType: !781, size: 64, align: 64)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64, align: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !778, file: !21, line: 73, baseType: !781, size: 64, align: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !778, file: !21, line: 74, baseType: !784, size: 64, align: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64, align: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !21, line: 44, baseType: !786)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !21, line: 19, size: 832, align: 64, elements: !787)
!787 = !{!788, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !786, file: !21, line: 21, baseType: !789, size: 64, align: 64)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64, align: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !786, file: !21, line: 22, baseType: !781, size: 64, align: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !786, file: !21, line: 24, baseType: !27, size: 64, align: 64, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !786, file: !21, line: 25, baseType: !27, size: 64, align: 64, offset: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !786, file: !21, line: 26, baseType: !27, size: 64, align: 64, offset: 256)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !786, file: !21, line: 27, baseType: !27, size: 64, align: 64, offset: 320)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !786, file: !21, line: 28, baseType: !27, size: 64, align: 64, offset: 384)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !786, file: !21, line: 30, baseType: !27, size: 64, align: 64, offset: 448)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !786, file: !21, line: 31, baseType: !27, size: 64, align: 64, offset: 512)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !786, file: !21, line: 32, baseType: !27, size: 64, align: 64, offset: 576)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !786, file: !21, line: 33, baseType: !8, size: 32, align: 32, offset: 640)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !786, file: !21, line: 34, baseType: !8, size: 32, align: 32, offset: 672)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !786, file: !21, line: 37, baseType: !8, size: 32, align: 32, offset: 704)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !786, file: !21, line: 43, baseType: !27, size: 64, align: 64, offset: 768)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !778, file: !21, line: 76, baseType: !804, size: 64, align: 64, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64, align: 64)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !806, line: 17, size: 3072, align: 64, elements: !807)
!806 = !DIFile(filename: "Include/frameobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!807 = !{!808, !809, !810, !837, !838, !839, !840, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !860}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !805, file: !806, line: 18, baseType: !45, size: 192, align: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "f_back", scope: !805, file: !806, line: 19, baseType: !804, size: 64, align: 64, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "f_code", scope: !805, file: !806, line: 20, baseType: !811, size: 64, align: 64, offset: 256)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64, align: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !813, line: 33, baseType: !814)
!813 = !DIFile(filename: "Include/code.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!814 = !DICompositeType(tag: DW_TAG_structure_type, file: !813, line: 11, size: 1152, align: 64, elements: !815)
!815 = !{!816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !831, !832, !833, !834, !835, !836}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !814, file: !813, line: 12, baseType: !28, size: 128, align: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !814, file: !813, line: 13, baseType: !8, size: 32, align: 32, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !814, file: !813, line: 14, baseType: !8, size: 32, align: 32, offset: 160)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !814, file: !813, line: 15, baseType: !8, size: 32, align: 32, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !814, file: !813, line: 16, baseType: !8, size: 32, align: 32, offset: 224)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !814, file: !813, line: 17, baseType: !8, size: 32, align: 32, offset: 256)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "co_code", scope: !814, file: !813, line: 18, baseType: !27, size: 64, align: 64, offset: 320)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !814, file: !813, line: 19, baseType: !27, size: 64, align: 64, offset: 384)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !814, file: !813, line: 20, baseType: !27, size: 64, align: 64, offset: 448)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "co_varnames", scope: !814, file: !813, line: 21, baseType: !27, size: 64, align: 64, offset: 512)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "co_freevars", scope: !814, file: !813, line: 22, baseType: !27, size: 64, align: 64, offset: 576)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "co_cellvars", scope: !814, file: !813, line: 23, baseType: !27, size: 64, align: 64, offset: 640)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "co_cell2arg", scope: !814, file: !813, line: 25, baseType: !829, size: 64, align: 64, offset: 704)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64, align: 64)
!830 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !814, file: !813, line: 26, baseType: !27, size: 64, align: 64, offset: 768)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !814, file: !813, line: 27, baseType: !27, size: 64, align: 64, offset: 832)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !814, file: !813, line: 28, baseType: !8, size: 32, align: 32, offset: 896)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "co_lnotab", scope: !814, file: !813, line: 29, baseType: !27, size: 64, align: 64, offset: 960)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "co_zombieframe", scope: !814, file: !813, line: 31, baseType: !26, size: 64, align: 64, offset: 1024)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !814, file: !813, line: 32, baseType: !27, size: 64, align: 64, offset: 1088)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "f_builtins", scope: !805, file: !806, line: 21, baseType: !27, size: 64, align: 64, offset: 320)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "f_globals", scope: !805, file: !806, line: 22, baseType: !27, size: 64, align: 64, offset: 384)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "f_locals", scope: !805, file: !806, line: 23, baseType: !27, size: 64, align: 64, offset: 448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "f_valuestack", scope: !805, file: !806, line: 24, baseType: !841, size: 64, align: 64, offset: 512)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "f_stacktop", scope: !805, file: !806, line: 28, baseType: !841, size: 64, align: 64, offset: 576)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "f_trace", scope: !805, file: !806, line: 29, baseType: !27, size: 64, align: 64, offset: 640)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_type", scope: !805, file: !806, line: 38, baseType: !27, size: 64, align: 64, offset: 704)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_value", scope: !805, file: !806, line: 38, baseType: !27, size: 64, align: 64, offset: 768)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_traceback", scope: !805, file: !806, line: 38, baseType: !27, size: 64, align: 64, offset: 832)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "f_gen", scope: !805, file: !806, line: 40, baseType: !27, size: 64, align: 64, offset: 896)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "f_lasti", scope: !805, file: !806, line: 42, baseType: !8, size: 32, align: 32, offset: 960)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "f_lineno", scope: !805, file: !806, line: 48, baseType: !8, size: 32, align: 32, offset: 992)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "f_iblock", scope: !805, file: !806, line: 49, baseType: !8, size: 32, align: 32, offset: 1024)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "f_executing", scope: !805, file: !806, line: 50, baseType: !53, size: 8, align: 8, offset: 1056)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "f_blockstack", scope: !805, file: !806, line: 51, baseType: !853, size: 1920, align: 32, offset: 1088)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !854, size: 1920, align: 32, elements: !121)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTryBlock", file: !806, line: 15, baseType: !855)
!855 = !DICompositeType(tag: DW_TAG_structure_type, file: !806, line: 11, size: 96, align: 32, elements: !856)
!856 = !{!857, !858, !859}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "b_type", scope: !855, file: !806, line: 12, baseType: !8, size: 32, align: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "b_handler", scope: !855, file: !806, line: 13, baseType: !8, size: 32, align: 32, offset: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "b_level", scope: !855, file: !806, line: 14, baseType: !8, size: 32, align: 32, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "f_localsplus", scope: !805, file: !806, line: 52, baseType: !391, size: 64, align: 64, offset: 3008)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !778, file: !21, line: 77, baseType: !8, size: 32, align: 32, offset: 256)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !778, file: !21, line: 78, baseType: !53, size: 8, align: 8, offset: 288)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !778, file: !21, line: 80, baseType: !53, size: 8, align: 8, offset: 296)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !778, file: !21, line: 85, baseType: !8, size: 32, align: 32, offset: 320)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !778, file: !21, line: 86, baseType: !8, size: 32, align: 32, offset: 352)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !778, file: !21, line: 88, baseType: !867, size: 64, align: 64, offset: 384)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !21, line: 54, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64, align: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!8, !27, !804, !8, !27}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !778, file: !21, line: 89, baseType: !867, size: 64, align: 64, offset: 448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !778, file: !21, line: 90, baseType: !27, size: 64, align: 64, offset: 512)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !778, file: !21, line: 91, baseType: !27, size: 64, align: 64, offset: 576)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !778, file: !21, line: 93, baseType: !27, size: 64, align: 64, offset: 640)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !778, file: !21, line: 94, baseType: !27, size: 64, align: 64, offset: 704)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !778, file: !21, line: 95, baseType: !27, size: 64, align: 64, offset: 768)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !778, file: !21, line: 97, baseType: !27, size: 64, align: 64, offset: 832)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !778, file: !21, line: 98, baseType: !27, size: 64, align: 64, offset: 896)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !778, file: !21, line: 99, baseType: !27, size: 64, align: 64, offset: 960)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !778, file: !21, line: 101, baseType: !27, size: 64, align: 64, offset: 1024)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !778, file: !21, line: 103, baseType: !8, size: 32, align: 32, offset: 1088)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !778, file: !21, line: 105, baseType: !27, size: 64, align: 64, offset: 1152)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !778, file: !21, line: 106, baseType: !39, size: 64, align: 64, offset: 1216)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !778, file: !21, line: 108, baseType: !8, size: 32, align: 32, offset: 1280)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !778, file: !21, line: 109, baseType: !27, size: 64, align: 64, offset: 1344)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !778, file: !21, line: 134, baseType: !351, size: 64, align: 64, offset: 1408)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !778, file: !21, line: 135, baseType: !26, size: 64, align: 64, offset: 1472)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pyframe", scope: !770, file: !1, line: 364, type: !889)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64, align: 64)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFrameObject", file: !806, line: 53, baseType: !805)
!891 = !DISubprogram(name: "tracemalloc_get_frame", scope: !1, file: !1, line: 267, type: !892, isLocal: true, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true, variables: !894)
!892 = !DISubroutineType(types: !893)
!893 = !{null, !889, !626}
!894 = !{!895, !896, !897, !898, !899, !900}
!895 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pyframe", arg: 1, scope: !891, file: !1, line: 267, type: !889)
!896 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frame", arg: 2, scope: !891, file: !1, line: 267, type: !626)
!897 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !891, file: !1, line: 269, type: !811)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filename", scope: !891, file: !1, line: 270, type: !27)
!899 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !891, file: !1, line: 271, type: !496)
!900 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !901, file: !1, line: 324, type: !27)
!901 = distinct !DILexicalBlock(scope: !902, file: !1, line: 324, column: 13)
!902 = distinct !DILexicalBlock(scope: !903, file: !1, line: 323, column: 78)
!903 = distinct !DILexicalBlock(scope: !904, file: !1, line: 323, column: 13)
!904 = distinct !DILexicalBlock(scope: !905, file: !1, line: 319, column: 10)
!905 = distinct !DILexicalBlock(scope: !891, file: !1, line: 316, column: 9)
!906 = !DISubprogram(name: "tracemalloc_raw_realloc", scope: !1, file: !1, line: 647, type: !428, isLocal: true, isDefinition: true, scopeLine: 648, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i8*, i64)* @tracemalloc_raw_realloc, variables: !907)
!907 = !{!908, !909, !910, !911, !912, !913}
!908 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !906, file: !1, line: 647, type: !26)
