; ModuleID = '_warnings.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !542, globals: !1059)
!1 = !DIFile(filename: "Python/_warnings.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3, !11}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !4, line: 23, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!7 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!8 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!9 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!10 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !12, line: 451, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!15 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!16 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!17 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!18 = !{!19, !20, !358, !472, !490, !498, !515, !516, !518, !520, !413, !522, !523, !531, !109, !538, !540, !44}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !22, line: 109, baseType: !23)
!22 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !22, line: 105, size: 128, align: 64, elements: !24)
!24 = !{!25, !33}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !23, file: !22, line: 107, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !27, line: 177, baseType: !28)
!27 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !29, line: 102, baseType: !30)
!29 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !31, line: 181, baseType: !32)
!31 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!32 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !23, file: !22, line: 108, baseType: !34, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !22, line: 334, size: 3200, align: 64, elements: !36)
!36 = !{!37, !43, !47, !48, !49, !54, !117, !122, !127, !128, !133, !185, !216, !228, !234, !235, !236, !238, !240, !271, !272, !273, !282, !283, !288, !289, !291, !293, !303, !306, !324, !325, !326, !328, !330, !331, !333, !338, !343, !348, !349, !350, !351, !352, !353, !354, !355, !357}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !35, file: !22, line: 335, baseType: !38, size: 192, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !22, line: 114, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 111, size: 192, align: 64, elements: !40)
!40 = !{!41, !42}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !39, file: !22, line: 112, baseType: !21, size: 128, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !39, file: !22, line: 113, baseType: !26, size: 64, align: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !35, file: !22, line: 336, baseType: !44, size: 64, align: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !35, file: !22, line: 337, baseType: !26, size: 64, align: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !35, file: !22, line: 337, baseType: !26, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !35, file: !22, line: 341, baseType: !50, size: 64, align: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !22, line: 308, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !20}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !35, file: !22, line: 342, baseType: !55, size: 64, align: 64, offset: 448)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !22, line: 314, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !20, !60, !59}
!59 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !29, line: 48, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !63, line: 246, size: 1728, align: 64, elements: !64)
!63 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!64 = !{!65, !66, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !86, !87, !88, !89, !91, !93, !95, !99, !102, !104, !105, !106, !107, !108, !112, !113}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !62, file: !63, line: 247, baseType: !59, size: 32, align: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !62, file: !63, line: 252, baseType: !67, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !62, file: !63, line: 253, baseType: !67, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !62, file: !63, line: 254, baseType: !67, size: 64, align: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !62, file: !63, line: 255, baseType: !67, size: 64, align: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !62, file: !63, line: 256, baseType: !67, size: 64, align: 64, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !62, file: !63, line: 257, baseType: !67, size: 64, align: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !62, file: !63, line: 258, baseType: !67, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !62, file: !63, line: 259, baseType: !67, size: 64, align: 64, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !62, file: !63, line: 261, baseType: !67, size: 64, align: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !62, file: !63, line: 262, baseType: !67, size: 64, align: 64, offset: 640)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !62, file: !63, line: 263, baseType: !67, size: 64, align: 64, offset: 704)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !62, file: !63, line: 265, baseType: !79, size: 64, align: 64, offset: 768)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !63, line: 161, size: 192, align: 64, elements: !81)
!81 = !{!82, !83, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !80, file: !63, line: 162, baseType: !79, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !80, file: !63, line: 163, baseType: !84, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !80, file: !63, line: 167, baseType: !59, size: 32, align: 32, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !62, file: !63, line: 267, baseType: !84, size: 64, align: 64, offset: 832)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !62, file: !63, line: 269, baseType: !59, size: 32, align: 32, offset: 896)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !62, file: !63, line: 273, baseType: !59, size: 32, align: 32, offset: 928)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !62, file: !63, line: 275, baseType: !90, size: 64, align: 64, offset: 960)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !31, line: 140, baseType: !32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !62, file: !63, line: 279, baseType: !92, size: 16, align: 16, offset: 1024)
!92 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !62, file: !63, line: 280, baseType: !94, size: 8, align: 8, offset: 1040)
!94 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !62, file: !63, line: 281, baseType: !96, size: 8, align: 8, offset: 1048)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 8, align: 8, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 1)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !62, file: !63, line: 285, baseType: !100, size: 64, align: 64, offset: 1088)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !63, line: 155, baseType: null)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !62, file: !63, line: 294, baseType: !103, size: 64, align: 64, offset: 1152)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !31, line: 141, baseType: !32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !62, file: !63, line: 303, baseType: !19, size: 64, align: 64, offset: 1216)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !62, file: !63, line: 304, baseType: !19, size: 64, align: 64, offset: 1280)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !62, file: !63, line: 305, baseType: !19, size: 64, align: 64, offset: 1344)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !62, file: !63, line: 306, baseType: !19, size: 64, align: 64, offset: 1408)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !62, file: !63, line: 307, baseType: !109, size: 64, align: 64, offset: 1472)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !110, line: 62, baseType: !111)
!110 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!111 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !62, file: !63, line: 309, baseType: !59, size: 32, align: 32, offset: 1536)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !62, file: !63, line: 311, baseType: !114, size: 160, align: 8, offset: 1568)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 160, align: 8, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 20)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !35, file: !22, line: 343, baseType: !118, size: 64, align: 64, offset: 512)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !22, line: 316, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!20, !20, !67}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !35, file: !22, line: 344, baseType: !123, size: 64, align: 64, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !22, line: 318, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!59, !20, !67, !20}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !35, file: !22, line: 345, baseType: !19, size: 64, align: 64, offset: 640)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !35, file: !22, line: 346, baseType: !129, size: 64, align: 64, offset: 704)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !22, line: 320, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!20, !20}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !35, file: !22, line: 350, baseType: !134, size: 64, align: 64, offset: 768)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !22, line: 278, baseType: !136)
!136 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 236, size: 2176, align: 64, elements: !137)
!137 = !{!138, !143, !144, !145, !146, !147, !152, !154, !155, !156, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !136, file: !22, line: 241, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !22, line: 166, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!20, !20, !20}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !136, file: !22, line: 242, baseType: !139, size: 64, align: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !136, file: !22, line: 243, baseType: !139, size: 64, align: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !136, file: !22, line: 244, baseType: !139, size: 64, align: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !136, file: !22, line: 245, baseType: !139, size: 64, align: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !136, file: !22, line: 246, baseType: !148, size: 64, align: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !22, line: 167, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!20, !20, !20, !20}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !136, file: !22, line: 247, baseType: !153, size: 64, align: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !22, line: 165, baseType: !130)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !136, file: !22, line: 248, baseType: !153, size: 64, align: 64, offset: 448)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !136, file: !22, line: 249, baseType: !153, size: 64, align: 64, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !136, file: !22, line: 250, baseType: !157, size: 64, align: 64, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !22, line: 168, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!59, !20}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !136, file: !22, line: 251, baseType: !153, size: 64, align: 64, offset: 640)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !136, file: !22, line: 252, baseType: !139, size: 64, align: 64, offset: 704)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !136, file: !22, line: 253, baseType: !139, size: 64, align: 64, offset: 768)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !136, file: !22, line: 254, baseType: !139, size: 64, align: 64, offset: 832)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !136, file: !22, line: 255, baseType: !139, size: 64, align: 64, offset: 896)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !136, file: !22, line: 256, baseType: !139, size: 64, align: 64, offset: 960)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !136, file: !22, line: 257, baseType: !153, size: 64, align: 64, offset: 1024)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !136, file: !22, line: 258, baseType: !19, size: 64, align: 64, offset: 1088)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !136, file: !22, line: 259, baseType: !153, size: 64, align: 64, offset: 1152)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !136, file: !22, line: 261, baseType: !139, size: 64, align: 64, offset: 1216)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !136, file: !22, line: 262, baseType: !139, size: 64, align: 64, offset: 1280)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !136, file: !22, line: 263, baseType: !139, size: 64, align: 64, offset: 1344)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !136, file: !22, line: 264, baseType: !139, size: 64, align: 64, offset: 1408)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !136, file: !22, line: 265, baseType: !148, size: 64, align: 64, offset: 1472)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !136, file: !22, line: 266, baseType: !139, size: 64, align: 64, offset: 1536)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !136, file: !22, line: 267, baseType: !139, size: 64, align: 64, offset: 1600)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !136, file: !22, line: 268, baseType: !139, size: 64, align: 64, offset: 1664)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !136, file: !22, line: 269, baseType: !139, size: 64, align: 64, offset: 1728)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !136, file: !22, line: 270, baseType: !139, size: 64, align: 64, offset: 1792)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !136, file: !22, line: 272, baseType: !139, size: 64, align: 64, offset: 1856)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !136, file: !22, line: 273, baseType: !139, size: 64, align: 64, offset: 1920)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !136, file: !22, line: 274, baseType: !139, size: 64, align: 64, offset: 1984)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !136, file: !22, line: 275, baseType: !139, size: 64, align: 64, offset: 2048)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !136, file: !22, line: 277, baseType: !153, size: 64, align: 64, offset: 2112)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !35, file: !22, line: 351, baseType: !186, size: 64, align: 64, offset: 832)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !22, line: 292, baseType: !188)
!188 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 280, size: 640, align: 64, elements: !189)
!189 = !{!190, !195, !196, !201, !202, !203, !208, !209, !214, !215}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !188, file: !22, line: 281, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !22, line: 169, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!26, !20}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !188, file: !22, line: 282, baseType: !139, size: 64, align: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !188, file: !22, line: 283, baseType: !197, size: 64, align: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !22, line: 170, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!20, !20, !26}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !188, file: !22, line: 284, baseType: !197, size: 64, align: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !188, file: !22, line: 285, baseType: !19, size: 64, align: 64, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !188, file: !22, line: 286, baseType: !204, size: 64, align: 64, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !22, line: 172, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!59, !20, !26, !20}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !188, file: !22, line: 287, baseType: !19, size: 64, align: 64, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !188, file: !22, line: 288, baseType: !210, size: 64, align: 64, offset: 448)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !22, line: 231, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!59, !20, !20}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !188, file: !22, line: 290, baseType: !139, size: 64, align: 64, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !188, file: !22, line: 291, baseType: !197, size: 64, align: 64, offset: 576)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !35, file: !22, line: 352, baseType: !217, size: 64, align: 64, offset: 896)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !22, line: 298, baseType: !219)
!219 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 294, size: 192, align: 64, elements: !220)
!220 = !{!221, !222, !223}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !219, file: !22, line: 295, baseType: !191, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !219, file: !22, line: 296, baseType: !139, size: 64, align: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !219, file: !22, line: 297, baseType: !224, size: 64, align: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !22, line: 174, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!59, !20, !20, !20}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !35, file: !22, line: 356, baseType: !229, size: 64, align: 64, offset: 960)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !22, line: 321, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!233, !20}
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !27, line: 186, baseType: !26)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !35, file: !22, line: 357, baseType: !148, size: 64, align: 64, offset: 1024)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !35, file: !22, line: 358, baseType: !129, size: 64, align: 64, offset: 1088)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !35, file: !22, line: 359, baseType: !237, size: 64, align: 64, offset: 1152)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !22, line: 317, baseType: !140)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !35, file: !22, line: 360, baseType: !239, size: 64, align: 64, offset: 1216)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !22, line: 319, baseType: !225)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !35, file: !22, line: 363, baseType: !241, size: 64, align: 64, offset: 1280)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !22, line: 304, baseType: !243)
!243 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 301, size: 128, align: 64, elements: !244)
!244 = !{!245, !266}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !243, file: !22, line: 302, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !22, line: 193, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!59, !20, !250, !59}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !22, line: 191, baseType: !252)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !22, line: 178, size: 640, align: 64, elements: !253)
!253 = !{!254, !255, !256, !257, !258, !259, !260, !261, !263, !264, !265}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !252, file: !22, line: 179, baseType: !19, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !252, file: !22, line: 180, baseType: !20, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !252, file: !22, line: 181, baseType: !26, size: 64, align: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !252, file: !22, line: 182, baseType: !26, size: 64, align: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !252, file: !22, line: 184, baseType: !59, size: 32, align: 32, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !252, file: !22, line: 185, baseType: !59, size: 32, align: 32, offset: 288)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !252, file: !22, line: 186, baseType: !67, size: 64, align: 64, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !252, file: !22, line: 187, baseType: !262, size: 64, align: 64, offset: 384)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !252, file: !22, line: 188, baseType: !262, size: 64, align: 64, offset: 448)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !252, file: !22, line: 189, baseType: !262, size: 64, align: 64, offset: 512)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !252, file: !22, line: 190, baseType: !19, size: 64, align: 64, offset: 576)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !243, file: !22, line: 303, baseType: !267, size: 64, align: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !22, line: 194, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !20, !250}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !35, file: !22, line: 366, baseType: !111, size: 64, align: 64, offset: 1344)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !35, file: !22, line: 368, baseType: !44, size: 64, align: 64, offset: 1408)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !35, file: !22, line: 372, baseType: !274, size: 64, align: 64, offset: 1472)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !22, line: 233, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!59, !20, !278, !19}
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !22, line: 232, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!59, !20, !19}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !35, file: !22, line: 375, baseType: !157, size: 64, align: 64, offset: 1536)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !35, file: !22, line: 379, baseType: !284, size: 64, align: 64, offset: 1600)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !22, line: 322, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!20, !20, !20, !59}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !35, file: !22, line: 382, baseType: !26, size: 64, align: 64, offset: 1664)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !35, file: !22, line: 385, baseType: !290, size: 64, align: 64, offset: 1728)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !22, line: 323, baseType: !130)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !35, file: !22, line: 386, baseType: !292, size: 64, align: 64, offset: 1792)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !22, line: 324, baseType: !130)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !35, file: !22, line: 389, baseType: !294, size: 64, align: 64, offset: 1856)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !296, line: 40, size: 256, align: 64, elements: !297)
!296 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!297 = !{!298, !299, !301, !302}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !295, file: !296, line: 41, baseType: !44, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !295, file: !296, line: 42, baseType: !300, size: 64, align: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !296, line: 18, baseType: !140)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !295, file: !296, line: 43, baseType: !59, size: 32, align: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !295, file: !296, line: 45, baseType: !44, size: 64, align: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !35, file: !22, line: 390, baseType: !304, size: 64, align: 64, offset: 1920)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !22, line: 390, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !35, file: !22, line: 391, baseType: !307, size: 64, align: 64, offset: 1984)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !309, line: 11, size: 320, align: 64, elements: !310)
!309 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!310 = !{!311, !312, !317, !322, !323}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !308, file: !309, line: 12, baseType: !67, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !308, file: !309, line: 13, baseType: !313, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !309, line: 8, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!20, !20, !19}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !308, file: !309, line: 14, baseType: !318, size: 64, align: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !309, line: 9, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!59, !20, !20, !19}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !308, file: !309, line: 15, baseType: !67, size: 64, align: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !308, file: !309, line: 16, baseType: !19, size: 64, align: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !35, file: !22, line: 392, baseType: !34, size: 64, align: 64, offset: 2048)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !35, file: !22, line: 393, baseType: !20, size: 64, align: 64, offset: 2112)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !35, file: !22, line: 394, baseType: !327, size: 64, align: 64, offset: 2176)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !22, line: 325, baseType: !149)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !35, file: !22, line: 395, baseType: !329, size: 64, align: 64, offset: 2240)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !22, line: 326, baseType: !225)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !35, file: !22, line: 396, baseType: !26, size: 64, align: 64, offset: 2304)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !35, file: !22, line: 397, baseType: !332, size: 64, align: 64, offset: 2368)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !22, line: 327, baseType: !225)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !35, file: !22, line: 398, baseType: !334, size: 64, align: 64, offset: 2432)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !22, line: 329, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!20, !34, !26}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !35, file: !22, line: 399, baseType: !339, size: 64, align: 64, offset: 2496)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !22, line: 328, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!20, !34, !20, !20}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !35, file: !22, line: 400, baseType: !344, size: 64, align: 64, offset: 2560)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !22, line: 307, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !19}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !35, file: !22, line: 401, baseType: !157, size: 64, align: 64, offset: 2624)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !35, file: !22, line: 402, baseType: !20, size: 64, align: 64, offset: 2688)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !35, file: !22, line: 403, baseType: !20, size: 64, align: 64, offset: 2752)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !35, file: !22, line: 404, baseType: !20, size: 64, align: 64, offset: 2816)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !35, file: !22, line: 405, baseType: !20, size: 64, align: 64, offset: 2880)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !35, file: !22, line: 406, baseType: !20, size: 64, align: 64, offset: 2944)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !35, file: !22, line: 407, baseType: !50, size: 64, align: 64, offset: 3008)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !35, file: !22, line: 410, baseType: !356, size: 32, align: 32, offset: 3072)
!356 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !35, file: !22, line: 412, baseType: !50, size: 64, align: 64, offset: 3136)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !360, line: 139, baseType: !361)
!360 = !DIFile(filename: "Include/pystate.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !360, line: 69, size: 1536, align: 64, elements: !362)
!362 = !{!363, !365, !366, !386, !445, !446, !447, !448, !449, !450, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !361, file: !360, line: 72, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !361, file: !360, line: 73, baseType: !364, size: 64, align: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !361, file: !360, line: 74, baseType: !367, size: 64, align: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !360, line: 44, baseType: !369)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !360, line: 19, size: 832, align: 64, elements: !370)
!370 = !{!371, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !369, file: !360, line: 21, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !369, file: !360, line: 22, baseType: !364, size: 64, align: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !369, file: !360, line: 24, baseType: !20, size: 64, align: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !369, file: !360, line: 25, baseType: !20, size: 64, align: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !369, file: !360, line: 26, baseType: !20, size: 64, align: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !369, file: !360, line: 27, baseType: !20, size: 64, align: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !369, file: !360, line: 28, baseType: !20, size: 64, align: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !369, file: !360, line: 30, baseType: !20, size: 64, align: 64, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !369, file: !360, line: 31, baseType: !20, size: 64, align: 64, offset: 512)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !369, file: !360, line: 32, baseType: !20, size: 64, align: 64, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !369, file: !360, line: 33, baseType: !59, size: 32, align: 32, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !369, file: !360, line: 34, baseType: !59, size: 32, align: 32, offset: 672)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !369, file: !360, line: 37, baseType: !59, size: 32, align: 32, offset: 704)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !369, file: !360, line: 43, baseType: !20, size: 64, align: 64, offset: 768)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !361, file: !360, line: 76, baseType: !387, size: 64, align: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !389, line: 17, size: 3072, align: 64, elements: !390)
!389 = !DIFile(filename: "Include/frameobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!390 = !{!391, !392, !393, !420, !421, !422, !423, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !443}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !388, file: !389, line: 18, baseType: !38, size: 192, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "f_back", scope: !388, file: !389, line: 19, baseType: !387, size: 64, align: 64, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "f_code", scope: !388, file: !389, line: 20, baseType: !394, size: 64, align: 64, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !396, line: 33, baseType: !397)
!396 = !DIFile(filename: "Include/code.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!397 = !DICompositeType(tag: DW_TAG_structure_type, file: !396, line: 11, size: 1152, align: 64, elements: !398)
!398 = !{!399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !414, !415, !416, !417, !418, !419}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !397, file: !396, line: 12, baseType: !21, size: 128, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !397, file: !396, line: 13, baseType: !59, size: 32, align: 32, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !397, file: !396, line: 14, baseType: !59, size: 32, align: 32, offset: 160)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !397, file: !396, line: 15, baseType: !59, size: 32, align: 32, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !397, file: !396, line: 16, baseType: !59, size: 32, align: 32, offset: 224)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !397, file: !396, line: 17, baseType: !59, size: 32, align: 32, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "co_code", scope: !397, file: !396, line: 18, baseType: !20, size: 64, align: 64, offset: 320)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !397, file: !396, line: 19, baseType: !20, size: 64, align: 64, offset: 384)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !397, file: !396, line: 20, baseType: !20, size: 64, align: 64, offset: 448)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "co_varnames", scope: !397, file: !396, line: 21, baseType: !20, size: 64, align: 64, offset: 512)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "co_freevars", scope: !397, file: !396, line: 22, baseType: !20, size: 64, align: 64, offset: 576)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "co_cellvars", scope: !397, file: !396, line: 23, baseType: !20, size: 64, align: 64, offset: 640)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "co_cell2arg", scope: !397, file: !396, line: 25, baseType: !412, size: 64, align: 64, offset: 704)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !397, file: !396, line: 26, baseType: !20, size: 64, align: 64, offset: 768)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !397, file: !396, line: 27, baseType: !20, size: 64, align: 64, offset: 832)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !397, file: !396, line: 28, baseType: !59, size: 32, align: 32, offset: 896)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "co_lnotab", scope: !397, file: !396, line: 29, baseType: !20, size: 64, align: 64, offset: 960)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "co_zombieframe", scope: !397, file: !396, line: 31, baseType: !19, size: 64, align: 64, offset: 1024)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !397, file: !396, line: 32, baseType: !20, size: 64, align: 64, offset: 1088)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "f_builtins", scope: !388, file: !389, line: 21, baseType: !20, size: 64, align: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "f_globals", scope: !388, file: !389, line: 22, baseType: !20, size: 64, align: 64, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "f_locals", scope: !388, file: !389, line: 23, baseType: !20, size: 64, align: 64, offset: 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "f_valuestack", scope: !388, file: !389, line: 24, baseType: !424, size: 64, align: 64, offset: 512)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "f_stacktop", scope: !388, file: !389, line: 28, baseType: !424, size: 64, align: 64, offset: 576)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "f_trace", scope: !388, file: !389, line: 29, baseType: !20, size: 64, align: 64, offset: 640)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_type", scope: !388, file: !389, line: 38, baseType: !20, size: 64, align: 64, offset: 704)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_value", scope: !388, file: !389, line: 38, baseType: !20, size: 64, align: 64, offset: 768)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_traceback", scope: !388, file: !389, line: 38, baseType: !20, size: 64, align: 64, offset: 832)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "f_gen", scope: !388, file: !389, line: 40, baseType: !20, size: 64, align: 64, offset: 896)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "f_lasti", scope: !388, file: !389, line: 42, baseType: !59, size: 32, align: 32, offset: 960)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "f_lineno", scope: !388, file: !389, line: 48, baseType: !59, size: 32, align: 32, offset: 992)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "f_iblock", scope: !388, file: !389, line: 49, baseType: !59, size: 32, align: 32, offset: 1024)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "f_executing", scope: !388, file: !389, line: 50, baseType: !46, size: 8, align: 8, offset: 1056)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "f_blockstack", scope: !388, file: !389, line: 51, baseType: !436, size: 1920, align: 32, offset: 1088)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 1920, align: 32, elements: !115)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTryBlock", file: !389, line: 15, baseType: !438)
!438 = !DICompositeType(tag: DW_TAG_structure_type, file: !389, line: 11, size: 96, align: 32, elements: !439)
!439 = !{!440, !441, !442}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "b_type", scope: !438, file: !389, line: 12, baseType: !59, size: 32, align: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "b_handler", scope: !438, file: !389, line: 13, baseType: !59, size: 32, align: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "b_level", scope: !438, file: !389, line: 14, baseType: !59, size: 32, align: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "f_localsplus", scope: !388, file: !389, line: 52, baseType: !444, size: 64, align: 64, offset: 3008)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 64, align: 64, elements: !97)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !361, file: !360, line: 77, baseType: !59, size: 32, align: 32, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !361, file: !360, line: 78, baseType: !46, size: 8, align: 8, offset: 288)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !361, file: !360, line: 80, baseType: !46, size: 8, align: 8, offset: 296)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !361, file: !360, line: 85, baseType: !59, size: 32, align: 32, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !361, file: !360, line: 86, baseType: !59, size: 32, align: 32, offset: 352)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !361, file: !360, line: 88, baseType: !451, size: 64, align: 64, offset: 384)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !360, line: 54, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, align: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!59, !20, !387, !59, !20}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !361, file: !360, line: 89, baseType: !451, size: 64, align: 64, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !361, file: !360, line: 90, baseType: !20, size: 64, align: 64, offset: 512)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !361, file: !360, line: 91, baseType: !20, size: 64, align: 64, offset: 576)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !361, file: !360, line: 93, baseType: !20, size: 64, align: 64, offset: 640)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !361, file: !360, line: 94, baseType: !20, size: 64, align: 64, offset: 704)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !361, file: !360, line: 95, baseType: !20, size: 64, align: 64, offset: 768)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !361, file: !360, line: 97, baseType: !20, size: 64, align: 64, offset: 832)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !361, file: !360, line: 98, baseType: !20, size: 64, align: 64, offset: 896)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !361, file: !360, line: 99, baseType: !20, size: 64, align: 64, offset: 960)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !361, file: !360, line: 101, baseType: !20, size: 64, align: 64, offset: 1024)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !361, file: !360, line: 103, baseType: !59, size: 32, align: 32, offset: 1088)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !361, file: !360, line: 105, baseType: !20, size: 64, align: 64, offset: 1152)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !361, file: !360, line: 106, baseType: !32, size: 64, align: 64, offset: 1216)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !361, file: !360, line: 108, baseType: !59, size: 32, align: 32, offset: 1280)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !361, file: !360, line: 109, baseType: !20, size: 64, align: 64, offset: 1344)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !361, file: !360, line: 134, baseType: !345, size: 64, align: 64, offset: 1408)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !361, file: !360, line: 135, baseType: !19, size: 64, align: 64, offset: 1472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !12, line: 351, baseType: !474)
!474 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 217, size: 384, align: 64, elements: !475)
!475 = !{!476, !477, !478, !479, !487}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !474, file: !12, line: 291, baseType: !21, size: 128, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !474, file: !12, line: 292, baseType: !26, size: 64, align: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !474, file: !12, line: 293, baseType: !233, size: 64, align: 64, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !474, file: !12, line: 349, baseType: !480, size: 32, align: 32, offset: 256)
!480 = !DICompositeType(tag: DW_TAG_structure_type, scope: !474, file: !12, line: 294, size: 32, align: 32, elements: !481)
!481 = !{!482, !483, !484, !485, !486}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !480, file: !12, line: 303, baseType: !356, size: 2, align: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !480, file: !12, line: 331, baseType: !356, size: 3, align: 32, offset: 2)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !480, file: !12, line: 336, baseType: !356, size: 1, align: 32, offset: 5)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !480, file: !12, line: 340, baseType: !356, size: 1, align: 32, offset: 6)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !480, file: !12, line: 345, baseType: !356, size: 1, align: 32, offset: 7)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !474, file: !12, line: 350, baseType: !488, size: 64, align: 64, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !110, line: 90, baseType: !59)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !12, line: 363, baseType: !492)
!492 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 356, size: 576, align: 64, elements: !493)
!493 = !{!494, !495, !496, !497}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !492, file: !12, line: 357, baseType: !473, size: 384, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !492, file: !12, line: 358, baseType: !26, size: 64, align: 64, offset: 384)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !492, file: !12, line: 360, baseType: !67, size: 64, align: 64, offset: 448)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !492, file: !12, line: 361, baseType: !26, size: 64, align: 64, offset: 512)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !12, line: 376, baseType: !500)
!500 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 368, size: 640, align: 64, elements: !501)
!501 = !{!502, !503}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !500, file: !12, line: 369, baseType: !491, size: 576, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !500, file: !12, line: 375, baseType: !504, size: 64, align: 64, offset: 576)
!504 = !DICompositeType(tag: DW_TAG_union_type, scope: !500, file: !12, line: 370, size: 64, align: 64, elements: !505)
!505 = !{!506, !507, !510, !513}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !504, file: !12, line: 371, baseType: !19, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !504, file: !12, line: 372, baseType: !508, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !12, line: 134, baseType: !413)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !504, file: !12, line: 373, baseType: !511, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !12, line: 129, baseType: !92)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !504, file: !12, line: 374, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !12, line: 121, baseType: !356)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !509)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !512)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !515)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !525, line: 40, baseType: !526)
!525 = !DIFile(filename: "Include/listobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!526 = !DICompositeType(tag: DW_TAG_structure_type, file: !525, line: 23, size: 320, align: 64, elements: !527)
!527 = !{!528, !529, !530}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !526, file: !525, line: 24, baseType: !38, size: 192, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !526, file: !525, line: 26, baseType: !424, size: 64, align: 64, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !526, file: !525, line: 39, baseType: !26, size: 64, align: 64, offset: 256)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !533, line: 33, baseType: !534)
!533 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!534 = !DICompositeType(tag: DW_TAG_structure_type, file: !533, line: 25, size: 256, align: 64, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !534, file: !533, line: 26, baseType: !38, size: 192, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !534, file: !533, line: 27, baseType: !444, size: 64, align: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !413)
!542 = !{!543, !569, !580, !586, !599, !628, !662, !667, !677, !695, !755, !764, !769, !772, !829, !836, !847, !876, !884, !889, !894, !915, !923, !959, !967, !972, !1006, !1020}
!543 = !DISubprogram(name: "PyErr_WarnFormat", scope: !1, file: !1, line: 774, type: !544, isLocal: false, isDefinition: true, scopeLine: 776, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64, i8*, ...)* @PyErr_WarnFormat, variables: !546)
!544 = !DISubroutineType(types: !545)
!545 = !{!59, !20, !26, !44, null}
!546 = !{!547, !548, !549, !550, !551, !552, !565}
!547 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "category", arg: 1, scope: !543, file: !1, line: 774, type: !20)
!548 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stack_level", arg: 2, scope: !543, file: !1, line: 774, type: !26)
!549 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 3, scope: !543, file: !1, line: 775, type: !44)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !543, file: !1, line: 777, type: !59)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "message", scope: !543, file: !1, line: 778, type: !20)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vargs", scope: !543, file: !1, line: 779, type: !553)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !29, line: 79, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !555, line: 50, baseType: !556)
!555 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stdarg.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 779, baseType: !557)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 192, align: 64, elements: !97)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "__va_list_tag", file: !1, line: 779, baseType: !559)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 779, size: 192, align: 64, elements: !560)
!560 = !{!561, !562, !563, !564}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !559, file: !1, line: 779, baseType: !356, size: 32, align: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !559, file: !1, line: 779, baseType: !356, size: 32, align: 32, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !559, file: !1, line: 779, baseType: !19, size: 64, align: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !559, file: !1, line: 779, baseType: !19, size: 64, align: 64, offset: 128)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !566, file: !1, line: 789, type: !20)
!566 = distinct !DILexicalBlock(scope: !567, file: !1, line: 789, column: 9)
!567 = distinct !DILexicalBlock(scope: !568, file: !1, line: 787, column: 26)
!568 = distinct !DILexicalBlock(scope: !543, file: !1, line: 787, column: 9)
!569 = !DISubprogram(name: "PyErr_WarnEx", scope: !1, file: !1, line: 798, type: !570, isLocal: false, isDefinition: true, scopeLine: 799, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*, i64)* @PyErr_WarnEx, variables: !572)
!570 = !DISubroutineType(types: !571)
!571 = !{!59, !20, !44, !26}
!572 = !{!573, !574, !575, !576, !577, !578}
!573 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "category", arg: 1, scope: !569, file: !1, line: 798, type: !20)
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "text", arg: 2, scope: !569, file: !1, line: 798, type: !44)
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stack_level", arg: 3, scope: !569, file: !1, line: 798, type: !26)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !569, file: !1, line: 800, type: !59)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "message", scope: !569, file: !1, line: 801, type: !20)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !579, file: !1, line: 805, type: !20)
!579 = distinct !DILexicalBlock(scope: !569, file: !1, line: 805, column: 5)
!580 = !DISubprogram(name: "PyErr_Warn", scope: !1, file: !1, line: 815, type: !581, isLocal: false, isDefinition: true, scopeLine: 816, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*)* @PyErr_Warn, variables: !583)
!581 = !DISubroutineType(types: !582)
!582 = !{!59, !20, !67}
!583 = !{!584, !585}
!584 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "category", arg: 1, scope: !580, file: !1, line: 815, type: !20)
!585 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "text", arg: 2, scope: !580, file: !1, line: 815, type: !67)
!586 = !DISubprogram(name: "PyErr_WarnExplicitObject", scope: !1, file: !1, line: 822, type: !587, isLocal: false, isDefinition: true, scopeLine: 825, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, %struct._object*, i32, %struct._object*, %struct._object*)* @PyErr_WarnExplicitObject, variables: !589)
!587 = !DISubroutineType(types: !588)
!588 = !{!59, !20, !20, !20, !59, !20, !20}
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597}
!590 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "category", arg: 1, scope: !586, file: !1, line: 822, type: !20)
!591 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "message", arg: 2, scope: !586, file: !1, line: 822, type: !20)
!592 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 3, scope: !586, file: !1, line: 823, type: !20)
!593 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 4, scope: !586, file: !1, line: 823, type: !59)
!594 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 5, scope: !586, file: !1, line: 824, type: !20)
!595 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "registry", arg: 6, scope: !586, file: !1, line: 824, type: !20)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !586, file: !1, line: 826, type: !20)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !598, file: !1, line: 833, type: !20)
!598 = distinct !DILexicalBlock(scope: !586, file: !1, line: 833, column: 5)
!599 = !DISubprogram(name: "PyErr_WarnExplicit", scope: !1, file: !1, line: 838, type: !600, isLocal: false, isDefinition: true, scopeLine: 841, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*, i8*, i32, i8*, %struct._object*)* @PyErr_WarnExplicit, variables: !602)
!600 = !DISubroutineType(types: !601)
!601 = !{!59, !20, !44, !44, !59, !44, !20}
!602 = !{!603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !615, !618, !620, !623, !625}
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "category", arg: 1, scope: !599, file: !1, line: 838, type: !20)
!604 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "text", arg: 2, scope: !599, file: !1, line: 838, type: !44)
!605 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename_str", arg: 3, scope: !599, file: !1, line: 839, type: !44)
!606 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 4, scope: !599, file: !1, line: 839, type: !59)
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module_str", arg: 5, scope: !599, file: !1, line: 840, type: !44)
!608 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "registry", arg: 6, scope: !599, file: !1, line: 840, type: !20)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "message", scope: !599, file: !1, line: 842, type: !20)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filename", scope: !599, file: !1, line: 843, type: !20)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "module", scope: !599, file: !1, line: 844, type: !20)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !599, file: !1, line: 845, type: !59)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !614, file: !1, line: 859, type: !20)
!614 = distinct !DILexicalBlock(scope: !599, file: !1, line: 859, column: 5)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !616, file: !1, line: 859, type: !20)
!616 = distinct !DILexicalBlock(scope: !617, file: !1, line: 859, column: 5)
!617 = distinct !DILexicalBlock(scope: !614, file: !1, line: 859, column: 5)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !619, file: !1, line: 860, type: !20)
!619 = distinct !DILexicalBlock(scope: !599, file: !1, line: 860, column: 5)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !621, file: !1, line: 860, type: !20)
!621 = distinct !DILexicalBlock(scope: !622, file: !1, line: 860, column: 5)
!622 = distinct !DILexicalBlock(scope: !619, file: !1, line: 860, column: 5)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !624, file: !1, line: 861, type: !20)
!624 = distinct !DILexicalBlock(scope: !599, file: !1, line: 861, column: 5)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !626, file: !1, line: 861, type: !20)
!626 = distinct !DILexicalBlock(scope: !627, file: !1, line: 861, column: 5)
!627 = distinct !DILexicalBlock(scope: !624, file: !1, line: 861, column: 5)
!628 = !DISubprogram(name: "PyErr_WarnExplicitFormat", scope: !1, file: !1, line: 866, type: !629, isLocal: false, isDefinition: true, scopeLine: 870, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*, i32, i8*, %struct._object*, i8*, ...)* @PyErr_WarnExplicitFormat, variables: !631)
!629 = !DISubroutineType(types: !630)
!630 = !{!59, !20, !44, !59, !44, !20, !44, null}
!631 = !{!632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !646, !648, !652, !654, !657, !659}
!632 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "category", arg: 1, scope: !628, file: !1, line: 866, type: !20)
!633 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename_str", arg: 2, scope: !628, file: !1, line: 867, type: !44)
!634 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 3, scope: !628, file: !1, line: 867, type: !59)
!635 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module_str", arg: 4, scope: !628, file: !1, line: 868, type: !44)
!636 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "registry", arg: 5, scope: !628, file: !1, line: 868, type: !20)
!637 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 6, scope: !628, file: !1, line: 869, type: !44)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "message", scope: !628, file: !1, line: 871, type: !20)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "module", scope: !628, file: !1, line: 872, type: !20)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filename", scope: !628, file: !1, line: 873, type: !20)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !628, file: !1, line: 874, type: !59)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vargs", scope: !628, file: !1, line: 875, type: !553)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !644, file: !1, line: 892, type: !20)
!644 = distinct !DILexicalBlock(scope: !645, file: !1, line: 891, column: 26)
!645 = distinct !DILexicalBlock(scope: !628, file: !1, line: 891, column: 9)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !647, file: !1, line: 895, type: !20)
!647 = distinct !DILexicalBlock(scope: !644, file: !1, line: 895, column: 9)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !649, file: !1, line: 897, type: !20)
!649 = distinct !DILexicalBlock(scope: !650, file: !1, line: 897, column: 13)
!650 = distinct !DILexicalBlock(scope: !651, file: !1, line: 896, column: 26)
!651 = distinct !DILexicalBlock(scope: !644, file: !1, line: 896, column: 13)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !653, file: !1, line: 903, type: !20)
!653 = distinct !DILexicalBlock(scope: !628, file: !1, line: 903, column: 5)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !655, file: !1, line: 903, type: !20)
!655 = distinct !DILexicalBlock(scope: !656, file: !1, line: 903, column: 5)
!656 = distinct !DILexicalBlock(scope: !653, file: !1, line: 903, column: 5)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !658, file: !1, line: 904, type: !20)
!658 = distinct !DILexicalBlock(scope: !628, file: !1, line: 904, column: 5)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !660, file: !1, line: 904, type: !20)
!660 = distinct !DILexicalBlock(scope: !661, file: !1, line: 904, column: 5)
!661 = distinct !DILexicalBlock(scope: !658, file: !1, line: 904, column: 5)
!662 = !DISubprogram(name: "_PyWarnings_Init", scope: !1, file: !1, line: 1038, type: !663, isLocal: false, isDefinition: true, scopeLine: 1039, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @_PyWarnings_Init, variables: !665)
!663 = !DISubroutineType(types: !664)
!664 = !{!20}
!665 = !{!666}
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !662, file: !1, line: 1040, type: !20)
!667 = !DISubprogram(name: "warn_unicode", scope: !1, file: !1, line: 757, type: !668, isLocal: true, isDefinition: true, scopeLine: 759, flags: DIFlagPrototyped, isOptimized: true, variables: !670)
!668 = !DISubroutineType(types: !669)
!669 = !{!59, !20, !20, !26}
!670 = !{!671, !672, !673, !674, !675}
!671 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "category", arg: 1, scope: !667, file: !1, line: 757, type: !20)
!672 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "message", arg: 2, scope: !667, file: !1, line: 757, type: !20)
!673 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stack_level", arg: 3, scope: !667, file: !1, line: 758, type: !26)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !667, file: !1, line: 760, type: !20)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !676, file: !1, line: 768, type: !20)
!676 = distinct !DILexicalBlock(scope: !667, file: !1, line: 768, column: 5)
!677 = !DISubprogram(name: "do_warn", scope: !1, file: !1, line: 639, type: !678, isLocal: true, isDefinition: true, scopeLine: 640, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i64)* @do_warn, variables: !680)
!678 = !DISubroutineType(types: !679)
!679 = !{!20, !20, !20, !26}
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688, !689, !691, !693}
!681 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "message", arg: 1, scope: !677, file: !1, line: 639, type: !20)
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "category", arg: 2, scope: !677, file: !1, line: 639, type: !20)
!683 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stack_level", arg: 3, scope: !677, file: !1, line: 639, type: !26)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filename", scope: !677, file: !1, line: 641, type: !20)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "module", scope: !677, file: !1, line: 641, type: !20)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "registry", scope: !677, file: !1, line: 641, type: !20)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !677, file: !1, line: 641, type: !20)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lineno", scope: !677, file: !1, line: 642, type: !59)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !690, file: !1, line: 649, type: !20)
!690 = distinct !DILexicalBlock(scope: !677, file: !1, line: 649, column: 5)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !692, file: !1, line: 650, type: !20)
!692 = distinct !DILexicalBlock(scope: !677, file: !1, line: 650, column: 5)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !694, file: !1, line: 651, type: !20)
!694 = distinct !DILexicalBlock(scope: !677, file: !1, line: 651, column: 5)
!695 = !DISubprogram(name: "setup_context", scope: !1, file: !1, line: 484, type: !696, isLocal: true, isDefinition: true, scopeLine: 486, flags: DIFlagPrototyped, isOptimized: true, variables: !699)
!696 = !DISubroutineType(types: !697)
!697 = !{!59, !26, !424, !698, !424, !424}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!699 = !{!700, !701, !702, !703, !704, !705, !706, !709, !716, !717, !720, !722, !725, !728, !729, !730, !734, !737, !741, !745, !747, !750, !752}
!700 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stack_level", arg: 1, scope: !695, file: !1, line: 484, type: !26)
!701 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 2, scope: !695, file: !1, line: 484, type: !424)
!702 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 3, scope: !695, file: !1, line: 484, type: !698)
!703 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 4, scope: !695, file: !1, line: 485, type: !424)
!704 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "registry", arg: 5, scope: !695, file: !1, line: 485, type: !424)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "globals", scope: !695, file: !1, line: 487, type: !20)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !695, file: !1, line: 490, type: !707)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFrameObject", file: !389, line: 53, baseType: !388)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !710, file: !1, line: 490, type: !711)
!710 = distinct !DILexicalBlock(scope: !695, file: !1, line: 490, column: 24)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64, align: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !4, line: 33, baseType: !713)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !4, line: 31, size: 64, align: 64, elements: !714)
!714 = !{!715}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !713, file: !4, line: 32, baseType: !19, size: 64, align: 64)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !710, file: !1, line: 490, type: !19)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !710, file: !1, line: 490, type: !718)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64, align: 64)
!719 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !19)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !710, file: !1, line: 490, type: !721)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !4, line: 29, baseType: !3)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !723, file: !1, line: 510, type: !59)
!723 = distinct !DILexicalBlock(scope: !724, file: !1, line: 509, column: 28)
!724 = distinct !DILexicalBlock(scope: !695, file: !1, line: 509, column: 9)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !726, file: !1, line: 536, type: !26)
!726 = distinct !DILexicalBlock(scope: !727, file: !1, line: 535, column: 58)
!727 = distinct !DILexicalBlock(scope: !695, file: !1, line: 535, column: 9)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !726, file: !1, line: 537, type: !59)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !726, file: !1, line: 538, type: !19)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "argv", scope: !731, file: !1, line: 567, type: !20)
!731 = distinct !DILexicalBlock(scope: !732, file: !1, line: 566, column: 95)
!732 = distinct !DILexicalBlock(scope: !733, file: !1, line: 566, column: 13)
!733 = distinct !DILexicalBlock(scope: !727, file: !1, line: 564, column: 10)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "is_true", scope: !735, file: !1, line: 571, type: !59)
!735 = distinct !DILexicalBlock(scope: !736, file: !1, line: 570, column: 78)
!736 = distinct !DILexicalBlock(scope: !731, file: !1, line: 570, column: 17)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !738, file: !1, line: 577, type: !20)
!738 = distinct !DILexicalBlock(scope: !739, file: !1, line: 577, column: 21)
!739 = distinct !DILexicalBlock(scope: !740, file: !1, line: 576, column: 34)
!740 = distinct !DILexicalBlock(scope: !735, file: !1, line: 576, column: 21)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !742, file: !1, line: 581, type: !20)
!742 = distinct !DILexicalBlock(scope: !743, file: !1, line: 581, column: 21)
!743 = distinct !DILexicalBlock(scope: !744, file: !1, line: 580, column: 36)
!744 = distinct !DILexicalBlock(scope: !740, file: !1, line: 580, column: 26)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !746, file: !1, line: 605, type: !20)
!746 = distinct !DILexicalBlock(scope: !695, file: !1, line: 605, column: 5)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !748, file: !1, line: 605, type: !20)
!748 = distinct !DILexicalBlock(scope: !749, file: !1, line: 605, column: 5)
!749 = distinct !DILexicalBlock(scope: !746, file: !1, line: 605, column: 5)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !751, file: !1, line: 606, type: !20)
!751 = distinct !DILexicalBlock(scope: !695, file: !1, line: 606, column: 5)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !753, file: !1, line: 606, type: !20)
!753 = distinct !DILexicalBlock(scope: !754, file: !1, line: 606, column: 5)
!754 = distinct !DILexicalBlock(scope: !751, file: !1, line: 606, column: 5)
!755 = !DISubprogram(name: "_Py_ANNOTATE_MEMORY_ORDER", scope: !4, file: !4, line: 59, type: !756, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, variables: !761)
!756 = !DISubroutineType(types: !757)
!757 = !{null, !758, !721}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!761 = !{!762, !763}
!762 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "address", arg: 1, scope: !755, file: !4, line: 59, type: !758)
!763 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 2, scope: !755, file: !4, line: 59, type: !721)
!764 = !DISubprogram(name: "_Py_atomic_thread_fence", scope: !4, file: !4, line: 51, type: !765, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, variables: !767)
!765 = !DISubroutineType(types: !766)
!766 = !{null, !721}
!767 = !{!768}
!768 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !764, file: !4, line: 51, type: !721)
!769 = !DISubprogram(name: "_Py_atomic_signal_fence", scope: !4, file: !4, line: 44, type: !765, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, variables: !770)
!770 = !{!771}
!771 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !769, file: !4, line: 44, type: !721)
!772 = !DISubprogram(name: "warn_explicit", scope: !1, file: !1, line: 329, type: !773, isLocal: true, isDefinition: true, scopeLine: 332, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*, i32, %struct._object*, %struct._object*, %struct._object*)* @warn_explicit, variables: !775)
!773 = !DISubroutineType(types: !774)
!774 = !{!20, !20, !20, !20, !59, !20, !20, !20}
!775 = !{!776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !793, !796, !800, !802, !804, !807, !809, !812, !814, !817, !819, !822, !824, !826}
!776 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "category", arg: 1, scope: !772, file: !1, line: 329, type: !20)
!777 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "message", arg: 2, scope: !772, file: !1, line: 329, type: !20)
!778 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 3, scope: !772, file: !1, line: 330, type: !20)
!779 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 4, scope: !772, file: !1, line: 330, type: !59)
!780 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 5, scope: !772, file: !1, line: 331, type: !20)
!781 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "registry", arg: 6, scope: !772, file: !1, line: 331, type: !20)
!782 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sourceline", arg: 7, scope: !772, file: !1, line: 331, type: !20)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !772, file: !1, line: 333, type: !20)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "text", scope: !772, file: !1, line: 333, type: !20)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !772, file: !1, line: 333, type: !20)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lineno_obj", scope: !772, file: !1, line: 333, type: !20)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !772, file: !1, line: 334, type: !20)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "action", scope: !772, file: !1, line: 335, type: !20)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !772, file: !1, line: 336, type: !59)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "show_fxn", scope: !791, file: !1, line: 439, type: !20)
!791 = distinct !DILexicalBlock(scope: !792, file: !1, line: 438, column: 18)
!792 = distinct !DILexicalBlock(scope: !772, file: !1, line: 438, column: 9)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !794, file: !1, line: 446, type: !20)
!794 = distinct !DILexicalBlock(scope: !795, file: !1, line: 445, column: 14)
!795 = distinct !DILexicalBlock(scope: !791, file: !1, line: 440, column: 13)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !797, file: !1, line: 452, type: !20)
!797 = distinct !DILexicalBlock(scope: !798, file: !1, line: 452, column: 17)
!798 = distinct !DILexicalBlock(scope: !799, file: !1, line: 448, column: 46)
!799 = distinct !DILexicalBlock(scope: !794, file: !1, line: 448, column: 17)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !801, file: !1, line: 459, type: !20)
!801 = distinct !DILexicalBlock(scope: !794, file: !1, line: 459, column: 13)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !803, file: !1, line: 460, type: !20)
!803 = distinct !DILexicalBlock(scope: !794, file: !1, line: 460, column: 13)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !805, file: !1, line: 460, type: !20)
!805 = distinct !DILexicalBlock(scope: !806, file: !1, line: 460, column: 13)
!806 = distinct !DILexicalBlock(scope: !803, file: !1, line: 460, column: 13)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !808, file: !1, line: 473, type: !20)
!808 = distinct !DILexicalBlock(scope: !772, file: !1, line: 473, column: 5)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !810, file: !1, line: 473, type: !20)
!810 = distinct !DILexicalBlock(scope: !811, file: !1, line: 473, column: 5)
!811 = distinct !DILexicalBlock(scope: !808, file: !1, line: 473, column: 5)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !813, file: !1, line: 474, type: !20)
!813 = distinct !DILexicalBlock(scope: !772, file: !1, line: 474, column: 5)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !815, file: !1, line: 474, type: !20)
!815 = distinct !DILexicalBlock(scope: !816, file: !1, line: 474, column: 5)
!816 = distinct !DILexicalBlock(scope: !813, file: !1, line: 474, column: 5)
!817 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !818, file: !1, line: 475, type: !20)
!818 = distinct !DILexicalBlock(scope: !772, file: !1, line: 475, column: 5)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !820, file: !1, line: 475, type: !20)
!820 = distinct !DILexicalBlock(scope: !821, file: !1, line: 475, column: 5)
!821 = distinct !DILexicalBlock(scope: !818, file: !1, line: 475, column: 5)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !823, file: !1, line: 476, type: !20)
!823 = distinct !DILexicalBlock(scope: !772, file: !1, line: 476, column: 5)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !825, file: !1, line: 477, type: !20)
!825 = distinct !DILexicalBlock(scope: !772, file: !1, line: 477, column: 5)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !827, file: !1, line: 477, type: !20)
!827 = distinct !DILexicalBlock(scope: !828, file: !1, line: 477, column: 5)
!828 = distinct !DILexicalBlock(scope: !825, file: !1, line: 477, column: 5)
!829 = !DISubprogram(name: "normalize_module", scope: !1, file: !1, line: 201, type: !131, isLocal: true, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, variables: !830)
!830 = !{!831, !832, !833, !834, !835}
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !829, file: !1, line: 201, type: !20)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "module", scope: !829, file: !1, line: 203, type: !20)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !829, file: !1, line: 204, type: !59)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !829, file: !1, line: 205, type: !19)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !829, file: !1, line: 206, type: !26)
!836 = !DISubprogram(name: "already_warned", scope: !1, file: !1, line: 179, type: !837, isLocal: true, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: true, variables: !839)
!837 = !DISubroutineType(types: !838)
!838 = !{!59, !20, !20, !59}
!839 = !{!840, !841, !842, !843, !844}
!840 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "registry", arg: 1, scope: !836, file: !1, line: 179, type: !20)
!841 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !836, file: !1, line: 179, type: !20)
!842 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "should_set", arg: 3, scope: !836, file: !1, line: 179, type: !59)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "already_warned", scope: !836, file: !1, line: 181, type: !20)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !845, file: !1, line: 188, type: !59)
!845 = distinct !DILexicalBlock(scope: !846, file: !1, line: 187, column: 33)
!846 = distinct !DILexicalBlock(scope: !836, file: !1, line: 187, column: 9)
!847 = !DISubprogram(name: "get_filter", scope: !1, file: !1, line: 105, type: !848, isLocal: true, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, variables: !850)
!848 = !DISubroutineType(types: !849)
!849 = !{!20, !20, !20, !26, !20, !424}
!850 = !{!851, !852, !853, !854, !855, !856, !857, !858, !859, !863, !867, !868, !869, !870, !871, !872, !873, !874, !875}
!851 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "category", arg: 1, scope: !847, file: !1, line: 105, type: !20)
!852 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "text", arg: 2, scope: !847, file: !1, line: 105, type: !20)
!853 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 3, scope: !847, file: !1, line: 105, type: !26)
!854 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 4, scope: !847, file: !1, line: 106, type: !20)
!855 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 5, scope: !847, file: !1, line: 106, type: !424)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "action", scope: !847, file: !1, line: 108, type: !20)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !847, file: !1, line: 109, type: !26)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "warnings_filters", scope: !847, file: !1, line: 110, type: !20)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !860, file: !1, line: 118, type: !20)
!860 = distinct !DILexicalBlock(scope: !861, file: !1, line: 118, column: 9)
!861 = distinct !DILexicalBlock(scope: !862, file: !1, line: 117, column: 10)
!862 = distinct !DILexicalBlock(scope: !847, file: !1, line: 113, column: 9)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp_item", scope: !864, file: !1, line: 130, type: !20)
!864 = distinct !DILexicalBlock(scope: !865, file: !1, line: 129, column: 53)
!865 = distinct !DILexicalBlock(scope: !866, file: !1, line: 129, column: 5)
!866 = distinct !DILexicalBlock(scope: !847, file: !1, line: 129, column: 5)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "action", scope: !864, file: !1, line: 130, type: !20)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msg", scope: !864, file: !1, line: 130, type: !20)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cat", scope: !864, file: !1, line: 130, type: !20)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !864, file: !1, line: 130, type: !20)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ln_obj", scope: !864, file: !1, line: 130, type: !20)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ln", scope: !864, file: !1, line: 131, type: !26)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "is_subclass", scope: !864, file: !1, line: 132, type: !59)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "good_msg", scope: !864, file: !1, line: 132, type: !59)
!875 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "good_mod", scope: !864, file: !1, line: 132, type: !59)
!876 = !DISubprogram(name: "check_matched", scope: !1, file: !1, line: 20, type: !212, isLocal: true, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: true, variables: !877)
!877 = !{!878, !879, !880, !881, !882}
!878 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !876, file: !1, line: 20, type: !20)
!879 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !876, file: !1, line: 20, type: !20)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !876, file: !1, line: 22, type: !20)
!881 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !876, file: !1, line: 24, type: !59)
!882 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !883, file: !1, line: 33, type: !20)
!883 = distinct !DILexicalBlock(scope: !876, file: !1, line: 33, column: 5)
!884 = !DISubprogram(name: "get_default_action", scope: !1, file: !1, line: 85, type: !663, isLocal: true, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: true, variables: !885)
!885 = !{!886, !887}
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "default_action", scope: !884, file: !1, line: 87, type: !20)
!887 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !888, file: !1, line: 97, type: !20)
!888 = distinct !DILexicalBlock(scope: !884, file: !1, line: 97, column: 5)
!889 = !DISubprogram(name: "get_once_registry", scope: !1, file: !1, line: 68, type: !663, isLocal: true, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true, variables: !890)
!890 = !{!891, !892}
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "registry", scope: !889, file: !1, line: 70, type: !20)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !893, file: !1, line: 78, type: !20)
!893 = distinct !DILexicalBlock(scope: !889, file: !1, line: 78, column: 5)
!894 = !DISubprogram(name: "update_registry", scope: !1, file: !1, line: 234, type: !895, isLocal: true, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, variables: !897)
!895 = !DISubroutineType(types: !896)
!896 = !{!59, !20, !20, !20, !59}
!897 = !{!898, !899, !900, !901, !902, !903, !904, !905, !907, !910, !912}
!898 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "registry", arg: 1, scope: !894, file: !1, line: 234, type: !20)
!899 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "text", arg: 2, scope: !894, file: !1, line: 234, type: !20)
!900 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "category", arg: 3, scope: !894, file: !1, line: 234, type: !20)
!901 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "add_zero", arg: 4, scope: !894, file: !1, line: 235, type: !59)
!902 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "altkey", scope: !894, file: !1, line: 237, type: !20)
!903 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zero", scope: !894, file: !1, line: 237, type: !20)
!904 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !894, file: !1, line: 238, type: !59)
!905 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !906, file: !1, line: 250, type: !20)
!906 = distinct !DILexicalBlock(scope: !894, file: !1, line: 250, column: 5)
!907 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !908, file: !1, line: 250, type: !20)
!908 = distinct !DILexicalBlock(scope: !909, file: !1, line: 250, column: 5)
!909 = distinct !DILexicalBlock(scope: !906, file: !1, line: 250, column: 5)
!910 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !911, file: !1, line: 251, type: !20)
!911 = distinct !DILexicalBlock(scope: !894, file: !1, line: 251, column: 5)
!912 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !913, file: !1, line: 251, type: !20)
!913 = distinct !DILexicalBlock(scope: !914, file: !1, line: 251, column: 5)
!914 = distinct !DILexicalBlock(scope: !911, file: !1, line: 251, column: 5)
!915 = !DISubprogram(name: "get_warnings_attr", scope: !1, file: !1, line: 42, type: !916, isLocal: true, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @get_warnings_attr, variables: !918)
!916 = !DISubroutineType(types: !917)
!917 = !{!20, !44}
!918 = !{!919, !920, !921, !922}
