; ModuleID = 'acceler.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.grammar = type { i32, %struct.dfa*, %struct.labellist, i32, i32 }
%struct.dfa = type { i32, i8*, i32, i32, %struct.state*, i8* }
%struct.state = type { i32, %struct.arc*, i32, i32, i32*, i32 }
%struct.arc = type { i16, i16 }
%struct.labellist = type { i32, %struct.label* }
%struct.label = type { i32, i8* }

@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [37 x i8] c"no mem to build parser accelerators\0A\00", align 1
@.str.4 = private unnamed_addr constant [35 x i8] c"no mem to add parser accelerators\0A\00", align 1
@str = private unnamed_addr constant [15 x i8] c"XXX ambiguity!\00"
@str.5 = private unnamed_addr constant [33 x i8] c"XXX too high nonterminal number!\00"
@str.6 = private unnamed_addr constant [21 x i8] c"XXX too many states!\00"

; Function Attrs: nounwind uwtable
define void @PyGrammar_AddAccelerators(%struct.grammar* %g) #0 {
entry:
  tail call void @llvm.dbg.value(metadata %struct.grammar* %g, i64 0, metadata !64, metadata !111), !dbg !112

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7)
!1 = !DIFile(filename: "Parser/acceler.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !6}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!7 = !{!8, !67, !77, !85}
!8 = !DISubprogram(name: "PyGrammar_AddAccelerators", scope: !1, file: !1, line: 24, type: !9, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.grammar*)* @PyGrammar_AddAccelerators, variables: !63)
!9 = !DISubroutineType(types: !10)
!10 = !{null, !11}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "grammar", file: !13, line: 67, baseType: !14)
!13 = !DIFile(filename: "Include/grammar.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!14 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 61, size: 320, align: 64, elements: !15)
!15 = !{!16, !17, !49, !61, !62}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "g_ndfas", scope: !14, file: !13, line: 62, baseType: !5, size: 32, align: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "g_dfa", scope: !14, file: !13, line: 63, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "dfa", file: !13, line: 57, baseType: !20)
!20 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 50, size: 320, align: 64, elements: !21)
!21 = !{!22, !23, !26, !27, !28, !46}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !20, file: !13, line: 51, baseType: !5, size: 32, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !20, file: !13, line: 52, baseType: !24, size: 64, align: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "d_initial", scope: !20, file: !13, line: 53, baseType: !5, size: 32, align: 32, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "d_nstates", scope: !20, file: !13, line: 54, baseType: !5, size: 32, align: 32, offset: 160)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "d_state", scope: !20, file: !13, line: 55, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "state", file: !13, line: 46, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 37, size: 320, align: 64, elements: !32)
!32 = !{!33, !34, !42, !43, !44, !45}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "s_narcs", scope: !31, file: !13, line: 38, baseType: !5, size: 32, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "s_arc", scope: !31, file: !13, line: 39, baseType: !35, size: 64, align: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc", file: !13, line: 33, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 30, size: 32, align: 16, elements: !38)
!38 = !{!39, !41}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "a_lbl", scope: !37, file: !13, line: 31, baseType: !40, size: 16, align: 16)
!40 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "a_arrow", scope: !37, file: !13, line: 32, baseType: !40, size: 16, align: 16, offset: 16)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "s_lower", scope: !31, file: !13, line: 42, baseType: !5, size: 32, align: 32, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "s_upper", scope: !31, file: !13, line: 43, baseType: !5, size: 32, align: 32, offset: 160)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "s_accel", scope: !31, file: !13, line: 44, baseType: !4, size: 64, align: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "s_accept", scope: !31, file: !13, line: 45, baseType: !5, size: 32, align: 32, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "d_first", scope: !20, file: !13, line: 56, baseType: !47, size: 64, align: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitset", file: !48, line: 12, baseType: !24)
!48 = !DIFile(filename: "Include/bitset.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!49 = !DIDerivedType(tag: DW_TAG_member, name: "g_ll", scope: !14, file: !13, line: 64, baseType: !50, size: 128, align: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "labellist", file: !13, line: 26, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 23, size: 128, align: 64, elements: !52)
!52 = !{!53, !54}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ll_nlabels", scope: !51, file: !13, line: 24, baseType: !5, size: 32, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ll_label", scope: !51, file: !13, line: 25, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "label", file: !13, line: 17, baseType: !57)
!57 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 14, size: 128, align: 64, elements: !58)
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !57, file: !13, line: 15, baseType: !5, size: 32, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "lb_str", scope: !57, file: !13, line: 16, baseType: !24, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "g_start", scope: !14, file: !13, line: 65, baseType: !5, size: 32, align: 32, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "g_accel", scope: !14, file: !13, line: 66, baseType: !5, size: 32, align: 32, offset: 288)
!63 = !{!64, !65, !66}
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !8, file: !1, line: 24, type: !11)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !8, file: !1, line: 26, type: !18)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !8, file: !1, line: 27, type: !5)
!67 = !DISubprogram(name: "PyGrammar_RemoveAccelerators", scope: !1, file: !1, line: 35, type: !9, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.grammar*)* @PyGrammar_RemoveAccelerators, variables: !68)
!68 = !{!69, !70, !71, !72, !76}
!69 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !67, file: !1, line: 35, type: !11)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !67, file: !1, line: 37, type: !18)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !67, file: !1, line: 38, type: !5)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !73, file: !1, line: 42, type: !29)
!73 = distinct !DILexicalBlock(scope: !74, file: !1, line: 41, column: 41)
!74 = distinct !DILexicalBlock(scope: !75, file: !1, line: 41, column: 5)
!75 = distinct !DILexicalBlock(scope: !67, file: !1, line: 41, column: 5)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !73, file: !1, line: 43, type: !5)
!77 = !DISubprogram(name: "fixdfa", scope: !1, file: !1, line: 54, type: !78, isLocal: true, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: true, variables: !80)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !11, !18}
!80 = !{!81, !82, !83, !84}
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !77, file: !1, line: 54, type: !11)
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 2, scope: !77, file: !1, line: 54, type: !18)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !77, file: !1, line: 56, type: !29)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !77, file: !1, line: 57, type: !5)
!85 = !DISubprogram(name: "fixstate", scope: !1, file: !1, line: 64, type: !86, isLocal: true, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: true, variables: !88)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !11, !29}
!88 = !{!89, !90, !91, !92, !93, !94, !95, !99, !100, !101, !104, !105}
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !85, file: !1, line: 64, type: !11)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 2, scope: !85, file: !1, line: 64, type: !29)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !85, file: !1, line: 66, type: !35)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !85, file: !1, line: 67, type: !5)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "accel", scope: !85, file: !1, line: 68, type: !4)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nl", scope: !85, file: !1, line: 69, type: !5)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lbl", scope: !96, file: !1, line: 80, type: !5)
!96 = distinct !DILexicalBlock(scope: !97, file: !1, line: 79, column: 41)
!97 = distinct !DILexicalBlock(scope: !98, file: !1, line: 79, column: 5)
!98 = distinct !DILexicalBlock(scope: !85, file: !1, line: 79, column: 5)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !96, file: !1, line: 81, type: !55)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !96, file: !1, line: 82, type: !5)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d1", scope: !102, file: !1, line: 88, type: !18)
!102 = distinct !DILexicalBlock(scope: !103, file: !1, line: 87, column: 34)
!103 = distinct !DILexicalBlock(scope: !96, file: !1, line: 87, column: 13)
