; ModuleID = 'ast.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55}
!44 = !DIEnumerator(name: "Add", value: 1)
!45 = !DIEnumerator(name: "Sub", value: 2)
!46 = !DIEnumerator(name: "Mult", value: 3)
!47 = !DIEnumerator(name: "Div", value: 4)
!48 = !DIEnumerator(name: "Mod", value: 5)
!49 = !DIEnumerator(name: "Pow", value: 6)
!50 = !DIEnumerator(name: "LShift", value: 7)
!51 = !DIEnumerator(name: "RShift", value: 8)
!52 = !DIEnumerator(name: "BitOr", value: 9)
!53 = !DIEnumerator(name: "BitXor", value: 10)
!54 = !DIEnumerator(name: "BitAnd", value: 11)
!55 = !DIEnumerator(name: "FloorDiv", value: 12)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_unaryop", file: !4, line: 22, size: 32, align: 32, elements: !57)
!57 = !{!58, !59, !60, !61}
!58 = !DIEnumerator(name: "Invert", value: 1)
!59 = !DIEnumerator(name: "Not", value: 2)
!60 = !DIEnumerator(name: "UAdd", value: 3)
!61 = !DIEnumerator(name: "USub", value: 4)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_expr_context", file: !4, line: 11, size: 32, align: 32, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69}
!64 = !DIEnumerator(name: "Load", value: 1)
!65 = !DIEnumerator(name: "Store", value: 2)
!66 = !DIEnumerator(name: "Del", value: 3)
!67 = !DIEnumerator(name: "AugLoad", value: 4)
!68 = !DIEnumerator(name: "AugStore", value: 5)
!69 = !DIEnumerator(name: "Param", value: 6)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_slice_kind", file: !4, line: 323, size: 32, align: 32, elements: !71)
!71 = !{!72, !73, !74}
!72 = !DIEnumerator(name: "Slice_kind", value: 1)
!73 = !DIEnumerator(name: "ExtSlice_kind", value: 2)
!74 = !DIEnumerator(name: "Index_kind", value: 3)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_stmt_kind", file: !4, line: 66, size: 32, align: 32, elements: !76)
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97}
!77 = !DIEnumerator(name: "FunctionDef_kind", value: 1)
!78 = !DIEnumerator(name: "ClassDef_kind", value: 2)
!79 = !DIEnumerator(name: "Return_kind", value: 3)
!80 = !DIEnumerator(name: "Delete_kind", value: 4)
!81 = !DIEnumerator(name: "Assign_kind", value: 5)
!82 = !DIEnumerator(name: "AugAssign_kind", value: 6)
!83 = !DIEnumerator(name: "For_kind", value: 7)
!84 = !DIEnumerator(name: "While_kind", value: 8)
!85 = !DIEnumerator(name: "If_kind", value: 9)
!86 = !DIEnumerator(name: "With_kind", value: 10)
!87 = !DIEnumerator(name: "Raise_kind", value: 11)
!88 = !DIEnumerator(name: "Try_kind", value: 12)
!89 = !DIEnumerator(name: "Assert_kind", value: 13)
!90 = !DIEnumerator(name: "Import_kind", value: 14)
!91 = !DIEnumerator(name: "ImportFrom_kind", value: 15)
!92 = !DIEnumerator(name: "Global_kind", value: 16)
!93 = !DIEnumerator(name: "Nonlocal_kind", value: 17)
!94 = !DIEnumerator(name: "Expr_kind", value: 18)
!95 = !DIEnumerator(name: "Pass_kind", value: 19)
!96 = !DIEnumerator(name: "Break_kind", value: 20)
!97 = !DIEnumerator(name: "Continue_kind", value: 21)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_excepthandler_kind", file: !4, line: 350, size: 32, align: 32, elements: !99)
!99 = !{!100}
!100 = !DIEnumerator(name: "ExceptHandler_kind", value: 1)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_cmpop", file: !4, line: 24, size: 32, align: 32, elements: !102)
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!103 = !DIEnumerator(name: "Eq", value: 1)
!104 = !DIEnumerator(name: "NotEq", value: 2)
!105 = !DIEnumerator(name: "Lt", value: 3)
!106 = !DIEnumerator(name: "LtE", value: 4)
!107 = !DIEnumerator(name: "Gt", value: 5)
!108 = !DIEnumerator(name: "GtE", value: 6)
!109 = !DIEnumerator(name: "Is", value: 7)
!110 = !DIEnumerator(name: "IsNot", value: 8)
!111 = !DIEnumerator(name: "In", value: 9)
!112 = !DIEnumerator(name: "NotIn", value: 10)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !114, line: 451, size: 32, align: 32, elements: !115)
!114 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!115 = !{!116, !117, !118, !119}
!116 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!117 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!118 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!119 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!120 = !{!121, !460, !206, !468, !211, !675, !677, !145, !680, !698, !502, !679, !168, !699, !707, !724, !725, !727, !729, !133, !731, !476, !630, !732, !740}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !123, line: 109, baseType: !124)
!123 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !123, line: 105, size: 128, align: 64, elements: !125)
!125 = !{!126, !134}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !124, file: !123, line: 107, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !128, line: 177, baseType: !129)
!128 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !130, line: 102, baseType: !131)
!130 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !132, line: 181, baseType: !133)
!132 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!133 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !124, file: !123, line: 108, baseType: !135, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !123, line: 334, size: 3200, align: 64, elements: !137)
!137 = !{!138, !144, !148, !149, !150, !155, !219, !224, !229, !230, !235, !287, !318, !330, !336, !337, !338, !340, !342, !373, !374, !375, !384, !385, !390, !391, !393, !395, !405, !408, !426, !427, !428, !430, !432, !433, !435, !440, !445, !450, !451, !452, !453, !454, !455, !456, !457, !459}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !136, file: !123, line: 335, baseType: !139, size: 192, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !123, line: 114, baseType: !140)
!140 = !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 111, size: 192, align: 64, elements: !141)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !140, file: !123, line: 112, baseType: !122, size: 128, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !140, file: !123, line: 113, baseType: !127, size: 64, align: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !136, file: !123, line: 336, baseType: !145, size: 64, align: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!147 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !136, file: !123, line: 337, baseType: !127, size: 64, align: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !136, file: !123, line: 337, baseType: !127, size: 64, align: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !136, file: !123, line: 341, baseType: !151, size: 64, align: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !123, line: 308, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !121}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !136, file: !123, line: 342, baseType: !156, size: 64, align: 64, offset: 448)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !123, line: 314, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!160, !121, !161, !160}
!160 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !130, line: 48, baseType: !163)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !164, line: 246, size: 1728, align: 64, elements: !165)
!164 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!165 = !{!166, !167, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !187, !188, !189, !190, !192, !194, !196, !200, !203, !205, !207, !208, !209, !210, !214, !215}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !163, file: !164, line: 247, baseType: !160, size: 32, align: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !163, file: !164, line: 252, baseType: !168, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !163, file: !164, line: 253, baseType: !168, size: 64, align: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !163, file: !164, line: 254, baseType: !168, size: 64, align: 64, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !163, file: !164, line: 255, baseType: !168, size: 64, align: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !163, file: !164, line: 256, baseType: !168, size: 64, align: 64, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !163, file: !164, line: 257, baseType: !168, size: 64, align: 64, offset: 384)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !163, file: !164, line: 258, baseType: !168, size: 64, align: 64, offset: 448)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !163, file: !164, line: 259, baseType: !168, size: 64, align: 64, offset: 512)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !163, file: !164, line: 261, baseType: !168, size: 64, align: 64, offset: 576)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !163, file: !164, line: 262, baseType: !168, size: 64, align: 64, offset: 640)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !163, file: !164, line: 263, baseType: !168, size: 64, align: 64, offset: 704)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !163, file: !164, line: 265, baseType: !180, size: 64, align: 64, offset: 768)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !164, line: 161, size: 192, align: 64, elements: !182)
!182 = !{!183, !184, !186}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !181, file: !164, line: 162, baseType: !180, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !181, file: !164, line: 163, baseType: !185, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !181, file: !164, line: 167, baseType: !160, size: 32, align: 32, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !163, file: !164, line: 267, baseType: !185, size: 64, align: 64, offset: 832)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !163, file: !164, line: 269, baseType: !160, size: 32, align: 32, offset: 896)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !163, file: !164, line: 273, baseType: !160, size: 32, align: 32, offset: 928)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !163, file: !164, line: 275, baseType: !191, size: 64, align: 64, offset: 960)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !132, line: 140, baseType: !133)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !163, file: !164, line: 279, baseType: !193, size: 16, align: 16, offset: 1024)
!193 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !163, file: !164, line: 280, baseType: !195, size: 8, align: 8, offset: 1040)
!195 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !163, file: !164, line: 281, baseType: !197, size: 8, align: 8, offset: 1048)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 8, align: 8, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 1)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !163, file: !164, line: 285, baseType: !201, size: 64, align: 64, offset: 1088)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !164, line: 155, baseType: null)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !163, file: !164, line: 294, baseType: !204, size: 64, align: 64, offset: 1152)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !132, line: 141, baseType: !133)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !163, file: !164, line: 303, baseType: !206, size: 64, align: 64, offset: 1216)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !163, file: !164, line: 304, baseType: !206, size: 64, align: 64, offset: 1280)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !163, file: !164, line: 305, baseType: !206, size: 64, align: 64, offset: 1344)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !163, file: !164, line: 306, baseType: !206, size: 64, align: 64, offset: 1408)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !163, file: !164, line: 307, baseType: !211, size: 64, align: 64, offset: 1472)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !212, line: 62, baseType: !213)
!212 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!213 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !163, file: !164, line: 309, baseType: !160, size: 32, align: 32, offset: 1536)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !163, file: !164, line: 311, baseType: !216, size: 160, align: 8, offset: 1568)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 160, align: 8, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 20)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !136, file: !123, line: 343, baseType: !220, size: 64, align: 64, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !123, line: 316, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!121, !121, !168}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !136, file: !123, line: 344, baseType: !225, size: 64, align: 64, offset: 576)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !123, line: 318, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!160, !121, !168, !121}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !136, file: !123, line: 345, baseType: !206, size: 64, align: 64, offset: 640)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !136, file: !123, line: 346, baseType: !231, size: 64, align: 64, offset: 704)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !123, line: 320, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!121, !121}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !136, file: !123, line: 350, baseType: !236, size: 64, align: 64, offset: 768)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !123, line: 278, baseType: !238)
!238 = !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 236, size: 2176, align: 64, elements: !239)
!239 = !{!240, !245, !246, !247, !248, !249, !254, !256, !257, !258, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !238, file: !123, line: 241, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !123, line: 166, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!121, !121, !121}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !238, file: !123, line: 242, baseType: !241, size: 64, align: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !238, file: !123, line: 243, baseType: !241, size: 64, align: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !238, file: !123, line: 244, baseType: !241, size: 64, align: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !238, file: !123, line: 245, baseType: !241, size: 64, align: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !238, file: !123, line: 246, baseType: !250, size: 64, align: 64, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !123, line: 167, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!121, !121, !121, !121}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !238, file: !123, line: 247, baseType: !255, size: 64, align: 64, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !123, line: 165, baseType: !232)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !238, file: !123, line: 248, baseType: !255, size: 64, align: 64, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !238, file: !123, line: 249, baseType: !255, size: 64, align: 64, offset: 512)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !238, file: !123, line: 250, baseType: !259, size: 64, align: 64, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !123, line: 168, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!160, !121}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !238, file: !123, line: 251, baseType: !255, size: 64, align: 64, offset: 640)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !238, file: !123, line: 252, baseType: !241, size: 64, align: 64, offset: 704)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !238, file: !123, line: 253, baseType: !241, size: 64, align: 64, offset: 768)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !238, file: !123, line: 254, baseType: !241, size: 64, align: 64, offset: 832)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !238, file: !123, line: 255, baseType: !241, size: 64, align: 64, offset: 896)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !238, file: !123, line: 256, baseType: !241, size: 64, align: 64, offset: 960)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !238, file: !123, line: 257, baseType: !255, size: 64, align: 64, offset: 1024)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !238, file: !123, line: 258, baseType: !206, size: 64, align: 64, offset: 1088)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !238, file: !123, line: 259, baseType: !255, size: 64, align: 64, offset: 1152)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !238, file: !123, line: 261, baseType: !241, size: 64, align: 64, offset: 1216)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !238, file: !123, line: 262, baseType: !241, size: 64, align: 64, offset: 1280)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !238, file: !123, line: 263, baseType: !241, size: 64, align: 64, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !238, file: !123, line: 264, baseType: !241, size: 64, align: 64, offset: 1408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !238, file: !123, line: 265, baseType: !250, size: 64, align: 64, offset: 1472)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !238, file: !123, line: 266, baseType: !241, size: 64, align: 64, offset: 1536)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !238, file: !123, line: 267, baseType: !241, size: 64, align: 64, offset: 1600)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !238, file: !123, line: 268, baseType: !241, size: 64, align: 64, offset: 1664)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !238, file: !123, line: 269, baseType: !241, size: 64, align: 64, offset: 1728)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !238, file: !123, line: 270, baseType: !241, size: 64, align: 64, offset: 1792)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !238, file: !123, line: 272, baseType: !241, size: 64, align: 64, offset: 1856)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !238, file: !123, line: 273, baseType: !241, size: 64, align: 64, offset: 1920)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !238, file: !123, line: 274, baseType: !241, size: 64, align: 64, offset: 1984)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !238, file: !123, line: 275, baseType: !241, size: 64, align: 64, offset: 2048)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !238, file: !123, line: 277, baseType: !255, size: 64, align: 64, offset: 2112)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !136, file: !123, line: 351, baseType: !288, size: 64, align: 64, offset: 832)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !123, line: 292, baseType: !290)
!290 = !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 280, size: 640, align: 64, elements: !291)
!291 = !{!292, !297, !298, !303, !304, !305, !310, !311, !316, !317}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !290, file: !123, line: 281, baseType: !293, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !123, line: 169, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!127, !121}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !290, file: !123, line: 282, baseType: !241, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !290, file: !123, line: 283, baseType: !299, size: 64, align: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !123, line: 170, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!121, !121, !127}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !290, file: !123, line: 284, baseType: !299, size: 64, align: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !290, file: !123, line: 285, baseType: !206, size: 64, align: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !290, file: !123, line: 286, baseType: !306, size: 64, align: 64, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !123, line: 172, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!160, !121, !127, !121}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !290, file: !123, line: 287, baseType: !206, size: 64, align: 64, offset: 384)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !290, file: !123, line: 288, baseType: !312, size: 64, align: 64, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !123, line: 231, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!160, !121, !121}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !290, file: !123, line: 290, baseType: !241, size: 64, align: 64, offset: 512)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !290, file: !123, line: 291, baseType: !299, size: 64, align: 64, offset: 576)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !136, file: !123, line: 352, baseType: !319, size: 64, align: 64, offset: 896)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !123, line: 298, baseType: !321)
!321 = !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 294, size: 192, align: 64, elements: !322)
!322 = !{!323, !324, !325}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !321, file: !123, line: 295, baseType: !293, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !321, file: !123, line: 296, baseType: !241, size: 64, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !321, file: !123, line: 297, baseType: !326, size: 64, align: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !123, line: 174, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!160, !121, !121, !121}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !136, file: !123, line: 356, baseType: !331, size: 64, align: 64, offset: 960)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !123, line: 321, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!335, !121}
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !128, line: 186, baseType: !127)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !136, file: !123, line: 357, baseType: !250, size: 64, align: 64, offset: 1024)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !136, file: !123, line: 358, baseType: !231, size: 64, align: 64, offset: 1088)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !136, file: !123, line: 359, baseType: !339, size: 64, align: 64, offset: 1152)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !123, line: 317, baseType: !242)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !136, file: !123, line: 360, baseType: !341, size: 64, align: 64, offset: 1216)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !123, line: 319, baseType: !327)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !136, file: !123, line: 363, baseType: !343, size: 64, align: 64, offset: 1280)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !123, line: 304, baseType: !345)
!345 = !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 301, size: 128, align: 64, elements: !346)
!346 = !{!347, !368}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !345, file: !123, line: 302, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !123, line: 193, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!160, !121, !352, !160}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !123, line: 191, baseType: !354)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !123, line: 178, size: 640, align: 64, elements: !355)
!355 = !{!356, !357, !358, !359, !360, !361, !362, !363, !365, !366, !367}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !354, file: !123, line: 179, baseType: !206, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !354, file: !123, line: 180, baseType: !121, size: 64, align: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !354, file: !123, line: 181, baseType: !127, size: 64, align: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !354, file: !123, line: 182, baseType: !127, size: 64, align: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !354, file: !123, line: 184, baseType: !160, size: 32, align: 32, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !354, file: !123, line: 185, baseType: !160, size: 32, align: 32, offset: 288)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !354, file: !123, line: 186, baseType: !168, size: 64, align: 64, offset: 320)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !354, file: !123, line: 187, baseType: !364, size: 64, align: 64, offset: 384)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !354, file: !123, line: 188, baseType: !364, size: 64, align: 64, offset: 448)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !354, file: !123, line: 189, baseType: !364, size: 64, align: 64, offset: 512)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !354, file: !123, line: 190, baseType: !206, size: 64, align: 64, offset: 576)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !345, file: !123, line: 303, baseType: !369, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !123, line: 194, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !121, !352}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !136, file: !123, line: 366, baseType: !213, size: 64, align: 64, offset: 1344)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !136, file: !123, line: 368, baseType: !145, size: 64, align: 64, offset: 1408)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !136, file: !123, line: 372, baseType: !376, size: 64, align: 64, offset: 1472)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !123, line: 233, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!160, !121, !380, !206}
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !123, line: 232, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!160, !121, !206}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !136, file: !123, line: 375, baseType: !259, size: 64, align: 64, offset: 1536)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !136, file: !123, line: 379, baseType: !386, size: 64, align: 64, offset: 1600)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !123, line: 322, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!121, !121, !121, !160}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !136, file: !123, line: 382, baseType: !127, size: 64, align: 64, offset: 1664)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !136, file: !123, line: 385, baseType: !392, size: 64, align: 64, offset: 1728)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !123, line: 323, baseType: !232)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !136, file: !123, line: 386, baseType: !394, size: 64, align: 64, offset: 1792)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !123, line: 324, baseType: !232)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !136, file: !123, line: 389, baseType: !396, size: 64, align: 64, offset: 1856)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !398, line: 40, size: 256, align: 64, elements: !399)
!398 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!399 = !{!400, !401, !403, !404}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !397, file: !398, line: 41, baseType: !145, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !397, file: !398, line: 42, baseType: !402, size: 64, align: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !398, line: 18, baseType: !242)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !397, file: !398, line: 43, baseType: !160, size: 32, align: 32, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !397, file: !398, line: 45, baseType: !145, size: 64, align: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !136, file: !123, line: 390, baseType: !406, size: 64, align: 64, offset: 1920)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !123, line: 390, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !136, file: !123, line: 391, baseType: !409, size: 64, align: 64, offset: 1984)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !411, line: 11, size: 320, align: 64, elements: !412)
!411 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!412 = !{!413, !414, !419, !424, !425}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !410, file: !411, line: 12, baseType: !168, size: 64, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !410, file: !411, line: 13, baseType: !415, size: 64, align: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !411, line: 8, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!121, !121, !206}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !410, file: !411, line: 14, baseType: !420, size: 64, align: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !411, line: 9, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{!160, !121, !121, !206}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !410, file: !411, line: 15, baseType: !168, size: 64, align: 64, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !410, file: !411, line: 16, baseType: !206, size: 64, align: 64, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !136, file: !123, line: 392, baseType: !135, size: 64, align: 64, offset: 2048)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !136, file: !123, line: 393, baseType: !121, size: 64, align: 64, offset: 2112)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !136, file: !123, line: 394, baseType: !429, size: 64, align: 64, offset: 2176)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !123, line: 325, baseType: !251)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !136, file: !123, line: 395, baseType: !431, size: 64, align: 64, offset: 2240)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !123, line: 326, baseType: !327)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !136, file: !123, line: 396, baseType: !127, size: 64, align: 64, offset: 2304)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !136, file: !123, line: 397, baseType: !434, size: 64, align: 64, offset: 2368)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !123, line: 327, baseType: !327)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !136, file: !123, line: 398, baseType: !436, size: 64, align: 64, offset: 2432)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !123, line: 329, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!121, !135, !127}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !136, file: !123, line: 399, baseType: !441, size: 64, align: 64, offset: 2496)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !123, line: 328, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!121, !135, !121, !121}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !136, file: !123, line: 400, baseType: !446, size: 64, align: 64, offset: 2560)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !123, line: 307, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !206}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !136, file: !123, line: 401, baseType: !259, size: 64, align: 64, offset: 2624)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !136, file: !123, line: 402, baseType: !121, size: 64, align: 64, offset: 2688)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !136, file: !123, line: 403, baseType: !121, size: 64, align: 64, offset: 2752)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !136, file: !123, line: 404, baseType: !121, size: 64, align: 64, offset: 2816)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !136, file: !123, line: 405, baseType: !121, size: 64, align: 64, offset: 2880)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !136, file: !123, line: 406, baseType: !121, size: 64, align: 64, offset: 2944)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !136, file: !123, line: 407, baseType: !151, size: 64, align: 64, offset: 3008)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !136, file: !123, line: 410, baseType: !458, size: 32, align: 32, offset: 3072)
!458 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !136, file: !123, line: 412, baseType: !151, size: 64, align: 64, offset: 3136)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !462, line: 33, baseType: !463)
!462 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!463 = !DICompositeType(tag: DW_TAG_structure_type, file: !462, line: 25, size: 256, align: 64, elements: !464)
!464 = !{!465, !466}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !463, file: !462, line: 26, baseType: !139, size: 192, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !463, file: !462, line: 27, baseType: !467, size: 64, align: 64, offset: 192)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 64, align: 64, elements: !198)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "keyword_ty", file: !4, line: 35, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "_keyword", file: !4, line: 381, size: 128, align: 64, elements: !471)
!471 = !{!472, !475}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !470, file: !4, line: 382, baseType: !473, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "identifier", file: !474, line: 4, baseType: !121)
!474 = !DIFile(filename: "Include/asdl.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!475 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !470, file: !4, line: 383, baseType: !476, size: 64, align: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "expr_ty", file: !4, line: 9, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "_expr", file: !4, line: 188, size: 448, align: 64, elements: !479)
!479 = !{!480, !481, !673, !674}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !478, file: !4, line: 189, baseType: !10, size: 32, align: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !478, file: !4, line: 318, baseType: !482, size: 320, align: 64, offset: 64)
!482 = !DICompositeType(tag: DW_TAG_union_type, scope: !478, file: !4, line: 190, size: 320, align: 64, elements: !483)
!483 = !{!484, !497, !504, !510, !533, !539, !544, !548, !553, !558, !564, !569, !573, !577, !590, !598, !603, !608, !613, !618, !625, !653, !658, !663, !668}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "BoolOp", scope: !482, file: !4, line: 194, baseType: !485, size: 128, align: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 191, size: 128, align: 64, elements: !486)
!486 = !{!487, !489}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !485, file: !4, line: 192, baseType: !488, size: 32, align: 32)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolop_ty", file: !4, line: 16, baseType: !38)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !485, file: !4, line: 193, baseType: !490, size: 64, align: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "asdl_seq", file: !474, line: 21, baseType: !492)
!492 = !DICompositeType(tag: DW_TAG_structure_type, file: !474, line: 18, size: 128, align: 64, elements: !493)
!493 = !{!494, !495}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !492, file: !474, line: 19, baseType: !127, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !492, file: !474, line: 20, baseType: !496, size: 64, align: 64, offset: 64)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 64, align: 64, elements: !198)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "BinOp", scope: !482, file: !4, line: 200, baseType: !498, size: 192, align: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 196, size: 192, align: 64, elements: !499)
!499 = !{!500, !501, !503}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !498, file: !4, line: 197, baseType: !476, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !498, file: !4, line: 198, baseType: !502, size: 32, align: 32, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "operator_ty", file: !4, line: 20, baseType: !42)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !498, file: !4, line: 199, baseType: !476, size: 64, align: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "UnaryOp", scope: !482, file: !4, line: 205, baseType: !505, size: 128, align: 64)
!505 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 202, size: 128, align: 64, elements: !506)
!506 = !{!507, !509}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !505, file: !4, line: 203, baseType: !508, size: 32, align: 32)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryop_ty", file: !4, line: 22, baseType: !56)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "operand", scope: !505, file: !4, line: 204, baseType: !476, size: 64, align: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "Lambda", scope: !482, file: !4, line: 210, baseType: !511, size: 128, align: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 207, size: 128, align: 64, elements: !512)
!512 = !{!513, !532}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !511, file: !4, line: 208, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments_ty", file: !4, line: 31, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64, align: 64)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "_arguments", file: !4, line: 365, size: 384, align: 64, elements: !517)
!517 = !{!518, !519, !528, !529, !530, !531}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !516, file: !4, line: 366, baseType: !490, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "vararg", scope: !516, file: !4, line: 367, baseType: !520, size: 64, align: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_ty", file: !4, line: 33, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "_arg", file: !4, line: 374, size: 192, align: 64, elements: !523)
!523 = !{!524, !525, !526, !527}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !522, file: !4, line: 375, baseType: !473, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "annotation", scope: !522, file: !4, line: 376, baseType: !476, size: 64, align: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !522, file: !4, line: 377, baseType: !160, size: 32, align: 32, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "col_offset", scope: !522, file: !4, line: 378, baseType: !160, size: 32, align: 32, offset: 160)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "kwonlyargs", scope: !516, file: !4, line: 368, baseType: !490, size: 64, align: 64, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "kw_defaults", scope: !516, file: !4, line: 369, baseType: !490, size: 64, align: 64, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "kwarg", scope: !516, file: !4, line: 370, baseType: !520, size: 64, align: 64, offset: 256)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !516, file: !4, line: 371, baseType: !490, size: 64, align: 64, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !511, file: !4, line: 209, baseType: !476, size: 64, align: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "IfExp", scope: !482, file: !4, line: 216, baseType: !534, size: 192, align: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 212, size: 192, align: 64, elements: !535)
!535 = !{!536, !537, !538}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !534, file: !4, line: 213, baseType: !476, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !534, file: !4, line: 214, baseType: !476, size: 64, align: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "orelse", scope: !534, file: !4, line: 215, baseType: !476, size: 64, align: 64, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "Dict", scope: !482, file: !4, line: 221, baseType: !540, size: 128, align: 64)
!540 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 218, size: 128, align: 64, elements: !541)
!541 = !{!542, !543}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !540, file: !4, line: 219, baseType: !490, size: 64, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !540, file: !4, line: 220, baseType: !490, size: 64, align: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Set", scope: !482, file: !4, line: 225, baseType: !545, size: 64, align: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 223, size: 64, align: 64, elements: !546)
!546 = !{!547}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !545, file: !4, line: 224, baseType: !490, size: 64, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ListComp", scope: !482, file: !4, line: 230, baseType: !549, size: 128, align: 64)
!549 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 227, size: 128, align: 64, elements: !550)
!550 = !{!551, !552}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "elt", scope: !549, file: !4, line: 228, baseType: !476, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "generators", scope: !549, file: !4, line: 229, baseType: !490, size: 64, align: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "SetComp", scope: !482, file: !4, line: 235, baseType: !554, size: 128, align: 64)
!554 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 232, size: 128, align: 64, elements: !555)
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "elt", scope: !554, file: !4, line: 233, baseType: !476, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "generators", scope: !554, file: !4, line: 234, baseType: !490, size: 64, align: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "DictComp", scope: !482, file: !4, line: 241, baseType: !559, size: 192, align: 64)
!559 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 237, size: 192, align: 64, elements: !560)
!560 = !{!561, !562, !563}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !559, file: !4, line: 238, baseType: !476, size: 64, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !559, file: !4, line: 239, baseType: !476, size: 64, align: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "generators", scope: !559, file: !4, line: 240, baseType: !490, size: 64, align: 64, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "GeneratorExp", scope: !482, file: !4, line: 246, baseType: !565, size: 128, align: 64)
!565 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 243, size: 128, align: 64, elements: !566)
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "elt", scope: !565, file: !4, line: 244, baseType: !476, size: 64, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "generators", scope: !565, file: !4, line: 245, baseType: !490, size: 64, align: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "Yield", scope: !482, file: !4, line: 250, baseType: !570, size: 64, align: 64)
!570 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 248, size: 64, align: 64, elements: !571)
!571 = !{!572}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !570, file: !4, line: 249, baseType: !476, size: 64, align: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "YieldFrom", scope: !482, file: !4, line: 254, baseType: !574, size: 64, align: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 252, size: 64, align: 64, elements: !575)
!575 = !{!576}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !574, file: !4, line: 253, baseType: !476, size: 64, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Compare", scope: !482, file: !4, line: 260, baseType: !578, size: 192, align: 64)
!578 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 256, size: 192, align: 64, elements: !579)
!579 = !{!580, !581, !589}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !578, file: !4, line: 257, baseType: !476, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !578, file: !4, line: 258, baseType: !582, size: 64, align: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "asdl_int_seq", file: !474, line: 26, baseType: !584)
!584 = !DICompositeType(tag: DW_TAG_structure_type, file: !474, line: 23, size: 128, align: 64, elements: !585)
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !584, file: !474, line: 24, baseType: !127, size: 64, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !584, file: !474, line: 25, baseType: !588, size: 32, align: 32, offset: 64)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 32, align: 32, elements: !198)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "comparators", scope: !578, file: !4, line: 259, baseType: !490, size: 64, align: 64, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "Call", scope: !482, file: !4, line: 268, baseType: !591, size: 320, align: 64)
!591 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 262, size: 320, align: 64, elements: !592)
!592 = !{!593, !594, !595, !596, !597}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !591, file: !4, line: 263, baseType: !476, size: 64, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !591, file: !4, line: 264, baseType: !490, size: 64, align: 64, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "keywords", scope: !591, file: !4, line: 265, baseType: !490, size: 64, align: 64, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "starargs", scope: !591, file: !4, line: 266, baseType: !476, size: 64, align: 64, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "kwargs", scope: !591, file: !4, line: 267, baseType: !476, size: 64, align: 64, offset: 256)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "Num", scope: !482, file: !4, line: 272, baseType: !599, size: 64, align: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 270, size: 64, align: 64, elements: !600)
!600 = !{!601}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !599, file: !4, line: 271, baseType: !602, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "object", file: !474, line: 7, baseType: !121)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Str", scope: !482, file: !4, line: 276, baseType: !604, size: 64, align: 64)
!604 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 274, size: 64, align: 64, elements: !605)
!605 = !{!606}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !604, file: !4, line: 275, baseType: !607, size: 64, align: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "string", file: !474, line: 5, baseType: !121)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Bytes", scope: !482, file: !4, line: 280, baseType: !609, size: 64, align: 64)
!609 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 278, size: 64, align: 64, elements: !610)
!610 = !{!611}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !609, file: !4, line: 279, baseType: !612, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "bytes", file: !474, line: 6, baseType: !121)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "NameConstant", scope: !482, file: !4, line: 284, baseType: !614, size: 64, align: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 282, size: 64, align: 64, elements: !615)
!615 = !{!616}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !614, file: !4, line: 283, baseType: !617, size: 64, align: 64)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "singleton", file: !474, line: 8, baseType: !121)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !482, file: !4, line: 290, baseType: !619, size: 192, align: 64)
!619 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 286, size: 192, align: 64, elements: !620)
!620 = !{!621, !622, !623}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !619, file: !4, line: 287, baseType: !476, size: 64, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !619, file: !4, line: 288, baseType: !473, size: 64, align: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !619, file: !4, line: 289, baseType: !624, size: 32, align: 32, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "expr_context_ty", file: !4, line: 12, baseType: !62)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "Subscript", scope: !482, file: !4, line: 296, baseType: !626, size: 192, align: 64)
!626 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 292, size: 192, align: 64, elements: !627)
!627 = !{!628, !629, !652}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !626, file: !4, line: 293, baseType: !476, size: 64, align: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !626, file: !4, line: 294, baseType: !630, size: 64, align: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "slice_ty", file: !4, line: 14, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64, align: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "_slice", file: !4, line: 324, size: 256, align: 64, elements: !633)
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !632, file: !4, line: 325, baseType: !70, size: 32, align: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !632, file: !4, line: 341, baseType: !636, size: 192, align: 64, offset: 64)
!636 = !DICompositeType(tag: DW_TAG_union_type, scope: !632, file: !4, line: 326, size: 192, align: 64, elements: !637)
!637 = !{!638, !644, !648}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "Slice", scope: !636, file: !4, line: 331, baseType: !639, size: 192, align: 64)
!639 = !DICompositeType(tag: DW_TAG_structure_type, scope: !636, file: !4, line: 327, size: 192, align: 64, elements: !640)
!640 = !{!641, !642, !643}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !639, file: !4, line: 328, baseType: !476, size: 64, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !639, file: !4, line: 329, baseType: !476, size: 64, align: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !639, file: !4, line: 330, baseType: !476, size: 64, align: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ExtSlice", scope: !636, file: !4, line: 335, baseType: !645, size: 64, align: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, scope: !636, file: !4, line: 333, size: 64, align: 64, elements: !646)
!646 = !{!647}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !645, file: !4, line: 334, baseType: !490, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !636, file: !4, line: 339, baseType: !649, size: 64, align: 64)
!649 = !DICompositeType(tag: DW_TAG_structure_type, scope: !636, file: !4, line: 337, size: 64, align: 64, elements: !650)
!650 = !{!651}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !649, file: !4, line: 338, baseType: !476, size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !626, file: !4, line: 295, baseType: !624, size: 32, align: 32, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "Starred", scope: !482, file: !4, line: 301, baseType: !654, size: 128, align: 64)
!654 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 298, size: 128, align: 64, elements: !655)
!655 = !{!656, !657}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !654, file: !4, line: 299, baseType: !476, size: 64, align: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !654, file: !4, line: 300, baseType: !624, size: 32, align: 32, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !482, file: !4, line: 306, baseType: !659, size: 128, align: 64)
!659 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 303, size: 128, align: 64, elements: !660)
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !659, file: !4, line: 304, baseType: !473, size: 64, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !659, file: !4, line: 305, baseType: !624, size: 32, align: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "List", scope: !482, file: !4, line: 311, baseType: !664, size: 128, align: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 308, size: 128, align: 64, elements: !665)
!665 = !{!666, !667}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !664, file: !4, line: 309, baseType: !490, size: 64, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !664, file: !4, line: 310, baseType: !624, size: 32, align: 32, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Tuple", scope: !482, file: !4, line: 316, baseType: !669, size: 128, align: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !4, line: 313, size: 128, align: 64, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !669, file: !4, line: 314, baseType: !490, size: 64, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !669, file: !4, line: 315, baseType: !624, size: 32, align: 32, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !478, file: !4, line: 319, baseType: !160, size: 32, align: 32, offset: 384)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "col_offset", scope: !478, file: !4, line: 320, baseType: !160, size: 32, align: 32, offset: 416)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64, align: 64)
!676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64, align: 64)
!678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !679)
!679 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64, align: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !114, line: 351, baseType: !682)
!682 = !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 217, size: 384, align: 64, elements: !683)
!683 = !{!684, !685, !686, !687, !695}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !682, file: !114, line: 291, baseType: !122, size: 128, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !682, file: !114, line: 292, baseType: !127, size: 64, align: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !682, file: !114, line: 293, baseType: !335, size: 64, align: 64, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !682, file: !114, line: 349, baseType: !688, size: 32, align: 32, offset: 256)
!688 = !DICompositeType(tag: DW_TAG_structure_type, scope: !682, file: !114, line: 294, size: 32, align: 32, elements: !689)
!689 = !{!690, !691, !692, !693, !694}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !688, file: !114, line: 303, baseType: !458, size: 2, align: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !688, file: !114, line: 331, baseType: !458, size: 3, align: 32, offset: 2)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !688, file: !114, line: 336, baseType: !458, size: 1, align: 32, offset: 5)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !688, file: !114, line: 340, baseType: !458, size: 1, align: 32, offset: 6)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !688, file: !114, line: 345, baseType: !458, size: 1, align: 32, offset: 7)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !682, file: !114, line: 350, baseType: !696, size: 64, align: 64, offset: 320)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !212, line: 90, baseType: !160)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmpop_ty", file: !4, line: 25, baseType: !101)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !114, line: 363, baseType: !701)
!701 = !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 356, size: 576, align: 64, elements: !702)
!702 = !{!703, !704, !705, !706}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !701, file: !114, line: 357, baseType: !681, size: 384, align: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !701, file: !114, line: 358, baseType: !127, size: 64, align: 64, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !701, file: !114, line: 360, baseType: !168, size: 64, align: 64, offset: 448)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !701, file: !114, line: 361, baseType: !127, size: 64, align: 64, offset: 512)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !114, line: 376, baseType: !709)
!709 = !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 368, size: 640, align: 64, elements: !710)
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !709, file: !114, line: 369, baseType: !700, size: 576, align: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !709, file: !114, line: 375, baseType: !713, size: 64, align: 64, offset: 576)
!713 = !DICompositeType(tag: DW_TAG_union_type, scope: !709, file: !114, line: 370, size: 64, align: 64, elements: !714)
!714 = !{!715, !716, !719, !722}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !713, file: !114, line: 371, baseType: !206, size: 64, align: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !713, file: !114, line: 372, baseType: !717, size: 64, align: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64, align: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !114, line: 134, baseType: !679)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !713, file: !114, line: 373, baseType: !720, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64, align: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !114, line: 129, baseType: !193)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !713, file: !114, line: 374, baseType: !723, size: 64, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64, align: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !114, line: 121, baseType: !458)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64, align: 64)
!726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !718)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64, align: 64)
!728 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !721)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64, align: 64)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !724)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !734, line: 41, baseType: !735)
!734 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!735 = !DICompositeType(tag: DW_TAG_structure_type, file: !734, line: 31, size: 320, align: 64, elements: !736)
!736 = !{!737, !738, !739}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !735, file: !734, line: 32, baseType: !139, size: 192, align: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !735, file: !734, line: 33, baseType: !335, size: 64, align: 64, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !735, file: !734, line: 34, baseType: !197, size: 8, align: 8, offset: 256)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!741 = !{!742, !772, !940, !952, !962, !999, !1005, !1010, !1018, !1030, !1034, !1040, !1047, !1062, !1067, !1082, !1090, !1104, !1114, !1149, !1155, !1188, !1211, !1221, !1241, !1257, !1269, !1285, !1292, !1332, !1337, !1353, !1358, !1363, !1377, !1473, !1506, !1541, !1580, !1589, !1607, !1611, !1620, !1642, !1649, !1659, !1678, !1683, !1687, !1691, !1698, !1724, !1755, !1773, !1784, !1793, !1816, !1822, !1827, !1843, !1878, !1919, !1926, !1933, !1944, !1974, !1994, !2007, !2018, !2045, !2064, !2076, !2084, !2096, !2107, !2113, !2120, !2126}
!742 = !DISubprogram(name: "PyAST_Validate", scope: !1, file: !1, line: 460, type: !743, isLocal: false, isDefinition: true, scopeLine: 461, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._mod*)* @PyAST_Validate, variables: !769)
!743 = !DISubroutineType(types: !744)
!744 = !{!160, !745}
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "mod_ty", file: !4, line: 5, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64, align: 64)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "_mod", file: !4, line: 44, size: 128, align: 64, elements: !748)
!748 = !{!749, !750}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !747, file: !4, line: 45, baseType: !3, size: 32, align: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !747, file: !4, line: 63, baseType: !751, size: 64, align: 64, offset: 64)
!751 = !DICompositeType(tag: DW_TAG_union_type, scope: !747, file: !4, line: 46, size: 64, align: 64, elements: !752)
!752 = !{!753, !757, !761, !765}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Module", scope: !751, file: !4, line: 49, baseType: !754, size: 64, align: 64)
!754 = !DICompositeType(tag: DW_TAG_structure_type, scope: !751, file: !4, line: 47, size: 64, align: 64, elements: !755)
!755 = !{!756}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !754, file: !4, line: 48, baseType: !490, size: 64, align: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Interactive", scope: !751, file: !4, line: 53, baseType: !758, size: 64, align: 64)
!758 = !DICompositeType(tag: DW_TAG_structure_type, scope: !751, file: !4, line: 51, size: 64, align: 64, elements: !759)
!759 = !{!760}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !758, file: !4, line: 52, baseType: !490, size: 64, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "Expression", scope: !751, file: !4, line: 57, baseType: !762, size: 64, align: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, scope: !751, file: !4, line: 55, size: 64, align: 64, elements: !763)
!763 = !{!764}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !762, file: !4, line: 56, baseType: !476, size: 64, align: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Suite", scope: !751, file: !4, line: 61, baseType: !766, size: 64, align: 64)
!766 = !DICompositeType(tag: DW_TAG_structure_type, scope: !751, file: !4, line: 59, size: 64, align: 64, elements: !767)
!767 = !{!768}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !766, file: !4, line: 60, baseType: !490, size: 64, align: 64)
!769 = !{!770, !771}
!770 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mod", arg: 1, scope: !742, file: !1, line: 460, type: !745)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !742, file: !1, line: 462, type: !160)
!772 = !DISubprogram(name: "PyAST_FromNodeObject", scope: !1, file: !1, line: 665, type: !773, isLocal: false, isDefinition: true, scopeLine: 667, flags: DIFlagPrototyped, isOptimized: true, function: %struct._mod* (%struct._node*, %struct.PyCompilerFlags*, %struct._object*, %struct._arena*)* @PyAST_FromNodeObject, variables: !799)
!773 = !DISubroutineType(types: !774)
!774 = !{!745, !775, !789, !121, !795}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "node", file: !778, line: 17, baseType: !779)
!778 = !DIFile(filename: "Include/node.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "_node", file: !778, line: 10, size: 320, align: 64, elements: !780)
!780 = !{!781, !783, !784, !785, !786, !787}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "n_type", scope: !779, file: !778, line: 11, baseType: !782, size: 16, align: 16)
!782 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "n_str", scope: !779, file: !778, line: 12, baseType: !168, size: 64, align: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "n_lineno", scope: !779, file: !778, line: 13, baseType: !160, size: 32, align: 32, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "n_col_offset", scope: !779, file: !778, line: 14, baseType: !160, size: 32, align: 32, offset: 160)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "n_nchildren", scope: !779, file: !778, line: 15, baseType: !160, size: 32, align: 32, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "n_child", scope: !779, file: !778, line: 16, baseType: !788, size: 64, align: 64, offset: 256)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64, align: 64)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64, align: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompilerFlags", file: !791, line: 22, baseType: !792)
!791 = !DIFile(filename: "Include/pythonrun.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!792 = !DICompositeType(tag: DW_TAG_structure_type, file: !791, line: 20, size: 32, align: 32, elements: !793)
!793 = !{!794}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "cf_flags", scope: !792, file: !791, line: 21, baseType: !160, size: 32, align: 32)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64, align: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArena", file: !797, line: 12, baseType: !798)
!797 = !DIFile(filename: "Include/pyarena.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "_arena", file: !797, line: 12, flags: DIFlagFwdDecl)
!799 = !{!800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !920, !922, !930, !931, !934, !938}
!800 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !772, file: !1, line: 665, type: !775)
!801 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 2, scope: !772, file: !1, line: 665, type: !789)
!802 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 3, scope: !772, file: !1, line: 666, type: !121)
!803 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arena", arg: 4, scope: !772, file: !1, line: 666, type: !795)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !772, file: !1, line: 668, type: !160)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !772, file: !1, line: 668, type: !160)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !772, file: !1, line: 668, type: !160)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num", scope: !772, file: !1, line: 668, type: !160)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stmts", scope: !772, file: !1, line: 669, type: !490)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !772, file: !1, line: 670, type: !810)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "stmt_ty", file: !4, line: 7, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64, align: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "_stmt", file: !4, line: 72, size: 576, align: 64, elements: !813)
!813 = !{!814, !815, !918, !919}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !812, file: !4, line: 73, baseType: !75, size: 32, align: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !812, file: !4, line: 175, baseType: !816, size: 448, align: 64, offset: 64)
!816 = !DICompositeType(tag: DW_TAG_union_type, scope: !812, file: !4, line: 74, size: 448, align: 64, elements: !817)
!817 = !{!818, !826, !836, !840, !844, !849, !855, !862, !868, !874, !879, !884, !891, !896, !900, !906, !910, !914}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "FunctionDef", scope: !816, file: !4, line: 81, baseType: !819, size: 320, align: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !4, line: 75, size: 320, align: 64, elements: !820)
!820 = !{!821, !822, !823, !824, !825}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !819, file: !4, line: 76, baseType: !473, size: 64, align: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !819, file: !4, line: 77, baseType: !514, size: 64, align: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !819, file: !4, line: 78, baseType: !490, size: 64, align: 64, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "decorator_list", scope: !819, file: !4, line: 79, baseType: !490, size: 64, align: 64, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "returns", scope: !819, file: !4, line: 80, baseType: !476, size: 64, align: 64, offset: 256)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ClassDef", scope: !816, file: !4, line: 91, baseType: !827, size: 448, align: 64)
!827 = !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !4, line: 83, size: 448, align: 64, elements: !828)
!828 = !{!829, !830, !831, !832, !833, !834, !835}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !827, file: !4, line: 84, baseType: !473, size: 64, align: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !827, file: !4, line: 85, baseType: !490, size: 64, align: 64, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "keywords", scope: !827, file: !4, line: 86, baseType: !490, size: 64, align: 64, offset: 128)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "starargs", scope: !827, file: !4, line: 87, baseType: !476, size: 64, align: 64, offset: 192)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "kwargs", scope: !827, file: !4, line: 88, baseType: !476, size: 64, align: 64, offset: 256)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !827, file: !4, line: 89, baseType: !490, size: 64, align: 64, offset: 320)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "decorator_list", scope: !827, file: !4, line: 90, baseType: !490, size: 64, align: 64, offset: 384)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "Return", scope: !816, file: !4, line: 95, baseType: !837, size: 64, align: 64)
!837 = !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !4, line: 93, size: 64, align: 64, elements: !838)
!838 = !{!839}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !837, file: !4, line: 94, baseType: !476, size: 64, align: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "Delete", scope: !816, file: !4, line: 99, baseType: !841, size: 64, align: 64)
!841 = !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !4, line: 97, size: 64, align: 64, elements: !842)
!842 = !{!843}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "targets", scope: !841, file: !4, line: 98, baseType: !490, size: 64, align: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "Assign", scope: !816, file: !4, line: 104, baseType: !845, size: 128, align: 64)
!845 = !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !4, line: 101, size: 128, align: 64, elements: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "targets", scope: !845, file: !4, line: 102, baseType: !490, size: 64, align: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !845, file: !4, line: 103, baseType: !476, size: 64, align: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "AugAssign", scope: !816, file: !4, line: 110, baseType: !850, size: 192, align: 64)
!850 = !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !4, line: 106, size: 192, align: 64, elements: !851)
!851 = !{!852, !853, !854}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !850, file: !4, line: 107, baseType: !476, size: 64, align: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !850, file: !4, line: 108, baseType: !502, size: 32, align: 32, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !850, file: !4, line: 109, baseType: !476, size: 64, align: 64, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "For", scope: !816, file: !4, line: 117, baseType: !856, size: 256, align: 64)
!856 = !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !4, line: 112, size: 256, align: 64, elements: !857)
!857 = !{!858, !859, !860, !861}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !856, file: !4, line: 113, baseType: !476, size: 64, align: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !856, file: !4, line: 114, baseType: !476, size: 64, align: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !856, file: !4, line: 115, baseType: !490, size: 64, align: 64, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "orelse", scope: !856, file: !4, line: 116, baseType: !490, size: 64, align: 64, offset: 192)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "While", scope: !816, file: !4, line: 123, baseType: !863, size: 192, align: 64)
!863 = !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !4, line: 119, size: 192, align: 64, elements: !864)
!864 = !{!865, !866, !867}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !863, file: !4, line: 120, baseType: !476, size: 64, align: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !863, file: !4, line: 121, baseType: !490, size: 64, align: 64, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "orelse", scope: !863, file: !4, line: 122, baseType: !490, size: 64, align: 64, offset: 128)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "If", scope: !816, file: !4, line: 129, baseType: !869, size: 192, align: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !4, line: 125, size: 192, align: 64, elements: !870)
!870 = !{!871, !872, !873}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !869, file: !4, line: 126, baseType: !476, size: 64, align: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !869, file: !4, line: 127, baseType: !490, size: 64, align: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "orelse", scope: !869, file: !4, line: 128, baseType: !490, size: 64, align: 64, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "With", scope: !816, file: !4, line: 134, baseType: !875, size: 128, align: 64)
!875 = !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !4, line: 131, size: 128, align: 64, elements: !876)
!876 = !{!877, !878}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !875, file: !4, line: 132, baseType: !490, size: 64, align: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !875, file: !4, line: 133, baseType: !490, size: 64, align: 64, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "Raise", scope: !816, file: !4, line: 139, baseType: !880, size: 128, align: 64)
!880 = !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !4, line: 136, size: 128, align: 64, elements: !881)
!881 = !{!882, !883}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "exc", scope: !880, file: !4, line: 137, baseType: !476, size: 64, align: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !880, file: !4, line: 138, baseType: !476, size: 64, align: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "Try", scope: !816, file: !4, line: 146, baseType: !885, size: 256, align: 64)
!885 = !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !4, line: 141, size: 256, align: 64, elements: !886)
!886 = !{!887, !888, !889, !890}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !885, file: !4, line: 142, baseType: !490, size: 64, align: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !885, file: !4, line: 143, baseType: !490, size: 64, align: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "orelse", scope: !885, file: !4, line: 144, baseType: !490, size: 64, align: 64, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "finalbody", scope: !885, file: !4, line: 145, baseType: !490, size: 64, align: 64, offset: 192)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "Assert", scope: !816, file: !4, line: 151, baseType: !892, size: 128, align: 64)
!892 = !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !4, line: 148, size: 128, align: 64, elements: !893)
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !892, file: !4, line: 149, baseType: !476, size: 64, align: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !892, file: !4, line: 150, baseType: !476, size: 64, align: 64, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "Import", scope: !816, file: !4, line: 155, baseType: !897, size: 64, align: 64)
!897 = !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !4, line: 153, size: 64, align: 64, elements: !898)
!898 = !{!899}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !897, file: !4, line: 154, baseType: !490, size: 64, align: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ImportFrom", scope: !816, file: !4, line: 161, baseType: !901, size: 192, align: 64)
!901 = !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !4, line: 157, size: 192, align: 64, elements: !902)
!902 = !{!903, !904, !905}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !901, file: !4, line: 158, baseType: !473, size: 64, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !901, file: !4, line: 159, baseType: !490, size: 64, align: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !901, file: !4, line: 160, baseType: !160, size: 32, align: 32, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "Global", scope: !816, file: !4, line: 165, baseType: !907, size: 64, align: 64)
!907 = !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !4, line: 163, size: 64, align: 64, elements: !908)
!908 = !{!909}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !907, file: !4, line: 164, baseType: !490, size: 64, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "Nonlocal", scope: !816, file: !4, line: 169, baseType: !911, size: 64, align: 64)
!911 = !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !4, line: 167, size: 64, align: 64, elements: !912)
!912 = !{!913}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !911, file: !4, line: 168, baseType: !490, size: 64, align: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "Expr", scope: !816, file: !4, line: 173, baseType: !915, size: 64, align: 64)
!915 = !DICompositeType(tag: DW_TAG_structure_type, scope: !816, file: !4, line: 171, size: 64, align: 64, elements: !916)
!916 = !{!917}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !915, file: !4, line: 172, baseType: !476, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !812, file: !4, line: 176, baseType: !160, size: 32, align: 32, offset: 512)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "col_offset", scope: !812, file: !4, line: 177, baseType: !160, size: 32, align: 32, offset: 544)
!920 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch", scope: !772, file: !1, line: 671, type: !921)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64, align: 64)
!922 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !772, file: !1, line: 672, type: !923)
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "compiling", file: !1, line: 491, size: 320, align: 64, elements: !924)
!924 = !{!925, !926, !927, !928, !929}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "c_encoding", scope: !923, file: !1, line: 492, baseType: !168, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "c_arena", scope: !923, file: !1, line: 493, baseType: !795, size: 64, align: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "c_filename", scope: !923, file: !1, line: 494, baseType: !121, size: 64, align: 64, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "c_normalize", scope: !923, file: !1, line: 495, baseType: !121, size: 64, align: 64, offset: 192)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "c_normalize_args", scope: !923, file: !1, line: 496, baseType: !121, size: 64, align: 64, offset: 256)
!930 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !772, file: !1, line: 673, type: !745)
!931 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "testlist_ast", scope: !932, file: !1, line: 728, type: !476)
!932 = distinct !DILexicalBlock(scope: !933, file: !1, line: 727, column: 26)
!933 = distinct !DILexicalBlock(scope: !772, file: !1, line: 697, column: 22)
!934 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !935, file: !1, line: 783, type: !121)
!935 = distinct !DILexicalBlock(scope: !936, file: !1, line: 783, column: 9)
!936 = distinct !DILexicalBlock(scope: !937, file: !1, line: 782, column: 24)
!937 = distinct !DILexicalBlock(scope: !772, file: !1, line: 782, column: 9)
!938 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !939, file: !1, line: 785, type: !121)
!939 = distinct !DILexicalBlock(scope: !936, file: !1, line: 785, column: 9)
!940 = !DISubprogram(name: "PyAST_FromNode", scope: !1, file: !1, line: 791, type: !941, isLocal: false, isDefinition: true, scopeLine: 793, flags: DIFlagPrototyped, isOptimized: true, function: %struct._mod* (%struct._node*, %struct.PyCompilerFlags*, i8*, %struct._arena*)* @PyAST_FromNode, variables: !943)
!941 = !DISubroutineType(types: !942)
!942 = !{!745, !775, !789, !145, !795}
!943 = !{!944, !945, !946, !947, !948, !949, !950}
!944 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !940, file: !1, line: 791, type: !775)
!945 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 2, scope: !940, file: !1, line: 791, type: !789)
!946 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename_str", arg: 3, scope: !940, file: !1, line: 791, type: !145)
!947 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arena", arg: 4, scope: !940, file: !1, line: 792, type: !795)
!948 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !940, file: !1, line: 794, type: !745)
!949 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filename", scope: !940, file: !1, line: 795, type: !121)
!950 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !951, file: !1, line: 800, type: !121)
!951 = distinct !DILexicalBlock(scope: !940, file: !1, line: 800, column: 5)
!952 = !DISubprogram(name: "validate_stmts", scope: !1, file: !1, line: 421, type: !953, isLocal: true, isDefinition: true, scopeLine: 422, flags: DIFlagPrototyped, isOptimized: true, variables: !955)
!953 = !DISubroutineType(types: !954)
!954 = !{!160, !490}
!955 = !{!956, !957, !958}
!956 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seq", arg: 1, scope: !952, file: !1, line: 421, type: !490)
!957 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !952, file: !1, line: 423, type: !160)
!958 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stmt", scope: !959, file: !1, line: 425, type: !810)
!959 = distinct !DILexicalBlock(scope: !960, file: !1, line: 424, column: 45)
!960 = distinct !DILexicalBlock(scope: !961, file: !1, line: 424, column: 5)
!961 = distinct !DILexicalBlock(scope: !952, file: !1, line: 424, column: 5)
!962 = !DISubprogram(name: "validate_stmt", scope: !1, file: !1, line: 309, type: !963, isLocal: true, isDefinition: true, scopeLine: 310, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._stmt*)* @validate_stmt, variables: !965)
!963 = !DISubroutineType(types: !964)
!964 = !{!160, !810}
!965 = !{!966, !967, !968, !979}
!966 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stmt", arg: 1, scope: !962, file: !1, line: 309, type: !810)
!967 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !962, file: !1, line: 311, type: !160)
!968 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !969, file: !1, line: 353, type: !973)
!969 = distinct !DILexicalBlock(scope: !970, file: !1, line: 352, column: 64)
!970 = distinct !DILexicalBlock(scope: !971, file: !1, line: 352, column: 9)
!971 = distinct !DILexicalBlock(scope: !972, file: !1, line: 352, column: 9)
!972 = distinct !DILexicalBlock(scope: !962, file: !1, line: 312, column: 25)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "withitem_ty", file: !4, line: 39, baseType: !974)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DICompositeType(tag: DW_TAG_structure_type, name: "_withitem", file: !4, line: 391, size: 128, align: 64, elements: !976)
!976 = !{!977, !978}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "context_expr", scope: !975, file: !4, line: 392, baseType: !476, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "optional_vars", scope: !975, file: !4, line: 393, baseType: !476, size: 64, align: 64, offset: 64)
!979 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handler", scope: !980, file: !1, line: 383, type: !983)
!980 = distinct !DILexicalBlock(scope: !981, file: !1, line: 382, column: 66)
!981 = distinct !DILexicalBlock(scope: !982, file: !1, line: 382, column: 9)
!982 = distinct !DILexicalBlock(scope: !972, file: !1, line: 382, column: 9)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "excepthandler_ty", file: !4, line: 29, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "_excepthandler", file: !4, line: 351, size: 320, align: 64, elements: !986)
!986 = !{!987, !988, !997, !998}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !985, file: !4, line: 352, baseType: !98, size: 32, align: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !985, file: !4, line: 360, baseType: !989, size: 192, align: 64, offset: 64)
!989 = !DICompositeType(tag: DW_TAG_union_type, scope: !985, file: !4, line: 353, size: 192, align: 64, elements: !990)
!990 = !{!991}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "ExceptHandler", scope: !989, file: !4, line: 358, baseType: !992, size: 192, align: 64)
!992 = !DICompositeType(tag: DW_TAG_structure_type, scope: !989, file: !4, line: 354, size: 192, align: 64, elements: !993)
!993 = !{!994, !995, !996}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !992, file: !4, line: 355, baseType: !476, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !992, file: !4, line: 356, baseType: !473, size: 64, align: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !992, file: !4, line: 357, baseType: !490, size: 64, align: 64, offset: 128)
