; ModuleID = 'bufferedio.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyMethodDef = type { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !423, globals: !1354)
!1 = !DIFile(filename: "./Modules/_io/bufferedio.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !45, !368, !369, !377, !101, !17, !59, !391, !392}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyEnvironmentErrorObject", file: !7, line: 69, baseType: !8)
!7 = !DIFile(filename: "Include/pyerrors.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyOSErrorObject", file: !7, line: 61, baseType: !9)
!9 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 51, size: 832, align: 64, elements: !10)
!10 = !{!11, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !9, file: !7, line: 52, baseType: !12, size: 128, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !13, line: 109, baseType: !14)
!13 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !13, line: 105, size: 128, align: 64, elements: !15)
!15 = !{!16, !24}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !14, file: !13, line: 107, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !18, line: 177, baseType: !19)
!18 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !20, line: 102, baseType: !21)
!20 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !22, line: 181, baseType: !23)
!22 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!23 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !14, file: !13, line: 108, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !13, line: 334, size: 3200, align: 64, elements: !27)
!27 = !{!28, !34, !38, !39, !40, !46, !109, !114, !119, !120, !125, !177, !208, !220, !226, !227, !228, !230, !232, !263, !264, !265, !274, !275, !280, !281, !283, !285, !295, !305, !323, !324, !325, !327, !329, !330, !332, !337, !342, !347, !348, !349, !350, !351, !352, !353, !354, !356}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !26, file: !13, line: 335, baseType: !29, size: 192, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !13, line: 114, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 111, size: 192, align: 64, elements: !31)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !30, file: !13, line: 112, baseType: !12, size: 128, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !30, file: !13, line: 113, baseType: !17, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !26, file: !13, line: 336, baseType: !35, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!37 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !26, file: !13, line: 337, baseType: !17, size: 64, align: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !26, file: !13, line: 337, baseType: !17, size: 64, align: 64, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !26, file: !13, line: 341, baseType: !41, size: 64, align: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !13, line: 308, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !45}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !26, file: !13, line: 342, baseType: !47, size: 64, align: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !13, line: 314, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !45, !52, !51}
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !20, line: 48, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !55, line: 246, size: 1728, align: 64, elements: !56)
!55 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!56 = !{!57, !58, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !78, !79, !80, !81, !83, !85, !87, !91, !94, !96, !97, !98, !99, !100, !104, !105}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !54, file: !55, line: 247, baseType: !51, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !54, file: !55, line: 252, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !54, file: !55, line: 253, baseType: !59, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !54, file: !55, line: 254, baseType: !59, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !54, file: !55, line: 255, baseType: !59, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !54, file: !55, line: 256, baseType: !59, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !54, file: !55, line: 257, baseType: !59, size: 64, align: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !54, file: !55, line: 258, baseType: !59, size: 64, align: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !54, file: !55, line: 259, baseType: !59, size: 64, align: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !54, file: !55, line: 261, baseType: !59, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !54, file: !55, line: 262, baseType: !59, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !54, file: !55, line: 263, baseType: !59, size: 64, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !54, file: !55, line: 265, baseType: !71, size: 64, align: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !55, line: 161, size: 192, align: 64, elements: !73)
!73 = !{!74, !75, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !72, file: !55, line: 162, baseType: !71, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !72, file: !55, line: 163, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !72, file: !55, line: 167, baseType: !51, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !54, file: !55, line: 267, baseType: !76, size: 64, align: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !54, file: !55, line: 269, baseType: !51, size: 32, align: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !54, file: !55, line: 273, baseType: !51, size: 32, align: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !54, file: !55, line: 275, baseType: !82, size: 64, align: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !22, line: 140, baseType: !23)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !54, file: !55, line: 279, baseType: !84, size: 16, align: 16, offset: 1024)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !54, file: !55, line: 280, baseType: !86, size: 8, align: 8, offset: 1040)
!86 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !54, file: !55, line: 281, baseType: !88, size: 8, align: 8, offset: 1048)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !54, file: !55, line: 285, baseType: !92, size: 64, align: 64, offset: 1088)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !55, line: 155, baseType: null)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !54, file: !55, line: 294, baseType: !95, size: 64, align: 64, offset: 1152)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !22, line: 141, baseType: !23)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !54, file: !55, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !54, file: !55, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !54, file: !55, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !54, file: !55, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !54, file: !55, line: 307, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !54, file: !55, line: 309, baseType: !51, size: 32, align: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !54, file: !55, line: 311, baseType: !106, size: 160, align: 8, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 160, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !26, file: !13, line: 343, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !13, line: 316, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!45, !45, !59}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !26, file: !13, line: 344, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !13, line: 318, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!51, !45, !59, !45}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !26, file: !13, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !26, file: !13, line: 346, baseType: !121, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !13, line: 320, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!45, !45}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !26, file: !13, line: 350, baseType: !126, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !13, line: 278, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 236, size: 2176, align: 64, elements: !129)
!129 = !{!130, !135, !136, !137, !138, !139, !144, !146, !147, !148, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !128, file: !13, line: 241, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !13, line: 166, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!45, !45, !45}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !128, file: !13, line: 242, baseType: !131, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !128, file: !13, line: 243, baseType: !131, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !128, file: !13, line: 244, baseType: !131, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !128, file: !13, line: 245, baseType: !131, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !128, file: !13, line: 246, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !13, line: 167, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!45, !45, !45, !45}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !128, file: !13, line: 247, baseType: !145, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !13, line: 165, baseType: !122)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !128, file: !13, line: 248, baseType: !145, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !128, file: !13, line: 249, baseType: !145, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !128, file: !13, line: 250, baseType: !149, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !13, line: 168, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!51, !45}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !128, file: !13, line: 251, baseType: !145, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !128, file: !13, line: 252, baseType: !131, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !128, file: !13, line: 253, baseType: !131, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !128, file: !13, line: 254, baseType: !131, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !128, file: !13, line: 255, baseType: !131, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !128, file: !13, line: 256, baseType: !131, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !128, file: !13, line: 257, baseType: !145, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !128, file: !13, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !128, file: !13, line: 259, baseType: !145, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !128, file: !13, line: 261, baseType: !131, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !128, file: !13, line: 262, baseType: !131, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !128, file: !13, line: 263, baseType: !131, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !128, file: !13, line: 264, baseType: !131, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !128, file: !13, line: 265, baseType: !140, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !128, file: !13, line: 266, baseType: !131, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !128, file: !13, line: 267, baseType: !131, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !128, file: !13, line: 268, baseType: !131, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !128, file: !13, line: 269, baseType: !131, size: 64, align: 64, offset: 1728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !128, file: !13, line: 270, baseType: !131, size: 64, align: 64, offset: 1792)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !128, file: !13, line: 272, baseType: !131, size: 64, align: 64, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !128, file: !13, line: 273, baseType: !131, size: 64, align: 64, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !128, file: !13, line: 274, baseType: !131, size: 64, align: 64, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !128, file: !13, line: 275, baseType: !131, size: 64, align: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !128, file: !13, line: 277, baseType: !145, size: 64, align: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !26, file: !13, line: 351, baseType: !178, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !13, line: 292, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 280, size: 640, align: 64, elements: !181)
!181 = !{!182, !187, !188, !193, !194, !195, !200, !201, !206, !207}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !180, file: !13, line: 281, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !13, line: 169, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!17, !45}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !180, file: !13, line: 282, baseType: !131, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !180, file: !13, line: 283, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !13, line: 170, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!45, !45, !17}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !180, file: !13, line: 284, baseType: !189, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !180, file: !13, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !180, file: !13, line: 286, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !13, line: 172, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!51, !45, !17, !45}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !180, file: !13, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !180, file: !13, line: 288, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !13, line: 231, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!51, !45, !45}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !180, file: !13, line: 290, baseType: !131, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !180, file: !13, line: 291, baseType: !189, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !26, file: !13, line: 352, baseType: !209, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !13, line: 298, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 294, size: 192, align: 64, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !211, file: !13, line: 295, baseType: !183, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !211, file: !13, line: 296, baseType: !131, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !211, file: !13, line: 297, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !13, line: 174, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!51, !45, !45, !45}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !26, file: !13, line: 356, baseType: !221, size: 64, align: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !13, line: 321, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !45}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !18, line: 186, baseType: !17)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !26, file: !13, line: 357, baseType: !140, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !26, file: !13, line: 358, baseType: !121, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !26, file: !13, line: 359, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !13, line: 317, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !26, file: !13, line: 360, baseType: !231, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !13, line: 319, baseType: !217)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !26, file: !13, line: 363, baseType: !233, size: 64, align: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !13, line: 304, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 301, size: 128, align: 64, elements: !236)
!236 = !{!237, !258}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !235, file: !13, line: 302, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !13, line: 193, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!51, !45, !242, !51}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !13, line: 191, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !13, line: 178, size: 640, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !255, !256, !257}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !244, file: !13, line: 179, baseType: !4, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !244, file: !13, line: 180, baseType: !45, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !13, line: 181, baseType: !17, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !244, file: !13, line: 182, baseType: !17, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !244, file: !13, line: 184, baseType: !51, size: 32, align: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !244, file: !13, line: 185, baseType: !51, size: 32, align: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !244, file: !13, line: 186, baseType: !59, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !244, file: !13, line: 187, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !244, file: !13, line: 188, baseType: !254, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !244, file: !13, line: 189, baseType: !254, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !244, file: !13, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !235, file: !13, line: 303, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !13, line: 194, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !45, !242}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !26, file: !13, line: 366, baseType: !103, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !26, file: !13, line: 368, baseType: !35, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !26, file: !13, line: 372, baseType: !266, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !13, line: 233, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!51, !45, !270, !4}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !13, line: 232, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!51, !45, !4}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !26, file: !13, line: 375, baseType: !149, size: 64, align: 64, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !26, file: !13, line: 379, baseType: !276, size: 64, align: 64, offset: 1600)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !13, line: 322, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!45, !45, !45, !51}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !26, file: !13, line: 382, baseType: !17, size: 64, align: 64, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !26, file: !13, line: 385, baseType: !282, size: 64, align: 64, offset: 1728)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !13, line: 323, baseType: !122)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !26, file: !13, line: 386, baseType: !284, size: 64, align: 64, offset: 1792)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !13, line: 324, baseType: !122)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !26, file: !13, line: 389, baseType: !286, size: 64, align: 64, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 40, size: 256, align: 64, elements: !289)
!288 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 41, baseType: !35, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 18, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 43, baseType: !51, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 45, baseType: !35, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !26, file: !13, line: 390, baseType: !296, size: 64, align: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !298, line: 18, size: 320, align: 64, elements: !299)
!298 = !DIFile(filename: "Include/structmember.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!299 = !{!300, !301, !302, !303, !304}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !297, file: !298, line: 19, baseType: !59, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !297, file: !298, line: 20, baseType: !51, size: 32, align: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !297, file: !298, line: 21, baseType: !17, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !297, file: !298, line: 22, baseType: !51, size: 32, align: 32, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !297, file: !298, line: 23, baseType: !59, size: 64, align: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !26, file: !13, line: 391, baseType: !306, size: 64, align: 64, offset: 1984)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !308, line: 11, size: 320, align: 64, elements: !309)
!308 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!309 = !{!310, !311, !316, !321, !322}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !307, file: !308, line: 12, baseType: !59, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !307, file: !308, line: 13, baseType: !312, size: 64, align: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !308, line: 8, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!45, !45, !4}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !307, file: !308, line: 14, baseType: !317, size: 64, align: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !308, line: 9, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!51, !45, !45, !4}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !307, file: !308, line: 15, baseType: !59, size: 64, align: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !307, file: !308, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !26, file: !13, line: 392, baseType: !25, size: 64, align: 64, offset: 2048)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !26, file: !13, line: 393, baseType: !45, size: 64, align: 64, offset: 2112)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !26, file: !13, line: 394, baseType: !326, size: 64, align: 64, offset: 2176)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !13, line: 325, baseType: !141)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !26, file: !13, line: 395, baseType: !328, size: 64, align: 64, offset: 2240)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !13, line: 326, baseType: !217)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !26, file: !13, line: 396, baseType: !17, size: 64, align: 64, offset: 2304)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !26, file: !13, line: 397, baseType: !331, size: 64, align: 64, offset: 2368)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !13, line: 327, baseType: !217)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !26, file: !13, line: 398, baseType: !333, size: 64, align: 64, offset: 2432)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !13, line: 329, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!45, !25, !17}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !26, file: !13, line: 399, baseType: !338, size: 64, align: 64, offset: 2496)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !13, line: 328, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!45, !25, !45, !45}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !26, file: !13, line: 400, baseType: !343, size: 64, align: 64, offset: 2560)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !13, line: 307, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !4}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !26, file: !13, line: 401, baseType: !149, size: 64, align: 64, offset: 2624)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !26, file: !13, line: 402, baseType: !45, size: 64, align: 64, offset: 2688)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !26, file: !13, line: 403, baseType: !45, size: 64, align: 64, offset: 2752)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !26, file: !13, line: 404, baseType: !45, size: 64, align: 64, offset: 2816)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !26, file: !13, line: 405, baseType: !45, size: 64, align: 64, offset: 2880)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !26, file: !13, line: 406, baseType: !45, size: 64, align: 64, offset: 2944)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !26, file: !13, line: 407, baseType: !41, size: 64, align: 64, offset: 3008)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !26, file: !13, line: 410, baseType: !355, size: 32, align: 32, offset: 3072)
!355 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !26, file: !13, line: 412, baseType: !41, size: 64, align: 64, offset: 3136)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !9, file: !7, line: 52, baseType: !45, size: 64, align: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !9, file: !7, line: 52, baseType: !45, size: 64, align: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !9, file: !7, line: 52, baseType: !45, size: 64, align: 64, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !9, file: !7, line: 52, baseType: !45, size: 64, align: 64, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !9, file: !7, line: 52, baseType: !45, size: 64, align: 64, offset: 384)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !9, file: !7, line: 52, baseType: !37, size: 8, align: 8, offset: 448)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "myerrno", scope: !9, file: !7, line: 53, baseType: !45, size: 64, align: 64, offset: 512)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "strerror", scope: !9, file: !7, line: 54, baseType: !45, size: 64, align: 64, offset: 576)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !9, file: !7, line: 55, baseType: !45, size: 64, align: 64, offset: 640)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "filename2", scope: !9, file: !7, line: 56, baseType: !45, size: 64, align: 64, offset: 704)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !9, file: !7, line: 60, baseType: !17, size: 64, align: 64, offset: 768)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !371, line: 41, baseType: !372)
!371 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!372 = !DICompositeType(tag: DW_TAG_structure_type, file: !371, line: 31, size: 320, align: 64, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !372, file: !371, line: 32, baseType: !29, size: 192, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !372, file: !371, line: 33, baseType: !225, size: 64, align: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !372, file: !371, line: 34, baseType: !88, size: 8, align: 8, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !379, line: 253, baseType: !380)
!379 = !DIFile(filename: "Include/objimpl.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!380 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !379, line: 246, size: 192, align: 64, elements: !381)
!381 = !{!382, !389}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !380, file: !379, line: 251, baseType: !383, size: 192, align: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, scope: !380, file: !379, line: 247, size: 192, align: 64, elements: !384)
!384 = !{!385, !387, !388}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !383, file: !379, line: 248, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !383, file: !379, line: 249, baseType: !386, size: 64, align: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !383, file: !379, line: 250, baseType: !17, size: 64, align: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !380, file: !379, line: 252, baseType: !390, size: 64, align: 64)
!390 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "buffered", file: !1, line: 271, baseType: !394)
!394 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 227, size: 1216, align: 64, elements: !395)
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403, !404, !408, !409, !410, !411, !412, !413, !414, !417, !419, !420, !421, !422}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !394, file: !1, line: 228, baseType: !12, size: 128, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !394, file: !1, line: 230, baseType: !45, size: 64, align: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !394, file: !1, line: 231, baseType: !51, size: 32, align: 32, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !394, file: !1, line: 232, baseType: !51, size: 32, align: 32, offset: 224)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "readable", scope: !394, file: !1, line: 233, baseType: !51, size: 32, align: 32, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "writable", scope: !394, file: !1, line: 234, baseType: !51, size: 32, align: 32, offset: 288)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "finalizing", scope: !394, file: !1, line: 235, baseType: !37, size: 8, align: 8, offset: 320)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "fast_closed_checks", scope: !394, file: !1, line: 239, baseType: !51, size: 32, align: 32, offset: 352)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "abs_pos", scope: !394, file: !1, line: 242, baseType: !405, size: 64, align: 64, offset: 384)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_off_t", file: !406, line: 94, baseType: !407)
!406 = !DIFile(filename: "./Modules/_io/_iomodule.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !20, line: 92, baseType: !95)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !394, file: !1, line: 245, baseType: !59, size: 64, align: 64, offset: 448)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !394, file: !1, line: 247, baseType: !405, size: 64, align: 64, offset: 512)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "raw_pos", scope: !394, file: !1, line: 249, baseType: !405, size: 64, align: 64, offset: 576)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "read_end", scope: !394, file: !1, line: 253, baseType: !405, size: 64, align: 64, offset: 640)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !394, file: !1, line: 256, baseType: !405, size: 64, align: 64, offset: 704)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "write_end", scope: !394, file: !1, line: 259, baseType: !405, size: 64, align: 64, offset: 768)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !394, file: !1, line: 262, baseType: !415, size: 64, align: 64, offset: 832)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThread_type_lock", file: !416, line: 5, baseType: !4)
!416 = !DIFile(filename: "Include/pythread.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!417 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !394, file: !1, line: 263, baseType: !418, size: 64, align: 64, offset: 896)
!418 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !23)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !394, file: !1, line: 266, baseType: !17, size: 64, align: 64, offset: 960)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_mask", scope: !394, file: !1, line: 267, baseType: !17, size: 64, align: 64, offset: 1024)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !394, file: !1, line: 269, baseType: !45, size: 64, align: 64, offset: 1088)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !394, file: !1, line: 270, baseType: !45, size: 64, align: 64, offset: 1152)
!423 = !{!424, !443, !446, !459, !463, !467, !484, !488, !507, !518, !533, !550, !567, !637, !644, !707, !716, !722, !742, !754, !757, !778, !781, !789, !806, !816, !820, !857, !861, !865, !869, !873, !877, !887, !891, !901, !943, !951, !982, !996, !1001, !1017, !1034, !1039, !1063, !1072, !1077, !1091, !1098, !1102, !1106, !1110, !1129, !1133, !1154, !1162, !1167, !1181, !1215, !1226, !1249, !1255, !1274, !1278, !1282, !1286, !1290, !1294, !1298, !1302, !1309, !1316, !1322, !1340}
!424 = !DISubprogram(name: "_PyIO_trap_eintr", scope: !1, file: !1, line: 805, type: !425, isLocal: false, isDefinition: true, scopeLine: 806, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @_PyIO_trap_eintr, variables: !427)
!425 = !DISubroutineType(types: !426)
!426 = !{!51}
!427 = !{!428, !429, !430, !431, !432, !436, !438, !440}
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typ", scope: !424, file: !1, line: 808, type: !45)
!429 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !424, file: !1, line: 808, type: !45)
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !424, file: !1, line: 808, type: !45)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "env_err", scope: !424, file: !1, line: 809, type: !5)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !433, file: !1, line: 823, type: !45)
!433 = distinct !DILexicalBlock(scope: !434, file: !1, line: 823, column: 9)
!434 = distinct !DILexicalBlock(scope: !435, file: !1, line: 822, column: 75)
!435 = distinct !DILexicalBlock(scope: !424, file: !1, line: 821, column: 9)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !437, file: !1, line: 824, type: !45)
!437 = distinct !DILexicalBlock(scope: !434, file: !1, line: 824, column: 9)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !439, file: !1, line: 825, type: !45)
!439 = distinct !DILexicalBlock(scope: !434, file: !1, line: 825, column: 9)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !441, file: !1, line: 825, type: !45)
!441 = distinct !DILexicalBlock(scope: !442, file: !1, line: 825, column: 9)
!442 = distinct !DILexicalBlock(scope: !439, file: !1, line: 825, column: 9)
!443 = !DISubprogram(name: "bufferediobase_detach", scope: !1, file: !1, line: 107, type: !123, isLocal: true, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @bufferediobase_detach, variables: !444)
!444 = !{!445}
!445 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !443, file: !1, line: 107, type: !45)
!446 = !DISubprogram(name: "bufferediobase_unsupported", scope: !1, file: !1, line: 92, type: !447, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, variables: !449)
!447 = !DISubroutineType(types: !448)
!448 = !{!45, !35}
!449 = !{!450, !451}
!450 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "message", arg: 1, scope: !446, file: !1, line: 92, type: !35)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !446, file: !1, line: 94, type: !452)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyIO_State", file: !406, line: 135, baseType: !454)
!454 = !DICompositeType(tag: DW_TAG_structure_type, file: !406, line: 130, size: 192, align: 64, elements: !455)
!455 = !{!456, !457, !458}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !454, file: !406, line: 131, baseType: !51, size: 32, align: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "locale_module", scope: !454, file: !406, line: 132, baseType: !45, size: 64, align: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "unsupported_operation", scope: !454, file: !406, line: 134, baseType: !45, size: 64, align: 64, offset: 128)
!459 = !DISubprogram(name: "bufferediobase_read", scope: !1, file: !1, line: 131, type: !133, isLocal: true, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @bufferediobase_read, variables: !460)
!460 = !{!461, !462}
!461 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !459, file: !1, line: 131, type: !45)
!462 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !459, file: !1, line: 131, type: !45)
!463 = !DISubprogram(name: "bufferediobase_read1", scope: !1, file: !1, line: 144, type: !133, isLocal: true, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @bufferediobase_read1, variables: !464)
!464 = !{!465, !466}
!465 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !463, file: !1, line: 144, type: !45)
!466 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !463, file: !1, line: 144, type: !45)
!467 = !DISubprogram(name: "bufferediobase_readinto", scope: !1, file: !1, line: 50, type: !133, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @bufferediobase_readinto, variables: !468)
!468 = !{!469, !470, !471, !472, !473, !474, !478, !482}
!469 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !467, file: !1, line: 50, type: !45)
!470 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !467, file: !1, line: 50, type: !45)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !467, file: !1, line: 52, type: !243)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !467, file: !1, line: 53, type: !17)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !467, file: !1, line: 54, type: !45)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !475, file: !1, line: 65, type: !45)
!475 = distinct !DILexicalBlock(scope: !476, file: !1, line: 65, column: 9)
!476 = distinct !DILexicalBlock(scope: !477, file: !1, line: 64, column: 31)
!477 = distinct !DILexicalBlock(scope: !467, file: !1, line: 64, column: 9)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !479, file: !1, line: 76, type: !45)
!479 = distinct !DILexicalBlock(scope: !480, file: !1, line: 76, column: 9)
!480 = distinct !DILexicalBlock(scope: !481, file: !1, line: 71, column: 24)
!481 = distinct !DILexicalBlock(scope: !467, file: !1, line: 71, column: 9)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !483, file: !1, line: 82, type: !45)
!483 = distinct !DILexicalBlock(scope: !467, file: !1, line: 82, column: 5)
!484 = !DISubprogram(name: "bufferediobase_write", scope: !1, file: !1, line: 159, type: !133, isLocal: true, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @bufferediobase_write, variables: !485)
!485 = !{!486, !487}
!486 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !484, file: !1, line: 159, type: !45)
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !484, file: !1, line: 159, type: !45)
!488 = !DISubprogram(name: "buffered_dealloc", scope: !1, file: !1, line: 397, type: !489, isLocal: true, isDefinition: true, scopeLine: 398, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.buffered*)* @buffered_dealloc, variables: !491)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !392}
!491 = !{!492, !493, !495, !497, !501, !503}
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !488, file: !1, line: 397, type: !392)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !494, file: !1, line: 402, type: !377)
!494 = distinct !DILexicalBlock(scope: !488, file: !1, line: 402, column: 5)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !496, file: !1, line: 406, type: !45)
!496 = distinct !DILexicalBlock(scope: !488, file: !1, line: 406, column: 5)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !498, file: !1, line: 406, type: !45)
!498 = distinct !DILexicalBlock(scope: !499, file: !1, line: 406, column: 5)
!499 = distinct !DILexicalBlock(scope: !500, file: !1, line: 406, column: 5)
!500 = distinct !DILexicalBlock(scope: !496, file: !1, line: 406, column: 5)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !502, file: !1, line: 417, type: !45)
!502 = distinct !DILexicalBlock(scope: !488, file: !1, line: 417, column: 5)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !504, file: !1, line: 417, type: !45)
!504 = distinct !DILexicalBlock(scope: !505, file: !1, line: 417, column: 5)
!505 = distinct !DILexicalBlock(scope: !506, file: !1, line: 417, column: 5)
!506 = distinct !DILexicalBlock(scope: !502, file: !1, line: 417, column: 5)
!507 = !DISubprogram(name: "buffered_repr", scope: !1, file: !1, line: 1367, type: !508, isLocal: true, isDefinition: true, scopeLine: 1368, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*)* @buffered_repr, variables: !510)
!508 = !DISubroutineType(types: !509)
!509 = !{!45, !392}
!510 = !{!511, !512, !513, !514}
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !507, file: !1, line: 1367, type: !392)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nameobj", scope: !507, file: !1, line: 1369, type: !45)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !507, file: !1, line: 1369, type: !45)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !515, file: !1, line: 1382, type: !45)
!515 = distinct !DILexicalBlock(scope: !516, file: !1, line: 1382, column: 9)
!516 = distinct !DILexicalBlock(scope: !517, file: !1, line: 1379, column: 10)
!517 = distinct !DILexicalBlock(scope: !507, file: !1, line: 1372, column: 9)
!518 = !DISubprogram(name: "buffered_traverse", scope: !1, file: !1, line: 433, type: !519, isLocal: true, isDefinition: true, scopeLine: 434, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.buffered*, i32 (%struct._object*, i8*)*, i8*)* @buffered_traverse, variables: !521)
!519 = !DISubroutineType(types: !520)
!520 = !{!51, !392, !270, !4}
!521 = !{!522, !523, !524, !525, !529}
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !518, file: !1, line: 433, type: !392)
!523 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !518, file: !1, line: 433, type: !270)
!524 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !518, file: !1, line: 433, type: !4)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !526, file: !1, line: 435, type: !51)
!526 = distinct !DILexicalBlock(scope: !527, file: !1, line: 435, column: 5)
!527 = distinct !DILexicalBlock(scope: !528, file: !1, line: 435, column: 5)
!528 = distinct !DILexicalBlock(scope: !518, file: !1, line: 435, column: 5)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !530, file: !1, line: 436, type: !51)
!530 = distinct !DILexicalBlock(scope: !531, file: !1, line: 436, column: 5)
!531 = distinct !DILexicalBlock(scope: !532, file: !1, line: 436, column: 5)
!532 = distinct !DILexicalBlock(scope: !518, file: !1, line: 436, column: 5)
!533 = !DISubprogram(name: "buffered_clear", scope: !1, file: !1, line: 441, type: !534, isLocal: true, isDefinition: true, scopeLine: 442, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.buffered*)* @buffered_clear, variables: !536)
!534 = !DISubroutineType(types: !535)
!535 = !{!51, !392}
!536 = !{!537, !538, !540, !544, !546}
!537 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !533, file: !1, line: 441, type: !392)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !539, file: !1, line: 444, type: !45)
!539 = distinct !DILexicalBlock(scope: !533, file: !1, line: 444, column: 5)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !541, file: !1, line: 444, type: !45)
!541 = distinct !DILexicalBlock(scope: !542, file: !1, line: 444, column: 5)
!542 = distinct !DILexicalBlock(scope: !543, file: !1, line: 444, column: 5)
!543 = distinct !DILexicalBlock(scope: !539, file: !1, line: 444, column: 5)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !545, file: !1, line: 445, type: !45)
!545 = distinct !DILexicalBlock(scope: !533, file: !1, line: 445, column: 5)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !547, file: !1, line: 445, type: !45)
!547 = distinct !DILexicalBlock(scope: !548, file: !1, line: 445, column: 5)
!548 = distinct !DILexicalBlock(scope: !549, file: !1, line: 445, column: 5)
!549 = distinct !DILexicalBlock(scope: !545, file: !1, line: 445, column: 5)
!550 = !DISubprogram(name: "buffered_iternext", scope: !1, file: !1, line: 1329, type: !508, isLocal: true, isDefinition: true, scopeLine: 1330, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*)* @buffered_iternext, variables: !551)
!551 = !{!552, !553, !554, !557, !563}
!552 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !550, file: !1, line: 1329, type: !392)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !550, file: !1, line: 1331, type: !45)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tp", scope: !550, file: !1, line: 1332, type: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !13, line: 422, baseType: !26)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !558, file: !1, line: 1349, type: !45)
!558 = distinct !DILexicalBlock(scope: !559, file: !1, line: 1349, column: 13)
!559 = distinct !DILexicalBlock(scope: !560, file: !1, line: 1345, column: 43)
!560 = distinct !DILexicalBlock(scope: !561, file: !1, line: 1345, column: 13)
!561 = distinct !DILexicalBlock(scope: !562, file: !1, line: 1342, column: 10)
!562 = distinct !DILexicalBlock(scope: !550, file: !1, line: 1337, column: 9)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !564, file: !1, line: 1359, type: !45)
!564 = distinct !DILexicalBlock(scope: !565, file: !1, line: 1359, column: 9)
!565 = distinct !DILexicalBlock(scope: !566, file: !1, line: 1357, column: 38)
!566 = distinct !DILexicalBlock(scope: !550, file: !1, line: 1357, column: 9)
!567 = !DISubprogram(name: "_buffered_readline", scope: !1, file: !1, line: 1068, type: !568, isLocal: true, isDefinition: true, scopeLine: 1069, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, i64)* @_buffered_readline, variables: !570)
!568 = !DISubroutineType(types: !569)
!569 = !{!45, !392, !17}
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !586, !590, !592, !596, !599, !601, !608, !612, !614, !618, !622, !626, !628, !632, !634}
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !567, file: !1, line: 1068, type: !392)
!572 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "limit", arg: 2, scope: !567, file: !1, line: 1068, type: !17)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !567, file: !1, line: 1070, type: !45)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chunks", scope: !567, file: !1, line: 1071, type: !45)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !567, file: !1, line: 1072, type: !17)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "written", scope: !567, file: !1, line: 1072, type: !17)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !567, file: !1, line: 1073, type: !35)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !567, file: !1, line: 1073, type: !35)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !567, file: !1, line: 1073, type: !35)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !581, file: !1, line: 1110, type: !45)
!581 = distinct !DILexicalBlock(scope: !582, file: !1, line: 1110, column: 13)
!582 = distinct !DILexicalBlock(scope: !583, file: !1, line: 1109, column: 45)
!583 = distinct !DILexicalBlock(scope: !584, file: !1, line: 1109, column: 13)
!584 = distinct !DILexicalBlock(scope: !585, file: !1, line: 1105, column: 16)
!585 = distinct !DILexicalBlock(scope: !567, file: !1, line: 1105, column: 9)
!586 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !587, file: !1, line: 1110, type: !45)
!587 = distinct !DILexicalBlock(scope: !588, file: !1, line: 1110, column: 13)
!588 = distinct !DILexicalBlock(scope: !589, file: !1, line: 1110, column: 13)
!589 = distinct !DILexicalBlock(scope: !581, file: !1, line: 1110, column: 13)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !591, file: !1, line: 1113, type: !45)
!591 = distinct !DILexicalBlock(scope: !584, file: !1, line: 1113, column: 9)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !593, file: !1, line: 1113, type: !45)
!593 = distinct !DILexicalBlock(scope: !594, file: !1, line: 1113, column: 9)
!594 = distinct !DILexicalBlock(scope: !595, file: !1, line: 1113, column: 9)
!595 = distinct !DILexicalBlock(scope: !591, file: !1, line: 1113, column: 9)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !597, file: !1, line: 1120, type: !45)
!597 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1119, column: 25)
!598 = distinct !DILexicalBlock(scope: !567, file: !1, line: 1119, column: 9)
!599 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !600, file: !1, line: 1123, type: !45)
!600 = distinct !DILexicalBlock(scope: !597, file: !1, line: 1123, column: 9)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !602, file: !1, line: 1155, type: !45)
!602 = distinct !DILexicalBlock(scope: !603, file: !1, line: 1155, column: 13)
!603 = distinct !DILexicalBlock(scope: !604, file: !1, line: 1154, column: 45)
!604 = distinct !DILexicalBlock(scope: !605, file: !1, line: 1154, column: 13)
!605 = distinct !DILexicalBlock(scope: !606, file: !1, line: 1126, column: 14)
!606 = distinct !DILexicalBlock(scope: !607, file: !1, line: 1126, column: 5)
!607 = distinct !DILexicalBlock(scope: !567, file: !1, line: 1126, column: 5)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !609, file: !1, line: 1155, type: !45)
!609 = distinct !DILexicalBlock(scope: !610, file: !1, line: 1155, column: 13)
!610 = distinct !DILexicalBlock(scope: !611, file: !1, line: 1155, column: 13)
!611 = distinct !DILexicalBlock(scope: !602, file: !1, line: 1155, column: 13)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !613, file: !1, line: 1158, type: !45)
!613 = distinct !DILexicalBlock(scope: !605, file: !1, line: 1158, column: 9)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !615, file: !1, line: 1158, type: !45)
!615 = distinct !DILexicalBlock(scope: !616, file: !1, line: 1158, column: 9)
!616 = distinct !DILexicalBlock(scope: !617, file: !1, line: 1158, column: 9)
!617 = distinct !DILexicalBlock(scope: !613, file: !1, line: 1158, column: 9)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !619, file: !1, line: 1165, type: !45)
!619 = distinct !DILexicalBlock(scope: !620, file: !1, line: 1165, column: 9)
!620 = distinct !DILexicalBlock(scope: !621, file: !1, line: 1164, column: 56)
!621 = distinct !DILexicalBlock(scope: !567, file: !1, line: 1164, column: 9)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !623, file: !1, line: 1165, type: !45)
!623 = distinct !DILexicalBlock(scope: !624, file: !1, line: 1165, column: 9)
!624 = distinct !DILexicalBlock(scope: !625, file: !1, line: 1165, column: 9)
!625 = distinct !DILexicalBlock(scope: !619, file: !1, line: 1165, column: 9)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !627, file: !1, line: 1168, type: !45)
!627 = distinct !DILexicalBlock(scope: !567, file: !1, line: 1168, column: 5)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !629, file: !1, line: 1168, type: !45)
!629 = distinct !DILexicalBlock(scope: !630, file: !1, line: 1168, column: 5)
!630 = distinct !DILexicalBlock(scope: !631, file: !1, line: 1168, column: 5)
!631 = distinct !DILexicalBlock(scope: !627, file: !1, line: 1168, column: 5)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !633, file: !1, line: 1174, type: !45)
!633 = distinct !DILexicalBlock(scope: !567, file: !1, line: 1174, column: 5)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !635, file: !1, line: 1174, type: !45)
!635 = distinct !DILexicalBlock(scope: !636, file: !1, line: 1174, column: 5)
!636 = distinct !DILexicalBlock(scope: !633, file: !1, line: 1174, column: 5)
!637 = !DISubprogram(name: "buffered_closed", scope: !1, file: !1, line: 482, type: !534, isLocal: true, isDefinition: true, scopeLine: 483, flags: DIFlagPrototyped, isOptimized: true, variables: !638)
!638 = !{!639, !640, !641, !642}
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !637, file: !1, line: 482, type: !392)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "closed", scope: !637, file: !1, line: 484, type: !51)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !637, file: !1, line: 485, type: !45)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !643, file: !1, line: 491, type: !45)
!643 = distinct !DILexicalBlock(scope: !637, file: !1, line: 491, column: 5)
!644 = !DISubprogram(name: "_enter_buffered_busy", scope: !1, file: !1, line: 301, type: !534, isLocal: true, isDefinition: true, scopeLine: 302, flags: DIFlagPrototyped, isOptimized: true, variables: !645)
!645 = !{!646, !647}
!646 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !644, file: !1, line: 301, type: !392)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !648, file: !1, line: 308, type: !649)
!648 = distinct !DILexicalBlock(scope: !644, file: !1, line: 308, column: 5)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !651, line: 139, baseType: !652)
!651 = !DIFile(filename: "Include/pystate.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !651, line: 69, size: 1536, align: 64, elements: !653)
!653 = !{!654, !656, !657, !677, !680, !681, !682, !683, !684, !685, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !652, file: !651, line: 72, baseType: !655, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64, align: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !652, file: !651, line: 73, baseType: !655, size: 64, align: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !652, file: !651, line: 74, baseType: !658, size: 64, align: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !651, line: 44, baseType: !660)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !651, line: 19, size: 832, align: 64, elements: !661)
!661 = !{!662, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !660, file: !651, line: 21, baseType: !663, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !660, file: !651, line: 22, baseType: !655, size: 64, align: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !660, file: !651, line: 24, baseType: !45, size: 64, align: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !660, file: !651, line: 25, baseType: !45, size: 64, align: 64, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !660, file: !651, line: 26, baseType: !45, size: 64, align: 64, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !660, file: !651, line: 27, baseType: !45, size: 64, align: 64, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !660, file: !651, line: 28, baseType: !45, size: 64, align: 64, offset: 384)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !660, file: !651, line: 30, baseType: !45, size: 64, align: 64, offset: 448)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !660, file: !651, line: 31, baseType: !45, size: 64, align: 64, offset: 512)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !660, file: !651, line: 32, baseType: !45, size: 64, align: 64, offset: 576)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !660, file: !651, line: 33, baseType: !51, size: 32, align: 32, offset: 640)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !660, file: !651, line: 34, baseType: !51, size: 32, align: 32, offset: 672)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !660, file: !651, line: 37, baseType: !51, size: 32, align: 32, offset: 704)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !660, file: !651, line: 43, baseType: !45, size: 64, align: 64, offset: 768)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !652, file: !651, line: 76, baseType: !678, size: 64, align: 64, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64, align: 64)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !651, line: 50, flags: DIFlagFwdDecl)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !652, file: !651, line: 77, baseType: !51, size: 32, align: 32, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !652, file: !651, line: 78, baseType: !37, size: 8, align: 8, offset: 288)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !652, file: !651, line: 80, baseType: !37, size: 8, align: 8, offset: 296)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !652, file: !651, line: 85, baseType: !51, size: 32, align: 32, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !652, file: !651, line: 86, baseType: !51, size: 32, align: 32, offset: 352)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !652, file: !651, line: 88, baseType: !686, size: 64, align: 64, offset: 384)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !651, line: 54, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64, align: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!51, !45, !678, !51, !45}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !652, file: !651, line: 89, baseType: !686, size: 64, align: 64, offset: 448)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !652, file: !651, line: 90, baseType: !45, size: 64, align: 64, offset: 512)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !652, file: !651, line: 91, baseType: !45, size: 64, align: 64, offset: 576)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !652, file: !651, line: 93, baseType: !45, size: 64, align: 64, offset: 640)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !652, file: !651, line: 94, baseType: !45, size: 64, align: 64, offset: 704)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !652, file: !651, line: 95, baseType: !45, size: 64, align: 64, offset: 768)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !652, file: !651, line: 97, baseType: !45, size: 64, align: 64, offset: 832)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !652, file: !651, line: 98, baseType: !45, size: 64, align: 64, offset: 896)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !652, file: !651, line: 99, baseType: !45, size: 64, align: 64, offset: 960)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !652, file: !651, line: 101, baseType: !45, size: 64, align: 64, offset: 1024)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !652, file: !651, line: 103, baseType: !51, size: 32, align: 32, offset: 1088)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !652, file: !651, line: 105, baseType: !45, size: 64, align: 64, offset: 1152)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !652, file: !651, line: 106, baseType: !23, size: 64, align: 64, offset: 1216)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !652, file: !651, line: 108, baseType: !51, size: 32, align: 32, offset: 1280)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !652, file: !651, line: 109, baseType: !45, size: 64, align: 64, offset: 1344)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !652, file: !651, line: 134, baseType: !344, size: 64, align: 64, offset: 1408)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !652, file: !651, line: 135, baseType: !4, size: 64, align: 64, offset: 1472)
!707 = !DISubprogram(name: "buffered_flush_and_rewind_unlocked", scope: !1, file: !1, line: 838, type: !508, isLocal: true, isDefinition: true, scopeLine: 839, flags: DIFlagPrototyped, isOptimized: true, variables: !708)
!708 = !{!709, !710, !711, !713}
!709 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !707, file: !1, line: 838, type: !392)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !707, file: !1, line: 840, type: !45)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !712, file: !1, line: 845, type: !45)
!712 = distinct !DILexicalBlock(scope: !707, file: !1, line: 845, column: 5)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !714, file: !1, line: 850, type: !405)
!714 = distinct !DILexicalBlock(scope: !715, file: !1, line: 847, column: 25)
!715 = distinct !DILexicalBlock(scope: !707, file: !1, line: 847, column: 9)
!716 = !DISubprogram(name: "_bufferedwriter_flush_unlocked", scope: !1, file: !1, line: 1933, type: !508, isLocal: true, isDefinition: true, scopeLine: 1934, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*)* @_bufferedwriter_flush_unlocked, variables: !717)
!717 = !{!718, !719, !720, !721}
!718 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !716, file: !1, line: 1933, type: !392)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "written", scope: !716, file: !1, line: 1935, type: !17)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !716, file: !1, line: 1936, type: !405)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rewind", scope: !716, file: !1, line: 1936, type: !405)
!722 = !DISubprogram(name: "_bufferedwriter_raw_write", scope: !1, file: !1, line: 1884, type: !723, isLocal: true, isDefinition: true, scopeLine: 1885, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.buffered*, i8*, i64)* @_bufferedwriter_raw_write, variables: !725)
!723 = !DISubroutineType(types: !724)
!724 = !{!17, !392, !59, !17}
!725 = !{!726, !727, !728, !729, !730, !731, !732, !733, !734, !736, !740}
!726 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !722, file: !1, line: 1884, type: !392)
!727 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !722, file: !1, line: 1884, type: !59)
!728 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 3, scope: !722, file: !1, line: 1884, type: !17)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !722, file: !1, line: 1886, type: !243)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "memobj", scope: !722, file: !1, line: 1887, type: !45)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !722, file: !1, line: 1887, type: !45)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !722, file: !1, line: 1888, type: !17)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errnum", scope: !722, file: !1, line: 1889, type: !51)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !735, file: !1, line: 1906, type: !45)
!735 = distinct !DILexicalBlock(scope: !722, file: !1, line: 1906, column: 5)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !737, file: !1, line: 1913, type: !45)
!737 = distinct !DILexicalBlock(scope: !738, file: !1, line: 1913, column: 9)
!738 = distinct !DILexicalBlock(scope: !739, file: !1, line: 1909, column: 25)
!739 = distinct !DILexicalBlock(scope: !722, file: !1, line: 1909, column: 9)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !741, file: !1, line: 1918, type: !45)
!741 = distinct !DILexicalBlock(scope: !722, file: !1, line: 1918, column: 5)
!742 = !DISubprogram(name: "_set_BlockingIOError", scope: !1, file: !1, line: 673, type: !743, isLocal: true, isDefinition: true, scopeLine: 674, flags: DIFlagPrototyped, isOptimized: true, variables: !745)
!743 = !DISubroutineType(types: !744)
!744 = !{null, !59, !17}
!745 = !{!746, !747, !748, !749, !751}
!746 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msg", arg: 1, scope: !742, file: !1, line: 673, type: !59)
!747 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "written", arg: 2, scope: !742, file: !1, line: 673, type: !17)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !742, file: !1, line: 675, type: !45)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !750, file: !1, line: 685, type: !45)
!750 = distinct !DILexicalBlock(scope: !742, file: !1, line: 685, column: 5)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !752, file: !1, line: 685, type: !45)
!752 = distinct !DILexicalBlock(scope: !753, file: !1, line: 685, column: 5)
!753 = distinct !DILexicalBlock(scope: !750, file: !1, line: 685, column: 5)
!754 = !DISubprogram(name: "_bufferedwriter_reset_buf", scope: !1, file: !1, line: 1840, type: !489, isLocal: true, isDefinition: true, scopeLine: 1841, flags: DIFlagPrototyped, isOptimized: true, variables: !755)
!755 = !{!756}
!756 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !754, file: !1, line: 1840, type: !392)
!757 = !DISubprogram(name: "_buffered_raw_seek", scope: !1, file: !1, line: 729, type: !758, isLocal: true, isDefinition: true, scopeLine: 730, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.buffered*, i64, i32)* @_buffered_raw_seek, variables: !760)
!758 = !DISubroutineType(types: !759)
!759 = !{!405, !392, !405, !51}
!760 = !{!761, !762, !763, !764, !765, !766, !767, !768, !772, !774, !776}
!761 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !757, file: !1, line: 729, type: !392)
!762 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "target", arg: 2, scope: !757, file: !1, line: 729, type: !405)
!763 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "whence", arg: 3, scope: !757, file: !1, line: 729, type: !51)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !757, file: !1, line: 731, type: !45)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "posobj", scope: !757, file: !1, line: 731, type: !45)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "whenceobj", scope: !757, file: !1, line: 731, type: !45)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !757, file: !1, line: 732, type: !405)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !769, file: !1, line: 739, type: !45)
!769 = distinct !DILexicalBlock(scope: !770, file: !1, line: 739, column: 9)
!770 = distinct !DILexicalBlock(scope: !771, file: !1, line: 738, column: 28)
!771 = distinct !DILexicalBlock(scope: !757, file: !1, line: 738, column: 9)
!772 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !773, file: !1, line: 744, type: !45)
!773 = distinct !DILexicalBlock(scope: !757, file: !1, line: 744, column: 5)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !775, file: !1, line: 745, type: !45)
!775 = distinct !DILexicalBlock(scope: !757, file: !1, line: 745, column: 5)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !777, file: !1, line: 749, type: !45)
!777 = distinct !DILexicalBlock(scope: !757, file: !1, line: 749, column: 5)
!778 = !DISubprogram(name: "_bufferedreader_reset_buf", scope: !1, file: !1, line: 1394, type: !489, isLocal: true, isDefinition: true, scopeLine: 1395, flags: DIFlagPrototyped, isOptimized: true, variables: !779)
!779 = !{!780}
!780 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !778, file: !1, line: 1394, type: !392)
!781 = !DISubprogram(name: "_bufferedreader_fill_buffer", scope: !1, file: !1, line: 1477, type: !782, isLocal: true, isDefinition: true, scopeLine: 1478, flags: DIFlagPrototyped, isOptimized: true, variables: !784)
!782 = !DISubroutineType(types: !783)
!783 = !{!17, !392}
!784 = !{!785, !786, !787, !788}
!785 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !781, file: !1, line: 1477, type: !392)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !781, file: !1, line: 1479, type: !17)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !781, file: !1, line: 1479, type: !17)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !781, file: !1, line: 1479, type: !17)
!789 = !DISubprogram(name: "_bufferedreader_raw_read", scope: !1, file: !1, line: 1436, type: !723, isLocal: true, isDefinition: true, scopeLine: 1437, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.buffered*, i8*, i64)* @_bufferedreader_raw_read, variables: !790)
!790 = !{!791, !792, !793, !794, !795, !796, !797, !798, !800, !804}
!791 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !789, file: !1, line: 1436, type: !392)
!792 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !789, file: !1, line: 1436, type: !59)
!793 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 3, scope: !789, file: !1, line: 1436, type: !17)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !789, file: !1, line: 1438, type: !243)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "memobj", scope: !789, file: !1, line: 1439, type: !45)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !789, file: !1, line: 1439, type: !45)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !789, file: !1, line: 1440, type: !17)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !799, file: !1, line: 1455, type: !45)
!799 = distinct !DILexicalBlock(scope: !789, file: !1, line: 1455, column: 5)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !801, file: !1, line: 1460, type: !45)
!801 = distinct !DILexicalBlock(scope: !802, file: !1, line: 1460, column: 9)
!802 = distinct !DILexicalBlock(scope: !803, file: !1, line: 1458, column: 25)
!803 = distinct !DILexicalBlock(scope: !789, file: !1, line: 1458, column: 9)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !805, file: !1, line: 1464, type: !45)
!805 = distinct !DILexicalBlock(scope: !789, file: !1, line: 1464, column: 5)
!806 = !DISubprogram(name: "buffered_detach", scope: !1, file: !1, line: 569, type: !807, isLocal: true, isDefinition: true, scopeLine: 570, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, %struct._object*)* @buffered_detach, variables: !809)
!807 = !DISubroutineType(types: !808)
!808 = !{!45, !392, !45}
!809 = !{!810, !811, !812, !813, !814}
!810 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !806, file: !1, line: 569, type: !392)
!811 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !806, file: !1, line: 569, type: !45)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "raw", scope: !806, file: !1, line: 571, type: !45)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !806, file: !1, line: 571, type: !45)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !815, file: !1, line: 576, type: !45)
!815 = distinct !DILexicalBlock(scope: !806, file: !1, line: 576, column: 5)
!816 = !DISubprogram(name: "buffered_simple_flush", scope: !1, file: !1, line: 475, type: !807, isLocal: true, isDefinition: true, scopeLine: 476, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, %struct._object*)* @buffered_simple_flush, variables: !817)
!817 = !{!818, !819}
!818 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !816, file: !1, line: 475, type: !392)
!819 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !816, file: !1, line: 475, type: !45)
!820 = !DISubprogram(name: "buffered_close", scope: !1, file: !1, line: 503, type: !807, isLocal: true, isDefinition: true, scopeLine: 504, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, %struct._object*)* @buffered_close, variables: !821)
!821 = !{!822, !823, !824, !825, !826, !827, !828, !829, !832, !835, !838, !844, !848, !850, !852, !854}
!822 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !820, file: !1, line: 503, type: !392)
!823 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !820, file: !1, line: 503, type: !45)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !820, file: !1, line: 505, type: !45)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc", scope: !820, file: !1, line: 505, type: !45)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !820, file: !1, line: 505, type: !45)
!827 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !820, file: !1, line: 505, type: !45)
!828 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !820, file: !1, line: 506, type: !51)
!829 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !830, file: !1, line: 522, type: !45)
!830 = distinct !DILexicalBlock(scope: !831, file: !1, line: 521, column: 27)
!831 = distinct !DILexicalBlock(scope: !820, file: !1, line: 521, column: 9)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !833, file: !1, line: 524, type: !45)
!833 = distinct !DILexicalBlock(scope: !834, file: !1, line: 524, column: 13)
!834 = distinct !DILexicalBlock(scope: !830, file: !1, line: 523, column: 13)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !836, file: !1, line: 536, type: !45)
!836 = distinct !DILexicalBlock(scope: !837, file: !1, line: 536, column: 9)
!837 = distinct !DILexicalBlock(scope: !820, file: !1, line: 533, column: 9)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !839, file: !1, line: 547, type: !45)
!839 = distinct !DILexicalBlock(scope: !840, file: !1, line: 547, column: 13)
!840 = distinct !DILexicalBlock(scope: !841, file: !1, line: 546, column: 26)
!841 = distinct !DILexicalBlock(scope: !842, file: !1, line: 546, column: 13)
!842 = distinct !DILexicalBlock(scope: !843, file: !1, line: 545, column: 22)
!843 = distinct !DILexicalBlock(scope: !820, file: !1, line: 545, column: 9)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !845, file: !1, line: 547, type: !45)
!845 = distinct !DILexicalBlock(scope: !846, file: !1, line: 547, column: 13)
!846 = distinct !DILexicalBlock(scope: !847, file: !1, line: 547, column: 13)
!847 = distinct !DILexicalBlock(scope: !839, file: !1, line: 547, column: 13)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val2", scope: !849, file: !1, line: 551, type: !45)
!849 = distinct !DILexicalBlock(scope: !841, file: !1, line: 550, column: 14)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !851, file: !1, line: 552, type: !45)
!851 = distinct !DILexicalBlock(scope: !849, file: !1, line: 552, column: 13)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !853, file: !1, line: 553, type: !45)
!853 = distinct !DILexicalBlock(scope: !849, file: !1, line: 553, column: 13)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !855, file: !1, line: 553, type: !45)
!855 = distinct !DILexicalBlock(scope: !856, file: !1, line: 553, column: 13)
!856 = distinct !DILexicalBlock(scope: !853, file: !1, line: 553, column: 13)
!857 = !DISubprogram(name: "buffered_seekable", scope: !1, file: !1, line: 587, type: !807, isLocal: true, isDefinition: true, scopeLine: 588, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, %struct._object*)* @buffered_seekable, variables: !858)
!858 = !{!859, !860}
!859 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !857, file: !1, line: 587, type: !392)
!860 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !857, file: !1, line: 587, type: !45)
!861 = !DISubprogram(name: "buffered_readable", scope: !1, file: !1, line: 594, type: !807, isLocal: true, isDefinition: true, scopeLine: 595, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, %struct._object*)* @buffered_readable, variables: !862)
!862 = !{!863, !864}
!863 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !861, file: !1, line: 594, type: !392)
!864 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !861, file: !1, line: 594, type: !45)
!865 = !DISubprogram(name: "buffered_writable", scope: !1, file: !1, line: 601, type: !807, isLocal: true, isDefinition: true, scopeLine: 602, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, %struct._object*)* @buffered_writable, variables: !866)
!866 = !{!867, !868}
!867 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !865, file: !1, line: 601, type: !392)
!868 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !865, file: !1, line: 601, type: !45)
!869 = !DISubprogram(name: "buffered_fileno", scope: !1, file: !1, line: 624, type: !807, isLocal: true, isDefinition: true, scopeLine: 625, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, %struct._object*)* @buffered_fileno, variables: !870)
!870 = !{!871, !872}
!871 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !869, file: !1, line: 624, type: !392)
!872 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !869, file: !1, line: 624, type: !45)
!873 = !DISubprogram(name: "buffered_isatty", scope: !1, file: !1, line: 631, type: !807, isLocal: true, isDefinition: true, scopeLine: 632, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, %struct._object*)* @buffered_isatty, variables: !874)
!874 = !{!875, !876}
!875 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !873, file: !1, line: 631, type: !392)
!876 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !873, file: !1, line: 631, type: !45)
!877 = !DISubprogram(name: "buffered_dealloc_warn", scope: !1, file: !1, line: 453, type: !807, isLocal: true, isDefinition: true, scopeLine: 454, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, %struct._object*)* @buffered_dealloc_warn, variables: !878)
!878 = !{!879, !880, !881, !884}
!879 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !877, file: !1, line: 453, type: !392)
!880 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "source", arg: 2, scope: !877, file: !1, line: 453, type: !45)
!881 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !882, file: !1, line: 456, type: !45)
!882 = distinct !DILexicalBlock(scope: !883, file: !1, line: 455, column: 32)
!883 = distinct !DILexicalBlock(scope: !877, file: !1, line: 455, column: 9)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !885, file: !1, line: 459, type: !45)
!885 = distinct !DILexicalBlock(scope: !886, file: !1, line: 459, column: 13)
!886 = distinct !DILexicalBlock(scope: !882, file: !1, line: 458, column: 13)
!887 = !DISubprogram(name: "buffered_getstate", scope: !1, file: !1, line: 640, type: !807, isLocal: true, isDefinition: true, scopeLine: 641, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, %struct._object*)* @buffered_getstate, variables: !888)
!888 = !{!889, !890}
!889 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !887, file: !1, line: 640, type: !392)
!890 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !887, file: !1, line: 640, type: !45)
!891 = !DISubprogram(name: "buffered_read", scope: !1, file: !1, line: 903, type: !807, isLocal: true, isDefinition: true, scopeLine: 904, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, %struct._object*)* @buffered_read, variables: !892)
!892 = !{!893, !894, !895, !896, !897}
!893 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !891, file: !1, line: 903, type: !392)
!894 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !891, file: !1, line: 903, type: !45)
!895 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !891, file: !1, line: 905, type: !17)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !891, file: !1, line: 906, type: !45)
!897 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !898, file: !1, line: 930, type: !45)
!898 = distinct !DILexicalBlock(scope: !899, file: !1, line: 930, column: 9)
!899 = distinct !DILexicalBlock(scope: !900, file: !1, line: 926, column: 10)
!900 = distinct !DILexicalBlock(scope: !891, file: !1, line: 920, column: 9)
!901 = !DISubprogram(name: "_bufferedreader_read_all", scope: !1, file: !1, line: 1494, type: !508, isLocal: true, isDefinition: true, scopeLine: 1495, flags: DIFlagPrototyped, isOptimized: true, variables: !902)
!902 = !{!903, !904, !905, !906, !907, !908, !909, !913, !917, !922, !926, !928, !930, !933, !935, !938, !940}
!903 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !901, file: !1, line: 1494, type: !392)
!904 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "current_size", scope: !901, file: !1, line: 1496, type: !17)
!905 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !901, file: !1, line: 1497, type: !45)
!906 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !901, file: !1, line: 1497, type: !45)
