; ModuleID = 'bytesobject.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !456, globals: !1905)
!1 = !DIFile(filename: "Objects/bytesobject.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !12, !18, !101, !350, !358, !359, !59, !360, !362, !36, !364, !365, !367, !385, !393, !409, !38, !418, !242, !51, !426, !408, !429, !431, !433, !435, !449}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !14, line: 109, baseType: !15)
!14 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !14, line: 105, size: 128, align: 64, elements: !16)
!16 = !{!17, !25}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !15, file: !14, line: 107, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !19, line: 177, baseType: !20)
!19 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !21, line: 102, baseType: !22)
!21 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !23, line: 181, baseType: !24)
!23 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!24 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !15, file: !14, line: 108, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !14, line: 334, size: 3200, align: 64, elements: !28)
!28 = !{!29, !35, !39, !40, !41, !46, !109, !114, !119, !120, !125, !177, !208, !220, !226, !227, !228, !230, !232, !263, !264, !265, !274, !275, !280, !281, !283, !285, !295, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !27, file: !14, line: 335, baseType: !30, size: 192, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !14, line: 114, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 111, size: 192, align: 64, elements: !32)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !14, line: 112, baseType: !13, size: 128, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !31, file: !14, line: 113, baseType: !18, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !27, file: !14, line: 336, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !27, file: !14, line: 341, baseType: !42, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !14, line: 308, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !12}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !27, file: !14, line: 342, baseType: !47, size: 64, align: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !14, line: 314, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !12, !52, !51}
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !21, line: 48, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !55, line: 246, size: 1728, align: 64, elements: !56)
!55 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!56 = !{!57, !58, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !78, !79, !80, !81, !83, !85, !87, !91, !94, !96, !97, !98, !99, !100, !104, !105}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !54, file: !55, line: 247, baseType: !51, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !54, file: !55, line: 252, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !54, file: !55, line: 253, baseType: !59, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !54, file: !55, line: 254, baseType: !59, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !54, file: !55, line: 255, baseType: !59, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !54, file: !55, line: 256, baseType: !59, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !54, file: !55, line: 257, baseType: !59, size: 64, align: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !54, file: !55, line: 258, baseType: !59, size: 64, align: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !54, file: !55, line: 259, baseType: !59, size: 64, align: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !54, file: !55, line: 261, baseType: !59, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !54, file: !55, line: 262, baseType: !59, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !54, file: !55, line: 263, baseType: !59, size: 64, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !54, file: !55, line: 265, baseType: !71, size: 64, align: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !55, line: 161, size: 192, align: 64, elements: !73)
!73 = !{!74, !75, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !72, file: !55, line: 162, baseType: !71, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !72, file: !55, line: 163, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !72, file: !55, line: 167, baseType: !51, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !54, file: !55, line: 267, baseType: !76, size: 64, align: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !54, file: !55, line: 269, baseType: !51, size: 32, align: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !54, file: !55, line: 273, baseType: !51, size: 32, align: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !54, file: !55, line: 275, baseType: !82, size: 64, align: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !23, line: 140, baseType: !24)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !54, file: !55, line: 279, baseType: !84, size: 16, align: 16, offset: 1024)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !54, file: !55, line: 280, baseType: !86, size: 8, align: 8, offset: 1040)
!86 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !54, file: !55, line: 281, baseType: !88, size: 8, align: 8, offset: 1048)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !54, file: !55, line: 285, baseType: !92, size: 64, align: 64, offset: 1088)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !55, line: 155, baseType: null)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !54, file: !55, line: 294, baseType: !95, size: 64, align: 64, offset: 1152)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !23, line: 141, baseType: !24)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !54, file: !55, line: 303, baseType: !11, size: 64, align: 64, offset: 1216)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !54, file: !55, line: 304, baseType: !11, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !54, file: !55, line: 305, baseType: !11, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !54, file: !55, line: 306, baseType: !11, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !54, file: !55, line: 307, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !54, file: !55, line: 309, baseType: !51, size: 32, align: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !54, file: !55, line: 311, baseType: !106, size: 160, align: 8, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !27, file: !14, line: 343, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !14, line: 316, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!12, !12, !59}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !27, file: !14, line: 344, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !14, line: 318, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!51, !12, !59, !12}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !27, file: !14, line: 345, baseType: !11, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !27, file: !14, line: 346, baseType: !121, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !14, line: 320, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!12, !12}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !27, file: !14, line: 350, baseType: !126, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !14, line: 278, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 236, size: 2176, align: 64, elements: !129)
!129 = !{!130, !135, !136, !137, !138, !139, !144, !146, !147, !148, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !128, file: !14, line: 241, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !14, line: 166, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!12, !12, !12}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !128, file: !14, line: 242, baseType: !131, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !128, file: !14, line: 243, baseType: !131, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !128, file: !14, line: 244, baseType: !131, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !128, file: !14, line: 245, baseType: !131, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !128, file: !14, line: 246, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !14, line: 167, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!12, !12, !12, !12}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !128, file: !14, line: 247, baseType: !145, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !14, line: 165, baseType: !122)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !128, file: !14, line: 248, baseType: !145, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !128, file: !14, line: 249, baseType: !145, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !128, file: !14, line: 250, baseType: !149, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !14, line: 168, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!51, !12}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !128, file: !14, line: 251, baseType: !145, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !128, file: !14, line: 252, baseType: !131, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !128, file: !14, line: 253, baseType: !131, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !128, file: !14, line: 254, baseType: !131, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !128, file: !14, line: 255, baseType: !131, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !128, file: !14, line: 256, baseType: !131, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !128, file: !14, line: 257, baseType: !145, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !128, file: !14, line: 258, baseType: !11, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !128, file: !14, line: 259, baseType: !145, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !128, file: !14, line: 261, baseType: !131, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !128, file: !14, line: 262, baseType: !131, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !128, file: !14, line: 263, baseType: !131, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !128, file: !14, line: 264, baseType: !131, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !128, file: !14, line: 265, baseType: !140, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !128, file: !14, line: 266, baseType: !131, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !128, file: !14, line: 267, baseType: !131, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !128, file: !14, line: 268, baseType: !131, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !128, file: !14, line: 269, baseType: !131, size: 64, align: 64, offset: 1728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !128, file: !14, line: 270, baseType: !131, size: 64, align: 64, offset: 1792)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !128, file: !14, line: 272, baseType: !131, size: 64, align: 64, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !128, file: !14, line: 273, baseType: !131, size: 64, align: 64, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !128, file: !14, line: 274, baseType: !131, size: 64, align: 64, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !128, file: !14, line: 275, baseType: !131, size: 64, align: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !128, file: !14, line: 277, baseType: !145, size: 64, align: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !27, file: !14, line: 351, baseType: !178, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !14, line: 292, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 280, size: 640, align: 64, elements: !181)
!181 = !{!182, !187, !188, !193, !194, !195, !200, !201, !206, !207}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !180, file: !14, line: 281, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !14, line: 169, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!18, !12}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !180, file: !14, line: 282, baseType: !131, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !180, file: !14, line: 283, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !14, line: 170, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!12, !12, !18}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !180, file: !14, line: 284, baseType: !189, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !180, file: !14, line: 285, baseType: !11, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !180, file: !14, line: 286, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !14, line: 172, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!51, !12, !18, !12}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !180, file: !14, line: 287, baseType: !11, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !180, file: !14, line: 288, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !14, line: 231, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!51, !12, !12}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !180, file: !14, line: 290, baseType: !131, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !180, file: !14, line: 291, baseType: !189, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !27, file: !14, line: 352, baseType: !209, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !14, line: 298, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 294, size: 192, align: 64, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !211, file: !14, line: 295, baseType: !183, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !211, file: !14, line: 296, baseType: !131, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !211, file: !14, line: 297, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !14, line: 174, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!51, !12, !12, !12}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !27, file: !14, line: 356, baseType: !221, size: 64, align: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !14, line: 321, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !12}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !19, line: 186, baseType: !18)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !27, file: !14, line: 357, baseType: !140, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !27, file: !14, line: 358, baseType: !121, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !27, file: !14, line: 359, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !14, line: 317, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !27, file: !14, line: 360, baseType: !231, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !14, line: 319, baseType: !217)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !27, file: !14, line: 363, baseType: !233, size: 64, align: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !14, line: 304, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 301, size: 128, align: 64, elements: !236)
!236 = !{!237, !258}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !235, file: !14, line: 302, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !14, line: 193, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!51, !12, !242, !51}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !14, line: 191, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !14, line: 178, size: 640, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !255, !256, !257}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !244, file: !14, line: 179, baseType: !11, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !244, file: !14, line: 180, baseType: !12, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !14, line: 181, baseType: !18, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !244, file: !14, line: 182, baseType: !18, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !244, file: !14, line: 184, baseType: !51, size: 32, align: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !244, file: !14, line: 185, baseType: !51, size: 32, align: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !244, file: !14, line: 186, baseType: !59, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !244, file: !14, line: 187, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !244, file: !14, line: 188, baseType: !254, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !244, file: !14, line: 189, baseType: !254, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !244, file: !14, line: 190, baseType: !11, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !235, file: !14, line: 303, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !14, line: 194, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !12, !242}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !27, file: !14, line: 366, baseType: !103, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !27, file: !14, line: 368, baseType: !36, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !27, file: !14, line: 372, baseType: !266, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !14, line: 233, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!51, !12, !270, !11}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !14, line: 232, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!51, !12, !11}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !27, file: !14, line: 375, baseType: !149, size: 64, align: 64, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !27, file: !14, line: 379, baseType: !276, size: 64, align: 64, offset: 1600)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !14, line: 322, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!12, !12, !12, !51}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !27, file: !14, line: 382, baseType: !18, size: 64, align: 64, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !27, file: !14, line: 385, baseType: !282, size: 64, align: 64, offset: 1728)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !14, line: 323, baseType: !122)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !27, file: !14, line: 386, baseType: !284, size: 64, align: 64, offset: 1792)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !14, line: 324, baseType: !122)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !27, file: !14, line: 389, baseType: !286, size: 64, align: 64, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 40, size: 256, align: 64, elements: !289)
!288 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 41, baseType: !36, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 18, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 43, baseType: !51, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 45, baseType: !36, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !27, file: !14, line: 390, baseType: !296, size: 64, align: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !14, line: 390, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !27, file: !14, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !59, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!12, !12, !11}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!51, !12, !12, !11}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !59, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !11, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !27, file: !14, line: 392, baseType: !26, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !27, file: !14, line: 393, baseType: !12, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !27, file: !14, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !14, line: 325, baseType: !141)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !27, file: !14, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !14, line: 326, baseType: !217)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !27, file: !14, line: 396, baseType: !18, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !27, file: !14, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !14, line: 327, baseType: !217)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !27, file: !14, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !14, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!12, !26, !18}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !27, file: !14, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !14, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!12, !26, !12, !12}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !27, file: !14, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !14, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !11}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !27, file: !14, line: 401, baseType: !149, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !27, file: !14, line: 402, baseType: !12, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !27, file: !14, line: 403, baseType: !12, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !27, file: !14, line: 404, baseType: !12, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !27, file: !14, line: 405, baseType: !12, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !27, file: !14, line: 406, baseType: !12, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !27, file: !14, line: 407, baseType: !42, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !27, file: !14, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !27, file: !14, line: 412, baseType: !42, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !352, line: 41, baseType: !353)
!352 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!353 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 31, size: 320, align: 64, elements: !354)
!354 = !{!355, !356, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !353, file: !352, line: 32, baseType: !30, size: 192, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !353, file: !352, line: 33, baseType: !225, size: 64, align: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !353, file: !352, line: 34, baseType: !88, size: 8, align: 8, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!359 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !359)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !359)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !369)
!369 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !370)
!370 = !{!371, !372, !373, !374, !382}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !369, file: !4, line: 291, baseType: !13, size: 128, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !369, file: !4, line: 292, baseType: !18, size: 64, align: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !369, file: !4, line: 293, baseType: !225, size: 64, align: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !369, file: !4, line: 349, baseType: !375, size: 32, align: 32, offset: 256)
!375 = !DICompositeType(tag: DW_TAG_structure_type, scope: !369, file: !4, line: 294, size: 32, align: 32, elements: !376)
!376 = !{!377, !378, !379, !380, !381}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !375, file: !4, line: 303, baseType: !348, size: 2, align: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !375, file: !4, line: 331, baseType: !348, size: 3, align: 32, offset: 2)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !375, file: !4, line: 336, baseType: !348, size: 1, align: 32, offset: 5)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !375, file: !4, line: 340, baseType: !348, size: 1, align: 32, offset: 6)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !375, file: !4, line: 345, baseType: !348, size: 1, align: 32, offset: 7)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !369, file: !4, line: 350, baseType: !383, size: 64, align: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !102, line: 90, baseType: !51)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !387)
!387 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !388)
!388 = !{!389, !390, !391, !392}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !387, file: !4, line: 357, baseType: !368, size: 384, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !387, file: !4, line: 358, baseType: !18, size: 64, align: 64, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !387, file: !4, line: 360, baseType: !59, size: 64, align: 64, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !387, file: !4, line: 361, baseType: !18, size: 64, align: 64, offset: 512)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !395)
!395 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !396)
!396 = !{!397, !398}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !395, file: !4, line: 369, baseType: !386, size: 576, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !395, file: !4, line: 375, baseType: !399, size: 64, align: 64, offset: 576)
!399 = !DICompositeType(tag: DW_TAG_union_type, scope: !395, file: !4, line: 370, size: 64, align: 64, elements: !400)
!400 = !{!401, !402, !403, !406}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !399, file: !4, line: 371, baseType: !11, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !399, file: !4, line: 372, baseType: !365, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !399, file: !4, line: 373, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !84)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !399, file: !4, line: 374, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !348)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !411, line: 40, baseType: !412)
!411 = !DIFile(filename: "Include/listobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!412 = !DICompositeType(tag: DW_TAG_structure_type, file: !411, line: 23, size: 320, align: 64, elements: !413)
!413 = !{!414, !415, !417}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !412, file: !411, line: 24, baseType: !30, size: 192, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !412, file: !411, line: 26, baseType: !416, size: 64, align: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !412, file: !411, line: 39, baseType: !18, size: 64, align: 64, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !420, line: 33, baseType: !421)
!420 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!421 = !DICompositeType(tag: DW_TAG_structure_type, file: !420, line: 25, size: 256, align: 64, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !421, file: !420, line: 26, baseType: !30, size: 192, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !421, file: !420, line: 27, baseType: !425, size: 64, align: 64, offset: 192)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, align: 64, elements: !89)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_uintptr_t", file: !19, line: 153, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !428, line: 122, baseType: !103)
!428 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !437, line: 253, baseType: !438)
!437 = !DIFile(filename: "Include/objimpl.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!438 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !437, line: 246, size: 192, align: 64, elements: !439)
!439 = !{!440, !447}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !438, file: !437, line: 251, baseType: !441, size: 192, align: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, scope: !438, file: !437, line: 247, size: 192, align: 64, elements: !442)
!442 = !{!443, !445, !446}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !441, file: !437, line: 248, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !441, file: !437, line: 249, baseType: !444, size: 64, align: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !441, file: !437, line: 250, baseType: !18, size: 64, align: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !438, file: !437, line: 252, baseType: !448, size: 64, align: 64)
!448 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "striterobject", file: !1, line: 2864, baseType: !451)
!451 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 2860, size: 256, align: 64, elements: !452)
!452 = !{!453, !454, !455}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !451, file: !1, line: 2861, baseType: !13, size: 128, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "it_index", scope: !451, file: !1, line: 2862, baseType: !18, size: 64, align: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "it_seq", scope: !451, file: !1, line: 2863, baseType: !350, size: 64, align: 64, offset: 192)
!456 = !{!457, !464, !471, !516, !523, !579, !582, !587, !595, !615, !619, !681, !698, !707, !719, !738, !742, !797, !804, !807, !810, !815, !826, !830, !839, !850, !877, !898, !918, !923, !926, !933, !950, !958, !963, !968, !977, !986, !999, !1012, !1031, !1040, !1047, !1058, !1071, !1091, !1096, !1111, !1121, !1129, !1137, !1157, !1162, !1167, !1170, !1173, !1176, !1179, !1182, !1185, !1188, !1194, !1198, !1202, !1212, !1220, !1232, !1236, !1242, !1259, !1270, !1280, !1285, !1300, !1316, !1327, !1343, !1358, !1373, !1391, !1409, !1414, !1419, !1425, !1431, !1445, !1460, !1498, !1536, !1579, !1583, !1596, !1631, !1668, !1709, !1715, !1739, !1750, !1754, !1758, !1762, !1793, !1797, !1805, !1809, !1832, !1842, !1850, !1862, !1873, !1882, !1886, !1892, !1899}
!457 = !DISubprogram(name: "PyBytes_FromStringAndSize", scope: !1, file: !1, line: 75, type: !458, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i64)* @PyBytes_FromStringAndSize, variables: !460)
!458 = !DISubroutineType(types: !459)
!459 = !{!12, !36, !18}
!460 = !{!461, !462, !463}
!461 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !457, file: !1, line: 75, type: !36)
!462 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !457, file: !1, line: 75, type: !18)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !457, file: !1, line: 77, type: !350)
!464 = !DISubprogram(name: "PyBytes_FromString", scope: !1, file: !1, line: 127, type: !465, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @PyBytes_FromString, variables: !467)
!465 = !DISubroutineType(types: !466)
!466 = !{!12, !36}
!467 = !{!468, !469, !470}
!468 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !464, file: !1, line: 127, type: !36)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !464, file: !1, line: 129, type: !101)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !464, file: !1, line: 130, type: !350)
!471 = !DISubprogram(name: "PyBytes_FromFormatV", scope: !1, file: !1, line: 173, type: !472, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct.__va_list_tag*)* @PyBytes_FromFormatV, variables: !482)
!472 = !DISubroutineType(types: !473)
!473 = !{!12, !36, !474}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "__va_list_tag", file: !1, line: 170, baseType: !476)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 170, size: 192, align: 64, elements: !477)
!477 = !{!478, !479, !480, !481}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !476, file: !1, line: 170, baseType: !348, size: 32, align: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !476, file: !1, line: 170, baseType: !348, size: 32, align: 32, offset: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !476, file: !1, line: 170, baseType: !11, size: 64, align: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !476, file: !1, line: 170, baseType: !11, size: 64, align: 64, offset: 128)
!482 = !{!483, !484, !485, !491, !492, !493, !494, !495, !501, !504, !510, !511, !512, !513}
!483 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 1, scope: !471, file: !1, line: 173, type: !36)
!484 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vargs", arg: 2, scope: !471, file: !1, line: 173, type: !474)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !471, file: !1, line: 175, type: !486)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !21, line: 79, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !488, line: 50, baseType: !489)
!488 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stdarg.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 175, baseType: !490)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 192, align: 64, elements: !89)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !471, file: !1, line: 176, type: !18)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !471, file: !1, line: 177, type: !36)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !471, file: !1, line: 178, type: !59)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "string", scope: !471, file: !1, line: 179, type: !12)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !496, file: !1, line: 185, type: !36)
!496 = distinct !DILexicalBlock(scope: !497, file: !1, line: 184, column: 24)
!497 = distinct !DILexicalBlock(scope: !498, file: !1, line: 184, column: 13)
!498 = distinct !DILexicalBlock(scope: !499, file: !1, line: 183, column: 31)
!499 = distinct !DILexicalBlock(scope: !500, file: !1, line: 183, column: 5)
!500 = distinct !DILexicalBlock(scope: !471, file: !1, line: 183, column: 5)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !502, file: !1, line: 199, type: !51)
!502 = distinct !DILexicalBlock(scope: !503, file: !1, line: 198, column: 13)
!503 = distinct !DILexicalBlock(scope: !496, file: !1, line: 196, column: 25)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !505, file: !1, line: 257, type: !36)
!505 = distinct !DILexicalBlock(scope: !506, file: !1, line: 256, column: 24)
!506 = distinct !DILexicalBlock(scope: !507, file: !1, line: 256, column: 13)
!507 = distinct !DILexicalBlock(scope: !508, file: !1, line: 255, column: 31)
!508 = distinct !DILexicalBlock(scope: !509, file: !1, line: 255, column: 5)
!509 = distinct !DILexicalBlock(scope: !471, file: !1, line: 255, column: 5)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !505, file: !1, line: 258, type: !18)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "longflag", scope: !505, file: !1, line: 259, type: !51)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size_tflag", scope: !505, file: !1, line: 260, type: !51)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !514, file: !1, line: 289, type: !51)
!514 = distinct !DILexicalBlock(scope: !515, file: !1, line: 288, column: 13)
!515 = distinct !DILexicalBlock(scope: !505, file: !1, line: 286, column: 25)
!516 = !DISubprogram(name: "PyBytes_FromFormat", scope: !1, file: !1, line: 362, type: !517, isLocal: false, isDefinition: true, scopeLine: 363, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, ...)* @PyBytes_FromFormat, variables: !519)
!517 = !DISubroutineType(types: !518)
!518 = !{!12, !36, null}
!519 = !{!520, !521, !522}
!520 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 1, scope: !516, file: !1, line: 362, type: !36)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !516, file: !1, line: 364, type: !12)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vargs", scope: !516, file: !1, line: 365, type: !486)
!523 = !DISubprogram(name: "PyBytes_DecodeEscape", scope: !1, file: !1, line: 388, type: !524, isLocal: false, isDefinition: true, scopeLine: 393, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i64, i8*, i64, i8*)* @PyBytes_DecodeEscape, variables: !526)
!524 = !DISubroutineType(types: !525)
!525 = !{!12, !36, !18, !36, !18, !36}
!526 = !{!527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !544, !545, !546, !547, !548, !550, !552, !556, !559, !560, !562, !563, !566, !567, !569, !570, !573, !574, !576, !577}
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !523, file: !1, line: 388, type: !36)
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !523, file: !1, line: 389, type: !18)
!529 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 3, scope: !523, file: !1, line: 390, type: !36)
!530 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unicode", arg: 4, scope: !523, file: !1, line: 391, type: !18)
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "recode_encoding", arg: 5, scope: !523, file: !1, line: 392, type: !36)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !523, file: !1, line: 394, type: !51)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !523, file: !1, line: 395, type: !59)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !523, file: !1, line: 395, type: !59)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !523, file: !1, line: 396, type: !36)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !523, file: !1, line: 397, type: !12)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newlen", scope: !523, file: !1, line: 398, type: !18)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !539, file: !1, line: 408, type: !12)
!539 = distinct !DILexicalBlock(scope: !540, file: !1, line: 407, column: 49)
!540 = distinct !DILexicalBlock(scope: !541, file: !1, line: 407, column: 17)
!541 = distinct !DILexicalBlock(scope: !542, file: !1, line: 405, column: 25)
!542 = distinct !DILexicalBlock(scope: !543, file: !1, line: 405, column: 13)
!543 = distinct !DILexicalBlock(scope: !523, file: !1, line: 404, column: 21)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !539, file: !1, line: 408, type: !12)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !539, file: !1, line: 409, type: !59)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !539, file: !1, line: 410, type: !36)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rn", scope: !539, file: !1, line: 411, type: !18)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !549, file: !1, line: 421, type: !12)
!549 = distinct !DILexicalBlock(scope: !539, file: !1, line: 421, column: 17)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !551, file: !1, line: 430, type: !12)
!551 = distinct !DILexicalBlock(scope: !539, file: !1, line: 430, column: 17)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !553, file: !1, line: 468, type: !348)
!553 = distinct !DILexicalBlock(scope: !554, file: !1, line: 467, column: 70)
!554 = distinct !DILexicalBlock(scope: !555, file: !1, line: 467, column: 17)
!555 = distinct !DILexicalBlock(scope: !543, file: !1, line: 443, column: 23)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !557, file: !1, line: 489, type: !101)
!557 = distinct !DILexicalBlock(scope: !558, file: !1, line: 489, column: 28)
!558 = distinct !DILexicalBlock(scope: !555, file: !1, line: 489, column: 17)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !557, file: !1, line: 489, type: !101)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !561, file: !1, line: 489, type: !362)
!561 = distinct !DILexicalBlock(scope: !557, file: !1, line: 489, column: 28)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !561, file: !1, line: 489, type: !51)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !564, file: !1, line: 495, type: !101)
!564 = distinct !DILexicalBlock(scope: !565, file: !1, line: 495, column: 17)
!565 = distinct !DILexicalBlock(scope: !555, file: !1, line: 495, column: 17)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !564, file: !1, line: 495, type: !101)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !568, file: !1, line: 495, type: !362)
!568 = distinct !DILexicalBlock(scope: !564, file: !1, line: 495, column: 17)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !568, file: !1, line: 495, type: !51)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !571, file: !1, line: 497, type: !101)
!571 = distinct !DILexicalBlock(scope: !572, file: !1, line: 497, column: 24)
!572 = distinct !DILexicalBlock(scope: !565, file: !1, line: 497, column: 24)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !571, file: !1, line: 497, type: !101)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !575, file: !1, line: 497, type: !362)
!575 = distinct !DILexicalBlock(scope: !571, file: !1, line: 497, column: 24)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !575, file: !1, line: 497, type: !51)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !578, file: !1, line: 521, type: !12)
!578 = distinct !DILexicalBlock(scope: !523, file: !1, line: 521, column: 5)
!579 = !DISubprogram(name: "PyBytes_Size", scope: !1, file: !1, line: 529, type: !185, isLocal: false, isDefinition: true, scopeLine: 530, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyBytes_Size, variables: !580)
!580 = !{!581}
!581 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !579, file: !1, line: 529, type: !12)
!582 = !DISubprogram(name: "PyBytes_AsString", scope: !1, file: !1, line: 540, type: !583, isLocal: false, isDefinition: true, scopeLine: 541, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct._object*)* @PyBytes_AsString, variables: !585)
!583 = !DISubroutineType(types: !584)
!584 = !{!59, !12}
!585 = !{!586}
!586 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !582, file: !1, line: 540, type: !12)
!587 = !DISubprogram(name: "PyBytes_AsStringAndSize", scope: !1, file: !1, line: 551, type: !588, isLocal: false, isDefinition: true, scopeLine: 554, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8**, i64*)* @PyBytes_AsStringAndSize, variables: !591)
!588 = !DISubroutineType(types: !589)
!589 = !{!51, !12, !590, !254}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!591 = !{!592, !593, !594}
!592 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !587, file: !1, line: 551, type: !12)
!593 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 2, scope: !587, file: !1, line: 552, type: !590)
!594 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 3, scope: !587, file: !1, line: 553, type: !254)
!595 = !DISubprogram(name: "PyBytes_Repr", scope: !1, file: !1, line: 593, type: !596, isLocal: false, isDefinition: true, scopeLine: 594, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i32)* @PyBytes_Repr, variables: !598)
!596 = !DISubroutineType(types: !597)
!597 = !{!12, !12, !51}
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611}
!599 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !595, file: !1, line: 593, type: !12)
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "smartquotes", arg: 2, scope: !595, file: !1, line: 593, type: !51)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !595, file: !1, line: 595, type: !350)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !595, file: !1, line: 596, type: !18)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !595, file: !1, line: 596, type: !18)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newsize", scope: !595, file: !1, line: 597, type: !101)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "squotes", scope: !595, file: !1, line: 597, type: !101)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dquotes", scope: !595, file: !1, line: 597, type: !101)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !595, file: !1, line: 598, type: !12)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "quote", scope: !595, file: !1, line: 599, type: !359)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !595, file: !1, line: 599, type: !364)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !595, file: !1, line: 599, type: !364)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !612, file: !1, line: 638, type: !359)
!612 = distinct !DILexicalBlock(scope: !613, file: !1, line: 637, column: 34)
!613 = distinct !DILexicalBlock(scope: !614, file: !1, line: 637, column: 5)
!614 = distinct !DILexicalBlock(scope: !595, file: !1, line: 637, column: 5)
!615 = !DISubprogram(name: "_PyBytes_Join", scope: !1, file: !1, line: 1163, type: !133, isLocal: false, isDefinition: true, scopeLine: 1164, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @_PyBytes_Join, variables: !616)
!616 = !{!617, !618}
!617 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sep", arg: 1, scope: !615, file: !1, line: 1163, type: !12)
!618 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !615, file: !1, line: 1163, type: !12)
!619 = !DISubprogram(name: "PyBytes_FromObject", scope: !1, file: !1, line: 2554, type: !123, isLocal: false, isDefinition: true, scopeLine: 2555, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyBytes_FromObject, variables: !620)
!620 = !{!621, !622, !623, !624, !625, !626, !629, !631, !634, !640, !644, !648, !654, !658, !662, !666, !667, !669, !671, !673, !676, !678}
!621 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !619, file: !1, line: 2554, type: !12)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new", scope: !619, file: !1, line: 2556, type: !12)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !619, file: !1, line: 2556, type: !12)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !619, file: !1, line: 2557, type: !18)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !619, file: !1, line: 2557, type: !18)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view", scope: !627, file: !1, line: 2571, type: !243)
!627 = distinct !DILexicalBlock(scope: !628, file: !1, line: 2570, column: 34)
!628 = distinct !DILexicalBlock(scope: !619, file: !1, line: 2570, column: 9)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !630, file: !1, line: 2583, type: !12)
!630 = distinct !DILexicalBlock(scope: !627, file: !1, line: 2583, column: 9)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !632, file: !1, line: 2583, type: !12)
!632 = distinct !DILexicalBlock(scope: !633, file: !1, line: 2583, column: 9)
!633 = distinct !DILexicalBlock(scope: !630, file: !1, line: 2583, column: 9)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !635, file: !1, line: 2598, type: !18)
!635 = distinct !DILexicalBlock(scope: !636, file: !1, line: 2597, column: 42)
!636 = distinct !DILexicalBlock(scope: !637, file: !1, line: 2597, column: 9)
!637 = distinct !DILexicalBlock(scope: !638, file: !1, line: 2597, column: 9)
!638 = distinct !DILexicalBlock(scope: !639, file: !1, line: 2593, column: 31)
!639 = distinct !DILexicalBlock(scope: !619, file: !1, line: 2593, column: 9)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !641, file: !1, line: 2601, type: !12)
!641 = distinct !DILexicalBlock(scope: !642, file: !1, line: 2601, column: 17)
!642 = distinct !DILexicalBlock(scope: !643, file: !1, line: 2600, column: 50)
!643 = distinct !DILexicalBlock(scope: !635, file: !1, line: 2600, column: 17)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !645, file: !1, line: 2607, type: !12)
!645 = distinct !DILexicalBlock(scope: !646, file: !1, line: 2607, column: 17)
!646 = distinct !DILexicalBlock(scope: !647, file: !1, line: 2604, column: 44)
!647 = distinct !DILexicalBlock(scope: !635, file: !1, line: 2604, column: 17)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !649, file: !1, line: 2619, type: !18)
!649 = distinct !DILexicalBlock(scope: !650, file: !1, line: 2618, column: 42)
!650 = distinct !DILexicalBlock(scope: !651, file: !1, line: 2618, column: 9)
!651 = distinct !DILexicalBlock(scope: !652, file: !1, line: 2618, column: 9)
!652 = distinct !DILexicalBlock(scope: !653, file: !1, line: 2614, column: 32)
!653 = distinct !DILexicalBlock(scope: !619, file: !1, line: 2614, column: 9)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !655, file: !1, line: 2622, type: !12)
!655 = distinct !DILexicalBlock(scope: !656, file: !1, line: 2622, column: 17)
!656 = distinct !DILexicalBlock(scope: !657, file: !1, line: 2621, column: 50)
!657 = distinct !DILexicalBlock(scope: !649, file: !1, line: 2621, column: 17)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !659, file: !1, line: 2628, type: !12)
!659 = distinct !DILexicalBlock(scope: !660, file: !1, line: 2628, column: 17)
!660 = distinct !DILexicalBlock(scope: !661, file: !1, line: 2625, column: 44)
!661 = distinct !DILexicalBlock(scope: !649, file: !1, line: 2625, column: 17)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !663, file: !1, line: 2656, type: !12)
!663 = distinct !DILexicalBlock(scope: !664, file: !1, line: 2655, column: 24)
!664 = distinct !DILexicalBlock(scope: !665, file: !1, line: 2655, column: 5)
!665 = distinct !DILexicalBlock(scope: !619, file: !1, line: 2655, column: 5)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !663, file: !1, line: 2657, type: !18)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !668, file: !1, line: 2669, type: !12)
!668 = distinct !DILexicalBlock(scope: !663, file: !1, line: 2669, column: 9)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !670, file: !1, line: 2691, type: !12)
!670 = distinct !DILexicalBlock(scope: !619, file: !1, line: 2691, column: 5)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !672, file: !1, line: 2695, type: !12)
!672 = distinct !DILexicalBlock(scope: !619, file: !1, line: 2695, column: 5)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !674, file: !1, line: 2695, type: !12)
!674 = distinct !DILexicalBlock(scope: !675, file: !1, line: 2695, column: 5)
!675 = distinct !DILexicalBlock(scope: !672, file: !1, line: 2695, column: 5)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !677, file: !1, line: 2696, type: !12)
!677 = distinct !DILexicalBlock(scope: !619, file: !1, line: 2696, column: 5)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !679, file: !1, line: 2696, type: !12)
!679 = distinct !DILexicalBlock(scope: !680, file: !1, line: 2696, column: 5)
!680 = distinct !DILexicalBlock(scope: !677, file: !1, line: 2696, column: 5)
!681 = !DISubprogram(name: "PyBytes_Concat", scope: !1, file: !1, line: 2782, type: !682, isLocal: false, isDefinition: true, scopeLine: 2783, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object**, %struct._object*)* @PyBytes_Concat, variables: !684)
!682 = !DISubroutineType(types: !683)
!683 = !{null, !416, !12}
!684 = !{!685, !686, !687, !688, !692, !696}
!685 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pv", arg: 1, scope: !681, file: !1, line: 2782, type: !416)
!686 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !681, file: !1, line: 2782, type: !12)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !681, file: !1, line: 2784, type: !12)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !689, file: !1, line: 2789, type: !12)
!689 = distinct !DILexicalBlock(scope: !690, file: !1, line: 2789, column: 9)
!690 = distinct !DILexicalBlock(scope: !691, file: !1, line: 2788, column: 20)
!691 = distinct !DILexicalBlock(scope: !681, file: !1, line: 2788, column: 9)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !693, file: !1, line: 2789, type: !12)
!693 = distinct !DILexicalBlock(scope: !694, file: !1, line: 2789, column: 9)
!694 = distinct !DILexicalBlock(scope: !695, file: !1, line: 2789, column: 9)
!695 = distinct !DILexicalBlock(scope: !689, file: !1, line: 2789, column: 9)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !697, file: !1, line: 2793, type: !12)
!697 = distinct !DILexicalBlock(scope: !681, file: !1, line: 2793, column: 5)
!698 = !DISubprogram(name: "PyBytes_ConcatAndDel", scope: !1, file: !1, line: 2798, type: !682, isLocal: false, isDefinition: true, scopeLine: 2799, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object**, %struct._object*)* @PyBytes_ConcatAndDel, variables: !699)
!699 = !{!700, !701, !702, !704}
!700 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pv", arg: 1, scope: !698, file: !1, line: 2798, type: !416)
!701 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !698, file: !1, line: 2798, type: !12)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !703, file: !1, line: 2801, type: !12)
!703 = distinct !DILexicalBlock(scope: !698, file: !1, line: 2801, column: 5)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !705, file: !1, line: 2801, type: !12)
!705 = distinct !DILexicalBlock(scope: !706, file: !1, line: 2801, column: 5)
!706 = distinct !DILexicalBlock(scope: !703, file: !1, line: 2801, column: 5)
!707 = !DISubprogram(name: "_PyBytes_Resize", scope: !1, file: !1, line: 2820, type: !708, isLocal: false, isDefinition: true, scopeLine: 2821, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object**, i64)* @_PyBytes_Resize, variables: !710)
!708 = !DISubroutineType(types: !709)
!709 = !{!51, !416, !18}
!710 = !{!711, !712, !713, !714, !715}
!711 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pv", arg: 1, scope: !707, file: !1, line: 2820, type: !416)
!712 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newsize", arg: 2, scope: !707, file: !1, line: 2820, type: !18)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !707, file: !1, line: 2822, type: !12)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sv", scope: !707, file: !1, line: 2823, type: !350)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !716, file: !1, line: 2827, type: !12)
!716 = distinct !DILexicalBlock(scope: !717, file: !1, line: 2827, column: 9)
!717 = distinct !DILexicalBlock(scope: !718, file: !1, line: 2825, column: 64)
!718 = distinct !DILexicalBlock(scope: !707, file: !1, line: 2825, column: 9)
!719 = !DISubprogram(name: "PyBytes_Fini", scope: !1, file: !1, line: 2850, type: !720, isLocal: false, isDefinition: true, scopeLine: 2851, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyBytes_Fini, variables: !722)
!720 = !DISubroutineType(types: !721)
!721 = !{null}
!722 = !{!723, !724, !728, !732, !734}
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !719, file: !1, line: 2852, type: !51)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !725, file: !1, line: 2854, type: !12)
!725 = distinct !DILexicalBlock(scope: !726, file: !1, line: 2854, column: 9)
!726 = distinct !DILexicalBlock(scope: !727, file: !1, line: 2853, column: 5)
!727 = distinct !DILexicalBlock(scope: !719, file: !1, line: 2853, column: 5)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !729, file: !1, line: 2854, type: !12)
!729 = distinct !DILexicalBlock(scope: !730, file: !1, line: 2854, column: 9)
!730 = distinct !DILexicalBlock(scope: !731, file: !1, line: 2854, column: 9)
!731 = distinct !DILexicalBlock(scope: !725, file: !1, line: 2854, column: 9)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !733, file: !1, line: 2855, type: !12)
!733 = distinct !DILexicalBlock(scope: !719, file: !1, line: 2855, column: 5)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !735, file: !1, line: 2855, type: !12)
!735 = distinct !DILexicalBlock(scope: !736, file: !1, line: 2855, column: 5)
!736 = distinct !DILexicalBlock(scope: !737, file: !1, line: 2855, column: 5)
!737 = distinct !DILexicalBlock(scope: !733, file: !1, line: 2855, column: 5)
!738 = !DISubprogram(name: "bytes_join", scope: !1, file: !1, line: 1157, type: !133, isLocal: true, isDefinition: true, scopeLine: 1158, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @bytes_join, variables: !739)
!739 = !{!740, !741}
!740 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !738, file: !1, line: 1157, type: !12)
!741 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iterable", arg: 2, scope: !738, file: !1, line: 1157, type: !12)
!742 = !DISubprogram(name: "stringlib_bytes_join", scope: !743, file: !743, line: 8, type: !133, isLocal: true, isDefinition: true, scopeLine: 9, flags: DIFlagPrototyped, isOptimized: true, variables: !744)
!743 = !DIFile(filename: "Objects/stringlib/join.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!744 = !{!745, !746, !747, !748, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !763, !767, !773, !779, !783, !789, !790, !794, !795}
!745 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sep", arg: 1, scope: !742, file: !743, line: 8, type: !12)
!746 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iterable", arg: 2, scope: !742, file: !743, line: 8, type: !12)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sepstr", scope: !742, file: !743, line: 10, type: !59)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seplen", scope: !742, file: !743, line: 11, type: !749)
!749 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !742, file: !743, line: 12, type: !12)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !742, file: !743, line: 13, type: !59)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seqlen", scope: !742, file: !743, line: 14, type: !18)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sz", scope: !742, file: !743, line: 15, type: !18)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !742, file: !743, line: 16, type: !18)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbufs", scope: !742, file: !743, line: 16, type: !18)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seq", scope: !742, file: !743, line: 17, type: !12)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !742, file: !743, line: 17, type: !12)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffers", scope: !742, file: !743, line: 18, type: !242)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "static_buffers", scope: !742, file: !743, line: 20, type: !760)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 6400, align: 64, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 10)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !764, file: !743, line: 29, type: !12)
!764 = distinct !DILexicalBlock(scope: !765, file: !743, line: 29, column: 9)
!765 = distinct !DILexicalBlock(scope: !766, file: !743, line: 28, column: 22)
!766 = distinct !DILexicalBlock(scope: !742, file: !743, line: 28, column: 9)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !768, file: !743, line: 37, type: !12)
!768 = distinct !DILexicalBlock(scope: !769, file: !743, line: 37, column: 13)
!769 = distinct !DILexicalBlock(scope: !770, file: !743, line: 35, column: 42)
!770 = distinct !DILexicalBlock(scope: !771, file: !743, line: 35, column: 13)
!771 = distinct !DILexicalBlock(scope: !772, file: !743, line: 33, column: 22)
!772 = distinct !DILexicalBlock(scope: !742, file: !743, line: 33, column: 9)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !774, file: !743, line: 45, type: !12)
!774 = distinct !DILexicalBlock(scope: !775, file: !743, line: 45, column: 13)
!775 = distinct !DILexicalBlock(scope: !776, file: !743, line: 44, column: 30)
!776 = distinct !DILexicalBlock(scope: !777, file: !743, line: 44, column: 13)
!777 = distinct !DILexicalBlock(scope: !778, file: !743, line: 42, column: 37)
!778 = distinct !DILexicalBlock(scope: !742, file: !743, line: 42, column: 9)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemlen", scope: !780, file: !743, line: 59, type: !18)
!780 = distinct !DILexicalBlock(scope: !781, file: !743, line: 58, column: 45)
!781 = distinct !DILexicalBlock(scope: !782, file: !743, line: 58, column: 5)
!782 = distinct !DILexicalBlock(scope: !742, file: !743, line: 58, column: 5)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !784, file: !743, line: 101, type: !18)
!784 = distinct !DILexicalBlock(scope: !785, file: !743, line: 100, column: 37)
!785 = distinct !DILexicalBlock(scope: !786, file: !743, line: 100, column: 9)
!786 = distinct !DILexicalBlock(scope: !787, file: !743, line: 100, column: 9)
!787 = distinct !DILexicalBlock(scope: !788, file: !743, line: 98, column: 18)
!788 = distinct !DILexicalBlock(scope: !742, file: !743, line: 98, column: 9)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !784, file: !743, line: 102, type: !59)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !791, file: !743, line: 109, type: !18)
!791 = distinct !DILexicalBlock(scope: !792, file: !743, line: 108, column: 33)
!792 = distinct !DILexicalBlock(scope: !793, file: !743, line: 108, column: 5)
!793 = distinct !DILexicalBlock(scope: !742, file: !743, line: 108, column: 5)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !791, file: !743, line: 110, type: !59)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !796, file: !743, line: 125, type: !12)
!796 = distinct !DILexicalBlock(scope: !742, file: !743, line: 125, column: 5)
!797 = !DISubprogram(name: "_getbuffer", scope: !1, file: !1, line: 11, type: !798, isLocal: true, isDefinition: true, scopeLine: 12, flags: DIFlagPrototyped, isOptimized: true, variables: !800)
!798 = !DISubroutineType(types: !799)
!799 = !{!18, !12, !242}
!800 = !{!801, !802, !803}
!801 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !797, file: !1, line: 11, type: !12)
!802 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 2, scope: !797, file: !1, line: 11, type: !242)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bufferprocs", scope: !797, file: !1, line: 13, type: !233)
!804 = !DISubprogram(name: "bytes_dealloc", scope: !1, file: !1, line: 378, type: !44, isLocal: true, isDefinition: true, scopeLine: 379, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @bytes_dealloc, variables: !805)
!805 = !{!806}
!806 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !804, file: !1, line: 378, type: !12)
!807 = !DISubprogram(name: "bytes_repr", scope: !1, file: !1, line: 662, type: !123, isLocal: true, isDefinition: true, scopeLine: 663, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @bytes_repr, variables: !808)
!808 = !{!809}
!809 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !807, file: !1, line: 662, type: !12)
!810 = !DISubprogram(name: "bytes_length", scope: !1, file: !1, line: 679, type: !811, isLocal: true, isDefinition: true, scopeLine: 680, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.PyBytesObject*)* @bytes_length, variables: !813)
!811 = !DISubroutineType(types: !812)
!812 = !{!18, !350}
!813 = !{!814}
!814 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !810, file: !1, line: 679, type: !350)
!815 = !DISubprogram(name: "bytes_repeat", scope: !1, file: !1, line: 734, type: !816, isLocal: true, isDefinition: true, scopeLine: 735, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyBytesObject*, i64)* @bytes_repeat, variables: !818)
!816 = !DISubroutineType(types: !817)
!817 = !{!12, !350, !18}
!818 = !{!819, !820, !821, !822, !823, !824, !825}
!819 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !815, file: !1, line: 734, type: !350)
!820 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !815, file: !1, line: 734, type: !18)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !815, file: !1, line: 736, type: !18)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !815, file: !1, line: 737, type: !18)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !815, file: !1, line: 738, type: !18)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !815, file: !1, line: 739, type: !350)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes", scope: !815, file: !1, line: 740, type: !101)
!826 = !DISubprogram(name: "bytes_item", scope: !1, file: !1, line: 809, type: !816, isLocal: true, isDefinition: true, scopeLine: 810, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyBytesObject*, i64)* @bytes_item, variables: !827)
!827 = !{!828, !829}
!828 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !826, file: !1, line: 809, type: !350)
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !826, file: !1, line: 809, type: !18)
!830 = !DISubprogram(name: "bytes_contains", scope: !1, file: !1, line: 786, type: !204, isLocal: true, isDefinition: true, scopeLine: 787, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*)* @bytes_contains, variables: !831)
!831 = !{!832, !833, !834, !835, !838}
!832 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !830, file: !1, line: 786, type: !12)
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !830, file: !1, line: 786, type: !12)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ival", scope: !830, file: !1, line: 788, type: !18)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "varg", scope: !836, file: !1, line: 790, type: !243)
!836 = distinct !DILexicalBlock(scope: !837, file: !1, line: 789, column: 41)
!837 = distinct !DILexicalBlock(scope: !830, file: !1, line: 789, column: 9)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !836, file: !1, line: 791, type: !18)
!839 = !DISubprogram(name: "stringlib_find", scope: !840, file: !840, line: 8, type: !841, isLocal: true, isDefinition: true, scopeLine: 11, flags: DIFlagPrototyped, isOptimized: true, variables: !843)
!840 = !DIFile(filename: "Objects/stringlib/find.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!841 = !DISubroutineType(types: !842)
!842 = !{!18, !36, !18, !36, !18, !18}
!843 = !{!844, !845, !846, !847, !848, !849}
!844 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !839, file: !840, line: 8, type: !36)
!845 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str_len", arg: 2, scope: !839, file: !840, line: 8, type: !18)
!846 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sub", arg: 3, scope: !839, file: !840, line: 9, type: !36)
!847 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sub_len", arg: 4, scope: !839, file: !840, line: 9, type: !18)
!848 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "offset", arg: 5, scope: !839, file: !840, line: 10, type: !18)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !839, file: !840, line: 12, type: !18)
!850 = !DISubprogram(name: "fastsearch", scope: !851, file: !851, line: 84, type: !852, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8*, i64, i8*, i64, i64, i32)* @fastsearch, variables: !854)
!851 = !DIFile(filename: "Objects/stringlib/fastsearch.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!852 = !DISubroutineType(types: !853)
!853 = !{!18, !36, !18, !36, !18, !18, !51}
!854 = !{!855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !873, !876}
!855 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !850, file: !851, line: 84, type: !36)
!856 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !850, file: !851, line: 84, type: !18)
!857 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 3, scope: !850, file: !851, line: 85, type: !36)
!858 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 4, scope: !850, file: !851, line: 85, type: !18)
!859 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxcount", arg: 5, scope: !850, file: !851, line: 86, type: !18)
!860 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 6, scope: !850, file: !851, line: 86, type: !51)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mask", scope: !850, file: !851, line: 88, type: !103)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "skip", scope: !850, file: !851, line: 89, type: !18)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !850, file: !851, line: 89, type: !18)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !850, file: !851, line: 90, type: !18)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !850, file: !851, line: 90, type: !18)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mlast", scope: !850, file: !851, line: 90, type: !18)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !850, file: !851, line: 90, type: !18)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "needle", scope: !869, file: !851, line: 109, type: !359)
!869 = distinct !DILexicalBlock(scope: !870, file: !851, line: 106, column: 24)
!870 = distinct !DILexicalBlock(scope: !871, file: !851, line: 102, column: 13)
!871 = distinct !DILexicalBlock(scope: !872, file: !851, line: 98, column: 17)
!872 = distinct !DILexicalBlock(scope: !850, file: !851, line: 98, column: 9)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ss", scope: !874, file: !851, line: 145, type: !36)
!874 = distinct !DILexicalBlock(scope: !875, file: !851, line: 144, column: 31)
!875 = distinct !DILexicalBlock(scope: !850, file: !851, line: 144, column: 9)
!876 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pp", scope: !874, file: !851, line: 146, type: !36)
!877 = !DISubprogram(name: "stringlib_fastsearch_memchr_1char", scope: !851, file: !851, line: 37, type: !878, isLocal: true, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, variables: !880)
!878 = !DISubroutineType(types: !879)
!879 = !{!18, !36, !18, !38, !359, !18, !51}
!880 = !{!881, !882, !883, !884, !885, !886, !887, !890, !891, !893, !897}
!881 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !877, file: !851, line: 37, type: !36)
!882 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !877, file: !851, line: 37, type: !18)
!883 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ch", arg: 3, scope: !877, file: !851, line: 38, type: !38)
!884 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "needle", arg: 4, scope: !877, file: !851, line: 38, type: !359)
!885 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxcount", arg: 5, scope: !877, file: !851, line: 39, type: !18)
!886 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 6, scope: !877, file: !851, line: 39, type: !51)
!887 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !888, file: !851, line: 42, type: !36)
!888 = distinct !DILexicalBlock(scope: !889, file: !851, line: 41, column: 30)
!889 = distinct !DILexicalBlock(scope: !877, file: !851, line: 41, column: 9)
!890 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !888, file: !851, line: 43, type: !36)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "candidate", scope: !892, file: !851, line: 45, type: !11)
!892 = distinct !DILexicalBlock(scope: !888, file: !851, line: 44, column: 25)
!893 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "found", scope: !894, file: !851, line: 62, type: !36)
!894 = distinct !DILexicalBlock(scope: !895, file: !851, line: 61, column: 23)
!895 = distinct !DILexicalBlock(scope: !896, file: !851, line: 60, column: 36)
!896 = distinct !DILexicalBlock(scope: !889, file: !851, line: 60, column: 14)
!897 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "candidate", scope: !894, file: !851, line: 63, type: !11)
!898 = !DISubprogram(name: "bytes_subscript", scope: !1, file: !1, line: 919, type: !899, isLocal: true, isDefinition: true, scopeLine: 920, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyBytesObject*, %struct._object*)* @bytes_subscript, variables: !901)
!899 = !DISubroutineType(types: !900)
!900 = !{!12, !350, !12}
!901 = !{!902, !903, !904, !907, !910, !911, !912, !913, !914, !915, !916, !917}
!902 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !898, file: !1, line: 919, type: !350)
!903 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 2, scope: !898, file: !1, line: 919, type: !12)
!904 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !905, file: !1, line: 922, type: !18)
!905 = distinct !DILexicalBlock(scope: !906, file: !1, line: 921, column: 30)
!906 = distinct !DILexicalBlock(scope: !898, file: !1, line: 921, column: 9)
!907 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !908, file: !1, line: 935, type: !18)
!908 = distinct !DILexicalBlock(scope: !909, file: !1, line: 934, column: 35)
!909 = distinct !DILexicalBlock(scope: !906, file: !1, line: 934, column: 14)
!910 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stop", scope: !908, file: !1, line: 935, type: !18)
!911 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step", scope: !908, file: !1, line: 935, type: !18)
!912 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slicelength", scope: !908, file: !1, line: 935, type: !18)
!913 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur", scope: !908, file: !1, line: 935, type: !18)
!914 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !908, file: !1, line: 935, type: !18)
!915 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "source_buf", scope: !908, file: !1, line: 936, type: !59)
!916 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result_buf", scope: !908, file: !1, line: 937, type: !59)
!917 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !908, file: !1, line: 938, type: !12)
!918 = !DISubprogram(name: "bytes_hash", scope: !1, file: !1, line: 909, type: !919, isLocal: true, isDefinition: true, scopeLine: 910, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.PyBytesObject*)* @bytes_hash, variables: !921)
!919 = !DISubroutineType(types: !920)
!920 = !{!225, !350}
!921 = !{!922}
!922 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !918, file: !1, line: 909, type: !350)
!923 = !DISubprogram(name: "bytes_str", scope: !1, file: !1, line: 668, type: !123, isLocal: true, isDefinition: true, scopeLine: 669, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @bytes_str, variables: !924)
!924 = !{!925}
!925 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !923, file: !1, line: 668, type: !12)
!926 = !DISubprogram(name: "bytes_buffer_getbuffer", scope: !1, file: !1, line: 984, type: !927, isLocal: true, isDefinition: true, scopeLine: 985, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyBytesObject*, %struct.bufferinfo*, i32)* @bytes_buffer_getbuffer, variables: !929)
!927 = !DISubroutineType(types: !928)
!928 = !{!51, !350, !242, !51}
!929 = !{!930, !931, !932}
!930 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !926, file: !1, line: 984, type: !350)
!931 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 2, scope: !926, file: !1, line: 984, type: !242)
!932 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 3, scope: !926, file: !1, line: 984, type: !51)
!933 = !DISubprogram(name: "bytes_richcompare", scope: !1, file: !1, line: 836, type: !934, isLocal: true, isDefinition: true, scopeLine: 837, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyBytesObject*, %struct.PyBytesObject*, i32)* @bytes_richcompare, variables: !936)
!934 = !DISubroutineType(types: !935)
!935 = !{!12, !350, !350, !51}
!936 = !{!937, !938, !939, !940, !941, !942, !943, !944, !945}
!937 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !933, file: !1, line: 836, type: !350)
!938 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !933, file: !1, line: 836, type: !350)
!939 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !933, file: !1, line: 836, type: !51)
!940 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !933, file: !1, line: 838, type: !51)
!941 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len_a", scope: !933, file: !1, line: 839, type: !18)
!942 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len_b", scope: !933, file: !1, line: 839, type: !18)
!943 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_len", scope: !933, file: !1, line: 840, type: !18)
!944 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !933, file: !1, line: 841, type: !12)
!945 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eq", scope: !946, file: !1, line: 875, type: !51)
!946 = distinct !DILexicalBlock(scope: !947, file: !1, line: 874, column: 42)
!947 = distinct !DILexicalBlock(scope: !948, file: !1, line: 874, column: 14)
