; ModuleID = 'bytearrayobject.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !463, globals: !1924)
!1 = !DIFile(filename: "Objects/bytearrayobject.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !96, !17, !101, !357, !367, !368, !50, !369, !35, !371, !37, !374, !382, !400, !408, !425, !426, !428, !430, !242, !432, !58, !441, !442, !456}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !13, line: 109, baseType: !14)
!13 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !13, line: 105, size: 128, align: 64, elements: !15)
!15 = !{!16, !24}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !14, file: !13, line: 107, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !18, line: 177, baseType: !19)
!18 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !20, line: 102, baseType: !21)
!20 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !22, line: 181, baseType: !23)
!22 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!23 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !14, file: !13, line: 108, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !13, line: 334, size: 3200, align: 64, elements: !27)
!27 = !{!28, !34, !38, !39, !40, !45, !109, !114, !119, !120, !125, !177, !208, !220, !226, !227, !228, !230, !232, !263, !264, !265, !274, !275, !280, !281, !283, !285, !295, !305, !323, !324, !325, !327, !329, !330, !332, !337, !342, !347, !348, !349, !350, !351, !352, !353, !354, !356}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !26, file: !13, line: 335, baseType: !29, size: 192, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !13, line: 114, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 111, size: 192, align: 64, elements: !31)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !30, file: !13, line: 112, baseType: !12, size: 128, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !30, file: !13, line: 113, baseType: !17, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !26, file: !13, line: 336, baseType: !35, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!37 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !26, file: !13, line: 337, baseType: !17, size: 64, align: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !26, file: !13, line: 337, baseType: !17, size: 64, align: 64, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !26, file: !13, line: 341, baseType: !41, size: 64, align: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !13, line: 308, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !11}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !26, file: !13, line: 342, baseType: !46, size: 64, align: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !13, line: 314, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !11, !51, !50}
!50 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !20, line: 48, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !54, line: 246, size: 1728, align: 64, elements: !55)
!54 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!55 = !{!56, !57, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !77, !78, !79, !80, !82, !84, !86, !90, !93, !95, !97, !98, !99, !100, !104, !105}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !53, file: !54, line: 247, baseType: !50, size: 32, align: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !53, file: !54, line: 252, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !53, file: !54, line: 253, baseType: !58, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !53, file: !54, line: 254, baseType: !58, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !53, file: !54, line: 255, baseType: !58, size: 64, align: 64, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !53, file: !54, line: 256, baseType: !58, size: 64, align: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !53, file: !54, line: 257, baseType: !58, size: 64, align: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !53, file: !54, line: 258, baseType: !58, size: 64, align: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !53, file: !54, line: 259, baseType: !58, size: 64, align: 64, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !53, file: !54, line: 261, baseType: !58, size: 64, align: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !53, file: !54, line: 262, baseType: !58, size: 64, align: 64, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !53, file: !54, line: 263, baseType: !58, size: 64, align: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !53, file: !54, line: 265, baseType: !70, size: 64, align: 64, offset: 768)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !54, line: 161, size: 192, align: 64, elements: !72)
!72 = !{!73, !74, !76}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !71, file: !54, line: 162, baseType: !70, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !71, file: !54, line: 163, baseType: !75, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !71, file: !54, line: 167, baseType: !50, size: 32, align: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !53, file: !54, line: 267, baseType: !75, size: 64, align: 64, offset: 832)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !53, file: !54, line: 269, baseType: !50, size: 32, align: 32, offset: 896)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !53, file: !54, line: 273, baseType: !50, size: 32, align: 32, offset: 928)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !53, file: !54, line: 275, baseType: !81, size: 64, align: 64, offset: 960)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !22, line: 140, baseType: !23)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !53, file: !54, line: 279, baseType: !83, size: 16, align: 16, offset: 1024)
!83 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !53, file: !54, line: 280, baseType: !85, size: 8, align: 8, offset: 1040)
!85 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !53, file: !54, line: 281, baseType: !87, size: 8, align: 8, offset: 1048)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, align: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 1)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !53, file: !54, line: 285, baseType: !91, size: 64, align: 64, offset: 1088)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !54, line: 155, baseType: null)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !53, file: !54, line: 294, baseType: !94, size: 64, align: 64, offset: 1152)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !22, line: 141, baseType: !23)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !53, file: !54, line: 303, baseType: !96, size: 64, align: 64, offset: 1216)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !53, file: !54, line: 304, baseType: !96, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !53, file: !54, line: 305, baseType: !96, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !53, file: !54, line: 306, baseType: !96, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !53, file: !54, line: 307, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !53, file: !54, line: 309, baseType: !50, size: 32, align: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !53, file: !54, line: 311, baseType: !106, size: 160, align: 8, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 160, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !26, file: !13, line: 343, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !13, line: 316, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!11, !11, !58}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !26, file: !13, line: 344, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !13, line: 318, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!50, !11, !58, !11}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !26, file: !13, line: 345, baseType: !96, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !26, file: !13, line: 346, baseType: !121, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !13, line: 320, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!11, !11}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !26, file: !13, line: 350, baseType: !126, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !13, line: 278, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 236, size: 2176, align: 64, elements: !129)
!129 = !{!130, !135, !136, !137, !138, !139, !144, !146, !147, !148, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !128, file: !13, line: 241, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !13, line: 166, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!11, !11, !11}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !128, file: !13, line: 242, baseType: !131, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !128, file: !13, line: 243, baseType: !131, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !128, file: !13, line: 244, baseType: !131, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !128, file: !13, line: 245, baseType: !131, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !128, file: !13, line: 246, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !13, line: 167, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!11, !11, !11, !11}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !128, file: !13, line: 247, baseType: !145, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !13, line: 165, baseType: !122)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !128, file: !13, line: 248, baseType: !145, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !128, file: !13, line: 249, baseType: !145, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !128, file: !13, line: 250, baseType: !149, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !13, line: 168, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!50, !11}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !128, file: !13, line: 251, baseType: !145, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !128, file: !13, line: 252, baseType: !131, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !128, file: !13, line: 253, baseType: !131, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !128, file: !13, line: 254, baseType: !131, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !128, file: !13, line: 255, baseType: !131, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !128, file: !13, line: 256, baseType: !131, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !128, file: !13, line: 257, baseType: !145, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !128, file: !13, line: 258, baseType: !96, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !128, file: !13, line: 259, baseType: !145, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !128, file: !13, line: 261, baseType: !131, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !128, file: !13, line: 262, baseType: !131, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !128, file: !13, line: 263, baseType: !131, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !128, file: !13, line: 264, baseType: !131, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !128, file: !13, line: 265, baseType: !140, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !128, file: !13, line: 266, baseType: !131, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !128, file: !13, line: 267, baseType: !131, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !128, file: !13, line: 268, baseType: !131, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !128, file: !13, line: 269, baseType: !131, size: 64, align: 64, offset: 1728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !128, file: !13, line: 270, baseType: !131, size: 64, align: 64, offset: 1792)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !128, file: !13, line: 272, baseType: !131, size: 64, align: 64, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !128, file: !13, line: 273, baseType: !131, size: 64, align: 64, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !128, file: !13, line: 274, baseType: !131, size: 64, align: 64, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !128, file: !13, line: 275, baseType: !131, size: 64, align: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !128, file: !13, line: 277, baseType: !145, size: 64, align: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !26, file: !13, line: 351, baseType: !178, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !13, line: 292, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 280, size: 640, align: 64, elements: !181)
!181 = !{!182, !187, !188, !193, !194, !195, !200, !201, !206, !207}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !180, file: !13, line: 281, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !13, line: 169, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!17, !11}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !180, file: !13, line: 282, baseType: !131, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !180, file: !13, line: 283, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !13, line: 170, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!11, !11, !17}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !180, file: !13, line: 284, baseType: !189, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !180, file: !13, line: 285, baseType: !96, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !180, file: !13, line: 286, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !13, line: 172, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!50, !11, !17, !11}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !180, file: !13, line: 287, baseType: !96, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !180, file: !13, line: 288, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !13, line: 231, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!50, !11, !11}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !180, file: !13, line: 290, baseType: !131, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !180, file: !13, line: 291, baseType: !189, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !26, file: !13, line: 352, baseType: !209, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !13, line: 298, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 294, size: 192, align: 64, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !211, file: !13, line: 295, baseType: !183, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !211, file: !13, line: 296, baseType: !131, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !211, file: !13, line: 297, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !13, line: 174, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!50, !11, !11, !11}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !26, file: !13, line: 356, baseType: !221, size: 64, align: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !13, line: 321, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !11}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !18, line: 186, baseType: !17)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !26, file: !13, line: 357, baseType: !140, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !26, file: !13, line: 358, baseType: !121, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !26, file: !13, line: 359, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !13, line: 317, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !26, file: !13, line: 360, baseType: !231, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !13, line: 319, baseType: !217)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !26, file: !13, line: 363, baseType: !233, size: 64, align: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !13, line: 304, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 301, size: 128, align: 64, elements: !236)
!236 = !{!237, !258}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !235, file: !13, line: 302, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !13, line: 193, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!50, !11, !242, !50}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !13, line: 191, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !13, line: 178, size: 640, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !255, !256, !257}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !244, file: !13, line: 179, baseType: !96, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !244, file: !13, line: 180, baseType: !11, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !13, line: 181, baseType: !17, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !244, file: !13, line: 182, baseType: !17, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !244, file: !13, line: 184, baseType: !50, size: 32, align: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !244, file: !13, line: 185, baseType: !50, size: 32, align: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !244, file: !13, line: 186, baseType: !58, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !244, file: !13, line: 187, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !244, file: !13, line: 188, baseType: !254, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !244, file: !13, line: 189, baseType: !254, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !244, file: !13, line: 190, baseType: !96, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !235, file: !13, line: 303, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !13, line: 194, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !11, !242}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !26, file: !13, line: 366, baseType: !103, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !26, file: !13, line: 368, baseType: !35, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !26, file: !13, line: 372, baseType: !266, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !13, line: 233, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!50, !11, !270, !96}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !13, line: 232, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!50, !11, !96}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !26, file: !13, line: 375, baseType: !149, size: 64, align: 64, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !26, file: !13, line: 379, baseType: !276, size: 64, align: 64, offset: 1600)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !13, line: 322, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!11, !11, !11, !50}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !26, file: !13, line: 382, baseType: !17, size: 64, align: 64, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !26, file: !13, line: 385, baseType: !282, size: 64, align: 64, offset: 1728)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !13, line: 323, baseType: !122)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !26, file: !13, line: 386, baseType: !284, size: 64, align: 64, offset: 1792)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !13, line: 324, baseType: !122)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !26, file: !13, line: 389, baseType: !286, size: 64, align: 64, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 40, size: 256, align: 64, elements: !289)
!288 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 41, baseType: !35, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 18, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 43, baseType: !50, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 45, baseType: !35, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !26, file: !13, line: 390, baseType: !296, size: 64, align: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !298, line: 18, size: 320, align: 64, elements: !299)
!298 = !DIFile(filename: "Include/structmember.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!299 = !{!300, !301, !302, !303, !304}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !297, file: !298, line: 19, baseType: !58, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !297, file: !298, line: 20, baseType: !50, size: 32, align: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !297, file: !298, line: 21, baseType: !17, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !297, file: !298, line: 22, baseType: !50, size: 32, align: 32, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !297, file: !298, line: 23, baseType: !58, size: 64, align: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !26, file: !13, line: 391, baseType: !306, size: 64, align: 64, offset: 1984)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !308, line: 11, size: 320, align: 64, elements: !309)
!308 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!309 = !{!310, !311, !316, !321, !322}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !307, file: !308, line: 12, baseType: !58, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !307, file: !308, line: 13, baseType: !312, size: 64, align: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !308, line: 8, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!11, !11, !96}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !307, file: !308, line: 14, baseType: !317, size: 64, align: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !308, line: 9, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!50, !11, !11, !96}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !307, file: !308, line: 15, baseType: !58, size: 64, align: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !307, file: !308, line: 16, baseType: !96, size: 64, align: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !26, file: !13, line: 392, baseType: !25, size: 64, align: 64, offset: 2048)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !26, file: !13, line: 393, baseType: !11, size: 64, align: 64, offset: 2112)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !26, file: !13, line: 394, baseType: !326, size: 64, align: 64, offset: 2176)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !13, line: 325, baseType: !141)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !26, file: !13, line: 395, baseType: !328, size: 64, align: 64, offset: 2240)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !13, line: 326, baseType: !217)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !26, file: !13, line: 396, baseType: !17, size: 64, align: 64, offset: 2304)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !26, file: !13, line: 397, baseType: !331, size: 64, align: 64, offset: 2368)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !13, line: 327, baseType: !217)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !26, file: !13, line: 398, baseType: !333, size: 64, align: 64, offset: 2432)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !13, line: 329, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!11, !25, !17}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !26, file: !13, line: 399, baseType: !338, size: 64, align: 64, offset: 2496)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !13, line: 328, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!11, !25, !11, !11}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !26, file: !13, line: 400, baseType: !343, size: 64, align: 64, offset: 2560)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !13, line: 307, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !96}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !26, file: !13, line: 401, baseType: !149, size: 64, align: 64, offset: 2624)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !26, file: !13, line: 402, baseType: !11, size: 64, align: 64, offset: 2688)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !26, file: !13, line: 403, baseType: !11, size: 64, align: 64, offset: 2752)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !26, file: !13, line: 404, baseType: !11, size: 64, align: 64, offset: 2816)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !26, file: !13, line: 405, baseType: !11, size: 64, align: 64, offset: 2880)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !26, file: !13, line: 406, baseType: !11, size: 64, align: 64, offset: 2944)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !26, file: !13, line: 407, baseType: !41, size: 64, align: 64, offset: 3008)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !26, file: !13, line: 410, baseType: !355, size: 32, align: 32, offset: 3072)
!355 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !26, file: !13, line: 412, baseType: !41, size: 64, align: 64, offset: 3136)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyByteArrayObject", file: !359, line: 30, baseType: !360)
!359 = !DIFile(filename: "Include/bytearrayobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!360 = !DICompositeType(tag: DW_TAG_structure_type, file: !359, line: 23, size: 448, align: 64, elements: !361)
!361 = !{!362, !363, !364, !365, !366}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !360, file: !359, line: 24, baseType: !29, size: 192, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ob_alloc", scope: !360, file: !359, line: 25, baseType: !17, size: 64, align: 64, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ob_bytes", scope: !360, file: !359, line: 26, baseType: !58, size: 64, align: 64, offset: 256)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ob_start", scope: !360, file: !359, line: 27, baseType: !58, size: 64, align: 64, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ob_exports", scope: !360, file: !359, line: 29, baseType: !50, size: 32, align: 32, offset: 384)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!368 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_uintptr_t", file: !18, line: 153, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !373, line: 122, baseType: !103)
!373 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !376, line: 33, baseType: !377)
!376 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!377 = !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 25, size: 256, align: 64, elements: !378)
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !377, file: !376, line: 26, baseType: !29, size: 192, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !377, file: !376, line: 27, baseType: !381, size: 64, align: 64, offset: 192)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 64, align: 64, elements: !88)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !384)
!384 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !385)
!385 = !{!386, !387, !388, !389, !397}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !384, file: !4, line: 291, baseType: !12, size: 128, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !384, file: !4, line: 292, baseType: !17, size: 64, align: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !384, file: !4, line: 293, baseType: !225, size: 64, align: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !384, file: !4, line: 349, baseType: !390, size: 32, align: 32, offset: 256)
!390 = !DICompositeType(tag: DW_TAG_structure_type, scope: !384, file: !4, line: 294, size: 32, align: 32, elements: !391)
!391 = !{!392, !393, !394, !395, !396}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !390, file: !4, line: 303, baseType: !355, size: 2, align: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !390, file: !4, line: 331, baseType: !355, size: 3, align: 32, offset: 2)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !390, file: !4, line: 336, baseType: !355, size: 1, align: 32, offset: 5)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !390, file: !4, line: 340, baseType: !355, size: 1, align: 32, offset: 6)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !390, file: !4, line: 345, baseType: !355, size: 1, align: 32, offset: 7)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !384, file: !4, line: 350, baseType: !398, size: 64, align: 64, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !102, line: 90, baseType: !50)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !402)
!402 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !403)
!403 = !{!404, !405, !406, !407}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !402, file: !4, line: 357, baseType: !383, size: 384, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !402, file: !4, line: 358, baseType: !17, size: 64, align: 64, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !402, file: !4, line: 360, baseType: !58, size: 64, align: 64, offset: 448)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !402, file: !4, line: 361, baseType: !17, size: 64, align: 64, offset: 512)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !410)
!410 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !411)
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !410, file: !4, line: 369, baseType: !401, size: 576, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !410, file: !4, line: 375, baseType: !414, size: 64, align: 64, offset: 576)
!414 = !DICompositeType(tag: DW_TAG_union_type, scope: !410, file: !4, line: 370, size: 64, align: 64, elements: !415)
!415 = !{!416, !417, !420, !423}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !414, file: !4, line: 371, baseType: !96, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !414, file: !4, line: 372, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !368)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !414, file: !4, line: 373, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !83)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !414, file: !4, line: 374, baseType: !424, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !355)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !419)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !434, line: 40, baseType: !435)
!434 = !DIFile(filename: "Include/listobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!435 = !DICompositeType(tag: DW_TAG_structure_type, file: !434, line: 23, size: 320, align: 64, elements: !436)
!436 = !{!437, !438, !440}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !435, file: !434, line: 24, baseType: !29, size: 192, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !435, file: !434, line: 26, baseType: !439, size: 64, align: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !435, file: !434, line: 39, baseType: !17, size: 64, align: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !444, line: 253, baseType: !445)
!444 = !DIFile(filename: "Include/objimpl.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!445 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !444, line: 246, size: 192, align: 64, elements: !446)
!446 = !{!447, !454}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !445, file: !444, line: 251, baseType: !448, size: 192, align: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, scope: !445, file: !444, line: 247, size: 192, align: 64, elements: !449)
!449 = !{!450, !452, !453}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !448, file: !444, line: 248, baseType: !451, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !448, file: !444, line: 249, baseType: !451, size: 64, align: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !448, file: !444, line: 250, baseType: !17, size: 64, align: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !445, file: !444, line: 252, baseType: !455, size: 64, align: 64)
!455 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "bytesiterobject", file: !1, line: 2954, baseType: !458)
!458 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 2950, size: 256, align: 64, elements: !459)
!459 = !{!460, !461, !462}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !458, file: !1, line: 2951, baseType: !12, size: 128, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "it_index", scope: !458, file: !1, line: 2952, baseType: !17, size: 64, align: 64, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "it_seq", scope: !458, file: !1, line: 2953, baseType: !357, size: 64, align: 64, offset: 192)
!463 = !{!464, !468, !471, !474, !488, !491, !496, !506, !514, !519, !526, !531, !549, !554, !568, !572, !580, !597, !610, !623, !632, !643, !670, !691, !700, !710, !731, !770, !773, !782, !788, !800, !803, !806, !817, !822, !826, !832, !837, !846, !855, !858, !861, !874, !887, !906, !915, !922, !933, !946, !966, !1016, !1021, !1036, !1046, !1054, !1062, !1079, !1084, !1089, !1098, !1101, !1104, !1107, !1110, !1113, !1116, !1119, !1123, !1172, !1178, !1182, !1194, !1203, !1207, !1215, !1238, !1246, !1254, !1264, !1274, !1279, !1294, !1310, !1321, !1337, !1352, !1367, !1385, !1403, !1413, !1418, !1423, !1429, !1437, !1457, !1472, !1510, !1547, !1589, !1600, !1607, !1620, !1655, !1691, !1731, !1737, !1761, !1772, !1784, !1788, !1792, !1822, !1826, !1834, !1869, !1881, !1892, !1901, !1905, !1911, !1918}
!464 = !DISubprogram(name: "PyByteArray_Fini", scope: !1, file: !1, line: 11, type: !465, isLocal: false, isDefinition: true, scopeLine: 12, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyByteArray_Fini, variables: !467)
!465 = !DISubroutineType(types: !466)
!466 = !{null}
!467 = !{}
!468 = !DISubprogram(name: "PyByteArray_Init", scope: !1, file: !1, line: 16, type: !469, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @PyByteArray_Init, variables: !467)
!469 = !DISubroutineType(types: !470)
!470 = !{!50}
!471 = !DISubprogram(name: "PyByteArray_FromObject", scope: !1, file: !1, line: 109, type: !123, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyByteArray_FromObject, variables: !472)
!472 = !{!473}
!473 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !471, file: !1, line: 109, type: !11)
!474 = !DISubprogram(name: "PyByteArray_FromStringAndSize", scope: !1, file: !1, line: 116, type: !475, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i64)* @PyByteArray_FromStringAndSize, variables: !477)
!475 = !DISubroutineType(types: !476)
!476 = !{!11, !35, !17}
!477 = !{!478, !479, !480, !481, !482}
!478 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bytes", arg: 1, scope: !474, file: !1, line: 116, type: !35)
!479 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !474, file: !1, line: 116, type: !17)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new", scope: !474, file: !1, line: 118, type: !357)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alloc", scope: !474, file: !1, line: 119, type: !17)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !483, file: !1, line: 144, type: !11)
!483 = distinct !DILexicalBlock(scope: !484, file: !1, line: 144, column: 13)
!484 = distinct !DILexicalBlock(scope: !485, file: !1, line: 143, column: 36)
!485 = distinct !DILexicalBlock(scope: !486, file: !1, line: 143, column: 13)
!486 = distinct !DILexicalBlock(scope: !487, file: !1, line: 140, column: 10)
!487 = distinct !DILexicalBlock(scope: !474, file: !1, line: 136, column: 9)
!488 = !DISubprogram(name: "PyByteArray_Size", scope: !1, file: !1, line: 160, type: !185, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyByteArray_Size, variables: !489)
!489 = !{!490}
!490 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !488, file: !1, line: 160, type: !11)
!491 = !DISubprogram(name: "PyByteArray_AsString", scope: !1, file: !1, line: 169, type: !492, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct._object*)* @PyByteArray_AsString, variables: !494)
!492 = !DISubroutineType(types: !493)
!493 = !{!58, !11}
!494 = !{!495}
!495 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !491, file: !1, line: 169, type: !11)
!496 = !DISubprogram(name: "PyByteArray_Resize", scope: !1, file: !1, line: 178, type: !497, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64)* @PyByteArray_Resize, variables: !499)
!497 = !DISubroutineType(types: !498)
!498 = !{!50, !11, !17}
!499 = !{!500, !501, !502, !503, !504, !505}
!500 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !496, file: !1, line: 178, type: !11)
!501 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !496, file: !1, line: 178, type: !17)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sval", scope: !496, file: !1, line: 180, type: !96)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !496, file: !1, line: 181, type: !357)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alloc", scope: !496, file: !1, line: 182, type: !17)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "logical_offset", scope: !496, file: !1, line: 183, type: !17)
!506 = !DISubprogram(name: "PyByteArray_Concat", scope: !1, file: !1, line: 250, type: !133, isLocal: false, isDefinition: true, scopeLine: 251, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyByteArray_Concat, variables: !507)
!507 = !{!508, !509, !510, !511, !512, !513}
!508 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !506, file: !1, line: 250, type: !11)
!509 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !506, file: !1, line: 250, type: !11)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !506, file: !1, line: 252, type: !17)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "va", scope: !506, file: !1, line: 253, type: !243)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vb", scope: !506, file: !1, line: 253, type: !243)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !506, file: !1, line: 254, type: !357)
!514 = !DISubprogram(name: "_canresize", scope: !1, file: !1, line: 96, type: !515, isLocal: true, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, variables: !517)
!515 = !DISubroutineType(types: !516)
!516 = !{!50, !357}
!517 = !{!518}
!518 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !514, file: !1, line: 96, type: !357)
!519 = !DISubprogram(name: "_getbuffer", scope: !1, file: !1, line: 78, type: !520, isLocal: true, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, variables: !522)
!520 = !DISubroutineType(types: !521)
!521 = !{!17, !11, !242}
!522 = !{!523, !524, !525}
!523 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !519, file: !1, line: 78, type: !11)
!524 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 2, scope: !519, file: !1, line: 78, type: !242)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !519, file: !1, line: 80, type: !233)
!526 = !DISubprogram(name: "bytearray_dealloc", scope: !1, file: !1, line: 1058, type: !527, isLocal: true, isDefinition: true, scopeLine: 1059, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyByteArrayObject*)* @bytearray_dealloc, variables: !529)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !357}
!529 = !{!530}
!530 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !526, file: !1, line: 1058, type: !357)
!531 = !DISubprogram(name: "bytearray_repr", scope: !1, file: !1, line: 892, type: !532, isLocal: true, isDefinition: true, scopeLine: 893, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyByteArrayObject*)* @bytearray_repr, variables: !534)
!532 = !DISubroutineType(types: !533)
!533 = !{!11, !357}
!534 = !{!535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548}
!535 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !531, file: !1, line: 892, type: !357)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "quote_prefix", scope: !531, file: !1, line: 894, type: !35)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "quote_postfix", scope: !531, file: !1, line: 895, type: !35)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !531, file: !1, line: 896, type: !17)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newsize", scope: !531, file: !1, line: 898, type: !101)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !531, file: !1, line: 899, type: !11)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !531, file: !1, line: 900, type: !17)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !531, file: !1, line: 901, type: !58)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !531, file: !1, line: 902, type: !37)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !531, file: !1, line: 903, type: !58)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "quote", scope: !531, file: !1, line: 904, type: !50)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "test", scope: !531, file: !1, line: 905, type: !58)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !531, file: !1, line: 905, type: !58)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !531, file: !1, line: 906, type: !58)
!549 = !DISubprogram(name: "bytearray_length", scope: !1, file: !1, line: 288, type: !550, isLocal: true, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.PyByteArrayObject*)* @bytearray_length, variables: !552)
!550 = !DISubroutineType(types: !551)
!551 = !{!17, !357}
!552 = !{!553}
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !549, file: !1, line: 288, type: !357)
!554 = !DISubprogram(name: "bytearray_repeat", scope: !1, file: !1, line: 327, type: !555, isLocal: true, isDefinition: true, scopeLine: 328, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyByteArrayObject*, i64)* @bytearray_repeat, variables: !557)
!555 = !DISubroutineType(types: !556)
!556 = !{!11, !357, !17}
!557 = !{!558, !559, !560, !561, !562, !563}
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !554, file: !1, line: 327, type: !357)
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "count", arg: 2, scope: !554, file: !1, line: 327, type: !17)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !554, file: !1, line: 329, type: !357)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mysize", scope: !554, file: !1, line: 330, type: !17)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !554, file: !1, line: 331, type: !17)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !564, file: !1, line: 344, type: !17)
!564 = distinct !DILexicalBlock(scope: !565, file: !1, line: 343, column: 14)
!565 = distinct !DILexicalBlock(scope: !566, file: !1, line: 341, column: 13)
!566 = distinct !DILexicalBlock(scope: !567, file: !1, line: 340, column: 38)
!567 = distinct !DILexicalBlock(scope: !554, file: !1, line: 340, column: 9)
!568 = !DISubprogram(name: "bytearray_getitem", scope: !1, file: !1, line: 382, type: !555, isLocal: true, isDefinition: true, scopeLine: 383, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyByteArrayObject*, i64)* @bytearray_getitem, variables: !569)
!569 = !{!570, !571}
!570 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !568, file: !1, line: 382, type: !357)
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !568, file: !1, line: 382, type: !17)
!572 = !DISubprogram(name: "bytearray_setitem", scope: !1, file: !1, line: 582, type: !573, isLocal: true, isDefinition: true, scopeLine: 583, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyByteArrayObject*, i64, %struct._object*)* @bytearray_setitem, variables: !575)
!573 = !DISubroutineType(types: !574)
!574 = !{!50, !357, !17, !11}
!575 = !{!576, !577, !578, !579}
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !572, file: !1, line: 582, type: !357)
!577 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !572, file: !1, line: 582, type: !17)
!578 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !572, file: !1, line: 582, type: !11)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ival", scope: !572, file: !1, line: 584, type: !50)
!580 = !DISubprogram(name: "bytearray_setslice", scope: !1, file: !1, line: 533, type: !581, isLocal: true, isDefinition: true, scopeLine: 535, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyByteArrayObject*, i64, i64, %struct._object*)* @bytearray_setslice, variables: !583)
!581 = !DISubroutineType(types: !582)
!582 = !{!50, !357, !17, !17, !11}
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592, !595}
!584 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !580, file: !1, line: 533, type: !357)
!585 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lo", arg: 2, scope: !580, file: !1, line: 533, type: !17)
!586 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hi", arg: 3, scope: !580, file: !1, line: 533, type: !17)
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "values", arg: 4, scope: !580, file: !1, line: 534, type: !11)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "needed", scope: !580, file: !1, line: 536, type: !17)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !580, file: !1, line: 537, type: !96)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vbytes", scope: !580, file: !1, line: 538, type: !243)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !580, file: !1, line: 539, type: !50)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !593, file: !1, line: 544, type: !50)
!593 = distinct !DILexicalBlock(scope: !594, file: !1, line: 542, column: 37)
!594 = distinct !DILexicalBlock(scope: !580, file: !1, line: 542, column: 9)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !596, file: !1, line: 549, type: !11)
!596 = distinct !DILexicalBlock(scope: !593, file: !1, line: 549, column: 9)
!597 = !DISubprogram(name: "bytearray_setslice_linear", scope: !1, file: !1, line: 449, type: !598, isLocal: true, isDefinition: true, scopeLine: 452, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyByteArrayObject*, i64, i64, i8*, i64)* @bytearray_setslice_linear, variables: !600)
!598 = !DISubroutineType(types: !599)
!599 = !{!50, !357, !17, !17, !58, !17}
!600 = !{!601, !602, !603, !604, !605, !606, !607, !608, !609}
!601 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !597, file: !1, line: 449, type: !357)
!602 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lo", arg: 2, scope: !597, file: !1, line: 450, type: !17)
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hi", arg: 3, scope: !597, file: !1, line: 450, type: !17)
!604 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bytes", arg: 4, scope: !597, file: !1, line: 451, type: !58)
!605 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bytes_len", arg: 5, scope: !597, file: !1, line: 451, type: !17)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "avail", scope: !597, file: !1, line: 453, type: !17)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !597, file: !1, line: 454, type: !58)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "growth", scope: !597, file: !1, line: 455, type: !17)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !597, file: !1, line: 456, type: !50)
!610 = !DISubprogram(name: "_getbytevalue", scope: !1, file: !1, line: 26, type: !611, isLocal: true, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i32*)* @_getbytevalue, variables: !614)
!611 = !DISubroutineType(types: !612)
!612 = !{!50, !11, !613}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!614 = !{!615, !616, !617, !618, !621}
!615 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 1, scope: !610, file: !1, line: 26, type: !11)
!616 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !610, file: !1, line: 26, type: !613)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "face_value", scope: !610, file: !1, line: 28, type: !23)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !619, file: !1, line: 33, type: !11)
!619 = distinct !DILexicalBlock(scope: !620, file: !1, line: 32, column: 12)
!620 = distinct !DILexicalBlock(scope: !610, file: !1, line: 30, column: 9)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !622, file: !1, line: 40, type: !11)
!622 = distinct !DILexicalBlock(scope: !619, file: !1, line: 40, column: 9)
!623 = !DISubprogram(name: "bytearray_contains", scope: !1, file: !1, line: 1307, type: !204, isLocal: true, isDefinition: true, scopeLine: 1308, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*)* @bytearray_contains, variables: !624)
!624 = !{!625, !626, !627, !628, !631}
!625 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !623, file: !1, line: 1307, type: !11)
!626 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !623, file: !1, line: 1307, type: !11)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ival", scope: !623, file: !1, line: 1309, type: !17)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "varg", scope: !629, file: !1, line: 1311, type: !243)
!629 = distinct !DILexicalBlock(scope: !630, file: !1, line: 1310, column: 41)
!630 = distinct !DILexicalBlock(scope: !623, file: !1, line: 1310, column: 9)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !629, file: !1, line: 1312, type: !17)
!632 = !DISubprogram(name: "stringlib_find", scope: !633, file: !633, line: 8, type: !634, isLocal: true, isDefinition: true, scopeLine: 11, flags: DIFlagPrototyped, isOptimized: true, variables: !636)
!633 = !DIFile(filename: "Objects/stringlib/find.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!634 = !DISubroutineType(types: !635)
!635 = !{!17, !35, !17, !35, !17, !17}
!636 = !{!637, !638, !639, !640, !641, !642}
!637 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !632, file: !633, line: 8, type: !35)
!638 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str_len", arg: 2, scope: !632, file: !633, line: 8, type: !17)
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sub", arg: 3, scope: !632, file: !633, line: 9, type: !35)
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sub_len", arg: 4, scope: !632, file: !633, line: 9, type: !17)
!641 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "offset", arg: 5, scope: !632, file: !633, line: 10, type: !17)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !632, file: !633, line: 12, type: !17)
!643 = !DISubprogram(name: "fastsearch", scope: !644, file: !644, line: 84, type: !645, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8*, i64, i8*, i64, i64, i32)* @fastsearch, variables: !647)
!644 = !DIFile(filename: "Objects/stringlib/fastsearch.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!645 = !DISubroutineType(types: !646)
!646 = !{!17, !35, !17, !35, !17, !17, !50}
!647 = !{!648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !666, !669}
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !643, file: !644, line: 84, type: !35)
!649 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !643, file: !644, line: 84, type: !17)
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 3, scope: !643, file: !644, line: 85, type: !35)
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 4, scope: !643, file: !644, line: 85, type: !17)
!652 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxcount", arg: 5, scope: !643, file: !644, line: 86, type: !17)
!653 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 6, scope: !643, file: !644, line: 86, type: !50)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mask", scope: !643, file: !644, line: 88, type: !103)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "skip", scope: !643, file: !644, line: 89, type: !17)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !643, file: !644, line: 89, type: !17)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !643, file: !644, line: 90, type: !17)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !643, file: !644, line: 90, type: !17)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mlast", scope: !643, file: !644, line: 90, type: !17)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !643, file: !644, line: 90, type: !17)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "needle", scope: !662, file: !644, line: 109, type: !368)
!662 = distinct !DILexicalBlock(scope: !663, file: !644, line: 106, column: 24)
!663 = distinct !DILexicalBlock(scope: !664, file: !644, line: 102, column: 13)
!664 = distinct !DILexicalBlock(scope: !665, file: !644, line: 98, column: 17)
!665 = distinct !DILexicalBlock(scope: !643, file: !644, line: 98, column: 9)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ss", scope: !667, file: !644, line: 145, type: !35)
!667 = distinct !DILexicalBlock(scope: !668, file: !644, line: 144, column: 31)
!668 = distinct !DILexicalBlock(scope: !643, file: !644, line: 144, column: 9)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pp", scope: !667, file: !644, line: 146, type: !35)
!670 = !DISubprogram(name: "stringlib_fastsearch_memchr_1char", scope: !644, file: !644, line: 37, type: !671, isLocal: true, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, variables: !673)
!671 = !DISubroutineType(types: !672)
!672 = !{!17, !35, !17, !37, !368, !17, !50}
!673 = !{!674, !675, !676, !677, !678, !679, !680, !683, !684, !686, !690}
!674 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !670, file: !644, line: 37, type: !35)
!675 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !670, file: !644, line: 37, type: !17)
!676 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ch", arg: 3, scope: !670, file: !644, line: 38, type: !37)
!677 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "needle", arg: 4, scope: !670, file: !644, line: 38, type: !368)
!678 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxcount", arg: 5, scope: !670, file: !644, line: 39, type: !17)
!679 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 6, scope: !670, file: !644, line: 39, type: !50)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !681, file: !644, line: 42, type: !35)
!681 = distinct !DILexicalBlock(scope: !682, file: !644, line: 41, column: 30)
!682 = distinct !DILexicalBlock(scope: !670, file: !644, line: 41, column: 9)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !681, file: !644, line: 43, type: !35)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "candidate", scope: !685, file: !644, line: 45, type: !96)
!685 = distinct !DILexicalBlock(scope: !681, file: !644, line: 44, column: 25)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "found", scope: !687, file: !644, line: 62, type: !35)
!687 = distinct !DILexicalBlock(scope: !688, file: !644, line: 61, column: 23)
!688 = distinct !DILexicalBlock(scope: !689, file: !644, line: 60, column: 36)
!689 = distinct !DILexicalBlock(scope: !682, file: !644, line: 60, column: 14)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "candidate", scope: !687, file: !644, line: 63, type: !96)
!691 = !DISubprogram(name: "bytearray_iconcat", scope: !1, file: !1, line: 294, type: !692, isLocal: true, isDefinition: true, scopeLine: 295, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyByteArrayObject*, %struct._object*)* @bytearray_iconcat, variables: !694)
!692 = !DISubroutineType(types: !693)
!693 = !{!11, !357, !11}
!694 = !{!695, !696, !697, !698, !699}
!695 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !691, file: !1, line: 294, type: !357)
!696 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "other", arg: 2, scope: !691, file: !1, line: 294, type: !11)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mysize", scope: !691, file: !1, line: 296, type: !17)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !691, file: !1, line: 297, type: !17)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vo", scope: !691, file: !1, line: 298, type: !243)
!700 = !DISubprogram(name: "bytearray_irepeat", scope: !1, file: !1, line: 353, type: !555, isLocal: true, isDefinition: true, scopeLine: 354, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyByteArrayObject*, i64)* @bytearray_irepeat, variables: !701)
!701 = !{!702, !703, !704, !705, !706, !707}
!702 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !700, file: !1, line: 353, type: !357)
!703 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "count", arg: 2, scope: !700, file: !1, line: 353, type: !17)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mysize", scope: !700, file: !1, line: 355, type: !17)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !700, file: !1, line: 356, type: !17)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !700, file: !1, line: 357, type: !58)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !708, file: !1, line: 372, type: !17)
!708 = distinct !DILexicalBlock(scope: !709, file: !1, line: 371, column: 10)
!709 = distinct !DILexicalBlock(scope: !700, file: !1, line: 369, column: 9)
!710 = !DISubprogram(name: "bytearray_subscript", scope: !1, file: !1, line: 394, type: !692, isLocal: true, isDefinition: true, scopeLine: 395, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyByteArrayObject*, %struct._object*)* @bytearray_subscript, variables: !711)
!711 = !{!712, !713, !714, !717, !720, !721, !722, !723, !724, !725, !729, !730}
!712 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !710, file: !1, line: 394, type: !357)
!713 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 2, scope: !710, file: !1, line: 394, type: !11)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !715, file: !1, line: 397, type: !17)
!715 = distinct !DILexicalBlock(scope: !716, file: !1, line: 396, column: 31)
!716 = distinct !DILexicalBlock(scope: !710, file: !1, line: 396, column: 9)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !718, file: !1, line: 412, type: !17)
!718 = distinct !DILexicalBlock(scope: !719, file: !1, line: 411, column: 36)
!719 = distinct !DILexicalBlock(scope: !716, file: !1, line: 411, column: 14)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stop", scope: !718, file: !1, line: 412, type: !17)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step", scope: !718, file: !1, line: 412, type: !17)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slicelength", scope: !718, file: !1, line: 412, type: !17)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur", scope: !718, file: !1, line: 412, type: !17)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !718, file: !1, line: 412, type: !17)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "source_buf", scope: !726, file: !1, line: 426, type: !58)
!726 = distinct !DILexicalBlock(scope: !727, file: !1, line: 425, column: 14)
!727 = distinct !DILexicalBlock(scope: !728, file: !1, line: 421, column: 18)
!728 = distinct !DILexicalBlock(scope: !718, file: !1, line: 419, column: 13)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result_buf", scope: !726, file: !1, line: 427, type: !58)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !726, file: !1, line: 428, type: !11)
!731 = !DISubprogram(name: "bytearray_ass_subscript", scope: !1, file: !1, line: 605, type: !732, isLocal: true, isDefinition: true, scopeLine: 606, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyByteArrayObject*, %struct._object*, %struct._object*)* @bytearray_ass_subscript, variables: !734)
!732 = !DISubroutineType(types: !733)
!733 = !{!50, !357, !11, !11}
!734 = !{!735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !748, !751, !755, !757, !762, !763, !767, !769}
!735 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !731, file: !1, line: 605, type: !357)
!736 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 2, scope: !731, file: !1, line: 605, type: !11)
!737 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "values", arg: 3, scope: !731, file: !1, line: 605, type: !11)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !731, file: !1, line: 607, type: !17)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stop", scope: !731, file: !1, line: 607, type: !17)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step", scope: !731, file: !1, line: 607, type: !17)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slicelen", scope: !731, file: !1, line: 607, type: !17)
!742 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "needed", scope: !731, file: !1, line: 607, type: !17)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !731, file: !1, line: 608, type: !58)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !731, file: !1, line: 608, type: !58)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !746, file: !1, line: 612, type: !17)
!746 = distinct !DILexicalBlock(scope: !747, file: !1, line: 611, column: 31)
!747 = distinct !DILexicalBlock(scope: !731, file: !1, line: 611, column: 9)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ival", scope: !749, file: !1, line: 633, type: !50)
!749 = distinct !DILexicalBlock(scope: !750, file: !1, line: 632, column: 14)
!750 = distinct !DILexicalBlock(scope: !746, file: !1, line: 625, column: 13)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !752, file: !1, line: 657, type: !50)
!752 = distinct !DILexicalBlock(scope: !753, file: !1, line: 656, column: 72)
!753 = distinct !DILexicalBlock(scope: !754, file: !1, line: 656, column: 14)
!754 = distinct !DILexicalBlock(scope: !731, file: !1, line: 652, column: 9)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !756, file: !1, line: 669, type: !11)
!756 = distinct !DILexicalBlock(scope: !752, file: !1, line: 669, column: 9)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur", scope: !758, file: !1, line: 687, type: !101)
!758 = distinct !DILexicalBlock(scope: !759, file: !1, line: 685, column: 26)
!759 = distinct !DILexicalBlock(scope: !760, file: !1, line: 685, column: 13)
!760 = distinct !DILexicalBlock(scope: !761, file: !1, line: 684, column: 10)
!761 = distinct !DILexicalBlock(scope: !731, file: !1, line: 681, column: 9)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !758, file: !1, line: 688, type: !17)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lim", scope: !764, file: !1, line: 704, type: !17)
!764 = distinct !DILexicalBlock(scope: !765, file: !1, line: 703, column: 50)
!765 = distinct !DILexicalBlock(scope: !766, file: !1, line: 702, column: 13)
!766 = distinct !DILexicalBlock(scope: !758, file: !1, line: 702, column: 13)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !768, file: !1, line: 727, type: !17)
!768 = distinct !DILexicalBlock(scope: !759, file: !1, line: 725, column: 14)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur", scope: !768, file: !1, line: 728, type: !101)
!770 = !DISubprogram(name: "bytearray_str", scope: !1, file: !1, line: 975, type: !123, isLocal: true, isDefinition: true, scopeLine: 976, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @bytearray_str, variables: !771)
!771 = !{!772}
!772 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !770, file: !1, line: 975, type: !11)
!773 = !DISubprogram(name: "bytearray_getbuffer", scope: !1, file: !1, line: 55, type: !774, isLocal: true, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyByteArrayObject*, %struct.bufferinfo*, i32)* @bytearray_getbuffer, variables: !776)
!774 = !DISubroutineType(types: !775)
!775 = !{!50, !357, !242, !50}
!776 = !{!777, !778, !779, !780, !781}
!777 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !773, file: !1, line: 55, type: !357)
!778 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 2, scope: !773, file: !1, line: 55, type: !242)
!779 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 3, scope: !773, file: !1, line: 55, type: !50)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !773, file: !1, line: 57, type: !50)
!781 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !773, file: !1, line: 58, type: !96)
!782 = !DISubprogram(name: "bytearray_releasebuffer", scope: !1, file: !1, line: 72, type: !783, isLocal: true, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyByteArrayObject*, %struct.bufferinfo*)* @bytearray_releasebuffer, variables: !785)
!783 = !DISubroutineType(types: !784)
!784 = !{null, !357, !242}
!785 = !{!786, !787}
!786 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !782, file: !1, line: 72, type: !357)
!787 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 2, scope: !782, file: !1, line: 72, type: !242)
!788 = !DISubprogram(name: "bytearray_richcompare", scope: !1, file: !1, line: 986, type: !278, isLocal: true, isDefinition: true, scopeLine: 987, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @bytearray_richcompare, variables: !789)
!789 = !{!790, !791, !792, !793, !794, !795, !796, !797, !798, !799}
!790 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !788, file: !1, line: 986, type: !11)
!791 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "other", arg: 2, scope: !788, file: !1, line: 986, type: !11)
!792 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !788, file: !1, line: 986, type: !50)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self_size", scope: !788, file: !1, line: 988, type: !17)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "other_size", scope: !788, file: !1, line: 988, type: !17)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self_bytes", scope: !788, file: !1, line: 989, type: !243)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "other_bytes", scope: !788, file: !1, line: 989, type: !243)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !788, file: !1, line: 990, type: !11)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "minsize", scope: !788, file: !1, line: 991, type: !17)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmp", scope: !788, file: !1, line: 992, type: !50)
!800 = !DISubprogram(name: "bytearray_alloc", scope: !1, file: !1, line: 2613, type: !532, isLocal: true, isDefinition: true, scopeLine: 2614, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyByteArrayObject*)* @bytearray_alloc, variables: !801)
!801 = !{!802}
!802 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !800, file: !1, line: 2613, type: !357)
!803 = !DISubprogram(name: "bytearray_reduce", scope: !1, file: !1, line: 2764, type: !532, isLocal: true, isDefinition: true, scopeLine: 2765, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyByteArrayObject*)* @bytearray_reduce, variables: !804)
!804 = !{!805}
!805 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !803, file: !1, line: 2764, type: !357)
!806 = !DISubprogram(name: "_common_reduce", scope: !1, file: !1, line: 2727, type: !807, isLocal: true, isDefinition: true, scopeLine: 2728, flags: DIFlagPrototyped, isOptimized: true, variables: !809)
!807 = !DISubroutineType(types: !808)
!808 = !{!11, !357, !50}
!809 = !{!810, !811, !812, !813, !814}
!810 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !806, file: !1, line: 2727, type: !357)
!811 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proto", arg: 2, scope: !806, file: !1, line: 2727, type: !50)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !806, file: !1, line: 2729, type: !11)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !806, file: !1, line: 2731, type: !58)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "latin1", scope: !815, file: !1, line: 2743, type: !11)
!815 = distinct !DILexicalBlock(scope: !816, file: !1, line: 2741, column: 20)
!816 = distinct !DILexicalBlock(scope: !806, file: !1, line: 2741, column: 9)
!817 = !DISubprogram(name: "bytearray_reduce_ex", scope: !1, file: !1, line: 2772, type: !692, isLocal: true, isDefinition: true, scopeLine: 2773, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyByteArrayObject*, %struct._object*)* @bytearray_reduce_ex, variables: !818)
!818 = !{!819, !820, !821}
!819 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !817, file: !1, line: 2772, type: !357)
!820 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !817, file: !1, line: 2772, type: !11)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "proto", scope: !817, file: !1, line: 2774, type: !50)
!822 = !DISubprogram(name: "bytearray_sizeof", scope: !1, file: !1, line: 2787, type: !532, isLocal: true, isDefinition: true, scopeLine: 2788, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyByteArrayObject*)* @bytearray_sizeof, variables: !823)
!823 = !{!824, !825}
!824 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !822, file: !1, line: 2787, type: !357)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !822, file: !1, line: 2789, type: !17)
!826 = !DISubprogram(name: "bytearray_append", scope: !1, file: !1, line: 2289, type: !692, isLocal: true, isDefinition: true, scopeLine: 2290, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyByteArrayObject*, %struct._object*)* @bytearray_append, variables: !827)
!827 = !{!828, !829, !830, !831}
!828 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !826, file: !1, line: 2289, type: !357)
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !826, file: !1, line: 2289, type: !11)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !826, file: !1, line: 2291, type: !50)
!831 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !826, file: !1, line: 2292, type: !17)
!832 = !DISubprogram(name: "stringlib_capitalize", scope: !833, file: !833, line: 88, type: !123, isLocal: true, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @stringlib_capitalize, variables: !834)
!833 = !DIFile(filename: "Objects/stringlib/ctype.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!834 = !{!835, !836}
!835 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !832, file: !833, line: 88, type: !11)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newobj", scope: !832, file: !833, line: 90, type: !11)
!837 = !DISubprogram(name: "stringlib_center", scope: !838, file: !838, line: 190, type: !133, isLocal: true, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stringlib_center, variables: !839)
!838 = !DIFile(filename: "Objects/stringlib/transmogrify.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!839 = !{!840, !841, !842, !843, !844, !845}
!840 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !837, file: !838, line: 190, type: !11)
!841 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !837, file: !838, line: 190, type: !11)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "marg", scope: !837, file: !838, line: 192, type: !17)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left", scope: !837, file: !838, line: 192, type: !17)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "width", scope: !837, file: !838, line: 193, type: !17)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fillchar", scope: !837, file: !838, line: 194, type: !37)
!846 = !DISubprogram(name: "pad", scope: !838, file: !838, line: 87, type: !847, isLocal: true, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, variables: !849)
!847 = !DISubroutineType(types: !848)
!848 = !{!11, !11, !17, !17, !37}
!849 = !{!850, !851, !852, !853, !854}
!850 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !846, file: !838, line: 87, type: !11)
!851 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "left", arg: 2, scope: !846, file: !838, line: 87, type: !17)
!852 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "right", arg: 3, scope: !846, file: !838, line: 87, type: !17)
!853 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fill", arg: 4, scope: !846, file: !838, line: 87, type: !37)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !846, file: !838, line: 89, type: !11)
!855 = !DISubprogram(name: "bytearray_clear", scope: !1, file: !1, line: 1228, type: !532, isLocal: true, isDefinition: true, scopeLine: 1229, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyByteArrayObject*)* @bytearray_clear, variables: !856)
!856 = !{!857}
!857 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !855, file: !1, line: 1228, type: !357)
!858 = !DISubprogram(name: "bytearray_copy", scope: !1, file: !1, line: 1241, type: !532, isLocal: true, isDefinition: true, scopeLine: 1242, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyByteArrayObject*)* @bytearray_copy, variables: !859)
!859 = !{!860}
!860 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !858, file: !1, line: 1241, type: !357)
!861 = !DISubprogram(name: "bytearray_count", scope: !1, file: !1, line: 1183, type: !692, isLocal: true, isDefinition: true, scopeLine: 1184, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyByteArrayObject*, %struct._object*)* @bytearray_count, variables: !862)
!862 = !{!863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873}
!863 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !861, file: !1, line: 1183, type: !357)
!864 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !861, file: !1, line: 1183, type: !11)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sub_obj", scope: !861, file: !1, line: 1185, type: !11)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !861, file: !1, line: 1186, type: !35)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sub", scope: !861, file: !1, line: 1186, type: !35)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sub_len", scope: !861, file: !1, line: 1187, type: !17)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "byte", scope: !861, file: !1, line: 1188, type: !37)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !861, file: !1, line: 1189, type: !17)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !861, file: !1, line: 1189, type: !17)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vsub", scope: !861, file: !1, line: 1191, type: !243)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count_obj", scope: !861, file: !1, line: 1192, type: !11)
!874 = !DISubprogram(name: "stringlib_parse_args_finds_byte", scope: !633, file: !633, line: 183, type: !875, isLocal: true, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._object*, %struct._object**, i8*, i64*, i64*)* @stringlib_parse_args_finds_byte, variables: !877)
!875 = !DISubroutineType(types: !876)
!876 = !{!50, !35, !11, !439, !58, !254, !254}
!877 = !{!878, !879, !880, !881, !882, !883, !884, !885, !886}
!878 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "function_name", arg: 1, scope: !874, file: !633, line: 183, type: !35)
!879 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !874, file: !633, line: 183, type: !11)
!880 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "subobj", arg: 3, scope: !874, file: !633, line: 184, type: !439)
!881 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "byte", arg: 4, scope: !874, file: !633, line: 184, type: !58)
!882 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 5, scope: !874, file: !633, line: 185, type: !254)
!883 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 6, scope: !874, file: !633, line: 185, type: !254)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp_subobj", scope: !874, file: !633, line: 187, type: !11)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ival", scope: !874, file: !633, line: 188, type: !17)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !874, file: !633, line: 189, type: !11)
!887 = !DISubprogram(name: "stringlib_parse_args_finds", scope: !633, file: !633, line: 105, type: !888, isLocal: true, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._object*, %struct._object**, i64*, i64*)* @stringlib_parse_args_finds, variables: !890)
!888 = !DISubroutineType(types: !889)
!889 = !{!50, !35, !11, !439, !254, !254}
!890 = !{!891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !905}
!891 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "function_name", arg: 1, scope: !887, file: !633, line: 105, type: !35)
!892 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !887, file: !633, line: 105, type: !11)
!893 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "subobj", arg: 3, scope: !887, file: !633, line: 106, type: !439)
!894 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 4, scope: !887, file: !633, line: 107, type: !254)
!895 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 5, scope: !887, file: !633, line: 107, type: !254)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp_subobj", scope: !887, file: !633, line: 109, type: !11)
!897 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp_start", scope: !887, file: !633, line: 110, type: !17)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp_end", scope: !887, file: !633, line: 111, type: !17)
!899 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj_start", scope: !887, file: !633, line: 112, type: !11)
!900 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj_end", scope: !887, file: !633, line: 112, type: !11)
!901 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format", scope: !887, file: !633, line: 113, type: !902)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 400, align: 8, elements: !903)
!903 = !{!904}
!904 = !DISubrange(count: 50)
!905 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !887, file: !633, line: 114, type: !101)
!906 = !DISubprogram(name: "stringlib_count", scope: !907, file: !907, line: 8, type: !634, isLocal: true, isDefinition: true, scopeLine: 11, flags: DIFlagPrototyped, isOptimized: true, variables: !908)
!907 = !DIFile(filename: "Objects/stringlib/count.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!908 = !{!909, !910, !911, !912, !913, !914}
!909 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !906, file: !907, line: 8, type: !35)
!910 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str_len", arg: 2, scope: !906, file: !907, line: 8, type: !17)
!911 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sub", arg: 3, scope: !906, file: !907, line: 9, type: !35)
