; ModuleID = 'bytes_methods.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._longobject = type { %struct.PyVarObject, [1 x i32] }
%struct.PyVarObject = type { %struct._object, i64 }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !353, globals: !475)
!1 = !DIFile(filename: "Objects/bytes_methods.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !6, !345, !32, !53, !91}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !8, line: 109, baseType: !9)
!8 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !8, line: 105, size: 128, align: 64, elements: !10)
!10 = !{!11, !19}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !9, file: !8, line: 107, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !13, line: 177, baseType: !14)
!13 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !15, line: 102, baseType: !16)
!15 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !17, line: 181, baseType: !18)
!17 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!18 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !9, file: !8, line: 108, baseType: !20, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !8, line: 334, size: 3200, align: 64, elements: !22)
!22 = !{!23, !29, !33, !34, !35, !40, !104, !109, !114, !115, !120, !172, !203, !215, !221, !222, !223, !225, !227, !258, !259, !260, !269, !270, !275, !276, !278, !280, !290, !293, !311, !312, !313, !315, !317, !318, !320, !325, !330, !335, !336, !337, !338, !339, !340, !341, !342, !344}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !21, file: !8, line: 335, baseType: !24, size: 192, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !8, line: 114, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 111, size: 192, align: 64, elements: !26)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !25, file: !8, line: 112, baseType: !7, size: 128, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !25, file: !8, line: 113, baseType: !12, size: 64, align: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !21, file: !8, line: 336, baseType: !30, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !21, file: !8, line: 337, baseType: !12, size: 64, align: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !21, file: !8, line: 337, baseType: !12, size: 64, align: 64, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !21, file: !8, line: 341, baseType: !36, size: 64, align: 64, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !8, line: 308, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{null, !6}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !21, file: !8, line: 342, baseType: !41, size: 64, align: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !8, line: 314, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !6, !46, !45}
!45 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !15, line: 48, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !49, line: 246, size: 1728, align: 64, elements: !50)
!49 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!50 = !{!51, !52, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !72, !73, !74, !75, !77, !79, !81, !85, !88, !90, !92, !93, !94, !95, !99, !100}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !48, file: !49, line: 247, baseType: !45, size: 32, align: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !48, file: !49, line: 252, baseType: !53, size: 64, align: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !48, file: !49, line: 253, baseType: !53, size: 64, align: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !48, file: !49, line: 254, baseType: !53, size: 64, align: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !48, file: !49, line: 255, baseType: !53, size: 64, align: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !48, file: !49, line: 256, baseType: !53, size: 64, align: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !48, file: !49, line: 257, baseType: !53, size: 64, align: 64, offset: 384)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !48, file: !49, line: 258, baseType: !53, size: 64, align: 64, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !48, file: !49, line: 259, baseType: !53, size: 64, align: 64, offset: 512)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !48, file: !49, line: 261, baseType: !53, size: 64, align: 64, offset: 576)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !48, file: !49, line: 262, baseType: !53, size: 64, align: 64, offset: 640)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !48, file: !49, line: 263, baseType: !53, size: 64, align: 64, offset: 704)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !48, file: !49, line: 265, baseType: !65, size: 64, align: 64, offset: 768)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !49, line: 161, size: 192, align: 64, elements: !67)
!67 = !{!68, !69, !71}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !66, file: !49, line: 162, baseType: !65, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !66, file: !49, line: 163, baseType: !70, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !66, file: !49, line: 167, baseType: !45, size: 32, align: 32, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !48, file: !49, line: 267, baseType: !70, size: 64, align: 64, offset: 832)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !48, file: !49, line: 269, baseType: !45, size: 32, align: 32, offset: 896)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !48, file: !49, line: 273, baseType: !45, size: 32, align: 32, offset: 928)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !48, file: !49, line: 275, baseType: !76, size: 64, align: 64, offset: 960)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !17, line: 140, baseType: !18)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !48, file: !49, line: 279, baseType: !78, size: 16, align: 16, offset: 1024)
!78 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !48, file: !49, line: 280, baseType: !80, size: 8, align: 8, offset: 1040)
!80 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !48, file: !49, line: 281, baseType: !82, size: 8, align: 8, offset: 1048)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 8, align: 8, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 1)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !48, file: !49, line: 285, baseType: !86, size: 64, align: 64, offset: 1088)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !49, line: 155, baseType: null)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !48, file: !49, line: 294, baseType: !89, size: 64, align: 64, offset: 1152)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !17, line: 141, baseType: !18)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !48, file: !49, line: 303, baseType: !91, size: 64, align: 64, offset: 1216)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !48, file: !49, line: 304, baseType: !91, size: 64, align: 64, offset: 1280)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !48, file: !49, line: 305, baseType: !91, size: 64, align: 64, offset: 1344)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !48, file: !49, line: 306, baseType: !91, size: 64, align: 64, offset: 1408)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !48, file: !49, line: 307, baseType: !96, size: 64, align: 64, offset: 1472)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !97, line: 62, baseType: !98)
!97 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!98 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !48, file: !49, line: 309, baseType: !45, size: 32, align: 32, offset: 1536)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !48, file: !49, line: 311, baseType: !101, size: 160, align: 8, offset: 1568)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 160, align: 8, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 20)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !21, file: !8, line: 343, baseType: !105, size: 64, align: 64, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !8, line: 316, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!6, !6, !53}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !21, file: !8, line: 344, baseType: !110, size: 64, align: 64, offset: 576)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !8, line: 318, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!45, !6, !53, !6}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !21, file: !8, line: 345, baseType: !91, size: 64, align: 64, offset: 640)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !21, file: !8, line: 346, baseType: !116, size: 64, align: 64, offset: 704)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !8, line: 320, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!6, !6}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !21, file: !8, line: 350, baseType: !121, size: 64, align: 64, offset: 768)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !8, line: 278, baseType: !123)
!123 = !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 236, size: 2176, align: 64, elements: !124)
!124 = !{!125, !130, !131, !132, !133, !134, !139, !141, !142, !143, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !123, file: !8, line: 241, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !8, line: 166, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!6, !6, !6}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !123, file: !8, line: 242, baseType: !126, size: 64, align: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !123, file: !8, line: 243, baseType: !126, size: 64, align: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !123, file: !8, line: 244, baseType: !126, size: 64, align: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !123, file: !8, line: 245, baseType: !126, size: 64, align: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !123, file: !8, line: 246, baseType: !135, size: 64, align: 64, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !8, line: 167, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!6, !6, !6, !6}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !123, file: !8, line: 247, baseType: !140, size: 64, align: 64, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !8, line: 165, baseType: !117)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !123, file: !8, line: 248, baseType: !140, size: 64, align: 64, offset: 448)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !123, file: !8, line: 249, baseType: !140, size: 64, align: 64, offset: 512)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !123, file: !8, line: 250, baseType: !144, size: 64, align: 64, offset: 576)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !8, line: 168, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!45, !6}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !123, file: !8, line: 251, baseType: !140, size: 64, align: 64, offset: 640)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !123, file: !8, line: 252, baseType: !126, size: 64, align: 64, offset: 704)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !123, file: !8, line: 253, baseType: !126, size: 64, align: 64, offset: 768)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !123, file: !8, line: 254, baseType: !126, size: 64, align: 64, offset: 832)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !123, file: !8, line: 255, baseType: !126, size: 64, align: 64, offset: 896)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !123, file: !8, line: 256, baseType: !126, size: 64, align: 64, offset: 960)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !123, file: !8, line: 257, baseType: !140, size: 64, align: 64, offset: 1024)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !123, file: !8, line: 258, baseType: !91, size: 64, align: 64, offset: 1088)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !123, file: !8, line: 259, baseType: !140, size: 64, align: 64, offset: 1152)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !123, file: !8, line: 261, baseType: !126, size: 64, align: 64, offset: 1216)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !123, file: !8, line: 262, baseType: !126, size: 64, align: 64, offset: 1280)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !123, file: !8, line: 263, baseType: !126, size: 64, align: 64, offset: 1344)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !123, file: !8, line: 264, baseType: !126, size: 64, align: 64, offset: 1408)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !123, file: !8, line: 265, baseType: !135, size: 64, align: 64, offset: 1472)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !123, file: !8, line: 266, baseType: !126, size: 64, align: 64, offset: 1536)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !123, file: !8, line: 267, baseType: !126, size: 64, align: 64, offset: 1600)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !123, file: !8, line: 268, baseType: !126, size: 64, align: 64, offset: 1664)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !123, file: !8, line: 269, baseType: !126, size: 64, align: 64, offset: 1728)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !123, file: !8, line: 270, baseType: !126, size: 64, align: 64, offset: 1792)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !123, file: !8, line: 272, baseType: !126, size: 64, align: 64, offset: 1856)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !123, file: !8, line: 273, baseType: !126, size: 64, align: 64, offset: 1920)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !123, file: !8, line: 274, baseType: !126, size: 64, align: 64, offset: 1984)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !123, file: !8, line: 275, baseType: !126, size: 64, align: 64, offset: 2048)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !123, file: !8, line: 277, baseType: !140, size: 64, align: 64, offset: 2112)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !21, file: !8, line: 351, baseType: !173, size: 64, align: 64, offset: 832)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !8, line: 292, baseType: !175)
!175 = !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 280, size: 640, align: 64, elements: !176)
!176 = !{!177, !182, !183, !188, !189, !190, !195, !196, !201, !202}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !175, file: !8, line: 281, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !8, line: 169, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!12, !6}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !175, file: !8, line: 282, baseType: !126, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !175, file: !8, line: 283, baseType: !184, size: 64, align: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !8, line: 170, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!6, !6, !12}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !175, file: !8, line: 284, baseType: !184, size: 64, align: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !175, file: !8, line: 285, baseType: !91, size: 64, align: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !175, file: !8, line: 286, baseType: !191, size: 64, align: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !8, line: 172, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!45, !6, !12, !6}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !175, file: !8, line: 287, baseType: !91, size: 64, align: 64, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !175, file: !8, line: 288, baseType: !197, size: 64, align: 64, offset: 448)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !8, line: 231, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!45, !6, !6}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !175, file: !8, line: 290, baseType: !126, size: 64, align: 64, offset: 512)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !175, file: !8, line: 291, baseType: !184, size: 64, align: 64, offset: 576)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !21, file: !8, line: 352, baseType: !204, size: 64, align: 64, offset: 896)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !8, line: 298, baseType: !206)
!206 = !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 294, size: 192, align: 64, elements: !207)
!207 = !{!208, !209, !210}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !206, file: !8, line: 295, baseType: !178, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !206, file: !8, line: 296, baseType: !126, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !206, file: !8, line: 297, baseType: !211, size: 64, align: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !8, line: 174, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!45, !6, !6, !6}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !21, file: !8, line: 356, baseType: !216, size: 64, align: 64, offset: 960)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !8, line: 321, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!220, !6}
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !13, line: 186, baseType: !12)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !21, file: !8, line: 357, baseType: !135, size: 64, align: 64, offset: 1024)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !21, file: !8, line: 358, baseType: !116, size: 64, align: 64, offset: 1088)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !21, file: !8, line: 359, baseType: !224, size: 64, align: 64, offset: 1152)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !8, line: 317, baseType: !127)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !21, file: !8, line: 360, baseType: !226, size: 64, align: 64, offset: 1216)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !8, line: 319, baseType: !212)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !21, file: !8, line: 363, baseType: !228, size: 64, align: 64, offset: 1280)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !8, line: 304, baseType: !230)
!230 = !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 301, size: 128, align: 64, elements: !231)
!231 = !{!232, !253}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !230, file: !8, line: 302, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !8, line: 193, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!45, !6, !237, !45}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !8, line: 191, baseType: !239)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !8, line: 178, size: 640, align: 64, elements: !240)
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !250, !251, !252}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !239, file: !8, line: 179, baseType: !91, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !239, file: !8, line: 180, baseType: !6, size: 64, align: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !239, file: !8, line: 181, baseType: !12, size: 64, align: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !239, file: !8, line: 182, baseType: !12, size: 64, align: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !239, file: !8, line: 184, baseType: !45, size: 32, align: 32, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !239, file: !8, line: 185, baseType: !45, size: 32, align: 32, offset: 288)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !239, file: !8, line: 186, baseType: !53, size: 64, align: 64, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !239, file: !8, line: 187, baseType: !249, size: 64, align: 64, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !239, file: !8, line: 188, baseType: !249, size: 64, align: 64, offset: 448)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !239, file: !8, line: 189, baseType: !249, size: 64, align: 64, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !239, file: !8, line: 190, baseType: !91, size: 64, align: 64, offset: 576)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !230, file: !8, line: 303, baseType: !254, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !8, line: 194, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !6, !237}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !21, file: !8, line: 366, baseType: !98, size: 64, align: 64, offset: 1344)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !21, file: !8, line: 368, baseType: !30, size: 64, align: 64, offset: 1408)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !21, file: !8, line: 372, baseType: !261, size: 64, align: 64, offset: 1472)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !8, line: 233, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!45, !6, !265, !91}
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !8, line: 232, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!45, !6, !91}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !21, file: !8, line: 375, baseType: !144, size: 64, align: 64, offset: 1536)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !21, file: !8, line: 379, baseType: !271, size: 64, align: 64, offset: 1600)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !8, line: 322, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!6, !6, !6, !45}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !21, file: !8, line: 382, baseType: !12, size: 64, align: 64, offset: 1664)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !21, file: !8, line: 385, baseType: !277, size: 64, align: 64, offset: 1728)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !8, line: 323, baseType: !117)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !21, file: !8, line: 386, baseType: !279, size: 64, align: 64, offset: 1792)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !8, line: 324, baseType: !117)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !21, file: !8, line: 389, baseType: !281, size: 64, align: 64, offset: 1856)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !283, line: 40, size: 256, align: 64, elements: !284)
!283 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!284 = !{!285, !286, !288, !289}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !282, file: !283, line: 41, baseType: !30, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !282, file: !283, line: 42, baseType: !287, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !283, line: 18, baseType: !127)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !282, file: !283, line: 43, baseType: !45, size: 32, align: 32, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !282, file: !283, line: 45, baseType: !30, size: 64, align: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !21, file: !8, line: 390, baseType: !291, size: 64, align: 64, offset: 1920)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !8, line: 390, flags: DIFlagFwdDecl)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !21, file: !8, line: 391, baseType: !294, size: 64, align: 64, offset: 1984)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !296, line: 11, size: 320, align: 64, elements: !297)
!296 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!297 = !{!298, !299, !304, !309, !310}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !295, file: !296, line: 12, baseType: !53, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !295, file: !296, line: 13, baseType: !300, size: 64, align: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !296, line: 8, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!6, !6, !91}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !295, file: !296, line: 14, baseType: !305, size: 64, align: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !296, line: 9, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!45, !6, !6, !91}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !295, file: !296, line: 15, baseType: !53, size: 64, align: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !295, file: !296, line: 16, baseType: !91, size: 64, align: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !21, file: !8, line: 392, baseType: !20, size: 64, align: 64, offset: 2048)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !21, file: !8, line: 393, baseType: !6, size: 64, align: 64, offset: 2112)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !21, file: !8, line: 394, baseType: !314, size: 64, align: 64, offset: 2176)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !8, line: 325, baseType: !136)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !21, file: !8, line: 395, baseType: !316, size: 64, align: 64, offset: 2240)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !8, line: 326, baseType: !212)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !21, file: !8, line: 396, baseType: !12, size: 64, align: 64, offset: 2304)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !21, file: !8, line: 397, baseType: !319, size: 64, align: 64, offset: 2368)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !8, line: 327, baseType: !212)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !21, file: !8, line: 398, baseType: !321, size: 64, align: 64, offset: 2432)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !8, line: 329, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!6, !20, !12}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !21, file: !8, line: 399, baseType: !326, size: 64, align: 64, offset: 2496)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !8, line: 328, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!6, !20, !6, !6}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !21, file: !8, line: 400, baseType: !331, size: 64, align: 64, offset: 2560)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !8, line: 307, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{null, !91}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !21, file: !8, line: 401, baseType: !144, size: 64, align: 64, offset: 2624)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !21, file: !8, line: 402, baseType: !6, size: 64, align: 64, offset: 2688)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !21, file: !8, line: 403, baseType: !6, size: 64, align: 64, offset: 2752)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !21, file: !8, line: 404, baseType: !6, size: 64, align: 64, offset: 2816)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !21, file: !8, line: 405, baseType: !6, size: 64, align: 64, offset: 2880)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !21, file: !8, line: 406, baseType: !6, size: 64, align: 64, offset: 2944)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !21, file: !8, line: 407, baseType: !36, size: 64, align: 64, offset: 3008)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !21, file: !8, line: 410, baseType: !343, size: 32, align: 32, offset: 3072)
!343 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !21, file: !8, line: 412, baseType: !36, size: 64, align: 64, offset: 3136)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !347, line: 41, baseType: !348)
!347 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!348 = !DICompositeType(tag: DW_TAG_structure_type, file: !347, line: 31, size: 320, align: 64, elements: !349)
!349 = !{!350, !351, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !348, file: !347, line: 32, baseType: !24, size: 192, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !348, file: !347, line: 33, baseType: !220, size: 64, align: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !348, file: !347, line: 34, baseType: !82, size: 8, align: 8, offset: 256)
!353 = !{!354, !364, !370, !376, !382, !389, !396, !408, !416, !422, !435, !448, !458, !468}
!354 = !DISubprogram(name: "_Py_bytes_isspace", scope: !1, file: !1, line: 11, type: !355, isLocal: false, isDefinition: true, scopeLine: 12, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i64)* @_Py_bytes_isspace, variables: !357)
!355 = !DISubroutineType(types: !356)
!356 = !{!6, !30, !12}
!357 = !{!358, !359, !360, !363}
!358 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cptr", arg: 1, scope: !354, file: !1, line: 11, type: !30)
!359 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !354, file: !1, line: 11, type: !12)
!360 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !354, file: !1, line: 13, type: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!363 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !354, file: !1, line: 15, type: !361)
!364 = !DISubprogram(name: "_Py_bytes_isalpha", scope: !1, file: !1, line: 41, type: !355, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i64)* @_Py_bytes_isalpha, variables: !365)
!365 = !{!366, !367, !368, !369}
!366 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cptr", arg: 1, scope: !364, file: !1, line: 41, type: !30)
!367 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !364, file: !1, line: 41, type: !12)
!368 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !364, file: !1, line: 43, type: !361)
!369 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !364, file: !1, line: 45, type: !361)
!370 = !DISubprogram(name: "_Py_bytes_isalnum", scope: !1, file: !1, line: 71, type: !355, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i64)* @_Py_bytes_isalnum, variables: !371)
!371 = !{!372, !373, !374, !375}
!372 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cptr", arg: 1, scope: !370, file: !1, line: 71, type: !30)
!373 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !370, file: !1, line: 71, type: !12)
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !370, file: !1, line: 73, type: !361)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !370, file: !1, line: 75, type: !361)
!376 = !DISubprogram(name: "_Py_bytes_isdigit", scope: !1, file: !1, line: 101, type: !355, isLocal: false, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i64)* @_Py_bytes_isdigit, variables: !377)
!377 = !{!378, !379, !380, !381}
!378 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cptr", arg: 1, scope: !376, file: !1, line: 101, type: !30)
!379 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !376, file: !1, line: 101, type: !12)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !376, file: !1, line: 103, type: !361)
!381 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !376, file: !1, line: 105, type: !361)
!382 = !DISubprogram(name: "_Py_bytes_islower", scope: !1, file: !1, line: 131, type: !355, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i64)* @_Py_bytes_islower, variables: !383)
!383 = !{!384, !385, !386, !387, !388}
!384 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cptr", arg: 1, scope: !382, file: !1, line: 131, type: !30)
!385 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !382, file: !1, line: 131, type: !12)
