; ModuleID = 'classobject.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyMethodObject = type { %struct._object, %struct._object*, %struct._object*, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !387, globals: !646)
!1 = !DIFile(filename: "Objects/classobject.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !95, !43, !359, !100, !373, !379}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodObject", file: !6, line: 17, baseType: !7)
!6 = !DIFile(filename: "Include/classobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!7 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 12, size: 320, align: 64, elements: !8)
!8 = !{!9, !356, !357, !358}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !7, file: !6, line: 13, baseType: !10, size: 128, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !11, line: 109, baseType: !12)
!11 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !11, line: 105, size: 128, align: 64, elements: !13)
!13 = !{!14, !22}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !12, file: !11, line: 107, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !16, line: 177, baseType: !17)
!16 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !18, line: 102, baseType: !19)
!18 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !20, line: 181, baseType: !21)
!20 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!21 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !12, file: !11, line: 108, baseType: !23, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !11, line: 334, size: 3200, align: 64, elements: !25)
!25 = !{!26, !32, !36, !37, !38, !44, !108, !113, !118, !119, !124, !176, !207, !219, !225, !226, !227, !229, !231, !262, !263, !264, !273, !274, !279, !280, !282, !284, !294, !304, !322, !323, !324, !326, !328, !329, !331, !336, !341, !346, !347, !348, !349, !350, !351, !352, !353, !355}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !24, file: !11, line: 335, baseType: !27, size: 192, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !11, line: 114, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 111, size: 192, align: 64, elements: !29)
!29 = !{!30, !31}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !28, file: !11, line: 112, baseType: !10, size: 128, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !28, file: !11, line: 113, baseType: !15, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !24, file: !11, line: 336, baseType: !33, size: 64, align: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!35 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !24, file: !11, line: 337, baseType: !15, size: 64, align: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !24, file: !11, line: 337, baseType: !15, size: 64, align: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !24, file: !11, line: 341, baseType: !39, size: 64, align: 64, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !11, line: 308, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !43}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !24, file: !11, line: 342, baseType: !45, size: 64, align: 64, offset: 448)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !11, line: 314, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !43, !50, !49}
!49 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !18, line: 48, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !53, line: 246, size: 1728, align: 64, elements: !54)
!53 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!54 = !{!55, !56, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !76, !77, !78, !79, !81, !83, !85, !89, !92, !94, !96, !97, !98, !99, !103, !104}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !52, file: !53, line: 247, baseType: !49, size: 32, align: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !52, file: !53, line: 252, baseType: !57, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !52, file: !53, line: 253, baseType: !57, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !52, file: !53, line: 254, baseType: !57, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !52, file: !53, line: 255, baseType: !57, size: 64, align: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !52, file: !53, line: 256, baseType: !57, size: 64, align: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !52, file: !53, line: 257, baseType: !57, size: 64, align: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !52, file: !53, line: 258, baseType: !57, size: 64, align: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !52, file: !53, line: 259, baseType: !57, size: 64, align: 64, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !52, file: !53, line: 261, baseType: !57, size: 64, align: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !52, file: !53, line: 262, baseType: !57, size: 64, align: 64, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !52, file: !53, line: 263, baseType: !57, size: 64, align: 64, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !52, file: !53, line: 265, baseType: !69, size: 64, align: 64, offset: 768)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !53, line: 161, size: 192, align: 64, elements: !71)
!71 = !{!72, !73, !75}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !70, file: !53, line: 162, baseType: !69, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !70, file: !53, line: 163, baseType: !74, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !70, file: !53, line: 167, baseType: !49, size: 32, align: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !52, file: !53, line: 267, baseType: !74, size: 64, align: 64, offset: 832)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !52, file: !53, line: 269, baseType: !49, size: 32, align: 32, offset: 896)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !52, file: !53, line: 273, baseType: !49, size: 32, align: 32, offset: 928)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !52, file: !53, line: 275, baseType: !80, size: 64, align: 64, offset: 960)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !20, line: 140, baseType: !21)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !52, file: !53, line: 279, baseType: !82, size: 16, align: 16, offset: 1024)
!82 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !52, file: !53, line: 280, baseType: !84, size: 8, align: 8, offset: 1040)
!84 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !52, file: !53, line: 281, baseType: !86, size: 8, align: 8, offset: 1048)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8, align: 8, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 1)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !52, file: !53, line: 285, baseType: !90, size: 64, align: 64, offset: 1088)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !53, line: 155, baseType: null)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !52, file: !53, line: 294, baseType: !93, size: 64, align: 64, offset: 1152)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !20, line: 141, baseType: !21)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !52, file: !53, line: 303, baseType: !95, size: 64, align: 64, offset: 1216)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !52, file: !53, line: 304, baseType: !95, size: 64, align: 64, offset: 1280)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !52, file: !53, line: 305, baseType: !95, size: 64, align: 64, offset: 1344)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !52, file: !53, line: 306, baseType: !95, size: 64, align: 64, offset: 1408)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !52, file: !53, line: 307, baseType: !100, size: 64, align: 64, offset: 1472)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !101, line: 62, baseType: !102)
!101 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!102 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !52, file: !53, line: 309, baseType: !49, size: 32, align: 32, offset: 1536)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !52, file: !53, line: 311, baseType: !105, size: 160, align: 8, offset: 1568)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 160, align: 8, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 20)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !24, file: !11, line: 343, baseType: !109, size: 64, align: 64, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !11, line: 316, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!43, !43, !57}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !24, file: !11, line: 344, baseType: !114, size: 64, align: 64, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !11, line: 318, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!49, !43, !57, !43}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !24, file: !11, line: 345, baseType: !95, size: 64, align: 64, offset: 640)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !24, file: !11, line: 346, baseType: !120, size: 64, align: 64, offset: 704)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !11, line: 320, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!43, !43}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !24, file: !11, line: 350, baseType: !125, size: 64, align: 64, offset: 768)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !11, line: 278, baseType: !127)
!127 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 236, size: 2176, align: 64, elements: !128)
!128 = !{!129, !134, !135, !136, !137, !138, !143, !145, !146, !147, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !127, file: !11, line: 241, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !11, line: 166, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!43, !43, !43}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !127, file: !11, line: 242, baseType: !130, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !127, file: !11, line: 243, baseType: !130, size: 64, align: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !127, file: !11, line: 244, baseType: !130, size: 64, align: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !127, file: !11, line: 245, baseType: !130, size: 64, align: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !127, file: !11, line: 246, baseType: !139, size: 64, align: 64, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !11, line: 167, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!43, !43, !43, !43}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !127, file: !11, line: 247, baseType: !144, size: 64, align: 64, offset: 384)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !11, line: 165, baseType: !121)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !127, file: !11, line: 248, baseType: !144, size: 64, align: 64, offset: 448)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !127, file: !11, line: 249, baseType: !144, size: 64, align: 64, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !127, file: !11, line: 250, baseType: !148, size: 64, align: 64, offset: 576)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !11, line: 168, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!49, !43}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !127, file: !11, line: 251, baseType: !144, size: 64, align: 64, offset: 640)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !127, file: !11, line: 252, baseType: !130, size: 64, align: 64, offset: 704)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !127, file: !11, line: 253, baseType: !130, size: 64, align: 64, offset: 768)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !127, file: !11, line: 254, baseType: !130, size: 64, align: 64, offset: 832)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !127, file: !11, line: 255, baseType: !130, size: 64, align: 64, offset: 896)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !127, file: !11, line: 256, baseType: !130, size: 64, align: 64, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !127, file: !11, line: 257, baseType: !144, size: 64, align: 64, offset: 1024)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !127, file: !11, line: 258, baseType: !95, size: 64, align: 64, offset: 1088)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !127, file: !11, line: 259, baseType: !144, size: 64, align: 64, offset: 1152)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !127, file: !11, line: 261, baseType: !130, size: 64, align: 64, offset: 1216)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !127, file: !11, line: 262, baseType: !130, size: 64, align: 64, offset: 1280)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !127, file: !11, line: 263, baseType: !130, size: 64, align: 64, offset: 1344)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !127, file: !11, line: 264, baseType: !130, size: 64, align: 64, offset: 1408)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !127, file: !11, line: 265, baseType: !139, size: 64, align: 64, offset: 1472)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !127, file: !11, line: 266, baseType: !130, size: 64, align: 64, offset: 1536)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !127, file: !11, line: 267, baseType: !130, size: 64, align: 64, offset: 1600)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !127, file: !11, line: 268, baseType: !130, size: 64, align: 64, offset: 1664)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !127, file: !11, line: 269, baseType: !130, size: 64, align: 64, offset: 1728)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !127, file: !11, line: 270, baseType: !130, size: 64, align: 64, offset: 1792)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !127, file: !11, line: 272, baseType: !130, size: 64, align: 64, offset: 1856)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !127, file: !11, line: 273, baseType: !130, size: 64, align: 64, offset: 1920)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !127, file: !11, line: 274, baseType: !130, size: 64, align: 64, offset: 1984)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !127, file: !11, line: 275, baseType: !130, size: 64, align: 64, offset: 2048)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !127, file: !11, line: 277, baseType: !144, size: 64, align: 64, offset: 2112)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !24, file: !11, line: 351, baseType: !177, size: 64, align: 64, offset: 832)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !11, line: 292, baseType: !179)
!179 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 280, size: 640, align: 64, elements: !180)
!180 = !{!181, !186, !187, !192, !193, !194, !199, !200, !205, !206}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !179, file: !11, line: 281, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !11, line: 169, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!15, !43}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !179, file: !11, line: 282, baseType: !130, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !179, file: !11, line: 283, baseType: !188, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !11, line: 170, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!43, !43, !15}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !179, file: !11, line: 284, baseType: !188, size: 64, align: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !179, file: !11, line: 285, baseType: !95, size: 64, align: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !179, file: !11, line: 286, baseType: !195, size: 64, align: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !11, line: 172, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!49, !43, !15, !43}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !179, file: !11, line: 287, baseType: !95, size: 64, align: 64, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !179, file: !11, line: 288, baseType: !201, size: 64, align: 64, offset: 448)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !11, line: 231, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!49, !43, !43}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !179, file: !11, line: 290, baseType: !130, size: 64, align: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !179, file: !11, line: 291, baseType: !188, size: 64, align: 64, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !24, file: !11, line: 352, baseType: !208, size: 64, align: 64, offset: 896)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !11, line: 298, baseType: !210)
!210 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 294, size: 192, align: 64, elements: !211)
!211 = !{!212, !213, !214}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !210, file: !11, line: 295, baseType: !182, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !210, file: !11, line: 296, baseType: !130, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !210, file: !11, line: 297, baseType: !215, size: 64, align: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !11, line: 174, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!49, !43, !43, !43}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !24, file: !11, line: 356, baseType: !220, size: 64, align: 64, offset: 960)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !11, line: 321, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!224, !43}
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !16, line: 186, baseType: !15)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !24, file: !11, line: 357, baseType: !139, size: 64, align: 64, offset: 1024)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !24, file: !11, line: 358, baseType: !120, size: 64, align: 64, offset: 1088)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !24, file: !11, line: 359, baseType: !228, size: 64, align: 64, offset: 1152)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !11, line: 317, baseType: !131)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !24, file: !11, line: 360, baseType: !230, size: 64, align: 64, offset: 1216)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !11, line: 319, baseType: !216)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !24, file: !11, line: 363, baseType: !232, size: 64, align: 64, offset: 1280)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !11, line: 304, baseType: !234)
!234 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 301, size: 128, align: 64, elements: !235)
!235 = !{!236, !257}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !234, file: !11, line: 302, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !11, line: 193, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!49, !43, !241, !49}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !11, line: 191, baseType: !243)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !11, line: 178, size: 640, align: 64, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !254, !255, !256}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !243, file: !11, line: 179, baseType: !95, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !243, file: !11, line: 180, baseType: !43, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !243, file: !11, line: 181, baseType: !15, size: 64, align: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !243, file: !11, line: 182, baseType: !15, size: 64, align: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !243, file: !11, line: 184, baseType: !49, size: 32, align: 32, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !243, file: !11, line: 185, baseType: !49, size: 32, align: 32, offset: 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !243, file: !11, line: 186, baseType: !57, size: 64, align: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !243, file: !11, line: 187, baseType: !253, size: 64, align: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !243, file: !11, line: 188, baseType: !253, size: 64, align: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !243, file: !11, line: 189, baseType: !253, size: 64, align: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !243, file: !11, line: 190, baseType: !95, size: 64, align: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !234, file: !11, line: 303, baseType: !258, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !11, line: 194, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !43, !241}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !24, file: !11, line: 366, baseType: !102, size: 64, align: 64, offset: 1344)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !24, file: !11, line: 368, baseType: !33, size: 64, align: 64, offset: 1408)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !24, file: !11, line: 372, baseType: !265, size: 64, align: 64, offset: 1472)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !11, line: 233, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!49, !43, !269, !95}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !11, line: 232, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!49, !43, !95}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !24, file: !11, line: 375, baseType: !148, size: 64, align: 64, offset: 1536)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !24, file: !11, line: 379, baseType: !275, size: 64, align: 64, offset: 1600)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !11, line: 322, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!43, !43, !43, !49}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !24, file: !11, line: 382, baseType: !15, size: 64, align: 64, offset: 1664)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !24, file: !11, line: 385, baseType: !281, size: 64, align: 64, offset: 1728)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !11, line: 323, baseType: !121)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !24, file: !11, line: 386, baseType: !283, size: 64, align: 64, offset: 1792)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !11, line: 324, baseType: !121)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !24, file: !11, line: 389, baseType: !285, size: 64, align: 64, offset: 1856)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !287, line: 40, size: 256, align: 64, elements: !288)
!287 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!288 = !{!289, !290, !292, !293}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !286, file: !287, line: 41, baseType: !33, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !286, file: !287, line: 42, baseType: !291, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !287, line: 18, baseType: !131)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !286, file: !287, line: 43, baseType: !49, size: 32, align: 32, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !286, file: !287, line: 45, baseType: !33, size: 64, align: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !24, file: !11, line: 390, baseType: !295, size: 64, align: 64, offset: 1920)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !297, line: 18, size: 320, align: 64, elements: !298)
!297 = !DIFile(filename: "Include/structmember.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!298 = !{!299, !300, !301, !302, !303}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !296, file: !297, line: 19, baseType: !57, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !296, file: !297, line: 20, baseType: !49, size: 32, align: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !296, file: !297, line: 21, baseType: !15, size: 64, align: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !296, file: !297, line: 22, baseType: !49, size: 32, align: 32, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !296, file: !297, line: 23, baseType: !57, size: 64, align: 64, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !24, file: !11, line: 391, baseType: !305, size: 64, align: 64, offset: 1984)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !307, line: 11, size: 320, align: 64, elements: !308)
!307 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!308 = !{!309, !310, !315, !320, !321}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !307, line: 12, baseType: !57, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !306, file: !307, line: 13, baseType: !311, size: 64, align: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !307, line: 8, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!43, !43, !95}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !306, file: !307, line: 14, baseType: !316, size: 64, align: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !307, line: 9, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!49, !43, !43, !95}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !306, file: !307, line: 15, baseType: !57, size: 64, align: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !306, file: !307, line: 16, baseType: !95, size: 64, align: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !24, file: !11, line: 392, baseType: !23, size: 64, align: 64, offset: 2048)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !24, file: !11, line: 393, baseType: !43, size: 64, align: 64, offset: 2112)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !24, file: !11, line: 394, baseType: !325, size: 64, align: 64, offset: 2176)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !11, line: 325, baseType: !140)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !24, file: !11, line: 395, baseType: !327, size: 64, align: 64, offset: 2240)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !11, line: 326, baseType: !216)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !24, file: !11, line: 396, baseType: !15, size: 64, align: 64, offset: 2304)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !24, file: !11, line: 397, baseType: !330, size: 64, align: 64, offset: 2368)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !11, line: 327, baseType: !216)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !24, file: !11, line: 398, baseType: !332, size: 64, align: 64, offset: 2432)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !11, line: 329, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!43, !23, !15}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !24, file: !11, line: 399, baseType: !337, size: 64, align: 64, offset: 2496)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !11, line: 328, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!43, !23, !43, !43}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !24, file: !11, line: 400, baseType: !342, size: 64, align: 64, offset: 2560)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !11, line: 307, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !95}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !24, file: !11, line: 401, baseType: !148, size: 64, align: 64, offset: 2624)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !24, file: !11, line: 402, baseType: !43, size: 64, align: 64, offset: 2688)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !24, file: !11, line: 403, baseType: !43, size: 64, align: 64, offset: 2752)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !24, file: !11, line: 404, baseType: !43, size: 64, align: 64, offset: 2816)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !24, file: !11, line: 405, baseType: !43, size: 64, align: 64, offset: 2880)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !24, file: !11, line: 406, baseType: !43, size: 64, align: 64, offset: 2944)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !24, file: !11, line: 407, baseType: !39, size: 64, align: 64, offset: 3008)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !24, file: !11, line: 410, baseType: !354, size: 32, align: 32, offset: 3072)
!354 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !24, file: !11, line: 412, baseType: !39, size: 64, align: 64, offset: 3136)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "im_func", scope: !7, file: !6, line: 14, baseType: !43, size: 64, align: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "im_self", scope: !7, file: !6, line: 15, baseType: !43, size: 64, align: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "im_weakreflist", scope: !7, file: !6, line: 16, baseType: !43, size: 64, align: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !361, line: 253, baseType: !362)
!361 = !DIFile(filename: "Include/objimpl.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!362 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !361, line: 246, size: 192, align: 64, elements: !363)
!363 = !{!364, !371}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !362, file: !361, line: 251, baseType: !365, size: 192, align: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, scope: !362, file: !361, line: 247, size: 192, align: 64, elements: !366)
!366 = !{!367, !369, !370}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !365, file: !361, line: 248, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !365, file: !361, line: 249, baseType: !368, size: 64, align: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !365, file: !361, line: 250, baseType: !15, size: 64, align: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !362, file: !361, line: 252, baseType: !372, size: 64, align: 64)
!372 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInstanceMethodObject", file: !6, line: 40, baseType: !375)
!375 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 37, size: 192, align: 64, elements: !376)
!376 = !{!377, !378}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !375, file: !6, line: 38, baseType: !10, size: 128, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !375, file: !6, line: 39, baseType: !43, size: 64, align: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !381, line: 33, baseType: !382)
!381 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!382 = !DICompositeType(tag: DW_TAG_structure_type, file: !381, line: 25, size: 256, align: 64, elements: !383)
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !382, file: !381, line: 26, baseType: !27, size: 192, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !382, file: !381, line: 27, baseType: !386, size: 64, align: 64, offset: 192)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 64, align: 64, elements: !87)
!387 = !{!388, !391, !394, !403, !410, !413, !418, !424, !427, !441, !483, !490, !510, !522, !537, !546, !554, !560, !565, !574, !581, !598, !603, !612, !621, !630, !634, !640}
!388 = !DISubprogram(name: "PyMethod_Function", scope: !1, file: !1, line: 20, type: !122, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyMethod_Function, variables: !389)
!389 = !{!390}
!390 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "im", arg: 1, scope: !388, file: !1, line: 20, type: !43)
!391 = !DISubprogram(name: "PyMethod_Self", scope: !1, file: !1, line: 30, type: !122, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyMethod_Self, variables: !392)
!392 = !{!393}
!393 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "im", arg: 1, scope: !391, file: !1, line: 30, type: !43)
!394 = !DISubprogram(name: "PyMethod_New", scope: !1, file: !1, line: 45, type: !132, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyMethod_New, variables: !395)
!395 = !{!396, !397, !398, !399, !401}
!396 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !394, file: !1, line: 45, type: !43)
!397 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 2, scope: !394, file: !1, line: 45, type: !43)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "im", scope: !394, file: !1, line: 47, type: !4)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !400, file: !1, line: 66, type: !43)
!400 = distinct !DILexicalBlock(scope: !394, file: !1, line: 66, column: 5)
!401 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !402, file: !1, line: 68, type: !359)
!402 = distinct !DILexicalBlock(scope: !394, file: !1, line: 68, column: 5)
!403 = !DISubprogram(name: "PyMethod_ClearFreeList", scope: !1, file: !1, line: 410, type: !404, isLocal: false, isDefinition: true, scopeLine: 411, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @PyMethod_ClearFreeList, variables: !406)
!404 = !DISubroutineType(types: !405)
!405 = !{!49}
!406 = !{!407, !408}
!407 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "freelist_size", scope: !403, file: !1, line: 412, type: !49)
!408 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "im", scope: !409, file: !1, line: 415, type: !4)
!409 = distinct !DILexicalBlock(scope: !403, file: !1, line: 414, column: 23)
!410 = !DISubprogram(name: "PyMethod_Fini", scope: !1, file: !1, line: 425, type: !411, isLocal: false, isDefinition: true, scopeLine: 426, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyMethod_Fini, variables: !2)
!411 = !DISubroutineType(types: !412)
!412 = !{null}
!413 = !DISubprogram(name: "_PyMethod_DebugMallocStats", scope: !1, file: !1, line: 432, type: !414, isLocal: false, isDefinition: true, scopeLine: 433, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IO_FILE*)* @_PyMethod_DebugMallocStats, variables: !416)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !50}
!416 = !{!417}
!417 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !413, file: !1, line: 432, type: !50)
!418 = !DISubprogram(name: "PyInstanceMethod_New", scope: !1, file: !1, line: 444, type: !122, isLocal: false, isDefinition: true, scopeLine: 444, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyInstanceMethod_New, variables: !419)
!419 = !{!420, !421, !422}
!420 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !418, file: !1, line: 444, type: !43)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "method", scope: !418, file: !1, line: 445, type: !373)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !423, file: !1, line: 451, type: !359)
!423 = distinct !DILexicalBlock(scope: !418, file: !1, line: 451, column: 5)
!424 = !DISubprogram(name: "PyInstanceMethod_Function", scope: !1, file: !1, line: 456, type: !122, isLocal: false, isDefinition: true, scopeLine: 457, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyInstanceMethod_Function, variables: !425)
!425 = !{!426}
!426 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "im", arg: 1, scope: !424, file: !1, line: 456, type: !43)
!427 = !DISubprogram(name: "method_dealloc", scope: !1, file: !1, line: 191, type: !428, isLocal: true, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyMethodObject*)* @method_dealloc, variables: !430)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !4}
!430 = !{!431, !432, !434, !436, !438}
!431 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "im", arg: 1, scope: !427, file: !1, line: 191, type: !4)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !433, file: !1, line: 193, type: !359)
!433 = distinct !DILexicalBlock(scope: !427, file: !1, line: 193, column: 5)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !435, file: !1, line: 196, type: !43)
!435 = distinct !DILexicalBlock(scope: !427, file: !1, line: 196, column: 5)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !437, file: !1, line: 197, type: !43)
!437 = distinct !DILexicalBlock(scope: !427, file: !1, line: 197, column: 5)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !439, file: !1, line: 197, type: !43)
!439 = distinct !DILexicalBlock(scope: !440, file: !1, line: 197, column: 5)
!440 = distinct !DILexicalBlock(scope: !437, file: !1, line: 197, column: 5)
!441 = !DISubprogram(name: "method_repr", scope: !1, file: !1, line: 242, type: !442, isLocal: true, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyMethodObject*)* @method_repr, variables: !444)
!442 = !DISubroutineType(types: !443)
!443 = !{!43, !4}
!444 = !{!445, !446, !447, !448, !449, !450, !451, !452, !453, !458, !466, !469, !473, !475, !478, !480}
!445 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !441, file: !1, line: 242, type: !4)
!446 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !441, file: !1, line: 244, type: !43)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !441, file: !1, line: 245, type: !43)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "klass", scope: !441, file: !1, line: 246, type: !43)
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "funcname", scope: !441, file: !1, line: 247, type: !43)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "klassname", scope: !441, file: !1, line: 247, type: !43)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !441, file: !1, line: 247, type: !43)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "defname", scope: !441, file: !1, line: 248, type: !57)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !454, file: !1, line: 263, type: !43)
!454 = distinct !DILexicalBlock(scope: !455, file: !1, line: 263, column: 9)
!455 = distinct !DILexicalBlock(scope: !456, file: !1, line: 262, column: 42)
!456 = distinct !DILexicalBlock(scope: !457, file: !1, line: 262, column: 14)
!457 = distinct !DILexicalBlock(scope: !441, file: !1, line: 257, column: 9)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !459, file: !1, line: 273, type: !43)
!459 = distinct !DILexicalBlock(scope: !460, file: !1, line: 273, column: 17)
!460 = distinct !DILexicalBlock(scope: !461, file: !1, line: 272, column: 64)
!461 = distinct !DILexicalBlock(scope: !462, file: !1, line: 272, column: 17)
!462 = distinct !DILexicalBlock(scope: !463, file: !1, line: 271, column: 32)
!463 = distinct !DILexicalBlock(scope: !464, file: !1, line: 271, column: 13)
!464 = distinct !DILexicalBlock(scope: !465, file: !1, line: 269, column: 10)
!465 = distinct !DILexicalBlock(scope: !441, file: !1, line: 267, column: 9)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !467, file: !1, line: 273, type: !43)
!467 = distinct !DILexicalBlock(scope: !468, file: !1, line: 273, column: 17)
!468 = distinct !DILexicalBlock(scope: !459, file: !1, line: 273, column: 17)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !470, file: !1, line: 279, type: !43)
!470 = distinct !DILexicalBlock(scope: !471, file: !1, line: 279, column: 13)
!471 = distinct !DILexicalBlock(scope: !472, file: !1, line: 278, column: 47)
!472 = distinct !DILexicalBlock(scope: !463, file: !1, line: 278, column: 18)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !474, file: !1, line: 289, type: !43)
!474 = distinct !DILexicalBlock(scope: !441, file: !1, line: 289, column: 5)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !476, file: !1, line: 289, type: !43)
!476 = distinct !DILexicalBlock(scope: !477, file: !1, line: 289, column: 5)
!477 = distinct !DILexicalBlock(scope: !474, file: !1, line: 289, column: 5)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !479, file: !1, line: 290, type: !43)
!479 = distinct !DILexicalBlock(scope: !441, file: !1, line: 290, column: 5)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !481, file: !1, line: 290, type: !43)
!481 = distinct !DILexicalBlock(scope: !482, file: !1, line: 290, column: 5)
!482 = distinct !DILexicalBlock(scope: !479, file: !1, line: 290, column: 5)
!483 = !DISubprogram(name: "method_hash", scope: !1, file: !1, line: 295, type: !484, isLocal: true, isDefinition: true, scopeLine: 296, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.PyMethodObject*)* @method_hash, variables: !486)
!484 = !DISubroutineType(types: !485)
!485 = !{!224, !4}
!486 = !{!487, !488, !489}
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !483, file: !1, line: 295, type: !4)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !483, file: !1, line: 297, type: !224)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !483, file: !1, line: 297, type: !224)
!490 = !DISubprogram(name: "method_call", scope: !1, file: !1, line: 322, type: !141, isLocal: true, isDefinition: true, scopeLine: 323, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @method_call, variables: !491)
!491 = !{!492, !493, !494, !495, !496, !497, !500, !501, !502, !506, !508}
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !490, file: !1, line: 322, type: !43)
!493 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !490, file: !1, line: 322, type: !43)
!494 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !490, file: !1, line: 322, type: !43)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !490, file: !1, line: 324, type: !43)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !490, file: !1, line: 325, type: !43)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "argcount", scope: !498, file: !1, line: 333, type: !15)
!498 = distinct !DILexicalBlock(scope: !499, file: !1, line: 332, column: 10)
!499 = distinct !DILexicalBlock(scope: !490, file: !1, line: 328, column: 9)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newarg", scope: !498, file: !1, line: 334, type: !43)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !498, file: !1, line: 335, type: !49)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !503, file: !1, line: 341, type: !43)
!503 = distinct !DILexicalBlock(scope: !504, file: !1, line: 340, column: 40)
!504 = distinct !DILexicalBlock(scope: !505, file: !1, line: 340, column: 9)
!505 = distinct !DILexicalBlock(scope: !498, file: !1, line: 340, column: 9)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !507, file: !1, line: 342, type: !43)
!507 = distinct !DILexicalBlock(scope: !503, file: !1, line: 342, column: 13)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !509, file: !1, line: 348, type: !43)
!509 = distinct !DILexicalBlock(scope: !490, file: !1, line: 348, column: 5)
!510 = !DISubprogram(name: "method_getattro", scope: !1, file: !1, line: 133, type: !132, isLocal: true, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @method_getattro, variables: !511)
!511 = !{!512, !513, !514, !515, !518, !519}
!512 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !510, file: !1, line: 133, type: !43)
!513 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !510, file: !1, line: 133, type: !43)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "im", scope: !510, file: !1, line: 135, type: !4)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tp", scope: !510, file: !1, line: 136, type: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !11, line: 422, baseType: !24)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "descr", scope: !510, file: !1, line: 137, type: !43)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !520, file: !1, line: 148, type: !325)
!520 = distinct !DILexicalBlock(scope: !521, file: !1, line: 147, column: 24)
!521 = distinct !DILexicalBlock(scope: !510, file: !1, line: 147, column: 9)
!522 = !DISubprogram(name: "method_traverse", scope: !1, file: !1, line: 314, type: !523, isLocal: true, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyMethodObject*, i32 (%struct._object*, i8*)*, i8*)* @method_traverse, variables: !525)
!523 = !DISubroutineType(types: !524)
!524 = !{!49, !4, !269, !95}
!525 = !{!526, !527, !528, !529, !533}
!526 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "im", arg: 1, scope: !522, file: !1, line: 314, type: !4)
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !522, file: !1, line: 314, type: !269)
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !522, file: !1, line: 314, type: !95)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !530, file: !1, line: 316, type: !49)
!530 = distinct !DILexicalBlock(scope: !531, file: !1, line: 316, column: 5)
!531 = distinct !DILexicalBlock(scope: !532, file: !1, line: 316, column: 5)
!532 = distinct !DILexicalBlock(scope: !522, file: !1, line: 316, column: 5)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !534, file: !1, line: 317, type: !49)
!534 = distinct !DILexicalBlock(scope: !535, file: !1, line: 317, column: 5)
!535 = distinct !DILexicalBlock(scope: !536, file: !1, line: 317, column: 5)
!536 = distinct !DILexicalBlock(scope: !522, file: !1, line: 317, column: 5)
!537 = !DISubprogram(name: "method_richcompare", scope: !1, file: !1, line: 209, type: !277, isLocal: true, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @method_richcompare, variables: !538)
!538 = !{!539, !540, !541, !542, !543, !544, !545}
!539 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !537, file: !1, line: 209, type: !43)
!540 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "other", arg: 2, scope: !537, file: !1, line: 209, type: !43)
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !537, file: !1, line: 209, type: !49)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !537, file: !1, line: 211, type: !4)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !537, file: !1, line: 211, type: !4)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !537, file: !1, line: 212, type: !43)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eq", scope: !537, file: !1, line: 213, type: !49)
!546 = !DISubprogram(name: "method_reduce", scope: !1, file: !1, line: 73, type: !442, isLocal: true, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyMethodObject*)* @method_reduce, variables: !547)
!547 = !{!548, !549, !550, !551, !552, !553}
!548 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "im", arg: 1, scope: !546, file: !1, line: 73, type: !4)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !546, file: !1, line: 75, type: !43)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !546, file: !1, line: 76, type: !43)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "builtins", scope: !546, file: !1, line: 77, type: !43)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "getattr", scope: !546, file: !1, line: 78, type: !43)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "funcname", scope: !546, file: !1, line: 79, type: !43)
!554 = !DISubprogram(name: "method_get_doc", scope: !1, file: !1, line: 116, type: !555, isLocal: true, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyMethodObject*, i8*)* @method_get_doc, variables: !557)
!555 = !DISubroutineType(types: !556)
!556 = !{!43, !4, !95}
!557 = !{!558, !559}
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "im", arg: 1, scope: !554, file: !1, line: 116, type: !4)
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "context", arg: 2, scope: !554, file: !1, line: 116, type: !95)
!560 = !DISubprogram(name: "method_descr_get", scope: !1, file: !1, line: 353, type: !141, isLocal: true, isDefinition: true, scopeLine: 354, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @method_descr_get, variables: !561)
!561 = !{!562, !563, !564}
!562 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "meth", arg: 1, scope: !560, file: !1, line: 353, type: !43)
!563 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !560, file: !1, line: 353, type: !43)
!564 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cls", arg: 3, scope: !560, file: !1, line: 353, type: !43)
!565 = !DISubprogram(name: "method_new", scope: !1, file: !1, line: 166, type: !566, isLocal: true, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @method_new, variables: !568)
!566 = !DISubroutineType(types: !567)
!567 = !{!43, !516, !43, !43}
!568 = !{!569, !570, !571, !572, !573}
!569 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !565, file: !1, line: 166, type: !516)
!570 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !565, file: !1, line: 166, type: !43)
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !565, file: !1, line: 166, type: !43)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !565, file: !1, line: 168, type: !43)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !565, file: !1, line: 169, type: !43)
!574 = !DISubprogram(name: "instancemethod_dealloc", scope: !1, file: !1, line: 516, type: !41, isLocal: true, isDefinition: true, scopeLine: 516, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @instancemethod_dealloc, variables: !575)
!575 = !{!576, !577, !579}
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !574, file: !1, line: 516, type: !43)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !578, file: !1, line: 517, type: !359)
!578 = distinct !DILexicalBlock(scope: !574, file: !1, line: 517, column: 5)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !580, file: !1, line: 518, type: !43)
!580 = distinct !DILexicalBlock(scope: !574, file: !1, line: 518, column: 5)
!581 = !DISubprogram(name: "instancemethod_repr", scope: !1, file: !1, line: 572, type: !122, isLocal: true, isDefinition: true, scopeLine: 573, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @instancemethod_repr, variables: !582)
!582 = !{!583, !584, !585, !586, !587, !588, !593, !595}
!583 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !581, file: !1, line: 572, type: !43)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !581, file: !1, line: 574, type: !43)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "funcname", scope: !581, file: !1, line: 575, type: !43)
!586 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !581, file: !1, line: 575, type: !43)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "defname", scope: !581, file: !1, line: 576, type: !57)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !589, file: !1, line: 590, type: !43)
!589 = distinct !DILexicalBlock(scope: !590, file: !1, line: 590, column: 9)
!590 = distinct !DILexicalBlock(scope: !591, file: !1, line: 589, column: 42)
!591 = distinct !DILexicalBlock(scope: !592, file: !1, line: 589, column: 14)
!592 = distinct !DILexicalBlock(scope: !581, file: !1, line: 584, column: 9)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !594, file: !1, line: 597, type: !43)
!594 = distinct !DILexicalBlock(scope: !581, file: !1, line: 597, column: 5)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !596, file: !1, line: 597, type: !43)
!596 = distinct !DILexicalBlock(scope: !597, file: !1, line: 597, column: 5)
!597 = distinct !DILexicalBlock(scope: !594, file: !1, line: 597, column: 5)
!598 = !DISubprogram(name: "instancemethod_call", scope: !1, file: !1, line: 529, type: !141, isLocal: true, isDefinition: true, scopeLine: 530, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @instancemethod_call, variables: !599)
!599 = !{!600, !601, !602}
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !598, file: !1, line: 529, type: !43)
!601 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !598, file: !1, line: 529, type: !43)
!602 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !598, file: !1, line: 529, type: !43)
!603 = !DISubprogram(name: "instancemethod_getattro", scope: !1, file: !1, line: 491, type: !132, isLocal: true, isDefinition: true, scopeLine: 492, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @instancemethod_getattro, variables: !604)
!604 = !{!605, !606, !607, !608, !609}
!605 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !603, file: !1, line: 491, type: !43)
!606 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !603, file: !1, line: 491, type: !43)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tp", scope: !603, file: !1, line: 493, type: !516)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "descr", scope: !603, file: !1, line: 494, type: !43)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !610, file: !1, line: 503, type: !325)
!610 = distinct !DILexicalBlock(scope: !611, file: !1, line: 502, column: 24)
!611 = distinct !DILexicalBlock(scope: !603, file: !1, line: 502, column: 9)
!612 = !DISubprogram(name: "instancemethod_traverse", scope: !1, file: !1, line: 523, type: !267, isLocal: true, isDefinition: true, scopeLine: 523, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)* @instancemethod_traverse, variables: !613)
!613 = !{!614, !615, !616, !617}
!614 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !612, file: !1, line: 523, type: !43)
!615 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !612, file: !1, line: 523, type: !269)
!616 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !612, file: !1, line: 523, type: !95)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !618, file: !1, line: 524, type: !49)
!618 = distinct !DILexicalBlock(scope: !619, file: !1, line: 524, column: 5)
!619 = distinct !DILexicalBlock(scope: !620, file: !1, line: 524, column: 5)
!620 = distinct !DILexicalBlock(scope: !612, file: !1, line: 524, column: 5)
!621 = !DISubprogram(name: "instancemethod_richcompare", scope: !1, file: !1, line: 546, type: !277, isLocal: true, isDefinition: true, scopeLine: 547, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @instancemethod_richcompare, variables: !622)
!622 = !{!623, !624, !625, !626, !627, !628, !629}
!623 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !621, file: !1, line: 546, type: !43)
!624 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "other", arg: 2, scope: !621, file: !1, line: 546, type: !43)
!625 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !621, file: !1, line: 546, type: !49)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !621, file: !1, line: 548, type: !373)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !621, file: !1, line: 548, type: !373)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !621, file: !1, line: 549, type: !43)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eq", scope: !621, file: !1, line: 550, type: !49)
!630 = !DISubprogram(name: "instancemethod_get_doc", scope: !1, file: !1, line: 474, type: !313, isLocal: true, isDefinition: true, scopeLine: 475, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*)* @instancemethod_get_doc, variables: !631)
!631 = !{!632, !633}
!632 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !630, file: !1, line: 474, type: !43)
!633 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "context", arg: 2, scope: !630, file: !1, line: 474, type: !95)
!634 = !DISubprogram(name: "instancemethod_descr_get", scope: !1, file: !1, line: 535, type: !141, isLocal: true, isDefinition: true, scopeLine: 535, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @instancemethod_descr_get, variables: !635)
!635 = !{!636, !637, !638, !639}
!636 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !634, file: !1, line: 535, type: !43)
!637 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !634, file: !1, line: 535, type: !43)
!638 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 3, scope: !634, file: !1, line: 535, type: !43)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !634, file: !1, line: 536, type: !43)
!640 = !DISubprogram(name: "instancemethod_new", scope: !1, file: !1, line: 623, type: !566, isLocal: true, isDefinition: true, scopeLine: 624, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @instancemethod_new, variables: !641)
!641 = !{!642, !643, !644, !645}
!642 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !640, file: !1, line: 623, type: !516)
!643 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !640, file: !1, line: 623, type: !43)
!644 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !640, file: !1, line: 623, type: !43)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !640, file: !1, line: 625, type: !43)
!646 = !{!647, !648, !649, !650, !651, !659, !663, !668, !669, !674, !677, !678, !682, !684, !685}
!647 = !DIGlobalVariable(name: "PyMethod_Type", scope: !0, file: !1, line: 366, type: !517, isLocal: false, isDefinition: true, variable: { %struct.PyVarObject, i8*, i64, i64, void (%struct._object*)*, i32 (%struct._object*, %struct._IO_FILE*, i32)*, %struct._object* (%struct._object*, i8*)*, i32 (%struct._object*, i8*, %struct._object*)*, i8*, %struct._object* (%struct._object*)*, %struct.PyNumberMethods*, %struct.PySequenceMethods*, %struct.PyMappingMethods*, i64 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*)*, i32 (%struct._object*, %struct._object*, %struct._object*)*, %struct.PyBufferProcs*, i64, i8*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, i32)*, i64, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*)*, %struct.PyMethodDef*, %struct.PyMemberDef*, %struct.PyGetSetDef*, %struct._typeobject*, %struct._object*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, i32 (%struct._object*, %struct._object*, %struct._object*)*, i64, i32 (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._typeobject*, i64)*, %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)*, void (i8*)*, i32 (%struct._object*)*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, void (%struct._object*)*, i32, void (%struct._object*)* }* @PyMethod_Type)
!648 = !DIGlobalVariable(name: "PyInstanceMethod_Type", scope: !0, file: !1, line: 640, type: !517, isLocal: false, isDefinition: true, variable: { %struct.PyVarObject, i8*, i64, i64, void (%struct._object*)*, i32 (%struct._object*, %struct._IO_FILE*, i32)*, %struct._object* (%struct._object*, i8*)*, i32 (%struct._object*, i8*, %struct._object*)*, i8*, %struct._object* (%struct._object*)*, %struct.PyNumberMethods*, %struct.PySequenceMethods*, %struct.PyMappingMethods*, i64 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*)*, i32 (%struct._object*, %struct._object*, %struct._object*)*, %struct.PyBufferProcs*, i64, i8*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, i32)*, i64, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*)*, %struct.PyMethodDef*, %struct.PyMemberDef*, %struct.PyGetSetDef*, %struct._typeobject*, %struct._object*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, i32 (%struct._object*, %struct._object*, %struct._object*)*, i64, i32 (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._typeobject*, i64)*, %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)*, void (i8*)*, i32 (%struct._object*)*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, void (%struct._object*)*, i32, void (%struct._object*)* }* @PyInstanceMethod_Type)
!649 = !DIGlobalVariable(name: "free_list", scope: !0, file: !1, line: 11, type: !4, isLocal: true, isDefinition: true, variable: %struct.PyMethodObject** @free_list)
!650 = !DIGlobalVariable(name: "numfree", scope: !0, file: !1, line: 12, type: !49, isLocal: true, isDefinition: true, variable: i32* @numfree)
!651 = !DIGlobalVariable(name: "PyId___name__", scope: !0, file: !1, line: 17, type: !652, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @PyId___name__)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !11, line: 144, baseType: !653)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !11, line: 140, size: 192, align: 64, elements: !654)
!654 = !{!655, !657, !658}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !653, file: !11, line: 141, baseType: !656, size: 64, align: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64, align: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !653, file: !11, line: 142, baseType: !33, size: 64, align: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !653, file: !11, line: 143, baseType: !43, size: 64, align: 64, offset: 128)
!659 = !DIGlobalVariable(name: "method_doc", scope: !0, file: !1, line: 160, type: !660, isLocal: true, isDefinition: true, variable: [67 x i8]* @method_doc)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 536, align: 8, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 67)
!663 = !DIGlobalVariable(name: "method_methods", scope: !0, file: !1, line: 91, type: !664, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMethodDef]* @method_methods)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 512, align: 64, elements: !666)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !287, line: 47, baseType: !286)
!666 = !{!667}
!667 = !DISubrange(count: 2)
!668 = !DIGlobalVariable(name: "PyId_getattr", scope: !546, file: !1, line: 80, type: !652, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @method_reduce.PyId_getattr)
!669 = !DIGlobalVariable(name: "method_memberlist", scope: !0, file: !1, line: 102, type: !670, isLocal: true, isDefinition: true, variable: [3 x %struct.PyMemberDef]* @method_memberlist)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 960, align: 64, elements: !672)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !297, line: 24, baseType: !296)
!672 = !{!673}
!673 = !DISubrange(count: 3)
!674 = !DIGlobalVariable(name: "method_getset", scope: !0, file: !1, line: 127, type: !675, isLocal: true, isDefinition: true, variable: [2 x %struct.PyGetSetDef]* @method_getset)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 640, align: 64, elements: !666)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !307, line: 17, baseType: !306)
!677 = !DIGlobalVariable(name: "docstr", scope: !554, file: !1, line: 118, type: !43, isLocal: true, isDefinition: true, variable: %struct._object** @method_get_doc.docstr)
!678 = !DIGlobalVariable(name: "instancemethod_doc", scope: !0, file: !1, line: 617, type: !679, isLocal: true, isDefinition: true, variable: [54 x i8]* @instancemethod_doc)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 432, align: 8, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 54)
!682 = !DIGlobalVariable(name: "instancemethod_memberlist", scope: !0, file: !1, line: 467, type: !683, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMemberDef]* @instancemethod_memberlist)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 640, align: 64, elements: !666)
!684 = !DIGlobalVariable(name: "instancemethod_getset", scope: !0, file: !1, line: 485, type: !675, isLocal: true, isDefinition: true, variable: [2 x %struct.PyGetSetDef]* @instancemethod_getset)
!685 = !DIGlobalVariable(name: "docstr", scope: !630, file: !1, line: 476, type: !43, isLocal: true, isDefinition: true, variable: %struct._object** @instancemethod_get_doc.docstr)
!686 = !{i32 2, !"Dwarf Version", i32 4}
!687 = !{i32 2, !"Debug Info Version", i32 3}
!688 = !{!"clang version 3.7.0 (tags/RELEASE_370/final)"}
!689 = !DIExpression()
!690 = !DILocation(line: 20, column: 29, scope: !388)
!691 = !DILocation(line: 22, column: 10, scope: !692)
!692 = distinct !DILexicalBlock(scope: !388, file: !1, line: 22, column: 9)
!693 = !{!694, !698, i64 8}
!694 = !{!"_object", !695, i64 0, !698, i64 8}
!695 = !{!"long", !696, i64 0}
!696 = !{!"omnipotent char", !697, i64 0}
!697 = !{!"Simple C/C++ TBAA"}
!698 = !{!"any pointer", !696, i64 0}
!699 = !DILocation(line: 22, column: 9, scope: !388)
!700 = !DILocation(line: 23, column: 9, scope: !701)
!701 = distinct !DILexicalBlock(scope: !692, file: !1, line: 22, column: 30)
!702 = !DILocation(line: 24, column: 9, scope: !701)
!703 = !DILocation(line: 26, column: 36, scope: !388)
!704 = !{!705, !698, i64 16}
!705 = !{!"", !694, i64 0, !698, i64 16, !698, i64 24, !698, i64 32}
