; ModuleID = 'codecs.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Py_atomic_address = type { i8* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !477, globals: !1075)
!1 = !DIFile(filename: "Python/codecs.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3, !11}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !4, line: 23, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!7 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!8 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!9 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!10 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !12, line: 451, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!15 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!16 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!17 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!18 = !{!19, !121, !36, !416, !424, !425, !443, !451, !462, !461, !466, !465, !469, !468, !75, !470, !472, !474, !42, !126, !463, !476}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !21, line: 139, baseType: !22)
!21 = !DIFile(filename: "Include/pystate.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !21, line: 69, size: 1536, align: 64, elements: !23)
!23 = !{!24, !26, !27, !386, !389, !390, !391, !392, !393, !394, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !22, file: !21, line: 72, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !22, file: !21, line: 73, baseType: !25, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !22, file: !21, line: 74, baseType: !28, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !21, line: 44, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !21, line: 19, size: 832, align: 64, elements: !31)
!31 = !{!32, !34, !35, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !30, file: !21, line: 21, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !30, file: !21, line: 22, baseType: !25, size: 64, align: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !30, file: !21, line: 24, baseType: !36, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !38, line: 109, baseType: !39)
!38 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !38, line: 105, size: 128, align: 64, elements: !40)
!40 = !{!41, !49}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !39, file: !38, line: 107, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !43, line: 177, baseType: !44)
!43 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !45, line: 102, baseType: !46)
!45 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !47, line: 181, baseType: !48)
!47 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!48 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !39, file: !38, line: 108, baseType: !50, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !38, line: 334, size: 3200, align: 64, elements: !52)
!52 = !{!53, !59, !63, !64, !65, !70, !134, !139, !144, !145, !150, !202, !233, !245, !251, !252, !253, !255, !257, !288, !289, !290, !299, !300, !305, !306, !308, !310, !320, !323, !341, !342, !343, !345, !347, !348, !350, !355, !360, !365, !366, !367, !368, !369, !370, !371, !372, !374}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !51, file: !38, line: 335, baseType: !54, size: 192, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !38, line: 114, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 111, size: 192, align: 64, elements: !56)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !55, file: !38, line: 112, baseType: !37, size: 128, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !55, file: !38, line: 113, baseType: !42, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !51, file: !38, line: 336, baseType: !60, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !51, file: !38, line: 337, baseType: !42, size: 64, align: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !51, file: !38, line: 337, baseType: !42, size: 64, align: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !51, file: !38, line: 341, baseType: !66, size: 64, align: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !38, line: 308, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !36}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !51, file: !38, line: 342, baseType: !71, size: 64, align: 64, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !38, line: 314, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!75, !36, !76, !75}
!75 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !45, line: 48, baseType: !78)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !79, line: 246, size: 1728, align: 64, elements: !80)
!79 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!80 = !{!81, !82, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !102, !103, !104, !105, !107, !109, !111, !115, !118, !120, !122, !123, !124, !125, !129, !130}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !78, file: !79, line: 247, baseType: !75, size: 32, align: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !78, file: !79, line: 252, baseType: !83, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !78, file: !79, line: 253, baseType: !83, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !78, file: !79, line: 254, baseType: !83, size: 64, align: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !78, file: !79, line: 255, baseType: !83, size: 64, align: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !78, file: !79, line: 256, baseType: !83, size: 64, align: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !78, file: !79, line: 257, baseType: !83, size: 64, align: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !78, file: !79, line: 258, baseType: !83, size: 64, align: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !78, file: !79, line: 259, baseType: !83, size: 64, align: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !78, file: !79, line: 261, baseType: !83, size: 64, align: 64, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !78, file: !79, line: 262, baseType: !83, size: 64, align: 64, offset: 640)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !78, file: !79, line: 263, baseType: !83, size: 64, align: 64, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !78, file: !79, line: 265, baseType: !95, size: 64, align: 64, offset: 768)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !79, line: 161, size: 192, align: 64, elements: !97)
!97 = !{!98, !99, !101}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !96, file: !79, line: 162, baseType: !95, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !96, file: !79, line: 163, baseType: !100, size: 64, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !96, file: !79, line: 167, baseType: !75, size: 32, align: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !78, file: !79, line: 267, baseType: !100, size: 64, align: 64, offset: 832)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !78, file: !79, line: 269, baseType: !75, size: 32, align: 32, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !78, file: !79, line: 273, baseType: !75, size: 32, align: 32, offset: 928)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !78, file: !79, line: 275, baseType: !106, size: 64, align: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !47, line: 140, baseType: !48)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !78, file: !79, line: 279, baseType: !108, size: 16, align: 16, offset: 1024)
!108 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !78, file: !79, line: 280, baseType: !110, size: 8, align: 8, offset: 1040)
!110 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !78, file: !79, line: 281, baseType: !112, size: 8, align: 8, offset: 1048)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 8, align: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 1)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !78, file: !79, line: 285, baseType: !116, size: 64, align: 64, offset: 1088)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !79, line: 155, baseType: null)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !78, file: !79, line: 294, baseType: !119, size: 64, align: 64, offset: 1152)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !47, line: 141, baseType: !48)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !78, file: !79, line: 303, baseType: !121, size: 64, align: 64, offset: 1216)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !78, file: !79, line: 304, baseType: !121, size: 64, align: 64, offset: 1280)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !78, file: !79, line: 305, baseType: !121, size: 64, align: 64, offset: 1344)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !78, file: !79, line: 306, baseType: !121, size: 64, align: 64, offset: 1408)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !78, file: !79, line: 307, baseType: !126, size: 64, align: 64, offset: 1472)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !127, line: 62, baseType: !128)
!127 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!128 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !78, file: !79, line: 309, baseType: !75, size: 32, align: 32, offset: 1536)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !78, file: !79, line: 311, baseType: !131, size: 160, align: 8, offset: 1568)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 160, align: 8, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 20)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !51, file: !38, line: 343, baseType: !135, size: 64, align: 64, offset: 512)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !38, line: 316, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!36, !36, !83}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !51, file: !38, line: 344, baseType: !140, size: 64, align: 64, offset: 576)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !38, line: 318, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!75, !36, !83, !36}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !51, file: !38, line: 345, baseType: !121, size: 64, align: 64, offset: 640)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !51, file: !38, line: 346, baseType: !146, size: 64, align: 64, offset: 704)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !38, line: 320, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!36, !36}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !51, file: !38, line: 350, baseType: !151, size: 64, align: 64, offset: 768)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !38, line: 278, baseType: !153)
!153 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 236, size: 2176, align: 64, elements: !154)
!154 = !{!155, !160, !161, !162, !163, !164, !169, !171, !172, !173, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !153, file: !38, line: 241, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !38, line: 166, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!36, !36, !36}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !153, file: !38, line: 242, baseType: !156, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !153, file: !38, line: 243, baseType: !156, size: 64, align: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !153, file: !38, line: 244, baseType: !156, size: 64, align: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !153, file: !38, line: 245, baseType: !156, size: 64, align: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !153, file: !38, line: 246, baseType: !165, size: 64, align: 64, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !38, line: 167, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!36, !36, !36, !36}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !153, file: !38, line: 247, baseType: !170, size: 64, align: 64, offset: 384)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !38, line: 165, baseType: !147)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !153, file: !38, line: 248, baseType: !170, size: 64, align: 64, offset: 448)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !153, file: !38, line: 249, baseType: !170, size: 64, align: 64, offset: 512)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !153, file: !38, line: 250, baseType: !174, size: 64, align: 64, offset: 576)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !38, line: 168, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!75, !36}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !153, file: !38, line: 251, baseType: !170, size: 64, align: 64, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !153, file: !38, line: 252, baseType: !156, size: 64, align: 64, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !153, file: !38, line: 253, baseType: !156, size: 64, align: 64, offset: 768)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !153, file: !38, line: 254, baseType: !156, size: 64, align: 64, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !153, file: !38, line: 255, baseType: !156, size: 64, align: 64, offset: 896)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !153, file: !38, line: 256, baseType: !156, size: 64, align: 64, offset: 960)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !153, file: !38, line: 257, baseType: !170, size: 64, align: 64, offset: 1024)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !153, file: !38, line: 258, baseType: !121, size: 64, align: 64, offset: 1088)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !153, file: !38, line: 259, baseType: !170, size: 64, align: 64, offset: 1152)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !153, file: !38, line: 261, baseType: !156, size: 64, align: 64, offset: 1216)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !153, file: !38, line: 262, baseType: !156, size: 64, align: 64, offset: 1280)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !153, file: !38, line: 263, baseType: !156, size: 64, align: 64, offset: 1344)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !153, file: !38, line: 264, baseType: !156, size: 64, align: 64, offset: 1408)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !153, file: !38, line: 265, baseType: !165, size: 64, align: 64, offset: 1472)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !153, file: !38, line: 266, baseType: !156, size: 64, align: 64, offset: 1536)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !153, file: !38, line: 267, baseType: !156, size: 64, align: 64, offset: 1600)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !153, file: !38, line: 268, baseType: !156, size: 64, align: 64, offset: 1664)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !153, file: !38, line: 269, baseType: !156, size: 64, align: 64, offset: 1728)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !153, file: !38, line: 270, baseType: !156, size: 64, align: 64, offset: 1792)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !153, file: !38, line: 272, baseType: !156, size: 64, align: 64, offset: 1856)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !153, file: !38, line: 273, baseType: !156, size: 64, align: 64, offset: 1920)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !153, file: !38, line: 274, baseType: !156, size: 64, align: 64, offset: 1984)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !153, file: !38, line: 275, baseType: !156, size: 64, align: 64, offset: 2048)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !153, file: !38, line: 277, baseType: !170, size: 64, align: 64, offset: 2112)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !51, file: !38, line: 351, baseType: !203, size: 64, align: 64, offset: 832)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !38, line: 292, baseType: !205)
!205 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 280, size: 640, align: 64, elements: !206)
!206 = !{!207, !212, !213, !218, !219, !220, !225, !226, !231, !232}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !205, file: !38, line: 281, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !38, line: 169, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!42, !36}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !205, file: !38, line: 282, baseType: !156, size: 64, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !205, file: !38, line: 283, baseType: !214, size: 64, align: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !38, line: 170, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!36, !36, !42}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !205, file: !38, line: 284, baseType: !214, size: 64, align: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !205, file: !38, line: 285, baseType: !121, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !205, file: !38, line: 286, baseType: !221, size: 64, align: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !38, line: 172, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!75, !36, !42, !36}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !205, file: !38, line: 287, baseType: !121, size: 64, align: 64, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !205, file: !38, line: 288, baseType: !227, size: 64, align: 64, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !38, line: 231, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!75, !36, !36}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !205, file: !38, line: 290, baseType: !156, size: 64, align: 64, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !205, file: !38, line: 291, baseType: !214, size: 64, align: 64, offset: 576)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !51, file: !38, line: 352, baseType: !234, size: 64, align: 64, offset: 896)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !38, line: 298, baseType: !236)
!236 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 294, size: 192, align: 64, elements: !237)
!237 = !{!238, !239, !240}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !236, file: !38, line: 295, baseType: !208, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !236, file: !38, line: 296, baseType: !156, size: 64, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !236, file: !38, line: 297, baseType: !241, size: 64, align: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !38, line: 174, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!75, !36, !36, !36}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !51, file: !38, line: 356, baseType: !246, size: 64, align: 64, offset: 960)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !38, line: 321, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!250, !36}
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !43, line: 186, baseType: !42)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !51, file: !38, line: 357, baseType: !165, size: 64, align: 64, offset: 1024)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !51, file: !38, line: 358, baseType: !146, size: 64, align: 64, offset: 1088)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !51, file: !38, line: 359, baseType: !254, size: 64, align: 64, offset: 1152)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !38, line: 317, baseType: !157)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !51, file: !38, line: 360, baseType: !256, size: 64, align: 64, offset: 1216)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !38, line: 319, baseType: !242)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !51, file: !38, line: 363, baseType: !258, size: 64, align: 64, offset: 1280)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !38, line: 304, baseType: !260)
!260 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 301, size: 128, align: 64, elements: !261)
!261 = !{!262, !283}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !260, file: !38, line: 302, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !38, line: 193, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!75, !36, !267, !75}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !38, line: 191, baseType: !269)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !38, line: 178, size: 640, align: 64, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !276, !277, !278, !280, !281, !282}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !269, file: !38, line: 179, baseType: !121, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !269, file: !38, line: 180, baseType: !36, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !269, file: !38, line: 181, baseType: !42, size: 64, align: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !269, file: !38, line: 182, baseType: !42, size: 64, align: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !269, file: !38, line: 184, baseType: !75, size: 32, align: 32, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !269, file: !38, line: 185, baseType: !75, size: 32, align: 32, offset: 288)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !269, file: !38, line: 186, baseType: !83, size: 64, align: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !269, file: !38, line: 187, baseType: !279, size: 64, align: 64, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !269, file: !38, line: 188, baseType: !279, size: 64, align: 64, offset: 448)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !269, file: !38, line: 189, baseType: !279, size: 64, align: 64, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !269, file: !38, line: 190, baseType: !121, size: 64, align: 64, offset: 576)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !260, file: !38, line: 303, baseType: !284, size: 64, align: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !38, line: 194, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !36, !267}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !51, file: !38, line: 366, baseType: !128, size: 64, align: 64, offset: 1344)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !51, file: !38, line: 368, baseType: !60, size: 64, align: 64, offset: 1408)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !51, file: !38, line: 372, baseType: !291, size: 64, align: 64, offset: 1472)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !38, line: 233, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!75, !36, !295, !121}
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !38, line: 232, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!75, !36, !121}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !51, file: !38, line: 375, baseType: !174, size: 64, align: 64, offset: 1536)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !51, file: !38, line: 379, baseType: !301, size: 64, align: 64, offset: 1600)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !38, line: 322, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!36, !36, !36, !75}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !51, file: !38, line: 382, baseType: !42, size: 64, align: 64, offset: 1664)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !51, file: !38, line: 385, baseType: !307, size: 64, align: 64, offset: 1728)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !38, line: 323, baseType: !147)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !51, file: !38, line: 386, baseType: !309, size: 64, align: 64, offset: 1792)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !38, line: 324, baseType: !147)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !51, file: !38, line: 389, baseType: !311, size: 64, align: 64, offset: 1856)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !313, line: 40, size: 256, align: 64, elements: !314)
!313 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!314 = !{!315, !316, !318, !319}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !312, file: !313, line: 41, baseType: !60, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !312, file: !313, line: 42, baseType: !317, size: 64, align: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !313, line: 18, baseType: !157)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !312, file: !313, line: 43, baseType: !75, size: 32, align: 32, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !312, file: !313, line: 45, baseType: !60, size: 64, align: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !51, file: !38, line: 390, baseType: !321, size: 64, align: 64, offset: 1920)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !38, line: 390, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !51, file: !38, line: 391, baseType: !324, size: 64, align: 64, offset: 1984)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !326, line: 11, size: 320, align: 64, elements: !327)
!326 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!327 = !{!328, !329, !334, !339, !340}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !325, file: !326, line: 12, baseType: !83, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !325, file: !326, line: 13, baseType: !330, size: 64, align: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !326, line: 8, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!36, !36, !121}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !325, file: !326, line: 14, baseType: !335, size: 64, align: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !326, line: 9, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!75, !36, !36, !121}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !325, file: !326, line: 15, baseType: !83, size: 64, align: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !325, file: !326, line: 16, baseType: !121, size: 64, align: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !51, file: !38, line: 392, baseType: !50, size: 64, align: 64, offset: 2048)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !51, file: !38, line: 393, baseType: !36, size: 64, align: 64, offset: 2112)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !51, file: !38, line: 394, baseType: !344, size: 64, align: 64, offset: 2176)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !38, line: 325, baseType: !166)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !51, file: !38, line: 395, baseType: !346, size: 64, align: 64, offset: 2240)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !38, line: 326, baseType: !242)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !51, file: !38, line: 396, baseType: !42, size: 64, align: 64, offset: 2304)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !51, file: !38, line: 397, baseType: !349, size: 64, align: 64, offset: 2368)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !38, line: 327, baseType: !242)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !51, file: !38, line: 398, baseType: !351, size: 64, align: 64, offset: 2432)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !38, line: 329, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!36, !50, !42}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !51, file: !38, line: 399, baseType: !356, size: 64, align: 64, offset: 2496)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !38, line: 328, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!36, !50, !36, !36}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !51, file: !38, line: 400, baseType: !361, size: 64, align: 64, offset: 2560)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !38, line: 307, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !121}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !51, file: !38, line: 401, baseType: !174, size: 64, align: 64, offset: 2624)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !51, file: !38, line: 402, baseType: !36, size: 64, align: 64, offset: 2688)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !51, file: !38, line: 403, baseType: !36, size: 64, align: 64, offset: 2752)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !51, file: !38, line: 404, baseType: !36, size: 64, align: 64, offset: 2816)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !51, file: !38, line: 405, baseType: !36, size: 64, align: 64, offset: 2880)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !51, file: !38, line: 406, baseType: !36, size: 64, align: 64, offset: 2944)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !51, file: !38, line: 407, baseType: !66, size: 64, align: 64, offset: 3008)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !51, file: !38, line: 410, baseType: !373, size: 32, align: 32, offset: 3072)
!373 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !51, file: !38, line: 412, baseType: !66, size: 64, align: 64, offset: 3136)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !30, file: !21, line: 25, baseType: !36, size: 64, align: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !30, file: !21, line: 26, baseType: !36, size: 64, align: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !30, file: !21, line: 27, baseType: !36, size: 64, align: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !30, file: !21, line: 28, baseType: !36, size: 64, align: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !30, file: !21, line: 30, baseType: !36, size: 64, align: 64, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !30, file: !21, line: 31, baseType: !36, size: 64, align: 64, offset: 512)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !30, file: !21, line: 32, baseType: !36, size: 64, align: 64, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !30, file: !21, line: 33, baseType: !75, size: 32, align: 32, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !30, file: !21, line: 34, baseType: !75, size: 32, align: 32, offset: 672)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !30, file: !21, line: 37, baseType: !75, size: 32, align: 32, offset: 704)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !30, file: !21, line: 43, baseType: !36, size: 64, align: 64, offset: 768)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !22, file: !21, line: 76, baseType: !387, size: 64, align: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !21, line: 50, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !22, file: !21, line: 77, baseType: !75, size: 32, align: 32, offset: 256)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !22, file: !21, line: 78, baseType: !62, size: 8, align: 8, offset: 288)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !22, file: !21, line: 80, baseType: !62, size: 8, align: 8, offset: 296)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !22, file: !21, line: 85, baseType: !75, size: 32, align: 32, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !22, file: !21, line: 86, baseType: !75, size: 32, align: 32, offset: 352)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !22, file: !21, line: 88, baseType: !395, size: 64, align: 64, offset: 384)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !21, line: 54, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!75, !36, !387, !75, !36}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !22, file: !21, line: 89, baseType: !395, size: 64, align: 64, offset: 448)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !22, file: !21, line: 90, baseType: !36, size: 64, align: 64, offset: 512)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !22, file: !21, line: 91, baseType: !36, size: 64, align: 64, offset: 576)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !22, file: !21, line: 93, baseType: !36, size: 64, align: 64, offset: 640)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !22, file: !21, line: 94, baseType: !36, size: 64, align: 64, offset: 704)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !22, file: !21, line: 95, baseType: !36, size: 64, align: 64, offset: 768)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !22, file: !21, line: 97, baseType: !36, size: 64, align: 64, offset: 832)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !22, file: !21, line: 98, baseType: !36, size: 64, align: 64, offset: 896)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !22, file: !21, line: 99, baseType: !36, size: 64, align: 64, offset: 960)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !22, file: !21, line: 101, baseType: !36, size: 64, align: 64, offset: 1024)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !22, file: !21, line: 103, baseType: !75, size: 32, align: 32, offset: 1088)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !22, file: !21, line: 105, baseType: !36, size: 64, align: 64, offset: 1152)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !22, file: !21, line: 106, baseType: !48, size: 64, align: 64, offset: 1216)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !22, file: !21, line: 108, baseType: !75, size: 32, align: 32, offset: 1280)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !22, file: !21, line: 109, baseType: !36, size: 64, align: 64, offset: 1344)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !22, file: !21, line: 134, baseType: !362, size: 64, align: 64, offset: 1408)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !22, file: !21, line: 135, baseType: !121, size: 64, align: 64, offset: 1472)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !418, line: 33, baseType: !419)
!418 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!419 = !DICompositeType(tag: DW_TAG_structure_type, file: !418, line: 25, size: 256, align: 64, elements: !420)
!420 = !{!421, !422}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !419, file: !418, line: 26, baseType: !54, size: 192, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !419, file: !418, line: 27, baseType: !423, size: 64, align: 64, offset: 192)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 64, align: 64, elements: !113)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !12, line: 351, baseType: !427)
!427 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 217, size: 384, align: 64, elements: !428)
!428 = !{!429, !430, !431, !432, !440}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !427, file: !12, line: 291, baseType: !37, size: 128, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !427, file: !12, line: 292, baseType: !42, size: 64, align: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !427, file: !12, line: 293, baseType: !250, size: 64, align: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !427, file: !12, line: 349, baseType: !433, size: 32, align: 32, offset: 256)
!433 = !DICompositeType(tag: DW_TAG_structure_type, scope: !427, file: !12, line: 294, size: 32, align: 32, elements: !434)
!434 = !{!435, !436, !437, !438, !439}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !433, file: !12, line: 303, baseType: !373, size: 2, align: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !433, file: !12, line: 331, baseType: !373, size: 3, align: 32, offset: 2)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !433, file: !12, line: 336, baseType: !373, size: 1, align: 32, offset: 5)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !433, file: !12, line: 340, baseType: !373, size: 1, align: 32, offset: 6)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !433, file: !12, line: 345, baseType: !373, size: 1, align: 32, offset: 7)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !427, file: !12, line: 350, baseType: !441, size: 64, align: 64, offset: 320)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !127, line: 90, baseType: !75)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !12, line: 363, baseType: !445)
!445 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 356, size: 576, align: 64, elements: !446)
!446 = !{!447, !448, !449, !450}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !445, file: !12, line: 357, baseType: !426, size: 384, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !445, file: !12, line: 358, baseType: !42, size: 64, align: 64, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !445, file: !12, line: 360, baseType: !83, size: 64, align: 64, offset: 448)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !445, file: !12, line: 361, baseType: !42, size: 64, align: 64, offset: 512)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !12, line: 376, baseType: !453)
!453 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 368, size: 640, align: 64, elements: !454)
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !453, file: !12, line: 369, baseType: !444, size: 576, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !453, file: !12, line: 375, baseType: !457, size: 64, align: 64, offset: 576)
!457 = !DICompositeType(tag: DW_TAG_union_type, scope: !453, file: !12, line: 370, size: 64, align: 64, elements: !458)
!458 = !{!459, !460, !464, !467}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !457, file: !12, line: 371, baseType: !121, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !457, file: !12, line: 372, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !12, line: 134, baseType: !463)
!463 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !457, file: !12, line: 373, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !12, line: 129, baseType: !108)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !457, file: !12, line: 374, baseType: !468, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !12, line: 121, baseType: !373)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !462)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !469)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!477 = !{!478, !495, !538, !548, !554, !558, !561, !564, !570, !574, !581, !586, !594, !600, !622, !628, !634, !646, !656, !659, !663, !681, !706, !722, !731, !736, !739, !750, !759, !769, !780, !794, !826, !838, !844, !874, !877, !888, !891, !904, !927, !931, !935, !939, !943, !947, !951, !1019, !1026, !1030}
!478 = !DISubprogram(name: "PyCodec_Register", scope: !1, file: !1, line: 31, type: !176, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @PyCodec_Register, variables: !479)
!479 = !{!480, !481, !482, !489, !490, !493}
!480 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "search_function", arg: 1, scope: !478, file: !1, line: 31, type: !36)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp", scope: !478, file: !1, line: 33, type: !28)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !483, file: !1, line: 33, type: !484)
!483 = distinct !DILexicalBlock(scope: !478, file: !1, line: 33, column: 34)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !4, line: 33, baseType: !486)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !4, line: 31, size: 64, align: 64, elements: !487)
!487 = !{!488}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !486, file: !4, line: 32, baseType: !121, size: 64, align: 64)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !483, file: !1, line: 33, type: !121)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !483, file: !1, line: 33, type: !491)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !483, file: !1, line: 33, type: !494)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !4, line: 29, baseType: !3)
!495 = !DISubprogram(name: "_PyCodec_Lookup", scope: !1, file: !1, line: 100, type: !496, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @_PyCodec_Lookup, variables: !498)
!496 = !DISubroutineType(types: !497)
!497 = !{!36, !60}
!498 = !{!499, !500, !501, !502, !503, !504, !505, !506, !508, !509, !510, !511, !515, !519, !523, !527, !531, !533, !535}
!499 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !495, file: !1, line: 100, type: !60)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp", scope: !495, file: !1, line: 102, type: !28)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !495, file: !1, line: 103, type: !36)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !495, file: !1, line: 103, type: !36)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !495, file: !1, line: 103, type: !36)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !495, file: !1, line: 104, type: !42)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !495, file: !1, line: 104, type: !42)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !507, file: !1, line: 111, type: !484)
!507 = distinct !DILexicalBlock(scope: !495, file: !1, line: 111, column: 14)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !507, file: !1, line: 111, type: !121)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !507, file: !1, line: 111, type: !491)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !507, file: !1, line: 111, type: !494)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !512, file: !1, line: 127, type: !36)
!512 = distinct !DILexicalBlock(scope: !513, file: !1, line: 127, column: 9)
!513 = distinct !DILexicalBlock(scope: !514, file: !1, line: 125, column: 25)
!514 = distinct !DILexicalBlock(scope: !495, file: !1, line: 125, column: 9)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !516, file: !1, line: 148, type: !36)
!516 = distinct !DILexicalBlock(scope: !517, file: !1, line: 147, column: 31)
!517 = distinct !DILexicalBlock(scope: !518, file: !1, line: 147, column: 5)
!518 = distinct !DILexicalBlock(scope: !495, file: !1, line: 147, column: 5)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !520, file: !1, line: 157, type: !36)
!520 = distinct !DILexicalBlock(scope: !521, file: !1, line: 157, column: 13)
!521 = distinct !DILexicalBlock(scope: !522, file: !1, line: 156, column: 32)
!522 = distinct !DILexicalBlock(scope: !516, file: !1, line: 156, column: 13)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !524, file: !1, line: 163, type: !36)
!524 = distinct !DILexicalBlock(scope: !525, file: !1, line: 163, column: 13)
!525 = distinct !DILexicalBlock(scope: !526, file: !1, line: 160, column: 70)
!526 = distinct !DILexicalBlock(scope: !516, file: !1, line: 160, column: 13)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !528, file: !1, line: 177, type: !36)
!528 = distinct !DILexicalBlock(scope: !529, file: !1, line: 177, column: 9)
!529 = distinct !DILexicalBlock(scope: !530, file: !1, line: 176, column: 68)
!530 = distinct !DILexicalBlock(scope: !495, file: !1, line: 176, column: 9)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !532, file: !1, line: 180, type: !36)
!532 = distinct !DILexicalBlock(scope: !495, file: !1, line: 180, column: 5)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !534, file: !1, line: 184, type: !36)
!534 = distinct !DILexicalBlock(scope: !495, file: !1, line: 184, column: 5)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !536, file: !1, line: 184, type: !36)
!536 = distinct !DILexicalBlock(scope: !537, file: !1, line: 184, column: 5)
!537 = distinct !DILexicalBlock(scope: !534, file: !1, line: 184, column: 5)
!538 = !DISubprogram(name: "PyCodec_KnownEncoding", scope: !1, file: !1, line: 190, type: !539, isLocal: false, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @PyCodec_KnownEncoding, variables: !541)
!539 = !DISubroutineType(types: !540)
!540 = !{!75, !60}
!541 = !{!542, !543, !544}
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !538, file: !1, line: 190, type: !60)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codecs", scope: !538, file: !1, line: 192, type: !36)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !545, file: !1, line: 200, type: !36)
!545 = distinct !DILexicalBlock(scope: !546, file: !1, line: 200, column: 9)
!546 = distinct !DILexicalBlock(scope: !547, file: !1, line: 199, column: 10)
!547 = distinct !DILexicalBlock(scope: !538, file: !1, line: 195, column: 9)
!548 = !DISubprogram(name: "_PyCodecInfo_GetIncrementalDecoder", scope: !1, file: !1, line: 306, type: !549, isLocal: false, isDefinition: true, scopeLine: 308, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*)* @_PyCodecInfo_GetIncrementalDecoder, variables: !551)
!549 = !DISubroutineType(types: !550)
!550 = !{!36, !36, !60}
!551 = !{!552, !553}
!552 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "codec_info", arg: 1, scope: !548, file: !1, line: 306, type: !36)
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 2, scope: !548, file: !1, line: 307, type: !60)
!554 = !DISubprogram(name: "_PyCodecInfo_GetIncrementalEncoder", scope: !1, file: !1, line: 313, type: !549, isLocal: false, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*)* @_PyCodecInfo_GetIncrementalEncoder, variables: !555)
!555 = !{!556, !557}
!556 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "codec_info", arg: 1, scope: !554, file: !1, line: 313, type: !36)
!557 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 2, scope: !554, file: !1, line: 314, type: !60)
!558 = !DISubprogram(name: "PyCodec_Encoder", scope: !1, file: !1, line: 327, type: !496, isLocal: false, isDefinition: true, scopeLine: 328, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @PyCodec_Encoder, variables: !559)
!559 = !{!560}
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !558, file: !1, line: 327, type: !60)
!561 = !DISubprogram(name: "PyCodec_Decoder", scope: !1, file: !1, line: 332, type: !496, isLocal: false, isDefinition: true, scopeLine: 333, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @PyCodec_Decoder, variables: !562)
!562 = !{!563}
!563 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !561, file: !1, line: 332, type: !60)
!564 = !DISubprogram(name: "PyCodec_IncrementalEncoder", scope: !1, file: !1, line: 337, type: !565, isLocal: false, isDefinition: true, scopeLine: 339, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i8*)* @PyCodec_IncrementalEncoder, variables: !567)
!565 = !DISubroutineType(types: !566)
!566 = !{!36, !60, !60}
!567 = !{!568, !569}
!568 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !564, file: !1, line: 337, type: !60)
!569 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 2, scope: !564, file: !1, line: 338, type: !60)
!570 = !DISubprogram(name: "PyCodec_IncrementalDecoder", scope: !1, file: !1, line: 343, type: !565, isLocal: false, isDefinition: true, scopeLine: 345, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i8*)* @PyCodec_IncrementalDecoder, variables: !571)
!571 = !{!572, !573}
!572 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !570, file: !1, line: 343, type: !60)
!573 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 2, scope: !570, file: !1, line: 344, type: !60)
!574 = !DISubprogram(name: "PyCodec_StreamReader", scope: !1, file: !1, line: 349, type: !575, isLocal: false, isDefinition: true, scopeLine: 352, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct._object*, i8*)* @PyCodec_StreamReader, variables: !577)
!575 = !DISubroutineType(types: !576)
!576 = !{!36, !60, !36, !60}
!577 = !{!578, !579, !580}
!578 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !574, file: !1, line: 349, type: !60)
!579 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stream", arg: 2, scope: !574, file: !1, line: 350, type: !36)
!580 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 3, scope: !574, file: !1, line: 351, type: !60)
!581 = !DISubprogram(name: "PyCodec_StreamWriter", scope: !1, file: !1, line: 356, type: !575, isLocal: false, isDefinition: true, scopeLine: 359, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct._object*, i8*)* @PyCodec_StreamWriter, variables: !582)
!582 = !{!583, !584, !585}
!583 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !581, file: !1, line: 356, type: !60)
!584 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stream", arg: 2, scope: !581, file: !1, line: 357, type: !36)
!585 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 3, scope: !581, file: !1, line: 358, type: !60)
!586 = !DISubprogram(name: "PyCodec_Encode", scope: !1, file: !1, line: 471, type: !587, isLocal: false, isDefinition: true, scopeLine: 474, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*, i8*)* @PyCodec_Encode, variables: !589)
!587 = !DISubroutineType(types: !588)
!588 = !{!36, !36, !60, !60}
!589 = !{!590, !591, !592, !593}
!590 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !586, file: !1, line: 471, type: !36)
!591 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 2, scope: !586, file: !1, line: 472, type: !60)
!592 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 3, scope: !586, file: !1, line: 473, type: !60)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "encoder", scope: !586, file: !1, line: 475, type: !36)
!594 = !DISubprogram(name: "PyCodec_Decode", scope: !1, file: !1, line: 484, type: !587, isLocal: false, isDefinition: true, scopeLine: 487, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*, i8*)* @PyCodec_Decode, variables: !595)
!595 = !{!596, !597, !598, !599}
!596 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !594, file: !1, line: 484, type: !36)
!597 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 2, scope: !594, file: !1, line: 485, type: !60)
!598 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 3, scope: !594, file: !1, line: 486, type: !60)
!599 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoder", scope: !594, file: !1, line: 488, type: !36)
!600 = !DISubprogram(name: "_PyCodec_LookupTextEncoding", scope: !1, file: !1, line: 498, type: !565, isLocal: false, isDefinition: true, scopeLine: 500, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i8*)* @_PyCodec_LookupTextEncoding, variables: !601)
!601 = !{!602, !603, !604, !605, !606, !607, !615, !618}
!602 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !600, file: !1, line: 498, type: !60)
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alternate_command", arg: 2, scope: !600, file: !1, line: 499, type: !60)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codec", scope: !600, file: !1, line: 502, type: !36)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "attr", scope: !600, file: !1, line: 503, type: !36)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "is_text_codec", scope: !600, file: !1, line: 504, type: !75)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !608, file: !1, line: 520, type: !36)
!608 = distinct !DILexicalBlock(scope: !609, file: !1, line: 520, column: 17)
!609 = distinct !DILexicalBlock(scope: !610, file: !1, line: 519, column: 20)
!610 = distinct !DILexicalBlock(scope: !611, file: !1, line: 517, column: 17)
!611 = distinct !DILexicalBlock(scope: !612, file: !1, line: 516, column: 27)
!612 = distinct !DILexicalBlock(scope: !613, file: !1, line: 516, column: 13)
!613 = distinct !DILexicalBlock(scope: !614, file: !1, line: 514, column: 37)
!614 = distinct !DILexicalBlock(scope: !600, file: !1, line: 514, column: 9)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !616, file: !1, line: 525, type: !36)
!616 = distinct !DILexicalBlock(scope: !617, file: !1, line: 525, column: 13)
!617 = distinct !DILexicalBlock(scope: !612, file: !1, line: 523, column: 16)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !619, file: !1, line: 527, type: !36)
!619 = distinct !DILexicalBlock(scope: !620, file: !1, line: 527, column: 17)
!620 = distinct !DILexicalBlock(scope: !621, file: !1, line: 526, column: 33)
!621 = distinct !DILexicalBlock(scope: !617, file: !1, line: 526, column: 17)
!622 = !DISubprogram(name: "_PyCodec_EncodeText", scope: !1, file: !1, line: 570, type: !587, isLocal: false, isDefinition: true, scopeLine: 573, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*, i8*)* @_PyCodec_EncodeText, variables: !623)
!623 = !{!624, !625, !626, !627}
!624 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !622, file: !1, line: 570, type: !36)
!625 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 2, scope: !622, file: !1, line: 571, type: !60)
!626 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 3, scope: !622, file: !1, line: 572, type: !60)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "encoder", scope: !622, file: !1, line: 574, type: !36)
!628 = !DISubprogram(name: "_PyCodec_DecodeText", scope: !1, file: !1, line: 583, type: !587, isLocal: false, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*, i8*)* @_PyCodec_DecodeText, variables: !629)
!629 = !{!630, !631, !632, !633}
!630 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !628, file: !1, line: 583, type: !36)
!631 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 2, scope: !628, file: !1, line: 584, type: !60)
!632 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 3, scope: !628, file: !1, line: 585, type: !60)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoder", scope: !628, file: !1, line: 587, type: !36)
!634 = !DISubprogram(name: "PyCodec_RegisterError", scope: !1, file: !1, line: 602, type: !635, isLocal: false, isDefinition: true, scopeLine: 603, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._object*)* @PyCodec_RegisterError, variables: !637)
!635 = !DISubroutineType(types: !636)
!636 = !{!75, !60, !36}
!637 = !{!638, !639, !640, !641, !643, !644, !645}
!638 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !634, file: !1, line: 602, type: !60)
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "error", arg: 2, scope: !634, file: !1, line: 602, type: !36)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp", scope: !634, file: !1, line: 604, type: !28)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !642, file: !1, line: 604, type: !484)
!642 = distinct !DILexicalBlock(scope: !634, file: !1, line: 604, column: 34)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !642, file: !1, line: 604, type: !121)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !642, file: !1, line: 604, type: !491)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !642, file: !1, line: 604, type: !494)
!646 = !DISubprogram(name: "PyCodec_LookupError", scope: !1, file: !1, line: 618, type: !496, isLocal: false, isDefinition: true, scopeLine: 619, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @PyCodec_LookupError, variables: !647)
!647 = !{!648, !649, !650, !651, !653, !654, !655}
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !646, file: !1, line: 618, type: !60)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handler", scope: !646, file: !1, line: 620, type: !36)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp", scope: !646, file: !1, line: 622, type: !28)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !652, file: !1, line: 622, type: !484)
!652 = distinct !DILexicalBlock(scope: !646, file: !1, line: 622, column: 34)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !652, file: !1, line: 622, type: !121)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !652, file: !1, line: 622, type: !491)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !652, file: !1, line: 622, type: !494)
!656 = !DISubprogram(name: "PyCodec_StrictErrors", scope: !1, file: !1, line: 652, type: !148, isLocal: false, isDefinition: true, scopeLine: 653, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyCodec_StrictErrors, variables: !657)
!657 = !{!658}
!658 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !656, file: !1, line: 652, type: !36)
!659 = !DISubprogram(name: "PyCodec_IgnoreErrors", scope: !1, file: !1, line: 662, type: !148, isLocal: false, isDefinition: true, scopeLine: 663, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyCodec_IgnoreErrors, variables: !660)
!660 = !{!661, !662}
!661 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !659, file: !1, line: 662, type: !36)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !659, file: !1, line: 664, type: !42)
!663 = !DISubprogram(name: "PyCodec_ReplaceErrors", scope: !1, file: !1, line: 685, type: !148, isLocal: false, isDefinition: true, scopeLine: 686, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyCodec_ReplaceErrors, variables: !664)
!664 = !{!665, !666, !667, !668, !669, !670, !673, !674, !675, !679, !680}
!665 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !663, file: !1, line: 685, type: !36)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !663, file: !1, line: 687, type: !42)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !663, file: !1, line: 687, type: !42)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !663, file: !1, line: 687, type: !42)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !663, file: !1, line: 687, type: !42)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !671, file: !1, line: 690, type: !36)
!671 = distinct !DILexicalBlock(scope: !672, file: !1, line: 689, column: 61)
!672 = distinct !DILexicalBlock(scope: !663, file: !1, line: 689, column: 9)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !671, file: !1, line: 691, type: !75)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !671, file: !1, line: 692, type: !121)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !676, file: !1, line: 716, type: !36)
!676 = distinct !DILexicalBlock(scope: !677, file: !1, line: 715, column: 69)
!677 = distinct !DILexicalBlock(scope: !678, file: !1, line: 715, column: 14)
!678 = distinct !DILexicalBlock(scope: !672, file: !1, line: 708, column: 14)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !676, file: !1, line: 717, type: !75)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !676, file: !1, line: 718, type: !121)
!681 = !DISubprogram(name: "PyCodec_XMLCharRefReplaceErrors", scope: !1, file: !1, line: 740, type: !148, isLocal: false, isDefinition: true, scopeLine: 741, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyCodec_XMLCharRefReplaceErrors, variables: !682)
!682 = !{!683, !684, !687, !688, !689, !690, !691, !692, !693, !694, !695, !699, !703, !704}
!683 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !681, file: !1, line: 740, type: !36)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "restuple", scope: !685, file: !1, line: 743, type: !36)
!685 = distinct !DILexicalBlock(scope: !686, file: !1, line: 742, column: 61)
!686 = distinct !DILexicalBlock(scope: !681, file: !1, line: 742, column: 9)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "object", scope: !685, file: !1, line: 744, type: !36)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !685, file: !1, line: 745, type: !42)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !685, file: !1, line: 746, type: !42)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !685, file: !1, line: 747, type: !42)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !685, file: !1, line: 748, type: !36)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outp", scope: !685, file: !1, line: 749, type: !476)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ressize", scope: !685, file: !1, line: 750, type: !75)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch", scope: !685, file: !1, line: 751, type: !469)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !696, file: !1, line: 779, type: !36)
!696 = distinct !DILexicalBlock(scope: !697, file: !1, line: 779, column: 13)
!697 = distinct !DILexicalBlock(scope: !698, file: !1, line: 778, column: 26)
!698 = distinct !DILexicalBlock(scope: !685, file: !1, line: 778, column: 13)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "digits", scope: !700, file: !1, line: 785, type: !75)
!700 = distinct !DILexicalBlock(scope: !701, file: !1, line: 784, column: 39)
!701 = distinct !DILexicalBlock(scope: !702, file: !1, line: 784, column: 9)
!702 = distinct !DILexicalBlock(scope: !685, file: !1, line: 784, column: 9)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !700, file: !1, line: 786, type: !75)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !705, file: !1, line: 827, type: !36)
!705 = distinct !DILexicalBlock(scope: !685, file: !1, line: 827, column: 9)
!706 = !DISubprogram(name: "PyCodec_BackslashReplaceErrors", scope: !1, file: !1, line: 836, type: !148, isLocal: false, isDefinition: true, scopeLine: 837, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyCodec_BackslashReplaceErrors, variables: !707)
!707 = !{!708, !709, !712, !713, !714, !715, !716, !717, !718, !719, !720}
!708 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !706, file: !1, line: 836, type: !36)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "restuple", scope: !710, file: !1, line: 839, type: !36)
!710 = distinct !DILexicalBlock(scope: !711, file: !1, line: 838, column: 61)
!711 = distinct !DILexicalBlock(scope: !706, file: !1, line: 838, column: 9)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "object", scope: !710, file: !1, line: 840, type: !36)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !710, file: !1, line: 841, type: !42)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !710, file: !1, line: 842, type: !42)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !710, file: !1, line: 843, type: !42)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !710, file: !1, line: 844, type: !36)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outp", scope: !710, file: !1, line: 845, type: !476)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ressize", scope: !710, file: !1, line: 846, type: !75)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !710, file: !1, line: 847, type: !469)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !721, file: !1, line: 895, type: !36)
!721 = distinct !DILexicalBlock(scope: !710, file: !1, line: 895, column: 9)
!722 = !DISubprogram(name: "_Py_ANNOTATE_MEMORY_ORDER", scope: !4, file: !4, line: 59, type: !723, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, variables: !728)
!723 = !DISubroutineType(types: !724)
!724 = !{null, !725, !494}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64, align: 64)
!726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !727)
!727 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!728 = !{!729, !730}
!729 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "address", arg: 1, scope: !722, file: !4, line: 59, type: !725)
!730 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 2, scope: !722, file: !4, line: 59, type: !494)
!731 = !DISubprogram(name: "_Py_atomic_thread_fence", scope: !4, file: !4, line: 51, type: !732, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, variables: !734)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !494}
!734 = !{!735}
!735 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !731, file: !4, line: 51, type: !494)
!736 = !DISubprogram(name: "_Py_atomic_signal_fence", scope: !4, file: !4, line: 44, type: !732, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, variables: !737)
!737 = !{!738}
!738 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !736, file: !4, line: 44, type: !494)
!739 = !DISubprogram(name: "normalizestring", scope: !1, file: !1, line: 54, type: !496, isLocal: true, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: true, variables: !740)
!740 = !{!741, !742, !743, !744, !745, !746}
!741 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "string", arg: 1, scope: !739, file: !1, line: 54, type: !60)
!742 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !739, file: !1, line: 56, type: !126)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !739, file: !1, line: 57, type: !126)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !739, file: !1, line: 58, type: !83)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !739, file: !1, line: 59, type: !36)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch", scope: !747, file: !1, line: 70, type: !62)
!747 = distinct !DILexicalBlock(scope: !748, file: !1, line: 69, column: 31)
!748 = distinct !DILexicalBlock(scope: !749, file: !1, line: 69, column: 5)
!749 = distinct !DILexicalBlock(scope: !739, file: !1, line: 69, column: 5)
!750 = !DISubprogram(name: "codec_makeincrementalcodec", scope: !1, file: !1, line: 248, type: !587, isLocal: true, isDefinition: true, scopeLine: 251, flags: DIFlagPrototyped, isOptimized: true, variables: !751)
!751 = !{!752, !753, !754, !755, !756, !757}
!752 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "codec_info", arg: 1, scope: !750, file: !1, line: 248, type: !36)
!753 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 2, scope: !750, file: !1, line: 249, type: !60)
!754 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attrname", arg: 3, scope: !750, file: !1, line: 250, type: !60)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !750, file: !1, line: 252, type: !36)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inccodec", scope: !750, file: !1, line: 252, type: !36)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !758, file: !1, line: 261, type: !36)
!758 = distinct !DILexicalBlock(scope: !750, file: !1, line: 261, column: 5)
!759 = !DISubprogram(name: "codec_getitem", scope: !1, file: !1, line: 232, type: !760, isLocal: true, isDefinition: true, scopeLine: 233, flags: DIFlagPrototyped, isOptimized: true, variables: !762)
!760 = !DISubroutineType(types: !761)
!761 = !{!36, !60, !75}
!762 = !{!763, !764, !765, !766, !767}
!763 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !759, file: !1, line: 232, type: !60)
!764 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 2, scope: !759, file: !1, line: 232, type: !75)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codecs", scope: !759, file: !1, line: 234, type: !36)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !759, file: !1, line: 235, type: !36)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !768, file: !1, line: 241, type: !36)
!768 = distinct !DILexicalBlock(scope: !759, file: !1, line: 241, column: 5)
!769 = !DISubprogram(name: "codec_getincrementalcodec", scope: !1, file: !1, line: 266, type: !770, isLocal: true, isDefinition: true, scopeLine: 269, flags: DIFlagPrototyped, isOptimized: true, variables: !772)
!770 = !DISubroutineType(types: !771)
!771 = !{!36, !60, !60, !60}
!772 = !{!773, !774, !775, !776, !777, !778}
!773 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !769, file: !1, line: 266, type: !60)
!774 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 2, scope: !769, file: !1, line: 267, type: !60)
!775 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attrname", arg: 3, scope: !769, file: !1, line: 268, type: !60)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codec_info", scope: !769, file: !1, line: 270, type: !36)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !769, file: !1, line: 270, type: !36)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !779, file: !1, line: 276, type: !36)
!779 = distinct !DILexicalBlock(scope: !769, file: !1, line: 276, column: 5)
!780 = !DISubprogram(name: "codec_getstreamcodec", scope: !1, file: !1, line: 283, type: !781, isLocal: true, isDefinition: true, scopeLine: 287, flags: DIFlagPrototyped, isOptimized: true, variables: !784)
!781 = !DISubroutineType(types: !782)
!782 = !{!36, !60, !36, !60, !783}
!783 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!784 = !{!785, !786, !787, !788, !789, !790, !791, !792}
!785 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !780, file: !1, line: 283, type: !60)
!786 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stream", arg: 2, scope: !780, file: !1, line: 284, type: !36)
!787 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 3, scope: !780, file: !1, line: 285, type: !60)
!788 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 4, scope: !780, file: !1, line: 286, type: !783)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codecs", scope: !780, file: !1, line: 288, type: !36)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "streamcodec", scope: !780, file: !1, line: 288, type: !36)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codeccls", scope: !780, file: !1, line: 288, type: !36)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !793, file: !1, line: 299, type: !36)
!793 = distinct !DILexicalBlock(scope: !780, file: !1, line: 299, column: 5)
!794 = !DISubprogram(name: "_PyCodec_EncodeInternal", scope: !1, file: !1, line: 385, type: !795, isLocal: true, isDefinition: true, scopeLine: 389, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i8*, i8*)* @_PyCodec_EncodeInternal, variables: !797)
!795 = !DISubroutineType(types: !796)
!796 = !{!36, !36, !36, !60, !60}
!797 = !{!798, !799, !800, !801, !802, !803, !804, !805, !807, !809, !811, !813, !816, !818, !821, !823}
!798 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !794, file: !1, line: 385, type: !36)
!799 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoder", arg: 2, scope: !794, file: !1, line: 386, type: !36)
!800 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 3, scope: !794, file: !1, line: 387, type: !60)
!801 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 4, scope: !794, file: !1, line: 388, type: !60)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !794, file: !1, line: 390, type: !36)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !794, file: !1, line: 390, type: !36)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !794, file: !1, line: 391, type: !36)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !806, file: !1, line: 413, type: !36)
!806 = distinct !DILexicalBlock(scope: !794, file: !1, line: 413, column: 5)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !808, file: !1, line: 414, type: !36)
!808 = distinct !DILexicalBlock(scope: !794, file: !1, line: 414, column: 5)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !810, file: !1, line: 415, type: !36)
!810 = distinct !DILexicalBlock(scope: !794, file: !1, line: 415, column: 5)
!811 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !812, file: !1, line: 419, type: !36)
!812 = distinct !DILexicalBlock(scope: !794, file: !1, line: 419, column: 5)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !814, file: !1, line: 419, type: !36)
!814 = distinct !DILexicalBlock(scope: !815, file: !1, line: 419, column: 5)
!815 = distinct !DILexicalBlock(scope: !812, file: !1, line: 419, column: 5)
!816 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !817, file: !1, line: 420, type: !36)
!817 = distinct !DILexicalBlock(scope: !794, file: !1, line: 420, column: 5)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !819, file: !1, line: 420, type: !36)
!819 = distinct !DILexicalBlock(scope: !820, file: !1, line: 420, column: 5)
!820 = distinct !DILexicalBlock(scope: !817, file: !1, line: 420, column: 5)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !822, file: !1, line: 421, type: !36)
!822 = distinct !DILexicalBlock(scope: !794, file: !1, line: 421, column: 5)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !824, file: !1, line: 421, type: !36)
!824 = distinct !DILexicalBlock(scope: !825, file: !1, line: 421, column: 5)
!825 = distinct !DILexicalBlock(scope: !822, file: !1, line: 421, column: 5)
!826 = !DISubprogram(name: "args_tuple", scope: !1, file: !1, line: 206, type: !549, isLocal: true, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: true, variables: !827)
!827 = !{!828, !829, !830, !831, !834}
!828 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !826, file: !1, line: 206, type: !36)
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 2, scope: !826, file: !1, line: 207, type: !60)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !826, file: !1, line: 209, type: !36)
!831 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !832, file: !1, line: 217, type: !36)
!832 = distinct !DILexicalBlock(scope: !833, file: !1, line: 216, column: 17)
!833 = distinct !DILexicalBlock(scope: !826, file: !1, line: 216, column: 9)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !835, file: !1, line: 221, type: !36)
!835 = distinct !DILexicalBlock(scope: !836, file: !1, line: 221, column: 13)
!836 = distinct !DILexicalBlock(scope: !837, file: !1, line: 220, column: 24)
!837 = distinct !DILexicalBlock(scope: !832, file: !1, line: 220, column: 13)
!838 = !DISubprogram(name: "wrap_codec_error", scope: !1, file: !1, line: 368, type: !839, isLocal: true, isDefinition: true, scopeLine: 370, flags: DIFlagPrototyped, isOptimized: true, variables: !841)
!839 = !DISubroutineType(types: !840)
!840 = !{null, !60, !60}
!841 = !{!842, !843}
!842 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "operation", arg: 1, scope: !838, file: !1, line: 368, type: !60)
!843 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 2, scope: !838, file: !1, line: 369, type: !60)
!844 = !DISubprogram(name: "_PyCodec_DecodeInternal", scope: !1, file: !1, line: 431, type: !795, isLocal: true, isDefinition: true, scopeLine: 435, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i8*, i8*)* @_PyCodec_DecodeInternal, variables: !845)
!845 = !{!846, !847, !848, !849, !850, !851, !852, !853, !855, !857, !859, !861, !864, !866, !869, !871}
!846 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !844, file: !1, line: 431, type: !36)
!847 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "decoder", arg: 2, scope: !844, file: !1, line: 432, type: !36)
!848 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 3, scope: !844, file: !1, line: 433, type: !60)
!849 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 4, scope: !844, file: !1, line: 434, type: !60)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !844, file: !1, line: 436, type: !36)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !844, file: !1, line: 436, type: !36)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !844, file: !1, line: 437, type: !36)
!853 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !854, file: !1, line: 458, type: !36)
!854 = distinct !DILexicalBlock(scope: !844, file: !1, line: 458, column: 5)
!855 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !856, file: !1, line: 459, type: !36)
!856 = distinct !DILexicalBlock(scope: !844, file: !1, line: 459, column: 5)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !858, file: !1, line: 460, type: !36)
!858 = distinct !DILexicalBlock(scope: !844, file: !1, line: 460, column: 5)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !860, file: !1, line: 464, type: !36)
!860 = distinct !DILexicalBlock(scope: !844, file: !1, line: 464, column: 5)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !862, file: !1, line: 464, type: !36)
!862 = distinct !DILexicalBlock(scope: !863, file: !1, line: 464, column: 5)
!863 = distinct !DILexicalBlock(scope: !860, file: !1, line: 464, column: 5)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !865, file: !1, line: 465, type: !36)
!865 = distinct !DILexicalBlock(scope: !844, file: !1, line: 465, column: 5)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !867, file: !1, line: 465, type: !36)
!867 = distinct !DILexicalBlock(scope: !868, file: !1, line: 465, column: 5)
!868 = distinct !DILexicalBlock(scope: !865, file: !1, line: 465, column: 5)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !870, file: !1, line: 466, type: !36)
!870 = distinct !DILexicalBlock(scope: !844, file: !1, line: 466, column: 5)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !872, file: !1, line: 466, type: !36)
!872 = distinct !DILexicalBlock(scope: !873, file: !1, line: 466, column: 5)
!873 = distinct !DILexicalBlock(scope: !870, file: !1, line: 466, column: 5)
!874 = !DISubprogram(name: "_PyCodec_TextEncoder", scope: !1, file: !1, line: 560, type: !496, isLocal: true, isDefinition: true, scopeLine: 561, flags: DIFlagPrototyped, isOptimized: true, variables: !875)
!875 = !{!876}
!876 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !874, file: !1, line: 560, type: !60)
!877 = !DISubprogram(name: "codec_getitem_checked", scope: !1, file: !1, line: 543, type: !878, isLocal: true, isDefinition: true, scopeLine: 546, flags: DIFlagPrototyped, isOptimized: true, variables: !880)
!878 = !DISubroutineType(types: !879)
!879 = !{!36, !60, !60, !75}
!880 = !{!881, !882, !883, !884, !885, !886}
!881 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !877, file: !1, line: 543, type: !60)
!882 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alternate_command", arg: 2, scope: !877, file: !1, line: 544, type: !60)
!883 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !877, file: !1, line: 545, type: !75)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codec", scope: !877, file: !1, line: 547, type: !36)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !877, file: !1, line: 548, type: !36)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !887, file: !1, line: 556, type: !36)
!887 = distinct !DILexicalBlock(scope: !877, file: !1, line: 556, column: 5)
!888 = !DISubprogram(name: "_PyCodec_TextDecoder", scope: !1, file: !1, line: 565, type: !496, isLocal: true, isDefinition: true, scopeLine: 566, flags: DIFlagPrototyped, isOptimized: true, variables: !889)
!889 = !{!890}
!890 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !888, file: !1, line: 565, type: !60)
!891 = !DISubprogram(name: "wrong_exception_type", scope: !1, file: !1, line: 636, type: !68, isLocal: true, isDefinition: true, scopeLine: 637, flags: DIFlagPrototyped, isOptimized: true, variables: !892)
!892 = !{!893, !894, !895, !898, !900}
!893 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !891, file: !1, line: 636, type: !36)
!894 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !891, file: !1, line: 640, type: !36)
!895 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !896, file: !1, line: 642, type: !36)
!896 = distinct !DILexicalBlock(scope: !897, file: !1, line: 641, column: 23)
!897 = distinct !DILexicalBlock(scope: !891, file: !1, line: 641, column: 9)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !899, file: !1, line: 643, type: !36)
!899 = distinct !DILexicalBlock(scope: !896, file: !1, line: 643, column: 9)
!900 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !901, file: !1, line: 647, type: !36)
!901 = distinct !DILexicalBlock(scope: !902, file: !1, line: 647, column: 13)
!902 = distinct !DILexicalBlock(scope: !903, file: !1, line: 644, column: 27)
!903 = distinct !DILexicalBlock(scope: !896, file: !1, line: 644, column: 13)
!904 = !DISubprogram(name: "_PyCodecRegistry_Init", scope: !1, file: !1, line: 1236, type: !905, isLocal: true, isDefinition: true, scopeLine: 1237, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @_PyCodecRegistry_Init, variables: !907)
!905 = !DISubroutineType(types: !906)
!906 = !{!75}
!907 = !{!908, !909, !911, !912, !913, !914, !915, !916, !922, !923, !925}
!908 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp", scope: !904, file: !1, line: 1313, type: !28)
!909 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !910, file: !1, line: 1313, type: !484)
!910 = distinct !DILexicalBlock(scope: !904, file: !1, line: 1313, column: 34)
!911 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !910, file: !1, line: 1313, type: !121)
!912 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !910, file: !1, line: 1313, type: !491)
!913 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !910, file: !1, line: 1313, type: !494)
!914 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !904, file: !1, line: 1314, type: !36)
!915 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !904, file: !1, line: 1315, type: !373)
!916 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !917, file: !1, line: 1326, type: !36)
!917 = distinct !DILexicalBlock(scope: !918, file: !1, line: 1325, column: 56)
!918 = distinct !DILexicalBlock(scope: !919, file: !1, line: 1325, column: 9)
!919 = distinct !DILexicalBlock(scope: !920, file: !1, line: 1325, column: 9)
!920 = distinct !DILexicalBlock(scope: !921, file: !1, line: 1324, column: 39)
