; ModuleID = 'dtoa.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Bigint = type { %struct.Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.U = type { double }
%struct.BCinfo = type { i32, i32, i32, i32 }

@tens = internal unnamed_addr constant [23 x double] [double 1.000000e+00, double 1.000000e+01, double 1.000000e+02, double 1.000000e+03, double 1.000000e+04, double 1.000000e+05, double 1.000000e+06, double 1.000000e+07, double 1.000000e+08, double 1.000000e+09, double 1.000000e+10, double 1.000000e+11, double 1.000000e+12, double 1.000000e+13, double 1.000000e+14, double 1.000000e+15, double 1.000000e+16, double 1.000000e+17, double 1.000000e+18, double 1.000000e+19, double 1.000000e+20, double 1.000000e+21, double 1.000000e+22], align 16
@bigtens = internal unnamed_addr constant [5 x double] [double 1.000000e+16, double 1.000000e+32, double 1.000000e+64, double 1.000000e+128, double 1.000000e+256], align 16
@tinytens = internal unnamed_addr constant [5 x double] [double 1.000000e-16, double 1.000000e-32, double 1.000000e-64, double 1.000000e-128, double 0x1168062864AC6F43], align 16
@freelist = internal unnamed_addr global [8 x %struct.Bigint*] zeroinitializer, align 16
@pmem_next = internal unnamed_addr global double* getelementptr inbounds ([288 x double], [288 x double]* @private_mem, i64 0, i64 0), align 8
@private_mem = internal global [288 x double] zeroinitializer, align 16

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !32, globals: !411)
!1 = !DIFile(filename: "Python/dtoa.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !6, !7, !8, !12, !15, !29, !30, !11}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!6 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "ULong", file: !1, line: 155, baseType: !9)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !10, line: 51, baseType: !11)
!10 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!11 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Long", file: !1, line: 156, baseType: !13)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !14, line: 196, baseType: !6)
!14 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bigint", file: !1, line: 336, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bigint", file: !1, line: 330, size: 256, align: 64, elements: !18)
!18 = !{!19, !21, !22, !23, !24, !25}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !17, file: !1, line: 331, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !17, file: !1, line: 332, baseType: !6, size: 32, align: 32, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "maxwds", scope: !17, file: !1, line: 332, baseType: !6, size: 32, align: 32, offset: 96)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !17, file: !1, line: 332, baseType: !6, size: 32, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "wds", scope: !17, file: !1, line: 332, baseType: !6, size: 32, align: 32, offset: 160)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 333, baseType: !26, size: 32, align: 32, offset: 192)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, align: 32, elements: !27)
!27 = !{!28}
!28 = !DISubrange(count: 1)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !10, line: 55, baseType: !31)
!31 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!32 = !{!33, !48, !52, !112, !118, !165, !178, !186, !191, !200, !204, !214, !236, !249, !264, !276, !284, !295, !308, !314, !321, !339, !348, !362, !369, !377, !384, !397}
!33 = !DISubprogram(name: "_Py_dg_stdnan", scope: !1, file: !1, line: 1524, type: !34, isLocal: false, isDefinition: true, scopeLine: 1525, flags: DIFlagPrototyped, isOptimized: true, function: double (i32)* @_Py_dg_stdnan, variables: !37)
!34 = !DISubroutineType(types: !35)
!35 = !{!36, !6}
!36 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!37 = !{!38, !39}
!38 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sign", arg: 1, scope: !33, file: !1, line: 1524, type: !6)
!39 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !33, file: !1, line: 1526, type: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "U", file: !1, line: 188, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_union_type, file: !1, line: 188, size: 64, align: 64, elements: !42)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !41, file: !1, line: 188, baseType: !36, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !41, file: !1, line: 188, baseType: !45, size: 64, align: 32)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 64, align: 32, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 2)
!48 = !DISubprogram(name: "_Py_dg_infinity", scope: !1, file: !1, line: 1538, type: !34, isLocal: false, isDefinition: true, scopeLine: 1539, flags: DIFlagPrototyped, isOptimized: true, function: double (i32)* @_Py_dg_infinity, variables: !49)
!49 = !{!50, !51}
!50 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sign", arg: 1, scope: !48, file: !1, line: 1538, type: !6)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !48, file: !1, line: 1540, type: !40)
!52 = !DISubprogram(name: "_Py_dg_strtod", scope: !1, file: !1, line: 1547, type: !53, isLocal: false, isDefinition: true, scopeLine: 1548, flags: DIFlagPrototyped, isOptimized: true, function: double (i8*, i8**)* @_Py_dg_strtod, variables: !58)
!53 = !DISubroutineType(types: !54)
!54 = !{!36, !55, !57}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !102, !103, !104, !105, !106, !107, !108, !111}
!59 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s00", arg: 1, scope: !52, file: !1, line: 1547, type: !55)
!60 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 2, scope: !52, file: !1, line: 1547, type: !57)
!61 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bb2", scope: !52, file: !1, line: 1549, type: !6)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bb5", scope: !52, file: !1, line: 1549, type: !6)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bbe", scope: !52, file: !1, line: 1549, type: !6)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bd2", scope: !52, file: !1, line: 1549, type: !6)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bd5", scope: !52, file: !1, line: 1549, type: !6)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bs2", scope: !52, file: !1, line: 1549, type: !6)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !52, file: !1, line: 1549, type: !6)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dsign", scope: !52, file: !1, line: 1549, type: !6)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !52, file: !1, line: 1549, type: !6)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e1", scope: !52, file: !1, line: 1549, type: !6)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error", scope: !52, file: !1, line: 1549, type: !6)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "esign", scope: !52, file: !1, line: 1550, type: !6)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !52, file: !1, line: 1550, type: !6)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !52, file: !1, line: 1550, type: !6)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !52, file: !1, line: 1550, type: !6)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lz", scope: !52, file: !1, line: 1550, type: !6)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nd", scope: !52, file: !1, line: 1550, type: !6)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nd0", scope: !52, file: !1, line: 1550, type: !6)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "odd", scope: !52, file: !1, line: 1550, type: !6)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !52, file: !1, line: 1550, type: !6)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !52, file: !1, line: 1551, type: !55)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s0", scope: !52, file: !1, line: 1551, type: !55)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s1", scope: !52, file: !1, line: 1551, type: !55)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aadj", scope: !52, file: !1, line: 1552, type: !36)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aadj1", scope: !52, file: !1, line: 1552, type: !36)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aadj2", scope: !52, file: !1, line: 1553, type: !40)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adj", scope: !52, file: !1, line: 1553, type: !40)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !52, file: !1, line: 1553, type: !40)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv0", scope: !52, file: !1, line: 1553, type: !40)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !52, file: !1, line: 1554, type: !8)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !52, file: !1, line: 1554, type: !8)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "abs_exp", scope: !52, file: !1, line: 1554, type: !8)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "L", scope: !52, file: !1, line: 1555, type: !12)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bc", scope: !52, file: !1, line: 1556, type: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "BCinfo", file: !1, line: 297, baseType: !96)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "BCinfo", file: !1, line: 299, size: 128, align: 32, elements: !97)
!97 = !{!98, !99, !100, !101}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "e0", scope: !96, file: !1, line: 300, baseType: !6, size: 32, align: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "nd", scope: !96, file: !1, line: 300, baseType: !6, size: 32, align: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "nd0", scope: !96, file: !1, line: 300, baseType: !6, size: 32, align: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !96, file: !1, line: 300, baseType: !6, size: 32, align: 32, offset: 96)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bb", scope: !52, file: !1, line: 1557, type: !15)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bb1", scope: !52, file: !1, line: 1557, type: !15)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bd", scope: !52, file: !1, line: 1557, type: !15)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bd0", scope: !52, file: !1, line: 1557, type: !15)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bs", scope: !52, file: !1, line: 1557, type: !15)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "delta", scope: !52, file: !1, line: 1557, type: !15)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !52, file: !1, line: 1558, type: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !110, line: 62, baseType: !31)
!110 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fraclen", scope: !52, file: !1, line: 1558, type: !109)
!112 = !DISubprogram(name: "_Py_dg_freedtoa", scope: !1, file: !1, line: 2339, type: !113, isLocal: false, isDefinition: true, scopeLine: 2340, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @_Py_dg_freedtoa, variables: !115)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !4}
!115 = !{!116, !117}
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !112, file: !1, line: 2339, type: !4)
!117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !112, file: !1, line: 2341, type: !15)
!118 = !DISubprogram(name: "_Py_dg_dtoa", scope: !1, file: !1, line: 2385, type: !119, isLocal: false, isDefinition: true, scopeLine: 2387, flags: DIFlagPrototyped, isOptimized: true, function: i8* (double, i32, i32, i32*, i32*, i8**)* @_Py_dg_dtoa, variables: !121)
!119 = !DISubroutineType(types: !120)
!120 = !{!4, !36, !6, !6, !29, !29, !57}
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164}
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dd", arg: 1, scope: !118, file: !1, line: 2385, type: !36)
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 2, scope: !118, file: !1, line: 2385, type: !6)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndigits", arg: 3, scope: !118, file: !1, line: 2385, type: !6)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "decpt", arg: 4, scope: !118, file: !1, line: 2386, type: !29)
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sign", arg: 5, scope: !118, file: !1, line: 2386, type: !29)
!127 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rve", arg: 6, scope: !118, file: !1, line: 2386, type: !57)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bbits", scope: !118, file: !1, line: 2422, type: !6)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b2", scope: !118, file: !1, line: 2422, type: !6)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b5", scope: !118, file: !1, line: 2422, type: !6)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "be", scope: !118, file: !1, line: 2422, type: !6)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dig", scope: !118, file: !1, line: 2422, type: !6)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !118, file: !1, line: 2422, type: !6)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ieps", scope: !118, file: !1, line: 2422, type: !6)
