; ModuleID = 'enumobject.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !367, globals: !554)
!1 = !DIFile(filename: "Objects/enumobject.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !89, !10, !94, !343, !351, !360}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !6, line: 109, baseType: !7)
!6 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 105, size: 128, align: 64, elements: !8)
!8 = !{!9, !17}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !7, file: !6, line: 107, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !11, line: 177, baseType: !12)
!11 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !13, line: 102, baseType: !14)
!13 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !15, line: 181, baseType: !16)
!15 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!16 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !7, file: !6, line: 108, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !6, line: 334, size: 3200, align: 64, elements: !20)
!20 = !{!21, !27, !31, !32, !33, !38, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !291, !309, !310, !311, !313, !315, !316, !318, !323, !328, !333, !334, !335, !336, !337, !338, !339, !340, !342}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !19, file: !6, line: 335, baseType: !22, size: 192, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 114, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 111, size: 192, align: 64, elements: !24)
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !23, file: !6, line: 112, baseType: !5, size: 128, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !23, file: !6, line: 113, baseType: !10, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !19, file: !6, line: 336, baseType: !28, size: 64, align: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !19, file: !6, line: 337, baseType: !10, size: 64, align: 64, offset: 256)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !19, file: !6, line: 337, baseType: !10, size: 64, align: 64, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !19, file: !6, line: 341, baseType: !34, size: 64, align: 64, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 308, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !4}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !19, file: !6, line: 342, baseType: !39, size: 64, align: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !6, line: 314, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !4, !44, !43}
!43 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !13, line: 48, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 246, size: 1728, align: 64, elements: !48)
!47 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!48 = !{!49, !50, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !70, !71, !72, !73, !75, !77, !79, !83, !86, !88, !90, !91, !92, !93, !97, !98}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !46, file: !47, line: 247, baseType: !43, size: 32, align: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !46, file: !47, line: 252, baseType: !51, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !46, file: !47, line: 253, baseType: !51, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !46, file: !47, line: 254, baseType: !51, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !46, file: !47, line: 255, baseType: !51, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !46, file: !47, line: 256, baseType: !51, size: 64, align: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !46, file: !47, line: 257, baseType: !51, size: 64, align: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !46, file: !47, line: 258, baseType: !51, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !46, file: !47, line: 259, baseType: !51, size: 64, align: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !46, file: !47, line: 261, baseType: !51, size: 64, align: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !46, file: !47, line: 262, baseType: !51, size: 64, align: 64, offset: 640)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !46, file: !47, line: 263, baseType: !51, size: 64, align: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !46, file: !47, line: 265, baseType: !63, size: 64, align: 64, offset: 768)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !47, line: 161, size: 192, align: 64, elements: !65)
!65 = !{!66, !67, !69}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !64, file: !47, line: 162, baseType: !63, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !64, file: !47, line: 163, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !64, file: !47, line: 167, baseType: !43, size: 32, align: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !46, file: !47, line: 267, baseType: !68, size: 64, align: 64, offset: 832)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !46, file: !47, line: 269, baseType: !43, size: 32, align: 32, offset: 896)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !46, file: !47, line: 273, baseType: !43, size: 32, align: 32, offset: 928)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !46, file: !47, line: 275, baseType: !74, size: 64, align: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !15, line: 140, baseType: !16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !46, file: !47, line: 279, baseType: !76, size: 16, align: 16, offset: 1024)
!76 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !46, file: !47, line: 280, baseType: !78, size: 8, align: 8, offset: 1040)
!78 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !46, file: !47, line: 281, baseType: !80, size: 8, align: 8, offset: 1048)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 8, align: 8, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 1)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !46, file: !47, line: 285, baseType: !84, size: 64, align: 64, offset: 1088)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !47, line: 155, baseType: null)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !46, file: !47, line: 294, baseType: !87, size: 64, align: 64, offset: 1152)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !15, line: 141, baseType: !16)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !46, file: !47, line: 303, baseType: !89, size: 64, align: 64, offset: 1216)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !46, file: !47, line: 304, baseType: !89, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !46, file: !47, line: 305, baseType: !89, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !46, file: !47, line: 306, baseType: !89, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !46, file: !47, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !46, file: !47, line: 309, baseType: !43, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !46, file: !47, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !19, file: !6, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!4, !4, !51}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !19, file: !6, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!43, !4, !51, !4}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !19, file: !6, line: 345, baseType: !89, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !19, file: !6, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!4, !4}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !19, file: !6, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !6, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !6, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!4, !4, !4}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !6, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !6, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !6, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !6, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !6, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!4, !4, !4, !4}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !6, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !6, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !6, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !6, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!43, !4}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !6, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !6, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !6, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !6, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !6, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !6, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !6, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !6, line: 258, baseType: !89, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !6, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !6, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !6, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !6, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !6, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !6, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !6, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !6, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !6, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !6, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !6, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !6, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !6, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !6, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !6, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !6, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !19, file: !6, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !6, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !6, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!10, !4}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !6, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !6, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!4, !4, !10}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !6, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !6, line: 285, baseType: !89, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !6, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!43, !4, !10, !4}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !6, line: 287, baseType: !89, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !6, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!43, !4, !4}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !6, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !6, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !19, file: !6, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !6, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !6, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !6, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !6, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!43, !4, !4, !4}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !19, file: !6, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !4}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !11, line: 186, baseType: !10)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !19, file: !6, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !19, file: !6, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !19, file: !6, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !19, file: !6, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !19, file: !6, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !6, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !6, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !6, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!43, !4, !235, !43}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !6, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !6, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !6, line: 179, baseType: !89, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !6, line: 180, baseType: !4, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !6, line: 181, baseType: !10, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !6, line: 182, baseType: !10, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !6, line: 184, baseType: !43, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !6, line: 185, baseType: !43, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !6, line: 186, baseType: !51, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !6, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !6, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !6, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !6, line: 190, baseType: !89, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !6, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !6, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !4, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !19, file: !6, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !19, file: !6, line: 368, baseType: !28, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !19, file: !6, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!43, !4, !263, !89}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!43, !4, !89}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !19, file: !6, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !19, file: !6, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!4, !4, !4, !43}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !19, file: !6, line: 382, baseType: !10, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !19, file: !6, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !19, file: !6, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !19, file: !6, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !28, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !43, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !28, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !19, file: !6, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !6, line: 390, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !19, file: !6, line: 391, baseType: !292, size: 64, align: 64, offset: 1984)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !294, line: 11, size: 320, align: 64, elements: !295)
!294 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!295 = !{!296, !297, !302, !307, !308}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !293, file: !294, line: 12, baseType: !51, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !293, file: !294, line: 13, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !294, line: 8, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!4, !4, !89}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !293, file: !294, line: 14, baseType: !303, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !294, line: 9, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!43, !4, !4, !89}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !293, file: !294, line: 15, baseType: !51, size: 64, align: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !293, file: !294, line: 16, baseType: !89, size: 64, align: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !19, file: !6, line: 392, baseType: !18, size: 64, align: 64, offset: 2048)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !19, file: !6, line: 393, baseType: !4, size: 64, align: 64, offset: 2112)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !19, file: !6, line: 394, baseType: !312, size: 64, align: 64, offset: 2176)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 325, baseType: !134)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !19, file: !6, line: 395, baseType: !314, size: 64, align: 64, offset: 2240)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 326, baseType: !210)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !19, file: !6, line: 396, baseType: !10, size: 64, align: 64, offset: 2304)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !19, file: !6, line: 397, baseType: !317, size: 64, align: 64, offset: 2368)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 327, baseType: !210)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !19, file: !6, line: 398, baseType: !319, size: 64, align: 64, offset: 2432)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 329, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!4, !18, !10}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !19, file: !6, line: 399, baseType: !324, size: 64, align: 64, offset: 2496)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 328, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!4, !18, !4, !4}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !19, file: !6, line: 400, baseType: !329, size: 64, align: 64, offset: 2560)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 307, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !89}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !19, file: !6, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !19, file: !6, line: 402, baseType: !4, size: 64, align: 64, offset: 2688)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !19, file: !6, line: 403, baseType: !4, size: 64, align: 64, offset: 2752)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !19, file: !6, line: 404, baseType: !4, size: 64, align: 64, offset: 2816)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !19, file: !6, line: 405, baseType: !4, size: 64, align: 64, offset: 2880)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !19, file: !6, line: 406, baseType: !4, size: 64, align: 64, offset: 2944)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !19, file: !6, line: 407, baseType: !34, size: 64, align: 64, offset: 3008)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !19, file: !6, line: 410, baseType: !341, size: 32, align: 32, offset: 3072)
!341 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !19, file: !6, line: 412, baseType: !34, size: 64, align: 64, offset: 3136)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !345, line: 33, baseType: !346)
!345 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!346 = !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 25, size: 256, align: 64, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !346, file: !345, line: 26, baseType: !22, size: 192, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !346, file: !345, line: 27, baseType: !350, size: 64, align: 64, offset: 192)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, align: 64, elements: !81)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "enumobject", file: !1, line: 11, baseType: !353)
!353 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 5, size: 384, align: 64, elements: !354)
!354 = !{!355, !356, !357, !358, !359}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !353, file: !1, line: 6, baseType: !5, size: 128, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "en_index", scope: !353, file: !1, line: 7, baseType: !10, size: 64, align: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "en_sit", scope: !353, file: !1, line: 8, baseType: !4, size: 64, align: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "en_result", scope: !353, file: !1, line: 9, baseType: !4, size: 64, align: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "en_longindex", scope: !353, file: !1, line: 10, baseType: !4, size: 64, align: 64, offset: 320)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "reversedobject", file: !1, line: 236, baseType: !362)
!362 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 232, size: 256, align: 64, elements: !363)
!363 = !{!364, !365, !366}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !362, file: !1, line: 233, baseType: !5, size: 128, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !362, file: !1, line: 234, baseType: !10, size: 64, align: 64, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !362, file: !1, line: 235, baseType: !4, size: 64, align: 64, offset: 192)
!367 = !{!368, !388, !407, !433, !455, !458, !488, !498, !509, !522, !527, !530, !540}
!368 = !DISubprogram(name: "enum_dealloc", scope: !1, file: !1, line: 62, type: !369, isLocal: true, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.enumobject*)* @enum_dealloc, variables: !371)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !351}
!371 = !{!372, !373, !375, !378, !380, !383, !385}
!372 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "en", arg: 1, scope: !368, file: !1, line: 62, type: !351)
!373 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !374, file: !1, line: 65, type: !4)
!374 = distinct !DILexicalBlock(scope: !368, file: !1, line: 65, column: 5)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !376, file: !1, line: 65, type: !4)
!376 = distinct !DILexicalBlock(scope: !377, file: !1, line: 65, column: 5)
!377 = distinct !DILexicalBlock(scope: !374, file: !1, line: 65, column: 5)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !379, file: !1, line: 66, type: !4)
!379 = distinct !DILexicalBlock(scope: !368, file: !1, line: 66, column: 5)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !381, file: !1, line: 66, type: !4)
!381 = distinct !DILexicalBlock(scope: !382, file: !1, line: 66, column: 5)
!382 = distinct !DILexicalBlock(scope: !379, file: !1, line: 66, column: 5)
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !384, file: !1, line: 67, type: !4)
!384 = distinct !DILexicalBlock(scope: !368, file: !1, line: 67, column: 5)
!385 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !386, file: !1, line: 67, type: !4)
!386 = distinct !DILexicalBlock(scope: !387, file: !1, line: 67, column: 5)
!387 = distinct !DILexicalBlock(scope: !384, file: !1, line: 67, column: 5)
!388 = !DISubprogram(name: "enum_traverse", scope: !1, file: !1, line: 72, type: !389, isLocal: true, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.enumobject*, i32 (%struct._object*, i8*)*, i8*)* @enum_traverse, variables: !391)
!389 = !DISubroutineType(types: !390)
!390 = !{!43, !351, !263, !89}
!391 = !{!392, !393, !394, !395, !399, !403}
!392 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "en", arg: 1, scope: !388, file: !1, line: 72, type: !351)
!393 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !388, file: !1, line: 72, type: !263)
!394 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !388, file: !1, line: 72, type: !89)
!395 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !396, file: !1, line: 74, type: !43)
!396 = distinct !DILexicalBlock(scope: !397, file: !1, line: 74, column: 5)
!397 = distinct !DILexicalBlock(scope: !398, file: !1, line: 74, column: 5)
!398 = distinct !DILexicalBlock(scope: !388, file: !1, line: 74, column: 5)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !400, file: !1, line: 75, type: !43)
!400 = distinct !DILexicalBlock(scope: !401, file: !1, line: 75, column: 5)
!401 = distinct !DILexicalBlock(scope: !402, file: !1, line: 75, column: 5)
!402 = distinct !DILexicalBlock(scope: !388, file: !1, line: 75, column: 5)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !404, file: !1, line: 76, type: !43)
!404 = distinct !DILexicalBlock(scope: !405, file: !1, line: 76, column: 5)
!405 = distinct !DILexicalBlock(scope: !406, file: !1, line: 76, column: 5)
!406 = distinct !DILexicalBlock(scope: !388, file: !1, line: 76, column: 5)
!407 = !DISubprogram(name: "enum_next", scope: !1, file: !1, line: 123, type: !408, isLocal: true, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.enumobject*)* @enum_next, variables: !410)
!408 = !DISubroutineType(types: !409)
!409 = !{!4, !351}
!410 = !{!411, !412, !413, !414, !415, !416, !420, !424, !426, !431}
!411 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "en", arg: 1, scope: !407, file: !1, line: 123, type: !351)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next_index", scope: !407, file: !1, line: 125, type: !4)
!413 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next_item", scope: !407, file: !1, line: 126, type: !4)
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !407, file: !1, line: 127, type: !4)
!415 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !407, file: !1, line: 128, type: !4)
!416 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !417, file: !1, line: 139, type: !4)
!417 = distinct !DILexicalBlock(scope: !418, file: !1, line: 139, column: 9)
!418 = distinct !DILexicalBlock(scope: !419, file: !1, line: 138, column: 29)
!419 = distinct !DILexicalBlock(scope: !407, file: !1, line: 138, column: 9)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !421, file: !1, line: 146, type: !4)
!421 = distinct !DILexicalBlock(scope: !422, file: !1, line: 146, column: 9)
!422 = distinct !DILexicalBlock(scope: !423, file: !1, line: 144, column: 33)
!423 = distinct !DILexicalBlock(scope: !407, file: !1, line: 144, column: 9)
!424 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !425, file: !1, line: 147, type: !4)
!425 = distinct !DILexicalBlock(scope: !422, file: !1, line: 147, column: 9)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !427, file: !1, line: 151, type: !4)
!427 = distinct !DILexicalBlock(scope: !428, file: !1, line: 151, column: 13)
!428 = distinct !DILexicalBlock(scope: !429, file: !1, line: 150, column: 29)
!429 = distinct !DILexicalBlock(scope: !430, file: !1, line: 150, column: 13)
!430 = distinct !DILexicalBlock(scope: !423, file: !1, line: 148, column: 12)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !432, file: !1, line: 152, type: !4)
!432 = distinct !DILexicalBlock(scope: !428, file: !1, line: 152, column: 13)
!433 = !DISubprogram(name: "enum_next_long", scope: !1, file: !1, line: 81, type: !434, isLocal: true, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true, variables: !436)
!434 = !DISubroutineType(types: !435)
!435 = !{!4, !351, !4}
!436 = !{!437, !438, !439, !440, !441, !442, !446, !448, !453}
!437 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "en", arg: 1, scope: !433, file: !1, line: 81, type: !351)
!438 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "next_item", arg: 2, scope: !433, file: !1, line: 81, type: !4)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !433, file: !1, line: 84, type: !4)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next_index", scope: !433, file: !1, line: 85, type: !4)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stepped_up", scope: !433, file: !1, line: 86, type: !4)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !443, file: !1, line: 107, type: !4)
!443 = distinct !DILexicalBlock(scope: !444, file: !1, line: 107, column: 9)
!444 = distinct !DILexicalBlock(scope: !445, file: !1, line: 105, column: 33)
!445 = distinct !DILexicalBlock(scope: !433, file: !1, line: 105, column: 9)
!446 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !447, file: !1, line: 108, type: !4)
!447 = distinct !DILexicalBlock(scope: !444, file: !1, line: 108, column: 9)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !449, file: !1, line: 112, type: !4)
!449 = distinct !DILexicalBlock(scope: !450, file: !1, line: 112, column: 13)
!450 = distinct !DILexicalBlock(scope: !451, file: !1, line: 111, column: 29)
!451 = distinct !DILexicalBlock(scope: !452, file: !1, line: 111, column: 13)
!452 = distinct !DILexicalBlock(scope: !445, file: !1, line: 109, column: 12)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !454, file: !1, line: 113, type: !4)
!454 = distinct !DILexicalBlock(scope: !450, file: !1, line: 113, column: 13)
!455 = !DISubprogram(name: "enum_reduce", scope: !1, file: !1, line: 162, type: !408, isLocal: true, isDefinition: true, scopeLine: 163, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.enumobject*)* @enum_reduce, variables: !456)
!456 = !{!457}
!457 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "en", arg: 1, scope: !455, file: !1, line: 162, type: !351)
!458 = !DISubprogram(name: "enum_new", scope: !1, file: !1, line: 14, type: !459, isLocal: true, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @enum_new, variables: !463)
!459 = !DISubroutineType(types: !460)
!460 = !{!4, !461, !4, !4}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !6, line: 422, baseType: !19)
!463 = !{!464, !465, !466, !467, !468, !469, !470, !476, !480, !484}
!464 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !458, file: !1, line: 14, type: !461)
!465 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !458, file: !1, line: 14, type: !4)
!466 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !458, file: !1, line: 14, type: !4)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "en", scope: !458, file: !1, line: 16, type: !351)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seq", scope: !458, file: !1, line: 17, type: !4)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !458, file: !1, line: 18, type: !4)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !471, file: !1, line: 31, type: !4)
!471 = distinct !DILexicalBlock(scope: !472, file: !1, line: 31, column: 13)
!472 = distinct !DILexicalBlock(scope: !473, file: !1, line: 30, column: 28)
!473 = distinct !DILexicalBlock(scope: !474, file: !1, line: 30, column: 13)
!474 = distinct !DILexicalBlock(scope: !475, file: !1, line: 28, column: 24)
!475 = distinct !DILexicalBlock(scope: !458, file: !1, line: 28, column: 9)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !477, file: !1, line: 42, type: !4)
!477 = distinct !DILexicalBlock(scope: !478, file: !1, line: 42, column: 13)
!478 = distinct !DILexicalBlock(scope: !479, file: !1, line: 40, column: 16)
!479 = distinct !DILexicalBlock(scope: !474, file: !1, line: 36, column: 13)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !481, file: !1, line: 50, type: !4)
!481 = distinct !DILexicalBlock(scope: !482, file: !1, line: 50, column: 9)
!482 = distinct !DILexicalBlock(scope: !483, file: !1, line: 49, column: 29)
!483 = distinct !DILexicalBlock(scope: !458, file: !1, line: 49, column: 9)
!484 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !485, file: !1, line: 55, type: !4)
!485 = distinct !DILexicalBlock(scope: !486, file: !1, line: 55, column: 9)
!486 = distinct !DILexicalBlock(scope: !487, file: !1, line: 54, column: 32)
!487 = distinct !DILexicalBlock(scope: !458, file: !1, line: 54, column: 9)
!488 = !DISubprogram(name: "reversed_dealloc", scope: !1, file: !1, line: 282, type: !489, isLocal: true, isDefinition: true, scopeLine: 283, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.reversedobject*)* @reversed_dealloc, variables: !491)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !360}
!491 = !{!492, !493, !495}
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ro", arg: 1, scope: !488, file: !1, line: 282, type: !360)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !494, file: !1, line: 285, type: !4)
!494 = distinct !DILexicalBlock(scope: !488, file: !1, line: 285, column: 5)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !496, file: !1, line: 285, type: !4)
!496 = distinct !DILexicalBlock(scope: !497, file: !1, line: 285, column: 5)
!497 = distinct !DILexicalBlock(scope: !494, file: !1, line: 285, column: 5)
!498 = !DISubprogram(name: "reversed_traverse", scope: !1, file: !1, line: 290, type: !499, isLocal: true, isDefinition: true, scopeLine: 291, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.reversedobject*, i32 (%struct._object*, i8*)*, i8*)* @reversed_traverse, variables: !501)
!499 = !DISubroutineType(types: !500)
!500 = !{!43, !360, !263, !89}
!501 = !{!502, !503, !504, !505}
!502 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ro", arg: 1, scope: !498, file: !1, line: 290, type: !360)
!503 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !498, file: !1, line: 290, type: !263)
!504 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !498, file: !1, line: 290, type: !89)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !506, file: !1, line: 292, type: !43)
!506 = distinct !DILexicalBlock(scope: !507, file: !1, line: 292, column: 5)
!507 = distinct !DILexicalBlock(scope: !508, file: !1, line: 292, column: 5)
!508 = distinct !DILexicalBlock(scope: !498, file: !1, line: 292, column: 5)
!509 = !DISubprogram(name: "reversed_next", scope: !1, file: !1, line: 297, type: !510, isLocal: true, isDefinition: true, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.reversedobject*)* @reversed_next, variables: !512)
!510 = !DISubroutineType(types: !511)
!511 = !{!4, !360}
!512 = !{!513, !514, !515, !516, !518}
!513 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ro", arg: 1, scope: !509, file: !1, line: 297, type: !360)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !509, file: !1, line: 299, type: !4)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !509, file: !1, line: 300, type: !10)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !517, file: !1, line: 313, type: !4)
!517 = distinct !DILexicalBlock(scope: !509, file: !1, line: 313, column: 5)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !519, file: !1, line: 313, type: !4)
!519 = distinct !DILexicalBlock(scope: !520, file: !1, line: 313, column: 5)
!520 = distinct !DILexicalBlock(scope: !521, file: !1, line: 313, column: 5)
!521 = distinct !DILexicalBlock(scope: !517, file: !1, line: 313, column: 5)
!522 = !DISubprogram(name: "reversed_len", scope: !1, file: !1, line: 323, type: !510, isLocal: true, isDefinition: true, scopeLine: 324, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.reversedobject*)* @reversed_len, variables: !523)
!523 = !{!524, !525, !526}
!524 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ro", arg: 1, scope: !522, file: !1, line: 323, type: !360)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "position", scope: !522, file: !1, line: 325, type: !10)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seqsize", scope: !522, file: !1, line: 325, type: !10)
!527 = !DISubprogram(name: "reversed_reduce", scope: !1, file: !1, line: 339, type: !510, isLocal: true, isDefinition: true, scopeLine: 340, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.reversedobject*)* @reversed_reduce, variables: !528)
!528 = !{!529}
!529 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ro", arg: 1, scope: !527, file: !1, line: 339, type: !360)
!530 = !DISubprogram(name: "reversed_setstate", scope: !1, file: !1, line: 348, type: !531, isLocal: true, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.reversedobject*, %struct._object*)* @reversed_setstate, variables: !533)
!531 = !DISubroutineType(types: !532)
!532 = !{!4, !360, !4}
!533 = !{!534, !535, !536, !537}
!534 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ro", arg: 1, scope: !530, file: !1, line: 348, type: !360)
!535 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 2, scope: !530, file: !1, line: 348, type: !4)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !530, file: !1, line: 350, type: !10)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !538, file: !1, line: 354, type: !10)
!538 = distinct !DILexicalBlock(scope: !539, file: !1, line: 353, column: 23)
!539 = distinct !DILexicalBlock(scope: !530, file: !1, line: 353, column: 9)
!540 = !DISubprogram(name: "reversed_new", scope: !1, file: !1, line: 239, type: !459, isLocal: true, isDefinition: true, scopeLine: 240, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @reversed_new, variables: !541)
!541 = !{!542, !543, !544, !545, !546, !547, !548, !549, !552}
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !540, file: !1, line: 239, type: !461)
!543 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !540, file: !1, line: 239, type: !4)
!544 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !540, file: !1, line: 239, type: !4)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !540, file: !1, line: 241, type: !10)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seq", scope: !540, file: !1, line: 242, type: !4)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reversed_meth", scope: !540, file: !1, line: 242, type: !4)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ro", scope: !540, file: !1, line: 243, type: !360)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !550, file: !1, line: 254, type: !4)
!550 = distinct !DILexicalBlock(scope: !551, file: !1, line: 253, column: 32)
!551 = distinct !DILexicalBlock(scope: !540, file: !1, line: 253, column: 9)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !553, file: !1, line: 255, type: !4)
!553 = distinct !DILexicalBlock(scope: !550, file: !1, line: 255, column: 9)
!554 = !{!555, !556, !557, !561, !562, !567, !571, !575, !579, !583, !587, !591}
!555 = !DIGlobalVariable(name: "PyEnum_Type", scope: !0, file: !1, line: 186, type: !462, isLocal: false, isDefinition: true, variable: %struct._typeobject* @PyEnum_Type)
!556 = !DIGlobalVariable(name: "PyReversed_Type", scope: !0, file: !1, line: 375, type: !462, isLocal: false, isDefinition: true, variable: %struct._typeobject* @PyReversed_Type)
!557 = !DIGlobalVariable(name: "enum_doc", scope: !0, file: !1, line: 177, type: !558, isLocal: true, isDefinition: true, variable: [392 x i8]* @enum_doc)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 3136, align: 8, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 392)
!561 = !DIGlobalVariable(name: "one", scope: !433, file: !1, line: 83, type: !4, isLocal: true, isDefinition: true, variable: %struct._object** @enum_next_long.one)
!562 = !DIGlobalVariable(name: "enum_methods", scope: !0, file: !1, line: 172, type: !563, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMethodDef]* @enum_methods)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 512, align: 64, elements: !565)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !281, line: 47, baseType: !280)
!565 = !{!566}
!566 = !DISubrange(count: 2)
!567 = !DIGlobalVariable(name: "reduce_doc", scope: !0, file: !1, line: 170, type: !568, isLocal: true, isDefinition: true, variable: [39 x i8]* @reduce_doc)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 312, align: 8, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 39)
!571 = !DIGlobalVariable(name: "kwlist", scope: !458, file: !1, line: 19, type: !572, isLocal: true, isDefinition: true, variable: [3 x i8*]* @enum_new.kwlist)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 192, align: 64, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 3)
!575 = !DIGlobalVariable(name: "reversed_doc", scope: !0, file: !1, line: 317, type: !576, isLocal: true, isDefinition: true, variable: [94 x i8]* @reversed_doc)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 752, align: 8, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 94)
!579 = !DIGlobalVariable(name: "reversediter_methods", scope: !0, file: !1, line: 368, type: !580, isLocal: true, isDefinition: true, variable: [4 x %struct.PyMethodDef]* @reversediter_methods)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 1024, align: 64, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 4)
!583 = !DIGlobalVariable(name: "length_hint_doc", scope: !0, file: !1, line: 336, type: !584, isLocal: true, isDefinition: true, variable: [55 x i8]* @length_hint_doc)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 440, align: 8, elements: !585)
!585 = !{!586}
!586 = !DISubrange(count: 55)
!587 = !DIGlobalVariable(name: "setstate_doc", scope: !0, file: !1, line: 366, type: !588, isLocal: true, isDefinition: true, variable: [38 x i8]* @setstate_doc)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 304, align: 8, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 38)
!591 = !DIGlobalVariable(name: "PyId___reversed__", scope: !540, file: !1, line: 244, type: !592, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @reversed_new.PyId___reversed__)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !6, line: 144, baseType: !593)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !6, line: 140, size: 192, align: 64, elements: !594)
!594 = !{!595, !597, !598}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !593, file: !6, line: 141, baseType: !596, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !593, file: !6, line: 142, baseType: !28, size: 64, align: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !593, file: !6, line: 143, baseType: !4, size: 64, align: 64, offset: 128)
!599 = !{i32 2, !"Dwarf Version", i32 4}
!600 = !{i32 2, !"Debug Info Version", i32 3}
!601 = !{!"clang version 3.7.0 (tags/RELEASE_370/final)"}
!602 = !DIExpression()
!603 = !DILocation(line: 62, column: 26, scope: !368)
!604 = !DILocation(line: 64, column: 25, scope: !368)
!605 = !DILocation(line: 64, column: 5, scope: !368)
!606 = !DILocation(line: 65, column: 5, scope: !607)
!607 = !DILexicalBlockFile(scope: !374, file: !1, discriminator: 1)
!608 = !{!609, !614, i64 24}
!609 = !{!"", !610, i64 0, !611, i64 16, !614, i64 24, !614, i64 32, !614, i64 40}
!610 = !{!"_object", !611, i64 0, !614, i64 8}
!611 = !{!"long", !612, i64 0}
!612 = !{!"omnipotent char", !613, i64 0}
!613 = !{!"Simple C/C++ TBAA"}
!614 = !{!"any pointer", !612, i64 0}
!615 = !DILocation(line: 65, column: 5, scope: !377)
!616 = !DILocation(line: 65, column: 5, scope: !374)
!617 = !DILocation(line: 65, column: 5, scope: !618)
!618 = !DILexicalBlockFile(scope: !376, file: !1, discriminator: 4)
!619 = !DILocation(line: 65, column: 5, scope: !620)
!620 = distinct !DILexicalBlock(scope: !376, file: !1, line: 65, column: 5)
!621 = !{!610, !611, i64 0}
!622 = !DILocation(line: 65, column: 5, scope: !376)
!623 = !DILocation(line: 65, column: 5, scope: !624)
!624 = !DILexicalBlockFile(scope: !620, file: !1, discriminator: 6)
!625 = !{!610, !614, i64 8}
!626 = !{!627, !614, i64 48}
!627 = !{!"_typeobject", !628, i64 0, !614, i64 24, !611, i64 32, !611, i64 40, !614, i64 48, !614, i64 56, !614, i64 64, !614, i64 72, !614, i64 80, !614, i64 88, !614, i64 96, !614, i64 104, !614, i64 112, !614, i64 120, !614, i64 128, !614, i64 136, !614, i64 144, !614, i64 152, !614, i64 160, !611, i64 168, !614, i64 176, !614, i64 184, !614, i64 192, !614, i64 200, !611, i64 208, !614, i64 216, !614, i64 224, !614, i64 232, !614, i64 240, !614, i64 248, !614, i64 256, !614, i64 264, !614, i64 272, !614, i64 280, !611, i64 288, !614, i64 296, !614, i64 304, !614, i64 312, !614, i64 320, !614, i64 328, !614, i64 336, !614, i64 344, !614, i64 352, !614, i64 360, !614, i64 368, !614, i64 376, !629, i64 384, !614, i64 392}
!628 = !{!"", !610, i64 0, !611, i64 16}
!629 = !{!"int", !612, i64 0}
!630 = !DILocation(line: 66, column: 5, scope: !631)
!631 = !DILexicalBlockFile(scope: !379, file: !1, discriminator: 1)
!632 = !{!609, !614, i64 32}
!633 = !DILocation(line: 66, column: 5, scope: !382)
!634 = !DILocation(line: 66, column: 5, scope: !379)
!635 = !DILocation(line: 66, column: 5, scope: !636)
!636 = !DILexicalBlockFile(scope: !381, file: !1, discriminator: 4)
!637 = !DILocation(line: 66, column: 5, scope: !638)
!638 = distinct !DILexicalBlock(scope: !381, file: !1, line: 66, column: 5)
!639 = !DILocation(line: 66, column: 5, scope: !381)
!640 = !DILocation(line: 66, column: 5, scope: !641)
!641 = !DILexicalBlockFile(scope: !638, file: !1, discriminator: 6)
!642 = !DILocation(line: 67, column: 5, scope: !643)
!643 = !DILexicalBlockFile(scope: !384, file: !1, discriminator: 1)
!644 = !{!609, !614, i64 40}
!645 = !DILocation(line: 67, column: 5, scope: !387)
!646 = !DILocation(line: 67, column: 5, scope: !384)
!647 = !DILocation(line: 67, column: 5, scope: !648)
!648 = !DILexicalBlockFile(scope: !386, file: !1, discriminator: 4)
!649 = !DILocation(line: 67, column: 5, scope: !650)
!650 = distinct !DILexicalBlock(scope: !386, file: !1, line: 67, column: 5)
!651 = !DILocation(line: 67, column: 5, scope: !386)
!652 = !DILocation(line: 67, column: 5, scope: !653)
!653 = !DILexicalBlockFile(scope: !650, file: !1, discriminator: 6)
!654 = !DILocation(line: 68, column: 5, scope: !368)
!655 = !DILocation(line: 68, column: 18, scope: !368)
!656 = !{!627, !614, i64 320}
!657 = !DILocation(line: 69, column: 1, scope: !368)
!658 = !DILocation(line: 72, column: 27, scope: !388)
!659 = !DILocation(line: 72, column: 41, scope: !388)
!660 = !DILocation(line: 72, column: 54, scope: !388)
