; ModuleID = 'errors.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Py_atomic_address = type { i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !11, subprograms: !419, globals: !950)
!1 = !DIFile(filename: "Python/errors.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !4, line: 23, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!7 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!8 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!9 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!10 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!11 = !{!12, !114, !29, !409, !411, !35, !76}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !14, line: 139, baseType: !15)
!14 = !DIFile(filename: "Include/pystate.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !14, line: 69, size: 1536, align: 64, elements: !16)
!16 = !{!17, !19, !20, !379, !382, !383, !384, !385, !386, !387, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !15, file: !14, line: 72, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !15, file: !14, line: 73, baseType: !18, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !15, file: !14, line: 74, baseType: !21, size: 64, align: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !14, line: 44, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !14, line: 19, size: 832, align: 64, elements: !24)
!24 = !{!25, !27, !28, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !23, file: !14, line: 21, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !23, file: !14, line: 22, baseType: !18, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !23, file: !14, line: 24, baseType: !29, size: 64, align: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !31, line: 109, baseType: !32)
!31 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !31, line: 105, size: 128, align: 64, elements: !33)
!33 = !{!34, !42}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !32, file: !31, line: 107, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !36, line: 177, baseType: !37)
!36 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !38, line: 102, baseType: !39)
!38 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !40, line: 181, baseType: !41)
!40 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!41 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !32, file: !31, line: 108, baseType: !43, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !31, line: 334, size: 3200, align: 64, elements: !45)
!45 = !{!46, !52, !56, !57, !58, !63, !127, !132, !137, !138, !143, !195, !226, !238, !244, !245, !246, !248, !250, !281, !282, !283, !292, !293, !298, !299, !301, !303, !313, !316, !334, !335, !336, !338, !340, !341, !343, !348, !353, !358, !359, !360, !361, !362, !363, !364, !365, !367}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !44, file: !31, line: 335, baseType: !47, size: 192, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !31, line: 114, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 111, size: 192, align: 64, elements: !49)
!49 = !{!50, !51}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !48, file: !31, line: 112, baseType: !30, size: 128, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !48, file: !31, line: 113, baseType: !35, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !44, file: !31, line: 336, baseType: !53, size: 64, align: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !44, file: !31, line: 337, baseType: !35, size: 64, align: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !44, file: !31, line: 337, baseType: !35, size: 64, align: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !44, file: !31, line: 341, baseType: !59, size: 64, align: 64, offset: 384)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !31, line: 308, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !29}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !44, file: !31, line: 342, baseType: !64, size: 64, align: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !31, line: 314, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !29, !69, !68}
!68 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !38, line: 48, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !72, line: 246, size: 1728, align: 64, elements: !73)
!72 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!73 = !{!74, !75, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !95, !96, !97, !98, !100, !102, !104, !108, !111, !113, !115, !116, !117, !118, !122, !123}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !71, file: !72, line: 247, baseType: !68, size: 32, align: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !71, file: !72, line: 252, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !71, file: !72, line: 253, baseType: !76, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !71, file: !72, line: 254, baseType: !76, size: 64, align: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !71, file: !72, line: 255, baseType: !76, size: 64, align: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !71, file: !72, line: 256, baseType: !76, size: 64, align: 64, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !71, file: !72, line: 257, baseType: !76, size: 64, align: 64, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !71, file: !72, line: 258, baseType: !76, size: 64, align: 64, offset: 448)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !71, file: !72, line: 259, baseType: !76, size: 64, align: 64, offset: 512)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !71, file: !72, line: 261, baseType: !76, size: 64, align: 64, offset: 576)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !71, file: !72, line: 262, baseType: !76, size: 64, align: 64, offset: 640)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !71, file: !72, line: 263, baseType: !76, size: 64, align: 64, offset: 704)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !71, file: !72, line: 265, baseType: !88, size: 64, align: 64, offset: 768)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !72, line: 161, size: 192, align: 64, elements: !90)
!90 = !{!91, !92, !94}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !89, file: !72, line: 162, baseType: !88, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !89, file: !72, line: 163, baseType: !93, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !89, file: !72, line: 167, baseType: !68, size: 32, align: 32, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !71, file: !72, line: 267, baseType: !93, size: 64, align: 64, offset: 832)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !71, file: !72, line: 269, baseType: !68, size: 32, align: 32, offset: 896)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !71, file: !72, line: 273, baseType: !68, size: 32, align: 32, offset: 928)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !71, file: !72, line: 275, baseType: !99, size: 64, align: 64, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !40, line: 140, baseType: !41)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !71, file: !72, line: 279, baseType: !101, size: 16, align: 16, offset: 1024)
!101 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !71, file: !72, line: 280, baseType: !103, size: 8, align: 8, offset: 1040)
!103 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !71, file: !72, line: 281, baseType: !105, size: 8, align: 8, offset: 1048)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 8, align: 8, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 1)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !71, file: !72, line: 285, baseType: !109, size: 64, align: 64, offset: 1088)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !72, line: 155, baseType: null)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !71, file: !72, line: 294, baseType: !112, size: 64, align: 64, offset: 1152)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !40, line: 141, baseType: !41)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !71, file: !72, line: 303, baseType: !114, size: 64, align: 64, offset: 1216)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !71, file: !72, line: 304, baseType: !114, size: 64, align: 64, offset: 1280)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !71, file: !72, line: 305, baseType: !114, size: 64, align: 64, offset: 1344)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !71, file: !72, line: 306, baseType: !114, size: 64, align: 64, offset: 1408)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !71, file: !72, line: 307, baseType: !119, size: 64, align: 64, offset: 1472)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !120, line: 62, baseType: !121)
!120 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!121 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !71, file: !72, line: 309, baseType: !68, size: 32, align: 32, offset: 1536)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !71, file: !72, line: 311, baseType: !124, size: 160, align: 8, offset: 1568)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 160, align: 8, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 20)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !44, file: !31, line: 343, baseType: !128, size: 64, align: 64, offset: 512)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !31, line: 316, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!29, !29, !76}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !44, file: !31, line: 344, baseType: !133, size: 64, align: 64, offset: 576)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !31, line: 318, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!68, !29, !76, !29}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !44, file: !31, line: 345, baseType: !114, size: 64, align: 64, offset: 640)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !44, file: !31, line: 346, baseType: !139, size: 64, align: 64, offset: 704)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !31, line: 320, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!29, !29}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !44, file: !31, line: 350, baseType: !144, size: 64, align: 64, offset: 768)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !31, line: 278, baseType: !146)
!146 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 236, size: 2176, align: 64, elements: !147)
!147 = !{!148, !153, !154, !155, !156, !157, !162, !164, !165, !166, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !146, file: !31, line: 241, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !31, line: 166, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!29, !29, !29}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !146, file: !31, line: 242, baseType: !149, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !146, file: !31, line: 243, baseType: !149, size: 64, align: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !146, file: !31, line: 244, baseType: !149, size: 64, align: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !146, file: !31, line: 245, baseType: !149, size: 64, align: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !146, file: !31, line: 246, baseType: !158, size: 64, align: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !31, line: 167, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!29, !29, !29, !29}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !146, file: !31, line: 247, baseType: !163, size: 64, align: 64, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !31, line: 165, baseType: !140)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !146, file: !31, line: 248, baseType: !163, size: 64, align: 64, offset: 448)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !146, file: !31, line: 249, baseType: !163, size: 64, align: 64, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !146, file: !31, line: 250, baseType: !167, size: 64, align: 64, offset: 576)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !31, line: 168, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!68, !29}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !146, file: !31, line: 251, baseType: !163, size: 64, align: 64, offset: 640)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !146, file: !31, line: 252, baseType: !149, size: 64, align: 64, offset: 704)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !146, file: !31, line: 253, baseType: !149, size: 64, align: 64, offset: 768)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !146, file: !31, line: 254, baseType: !149, size: 64, align: 64, offset: 832)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !146, file: !31, line: 255, baseType: !149, size: 64, align: 64, offset: 896)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !146, file: !31, line: 256, baseType: !149, size: 64, align: 64, offset: 960)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !146, file: !31, line: 257, baseType: !163, size: 64, align: 64, offset: 1024)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !146, file: !31, line: 258, baseType: !114, size: 64, align: 64, offset: 1088)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !146, file: !31, line: 259, baseType: !163, size: 64, align: 64, offset: 1152)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !146, file: !31, line: 261, baseType: !149, size: 64, align: 64, offset: 1216)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !146, file: !31, line: 262, baseType: !149, size: 64, align: 64, offset: 1280)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !146, file: !31, line: 263, baseType: !149, size: 64, align: 64, offset: 1344)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !146, file: !31, line: 264, baseType: !149, size: 64, align: 64, offset: 1408)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !146, file: !31, line: 265, baseType: !158, size: 64, align: 64, offset: 1472)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !146, file: !31, line: 266, baseType: !149, size: 64, align: 64, offset: 1536)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !146, file: !31, line: 267, baseType: !149, size: 64, align: 64, offset: 1600)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !146, file: !31, line: 268, baseType: !149, size: 64, align: 64, offset: 1664)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !146, file: !31, line: 269, baseType: !149, size: 64, align: 64, offset: 1728)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !146, file: !31, line: 270, baseType: !149, size: 64, align: 64, offset: 1792)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !146, file: !31, line: 272, baseType: !149, size: 64, align: 64, offset: 1856)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !146, file: !31, line: 273, baseType: !149, size: 64, align: 64, offset: 1920)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !146, file: !31, line: 274, baseType: !149, size: 64, align: 64, offset: 1984)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !146, file: !31, line: 275, baseType: !149, size: 64, align: 64, offset: 2048)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !146, file: !31, line: 277, baseType: !163, size: 64, align: 64, offset: 2112)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !44, file: !31, line: 351, baseType: !196, size: 64, align: 64, offset: 832)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !31, line: 292, baseType: !198)
!198 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 280, size: 640, align: 64, elements: !199)
!199 = !{!200, !205, !206, !211, !212, !213, !218, !219, !224, !225}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !198, file: !31, line: 281, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !31, line: 169, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!35, !29}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !198, file: !31, line: 282, baseType: !149, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !198, file: !31, line: 283, baseType: !207, size: 64, align: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !31, line: 170, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!29, !29, !35}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !198, file: !31, line: 284, baseType: !207, size: 64, align: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !198, file: !31, line: 285, baseType: !114, size: 64, align: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !198, file: !31, line: 286, baseType: !214, size: 64, align: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !31, line: 172, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!68, !29, !35, !29}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !198, file: !31, line: 287, baseType: !114, size: 64, align: 64, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !198, file: !31, line: 288, baseType: !220, size: 64, align: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !31, line: 231, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!68, !29, !29}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !198, file: !31, line: 290, baseType: !149, size: 64, align: 64, offset: 512)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !198, file: !31, line: 291, baseType: !207, size: 64, align: 64, offset: 576)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !44, file: !31, line: 352, baseType: !227, size: 64, align: 64, offset: 896)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !31, line: 298, baseType: !229)
!229 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 294, size: 192, align: 64, elements: !230)
!230 = !{!231, !232, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !229, file: !31, line: 295, baseType: !201, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !229, file: !31, line: 296, baseType: !149, size: 64, align: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !229, file: !31, line: 297, baseType: !234, size: 64, align: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !31, line: 174, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!68, !29, !29, !29}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !44, file: !31, line: 356, baseType: !239, size: 64, align: 64, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !31, line: 321, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!243, !29}
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !36, line: 186, baseType: !35)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !44, file: !31, line: 357, baseType: !158, size: 64, align: 64, offset: 1024)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !44, file: !31, line: 358, baseType: !139, size: 64, align: 64, offset: 1088)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !44, file: !31, line: 359, baseType: !247, size: 64, align: 64, offset: 1152)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !31, line: 317, baseType: !150)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !44, file: !31, line: 360, baseType: !249, size: 64, align: 64, offset: 1216)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !31, line: 319, baseType: !235)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !44, file: !31, line: 363, baseType: !251, size: 64, align: 64, offset: 1280)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !31, line: 304, baseType: !253)
!253 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 301, size: 128, align: 64, elements: !254)
!254 = !{!255, !276}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !253, file: !31, line: 302, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !31, line: 193, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!68, !29, !260, !68}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !31, line: 191, baseType: !262)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !31, line: 178, size: 640, align: 64, elements: !263)
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !273, !274, !275}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !262, file: !31, line: 179, baseType: !114, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !262, file: !31, line: 180, baseType: !29, size: 64, align: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !262, file: !31, line: 181, baseType: !35, size: 64, align: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !262, file: !31, line: 182, baseType: !35, size: 64, align: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !262, file: !31, line: 184, baseType: !68, size: 32, align: 32, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !262, file: !31, line: 185, baseType: !68, size: 32, align: 32, offset: 288)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !262, file: !31, line: 186, baseType: !76, size: 64, align: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !262, file: !31, line: 187, baseType: !272, size: 64, align: 64, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !262, file: !31, line: 188, baseType: !272, size: 64, align: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !262, file: !31, line: 189, baseType: !272, size: 64, align: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !262, file: !31, line: 190, baseType: !114, size: 64, align: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !253, file: !31, line: 303, baseType: !277, size: 64, align: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !31, line: 194, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !29, !260}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !44, file: !31, line: 366, baseType: !121, size: 64, align: 64, offset: 1344)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !44, file: !31, line: 368, baseType: !53, size: 64, align: 64, offset: 1408)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !44, file: !31, line: 372, baseType: !284, size: 64, align: 64, offset: 1472)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !31, line: 233, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!68, !29, !288, !114}
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !31, line: 232, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!68, !29, !114}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !44, file: !31, line: 375, baseType: !167, size: 64, align: 64, offset: 1536)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !44, file: !31, line: 379, baseType: !294, size: 64, align: 64, offset: 1600)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !31, line: 322, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!29, !29, !29, !68}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !44, file: !31, line: 382, baseType: !35, size: 64, align: 64, offset: 1664)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !44, file: !31, line: 385, baseType: !300, size: 64, align: 64, offset: 1728)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !31, line: 323, baseType: !140)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !44, file: !31, line: 386, baseType: !302, size: 64, align: 64, offset: 1792)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !31, line: 324, baseType: !140)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !44, file: !31, line: 389, baseType: !304, size: 64, align: 64, offset: 1856)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !306, line: 40, size: 256, align: 64, elements: !307)
!306 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!307 = !{!308, !309, !311, !312}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !305, file: !306, line: 41, baseType: !53, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !305, file: !306, line: 42, baseType: !310, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !306, line: 18, baseType: !150)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !305, file: !306, line: 43, baseType: !68, size: 32, align: 32, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !305, file: !306, line: 45, baseType: !53, size: 64, align: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !44, file: !31, line: 390, baseType: !314, size: 64, align: 64, offset: 1920)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !31, line: 390, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !44, file: !31, line: 391, baseType: !317, size: 64, align: 64, offset: 1984)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !319, line: 11, size: 320, align: 64, elements: !320)
!319 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!320 = !{!321, !322, !327, !332, !333}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !318, file: !319, line: 12, baseType: !76, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !318, file: !319, line: 13, baseType: !323, size: 64, align: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !319, line: 8, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!29, !29, !114}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !318, file: !319, line: 14, baseType: !328, size: 64, align: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !319, line: 9, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!68, !29, !29, !114}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !318, file: !319, line: 15, baseType: !76, size: 64, align: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !318, file: !319, line: 16, baseType: !114, size: 64, align: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !44, file: !31, line: 392, baseType: !43, size: 64, align: 64, offset: 2048)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !44, file: !31, line: 393, baseType: !29, size: 64, align: 64, offset: 2112)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !44, file: !31, line: 394, baseType: !337, size: 64, align: 64, offset: 2176)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !31, line: 325, baseType: !159)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !44, file: !31, line: 395, baseType: !339, size: 64, align: 64, offset: 2240)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !31, line: 326, baseType: !235)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !44, file: !31, line: 396, baseType: !35, size: 64, align: 64, offset: 2304)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !44, file: !31, line: 397, baseType: !342, size: 64, align: 64, offset: 2368)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !31, line: 327, baseType: !235)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !44, file: !31, line: 398, baseType: !344, size: 64, align: 64, offset: 2432)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !31, line: 329, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!29, !43, !35}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !44, file: !31, line: 399, baseType: !349, size: 64, align: 64, offset: 2496)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !31, line: 328, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!29, !43, !29, !29}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !44, file: !31, line: 400, baseType: !354, size: 64, align: 64, offset: 2560)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !31, line: 307, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !114}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !44, file: !31, line: 401, baseType: !167, size: 64, align: 64, offset: 2624)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !44, file: !31, line: 402, baseType: !29, size: 64, align: 64, offset: 2688)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !44, file: !31, line: 403, baseType: !29, size: 64, align: 64, offset: 2752)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !44, file: !31, line: 404, baseType: !29, size: 64, align: 64, offset: 2816)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !44, file: !31, line: 405, baseType: !29, size: 64, align: 64, offset: 2880)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !44, file: !31, line: 406, baseType: !29, size: 64, align: 64, offset: 2944)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !44, file: !31, line: 407, baseType: !59, size: 64, align: 64, offset: 3008)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !44, file: !31, line: 410, baseType: !366, size: 32, align: 32, offset: 3072)
!366 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !44, file: !31, line: 412, baseType: !59, size: 64, align: 64, offset: 3136)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !23, file: !14, line: 25, baseType: !29, size: 64, align: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !23, file: !14, line: 26, baseType: !29, size: 64, align: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !23, file: !14, line: 27, baseType: !29, size: 64, align: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !23, file: !14, line: 28, baseType: !29, size: 64, align: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !23, file: !14, line: 30, baseType: !29, size: 64, align: 64, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !23, file: !14, line: 31, baseType: !29, size: 64, align: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !23, file: !14, line: 32, baseType: !29, size: 64, align: 64, offset: 576)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !23, file: !14, line: 33, baseType: !68, size: 32, align: 32, offset: 640)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !23, file: !14, line: 34, baseType: !68, size: 32, align: 32, offset: 672)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !23, file: !14, line: 37, baseType: !68, size: 32, align: 32, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !23, file: !14, line: 43, baseType: !29, size: 64, align: 64, offset: 768)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !15, file: !14, line: 76, baseType: !380, size: 64, align: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !14, line: 50, flags: DIFlagFwdDecl)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !15, file: !14, line: 77, baseType: !68, size: 32, align: 32, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !15, file: !14, line: 78, baseType: !55, size: 8, align: 8, offset: 288)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !15, file: !14, line: 80, baseType: !55, size: 8, align: 8, offset: 296)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !15, file: !14, line: 85, baseType: !68, size: 32, align: 32, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !15, file: !14, line: 86, baseType: !68, size: 32, align: 32, offset: 352)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !15, file: !14, line: 88, baseType: !388, size: 64, align: 64, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !14, line: 54, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!68, !29, !380, !68, !29}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !15, file: !14, line: 89, baseType: !388, size: 64, align: 64, offset: 448)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !15, file: !14, line: 90, baseType: !29, size: 64, align: 64, offset: 512)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !15, file: !14, line: 91, baseType: !29, size: 64, align: 64, offset: 576)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !15, file: !14, line: 93, baseType: !29, size: 64, align: 64, offset: 640)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !15, file: !14, line: 94, baseType: !29, size: 64, align: 64, offset: 704)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !15, file: !14, line: 95, baseType: !29, size: 64, align: 64, offset: 768)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !15, file: !14, line: 97, baseType: !29, size: 64, align: 64, offset: 832)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !15, file: !14, line: 98, baseType: !29, size: 64, align: 64, offset: 896)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !15, file: !14, line: 99, baseType: !29, size: 64, align: 64, offset: 960)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !15, file: !14, line: 101, baseType: !29, size: 64, align: 64, offset: 1024)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !15, file: !14, line: 103, baseType: !68, size: 32, align: 32, offset: 1088)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !15, file: !14, line: 105, baseType: !29, size: 64, align: 64, offset: 1152)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !15, file: !14, line: 106, baseType: !41, size: 64, align: 64, offset: 1216)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !15, file: !14, line: 108, baseType: !68, size: 32, align: 32, offset: 1280)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !15, file: !14, line: 109, baseType: !29, size: 64, align: 64, offset: 1344)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !15, file: !14, line: 134, baseType: !355, size: 64, align: 64, offset: 1408)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !15, file: !14, line: 135, baseType: !114, size: 64, align: 64, offset: 1472)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !31, line: 422, baseType: !44)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !413, line: 33, baseType: !414)
!413 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!414 = !DICompositeType(tag: DW_TAG_structure_type, file: !413, line: 25, size: 256, align: 64, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !414, file: !413, line: 26, baseType: !47, size: 192, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !414, file: !413, line: 27, baseType: !418, size: 64, align: 64, offset: 192)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 64, align: 64, elements: !106)
!419 = !{!420, !463, !507, !513, !516, !528, !538, !552, !555, !603, !614, !618, !635, !664, !667, !668, !672, !694, !707, !710, !730, !736, !737, !762, !795, !816, !848, !852, !887, !900, !907, !914, !923, !928, !931}
!420 = !DISubprogram(name: "PyErr_Restore", scope: !1, file: !1, line: 28, type: !421, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, %struct._object*, %struct._object*)* @PyErr_Restore, variables: !423)
!421 = !DISubroutineType(types: !422)
!422 = !{null, !29, !29, !29}
!423 = !{!424, !425, !426, !427, !428, !435, !436, !439, !441, !442, !443, !444, !448, !450, !453, !455, !458, !460}
!424 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !420, file: !1, line: 28, type: !29)
!425 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !420, file: !1, line: 28, type: !29)
!426 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "traceback", arg: 3, scope: !420, file: !1, line: 28, type: !29)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !420, file: !1, line: 30, type: !12)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !429, file: !1, line: 30, type: !430)
!429 = distinct !DILexicalBlock(scope: !420, file: !1, line: 30, column: 29)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !4, line: 33, baseType: !432)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !4, line: 31, size: 64, align: 64, elements: !433)
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !432, file: !4, line: 32, baseType: !114, size: 64, align: 64)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !429, file: !1, line: 30, type: !114)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !429, file: !1, line: 30, type: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !114)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !429, file: !1, line: 30, type: !440)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !4, line: 29, baseType: !3)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldtype", scope: !420, file: !1, line: 31, type: !29)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldvalue", scope: !420, file: !1, line: 31, type: !29)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldtraceback", scope: !420, file: !1, line: 31, type: !29)
!444 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !445, file: !1, line: 36, type: !29)
!445 = distinct !DILexicalBlock(scope: !446, file: !1, line: 36, column: 9)
!446 = distinct !DILexicalBlock(scope: !447, file: !1, line: 33, column: 61)
!447 = distinct !DILexicalBlock(scope: !420, file: !1, line: 33, column: 9)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !449, file: !1, line: 50, type: !29)
!449 = distinct !DILexicalBlock(scope: !420, file: !1, line: 50, column: 5)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !451, file: !1, line: 50, type: !29)
!451 = distinct !DILexicalBlock(scope: !452, file: !1, line: 50, column: 5)
!452 = distinct !DILexicalBlock(scope: !449, file: !1, line: 50, column: 5)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !454, file: !1, line: 51, type: !29)
!454 = distinct !DILexicalBlock(scope: !420, file: !1, line: 51, column: 5)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !456, file: !1, line: 51, type: !29)
!456 = distinct !DILexicalBlock(scope: !457, file: !1, line: 51, column: 5)
!457 = distinct !DILexicalBlock(scope: !454, file: !1, line: 51, column: 5)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !459, file: !1, line: 52, type: !29)
!459 = distinct !DILexicalBlock(scope: !420, file: !1, line: 52, column: 5)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !461, file: !1, line: 52, type: !29)
!461 = distinct !DILexicalBlock(scope: !462, file: !1, line: 52, column: 5)
!462 = distinct !DILexicalBlock(scope: !459, file: !1, line: 52, column: 5)
!463 = !DISubprogram(name: "PyErr_SetObject", scope: !1, file: !1, line: 56, type: !464, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, %struct._object*)* @PyErr_SetObject, variables: !466)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !29, !29}
!466 = !{!467, !468, !469, !470, !472, !473, !474, !475, !476, !477, !479, !484, !485, !487, !490, !492, !495, !498, !499, !502, !505}
!467 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exception", arg: 1, scope: !463, file: !1, line: 56, type: !29)
!468 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !463, file: !1, line: 56, type: !29)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !463, file: !1, line: 58, type: !12)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !471, file: !1, line: 58, type: !430)
!471 = distinct !DILexicalBlock(scope: !463, file: !1, line: 58, column: 29)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !471, file: !1, line: 58, type: !114)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !471, file: !1, line: 58, type: !437)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !471, file: !1, line: 58, type: !440)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc_value", scope: !463, file: !1, line: 59, type: !29)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !463, file: !1, line: 60, type: !29)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !478, file: !1, line: 69, type: !29)
!478 = distinct !DILexicalBlock(scope: !463, file: !1, line: 69, column: 5)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !480, file: !1, line: 76, type: !29)
!480 = distinct !DILexicalBlock(scope: !481, file: !1, line: 74, column: 65)
!481 = distinct !DILexicalBlock(scope: !482, file: !1, line: 74, column: 13)
!482 = distinct !DILexicalBlock(scope: !483, file: !1, line: 71, column: 52)
!483 = distinct !DILexicalBlock(scope: !463, file: !1, line: 71, column: 9)
!484 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fixed_value", scope: !480, file: !1, line: 76, type: !29)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !486, file: !1, line: 92, type: !29)
!486 = distinct !DILexicalBlock(scope: !480, file: !1, line: 92, column: 13)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !488, file: !1, line: 92, type: !29)
!488 = distinct !DILexicalBlock(scope: !489, file: !1, line: 92, column: 13)
!489 = distinct !DILexicalBlock(scope: !486, file: !1, line: 92, column: 13)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !491, file: !1, line: 93, type: !29)
!491 = distinct !DILexicalBlock(scope: !480, file: !1, line: 93, column: 13)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !493, file: !1, line: 93, type: !29)
!493 = distinct !DILexicalBlock(scope: !494, file: !1, line: 93, column: 13)
!494 = distinct !DILexicalBlock(scope: !491, file: !1, line: 93, column: 13)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !496, file: !1, line: 103, type: !29)
!496 = distinct !DILexicalBlock(scope: !497, file: !1, line: 102, column: 33)
!497 = distinct !DILexicalBlock(scope: !482, file: !1, line: 102, column: 13)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "context", scope: !496, file: !1, line: 103, type: !29)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !500, file: !1, line: 105, type: !29)
!500 = distinct !DILexicalBlock(scope: !501, file: !1, line: 105, column: 17)
!501 = distinct !DILexicalBlock(scope: !496, file: !1, line: 104, column: 59)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !503, file: !1, line: 114, type: !29)
!503 = distinct !DILexicalBlock(scope: !504, file: !1, line: 114, column: 13)
!504 = distinct !DILexicalBlock(scope: !497, file: !1, line: 113, column: 16)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !506, file: !1, line: 119, type: !29)
!506 = distinct !DILexicalBlock(scope: !463, file: !1, line: 119, column: 5)
!507 = !DISubprogram(name: "_PyErr_SetKeyError", scope: !1, file: !1, line: 127, type: !61, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @_PyErr_SetKeyError, variables: !508)
!508 = !{!509, !510, !511}
!509 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 1, scope: !507, file: !1, line: 127, type: !29)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tup", scope: !507, file: !1, line: 129, type: !29)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !512, file: !1, line: 134, type: !29)
!512 = distinct !DILexicalBlock(scope: !507, file: !1, line: 134, column: 5)
!513 = !DISubprogram(name: "PyErr_SetNone", scope: !1, file: !1, line: 138, type: !61, isLocal: false, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @PyErr_SetNone, variables: !514)
!514 = !{!515}
!515 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exception", arg: 1, scope: !513, file: !1, line: 138, type: !29)
!516 = !DISubprogram(name: "PyErr_SetString", scope: !1, file: !1, line: 144, type: !517, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, i8*)* @PyErr_SetString, variables: !519)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !29, !53}
!519 = !{!520, !521, !522, !523, !525}
!520 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exception", arg: 1, scope: !516, file: !1, line: 144, type: !29)
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "string", arg: 2, scope: !516, file: !1, line: 144, type: !53)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !516, file: !1, line: 146, type: !29)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !524, file: !1, line: 148, type: !29)
!524 = distinct !DILexicalBlock(scope: !516, file: !1, line: 148, column: 5)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !526, file: !1, line: 148, type: !29)
!526 = distinct !DILexicalBlock(scope: !527, file: !1, line: 148, column: 5)
!527 = distinct !DILexicalBlock(scope: !524, file: !1, line: 148, column: 5)
!528 = !DISubprogram(name: "PyErr_Occurred", scope: !1, file: !1, line: 153, type: !529, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyErr_Occurred, variables: !531)
!529 = !DISubroutineType(types: !530)
!530 = !{!29}
!531 = !{!532, !533, !535, !536, !537}
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !528, file: !1, line: 159, type: !12)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !534, file: !1, line: 160, type: !430)
!534 = distinct !DILexicalBlock(scope: !528, file: !1, line: 160, column: 26)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !534, file: !1, line: 160, type: !114)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !534, file: !1, line: 160, type: !437)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !534, file: !1, line: 160, type: !440)
!538 = !DISubprogram(name: "PyErr_GivenExceptionMatches", scope: !1, file: !1, line: 167, type: !222, isLocal: false, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*)* @PyErr_GivenExceptionMatches, variables: !539)
!539 = !{!540, !541, !542, !545, !546, !549, !550, !551}
!540 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "err", arg: 1, scope: !538, file: !1, line: 167, type: !29)
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 2, scope: !538, file: !1, line: 167, type: !29)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !543, file: !1, line: 174, type: !35)
!543 = distinct !DILexicalBlock(scope: !544, file: !1, line: 173, column: 29)
!544 = distinct !DILexicalBlock(scope: !538, file: !1, line: 173, column: 9)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !543, file: !1, line: 174, type: !35)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !547, file: !1, line: 191, type: !68)
!547 = distinct !DILexicalBlock(scope: !548, file: !1, line: 190, column: 69)
!548 = distinct !DILexicalBlock(scope: !538, file: !1, line: 190, column: 9)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exception", scope: !547, file: !1, line: 192, type: !29)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !547, file: !1, line: 192, type: !29)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !547, file: !1, line: 192, type: !29)
!552 = !DISubprogram(name: "PyErr_ExceptionMatches", scope: !1, file: !1, line: 211, type: !169, isLocal: false, isDefinition: true, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @PyErr_ExceptionMatches, variables: !553)
!553 = !{!554}
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !552, file: !1, line: 211, type: !29)
!555 = !DISubprogram(name: "PyErr_NormalizeException", scope: !1, file: !1, line: 224, type: !556, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object**, %struct._object**, %struct._object**)* @PyErr_NormalizeException, variables: !559)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !558, !558, !558}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!559 = !{!560, !561, !562, !563, !564, !565, !566, !567, !568, !571, !574, !575, !577, !579, !583, !585, !587, !592, !594, !595, !596, !597, !601}
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !555, file: !1, line: 224, type: !558)
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "val", arg: 2, scope: !555, file: !1, line: 224, type: !558)
!562 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tb", arg: 3, scope: !555, file: !1, line: 224, type: !558)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !555, file: !1, line: 226, type: !29)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !555, file: !1, line: 227, type: !29)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inclass", scope: !555, file: !1, line: 228, type: !29)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "initial_tb", scope: !555, file: !1, line: 229, type: !29)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !555, file: !1, line: 230, type: !12)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "is_subclass", scope: !569, file: !1, line: 252, type: !68)
!569 = distinct !DILexicalBlock(scope: !570, file: !1, line: 251, column: 39)
!570 = distinct !DILexicalBlock(scope: !555, file: !1, line: 251, column: 9)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !572, file: !1, line: 267, type: !29)
!572 = distinct !DILexicalBlock(scope: !573, file: !1, line: 266, column: 39)
!573 = distinct !DILexicalBlock(scope: !569, file: !1, line: 266, column: 13)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !572, file: !1, line: 267, type: !29)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !576, file: !1, line: 281, type: !29)
!576 = distinct !DILexicalBlock(scope: !572, file: !1, line: 281, column: 13)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !578, file: !1, line: 284, type: !29)
!578 = distinct !DILexicalBlock(scope: !572, file: !1, line: 284, column: 13)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !580, file: !1, line: 291, type: !29)
!580 = distinct !DILexicalBlock(scope: !581, file: !1, line: 291, column: 13)
!581 = distinct !DILexicalBlock(scope: !582, file: !1, line: 290, column: 35)
!582 = distinct !DILexicalBlock(scope: !573, file: !1, line: 290, column: 18)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !584, file: !1, line: 300, type: !29)
!584 = distinct !DILexicalBlock(scope: !555, file: !1, line: 300, column: 5)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !586, file: !1, line: 301, type: !29)
!586 = distinct !DILexicalBlock(scope: !555, file: !1, line: 301, column: 5)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !588, file: !1, line: 312, type: !29)
!588 = distinct !DILexicalBlock(scope: !589, file: !1, line: 312, column: 13)
!589 = distinct !DILexicalBlock(scope: !590, file: !1, line: 309, column: 13)
!590 = distinct !DILexicalBlock(scope: !591, file: !1, line: 308, column: 29)
!591 = distinct !DILexicalBlock(scope: !555, file: !1, line: 308, column: 9)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !593, file: !1, line: 315, type: !430)
!593 = distinct !DILexicalBlock(scope: !555, file: !1, line: 315, column: 14)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !593, file: !1, line: 315, type: !114)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !593, file: !1, line: 315, type: !437)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !593, file: !1, line: 315, type: !440)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !598, file: !1, line: 319, type: !29)
!598 = distinct !DILexicalBlock(scope: !599, file: !1, line: 319, column: 9)
!599 = distinct !DILexicalBlock(scope: !600, file: !1, line: 316, column: 61)
!600 = distinct !DILexicalBlock(scope: !555, file: !1, line: 316, column: 9)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !602, file: !1, line: 320, type: !29)
!602 = distinct !DILexicalBlock(scope: !599, file: !1, line: 320, column: 9)
!603 = !DISubprogram(name: "PyErr_Fetch", scope: !1, file: !1, line: 335, type: !556, isLocal: false, isDefinition: true, scopeLine: 336, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object**, %struct._object**, %struct._object**)* @PyErr_Fetch, variables: !604)
!604 = !{!605, !606, !607, !608, !609, !611, !612, !613}
!605 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_type", arg: 1, scope: !603, file: !1, line: 335, type: !558)
!606 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_value", arg: 2, scope: !603, file: !1, line: 335, type: !558)
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_traceback", arg: 3, scope: !603, file: !1, line: 335, type: !558)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !603, file: !1, line: 337, type: !12)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !610, file: !1, line: 337, type: !430)
!610 = distinct !DILexicalBlock(scope: !603, file: !1, line: 337, column: 29)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !610, file: !1, line: 337, type: !114)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !610, file: !1, line: 337, type: !437)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !610, file: !1, line: 337, type: !440)
!614 = !DISubprogram(name: "PyErr_Clear", scope: !1, file: !1, line: 349, type: !615, isLocal: false, isDefinition: true, scopeLine: 350, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyErr_Clear, variables: !617)
!615 = !DISubroutineType(types: !616)
!616 = !{null}
!617 = !{}
!618 = !DISubprogram(name: "PyErr_GetExcInfo", scope: !1, file: !1, line: 355, type: !556, isLocal: false, isDefinition: true, scopeLine: 356, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object**, %struct._object**, %struct._object**)* @PyErr_GetExcInfo, variables: !619)
!619 = !{!620, !621, !622, !623, !624, !626, !627, !628, !629, !631, !633}
!620 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_type", arg: 1, scope: !618, file: !1, line: 355, type: !558)
!621 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_value", arg: 2, scope: !618, file: !1, line: 355, type: !558)
!622 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_traceback", arg: 3, scope: !618, file: !1, line: 355, type: !558)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !618, file: !1, line: 357, type: !12)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !625, file: !1, line: 357, type: !430)
!625 = distinct !DILexicalBlock(scope: !618, file: !1, line: 357, column: 29)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !625, file: !1, line: 357, type: !114)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !625, file: !1, line: 357, type: !437)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !625, file: !1, line: 357, type: !440)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !630, file: !1, line: 363, type: !29)
!630 = distinct !DILexicalBlock(scope: !618, file: !1, line: 363, column: 5)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !632, file: !1, line: 364, type: !29)
!632 = distinct !DILexicalBlock(scope: !618, file: !1, line: 364, column: 5)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !634, file: !1, line: 365, type: !29)
!634 = distinct !DILexicalBlock(scope: !618, file: !1, line: 365, column: 5)
!635 = !DISubprogram(name: "PyErr_SetExcInfo", scope: !1, file: !1, line: 369, type: !421, isLocal: false, isDefinition: true, scopeLine: 370, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, %struct._object*, %struct._object*)* @PyErr_SetExcInfo, variables: !636)
!636 = !{!637, !638, !639, !640, !641, !642, !643, !644, !646, !647, !648, !649, !651, !654, !656, !659, !661}
!637 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_type", arg: 1, scope: !635, file: !1, line: 369, type: !29)
!638 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_value", arg: 2, scope: !635, file: !1, line: 369, type: !29)
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_traceback", arg: 3, scope: !635, file: !1, line: 369, type: !29)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldtype", scope: !635, file: !1, line: 371, type: !29)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldvalue", scope: !635, file: !1, line: 371, type: !29)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldtraceback", scope: !635, file: !1, line: 371, type: !29)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !635, file: !1, line: 372, type: !12)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !645, file: !1, line: 372, type: !430)
!645 = distinct !DILexicalBlock(scope: !635, file: !1, line: 372, column: 29)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !645, file: !1, line: 372, type: !114)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !645, file: !1, line: 372, type: !437)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !645, file: !1, line: 372, type: !440)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !650, file: !1, line: 382, type: !29)
!650 = distinct !DILexicalBlock(scope: !635, file: !1, line: 382, column: 5)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !652, file: !1, line: 382, type: !29)
!652 = distinct !DILexicalBlock(scope: !653, file: !1, line: 382, column: 5)
!653 = distinct !DILexicalBlock(scope: !650, file: !1, line: 382, column: 5)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !655, file: !1, line: 383, type: !29)
!655 = distinct !DILexicalBlock(scope: !635, file: !1, line: 383, column: 5)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !657, file: !1, line: 383, type: !29)
!657 = distinct !DILexicalBlock(scope: !658, file: !1, line: 383, column: 5)
!658 = distinct !DILexicalBlock(scope: !655, file: !1, line: 383, column: 5)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !660, file: !1, line: 384, type: !29)
!660 = distinct !DILexicalBlock(scope: !635, file: !1, line: 384, column: 5)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !662, file: !1, line: 384, type: !29)
!662 = distinct !DILexicalBlock(scope: !663, file: !1, line: 384, column: 5)
!663 = distinct !DILexicalBlock(scope: !660, file: !1, line: 384, column: 5)
!664 = !DISubprogram(name: "PyErr_BadArgument", scope: !1, file: !1, line: 390, type: !665, isLocal: false, isDefinition: true, scopeLine: 391, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @PyErr_BadArgument, variables: !617)
!665 = !DISubroutineType(types: !666)
!666 = !{!68}
!667 = !DISubprogram(name: "PyErr_NoMemory", scope: !1, file: !1, line: 398, type: !529, isLocal: false, isDefinition: true, scopeLine: 399, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyErr_NoMemory, variables: !617)
!668 = !DISubprogram(name: "PyErr_SetFromErrnoWithFilenameObject", scope: !1, file: !1, line: 411, type: !151, isLocal: false, isDefinition: true, scopeLine: 412, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyErr_SetFromErrnoWithFilenameObject, variables: !669)
!669 = !{!670, !671}
!670 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !668, file: !1, line: 411, type: !29)
!671 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filenameObject", arg: 2, scope: !668, file: !1, line: 411, type: !29)
!672 = !DISubprogram(name: "PyErr_SetFromErrnoWithFilenameObjects", scope: !1, file: !1, line: 417, type: !160, isLocal: false, isDefinition: true, scopeLine: 418, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @PyErr_SetFromErrnoWithFilenameObjects, variables: !673)
!673 = !{!674, !675, !676, !677, !678, !679, !680, !681, !684, !686, !690}
!674 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !672, file: !1, line: 417, type: !29)
!675 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filenameObject", arg: 2, scope: !672, file: !1, line: 417, type: !29)
!676 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filenameObject2", arg: 3, scope: !672, file: !1, line: 417, type: !29)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "message", scope: !672, file: !1, line: 419, type: !29)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !672, file: !1, line: 420, type: !29)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !672, file: !1, line: 420, type: !29)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !672, file: !1, line: 421, type: !68)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !682, file: !1, line: 433, type: !76)
!682 = distinct !DILexicalBlock(scope: !683, file: !1, line: 432, column: 17)
!683 = distinct !DILexicalBlock(scope: !672, file: !1, line: 432, column: 9)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !685, file: !1, line: 498, type: !29)
!685 = distinct !DILexicalBlock(scope: !672, file: !1, line: 498, column: 5)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !687, file: !1, line: 502, type: !29)
!687 = distinct !DILexicalBlock(scope: !688, file: !1, line: 502, column: 9)
!688 = distinct !DILexicalBlock(scope: !689, file: !1, line: 500, column: 23)
!689 = distinct !DILexicalBlock(scope: !672, file: !1, line: 500, column: 9)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !691, file: !1, line: 505, type: !29)
!691 = distinct !DILexicalBlock(scope: !692, file: !1, line: 505, column: 13)
!692 = distinct !DILexicalBlock(scope: !693, file: !1, line: 503, column: 24)
!693 = distinct !DILexicalBlock(scope: !688, file: !1, line: 503, column: 13)
!694 = !DISubprogram(name: "PyErr_SetFromErrnoWithFilename", scope: !1, file: !1, line: 515, type: !695, isLocal: false, isDefinition: true, scopeLine: 516, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*)* @PyErr_SetFromErrnoWithFilename, variables: !697)
!695 = !DISubroutineType(types: !696)
!696 = !{!29, !29, !53}
!697 = !{!698, !699, !700, !701, !702, !704}
!698 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !694, file: !1, line: 515, type: !29)
!699 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 2, scope: !694, file: !1, line: 515, type: !53)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !694, file: !1, line: 517, type: !29)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !694, file: !1, line: 518, type: !29)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !703, file: !1, line: 519, type: !29)
!703 = distinct !DILexicalBlock(scope: !694, file: !1, line: 519, column: 5)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !705, file: !1, line: 519, type: !29)
!705 = distinct !DILexicalBlock(scope: !706, file: !1, line: 519, column: 5)
!706 = distinct !DILexicalBlock(scope: !703, file: !1, line: 519, column: 5)
!707 = !DISubprogram(name: "PyErr_SetFromErrno", scope: !1, file: !1, line: 537, type: !141, isLocal: false, isDefinition: true, scopeLine: 538, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyErr_SetFromErrno, variables: !708)
!708 = !{!709}
!709 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !707, file: !1, line: 537, type: !29)
!710 = !DISubprogram(name: "PyErr_SetImportError", scope: !1, file: !1, line: 686, type: !160, isLocal: false, isDefinition: true, scopeLine: 687, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @PyErr_SetImportError, variables: !711)
!711 = !{!712, !713, !714, !715, !716, !717, !718, !722, !726, !728}
!712 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msg", arg: 1, scope: !710, file: !1, line: 686, type: !29)
!713 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !710, file: !1, line: 686, type: !29)
!714 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 3, scope: !710, file: !1, line: 686, type: !29)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !710, file: !1, line: 688, type: !29)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kwargs", scope: !710, file: !1, line: 688, type: !29)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error", scope: !710, file: !1, line: 688, type: !29)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !719, file: !1, line: 699, type: !29)
!719 = distinct !DILexicalBlock(scope: !720, file: !1, line: 699, column: 9)
!720 = distinct !DILexicalBlock(scope: !721, file: !1, line: 698, column: 25)
!721 = distinct !DILexicalBlock(scope: !710, file: !1, line: 698, column: 9)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !723, file: !1, line: 722, type: !29)
!723 = distinct !DILexicalBlock(scope: !724, file: !1, line: 722, column: 9)
!724 = distinct !DILexicalBlock(scope: !725, file: !1, line: 720, column: 24)
!725 = distinct !DILexicalBlock(scope: !710, file: !1, line: 720, column: 9)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !727, file: !1, line: 725, type: !29)
!727 = distinct !DILexicalBlock(scope: !710, file: !1, line: 725, column: 5)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !729, file: !1, line: 726, type: !29)
!729 = distinct !DILexicalBlock(scope: !710, file: !1, line: 726, column: 5)
!730 = !DISubprogram(name: "_PyErr_BadInternalCall", scope: !1, file: !1, line: 732, type: !731, isLocal: false, isDefinition: true, scopeLine: 733, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32)* @_PyErr_BadInternalCall, variables: !733)
!731 = !DISubroutineType(types: !732)
!732 = !{null, !53, !68}
!733 = !{!734, !735}
!734 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !730, file: !1, line: 732, type: !53)
!735 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 2, scope: !730, file: !1, line: 732, type: !68)
!736 = !DISubprogram(name: "PyErr_BadInternalCall", scope: !1, file: !1, line: 743, type: !615, isLocal: false, isDefinition: true, scopeLine: 744, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyErr_BadInternalCall, variables: !617)
!737 = !DISubprogram(name: "PyErr_Format", scope: !1, file: !1, line: 754, type: !738, isLocal: false, isDefinition: true, scopeLine: 755, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*, ...)* @PyErr_Format, variables: !740)
!738 = !DISubroutineType(types: !739)
!739 = !{!29, !29, !53, null}
!740 = !{!741, !742, !743, !756, !757, !759}
!741 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exception", arg: 1, scope: !737, file: !1, line: 754, type: !29)
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 2, scope: !737, file: !1, line: 754, type: !53)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vargs", scope: !737, file: !1, line: 756, type: !744)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !38, line: 79, baseType: !745)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !746, line: 50, baseType: !747)
!746 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stdarg.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 756, baseType: !748)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !749, size: 192, align: 64, elements: !106)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "__va_list_tag", file: !1, line: 756, baseType: !750)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 756, size: 192, align: 64, elements: !751)
!751 = !{!752, !753, !754, !755}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !750, file: !1, line: 756, baseType: !366, size: 32, align: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !750, file: !1, line: 756, baseType: !366, size: 32, align: 32, offset: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !750, file: !1, line: 756, baseType: !114, size: 64, align: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !750, file: !1, line: 756, baseType: !114, size: 64, align: 64, offset: 128)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "string", scope: !737, file: !1, line: 757, type: !29)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !758, file: !1, line: 773, type: !29)
!758 = distinct !DILexicalBlock(scope: !737, file: !1, line: 773, column: 5)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !760, file: !1, line: 773, type: !29)
!760 = distinct !DILexicalBlock(scope: !761, file: !1, line: 773, column: 5)
!761 = distinct !DILexicalBlock(scope: !758, file: !1, line: 773, column: 5)
!762 = !DISubprogram(name: "PyErr_NewException", scope: !1, file: !1, line: 781, type: !763, isLocal: false, isDefinition: true, scopeLine: 782, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct._object*, %struct._object*)* @PyErr_NewException, variables: !765)
!763 = !DISubroutineType(types: !764)
!764 = !{!29, !53, !29, !29}
!765 = !{!766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !777, !780, !782, !785, !787, !790, !792}
!766 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !762, file: !1, line: 781, type: !53)
!767 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 2, scope: !762, file: !1, line: 781, type: !29)
!768 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dict", arg: 3, scope: !762, file: !1, line: 781, type: !29)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dot", scope: !762, file: !1, line: 783, type: !53)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modulename", scope: !762, file: !1, line: 784, type: !29)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "classname", scope: !762, file: !1, line: 785, type: !29)
!772 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mydict", scope: !762, file: !1, line: 786, type: !29)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bases", scope: !762, file: !1, line: 787, type: !29)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !762, file: !1, line: 788, type: !29)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !776, file: !1, line: 823, type: !29)
!776 = distinct !DILexicalBlock(scope: !762, file: !1, line: 823, column: 5)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !778, file: !1, line: 823, type: !29)
!778 = distinct !DILexicalBlock(scope: !779, file: !1, line: 823, column: 5)
!779 = distinct !DILexicalBlock(scope: !776, file: !1, line: 823, column: 5)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !781, file: !1, line: 824, type: !29)
!781 = distinct !DILexicalBlock(scope: !762, file: !1, line: 824, column: 5)
!782 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !783, file: !1, line: 824, type: !29)
!783 = distinct !DILexicalBlock(scope: !784, file: !1, line: 824, column: 5)
!784 = distinct !DILexicalBlock(scope: !781, file: !1, line: 824, column: 5)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !786, file: !1, line: 825, type: !29)
!786 = distinct !DILexicalBlock(scope: !762, file: !1, line: 825, column: 5)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !788, file: !1, line: 825, type: !29)
!788 = distinct !DILexicalBlock(scope: !789, file: !1, line: 825, column: 5)
!789 = distinct !DILexicalBlock(scope: !786, file: !1, line: 825, column: 5)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !791, file: !1, line: 826, type: !29)
!791 = distinct !DILexicalBlock(scope: !762, file: !1, line: 826, column: 5)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !793, file: !1, line: 826, type: !29)
!793 = distinct !DILexicalBlock(scope: !794, file: !1, line: 826, column: 5)
!794 = distinct !DILexicalBlock(scope: !791, file: !1, line: 826, column: 5)
!795 = !DISubprogram(name: "PyErr_NewExceptionWithDoc", scope: !1, file: !1, line: 833, type: !796, isLocal: false, isDefinition: true, scopeLine: 835, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i8*, %struct._object*, %struct._object*)* @PyErr_NewExceptionWithDoc, variables: !798)
!796 = !DISubroutineType(types: !797)
!797 = !{!29, !53, !53, !29, !29}
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806, !807, !811, !813}
!799 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !795, file: !1, line: 833, type: !53)
!800 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "doc", arg: 2, scope: !795, file: !1, line: 833, type: !53)
!801 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 3, scope: !795, file: !1, line: 834, type: !29)
!802 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dict", arg: 4, scope: !795, file: !1, line: 834, type: !29)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !795, file: !1, line: 836, type: !68)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !795, file: !1, line: 837, type: !29)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mydict", scope: !795, file: !1, line: 838, type: !29)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "docobj", scope: !795, file: !1, line: 839, type: !29)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !808, file: !1, line: 853, type: !29)
!808 = distinct !DILexicalBlock(scope: !809, file: !1, line: 853, column: 9)
!809 = distinct !DILexicalBlock(scope: !810, file: !1, line: 848, column: 22)
!810 = distinct !DILexicalBlock(scope: !795, file: !1, line: 848, column: 9)
!811 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !812, file: !1, line: 860, type: !29)
!812 = distinct !DILexicalBlock(scope: !795, file: !1, line: 860, column: 5)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !814, file: !1, line: 860, type: !29)
!814 = distinct !DILexicalBlock(scope: !815, file: !1, line: 860, column: 5)
!815 = distinct !DILexicalBlock(scope: !812, file: !1, line: 860, column: 5)
!816 = !DISubprogram(name: "PyErr_WriteUnraisable", scope: !1, file: !1, line: 868, type: !61, isLocal: false, isDefinition: true, scopeLine: 869, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @PyErr_WriteUnraisable, variables: !817)
!817 = !{!818, !819, !820, !821, !822, !823, !824, !825, !828, !830, !833, !835, !838, !840, !843, !845}
!818 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !816, file: !1, line: 868, type: !29)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !816, file: !1, line: 871, type: !29)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !816, file: !1, line: 871, type: !29)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !816, file: !1, line: 871, type: !29)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !816, file: !1, line: 871, type: !29)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "moduleName", scope: !816, file: !1, line: 872, type: !29)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "className", scope: !816, file: !1, line: 873, type: !76)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dot", scope: !826, file: !1, line: 899, type: !76)
!826 = distinct !DILexicalBlock(scope: !827, file: !1, line: 898, column: 28)
!827 = distinct !DILexicalBlock(scope: !816, file: !1, line: 898, column: 9)
!828 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !829, file: !1, line: 937, type: !29)
!829 = distinct !DILexicalBlock(scope: !816, file: !1, line: 937, column: 5)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !831, file: !1, line: 937, type: !29)
!831 = distinct !DILexicalBlock(scope: !832, file: !1, line: 937, column: 5)
!832 = distinct !DILexicalBlock(scope: !829, file: !1, line: 937, column: 5)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !834, file: !1, line: 938, type: !29)
!834 = distinct !DILexicalBlock(scope: !816, file: !1, line: 938, column: 5)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !836, file: !1, line: 938, type: !29)
!836 = distinct !DILexicalBlock(scope: !837, file: !1, line: 938, column: 5)
!837 = distinct !DILexicalBlock(scope: !834, file: !1, line: 938, column: 5)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !839, file: !1, line: 939, type: !29)
!839 = distinct !DILexicalBlock(scope: !816, file: !1, line: 939, column: 5)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !841, file: !1, line: 939, type: !29)
!841 = distinct !DILexicalBlock(scope: !842, file: !1, line: 939, column: 5)
!842 = distinct !DILexicalBlock(scope: !839, file: !1, line: 939, column: 5)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !844, file: !1, line: 940, type: !29)
!844 = distinct !DILexicalBlock(scope: !816, file: !1, line: 940, column: 5)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !846, file: !1, line: 940, type: !29)
!846 = distinct !DILexicalBlock(scope: !847, file: !1, line: 940, column: 5)
!847 = distinct !DILexicalBlock(scope: !844, file: !1, line: 940, column: 5)
!848 = !DISubprogram(name: "PyErr_SyntaxLocation", scope: !1, file: !1, line: 948, type: !731, isLocal: false, isDefinition: true, scopeLine: 949, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32)* @PyErr_SyntaxLocation, variables: !849)
!849 = !{!850, !851}
!850 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !848, file: !1, line: 948, type: !53)
!851 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 2, scope: !848, file: !1, line: 948, type: !68)
!852 = !DISubprogram(name: "PyErr_SyntaxLocationObject", scope: !1, file: !1, line: 959, type: !853, isLocal: false, isDefinition: true, scopeLine: 960, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, i32, i32)* @PyErr_SyntaxLocationObject, variables: !855)
!853 = !DISubroutineType(types: !854)
!854 = !{null, !29, !68, !68}
!855 = !{!856, !857, !858, !859, !860, !861, !862, !863, !867, !873, !879}
!856 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !852, file: !1, line: 959, type: !29)
!857 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 2, scope: !852, file: !1, line: 959, type: !68)
!858 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "col_offset", arg: 3, scope: !852, file: !1, line: 959, type: !68)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc", scope: !852, file: !1, line: 961, type: !29)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !852, file: !1, line: 961, type: !29)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !852, file: !1, line: 961, type: !29)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !852, file: !1, line: 961, type: !29)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !864, file: !1, line: 980, type: !29)
!864 = distinct !DILexicalBlock(scope: !865, file: !1, line: 980, column: 9)
!865 = distinct !DILexicalBlock(scope: !866, file: !1, line: 977, column: 10)
!866 = distinct !DILexicalBlock(scope: !852, file: !1, line: 975, column: 9)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !868, file: !1, line: 989, type: !29)
!868 = distinct !DILexicalBlock(scope: !869, file: !1, line: 989, column: 13)
!869 = distinct !DILexicalBlock(scope: !870, file: !1, line: 986, column: 14)
!870 = distinct !DILexicalBlock(scope: !871, file: !1, line: 984, column: 13)
!871 = distinct !DILexicalBlock(scope: !872, file: !1, line: 982, column: 26)
!872 = distinct !DILexicalBlock(scope: !852, file: !1, line: 982, column: 9)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !874, file: !1, line: 1000, type: !29)
!874 = distinct !DILexicalBlock(scope: !875, file: !1, line: 1000, column: 13)
!875 = distinct !DILexicalBlock(scope: !876, file: !1, line: 997, column: 18)
!876 = distinct !DILexicalBlock(scope: !877, file: !1, line: 997, column: 13)
!877 = distinct !DILexicalBlock(scope: !878, file: !1, line: 992, column: 27)
!878 = distinct !DILexicalBlock(scope: !852, file: !1, line: 992, column: 9)
!879 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !880, file: !1, line: 1012, type: !29)
!880 = distinct !DILexicalBlock(scope: !881, file: !1, line: 1012, column: 17)
!881 = distinct !DILexicalBlock(scope: !882, file: !1, line: 1009, column: 22)
!882 = distinct !DILexicalBlock(scope: !883, file: !1, line: 1009, column: 17)
!883 = distinct !DILexicalBlock(scope: !884, file: !1, line: 1007, column: 49)
!884 = distinct !DILexicalBlock(scope: !885, file: !1, line: 1007, column: 13)
!885 = distinct !DILexicalBlock(scope: !886, file: !1, line: 1006, column: 35)
!886 = distinct !DILexicalBlock(scope: !852, file: !1, line: 1006, column: 9)
!887 = !DISubprogram(name: "PyErr_SyntaxLocationEx", scope: !1, file: !1, line: 1027, type: !888, isLocal: false, isDefinition: true, scopeLine: 1028, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32, i32)* @PyErr_SyntaxLocationEx, variables: !890)
!888 = !DISubroutineType(types: !889)
!889 = !{null, !53, !68, !68}
!890 = !{!891, !892, !893, !894, !895, !897}
!891 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !887, file: !1, line: 1027, type: !53)
!892 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 2, scope: !887, file: !1, line: 1027, type: !68)
!893 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "col_offset", arg: 3, scope: !887, file: !1, line: 1027, type: !68)
!894 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fileobj", scope: !887, file: !1, line: 1029, type: !29)
!895 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !896, file: !1, line: 1038, type: !29)
!896 = distinct !DILexicalBlock(scope: !887, file: !1, line: 1038, column: 5)
!897 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !898, file: !1, line: 1038, type: !29)
!898 = distinct !DILexicalBlock(scope: !899, file: !1, line: 1038, column: 5)
!899 = distinct !DILexicalBlock(scope: !896, file: !1, line: 1038, column: 5)
!900 = !DISubprogram(name: "PyErr_ProgramText", scope: !1, file: !1, line: 1084, type: !901, isLocal: false, isDefinition: true, scopeLine: 1085, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i32)* @PyErr_ProgramText, variables: !903)
!901 = !DISubroutineType(types: !902)
!902 = !{!29, !53, !68}
!903 = !{!904, !905, !906}
!904 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !900, file: !1, line: 1084, type: !53)
!905 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 2, scope: !900, file: !1, line: 1084, type: !68)
!906 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !900, file: !1, line: 1086, type: !69)
!907 = !DISubprogram(name: "PyErr_ProgramTextObject", scope: !1, file: !1, line: 1094, type: !908, isLocal: false, isDefinition: true, scopeLine: 1095, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i32)* @PyErr_ProgramTextObject, variables: !910)
!908 = !DISubroutineType(types: !909)
!909 = !{!29, !29, !68}
!910 = !{!911, !912, !913}
!911 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !907, file: !1, line: 1094, type: !29)
!912 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 2, scope: !907, file: !1, line: 1094, type: !68)
!913 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !907, file: !1, line: 1096, type: !69)
!914 = !DISubprogram(name: "_Py_ANNOTATE_MEMORY_ORDER", scope: !4, file: !4, line: 59, type: !915, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, variables: !920)
!915 = !DISubroutineType(types: !916)
!916 = !{null, !917, !440}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!919 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!920 = !{!921, !922}
!921 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "address", arg: 1, scope: !914, file: !4, line: 59, type: !917)
!922 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 2, scope: !914, file: !4, line: 59, type: !440)
!923 = !DISubprogram(name: "_Py_atomic_thread_fence", scope: !4, file: !4, line: 51, type: !924, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, variables: !926)
