; ModuleID = 'exceptions.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !488, globals: !1802)
!1 = !DIFile(filename: "Objects/exceptions.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !50, !102, !369, !385, !403, !404, !337, !406, !414, !107, !40, !344, !428, !444, !452, !470, !471, !473, !475, !56, !477, !485}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBaseExceptionObject", file: !13, line: 18, baseType: !14)
!13 = !DIFile(filename: "Include/pyerrors.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!14 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 16, size: 512, align: 64, elements: !15)
!15 = !{!16, !363, !364, !365, !366, !367, !368}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !14, file: !13, line: 17, baseType: !17, size: 128, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !18, line: 109, baseType: !19)
!18 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !18, line: 105, size: 128, align: 64, elements: !20)
!20 = !{!21, !29}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !19, file: !18, line: 107, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !23, line: 177, baseType: !24)
!23 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !25, line: 102, baseType: !26)
!25 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !27, line: 181, baseType: !28)
!27 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!28 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !19, file: !18, line: 108, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !18, line: 334, size: 3200, align: 64, elements: !32)
!32 = !{!33, !39, !43, !44, !45, !51, !115, !120, !125, !126, !131, !183, !214, !226, !232, !233, !234, !236, !238, !269, !270, !271, !280, !281, !286, !287, !289, !291, !301, !311, !329, !330, !331, !333, !335, !336, !338, !343, !348, !353, !354, !355, !356, !357, !358, !359, !360, !362}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !18, line: 335, baseType: !34, size: 192, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !18, line: 114, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 111, size: 192, align: 64, elements: !36)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !35, file: !18, line: 112, baseType: !17, size: 128, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !35, file: !18, line: 113, baseType: !22, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !31, file: !18, line: 336, baseType: !40, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !31, file: !18, line: 337, baseType: !22, size: 64, align: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !31, file: !18, line: 337, baseType: !22, size: 64, align: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !31, file: !18, line: 341, baseType: !46, size: 64, align: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !18, line: 308, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !50}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !31, file: !18, line: 342, baseType: !52, size: 64, align: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !18, line: 314, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !50, !57, !56}
!56 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !25, line: 48, baseType: !59)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 246, size: 1728, align: 64, elements: !61)
!60 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!61 = !{!62, !63, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !83, !84, !85, !86, !88, !90, !92, !96, !99, !101, !103, !104, !105, !106, !110, !111}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !59, file: !60, line: 247, baseType: !56, size: 32, align: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !59, file: !60, line: 252, baseType: !64, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !59, file: !60, line: 253, baseType: !64, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !59, file: !60, line: 254, baseType: !64, size: 64, align: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !59, file: !60, line: 255, baseType: !64, size: 64, align: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !59, file: !60, line: 256, baseType: !64, size: 64, align: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !59, file: !60, line: 257, baseType: !64, size: 64, align: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !59, file: !60, line: 258, baseType: !64, size: 64, align: 64, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !59, file: !60, line: 259, baseType: !64, size: 64, align: 64, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !59, file: !60, line: 261, baseType: !64, size: 64, align: 64, offset: 576)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !59, file: !60, line: 262, baseType: !64, size: 64, align: 64, offset: 640)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !59, file: !60, line: 263, baseType: !64, size: 64, align: 64, offset: 704)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !59, file: !60, line: 265, baseType: !76, size: 64, align: 64, offset: 768)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !60, line: 161, size: 192, align: 64, elements: !78)
!78 = !{!79, !80, !82}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !77, file: !60, line: 162, baseType: !76, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !77, file: !60, line: 163, baseType: !81, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !77, file: !60, line: 167, baseType: !56, size: 32, align: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !59, file: !60, line: 267, baseType: !81, size: 64, align: 64, offset: 832)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !59, file: !60, line: 269, baseType: !56, size: 32, align: 32, offset: 896)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !59, file: !60, line: 273, baseType: !56, size: 32, align: 32, offset: 928)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !59, file: !60, line: 275, baseType: !87, size: 64, align: 64, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !27, line: 140, baseType: !28)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !59, file: !60, line: 279, baseType: !89, size: 16, align: 16, offset: 1024)
!89 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !59, file: !60, line: 280, baseType: !91, size: 8, align: 8, offset: 1040)
!91 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !59, file: !60, line: 281, baseType: !93, size: 8, align: 8, offset: 1048)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 8, align: 8, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 1)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !59, file: !60, line: 285, baseType: !97, size: 64, align: 64, offset: 1088)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !60, line: 155, baseType: null)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !59, file: !60, line: 294, baseType: !100, size: 64, align: 64, offset: 1152)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !27, line: 141, baseType: !28)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !59, file: !60, line: 303, baseType: !102, size: 64, align: 64, offset: 1216)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !59, file: !60, line: 304, baseType: !102, size: 64, align: 64, offset: 1280)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !59, file: !60, line: 305, baseType: !102, size: 64, align: 64, offset: 1344)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !59, file: !60, line: 306, baseType: !102, size: 64, align: 64, offset: 1408)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !59, file: !60, line: 307, baseType: !107, size: 64, align: 64, offset: 1472)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 62, baseType: !109)
!108 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!109 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !59, file: !60, line: 309, baseType: !56, size: 32, align: 32, offset: 1536)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !59, file: !60, line: 311, baseType: !112, size: 160, align: 8, offset: 1568)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 160, align: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 20)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !31, file: !18, line: 343, baseType: !116, size: 64, align: 64, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !18, line: 316, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!50, !50, !64}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !31, file: !18, line: 344, baseType: !121, size: 64, align: 64, offset: 576)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !18, line: 318, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!56, !50, !64, !50}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !31, file: !18, line: 345, baseType: !102, size: 64, align: 64, offset: 640)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !31, file: !18, line: 346, baseType: !127, size: 64, align: 64, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !18, line: 320, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!50, !50}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !31, file: !18, line: 350, baseType: !132, size: 64, align: 64, offset: 768)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !18, line: 278, baseType: !134)
!134 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 236, size: 2176, align: 64, elements: !135)
!135 = !{!136, !141, !142, !143, !144, !145, !150, !152, !153, !154, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !134, file: !18, line: 241, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !18, line: 166, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!50, !50, !50}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !134, file: !18, line: 242, baseType: !137, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !134, file: !18, line: 243, baseType: !137, size: 64, align: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !134, file: !18, line: 244, baseType: !137, size: 64, align: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !134, file: !18, line: 245, baseType: !137, size: 64, align: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !134, file: !18, line: 246, baseType: !146, size: 64, align: 64, offset: 320)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !18, line: 167, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!50, !50, !50, !50}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !134, file: !18, line: 247, baseType: !151, size: 64, align: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !18, line: 165, baseType: !128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !134, file: !18, line: 248, baseType: !151, size: 64, align: 64, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !134, file: !18, line: 249, baseType: !151, size: 64, align: 64, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !134, file: !18, line: 250, baseType: !155, size: 64, align: 64, offset: 576)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !18, line: 168, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!56, !50}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !134, file: !18, line: 251, baseType: !151, size: 64, align: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !134, file: !18, line: 252, baseType: !137, size: 64, align: 64, offset: 704)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !134, file: !18, line: 253, baseType: !137, size: 64, align: 64, offset: 768)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !134, file: !18, line: 254, baseType: !137, size: 64, align: 64, offset: 832)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !134, file: !18, line: 255, baseType: !137, size: 64, align: 64, offset: 896)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !134, file: !18, line: 256, baseType: !137, size: 64, align: 64, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !134, file: !18, line: 257, baseType: !151, size: 64, align: 64, offset: 1024)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !134, file: !18, line: 258, baseType: !102, size: 64, align: 64, offset: 1088)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !134, file: !18, line: 259, baseType: !151, size: 64, align: 64, offset: 1152)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !134, file: !18, line: 261, baseType: !137, size: 64, align: 64, offset: 1216)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !134, file: !18, line: 262, baseType: !137, size: 64, align: 64, offset: 1280)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !134, file: !18, line: 263, baseType: !137, size: 64, align: 64, offset: 1344)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !134, file: !18, line: 264, baseType: !137, size: 64, align: 64, offset: 1408)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !134, file: !18, line: 265, baseType: !146, size: 64, align: 64, offset: 1472)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !134, file: !18, line: 266, baseType: !137, size: 64, align: 64, offset: 1536)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !134, file: !18, line: 267, baseType: !137, size: 64, align: 64, offset: 1600)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !134, file: !18, line: 268, baseType: !137, size: 64, align: 64, offset: 1664)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !134, file: !18, line: 269, baseType: !137, size: 64, align: 64, offset: 1728)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !134, file: !18, line: 270, baseType: !137, size: 64, align: 64, offset: 1792)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !134, file: !18, line: 272, baseType: !137, size: 64, align: 64, offset: 1856)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !134, file: !18, line: 273, baseType: !137, size: 64, align: 64, offset: 1920)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !134, file: !18, line: 274, baseType: !137, size: 64, align: 64, offset: 1984)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !134, file: !18, line: 275, baseType: !137, size: 64, align: 64, offset: 2048)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !134, file: !18, line: 277, baseType: !151, size: 64, align: 64, offset: 2112)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !31, file: !18, line: 351, baseType: !184, size: 64, align: 64, offset: 832)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !18, line: 292, baseType: !186)
!186 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 280, size: 640, align: 64, elements: !187)
!187 = !{!188, !193, !194, !199, !200, !201, !206, !207, !212, !213}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !186, file: !18, line: 281, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !18, line: 169, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!22, !50}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !186, file: !18, line: 282, baseType: !137, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !186, file: !18, line: 283, baseType: !195, size: 64, align: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !18, line: 170, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!50, !50, !22}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !186, file: !18, line: 284, baseType: !195, size: 64, align: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !186, file: !18, line: 285, baseType: !102, size: 64, align: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !186, file: !18, line: 286, baseType: !202, size: 64, align: 64, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !18, line: 172, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!56, !50, !22, !50}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !186, file: !18, line: 287, baseType: !102, size: 64, align: 64, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !186, file: !18, line: 288, baseType: !208, size: 64, align: 64, offset: 448)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !18, line: 231, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!56, !50, !50}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !186, file: !18, line: 290, baseType: !137, size: 64, align: 64, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !186, file: !18, line: 291, baseType: !195, size: 64, align: 64, offset: 576)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !31, file: !18, line: 352, baseType: !215, size: 64, align: 64, offset: 896)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !18, line: 298, baseType: !217)
!217 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 294, size: 192, align: 64, elements: !218)
!218 = !{!219, !220, !221}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !217, file: !18, line: 295, baseType: !189, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !217, file: !18, line: 296, baseType: !137, size: 64, align: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !217, file: !18, line: 297, baseType: !222, size: 64, align: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !18, line: 174, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!56, !50, !50, !50}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !31, file: !18, line: 356, baseType: !227, size: 64, align: 64, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !18, line: 321, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!231, !50}
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !23, line: 186, baseType: !22)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !31, file: !18, line: 357, baseType: !146, size: 64, align: 64, offset: 1024)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !31, file: !18, line: 358, baseType: !127, size: 64, align: 64, offset: 1088)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !31, file: !18, line: 359, baseType: !235, size: 64, align: 64, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !18, line: 317, baseType: !138)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !31, file: !18, line: 360, baseType: !237, size: 64, align: 64, offset: 1216)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !18, line: 319, baseType: !223)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !31, file: !18, line: 363, baseType: !239, size: 64, align: 64, offset: 1280)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !18, line: 304, baseType: !241)
!241 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 301, size: 128, align: 64, elements: !242)
!242 = !{!243, !264}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !241, file: !18, line: 302, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !18, line: 193, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!56, !50, !248, !56}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !18, line: 191, baseType: !250)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !18, line: 178, size: 640, align: 64, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !261, !262, !263}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !250, file: !18, line: 179, baseType: !102, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !250, file: !18, line: 180, baseType: !50, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !250, file: !18, line: 181, baseType: !22, size: 64, align: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !250, file: !18, line: 182, baseType: !22, size: 64, align: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !250, file: !18, line: 184, baseType: !56, size: 32, align: 32, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !250, file: !18, line: 185, baseType: !56, size: 32, align: 32, offset: 288)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !250, file: !18, line: 186, baseType: !64, size: 64, align: 64, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !250, file: !18, line: 187, baseType: !260, size: 64, align: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !250, file: !18, line: 188, baseType: !260, size: 64, align: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !250, file: !18, line: 189, baseType: !260, size: 64, align: 64, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !250, file: !18, line: 190, baseType: !102, size: 64, align: 64, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !241, file: !18, line: 303, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !18, line: 194, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !50, !248}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !31, file: !18, line: 366, baseType: !109, size: 64, align: 64, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !31, file: !18, line: 368, baseType: !40, size: 64, align: 64, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !31, file: !18, line: 372, baseType: !272, size: 64, align: 64, offset: 1472)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !18, line: 233, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!56, !50, !276, !102}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !18, line: 232, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!56, !50, !102}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !31, file: !18, line: 375, baseType: !155, size: 64, align: 64, offset: 1536)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !31, file: !18, line: 379, baseType: !282, size: 64, align: 64, offset: 1600)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !18, line: 322, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!50, !50, !50, !56}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !31, file: !18, line: 382, baseType: !22, size: 64, align: 64, offset: 1664)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !31, file: !18, line: 385, baseType: !288, size: 64, align: 64, offset: 1728)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !18, line: 323, baseType: !128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !31, file: !18, line: 386, baseType: !290, size: 64, align: 64, offset: 1792)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !18, line: 324, baseType: !128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !31, file: !18, line: 389, baseType: !292, size: 64, align: 64, offset: 1856)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !294, line: 40, size: 256, align: 64, elements: !295)
!294 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!295 = !{!296, !297, !299, !300}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !293, file: !294, line: 41, baseType: !40, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !293, file: !294, line: 42, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !294, line: 18, baseType: !138)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !293, file: !294, line: 43, baseType: !56, size: 32, align: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !293, file: !294, line: 45, baseType: !40, size: 64, align: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !31, file: !18, line: 390, baseType: !302, size: 64, align: 64, offset: 1920)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !304, line: 18, size: 320, align: 64, elements: !305)
!304 = !DIFile(filename: "Include/structmember.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!305 = !{!306, !307, !308, !309, !310}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !303, file: !304, line: 19, baseType: !64, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !303, file: !304, line: 20, baseType: !56, size: 32, align: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !303, file: !304, line: 21, baseType: !22, size: 64, align: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !303, file: !304, line: 22, baseType: !56, size: 32, align: 32, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !303, file: !304, line: 23, baseType: !64, size: 64, align: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !31, file: !18, line: 391, baseType: !312, size: 64, align: 64, offset: 1984)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !314, line: 11, size: 320, align: 64, elements: !315)
!314 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!315 = !{!316, !317, !322, !327, !328}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !313, file: !314, line: 12, baseType: !64, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !313, file: !314, line: 13, baseType: !318, size: 64, align: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !314, line: 8, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!50, !50, !102}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !313, file: !314, line: 14, baseType: !323, size: 64, align: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !314, line: 9, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!56, !50, !50, !102}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !313, file: !314, line: 15, baseType: !64, size: 64, align: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !313, file: !314, line: 16, baseType: !102, size: 64, align: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !31, file: !18, line: 392, baseType: !30, size: 64, align: 64, offset: 2048)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !31, file: !18, line: 393, baseType: !50, size: 64, align: 64, offset: 2112)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !31, file: !18, line: 394, baseType: !332, size: 64, align: 64, offset: 2176)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !18, line: 325, baseType: !147)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !31, file: !18, line: 395, baseType: !334, size: 64, align: 64, offset: 2240)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !18, line: 326, baseType: !223)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !31, file: !18, line: 396, baseType: !22, size: 64, align: 64, offset: 2304)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !31, file: !18, line: 397, baseType: !337, size: 64, align: 64, offset: 2368)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !18, line: 327, baseType: !223)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !31, file: !18, line: 398, baseType: !339, size: 64, align: 64, offset: 2432)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !18, line: 329, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!50, !30, !22}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !31, file: !18, line: 399, baseType: !344, size: 64, align: 64, offset: 2496)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !18, line: 328, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!50, !30, !50, !50}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !31, file: !18, line: 400, baseType: !349, size: 64, align: 64, offset: 2560)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !18, line: 307, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !102}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !31, file: !18, line: 401, baseType: !155, size: 64, align: 64, offset: 2624)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !31, file: !18, line: 402, baseType: !50, size: 64, align: 64, offset: 2688)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !31, file: !18, line: 403, baseType: !50, size: 64, align: 64, offset: 2752)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !31, file: !18, line: 404, baseType: !50, size: 64, align: 64, offset: 2816)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !31, file: !18, line: 405, baseType: !50, size: 64, align: 64, offset: 2880)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !31, file: !18, line: 406, baseType: !50, size: 64, align: 64, offset: 2944)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !31, file: !18, line: 407, baseType: !46, size: 64, align: 64, offset: 3008)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !31, file: !18, line: 410, baseType: !361, size: 32, align: 32, offset: 3072)
!361 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !31, file: !18, line: 412, baseType: !46, size: 64, align: 64, offset: 3136)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !14, file: !13, line: 17, baseType: !50, size: 64, align: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !14, file: !13, line: 17, baseType: !50, size: 64, align: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !14, file: !13, line: 17, baseType: !50, size: 64, align: 64, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !14, file: !13, line: 17, baseType: !50, size: 64, align: 64, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !14, file: !13, line: 17, baseType: !50, size: 64, align: 64, offset: 384)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !14, file: !13, line: 17, baseType: !42, size: 8, align: 8, offset: 448)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeErrorObject", file: !13, line: 44, baseType: !371)
!371 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 37, size: 832, align: 64, elements: !372)
!372 = !{!373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !371, file: !13, line: 38, baseType: !17, size: 128, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !371, file: !13, line: 38, baseType: !50, size: 64, align: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !371, file: !13, line: 38, baseType: !50, size: 64, align: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !371, file: !13, line: 38, baseType: !50, size: 64, align: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !371, file: !13, line: 38, baseType: !50, size: 64, align: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !371, file: !13, line: 38, baseType: !50, size: 64, align: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !371, file: !13, line: 38, baseType: !42, size: 8, align: 8, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !371, file: !13, line: 39, baseType: !50, size: 64, align: 64, offset: 512)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !371, file: !13, line: 40, baseType: !50, size: 64, align: 64, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !371, file: !13, line: 41, baseType: !22, size: 64, align: 64, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !371, file: !13, line: 42, baseType: !22, size: 64, align: 64, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !371, file: !13, line: 43, baseType: !50, size: 64, align: 64, offset: 768)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !387)
!387 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !388)
!388 = !{!389, !390, !391, !392, !400}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !387, file: !4, line: 291, baseType: !17, size: 128, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !387, file: !4, line: 292, baseType: !22, size: 64, align: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !387, file: !4, line: 293, baseType: !231, size: 64, align: 64, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !387, file: !4, line: 349, baseType: !393, size: 32, align: 32, offset: 256)
!393 = !DICompositeType(tag: DW_TAG_structure_type, scope: !387, file: !4, line: 294, size: 32, align: 32, elements: !394)
!394 = !{!395, !396, !397, !398, !399}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !393, file: !4, line: 303, baseType: !361, size: 2, align: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !393, file: !4, line: 331, baseType: !361, size: 3, align: 32, offset: 2)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !393, file: !4, line: 336, baseType: !361, size: 1, align: 32, offset: 5)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !393, file: !4, line: 340, baseType: !361, size: 1, align: 32, offset: 6)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !393, file: !4, line: 345, baseType: !361, size: 1, align: 32, offset: 7)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !387, file: !4, line: 350, baseType: !401, size: 64, align: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !108, line: 90, baseType: !56)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !18, line: 422, baseType: !31)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !408, line: 33, baseType: !409)
!408 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!409 = !DICompositeType(tag: DW_TAG_structure_type, file: !408, line: 25, size: 256, align: 64, elements: !410)
!410 = !{!411, !412}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !409, file: !408, line: 26, baseType: !34, size: 192, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !409, file: !408, line: 27, baseType: !413, size: 64, align: 64, offset: 192)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 64, align: 64, elements: !94)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !416, line: 253, baseType: !417)
!416 = !DIFile(filename: "Include/objimpl.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!417 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !416, line: 246, size: 192, align: 64, elements: !418)
!418 = !{!419, !426}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !417, file: !416, line: 251, baseType: !420, size: 192, align: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, scope: !417, file: !416, line: 247, size: 192, align: 64, elements: !421)
!421 = !{!422, !424, !425}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !420, file: !416, line: 248, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !420, file: !416, line: 249, baseType: !423, size: 64, align: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !420, file: !416, line: 250, baseType: !22, size: 64, align: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !417, file: !416, line: 252, baseType: !427, size: 64, align: 64)
!427 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyOSErrorObject", file: !13, line: 61, baseType: !430)
!430 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 51, size: 832, align: 64, elements: !431)
!431 = !{!432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !430, file: !13, line: 52, baseType: !17, size: 128, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !430, file: !13, line: 52, baseType: !50, size: 64, align: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !430, file: !13, line: 52, baseType: !50, size: 64, align: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !430, file: !13, line: 52, baseType: !50, size: 64, align: 64, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !430, file: !13, line: 52, baseType: !50, size: 64, align: 64, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !430, file: !13, line: 52, baseType: !50, size: 64, align: 64, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !430, file: !13, line: 52, baseType: !42, size: 8, align: 8, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "myerrno", scope: !430, file: !13, line: 53, baseType: !50, size: 64, align: 64, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "strerror", scope: !430, file: !13, line: 54, baseType: !50, size: 64, align: 64, offset: 576)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !430, file: !13, line: 55, baseType: !50, size: 64, align: 64, offset: 640)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "filename2", scope: !430, file: !13, line: 56, baseType: !50, size: 64, align: 64, offset: 704)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !430, file: !13, line: 60, baseType: !22, size: 64, align: 64, offset: 768)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !446)
!446 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !447)
!447 = !{!448, !449, !450, !451}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !446, file: !4, line: 357, baseType: !386, size: 384, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !446, file: !4, line: 358, baseType: !22, size: 64, align: 64, offset: 384)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !446, file: !4, line: 360, baseType: !64, size: 64, align: 64, offset: 448)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !446, file: !4, line: 361, baseType: !22, size: 64, align: 64, offset: 512)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !454)
!454 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !455)
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !454, file: !4, line: 369, baseType: !445, size: 576, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !454, file: !4, line: 375, baseType: !458, size: 64, align: 64, offset: 576)
!458 = !DICompositeType(tag: DW_TAG_union_type, scope: !454, file: !4, line: 370, size: 64, align: 64, elements: !459)
!459 = !{!460, !461, !465, !468}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !458, file: !4, line: 371, baseType: !102, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !458, file: !4, line: 372, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !464)
!464 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !458, file: !4, line: 373, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !89)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !458, file: !4, line: 374, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !361)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !463)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !470)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !479, line: 41, baseType: !480)
!479 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!480 = !DICompositeType(tag: DW_TAG_structure_type, file: !479, line: 31, size: 320, align: 64, elements: !481)
!481 = !{!482, !483, !484}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !480, file: !479, line: 32, baseType: !34, size: 192, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !480, file: !479, line: 33, baseType: !231, size: 64, align: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !480, file: !479, line: 34, baseType: !93, size: 8, align: 8, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!488 = !{!489, !495, !499, !505, !517, !523, !533, !536, !539, !542, !545, !548, !558, !566, !570, !576, !580, !584, !592, !600, !604, !608, !612, !616, !619, !622, !625, !631, !635, !639, !652, !662, !671, !679, !780, !796, !843, !856, !863, !870, !873, !900, !935, !938, !945, !949, !952, !963, !966, !970, !974, !978, !982, !1001, !1012, !1023, !1038, !1057, !1068, !1079, !1093, !1114, !1119, !1138, !1161, !1197, !1204, !1209, !1232, !1261, !1272, !1278, !1286, !1302, !1307, !1320, !1351, !1383, !1407, !1421, !1429, !1460, !1501, !1550, !1553, !1559, !1563, !1576, !1583, !1604, !1623, !1646, !1670, !1690, !1716, !1731, !1750, !1755, !1763, !1775, !1785, !1798}
!489 = !DISubprogram(name: "PyException_GetTraceback", scope: !1, file: !1, line: 312, type: !129, isLocal: false, isDefinition: true, scopeLine: 312, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyException_GetTraceback, variables: !490)
!490 = !{!491, !492, !493}
!491 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !489, file: !1, line: 312, type: !50)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base_self", scope: !489, file: !1, line: 313, type: !11)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !494, file: !1, line: 314, type: !50)
!494 = distinct !DILexicalBlock(scope: !489, file: !1, line: 314, column: 5)
!495 = !DISubprogram(name: "PyException_SetTraceback", scope: !1, file: !1, line: 320, type: !210, isLocal: false, isDefinition: true, scopeLine: 320, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*)* @PyException_SetTraceback, variables: !496)
!496 = !{!497, !498}
!497 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !495, file: !1, line: 320, type: !50)
!498 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tb", arg: 2, scope: !495, file: !1, line: 320, type: !50)
!499 = !DISubprogram(name: "PyException_GetCause", scope: !1, file: !1, line: 325, type: !129, isLocal: false, isDefinition: true, scopeLine: 325, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyException_GetCause, variables: !500)
!500 = !{!501, !502, !503}
!501 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !499, file: !1, line: 325, type: !50)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cause", scope: !499, file: !1, line: 326, type: !50)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !504, file: !1, line: 327, type: !50)
!504 = distinct !DILexicalBlock(scope: !499, file: !1, line: 327, column: 5)
!505 = !DISubprogram(name: "PyException_SetCause", scope: !1, file: !1, line: 333, type: !506, isLocal: false, isDefinition: true, scopeLine: 333, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, %struct._object*)* @PyException_SetCause, variables: !508)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !50, !50}
!508 = !{!509, !510, !511, !512, !514}
!509 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !505, file: !1, line: 333, type: !50)
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cause", arg: 2, scope: !505, file: !1, line: 333, type: !50)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_cause", scope: !505, file: !1, line: 334, type: !50)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !513, file: !1, line: 337, type: !50)
!513 = distinct !DILexicalBlock(scope: !505, file: !1, line: 337, column: 5)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !515, file: !1, line: 337, type: !50)
!515 = distinct !DILexicalBlock(scope: !516, file: !1, line: 337, column: 5)
!516 = distinct !DILexicalBlock(scope: !513, file: !1, line: 337, column: 5)
!517 = !DISubprogram(name: "PyException_GetContext", scope: !1, file: !1, line: 341, type: !129, isLocal: false, isDefinition: true, scopeLine: 341, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyException_GetContext, variables: !518)
!518 = !{!519, !520, !521}
!519 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !517, file: !1, line: 341, type: !50)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "context", scope: !517, file: !1, line: 342, type: !50)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !522, file: !1, line: 343, type: !50)
!522 = distinct !DILexicalBlock(scope: !517, file: !1, line: 343, column: 5)
!523 = !DISubprogram(name: "PyException_SetContext", scope: !1, file: !1, line: 349, type: !506, isLocal: false, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, %struct._object*)* @PyException_SetContext, variables: !524)
!524 = !{!525, !526, !527, !528, !530}
!525 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !523, file: !1, line: 349, type: !50)
!526 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "context", arg: 2, scope: !523, file: !1, line: 349, type: !50)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_context", scope: !523, file: !1, line: 350, type: !50)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !529, file: !1, line: 352, type: !50)
!529 = distinct !DILexicalBlock(scope: !523, file: !1, line: 352, column: 5)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !531, file: !1, line: 352, type: !50)
!531 = distinct !DILexicalBlock(scope: !532, file: !1, line: 352, column: 5)
!532 = distinct !DILexicalBlock(scope: !529, file: !1, line: 352, column: 5)
!533 = !DISubprogram(name: "PyUnicodeEncodeError_GetEncoding", scope: !1, file: !1, line: 1542, type: !129, isLocal: false, isDefinition: true, scopeLine: 1543, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyUnicodeEncodeError_GetEncoding, variables: !534)
!534 = !{!535}
!535 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !533, file: !1, line: 1542, type: !50)
!536 = !DISubprogram(name: "PyUnicodeDecodeError_GetEncoding", scope: !1, file: !1, line: 1548, type: !129, isLocal: false, isDefinition: true, scopeLine: 1549, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyUnicodeDecodeError_GetEncoding, variables: !537)
!537 = !{!538}
!538 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !536, file: !1, line: 1548, type: !50)
!539 = !DISubprogram(name: "PyUnicodeEncodeError_GetObject", scope: !1, file: !1, line: 1554, type: !129, isLocal: false, isDefinition: true, scopeLine: 1555, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyUnicodeEncodeError_GetObject, variables: !540)
!540 = !{!541}
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !539, file: !1, line: 1554, type: !50)
!542 = !DISubprogram(name: "PyUnicodeDecodeError_GetObject", scope: !1, file: !1, line: 1560, type: !129, isLocal: false, isDefinition: true, scopeLine: 1561, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyUnicodeDecodeError_GetObject, variables: !543)
!543 = !{!544}
!544 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !542, file: !1, line: 1560, type: !50)
!545 = !DISubprogram(name: "PyUnicodeTranslateError_GetObject", scope: !1, file: !1, line: 1566, type: !129, isLocal: false, isDefinition: true, scopeLine: 1567, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyUnicodeTranslateError_GetObject, variables: !546)
!546 = !{!547}
!547 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !545, file: !1, line: 1566, type: !50)
!548 = !DISubprogram(name: "PyUnicodeEncodeError_GetStart", scope: !1, file: !1, line: 1572, type: !549, isLocal: false, isDefinition: true, scopeLine: 1573, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64*)* @PyUnicodeEncodeError_GetStart, variables: !551)
!549 = !DISubroutineType(types: !550)
!550 = !{!56, !50, !260}
!551 = !{!552, !553, !554, !555, !556}
!552 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !548, file: !1, line: 1572, type: !50)
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !548, file: !1, line: 1572, type: !260)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !548, file: !1, line: 1574, type: !22)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !548, file: !1, line: 1575, type: !50)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !557, file: !1, line: 1585, type: !50)
!557 = distinct !DILexicalBlock(scope: !548, file: !1, line: 1585, column: 5)
!558 = !DISubprogram(name: "PyUnicodeDecodeError_GetStart", scope: !1, file: !1, line: 1591, type: !549, isLocal: false, isDefinition: true, scopeLine: 1592, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64*)* @PyUnicodeDecodeError_GetStart, variables: !559)
!559 = !{!560, !561, !562, !563, !564}
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !558, file: !1, line: 1591, type: !50)
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !558, file: !1, line: 1591, type: !260)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !558, file: !1, line: 1593, type: !22)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !558, file: !1, line: 1594, type: !50)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !565, file: !1, line: 1603, type: !50)
!565 = distinct !DILexicalBlock(scope: !558, file: !1, line: 1603, column: 5)
!566 = !DISubprogram(name: "PyUnicodeTranslateError_GetStart", scope: !1, file: !1, line: 1609, type: !549, isLocal: false, isDefinition: true, scopeLine: 1610, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64*)* @PyUnicodeTranslateError_GetStart, variables: !567)
!567 = !{!568, !569}
!568 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !566, file: !1, line: 1609, type: !50)
!569 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !566, file: !1, line: 1609, type: !260)
!570 = !DISubprogram(name: "PyUnicodeEncodeError_SetStart", scope: !1, file: !1, line: 1616, type: !571, isLocal: false, isDefinition: true, scopeLine: 1617, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64)* @PyUnicodeEncodeError_SetStart, variables: !573)
!571 = !DISubroutineType(types: !572)
!572 = !{!56, !50, !22}
!573 = !{!574, !575}
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !570, file: !1, line: 1616, type: !50)
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !570, file: !1, line: 1616, type: !22)
!576 = !DISubprogram(name: "PyUnicodeDecodeError_SetStart", scope: !1, file: !1, line: 1624, type: !571, isLocal: false, isDefinition: true, scopeLine: 1625, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64)* @PyUnicodeDecodeError_SetStart, variables: !577)
!577 = !{!578, !579}
!578 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !576, file: !1, line: 1624, type: !50)
!579 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !576, file: !1, line: 1624, type: !22)
!580 = !DISubprogram(name: "PyUnicodeTranslateError_SetStart", scope: !1, file: !1, line: 1632, type: !571, isLocal: false, isDefinition: true, scopeLine: 1633, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64)* @PyUnicodeTranslateError_SetStart, variables: !581)
!581 = !{!582, !583}
!582 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !580, file: !1, line: 1632, type: !50)
!583 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !580, file: !1, line: 1632, type: !22)
!584 = !DISubprogram(name: "PyUnicodeEncodeError_GetEnd", scope: !1, file: !1, line: 1640, type: !549, isLocal: false, isDefinition: true, scopeLine: 1641, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64*)* @PyUnicodeEncodeError_GetEnd, variables: !585)
!585 = !{!586, !587, !588, !589, !590}
!586 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !584, file: !1, line: 1640, type: !50)
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 2, scope: !584, file: !1, line: 1640, type: !260)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !584, file: !1, line: 1642, type: !22)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !584, file: !1, line: 1643, type: !50)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !591, file: !1, line: 1653, type: !50)
!591 = distinct !DILexicalBlock(scope: !584, file: !1, line: 1653, column: 5)
!592 = !DISubprogram(name: "PyUnicodeDecodeError_GetEnd", scope: !1, file: !1, line: 1659, type: !549, isLocal: false, isDefinition: true, scopeLine: 1660, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64*)* @PyUnicodeDecodeError_GetEnd, variables: !593)
!593 = !{!594, !595, !596, !597, !598}
!594 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !592, file: !1, line: 1659, type: !50)
!595 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 2, scope: !592, file: !1, line: 1659, type: !260)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !592, file: !1, line: 1661, type: !22)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !592, file: !1, line: 1662, type: !50)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !599, file: !1, line: 1671, type: !50)
!599 = distinct !DILexicalBlock(scope: !592, file: !1, line: 1671, column: 5)
!600 = !DISubprogram(name: "PyUnicodeTranslateError_GetEnd", scope: !1, file: !1, line: 1677, type: !549, isLocal: false, isDefinition: true, scopeLine: 1678, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64*)* @PyUnicodeTranslateError_GetEnd, variables: !601)
!601 = !{!602, !603}
!602 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !600, file: !1, line: 1677, type: !50)
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !600, file: !1, line: 1677, type: !260)
!604 = !DISubprogram(name: "PyUnicodeEncodeError_SetEnd", scope: !1, file: !1, line: 1684, type: !571, isLocal: false, isDefinition: true, scopeLine: 1685, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64)* @PyUnicodeEncodeError_SetEnd, variables: !605)
!605 = !{!606, !607}
!606 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !604, file: !1, line: 1684, type: !50)
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 2, scope: !604, file: !1, line: 1684, type: !22)
!608 = !DISubprogram(name: "PyUnicodeDecodeError_SetEnd", scope: !1, file: !1, line: 1692, type: !571, isLocal: false, isDefinition: true, scopeLine: 1693, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64)* @PyUnicodeDecodeError_SetEnd, variables: !609)
!609 = !{!610, !611}
!610 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !608, file: !1, line: 1692, type: !50)
!611 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 2, scope: !608, file: !1, line: 1692, type: !22)
!612 = !DISubprogram(name: "PyUnicodeTranslateError_SetEnd", scope: !1, file: !1, line: 1700, type: !571, isLocal: false, isDefinition: true, scopeLine: 1701, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64)* @PyUnicodeTranslateError_SetEnd, variables: !613)
!613 = !{!614, !615}
!614 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !612, file: !1, line: 1700, type: !50)
!615 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 2, scope: !612, file: !1, line: 1700, type: !22)
!616 = !DISubprogram(name: "PyUnicodeEncodeError_GetReason", scope: !1, file: !1, line: 1707, type: !129, isLocal: false, isDefinition: true, scopeLine: 1708, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyUnicodeEncodeError_GetReason, variables: !617)
!617 = !{!618}
!618 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !616, file: !1, line: 1707, type: !50)
!619 = !DISubprogram(name: "PyUnicodeDecodeError_GetReason", scope: !1, file: !1, line: 1714, type: !129, isLocal: false, isDefinition: true, scopeLine: 1715, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyUnicodeDecodeError_GetReason, variables: !620)
!620 = !{!621}
!621 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !619, file: !1, line: 1714, type: !50)
!622 = !DISubprogram(name: "PyUnicodeTranslateError_GetReason", scope: !1, file: !1, line: 1721, type: !129, isLocal: false, isDefinition: true, scopeLine: 1722, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyUnicodeTranslateError_GetReason, variables: !623)
!623 = !{!624}
!624 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !622, file: !1, line: 1721, type: !50)
!625 = !DISubprogram(name: "PyUnicodeEncodeError_SetReason", scope: !1, file: !1, line: 1728, type: !626, isLocal: false, isDefinition: true, scopeLine: 1729, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*)* @PyUnicodeEncodeError_SetReason, variables: !628)
!626 = !DISubroutineType(types: !627)
!627 = !{!56, !50, !40}
!628 = !{!629, !630}
!629 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !625, file: !1, line: 1728, type: !50)
!630 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "reason", arg: 2, scope: !625, file: !1, line: 1728, type: !40)
!631 = !DISubprogram(name: "PyUnicodeDecodeError_SetReason", scope: !1, file: !1, line: 1736, type: !626, isLocal: false, isDefinition: true, scopeLine: 1737, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*)* @PyUnicodeDecodeError_SetReason, variables: !632)
!632 = !{!633, !634}
!633 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !631, file: !1, line: 1736, type: !50)
!634 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "reason", arg: 2, scope: !631, file: !1, line: 1736, type: !40)
!635 = !DISubprogram(name: "PyUnicodeTranslateError_SetReason", scope: !1, file: !1, line: 1744, type: !626, isLocal: false, isDefinition: true, scopeLine: 1745, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*)* @PyUnicodeTranslateError_SetReason, variables: !636)
!636 = !{!637, !638}
!637 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !635, file: !1, line: 1744, type: !50)
!638 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "reason", arg: 2, scope: !635, file: !1, line: 1744, type: !40)
!639 = !DISubprogram(name: "PyUnicodeEncodeError_Create", scope: !1, file: !1, line: 1898, type: !640, isLocal: false, isDefinition: true, scopeLine: 1901, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i32*, i64, i64, i64, i8*)* @PyUnicodeEncodeError_Create, variables: !645)
!640 = !DISubroutineType(types: !641)
!641 = !{!50, !40, !642, !22, !22, !22, !40}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UNICODE", file: !4, line: 93, baseType: !402)
!645 = !{!646, !647, !648, !649, !650, !651}
!646 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !639, file: !1, line: 1899, type: !40)
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 2, scope: !639, file: !1, line: 1899, type: !642)
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 3, scope: !639, file: !1, line: 1899, type: !22)
!649 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 4, scope: !639, file: !1, line: 1900, type: !22)
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 5, scope: !639, file: !1, line: 1900, type: !22)
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "reason", arg: 6, scope: !639, file: !1, line: 1900, type: !40)
!652 = !DISubprogram(name: "PyUnicodeDecodeError_Create", scope: !1, file: !1, line: 2014, type: !653, isLocal: false, isDefinition: true, scopeLine: 2017, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i8*, i64, i64, i64, i8*)* @PyUnicodeDecodeError_Create, variables: !655)
!653 = !DISubroutineType(types: !654)
!654 = !{!50, !40, !40, !22, !22, !22, !40}
!655 = !{!656, !657, !658, !659, !660, !661}
!656 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !652, file: !1, line: 2015, type: !40)
!657 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 2, scope: !652, file: !1, line: 2015, type: !40)
!658 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 3, scope: !652, file: !1, line: 2015, type: !22)
!659 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 4, scope: !652, file: !1, line: 2016, type: !22)
!660 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 5, scope: !652, file: !1, line: 2016, type: !22)
!661 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "reason", arg: 6, scope: !652, file: !1, line: 2016, type: !40)
!662 = !DISubprogram(name: "PyUnicodeTranslateError_Create", scope: !1, file: !1, line: 2114, type: !663, isLocal: false, isDefinition: true, scopeLine: 2117, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32*, i64, i64, i64, i8*)* @PyUnicodeTranslateError_Create, variables: !665)
!663 = !DISubroutineType(types: !664)
!664 = !{!50, !642, !22, !22, !22, !40}
!665 = !{!666, !667, !668, !669, !670}
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !662, file: !1, line: 2115, type: !642)
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 2, scope: !662, file: !1, line: 2115, type: !22)
!668 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 3, scope: !662, file: !1, line: 2116, type: !22)
!669 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 4, scope: !662, file: !1, line: 2116, type: !22)
!670 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "reason", arg: 5, scope: !662, file: !1, line: 2116, type: !40)
!671 = !DISubprogram(name: "_PyUnicodeTranslateError_Create", scope: !1, file: !1, line: 2123, type: !672, isLocal: false, isDefinition: true, scopeLine: 2126, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i64, i64, i8*)* @_PyUnicodeTranslateError_Create, variables: !674)
!672 = !DISubroutineType(types: !673)
!673 = !{!50, !50, !22, !22, !40}
!674 = !{!675, !676, !677, !678}
!675 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !671, file: !1, line: 2124, type: !50)
!676 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !671, file: !1, line: 2125, type: !22)
!677 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 3, scope: !671, file: !1, line: 2125, type: !22)
!678 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "reason", arg: 4, scope: !671, file: !1, line: 2125, type: !40)
!679 = !DISubprogram(name: "_PyExc_Init", scope: !1, file: !1, line: 2450, type: !48, isLocal: false, isDefinition: true, scopeLine: 2451, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @_PyExc_Init, variables: !680)
!680 = !{!681, !682, !683, !685, !688, !690, !693, !695, !697, !699, !701, !703, !705, !707, !709, !711, !713, !715, !717, !719, !721, !723, !725, !727, !729, !731, !733, !735, !737, !739, !741, !743, !745, !747, !749, !751, !753, !755, !757, !759, !761, !763, !765, !767, !769, !774, !775, !776, !778}
!681 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bltinmod", arg: 1, scope: !679, file: !1, line: 2450, type: !50)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bdict", scope: !679, file: !1, line: 2452, type: !50)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !684, file: !1, line: 2533, type: !50)
!684 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2533, column: 5)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !686, file: !1, line: 2533, type: !50)
!686 = distinct !DILexicalBlock(scope: !687, file: !1, line: 2533, column: 5)
!687 = distinct !DILexicalBlock(scope: !684, file: !1, line: 2533, column: 5)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !689, file: !1, line: 2534, type: !50)
!689 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2534, column: 5)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !691, file: !1, line: 2534, type: !50)
!691 = distinct !DILexicalBlock(scope: !692, file: !1, line: 2534, column: 5)
!692 = distinct !DILexicalBlock(scope: !689, file: !1, line: 2534, column: 5)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !694, file: !1, line: 2587, type: !50)
!694 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2587, column: 5)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !696, file: !1, line: 2587, type: !50)
!696 = distinct !DILexicalBlock(scope: !694, file: !1, line: 2587, column: 5)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !698, file: !1, line: 2588, type: !50)
!698 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2588, column: 5)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !700, file: !1, line: 2588, type: !50)
!700 = distinct !DILexicalBlock(scope: !698, file: !1, line: 2588, column: 5)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !702, file: !1, line: 2589, type: !50)
!702 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2589, column: 5)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !704, file: !1, line: 2589, type: !50)
!704 = distinct !DILexicalBlock(scope: !702, file: !1, line: 2589, column: 5)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !706, file: !1, line: 2590, type: !50)
!706 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2590, column: 5)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !708, file: !1, line: 2590, type: !50)
!708 = distinct !DILexicalBlock(scope: !706, file: !1, line: 2590, column: 5)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !710, file: !1, line: 2592, type: !50)
!710 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2592, column: 5)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !712, file: !1, line: 2592, type: !50)
!712 = distinct !DILexicalBlock(scope: !710, file: !1, line: 2592, column: 5)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !714, file: !1, line: 2593, type: !50)
!714 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2593, column: 5)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !716, file: !1, line: 2593, type: !50)
!716 = distinct !DILexicalBlock(scope: !714, file: !1, line: 2593, column: 5)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !718, file: !1, line: 2595, type: !50)
!718 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2595, column: 5)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !720, file: !1, line: 2595, type: !50)
!720 = distinct !DILexicalBlock(scope: !718, file: !1, line: 2595, column: 5)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !722, file: !1, line: 2597, type: !50)
!722 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2597, column: 5)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !724, file: !1, line: 2597, type: !50)
!724 = distinct !DILexicalBlock(scope: !722, file: !1, line: 2597, column: 5)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !726, file: !1, line: 2599, type: !50)
!726 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2599, column: 5)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !728, file: !1, line: 2599, type: !50)
!728 = distinct !DILexicalBlock(scope: !726, file: !1, line: 2599, column: 5)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !730, file: !1, line: 2601, type: !50)
!730 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2601, column: 5)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !732, file: !1, line: 2601, type: !50)
!732 = distinct !DILexicalBlock(scope: !730, file: !1, line: 2601, column: 5)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !734, file: !1, line: 2603, type: !50)
!734 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2603, column: 5)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !736, file: !1, line: 2603, type: !50)
!736 = distinct !DILexicalBlock(scope: !734, file: !1, line: 2603, column: 5)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !738, file: !1, line: 2605, type: !50)
!738 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2605, column: 5)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !740, file: !1, line: 2605, type: !50)
!740 = distinct !DILexicalBlock(scope: !738, file: !1, line: 2605, column: 5)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !742, file: !1, line: 2607, type: !50)
!742 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2607, column: 5)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !744, file: !1, line: 2607, type: !50)
!744 = distinct !DILexicalBlock(scope: !742, file: !1, line: 2607, column: 5)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !746, file: !1, line: 2609, type: !50)
!746 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2609, column: 5)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !748, file: !1, line: 2609, type: !50)
!748 = distinct !DILexicalBlock(scope: !746, file: !1, line: 2609, column: 5)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !750, file: !1, line: 2611, type: !50)
!750 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2611, column: 5)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !752, file: !1, line: 2611, type: !50)
!752 = distinct !DILexicalBlock(scope: !750, file: !1, line: 2611, column: 5)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !754, file: !1, line: 2613, type: !50)
!754 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2613, column: 5)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !756, file: !1, line: 2613, type: !50)
!756 = distinct !DILexicalBlock(scope: !754, file: !1, line: 2613, column: 5)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !758, file: !1, line: 2614, type: !50)
!758 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2614, column: 5)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !760, file: !1, line: 2614, type: !50)
!760 = distinct !DILexicalBlock(scope: !758, file: !1, line: 2614, column: 5)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !762, file: !1, line: 2616, type: !50)
!762 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2616, column: 5)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !764, file: !1, line: 2616, type: !50)
!764 = distinct !DILexicalBlock(scope: !762, file: !1, line: 2616, column: 5)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !766, file: !1, line: 2618, type: !50)
!766 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2618, column: 5)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !768, file: !1, line: 2618, type: !50)
!768 = distinct !DILexicalBlock(scope: !766, file: !1, line: 2618, column: 5)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err_inst", scope: !770, file: !1, line: 2628, type: !11)
!770 = distinct !DILexicalBlock(scope: !771, file: !1, line: 2627, column: 14)
!771 = distinct !DILexicalBlock(scope: !772, file: !1, line: 2624, column: 13)
!772 = distinct !DILexicalBlock(scope: !773, file: !1, line: 2622, column: 36)
!773 = distinct !DILexicalBlock(scope: !679, file: !1, line: 2622, column: 9)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args_tuple", scope: !770, file: !1, line: 2630, type: !50)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc_message", scope: !770, file: !1, line: 2631, type: !50)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !777, file: !1, line: 2640, type: !50)
!777 = distinct !DILexicalBlock(scope: !770, file: !1, line: 2640, column: 13)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !779, file: !1, line: 2643, type: !50)
!779 = distinct !DILexicalBlock(scope: !770, file: !1, line: 2643, column: 13)
!780 = !DISubprogram(name: "_PyExc_Fini", scope: !1, file: !1, line: 2649, type: !781, isLocal: false, isDefinition: true, scopeLine: 2650, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_PyExc_Fini, variables: !783)
!781 = !DISubroutineType(types: !782)
!782 = !{null}
!783 = !{!784, !786, !790, !792}
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !785, file: !1, line: 2651, type: !50)
!785 = distinct !DILexicalBlock(scope: !780, file: !1, line: 2651, column: 5)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !787, file: !1, line: 2651, type: !50)
!787 = distinct !DILexicalBlock(scope: !788, file: !1, line: 2651, column: 5)
!788 = distinct !DILexicalBlock(scope: !789, file: !1, line: 2651, column: 5)
!789 = distinct !DILexicalBlock(scope: !785, file: !1, line: 2651, column: 5)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !791, file: !1, line: 2653, type: !50)
!791 = distinct !DILexicalBlock(scope: !780, file: !1, line: 2653, column: 5)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !793, file: !1, line: 2653, type: !50)
!793 = distinct !DILexicalBlock(scope: !794, file: !1, line: 2653, column: 5)
!794 = distinct !DILexicalBlock(scope: !795, file: !1, line: 2653, column: 5)
!795 = distinct !DILexicalBlock(scope: !791, file: !1, line: 2653, column: 5)
!796 = !DISubprogram(name: "_PyErr_TrySetFromCause", scope: !1, file: !1, line: 2685, type: !797, isLocal: false, isDefinition: true, scopeLine: 2686, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, ...)* @_PyErr_TrySetFromCause, variables: !799)
!797 = !DISubroutineType(types: !798)
!798 = !{!50, !40, null}
!799 = !{!800, !801, !802, !803, !804, !805, !806, !808, !809, !810, !811, !812, !813, !814, !815, !828, !829, !833, !837, !839, !841}
!800 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 1, scope: !796, file: !1, line: 2685, type: !40)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msg_prefix", scope: !796, file: !1, line: 2687, type: !50)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc", scope: !796, file: !1, line: 2688, type: !50)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !796, file: !1, line: 2688, type: !50)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !796, file: !1, line: 2688, type: !50)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "caught_type", scope: !796, file: !1, line: 2689, type: !404)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dictptr", scope: !796, file: !1, line: 2690, type: !807)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "instance_args", scope: !796, file: !1, line: 2691, type: !50)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_args", scope: !796, file: !1, line: 2692, type: !22)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "caught_type_size", scope: !796, file: !1, line: 2692, type: !22)
!811 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base_exc_size", scope: !796, file: !1, line: 2692, type: !22)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_exc", scope: !796, file: !1, line: 2693, type: !50)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_val", scope: !796, file: !1, line: 2693, type: !50)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_tb", scope: !796, file: !1, line: 2693, type: !50)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vargs", scope: !796, file: !1, line: 2694, type: !816)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !25, line: 79, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !818, line: 50, baseType: !819)
!818 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stdarg.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 2694, baseType: !820)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !821, size: 192, align: 64, elements: !94)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "__va_list_tag", file: !1, line: 2694, baseType: !822)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 2694, size: 192, align: 64, elements: !823)
!823 = !{!824, !825, !826, !827}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !822, file: !1, line: 2694, baseType: !361, size: 32, align: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !822, file: !1, line: 2694, baseType: !361, size: 32, align: 32, offset: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !822, file: !1, line: 2694, baseType: !102, size: 64, align: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !822, file: !1, line: 2694, baseType: !102, size: 64, align: 64, offset: 128)
!828 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "same_basic_size", scope: !796, file: !1, line: 2695, type: !56)
!829 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !830, file: !1, line: 2760, type: !50)
!830 = distinct !DILexicalBlock(scope: !831, file: !1, line: 2760, column: 9)
!831 = distinct !DILexicalBlock(scope: !832, file: !1, line: 2758, column: 21)
!832 = distinct !DILexicalBlock(scope: !796, file: !1, line: 2758, column: 9)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !834, file: !1, line: 2771, type: !50)
!834 = distinct !DILexicalBlock(scope: !835, file: !1, line: 2771, column: 9)
!835 = distinct !DILexicalBlock(scope: !836, file: !1, line: 2770, column: 29)
!836 = distinct !DILexicalBlock(scope: !796, file: !1, line: 2770, column: 9)
!837 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !838, file: !1, line: 2772, type: !50)
!838 = distinct !DILexicalBlock(scope: !835, file: !1, line: 2772, column: 9)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !840, file: !1, line: 2778, type: !50)
!840 = distinct !DILexicalBlock(scope: !796, file: !1, line: 2778, column: 5)
!841 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !842, file: !1, line: 2779, type: !50)
!842 = distinct !DILexicalBlock(scope: !796, file: !1, line: 2779, column: 5)
!843 = !DISubprogram(name: "BaseException_set_tb", scope: !1, file: !1, line: 226, type: !844, isLocal: true, isDefinition: true, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyBaseExceptionObject*, %struct._object*)* @BaseException_set_tb, variables: !846)
!844 = !DISubroutineType(types: !845)
!845 = !{!56, !11, !50}
!846 = !{!847, !848, !849, !851, !853}
!847 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !843, file: !1, line: 226, type: !11)
!848 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tb", arg: 2, scope: !843, file: !1, line: 226, type: !50)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !850, file: !1, line: 238, type: !50)
!850 = distinct !DILexicalBlock(scope: !843, file: !1, line: 238, column: 5)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !852, file: !1, line: 239, type: !50)
!852 = distinct !DILexicalBlock(scope: !843, file: !1, line: 239, column: 5)
!853 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !854, file: !1, line: 239, type: !50)
!854 = distinct !DILexicalBlock(scope: !855, file: !1, line: 239, column: 5)
!855 = distinct !DILexicalBlock(scope: !852, file: !1, line: 239, column: 5)
!856 = !DISubprogram(name: "BaseException_dealloc", scope: !1, file: !1, line: 87, type: !857, isLocal: true, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyBaseExceptionObject*)* @BaseException_dealloc, variables: !859)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !11}
!859 = !{!860, !861}
!860 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !856, file: !1, line: 87, type: !11)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !862, file: !1, line: 89, type: !414)
!862 = distinct !DILexicalBlock(scope: !856, file: !1, line: 89, column: 5)
!863 = !DISubprogram(name: "BaseException_repr", scope: !1, file: !1, line: 119, type: !864, isLocal: true, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyBaseExceptionObject*)* @BaseException_repr, variables: !866)
!864 = !DISubroutineType(types: !865)
!865 = !{!50, !11}
!866 = !{!867, !868, !869}
!867 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !863, file: !1, line: 119, type: !11)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !863, file: !1, line: 121, type: !40)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dot", scope: !863, file: !1, line: 122, type: !40)
!870 = !DISubprogram(name: "BaseException_str", scope: !1, file: !1, line: 106, type: !864, isLocal: true, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyBaseExceptionObject*)* @BaseException_str, variables: !871)
!871 = !{!872}
!872 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !870, file: !1, line: 106, type: !11)
!873 = !DISubprogram(name: "BaseException_traverse", scope: !1, file: !1, line: 95, type: !874, isLocal: true, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyBaseExceptionObject*, i32 (%struct._object*, i8*)*, i8*)* @BaseException_traverse, variables: !876)
!874 = !DISubroutineType(types: !875)
!875 = !{!56, !11, !276, !102}
!876 = !{!877, !878, !879, !880, !884, !888, !892, !896}
!877 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !873, file: !1, line: 95, type: !11)
!878 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !873, file: !1, line: 95, type: !276)
!879 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !873, file: !1, line: 95, type: !102)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !881, file: !1, line: 97, type: !56)
!881 = distinct !DILexicalBlock(scope: !882, file: !1, line: 97, column: 5)
!882 = distinct !DILexicalBlock(scope: !883, file: !1, line: 97, column: 5)
!883 = distinct !DILexicalBlock(scope: !873, file: !1, line: 97, column: 5)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !885, file: !1, line: 98, type: !56)
!885 = distinct !DILexicalBlock(scope: !886, file: !1, line: 98, column: 5)
!886 = distinct !DILexicalBlock(scope: !887, file: !1, line: 98, column: 5)
!887 = distinct !DILexicalBlock(scope: !873, file: !1, line: 98, column: 5)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !889, file: !1, line: 99, type: !56)
!889 = distinct !DILexicalBlock(scope: !890, file: !1, line: 99, column: 5)
!890 = distinct !DILexicalBlock(scope: !891, file: !1, line: 99, column: 5)
!891 = distinct !DILexicalBlock(scope: !873, file: !1, line: 99, column: 5)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !893, file: !1, line: 100, type: !56)
!893 = distinct !DILexicalBlock(scope: !894, file: !1, line: 100, column: 5)
!894 = distinct !DILexicalBlock(scope: !895, file: !1, line: 100, column: 5)
!895 = distinct !DILexicalBlock(scope: !873, file: !1, line: 100, column: 5)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !897, file: !1, line: 101, type: !56)
!897 = distinct !DILexicalBlock(scope: !898, file: !1, line: 101, column: 5)
!898 = distinct !DILexicalBlock(scope: !899, file: !1, line: 101, column: 5)
!899 = distinct !DILexicalBlock(scope: !873, file: !1, line: 101, column: 5)
