; ModuleID = 'faulthandler.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !17, subprograms: !359, globals: !927)
!1 = !DIFile(filename: "./Modules/faulthandler.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyLockStatus", file: !4, line: 14, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pythread.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "PY_LOCK_FAILURE", value: 0)
!7 = !DIEnumerator(name: "PY_LOCK_ACQUIRED", value: 1)
!8 = !DIEnumerator(name: "PY_LOCK_INTR", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !10, line: 23, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!11 = !{!12, !13, !14, !15, !16}
!12 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!13 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!14 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!15 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!16 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!17 = !{!18, !19, !58, !357, !358, !110, !66}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !21, line: 109, baseType: !22)
!21 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !21, line: 105, size: 128, align: 64, elements: !23)
!23 = !{!24, !32}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !22, file: !21, line: 107, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !26, line: 177, baseType: !27)
!26 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !28, line: 102, baseType: !29)
!28 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !30, line: 181, baseType: !31)
!30 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!31 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !22, file: !21, line: 108, baseType: !33, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !21, line: 334, size: 3200, align: 64, elements: !35)
!35 = !{!36, !42, !46, !47, !48, !53, !116, !121, !126, !127, !132, !184, !215, !227, !233, !234, !235, !237, !239, !270, !271, !272, !281, !282, !287, !288, !290, !292, !302, !305, !323, !324, !325, !327, !329, !330, !332, !337, !342, !347, !348, !349, !350, !351, !352, !353, !354, !356}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !34, file: !21, line: 335, baseType: !37, size: 192, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !21, line: 114, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 111, size: 192, align: 64, elements: !39)
!39 = !{!40, !41}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !38, file: !21, line: 112, baseType: !20, size: 128, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !38, file: !21, line: 113, baseType: !25, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !34, file: !21, line: 336, baseType: !43, size: 64, align: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !34, file: !21, line: 337, baseType: !25, size: 64, align: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !34, file: !21, line: 337, baseType: !25, size: 64, align: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !34, file: !21, line: 341, baseType: !49, size: 64, align: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !21, line: 308, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{null, !19}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !34, file: !21, line: 342, baseType: !54, size: 64, align: 64, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !21, line: 314, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !19, !59, !58}
!58 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !28, line: 48, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 246, size: 1728, align: 64, elements: !63)
!62 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!63 = !{!64, !65, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !85, !86, !87, !88, !90, !92, !94, !98, !101, !103, !104, !105, !106, !107, !111, !112}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !61, file: !62, line: 247, baseType: !58, size: 32, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !61, file: !62, line: 252, baseType: !66, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !61, file: !62, line: 253, baseType: !66, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !61, file: !62, line: 254, baseType: !66, size: 64, align: 64, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !61, file: !62, line: 255, baseType: !66, size: 64, align: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !61, file: !62, line: 256, baseType: !66, size: 64, align: 64, offset: 320)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !61, file: !62, line: 257, baseType: !66, size: 64, align: 64, offset: 384)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !61, file: !62, line: 258, baseType: !66, size: 64, align: 64, offset: 448)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !61, file: !62, line: 259, baseType: !66, size: 64, align: 64, offset: 512)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !61, file: !62, line: 261, baseType: !66, size: 64, align: 64, offset: 576)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !61, file: !62, line: 262, baseType: !66, size: 64, align: 64, offset: 640)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !61, file: !62, line: 263, baseType: !66, size: 64, align: 64, offset: 704)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !61, file: !62, line: 265, baseType: !78, size: 64, align: 64, offset: 768)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !62, line: 161, size: 192, align: 64, elements: !80)
!80 = !{!81, !82, !84}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !79, file: !62, line: 162, baseType: !78, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !79, file: !62, line: 163, baseType: !83, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !79, file: !62, line: 167, baseType: !58, size: 32, align: 32, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !61, file: !62, line: 267, baseType: !83, size: 64, align: 64, offset: 832)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !61, file: !62, line: 269, baseType: !58, size: 32, align: 32, offset: 896)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !61, file: !62, line: 273, baseType: !58, size: 32, align: 32, offset: 928)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !61, file: !62, line: 275, baseType: !89, size: 64, align: 64, offset: 960)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !30, line: 140, baseType: !31)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !61, file: !62, line: 279, baseType: !91, size: 16, align: 16, offset: 1024)
!91 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !61, file: !62, line: 280, baseType: !93, size: 8, align: 8, offset: 1040)
!93 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !61, file: !62, line: 281, baseType: !95, size: 8, align: 8, offset: 1048)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8, align: 8, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 1)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !61, file: !62, line: 285, baseType: !99, size: 64, align: 64, offset: 1088)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !62, line: 155, baseType: null)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !61, file: !62, line: 294, baseType: !102, size: 64, align: 64, offset: 1152)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !30, line: 141, baseType: !31)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !61, file: !62, line: 303, baseType: !18, size: 64, align: 64, offset: 1216)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !61, file: !62, line: 304, baseType: !18, size: 64, align: 64, offset: 1280)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !61, file: !62, line: 305, baseType: !18, size: 64, align: 64, offset: 1344)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !61, file: !62, line: 306, baseType: !18, size: 64, align: 64, offset: 1408)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !61, file: !62, line: 307, baseType: !108, size: 64, align: 64, offset: 1472)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !109, line: 62, baseType: !110)
!109 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!110 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !61, file: !62, line: 309, baseType: !58, size: 32, align: 32, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !61, file: !62, line: 311, baseType: !113, size: 160, align: 8, offset: 1568)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 160, align: 8, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 20)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !34, file: !21, line: 343, baseType: !117, size: 64, align: 64, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !21, line: 316, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!19, !19, !66}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !34, file: !21, line: 344, baseType: !122, size: 64, align: 64, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !21, line: 318, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!58, !19, !66, !19}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !34, file: !21, line: 345, baseType: !18, size: 64, align: 64, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !34, file: !21, line: 346, baseType: !128, size: 64, align: 64, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !21, line: 320, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!19, !19}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !34, file: !21, line: 350, baseType: !133, size: 64, align: 64, offset: 768)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !21, line: 278, baseType: !135)
!135 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 236, size: 2176, align: 64, elements: !136)
!136 = !{!137, !142, !143, !144, !145, !146, !151, !153, !154, !155, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !135, file: !21, line: 241, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !21, line: 166, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!19, !19, !19}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !135, file: !21, line: 242, baseType: !138, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !135, file: !21, line: 243, baseType: !138, size: 64, align: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !135, file: !21, line: 244, baseType: !138, size: 64, align: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !135, file: !21, line: 245, baseType: !138, size: 64, align: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !135, file: !21, line: 246, baseType: !147, size: 64, align: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !21, line: 167, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!19, !19, !19, !19}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !135, file: !21, line: 247, baseType: !152, size: 64, align: 64, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !21, line: 165, baseType: !129)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !135, file: !21, line: 248, baseType: !152, size: 64, align: 64, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !135, file: !21, line: 249, baseType: !152, size: 64, align: 64, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !135, file: !21, line: 250, baseType: !156, size: 64, align: 64, offset: 576)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !21, line: 168, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!58, !19}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !135, file: !21, line: 251, baseType: !152, size: 64, align: 64, offset: 640)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !135, file: !21, line: 252, baseType: !138, size: 64, align: 64, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !135, file: !21, line: 253, baseType: !138, size: 64, align: 64, offset: 768)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !135, file: !21, line: 254, baseType: !138, size: 64, align: 64, offset: 832)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !135, file: !21, line: 255, baseType: !138, size: 64, align: 64, offset: 896)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !135, file: !21, line: 256, baseType: !138, size: 64, align: 64, offset: 960)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !135, file: !21, line: 257, baseType: !152, size: 64, align: 64, offset: 1024)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !135, file: !21, line: 258, baseType: !18, size: 64, align: 64, offset: 1088)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !135, file: !21, line: 259, baseType: !152, size: 64, align: 64, offset: 1152)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !135, file: !21, line: 261, baseType: !138, size: 64, align: 64, offset: 1216)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !135, file: !21, line: 262, baseType: !138, size: 64, align: 64, offset: 1280)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !135, file: !21, line: 263, baseType: !138, size: 64, align: 64, offset: 1344)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !135, file: !21, line: 264, baseType: !138, size: 64, align: 64, offset: 1408)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !135, file: !21, line: 265, baseType: !147, size: 64, align: 64, offset: 1472)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !135, file: !21, line: 266, baseType: !138, size: 64, align: 64, offset: 1536)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !135, file: !21, line: 267, baseType: !138, size: 64, align: 64, offset: 1600)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !135, file: !21, line: 268, baseType: !138, size: 64, align: 64, offset: 1664)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !135, file: !21, line: 269, baseType: !138, size: 64, align: 64, offset: 1728)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !135, file: !21, line: 270, baseType: !138, size: 64, align: 64, offset: 1792)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !135, file: !21, line: 272, baseType: !138, size: 64, align: 64, offset: 1856)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !135, file: !21, line: 273, baseType: !138, size: 64, align: 64, offset: 1920)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !135, file: !21, line: 274, baseType: !138, size: 64, align: 64, offset: 1984)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !135, file: !21, line: 275, baseType: !138, size: 64, align: 64, offset: 2048)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !135, file: !21, line: 277, baseType: !152, size: 64, align: 64, offset: 2112)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !34, file: !21, line: 351, baseType: !185, size: 64, align: 64, offset: 832)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !21, line: 292, baseType: !187)
!187 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 280, size: 640, align: 64, elements: !188)
!188 = !{!189, !194, !195, !200, !201, !202, !207, !208, !213, !214}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !187, file: !21, line: 281, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !21, line: 169, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!25, !19}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !187, file: !21, line: 282, baseType: !138, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !187, file: !21, line: 283, baseType: !196, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !21, line: 170, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!19, !19, !25}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !187, file: !21, line: 284, baseType: !196, size: 64, align: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !187, file: !21, line: 285, baseType: !18, size: 64, align: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !187, file: !21, line: 286, baseType: !203, size: 64, align: 64, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !21, line: 172, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!58, !19, !25, !19}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !187, file: !21, line: 287, baseType: !18, size: 64, align: 64, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !187, file: !21, line: 288, baseType: !209, size: 64, align: 64, offset: 448)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !21, line: 231, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!58, !19, !19}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !187, file: !21, line: 290, baseType: !138, size: 64, align: 64, offset: 512)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !187, file: !21, line: 291, baseType: !196, size: 64, align: 64, offset: 576)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !34, file: !21, line: 352, baseType: !216, size: 64, align: 64, offset: 896)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !21, line: 298, baseType: !218)
!218 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 294, size: 192, align: 64, elements: !219)
!219 = !{!220, !221, !222}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !218, file: !21, line: 295, baseType: !190, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !218, file: !21, line: 296, baseType: !138, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !218, file: !21, line: 297, baseType: !223, size: 64, align: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !21, line: 174, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!58, !19, !19, !19}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !34, file: !21, line: 356, baseType: !228, size: 64, align: 64, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !21, line: 321, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!232, !19}
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !26, line: 186, baseType: !25)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !34, file: !21, line: 357, baseType: !147, size: 64, align: 64, offset: 1024)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !34, file: !21, line: 358, baseType: !128, size: 64, align: 64, offset: 1088)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !34, file: !21, line: 359, baseType: !236, size: 64, align: 64, offset: 1152)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !21, line: 317, baseType: !139)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !34, file: !21, line: 360, baseType: !238, size: 64, align: 64, offset: 1216)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !21, line: 319, baseType: !224)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !34, file: !21, line: 363, baseType: !240, size: 64, align: 64, offset: 1280)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !21, line: 304, baseType: !242)
!242 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 301, size: 128, align: 64, elements: !243)
!243 = !{!244, !265}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !242, file: !21, line: 302, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !21, line: 193, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!58, !19, !249, !58}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !21, line: 191, baseType: !251)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !21, line: 178, size: 640, align: 64, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260, !262, !263, !264}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !251, file: !21, line: 179, baseType: !18, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !251, file: !21, line: 180, baseType: !19, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !251, file: !21, line: 181, baseType: !25, size: 64, align: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !251, file: !21, line: 182, baseType: !25, size: 64, align: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !251, file: !21, line: 184, baseType: !58, size: 32, align: 32, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !251, file: !21, line: 185, baseType: !58, size: 32, align: 32, offset: 288)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !251, file: !21, line: 186, baseType: !66, size: 64, align: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !251, file: !21, line: 187, baseType: !261, size: 64, align: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !251, file: !21, line: 188, baseType: !261, size: 64, align: 64, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !251, file: !21, line: 189, baseType: !261, size: 64, align: 64, offset: 512)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !251, file: !21, line: 190, baseType: !18, size: 64, align: 64, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !242, file: !21, line: 303, baseType: !266, size: 64, align: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !21, line: 194, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !19, !249}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !34, file: !21, line: 366, baseType: !110, size: 64, align: 64, offset: 1344)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !34, file: !21, line: 368, baseType: !43, size: 64, align: 64, offset: 1408)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !34, file: !21, line: 372, baseType: !273, size: 64, align: 64, offset: 1472)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !21, line: 233, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!58, !19, !277, !18}
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !21, line: 232, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!58, !19, !18}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !34, file: !21, line: 375, baseType: !156, size: 64, align: 64, offset: 1536)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !34, file: !21, line: 379, baseType: !283, size: 64, align: 64, offset: 1600)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !21, line: 322, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!19, !19, !19, !58}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !34, file: !21, line: 382, baseType: !25, size: 64, align: 64, offset: 1664)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !34, file: !21, line: 385, baseType: !289, size: 64, align: 64, offset: 1728)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !21, line: 323, baseType: !129)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !34, file: !21, line: 386, baseType: !291, size: 64, align: 64, offset: 1792)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !21, line: 324, baseType: !129)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !34, file: !21, line: 389, baseType: !293, size: 64, align: 64, offset: 1856)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !295, line: 40, size: 256, align: 64, elements: !296)
!295 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!296 = !{!297, !298, !300, !301}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !294, file: !295, line: 41, baseType: !43, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !294, file: !295, line: 42, baseType: !299, size: 64, align: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !295, line: 18, baseType: !139)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !294, file: !295, line: 43, baseType: !58, size: 32, align: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !294, file: !295, line: 45, baseType: !43, size: 64, align: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !34, file: !21, line: 390, baseType: !303, size: 64, align: 64, offset: 1920)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !21, line: 390, flags: DIFlagFwdDecl)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !34, file: !21, line: 391, baseType: !306, size: 64, align: 64, offset: 1984)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !308, line: 11, size: 320, align: 64, elements: !309)
!308 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!309 = !{!310, !311, !316, !321, !322}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !307, file: !308, line: 12, baseType: !66, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !307, file: !308, line: 13, baseType: !312, size: 64, align: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !308, line: 8, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!19, !19, !18}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !307, file: !308, line: 14, baseType: !317, size: 64, align: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !308, line: 9, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!58, !19, !19, !18}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !307, file: !308, line: 15, baseType: !66, size: 64, align: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !307, file: !308, line: 16, baseType: !18, size: 64, align: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !34, file: !21, line: 392, baseType: !33, size: 64, align: 64, offset: 2048)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !34, file: !21, line: 393, baseType: !19, size: 64, align: 64, offset: 2112)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !34, file: !21, line: 394, baseType: !326, size: 64, align: 64, offset: 2176)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !21, line: 325, baseType: !148)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !34, file: !21, line: 395, baseType: !328, size: 64, align: 64, offset: 2240)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !21, line: 326, baseType: !224)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !34, file: !21, line: 396, baseType: !25, size: 64, align: 64, offset: 2304)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !34, file: !21, line: 397, baseType: !331, size: 64, align: 64, offset: 2368)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !21, line: 327, baseType: !224)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !34, file: !21, line: 398, baseType: !333, size: 64, align: 64, offset: 2432)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !21, line: 329, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!19, !33, !25}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !34, file: !21, line: 399, baseType: !338, size: 64, align: 64, offset: 2496)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !21, line: 328, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!19, !33, !19, !19}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !34, file: !21, line: 400, baseType: !343, size: 64, align: 64, offset: 2560)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !21, line: 307, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !18}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !34, file: !21, line: 401, baseType: !156, size: 64, align: 64, offset: 2624)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !34, file: !21, line: 402, baseType: !19, size: 64, align: 64, offset: 2688)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !34, file: !21, line: 403, baseType: !19, size: 64, align: 64, offset: 2752)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !34, file: !21, line: 404, baseType: !19, size: 64, align: 64, offset: 2816)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !34, file: !21, line: 405, baseType: !19, size: 64, align: 64, offset: 2880)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !34, file: !21, line: 406, baseType: !19, size: 64, align: 64, offset: 2944)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !34, file: !21, line: 407, baseType: !49, size: 64, align: 64, offset: 3008)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !34, file: !21, line: 410, baseType: !355, size: 32, align: 32, offset: 3072)
!355 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !34, file: !21, line: 412, baseType: !49, size: 64, align: 64, offset: 3136)
!357 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!358 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!359 = !{!360, !364, !369, !374, !608, !623, !628, !637, !640, !643, !653, !680, !695, !720, !729, !734, !737, !740, !770, !776, !785, !791, !798, !811, !815, !819, !826, !830, !834, !839, !846, !859, !881, !897, !905, !917}
!360 = !DISubprogram(name: "PyInit_faulthandler", scope: !1, file: !1, line: 1045, type: !361, isLocal: false, isDefinition: true, scopeLine: 1046, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_faulthandler, variables: !363)
!361 = !DISubroutineType(types: !362)
!362 = !{!19}
!363 = !{}
!364 = !DISubprogram(name: "_PyFaulthandler_Init", scope: !1, file: !1, line: 1090, type: !365, isLocal: false, isDefinition: true, scopeLine: 1091, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @_PyFaulthandler_Init, variables: !367)
!365 = !DISubroutineType(types: !366)
!366 = !{!58}
!367 = !{!368}
!368 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !364, file: !1, line: 1093, type: !58)
!369 = !DISubprogram(name: "_PyFaulthandler_Fini", scope: !1, file: !1, line: 1124, type: !370, isLocal: false, isDefinition: true, scopeLine: 1125, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_PyFaulthandler_Fini, variables: !372)
!370 = !DISubroutineType(types: !371)
!371 = !{null}
!372 = !{!373}
!373 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signum", scope: !369, file: !1, line: 1127, type: !355)
!374 = !DISubprogram(name: "faulthandler_enable", scope: !1, file: !1, line: 318, type: !149, isLocal: true, isDefinition: true, scopeLine: 319, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @faulthandler_enable, variables: !375)
!375 = !{!376, !377, !378, !379, !380, !381, !382, !485, !486, !487, !488, !603, !605}
!376 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !374, file: !1, line: 318, type: !19)
!377 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !374, file: !1, line: 318, type: !19)
!378 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !374, file: !1, line: 318, type: !19)
!379 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file", scope: !374, file: !1, line: 321, type: !19)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "all_threads", scope: !374, file: !1, line: 322, type: !58)
!381 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !374, file: !1, line: 323, type: !355)
!382 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handler", scope: !374, file: !1, line: 324, type: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault_handler_t", file: !1, line: 46, baseType: !385)
!385 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 40, size: 1408, align: 64, elements: !386)
!386 = !{!387, !388, !389, !390, !484}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "signum", scope: !385, file: !1, line: 41, baseType: !58, size: 32, align: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !385, file: !1, line: 42, baseType: !58, size: 32, align: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !385, file: !1, line: 43, baseType: !43, size: 64, align: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !385, file: !1, line: 44, baseType: !391, size: 1216, align: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_sighandler_t", file: !1, line: 35, baseType: !392)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !393, line: 24, size: 1216, align: 64, elements: !394)
!393 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!394 = !{!395, !472, !481, !482}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !392, file: !393, line: 35, baseType: !396, size: 64, align: 64)
!396 = !DICompositeType(tag: DW_TAG_union_type, scope: !392, file: !393, line: 28, size: 64, align: 64, elements: !397)
!397 = !{!398, !404}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !396, file: !393, line: 31, baseType: !399, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !400, line: 85, baseType: !401)
!400 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{null, !58}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !396, file: !393, line: 33, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !58, !408, !18}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !410, line: 127, baseType: !411)
!410 = !DIFile(filename: "/usr/include/bits/siginfo.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!411 = !DICompositeType(tag: DW_TAG_structure_type, file: !410, line: 62, size: 1024, align: 64, elements: !412)
!412 = !{!413, !414, !415, !416}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !411, file: !410, line: 64, baseType: !58, size: 32, align: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !411, file: !410, line: 65, baseType: !58, size: 32, align: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !411, file: !410, line: 67, baseType: !58, size: 32, align: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !411, file: !410, line: 126, baseType: !417, size: 896, align: 64, offset: 128)
!417 = !DICompositeType(tag: DW_TAG_union_type, scope: !411, file: !410, line: 69, size: 896, align: 64, elements: !418)
!418 = !{!419, !423, !430, !441, !447, !457, !461, !466}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !417, file: !410, line: 71, baseType: !420, size: 896, align: 32)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 896, align: 32, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 28)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !417, file: !410, line: 78, baseType: !424, size: 64, align: 32)
!424 = !DICompositeType(tag: DW_TAG_structure_type, scope: !417, file: !410, line: 74, size: 64, align: 32, elements: !425)
!425 = !{!426, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !424, file: !410, line: 76, baseType: !427, size: 32, align: 32)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !30, line: 142, baseType: !58)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !424, file: !410, line: 77, baseType: !429, size: 32, align: 32, offset: 32)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !30, line: 134, baseType: !355)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !417, file: !410, line: 86, baseType: !431, size: 128, align: 64)
!431 = !DICompositeType(tag: DW_TAG_structure_type, scope: !417, file: !410, line: 81, size: 128, align: 64, elements: !432)
!432 = !{!433, !434, !435}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !431, file: !410, line: 83, baseType: !58, size: 32, align: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !431, file: !410, line: 84, baseType: !58, size: 32, align: 32, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !431, file: !410, line: 85, baseType: !436, size: 64, align: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !410, line: 36, baseType: !437)
!437 = !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !410, line: 32, size: 64, align: 64, elements: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !437, file: !410, line: 34, baseType: !58, size: 32, align: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !437, file: !410, line: 35, baseType: !18, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !417, file: !410, line: 94, baseType: !442, size: 128, align: 64)
!442 = !DICompositeType(tag: DW_TAG_structure_type, scope: !417, file: !410, line: 89, size: 128, align: 64, elements: !443)
!443 = !{!444, !445, !446}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !442, file: !410, line: 91, baseType: !427, size: 32, align: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !442, file: !410, line: 92, baseType: !429, size: 32, align: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !442, file: !410, line: 93, baseType: !436, size: 64, align: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !417, file: !410, line: 104, baseType: !448, size: 256, align: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, scope: !417, file: !410, line: 97, size: 256, align: 64, elements: !449)
!449 = !{!450, !451, !452, !453, !456}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !448, file: !410, line: 99, baseType: !427, size: 32, align: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !448, file: !410, line: 100, baseType: !429, size: 32, align: 32, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !448, file: !410, line: 101, baseType: !58, size: 32, align: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !448, file: !410, line: 102, baseType: !454, size: 64, align: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigchld_clock_t", file: !410, line: 58, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !30, line: 144, baseType: !31)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !448, file: !410, line: 103, baseType: !454, size: 64, align: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !417, file: !410, line: 110, baseType: !458, size: 64, align: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, scope: !417, file: !410, line: 107, size: 64, align: 64, elements: !459)
!459 = !{!460}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !458, file: !410, line: 109, baseType: !18, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !417, file: !410, line: 117, baseType: !462, size: 128, align: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, scope: !417, file: !410, line: 113, size: 128, align: 64, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !462, file: !410, line: 115, baseType: !31, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !462, file: !410, line: 116, baseType: !58, size: 32, align: 32, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !417, file: !410, line: 125, baseType: !467, size: 128, align: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, scope: !417, file: !410, line: 120, size: 128, align: 64, elements: !468)
!468 = !{!469, !470, !471}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !467, file: !410, line: 122, baseType: !18, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !467, file: !410, line: 123, baseType: !58, size: 32, align: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !467, file: !410, line: 124, baseType: !355, size: 32, align: 32, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !392, file: !393, line: 43, baseType: !473, size: 1024, align: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !474, line: 31, baseType: !475)
!474 = !DIFile(filename: "/usr/include/bits/sigset.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!475 = !DICompositeType(tag: DW_TAG_structure_type, file: !474, line: 28, size: 1024, align: 64, elements: !476)
!476 = !{!477}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !475, file: !474, line: 30, baseType: !478, size: 1024, align: 64)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 1024, align: 64, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 16)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !392, file: !393, line: 46, baseType: !58, size: 32, align: 32, offset: 1088)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !392, file: !393, line: 49, baseType: !483, size: 64, align: 64, offset: 1152)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "all_threads", scope: !385, file: !1, line: 45, baseType: !58, size: 32, align: 32, offset: 1344)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "action", scope: !374, file: !1, line: 326, type: !392)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !374, file: !1, line: 328, type: !58)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !374, file: !1, line: 329, type: !58)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !374, file: !1, line: 330, type: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !491, line: 139, baseType: !492)
!491 = !DIFile(filename: "Include/pystate.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !491, line: 69, size: 1536, align: 64, elements: !493)
!493 = !{!494, !496, !497, !517, !576, !577, !578, !579, !580, !581, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !492, file: !491, line: 72, baseType: !495, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !492, file: !491, line: 73, baseType: !495, size: 64, align: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !492, file: !491, line: 74, baseType: !498, size: 64, align: 64, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !491, line: 44, baseType: !500)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !491, line: 19, size: 832, align: 64, elements: !501)
!501 = !{!502, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !500, file: !491, line: 21, baseType: !503, size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !500, file: !491, line: 22, baseType: !495, size: 64, align: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !500, file: !491, line: 24, baseType: !19, size: 64, align: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !500, file: !491, line: 25, baseType: !19, size: 64, align: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !500, file: !491, line: 26, baseType: !19, size: 64, align: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !500, file: !491, line: 27, baseType: !19, size: 64, align: 64, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !500, file: !491, line: 28, baseType: !19, size: 64, align: 64, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !500, file: !491, line: 30, baseType: !19, size: 64, align: 64, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !500, file: !491, line: 31, baseType: !19, size: 64, align: 64, offset: 512)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !500, file: !491, line: 32, baseType: !19, size: 64, align: 64, offset: 576)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !500, file: !491, line: 33, baseType: !58, size: 32, align: 32, offset: 640)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !500, file: !491, line: 34, baseType: !58, size: 32, align: 32, offset: 672)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !500, file: !491, line: 37, baseType: !58, size: 32, align: 32, offset: 704)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !500, file: !491, line: 43, baseType: !19, size: 64, align: 64, offset: 768)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !492, file: !491, line: 76, baseType: !518, size: 64, align: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64, align: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !520, line: 17, size: 3072, align: 64, elements: !521)
!520 = !DIFile(filename: "Include/frameobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!521 = !{!522, !523, !524, !551, !552, !553, !554, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !574}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !519, file: !520, line: 18, baseType: !37, size: 192, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "f_back", scope: !519, file: !520, line: 19, baseType: !518, size: 64, align: 64, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "f_code", scope: !519, file: !520, line: 20, baseType: !525, size: 64, align: 64, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !527, line: 33, baseType: !528)
!527 = !DIFile(filename: "Include/code.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!528 = !DICompositeType(tag: DW_TAG_structure_type, file: !527, line: 11, size: 1152, align: 64, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !545, !546, !547, !548, !549, !550}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !528, file: !527, line: 12, baseType: !20, size: 128, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !528, file: !527, line: 13, baseType: !58, size: 32, align: 32, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !528, file: !527, line: 14, baseType: !58, size: 32, align: 32, offset: 160)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !528, file: !527, line: 15, baseType: !58, size: 32, align: 32, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !528, file: !527, line: 16, baseType: !58, size: 32, align: 32, offset: 224)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !528, file: !527, line: 17, baseType: !58, size: 32, align: 32, offset: 256)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "co_code", scope: !528, file: !527, line: 18, baseType: !19, size: 64, align: 64, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !528, file: !527, line: 19, baseType: !19, size: 64, align: 64, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !528, file: !527, line: 20, baseType: !19, size: 64, align: 64, offset: 448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "co_varnames", scope: !528, file: !527, line: 21, baseType: !19, size: 64, align: 64, offset: 512)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "co_freevars", scope: !528, file: !527, line: 22, baseType: !19, size: 64, align: 64, offset: 576)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "co_cellvars", scope: !528, file: !527, line: 23, baseType: !19, size: 64, align: 64, offset: 640)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "co_cell2arg", scope: !528, file: !527, line: 25, baseType: !543, size: 64, align: 64, offset: 704)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !528, file: !527, line: 26, baseType: !19, size: 64, align: 64, offset: 768)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !528, file: !527, line: 27, baseType: !19, size: 64, align: 64, offset: 832)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !528, file: !527, line: 28, baseType: !58, size: 32, align: 32, offset: 896)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "co_lnotab", scope: !528, file: !527, line: 29, baseType: !19, size: 64, align: 64, offset: 960)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "co_zombieframe", scope: !528, file: !527, line: 31, baseType: !18, size: 64, align: 64, offset: 1024)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !528, file: !527, line: 32, baseType: !19, size: 64, align: 64, offset: 1088)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "f_builtins", scope: !519, file: !520, line: 21, baseType: !19, size: 64, align: 64, offset: 320)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "f_globals", scope: !519, file: !520, line: 22, baseType: !19, size: 64, align: 64, offset: 384)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "f_locals", scope: !519, file: !520, line: 23, baseType: !19, size: 64, align: 64, offset: 448)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "f_valuestack", scope: !519, file: !520, line: 24, baseType: !555, size: 64, align: 64, offset: 512)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "f_stacktop", scope: !519, file: !520, line: 28, baseType: !555, size: 64, align: 64, offset: 576)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "f_trace", scope: !519, file: !520, line: 29, baseType: !19, size: 64, align: 64, offset: 640)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_type", scope: !519, file: !520, line: 38, baseType: !19, size: 64, align: 64, offset: 704)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_value", scope: !519, file: !520, line: 38, baseType: !19, size: 64, align: 64, offset: 768)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_traceback", scope: !519, file: !520, line: 38, baseType: !19, size: 64, align: 64, offset: 832)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "f_gen", scope: !519, file: !520, line: 40, baseType: !19, size: 64, align: 64, offset: 896)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "f_lasti", scope: !519, file: !520, line: 42, baseType: !58, size: 32, align: 32, offset: 960)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "f_lineno", scope: !519, file: !520, line: 48, baseType: !58, size: 32, align: 32, offset: 992)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "f_iblock", scope: !519, file: !520, line: 49, baseType: !58, size: 32, align: 32, offset: 1024)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "f_executing", scope: !519, file: !520, line: 50, baseType: !45, size: 8, align: 8, offset: 1056)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "f_blockstack", scope: !519, file: !520, line: 51, baseType: !567, size: 1920, align: 32, offset: 1088)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 1920, align: 32, elements: !114)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTryBlock", file: !520, line: 15, baseType: !569)
!569 = !DICompositeType(tag: DW_TAG_structure_type, file: !520, line: 11, size: 96, align: 32, elements: !570)
!570 = !{!571, !572, !573}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "b_type", scope: !569, file: !520, line: 12, baseType: !58, size: 32, align: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "b_handler", scope: !569, file: !520, line: 13, baseType: !58, size: 32, align: 32, offset: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "b_level", scope: !569, file: !520, line: 14, baseType: !58, size: 32, align: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "f_localsplus", scope: !519, file: !520, line: 52, baseType: !575, size: 64, align: 64, offset: 3008)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 64, align: 64, elements: !96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !492, file: !491, line: 77, baseType: !58, size: 32, align: 32, offset: 256)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !492, file: !491, line: 78, baseType: !45, size: 8, align: 8, offset: 288)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !492, file: !491, line: 80, baseType: !45, size: 8, align: 8, offset: 296)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !492, file: !491, line: 85, baseType: !58, size: 32, align: 32, offset: 320)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !492, file: !491, line: 86, baseType: !58, size: 32, align: 32, offset: 352)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !492, file: !491, line: 88, baseType: !582, size: 64, align: 64, offset: 384)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !491, line: 54, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64, align: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!58, !19, !518, !58, !19}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !492, file: !491, line: 89, baseType: !582, size: 64, align: 64, offset: 448)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !492, file: !491, line: 90, baseType: !19, size: 64, align: 64, offset: 512)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !492, file: !491, line: 91, baseType: !19, size: 64, align: 64, offset: 576)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !492, file: !491, line: 93, baseType: !19, size: 64, align: 64, offset: 640)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !492, file: !491, line: 94, baseType: !19, size: 64, align: 64, offset: 704)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !492, file: !491, line: 95, baseType: !19, size: 64, align: 64, offset: 768)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !492, file: !491, line: 97, baseType: !19, size: 64, align: 64, offset: 832)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !492, file: !491, line: 98, baseType: !19, size: 64, align: 64, offset: 896)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !492, file: !491, line: 99, baseType: !19, size: 64, align: 64, offset: 960)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !492, file: !491, line: 101, baseType: !19, size: 64, align: 64, offset: 1024)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !492, file: !491, line: 103, baseType: !58, size: 32, align: 32, offset: 1088)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !492, file: !491, line: 105, baseType: !19, size: 64, align: 64, offset: 1152)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !492, file: !491, line: 106, baseType: !31, size: 64, align: 64, offset: 1216)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !492, file: !491, line: 108, baseType: !58, size: 32, align: 32, offset: 1280)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !492, file: !491, line: 109, baseType: !19, size: 64, align: 64, offset: 1344)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !492, file: !491, line: 134, baseType: !344, size: 64, align: 64, offset: 1408)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !492, file: !491, line: 135, baseType: !18, size: 64, align: 64, offset: 1472)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !604, file: !1, line: 344, type: !19)
!604 = distinct !DILexicalBlock(scope: !374, file: !1, line: 344, column: 5)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !606, file: !1, line: 344, type: !19)
!606 = distinct !DILexicalBlock(scope: !607, file: !1, line: 344, column: 5)
!607 = distinct !DILexicalBlock(scope: !604, file: !1, line: 344, column: 5)
!608 = !DISubprogram(name: "faulthandler_get_fileno", scope: !1, file: !1, line: 135, type: !609, isLocal: true, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i32*)* @faulthandler_get_fileno, variables: !612)
!609 = !DISubroutineType(types: !610)
!610 = !{!19, !19, !611}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!612 = !{!613, !614, !615, !616, !617, !618, !620}
!613 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 1, scope: !608, file: !1, line: 135, type: !19)
!614 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_fd", arg: 2, scope: !608, file: !1, line: 135, type: !611)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !608, file: !1, line: 137, type: !19)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd_long", scope: !608, file: !1, line: 138, type: !31)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !608, file: !1, line: 139, type: !58)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !619, file: !1, line: 163, type: !19)
!619 = distinct !DILexicalBlock(scope: !608, file: !1, line: 163, column: 5)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !621, file: !1, line: 173, type: !19)
!621 = distinct !DILexicalBlock(scope: !622, file: !1, line: 173, column: 9)
!622 = distinct !DILexicalBlock(scope: !608, file: !1, line: 172, column: 9)
!623 = !DISubprogram(name: "get_thread_state", scope: !1, file: !1, line: 185, type: !624, isLocal: true, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: true, variables: !626)
!624 = !DISubroutineType(types: !625)
!625 = !{!489}
!626 = !{!627}
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !623, file: !1, line: 187, type: !489)
!628 = !DISubprogram(name: "faulthandler_fatal_error", scope: !1, file: !1, line: 248, type: !402, isLocal: true, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @faulthandler_fatal_error, variables: !629)
!629 = !{!630, !631, !633, !634, !635, !636}
!630 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "signum", arg: 1, scope: !628, file: !1, line: 248, type: !58)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !628, file: !1, line: 250, type: !632)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !628, file: !1, line: 251, type: !355)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handler", scope: !628, file: !1, line: 252, type: !383)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !628, file: !1, line: 253, type: !489)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "save_errno", scope: !628, file: !1, line: 254, type: !58)
!637 = !DISubprogram(name: "faulthandler_disable_py", scope: !1, file: !1, line: 410, type: !130, isLocal: true, isDefinition: true, scopeLine: 411, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @faulthandler_disable_py, variables: !638)
!638 = !{!639}
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !637, file: !1, line: 410, type: !19)
!640 = !DISubprogram(name: "faulthandler_is_enabled", scope: !1, file: !1, line: 422, type: !130, isLocal: true, isDefinition: true, scopeLine: 423, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @faulthandler_is_enabled, variables: !641)
!641 = !{!642}
!642 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !640, file: !1, line: 422, type: !19)
!643 = !DISubprogram(name: "faulthandler_dump_traceback_py", scope: !1, file: !1, line: 197, type: !149, isLocal: true, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @faulthandler_dump_traceback_py, variables: !644)
!644 = !{!645, !646, !647, !648, !649, !650, !651, !652}
!645 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !643, file: !1, line: 197, type: !19)
!646 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !643, file: !1, line: 198, type: !19)
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !643, file: !1, line: 198, type: !19)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file", scope: !643, file: !1, line: 201, type: !19)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "all_threads", scope: !643, file: !1, line: 202, type: !58)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !643, file: !1, line: 203, type: !489)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errmsg", scope: !643, file: !1, line: 204, type: !43)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !643, file: !1, line: 205, type: !58)
!653 = !DISubprogram(name: "faulthandler_dump_traceback_later", scope: !1, file: !1, line: 518, type: !149, isLocal: true, isDefinition: true, scopeLine: 520, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @faulthandler_dump_traceback_later, variables: !654)
!654 = !{!655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !669, !672, !676}
!655 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !653, file: !1, line: 518, type: !19)
!656 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !653, file: !1, line: 519, type: !19)
!657 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !653, file: !1, line: 519, type: !19)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timeout", scope: !653, file: !1, line: 522, type: !357)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timeout_us", scope: !653, file: !1, line: 523, type: !358)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "repeat", scope: !653, file: !1, line: 524, type: !58)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file", scope: !653, file: !1, line: 525, type: !19)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !653, file: !1, line: 526, type: !58)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exit", scope: !653, file: !1, line: 527, type: !58)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !653, file: !1, line: 528, type: !489)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "header", scope: !653, file: !1, line: 529, type: !66)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "header_len", scope: !653, file: !1, line: 530, type: !108)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !668, file: !1, line: 563, type: !19)
!668 = distinct !DILexicalBlock(scope: !653, file: !1, line: 563, column: 5)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !670, file: !1, line: 563, type: !19)
!670 = distinct !DILexicalBlock(scope: !671, file: !1, line: 563, column: 5)
!671 = distinct !DILexicalBlock(scope: !668, file: !1, line: 563, column: 5)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !673, file: !1, line: 579, type: !19)
!673 = distinct !DILexicalBlock(scope: !674, file: !1, line: 579, column: 9)
!674 = distinct !DILexicalBlock(scope: !675, file: !1, line: 577, column: 69)
!675 = distinct !DILexicalBlock(scope: !653, file: !1, line: 577, column: 9)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !677, file: !1, line: 579, type: !19)
!677 = distinct !DILexicalBlock(scope: !678, file: !1, line: 579, column: 9)
!678 = distinct !DILexicalBlock(scope: !679, file: !1, line: 579, column: 9)
!679 = distinct !DILexicalBlock(scope: !673, file: !1, line: 579, column: 9)
!680 = !DISubprogram(name: "format_timeout", scope: !1, file: !1, line: 491, type: !681, isLocal: true, isDefinition: true, scopeLine: 492, flags: DIFlagPrototyped, isOptimized: true, variables: !683)
!681 = !DISubroutineType(types: !682)
!682 = !{!66, !357}
!683 = !{!684, !685, !686, !687, !688, !689, !690, !691}
!684 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timeout", arg: 1, scope: !680, file: !1, line: 491, type: !357)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "us", scope: !680, file: !1, line: 493, type: !110)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sec", scope: !680, file: !1, line: 493, type: !110)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min", scope: !680, file: !1, line: 493, type: !110)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hour", scope: !680, file: !1, line: 493, type: !110)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "intpart", scope: !680, file: !1, line: 494, type: !357)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fracpart", scope: !680, file: !1, line: 494, type: !357)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !680, file: !1, line: 495, type: !692)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 800, align: 8, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 100)
!695 = !DISubprogram(name: "faulthandler_thread", scope: !1, file: !1, line: 430, type: !345, isLocal: true, isDefinition: true, scopeLine: 431, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @faulthandler_thread, variables: !696)
!696 = !{!697, !698, !700, !701, !702, !703, !706, !714, !715, !718}
!697 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 1, scope: !695, file: !1, line: 430, type: !18)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !695, file: !1, line: 432, type: !699)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLockStatus", file: !4, line: 18, baseType: !3)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errmsg", scope: !695, file: !1, line: 433, type: !43)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "current", scope: !695, file: !1, line: 434, type: !489)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ok", scope: !695, file: !1, line: 435, type: !58)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "set", scope: !695, file: !1, line: 437, type: !704)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !705, line: 37, baseType: !473)
!705 = !DIFile(filename: "/usr/include/sys/select.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !707, file: !1, line: 455, type: !709)
!707 = distinct !DILexicalBlock(scope: !708, file: !1, line: 455, column: 19)
!708 = distinct !DILexicalBlock(scope: !695, file: !1, line: 444, column: 8)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64, align: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !10, line: 33, baseType: !711)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !10, line: 31, size: 64, align: 64, elements: !712)
!712 = !{!713}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !711, file: !10, line: 32, baseType: !18, size: 64, align: 64)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !707, file: !1, line: 455, type: !18)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !707, file: !1, line: 455, type: !716)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64, align: 64)
!717 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !18)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !707, file: !1, line: 455, type: !719)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !10, line: 29, baseType: !9)
!720 = !DISubprogram(name: "_Py_ANNOTATE_MEMORY_ORDER", scope: !10, file: !10, line: 59, type: !721, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, variables: !726)
!721 = !DISubroutineType(types: !722)
!722 = !{null, !723, !719}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64, align: 64)
!724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !725)
!725 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!726 = !{!727, !728}
!727 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "address", arg: 1, scope: !720, file: !10, line: 59, type: !723)
!728 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 2, scope: !720, file: !10, line: 59, type: !719)
!729 = !DISubprogram(name: "_Py_atomic_thread_fence", scope: !10, file: !10, line: 51, type: !730, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, variables: !732)
!730 = !DISubroutineType(types: !731)
!731 = !{null, !719}
!732 = !{!733}
!733 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !729, file: !10, line: 51, type: !719)
!734 = !DISubprogram(name: "_Py_atomic_signal_fence", scope: !10, file: !10, line: 44, type: !730, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, variables: !735)
!735 = !{!736}
!736 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !734, file: !10, line: 44, type: !719)
!737 = !DISubprogram(name: "faulthandler_cancel_dump_traceback_later_py", scope: !1, file: !1, line: 591, type: !130, isLocal: true, isDefinition: true, scopeLine: 592, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @faulthandler_cancel_dump_traceback_later_py, variables: !738)
!738 = !{!739}
!739 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !737, file: !1, line: 591, type: !19)
!740 = !DISubprogram(name: "faulthandler_register_py", scope: !1, file: !1, line: 708, type: !149, isLocal: true, isDefinition: true, scopeLine: 710, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @faulthandler_register_py, variables: !741)
!741 = !{!742, !743, !744, !745, !746, !747, !748, !749, !750, !762, !763, !764, !765, !767}
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !740, file: !1, line: 708, type: !19)
!743 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !740, file: !1, line: 709, type: !19)
!744 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !740, file: !1, line: 709, type: !19)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signum", scope: !740, file: !1, line: 712, type: !58)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file", scope: !740, file: !1, line: 713, type: !19)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "all_threads", scope: !740, file: !1, line: 714, type: !58)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chain", scope: !740, file: !1, line: 715, type: !58)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !740, file: !1, line: 716, type: !58)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "user", scope: !740, file: !1, line: 717, type: !751)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_signal_t", file: !1, line: 84, baseType: !753)
!753 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 76, size: 1536, align: 64, elements: !754)
!754 = !{!755, !756, !757, !758, !759, !760, !761}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !753, file: !1, line: 77, baseType: !58, size: 32, align: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !753, file: !1, line: 78, baseType: !19, size: 64, align: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !753, file: !1, line: 79, baseType: !58, size: 32, align: 32, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "all_threads", scope: !753, file: !1, line: 80, baseType: !58, size: 32, align: 32, offset: 160)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !753, file: !1, line: 81, baseType: !58, size: 32, align: 32, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !753, file: !1, line: 82, baseType: !391, size: 1216, align: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !753, file: !1, line: 83, baseType: !498, size: 64, align: 64, offset: 1472)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "previous", scope: !740, file: !1, line: 718, type: !391)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !740, file: !1, line: 719, type: !489)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !740, file: !1, line: 720, type: !58)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !766, file: !1, line: 756, type: !19)
!766 = distinct !DILexicalBlock(scope: !740, file: !1, line: 756, column: 5)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !768, file: !1, line: 756, type: !19)
!768 = distinct !DILexicalBlock(scope: !769, file: !1, line: 756, column: 5)
!769 = distinct !DILexicalBlock(scope: !766, file: !1, line: 756, column: 5)
!770 = !DISubprogram(name: "check_signum", scope: !1, file: !1, line: 687, type: !771, isLocal: true, isDefinition: true, scopeLine: 688, flags: DIFlagPrototyped, isOptimized: true, variables: !773)
!771 = !DISubroutineType(types: !772)
!772 = !{!58, !58}
!773 = !{!774, !775}
!774 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "signum", arg: 1, scope: !770, file: !1, line: 687, type: !58)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !770, file: !1, line: 689, type: !355)
!776 = !DISubprogram(name: "faulthandler_register", scope: !1, file: !1, line: 600, type: !777, isLocal: true, isDefinition: true, scopeLine: 601, flags: DIFlagPrototyped, isOptimized: true, variables: !780)
!777 = !DISubroutineType(types: !778)
!778 = !{!58, !58, !58, !779}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!780 = !{!781, !782, !783, !784}
!781 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "signum", arg: 1, scope: !776, file: !1, line: 600, type: !58)
!782 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chain", arg: 2, scope: !776, file: !1, line: 600, type: !58)
!783 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_previous", arg: 3, scope: !776, file: !1, line: 600, type: !779)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "action", scope: !776, file: !1, line: 603, type: !392)
!785 = !DISubprogram(name: "faulthandler_user", scope: !1, file: !1, line: 640, type: !402, isLocal: true, isDefinition: true, scopeLine: 641, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @faulthandler_user, variables: !786)
!786 = !{!787, !788, !789, !790}
!787 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "signum", arg: 1, scope: !785, file: !1, line: 640, type: !58)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "user", scope: !785, file: !1, line: 642, type: !751)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !785, file: !1, line: 643, type: !489)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "save_errno", scope: !785, file: !1, line: 644, type: !58)
!791 = !DISubprogram(name: "faulthandler_unregister_py", scope: !1, file: !1, line: 785, type: !140, isLocal: true, isDefinition: true, scopeLine: 786, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @faulthandler_unregister_py, variables: !792)
!792 = !{!793, !794, !795, !796, !797}
!793 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !791, file: !1, line: 785, type: !19)
!794 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !791, file: !1, line: 785, type: !19)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signum", scope: !791, file: !1, line: 787, type: !58)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "user", scope: !791, file: !1, line: 788, type: !751)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "change", scope: !791, file: !1, line: 789, type: !58)
!798 = !DISubprogram(name: "faulthandler_read_null", scope: !1, file: !1, line: 808, type: !140, isLocal: true, isDefinition: true, scopeLine: 809, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @faulthandler_read_null, variables: !799)
!799 = !{!800, !801, !802, !805, !806, !807}
!800 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !798, file: !1, line: 808, type: !19)
!801 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !798, file: !1, line: 808, type: !19)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !798, file: !1, line: 810, type: !803)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64, align: 64)
!804 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !798, file: !1, line: 811, type: !804)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "release_gil", scope: !798, file: !1, line: 812, type: !58)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !808, file: !1, line: 818, type: !489)
!808 = distinct !DILexicalBlock(scope: !809, file: !1, line: 818, column: 9)
!809 = distinct !DILexicalBlock(scope: !810, file: !1, line: 817, column: 22)
!810 = distinct !DILexicalBlock(scope: !798, file: !1, line: 817, column: 9)
!811 = !DISubprogram(name: "faulthandler_sigsegv", scope: !1, file: !1, line: 828, type: !140, isLocal: true, isDefinition: true, scopeLine: 829, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @faulthandler_sigsegv, variables: !812)
!812 = !{!813, !814}
!813 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !811, file: !1, line: 828, type: !19)
!814 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !811, file: !1, line: 828, type: !19)
!815 = !DISubprogram(name: "faulthandler_sigabrt", scope: !1, file: !1, line: 866, type: !140, isLocal: true, isDefinition: true, scopeLine: 867, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @faulthandler_sigabrt, variables: !816)
!816 = !{!817, !818}
!817 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !815, file: !1, line: 866, type: !19)
!818 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !815, file: !1, line: 866, type: !19)
!819 = !DISubprogram(name: "faulthandler_sigfpe", scope: !1, file: !1, line: 851, type: !140, isLocal: true, isDefinition: true, scopeLine: 852, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @faulthandler_sigfpe, variables: !820)
!820 = !{!821, !822, !823, !824, !825}
!821 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !819, file: !1, line: 851, type: !19)
!822 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !819, file: !1, line: 851, type: !19)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !819, file: !1, line: 855, type: !804)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !819, file: !1, line: 855, type: !804)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !819, file: !1, line: 855, type: !804)
!826 = !DISubprogram(name: "faulthandler_sigbus", scope: !1, file: !1, line: 879, type: !140, isLocal: true, isDefinition: true, scopeLine: 880, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @faulthandler_sigbus, variables: !827)
!827 = !{!828, !829}
!828 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !826, file: !1, line: 879, type: !19)
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !826, file: !1, line: 879, type: !19)
!830 = !DISubprogram(name: "faulthandler_sigill", scope: !1, file: !1, line: 888, type: !140, isLocal: true, isDefinition: true, scopeLine: 889, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @faulthandler_sigill, variables: !831)
!831 = !{!832, !833}
!832 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !830, file: !1, line: 888, type: !19)
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !830, file: !1, line: 888, type: !19)
!834 = !DISubprogram(name: "faulthandler_fatal_error_py", scope: !1, file: !1, line: 896, type: !140, isLocal: true, isDefinition: true, scopeLine: 897, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @faulthandler_fatal_error_py, variables: !835)
!835 = !{!836, !837, !838}
!836 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !834, file: !1, line: 896, type: !19)
!837 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !834, file: !1, line: 896, type: !19)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "message", scope: !834, file: !1, line: 898, type: !66)
!839 = !DISubprogram(name: "faulthandler_stack_overflow", scope: !1, file: !1, line: 921, type: !130, isLocal: true, isDefinition: true, scopeLine: 922, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @faulthandler_stack_overflow, variables: !840)
!840 = !{!841, !842, !843, !844, !845}
!841 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !839, file: !1, line: 921, type: !19)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "depth", scope: !839, file: !1, line: 923, type: !108)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !839, file: !1, line: 923, type: !108)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sp", scope: !839, file: !1, line: 924, type: !66)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stop", scope: !839, file: !1, line: 924, type: !66)
!846 = !DISubprogram(name: "stack_overflow", scope: !1, file: !1, line: 907, type: !847, isLocal: true, isDefinition: true, scopeLine: 908, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i8*, i64*)* @stack_overflow, variables: !850)
!847 = !DISubroutineType(types: !848)
!848 = !{!18, !18, !18, !849}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!850 = !{!851, !852, !853, !854, !858}
!851 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min_sp", arg: 1, scope: !846, file: !1, line: 907, type: !18)
!852 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "max_sp", arg: 2, scope: !846, file: !1, line: 907, type: !18)
!853 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "depth", arg: 3, scope: !846, file: !1, line: 907, type: !849)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !846, file: !1, line: 910, type: !855)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 32768, align: 8, elements: !856)
!856 = !{!857}
!857 = !DISubrange(count: 4096)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sp", scope: !846, file: !1, line: 911, type: !18)
!859 = !DISubprogram(name: "faulthandler_traverse", scope: !1, file: !1, line: 944, type: !275, isLocal: true, isDefinition: true, scopeLine: 945, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)* @faulthandler_traverse, variables: !860)
!860 = !{!861, !862, !863, !864, !865, !869, !877}
!861 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !859, file: !1, line: 944, type: !19)
!862 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !859, file: !1, line: 944, type: !277)
!863 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !859, file: !1, line: 944, type: !18)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signum", scope: !859, file: !1, line: 947, type: !355)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !866, file: !1, line: 951, type: !58)
!866 = distinct !DILexicalBlock(scope: !867, file: !1, line: 951, column: 5)
!867 = distinct !DILexicalBlock(scope: !868, file: !1, line: 951, column: 5)
!868 = distinct !DILexicalBlock(scope: !859, file: !1, line: 951, column: 5)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !870, file: !1, line: 956, type: !58)
!870 = distinct !DILexicalBlock(scope: !871, file: !1, line: 956, column: 13)
!871 = distinct !DILexicalBlock(scope: !872, file: !1, line: 956, column: 13)
!872 = distinct !DILexicalBlock(scope: !873, file: !1, line: 956, column: 13)
!873 = distinct !DILexicalBlock(scope: !874, file: !1, line: 955, column: 9)
!874 = distinct !DILexicalBlock(scope: !875, file: !1, line: 955, column: 9)
!875 = distinct !DILexicalBlock(scope: !876, file: !1, line: 954, column: 31)
!876 = distinct !DILexicalBlock(scope: !859, file: !1, line: 954, column: 9)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !878, file: !1, line: 959, type: !58)
!878 = distinct !DILexicalBlock(scope: !879, file: !1, line: 959, column: 5)
!879 = distinct !DILexicalBlock(scope: !880, file: !1, line: 959, column: 5)
!880 = distinct !DILexicalBlock(scope: !859, file: !1, line: 959, column: 5)
!881 = !DISubprogram(name: "faulthandler_env_options", scope: !1, file: !1, line: 1054, type: !365, isLocal: true, isDefinition: true, scopeLine: 1055, flags: DIFlagPrototyped, isOptimized: true, variables: !882)
!882 = !{!883, !884, !885, !886, !887, !888, !891, !893, !895}
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xoptions", scope: !881, file: !1, line: 1056, type: !19)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !881, file: !1, line: 1056, type: !19)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "module", scope: !881, file: !1, line: 1056, type: !19)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !881, file: !1, line: 1056, type: !19)
!887 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !881, file: !1, line: 1057, type: !66)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "has_key", scope: !889, file: !1, line: 1062, type: !58)
!889 = distinct !DILexicalBlock(scope: !890, file: !1, line: 1059, column: 65)
!890 = distinct !DILexicalBlock(scope: !881, file: !1, line: 1059, column: 9)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !892, file: !1, line: 1073, type: !19)
!892 = distinct !DILexicalBlock(scope: !889, file: !1, line: 1073, column: 9)
