; ModuleID = 'fileutils.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!273 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!274 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!275 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!276 = !DIEnumerator(name: "THOUSEP", value: 65537)
!277 = !DIEnumerator(name: "__GROUPING", value: 65538)
!278 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!279 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!280 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!281 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!282 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!283 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!284 = !DIEnumerator(name: "__YESSTR", value: 327682)
!285 = !DIEnumerator(name: "__NOSTR", value: 327683)
!286 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!287 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!288 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!289 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!290 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!291 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!292 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!293 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!294 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!295 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!296 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!297 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!298 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!299 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!300 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!301 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!302 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!303 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!304 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!305 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!306 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!307 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!308 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!309 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!310 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!311 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!312 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!313 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!314 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!315 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!316 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!317 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!318 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!319 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!320 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!321 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!322 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!323 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!324 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!325 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!326 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!327 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!328 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!329 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!330 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!331 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!332 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!333 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!334 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!335 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!336 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!337 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!338 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!339 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!340 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!341 = !{!342, !427, !432, !681, !683, !389, !685, !381, !693, !695, !366, !684, !368}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !344, line: 109, baseType: !345)
!344 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !344, line: 105, size: 128, align: 64, elements: !346)
!346 = !{!347, !355}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !345, file: !344, line: 107, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !349, line: 177, baseType: !350)
!349 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !351, line: 102, baseType: !352)
!351 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !353, line: 181, baseType: !354)
!353 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!354 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !345, file: !344, line: 108, baseType: !356, size: 64, align: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !344, line: 334, size: 3200, align: 64, elements: !358)
!358 = !{!359, !365, !369, !370, !371, !376, !440, !445, !450, !451, !456, !508, !539, !551, !557, !558, !559, !561, !563, !594, !595, !596, !605, !606, !611, !612, !614, !616, !626, !629, !647, !648, !649, !651, !653, !654, !656, !661, !666, !671, !672, !673, !674, !675, !676, !677, !678, !680}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !357, file: !344, line: 335, baseType: !360, size: 192, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !344, line: 114, baseType: !361)
!361 = !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 111, size: 192, align: 64, elements: !362)
!362 = !{!363, !364}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !361, file: !344, line: 112, baseType: !343, size: 128, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !361, file: !344, line: 113, baseType: !348, size: 64, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !357, file: !344, line: 336, baseType: !366, size: 64, align: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!368 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !357, file: !344, line: 337, baseType: !348, size: 64, align: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !357, file: !344, line: 337, baseType: !348, size: 64, align: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !357, file: !344, line: 341, baseType: !372, size: 64, align: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !344, line: 308, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !342}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !357, file: !344, line: 342, baseType: !377, size: 64, align: 64, offset: 448)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !344, line: 314, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!381, !342, !382, !381}
!381 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !351, line: 48, baseType: !384)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !385, line: 246, size: 1728, align: 64, elements: !386)
!385 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!386 = !{!387, !388, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !408, !409, !410, !411, !413, !415, !417, !421, !424, !426, !428, !429, !430, !431, !435, !436}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !384, file: !385, line: 247, baseType: !381, size: 32, align: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !384, file: !385, line: 252, baseType: !389, size: 64, align: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !384, file: !385, line: 253, baseType: !389, size: 64, align: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !384, file: !385, line: 254, baseType: !389, size: 64, align: 64, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !384, file: !385, line: 255, baseType: !389, size: 64, align: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !384, file: !385, line: 256, baseType: !389, size: 64, align: 64, offset: 320)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !384, file: !385, line: 257, baseType: !389, size: 64, align: 64, offset: 384)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !384, file: !385, line: 258, baseType: !389, size: 64, align: 64, offset: 448)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !384, file: !385, line: 259, baseType: !389, size: 64, align: 64, offset: 512)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !384, file: !385, line: 261, baseType: !389, size: 64, align: 64, offset: 576)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !384, file: !385, line: 262, baseType: !389, size: 64, align: 64, offset: 640)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !384, file: !385, line: 263, baseType: !389, size: 64, align: 64, offset: 704)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !384, file: !385, line: 265, baseType: !401, size: 64, align: 64, offset: 768)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !385, line: 161, size: 192, align: 64, elements: !403)
!403 = !{!404, !405, !407}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !402, file: !385, line: 162, baseType: !401, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !402, file: !385, line: 163, baseType: !406, size: 64, align: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !402, file: !385, line: 167, baseType: !381, size: 32, align: 32, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !384, file: !385, line: 267, baseType: !406, size: 64, align: 64, offset: 832)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !384, file: !385, line: 269, baseType: !381, size: 32, align: 32, offset: 896)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !384, file: !385, line: 273, baseType: !381, size: 32, align: 32, offset: 928)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !384, file: !385, line: 275, baseType: !412, size: 64, align: 64, offset: 960)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !353, line: 140, baseType: !354)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !384, file: !385, line: 279, baseType: !414, size: 16, align: 16, offset: 1024)
!414 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !384, file: !385, line: 280, baseType: !416, size: 8, align: 8, offset: 1040)
!416 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !384, file: !385, line: 281, baseType: !418, size: 8, align: 8, offset: 1048)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 8, align: 8, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 1)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !384, file: !385, line: 285, baseType: !422, size: 64, align: 64, offset: 1088)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !385, line: 155, baseType: null)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !384, file: !385, line: 294, baseType: !425, size: 64, align: 64, offset: 1152)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !353, line: 141, baseType: !354)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !384, file: !385, line: 303, baseType: !427, size: 64, align: 64, offset: 1216)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !384, file: !385, line: 304, baseType: !427, size: 64, align: 64, offset: 1280)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !384, file: !385, line: 305, baseType: !427, size: 64, align: 64, offset: 1344)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !384, file: !385, line: 306, baseType: !427, size: 64, align: 64, offset: 1408)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !384, file: !385, line: 307, baseType: !432, size: 64, align: 64, offset: 1472)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !433, line: 62, baseType: !434)
!433 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!434 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !384, file: !385, line: 309, baseType: !381, size: 32, align: 32, offset: 1536)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !384, file: !385, line: 311, baseType: !437, size: 160, align: 8, offset: 1568)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 160, align: 8, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 20)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !357, file: !344, line: 343, baseType: !441, size: 64, align: 64, offset: 512)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !344, line: 316, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!342, !342, !389}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !357, file: !344, line: 344, baseType: !446, size: 64, align: 64, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !344, line: 318, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!381, !342, !389, !342}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !357, file: !344, line: 345, baseType: !427, size: 64, align: 64, offset: 640)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !357, file: !344, line: 346, baseType: !452, size: 64, align: 64, offset: 704)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !344, line: 320, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!342, !342}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !357, file: !344, line: 350, baseType: !457, size: 64, align: 64, offset: 768)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !344, line: 278, baseType: !459)
!459 = !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 236, size: 2176, align: 64, elements: !460)
!460 = !{!461, !466, !467, !468, !469, !470, !475, !477, !478, !479, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !459, file: !344, line: 241, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !344, line: 166, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!342, !342, !342}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !459, file: !344, line: 242, baseType: !462, size: 64, align: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !459, file: !344, line: 243, baseType: !462, size: 64, align: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !459, file: !344, line: 244, baseType: !462, size: 64, align: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !459, file: !344, line: 245, baseType: !462, size: 64, align: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !459, file: !344, line: 246, baseType: !471, size: 64, align: 64, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !344, line: 167, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!342, !342, !342, !342}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !459, file: !344, line: 247, baseType: !476, size: 64, align: 64, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !344, line: 165, baseType: !453)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !459, file: !344, line: 248, baseType: !476, size: 64, align: 64, offset: 448)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !459, file: !344, line: 249, baseType: !476, size: 64, align: 64, offset: 512)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !459, file: !344, line: 250, baseType: !480, size: 64, align: 64, offset: 576)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !344, line: 168, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!381, !342}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !459, file: !344, line: 251, baseType: !476, size: 64, align: 64, offset: 640)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !459, file: !344, line: 252, baseType: !462, size: 64, align: 64, offset: 704)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !459, file: !344, line: 253, baseType: !462, size: 64, align: 64, offset: 768)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !459, file: !344, line: 254, baseType: !462, size: 64, align: 64, offset: 832)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !459, file: !344, line: 255, baseType: !462, size: 64, align: 64, offset: 896)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !459, file: !344, line: 256, baseType: !462, size: 64, align: 64, offset: 960)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !459, file: !344, line: 257, baseType: !476, size: 64, align: 64, offset: 1024)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !459, file: !344, line: 258, baseType: !427, size: 64, align: 64, offset: 1088)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !459, file: !344, line: 259, baseType: !476, size: 64, align: 64, offset: 1152)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !459, file: !344, line: 261, baseType: !462, size: 64, align: 64, offset: 1216)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !459, file: !344, line: 262, baseType: !462, size: 64, align: 64, offset: 1280)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !459, file: !344, line: 263, baseType: !462, size: 64, align: 64, offset: 1344)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !459, file: !344, line: 264, baseType: !462, size: 64, align: 64, offset: 1408)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !459, file: !344, line: 265, baseType: !471, size: 64, align: 64, offset: 1472)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !459, file: !344, line: 266, baseType: !462, size: 64, align: 64, offset: 1536)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !459, file: !344, line: 267, baseType: !462, size: 64, align: 64, offset: 1600)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !459, file: !344, line: 268, baseType: !462, size: 64, align: 64, offset: 1664)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !459, file: !344, line: 269, baseType: !462, size: 64, align: 64, offset: 1728)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !459, file: !344, line: 270, baseType: !462, size: 64, align: 64, offset: 1792)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !459, file: !344, line: 272, baseType: !462, size: 64, align: 64, offset: 1856)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !459, file: !344, line: 273, baseType: !462, size: 64, align: 64, offset: 1920)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !459, file: !344, line: 274, baseType: !462, size: 64, align: 64, offset: 1984)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !459, file: !344, line: 275, baseType: !462, size: 64, align: 64, offset: 2048)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !459, file: !344, line: 277, baseType: !476, size: 64, align: 64, offset: 2112)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !357, file: !344, line: 351, baseType: !509, size: 64, align: 64, offset: 832)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !344, line: 292, baseType: !511)
!511 = !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 280, size: 640, align: 64, elements: !512)
!512 = !{!513, !518, !519, !524, !525, !526, !531, !532, !537, !538}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !511, file: !344, line: 281, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !344, line: 169, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64, align: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!348, !342}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !511, file: !344, line: 282, baseType: !462, size: 64, align: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !511, file: !344, line: 283, baseType: !520, size: 64, align: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !344, line: 170, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!342, !342, !348}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !511, file: !344, line: 284, baseType: !520, size: 64, align: 64, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !511, file: !344, line: 285, baseType: !427, size: 64, align: 64, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !511, file: !344, line: 286, baseType: !527, size: 64, align: 64, offset: 320)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !344, line: 172, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!381, !342, !348, !342}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !511, file: !344, line: 287, baseType: !427, size: 64, align: 64, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !511, file: !344, line: 288, baseType: !533, size: 64, align: 64, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !344, line: 231, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!381, !342, !342}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !511, file: !344, line: 290, baseType: !462, size: 64, align: 64, offset: 512)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !511, file: !344, line: 291, baseType: !520, size: 64, align: 64, offset: 576)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !357, file: !344, line: 352, baseType: !540, size: 64, align: 64, offset: 896)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !344, line: 298, baseType: !542)
!542 = !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 294, size: 192, align: 64, elements: !543)
!543 = !{!544, !545, !546}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !542, file: !344, line: 295, baseType: !514, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !542, file: !344, line: 296, baseType: !462, size: 64, align: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !542, file: !344, line: 297, baseType: !547, size: 64, align: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !344, line: 174, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64, align: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!381, !342, !342, !342}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !357, file: !344, line: 356, baseType: !552, size: 64, align: 64, offset: 960)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !344, line: 321, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64, align: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!556, !342}
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !349, line: 186, baseType: !348)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !357, file: !344, line: 357, baseType: !471, size: 64, align: 64, offset: 1024)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !357, file: !344, line: 358, baseType: !452, size: 64, align: 64, offset: 1088)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !357, file: !344, line: 359, baseType: !560, size: 64, align: 64, offset: 1152)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !344, line: 317, baseType: !463)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !357, file: !344, line: 360, baseType: !562, size: 64, align: 64, offset: 1216)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !344, line: 319, baseType: !548)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !357, file: !344, line: 363, baseType: !564, size: 64, align: 64, offset: 1280)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64, align: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !344, line: 304, baseType: !566)
!566 = !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 301, size: 128, align: 64, elements: !567)
!567 = !{!568, !589}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !566, file: !344, line: 302, baseType: !569, size: 64, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !344, line: 193, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64, align: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!381, !342, !573, !381}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !344, line: 191, baseType: !575)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !344, line: 178, size: 640, align: 64, elements: !576)
!576 = !{!577, !578, !579, !580, !581, !582, !583, !584, !586, !587, !588}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !575, file: !344, line: 179, baseType: !427, size: 64, align: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !575, file: !344, line: 180, baseType: !342, size: 64, align: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !575, file: !344, line: 181, baseType: !348, size: 64, align: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !575, file: !344, line: 182, baseType: !348, size: 64, align: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !575, file: !344, line: 184, baseType: !381, size: 32, align: 32, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !575, file: !344, line: 185, baseType: !381, size: 32, align: 32, offset: 288)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !575, file: !344, line: 186, baseType: !389, size: 64, align: 64, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !575, file: !344, line: 187, baseType: !585, size: 64, align: 64, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !575, file: !344, line: 188, baseType: !585, size: 64, align: 64, offset: 448)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !575, file: !344, line: 189, baseType: !585, size: 64, align: 64, offset: 512)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !575, file: !344, line: 190, baseType: !427, size: 64, align: 64, offset: 576)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !566, file: !344, line: 303, baseType: !590, size: 64, align: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !344, line: 194, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64, align: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !342, !573}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !357, file: !344, line: 366, baseType: !434, size: 64, align: 64, offset: 1344)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !357, file: !344, line: 368, baseType: !366, size: 64, align: 64, offset: 1408)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !357, file: !344, line: 372, baseType: !597, size: 64, align: 64, offset: 1472)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !344, line: 233, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64, align: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!381, !342, !601, !427}
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !344, line: 232, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64, align: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!381, !342, !427}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !357, file: !344, line: 375, baseType: !480, size: 64, align: 64, offset: 1536)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !357, file: !344, line: 379, baseType: !607, size: 64, align: 64, offset: 1600)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !344, line: 322, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!342, !342, !342, !381}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !357, file: !344, line: 382, baseType: !348, size: 64, align: 64, offset: 1664)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !357, file: !344, line: 385, baseType: !613, size: 64, align: 64, offset: 1728)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !344, line: 323, baseType: !453)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !357, file: !344, line: 386, baseType: !615, size: 64, align: 64, offset: 1792)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !344, line: 324, baseType: !453)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !357, file: !344, line: 389, baseType: !617, size: 64, align: 64, offset: 1856)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64, align: 64)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !619, line: 40, size: 256, align: 64, elements: !620)
!619 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!620 = !{!621, !622, !624, !625}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !618, file: !619, line: 41, baseType: !366, size: 64, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !618, file: !619, line: 42, baseType: !623, size: 64, align: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !619, line: 18, baseType: !463)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !618, file: !619, line: 43, baseType: !381, size: 32, align: 32, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !618, file: !619, line: 45, baseType: !366, size: 64, align: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !357, file: !344, line: 390, baseType: !627, size: 64, align: 64, offset: 1920)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64, align: 64)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !344, line: 390, flags: DIFlagFwdDecl)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !357, file: !344, line: 391, baseType: !630, size: 64, align: 64, offset: 1984)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !632, line: 11, size: 320, align: 64, elements: !633)
!632 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!633 = !{!634, !635, !640, !645, !646}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !631, file: !632, line: 12, baseType: !389, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !631, file: !632, line: 13, baseType: !636, size: 64, align: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !632, line: 8, baseType: !637)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64, align: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!342, !342, !427}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !631, file: !632, line: 14, baseType: !641, size: 64, align: 64, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !632, line: 9, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64, align: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!381, !342, !342, !427}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !631, file: !632, line: 15, baseType: !389, size: 64, align: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !631, file: !632, line: 16, baseType: !427, size: 64, align: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !357, file: !344, line: 392, baseType: !356, size: 64, align: 64, offset: 2048)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !357, file: !344, line: 393, baseType: !342, size: 64, align: 64, offset: 2112)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !357, file: !344, line: 394, baseType: !650, size: 64, align: 64, offset: 2176)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !344, line: 325, baseType: !472)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !357, file: !344, line: 395, baseType: !652, size: 64, align: 64, offset: 2240)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !344, line: 326, baseType: !548)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !357, file: !344, line: 396, baseType: !348, size: 64, align: 64, offset: 2304)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !357, file: !344, line: 397, baseType: !655, size: 64, align: 64, offset: 2368)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !344, line: 327, baseType: !548)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !357, file: !344, line: 398, baseType: !657, size: 64, align: 64, offset: 2432)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !344, line: 329, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64, align: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!342, !356, !348}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !357, file: !344, line: 399, baseType: !662, size: 64, align: 64, offset: 2496)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !344, line: 328, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64, align: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!342, !356, !342, !342}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !357, file: !344, line: 400, baseType: !667, size: 64, align: 64, offset: 2560)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !344, line: 307, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64, align: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{null, !427}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !357, file: !344, line: 401, baseType: !480, size: 64, align: 64, offset: 2624)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !357, file: !344, line: 402, baseType: !342, size: 64, align: 64, offset: 2688)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !357, file: !344, line: 403, baseType: !342, size: 64, align: 64, offset: 2752)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !357, file: !344, line: 404, baseType: !342, size: 64, align: 64, offset: 2816)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !357, file: !344, line: 405, baseType: !342, size: 64, align: 64, offset: 2880)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !357, file: !344, line: 406, baseType: !342, size: 64, align: 64, offset: 2944)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !357, file: !344, line: 407, baseType: !372, size: 64, align: 64, offset: 3008)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !357, file: !344, line: 410, baseType: !679, size: 32, align: 32, offset: 3072)
!679 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !357, file: !344, line: 412, baseType: !372, size: 64, align: 64, offset: 3136)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64, align: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !433, line: 90, baseType: !381)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64, align: 64)
!684 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !687, line: 41, baseType: !688)
!687 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!688 = !DICompositeType(tag: DW_TAG_structure_type, file: !687, line: 31, size: 320, align: 64, elements: !689)
!689 = !{!690, !691, !692}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !688, file: !687, line: 32, baseType: !360, size: 192, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !688, file: !687, line: 33, baseType: !556, size: 64, align: 64, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !688, file: !687, line: 34, baseType: !418, size: 8, align: 8, offset: 256)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64, align: 64)
!694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !684)
!697 = !{!698, !705, !739, !759, !804, !814, !819, !827, !835, !848, !855, !865, !880, !892, !901, !964, !1002, !1009, !1018, !1045, !1052, !1067}
!698 = !DISubprogram(name: "_Py_device_encoding", scope: !1, file: !1, line: 37, type: !699, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32)* @_Py_device_encoding, variables: !701)
!699 = !DISubroutineType(types: !700)
!700 = !{!342, !381}
!701 = !{!702, !703}
!702 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !698, file: !1, line: 37, type: !381)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codeset", scope: !704, file: !1, line: 58, type: !389)
!704 = distinct !DILexicalBlock(scope: !698, file: !1, line: 57, column: 5)
!705 = !DISubprogram(name: "_Py_char2wchar", scope: !1, file: !1, line: 261, type: !706, isLocal: false, isDefinition: true, scopeLine: 262, flags: DIFlagPrototyped, isOptimized: true, function: i32* (i8*, i64*)* @_Py_char2wchar, variables: !709)
!706 = !DISubroutineType(types: !707)
!707 = !{!681, !366, !708}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717, !732, !737}
!710 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 1, scope: !705, file: !1, line: 261, type: !366)
!711 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !705, file: !1, line: 261, type: !708)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !705, file: !1, line: 274, type: !681)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "argsize", scope: !705, file: !1, line: 275, type: !432)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !705, file: !1, line: 276, type: !432)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !705, file: !1, line: 278, type: !683)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !705, file: !1, line: 279, type: !681)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mbs", scope: !705, file: !1, line: 280, type: !718)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !719, line: 106, baseType: !720)
!719 = !DIFile(filename: "/usr/include/wchar.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !719, line: 94, baseType: !721)
!721 = !DICompositeType(tag: DW_TAG_structure_type, file: !719, line: 82, size: 64, align: 32, elements: !722)
!722 = !{!723, !724}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !721, file: !719, line: 84, baseType: !381, size: 32, align: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !721, file: !719, line: 93, baseType: !725, size: 32, align: 32, offset: 32)
!725 = !DICompositeType(tag: DW_TAG_union_type, scope: !721, file: !719, line: 85, size: 32, align: 32, elements: !726)
!726 = !{!727, !728}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !725, file: !719, line: 88, baseType: !679, size: 32, align: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !725, file: !719, line: 92, baseType: !729, size: 32, align: 8)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 32, align: 8, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 4)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !733, file: !1, line: 311, type: !681)
!733 = distinct !DILexicalBlock(scope: !734, file: !1, line: 310, column: 34)
!734 = distinct !DILexicalBlock(scope: !735, file: !1, line: 310, column: 13)
!735 = distinct !DILexicalBlock(scope: !736, file: !1, line: 305, column: 32)
!736 = distinct !DILexicalBlock(scope: !705, file: !1, line: 305, column: 9)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "converted", scope: !738, file: !1, line: 339, type: !432)
!738 = distinct !DILexicalBlock(scope: !705, file: !1, line: 338, column: 21)
!739 = !DISubprogram(name: "_Py_wchar2char", scope: !1, file: !1, line: 404, type: !740, isLocal: false, isDefinition: true, scopeLine: 405, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32*, i64*)* @_Py_wchar2char, variables: !744)
!740 = !DISubroutineType(types: !741)
!741 = !{!389, !742, !708}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64, align: 64)
!743 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !682)
!744 = !{!745, !746, !747, !749, !750, !751, !752, !753, !754, !755}
!745 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "text", arg: 1, scope: !739, file: !1, line: 404, type: !742)
!746 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "error_pos", arg: 2, scope: !739, file: !1, line: 404, type: !708)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !739, file: !1, line: 437, type: !748)
!748 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !739, file: !1, line: 438, type: !389)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !739, file: !1, line: 438, type: !389)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !739, file: !1, line: 439, type: !432)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !739, file: !1, line: 439, type: !432)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "converted", scope: !739, file: !1, line: 439, type: !432)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !739, file: !1, line: 440, type: !682)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !739, file: !1, line: 440, type: !756)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 64, align: 32, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 2)
!759 = !DISubprogram(name: "_Py_wstat", scope: !1, file: !1, line: 519, type: !760, isLocal: false, isDefinition: true, scopeLine: 520, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32*, %struct.stat*)* @_Py_wstat, variables: !799)
!760 = !DISubroutineType(types: !761)
!761 = !{!381, !742, !762}
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64, align: 64)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !764, line: 46, size: 1152, align: 64, elements: !765)
!764 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!765 = !{!766, !768, !770, !772, !774, !776, !778, !779, !780, !781, !783, !785, !793, !794, !795}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !763, file: !764, line: 48, baseType: !767, size: 64, align: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !353, line: 133, baseType: !434)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !763, file: !764, line: 53, baseType: !769, size: 64, align: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !353, line: 136, baseType: !434)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !763, file: !764, line: 61, baseType: !771, size: 64, align: 64, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !353, line: 139, baseType: !434)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !763, file: !764, line: 62, baseType: !773, size: 32, align: 32, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !353, line: 138, baseType: !679)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !763, file: !764, line: 64, baseType: !775, size: 32, align: 32, offset: 224)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !353, line: 134, baseType: !679)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !763, file: !764, line: 65, baseType: !777, size: 32, align: 32, offset: 256)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !353, line: 135, baseType: !679)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !763, file: !764, line: 67, baseType: !381, size: 32, align: 32, offset: 288)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !763, file: !764, line: 69, baseType: !767, size: 64, align: 64, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !763, file: !764, line: 74, baseType: !412, size: 64, align: 64, offset: 384)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !763, file: !764, line: 78, baseType: !782, size: 64, align: 64, offset: 448)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !353, line: 162, baseType: !354)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !763, file: !764, line: 80, baseType: !784, size: 64, align: 64, offset: 512)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !353, line: 167, baseType: !354)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !763, file: !764, line: 91, baseType: !786, size: 128, align: 64, offset: 576)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !787, line: 120, size: 128, align: 64, elements: !788)
!787 = !DIFile(filename: "/usr/include/time.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!788 = !{!789, !791}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !786, file: !787, line: 122, baseType: !790, size: 64, align: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !353, line: 148, baseType: !354)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !786, file: !787, line: 123, baseType: !792, size: 64, align: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !353, line: 184, baseType: !354)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !763, file: !764, line: 92, baseType: !786, size: 128, align: 64, offset: 704)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !763, file: !764, line: 93, baseType: !786, size: 128, align: 64, offset: 832)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !763, file: !764, line: 106, baseType: !796, size: 192, align: 64, offset: 960)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !792, size: 192, align: 64, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 3)
!799 = !{!800, !801, !802, !803}
!800 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 1, scope: !759, file: !1, line: 519, type: !742)
!801 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 2, scope: !759, file: !1, line: 519, type: !762)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !759, file: !1, line: 521, type: !381)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fname", scope: !759, file: !1, line: 522, type: !389)
!804 = !DISubprogram(name: "_Py_stat", scope: !1, file: !1, line: 543, type: !805, isLocal: false, isDefinition: true, scopeLine: 544, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct.stat*)* @_Py_stat, variables: !807)
!805 = !DISubroutineType(types: !806)
!806 = !{!381, !342, !762}
!807 = !{!808, !809, !810, !811, !812}
!808 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 1, scope: !804, file: !1, line: 543, type: !342)
!809 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "statbuf", arg: 2, scope: !804, file: !1, line: 543, type: !762)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !804, file: !1, line: 558, type: !381)
!811 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !804, file: !1, line: 559, type: !342)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !813, file: !1, line: 563, type: !342)
!813 = distinct !DILexicalBlock(scope: !804, file: !1, line: 563, column: 5)
!814 = !DISubprogram(name: "_Py_get_inheritable", scope: !1, file: !1, line: 614, type: !815, isLocal: false, isDefinition: true, scopeLine: 615, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @_Py_get_inheritable, variables: !817)
!815 = !DISubroutineType(types: !816)
!816 = !{!381, !381}
!817 = !{!818}
!818 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !814, file: !1, line: 614, type: !381)
!819 = !DISubprogram(name: "_Py_set_inheritable", scope: !1, file: !1, line: 735, type: !820, isLocal: false, isDefinition: true, scopeLine: 736, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32*)* @_Py_set_inheritable, variables: !823)
!820 = !DISubroutineType(types: !821)
!821 = !{!381, !381, !381, !822}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!823 = !{!824, !825, !826}
!824 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !819, file: !1, line: 735, type: !381)
!825 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inheritable", arg: 2, scope: !819, file: !1, line: 735, type: !381)
!826 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atomic_flag_works", arg: 3, scope: !819, file: !1, line: 735, type: !822)
!827 = !DISubprogram(name: "_Py_open", scope: !1, file: !1, line: 743, type: !828, isLocal: false, isDefinition: true, scopeLine: 744, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32)* @_Py_open, variables: !830)
!828 = !DISubroutineType(types: !829)
!829 = !{!381, !366, !381}
!830 = !{!831, !832, !833, !834}
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pathname", arg: 1, scope: !827, file: !1, line: 743, type: !366)
!832 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 2, scope: !827, file: !1, line: 743, type: !381)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !827, file: !1, line: 745, type: !381)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_flag_works", scope: !827, file: !1, line: 752, type: !822)
!835 = !DISubprogram(name: "_Py_wfopen", scope: !1, file: !1, line: 775, type: !836, isLocal: false, isDefinition: true, scopeLine: 776, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IO_FILE* (i32*, i32*)* @_Py_wfopen, variables: !838)
!836 = !DISubroutineType(types: !837)
!837 = !{!382, !742, !742}
!838 = !{!839, !840, !841, !842, !843, !847}
!839 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 1, scope: !835, file: !1, line: 775, type: !742)
!840 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 2, scope: !835, file: !1, line: 775, type: !742)
!841 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !835, file: !1, line: 777, type: !382)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cpath", scope: !835, file: !1, line: 779, type: !389)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmode", scope: !835, file: !1, line: 780, type: !844)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 80, align: 8, elements: !845)
!845 = !{!846}
!846 = !DISubrange(count: 10)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !835, file: !1, line: 781, type: !432)
!848 = !DISubprogram(name: "_Py_fopen", scope: !1, file: !1, line: 806, type: !849, isLocal: false, isDefinition: true, scopeLine: 807, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IO_FILE* (i8*, i8*)* @_Py_fopen, variables: !851)
!849 = !DISubroutineType(types: !850)
!850 = !{!382, !366, !366}
!851 = !{!852, !853, !854}
!852 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pathname", arg: 1, scope: !848, file: !1, line: 806, type: !366)
!853 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 2, scope: !848, file: !1, line: 806, type: !366)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !848, file: !1, line: 808, type: !382)
!855 = !DISubprogram(name: "_Py_fopen_obj", scope: !1, file: !1, line: 825, type: !856, isLocal: false, isDefinition: true, scopeLine: 826, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IO_FILE* (%struct._object*, i8*)* @_Py_fopen_obj, variables: !858)
!856 = !DISubroutineType(types: !857)
!857 = !{!382, !342, !366}
!858 = !{!859, !860, !861, !862, !863}
!859 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 1, scope: !855, file: !1, line: 825, type: !342)
!860 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 2, scope: !855, file: !1, line: 825, type: !366)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !855, file: !1, line: 827, type: !382)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !855, file: !1, line: 849, type: !342)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !864, file: !1, line: 853, type: !342)
!864 = distinct !DILexicalBlock(scope: !855, file: !1, line: 853, column: 5)
!865 = !DISubprogram(name: "_Py_wreadlink", scope: !1, file: !1, line: 870, type: !866, isLocal: false, isDefinition: true, scopeLine: 871, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32*, i32*, i64)* @_Py_wreadlink, variables: !868)
!866 = !DISubroutineType(types: !867)
!867 = !{!381, !742, !681, !432}
!868 = !{!869, !870, !871, !872, !873, !877, !878, !879}
!869 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 1, scope: !865, file: !1, line: 870, type: !742)
!870 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 2, scope: !865, file: !1, line: 870, type: !681)
!871 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bufsiz", arg: 3, scope: !865, file: !1, line: 870, type: !432)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cpath", scope: !865, file: !1, line: 872, type: !389)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cbuf", scope: !865, file: !1, line: 873, type: !874)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 32768, align: 8, elements: !875)
!875 = !{!876}
!876 = !DISubrange(count: 4096)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wbuf", scope: !865, file: !1, line: 874, type: !681)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !865, file: !1, line: 875, type: !381)
!879 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r1", scope: !865, file: !1, line: 876, type: !432)
!880 = !DISubprogram(name: "_Py_wrealpath", scope: !1, file: !1, line: 915, type: !881, isLocal: false, isDefinition: true, scopeLine: 917, flags: DIFlagPrototyped, isOptimized: true, function: i32* (i32*, i32*, i64)* @_Py_wrealpath, variables: !883)
!881 = !DISubroutineType(types: !882)
!882 = !{!681, !742, !681, !432}
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891}
!884 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 1, scope: !880, file: !1, line: 915, type: !742)
!885 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "resolved_path", arg: 2, scope: !880, file: !1, line: 916, type: !681)
!886 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "resolved_path_size", arg: 3, scope: !880, file: !1, line: 916, type: !432)
!887 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cpath", scope: !880, file: !1, line: 918, type: !389)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cresolved_path", scope: !880, file: !1, line: 919, type: !874)
!889 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wresolved_path", scope: !880, file: !1, line: 920, type: !681)
!890 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !880, file: !1, line: 921, type: !389)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !880, file: !1, line: 922, type: !432)
!892 = !DISubprogram(name: "_Py_wgetcwd", scope: !1, file: !1, line: 954, type: !893, isLocal: false, isDefinition: true, scopeLine: 955, flags: DIFlagPrototyped, isOptimized: true, function: i32* (i32*, i64)* @_Py_wgetcwd, variables: !895)
!893 = !DISubroutineType(types: !894)
!894 = !{!681, !681, !432}
!895 = !{!896, !897, !898, !899, !900}
!896 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 1, scope: !892, file: !1, line: 954, type: !681)
!897 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !892, file: !1, line: 954, type: !432)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fname", scope: !892, file: !1, line: 960, type: !874)
!899 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wname", scope: !892, file: !1, line: 961, type: !681)
!900 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !892, file: !1, line: 962, type: !432)
!901 = !DISubprogram(name: "_Py_dup", scope: !1, file: !1, line: 985, type: !815, isLocal: false, isDefinition: true, scopeLine: 986, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @_Py_dup, variables: !902)
!902 = !{!903, !904}
!903 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !901, file: !1, line: 985, type: !381)
!904 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !905, file: !1, line: 1023, type: !906)
!905 = distinct !DILexicalBlock(scope: !901, file: !1, line: 1023, column: 5)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64, align: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !908, line: 139, baseType: !909)
!908 = !DIFile(filename: "Include/pystate.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !908, line: 69, size: 1536, align: 64, elements: !910)
!910 = !{!911, !913, !914, !934, !937, !938, !939, !940, !941, !942, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !909, file: !908, line: 72, baseType: !912, size: 64, align: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64, align: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !909, file: !908, line: 73, baseType: !912, size: 64, align: 64, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !909, file: !908, line: 74, baseType: !915, size: 64, align: 64, offset: 128)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64, align: 64)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !908, line: 44, baseType: !917)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !908, line: 19, size: 832, align: 64, elements: !918)
!918 = !{!919, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !917, file: !908, line: 21, baseType: !920, size: 64, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !917, file: !908, line: 22, baseType: !912, size: 64, align: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !917, file: !908, line: 24, baseType: !342, size: 64, align: 64, offset: 128)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !917, file: !908, line: 25, baseType: !342, size: 64, align: 64, offset: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !917, file: !908, line: 26, baseType: !342, size: 64, align: 64, offset: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !917, file: !908, line: 27, baseType: !342, size: 64, align: 64, offset: 320)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !917, file: !908, line: 28, baseType: !342, size: 64, align: 64, offset: 384)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !917, file: !908, line: 30, baseType: !342, size: 64, align: 64, offset: 448)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !917, file: !908, line: 31, baseType: !342, size: 64, align: 64, offset: 512)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !917, file: !908, line: 32, baseType: !342, size: 64, align: 64, offset: 576)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !917, file: !908, line: 33, baseType: !381, size: 32, align: 32, offset: 640)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !917, file: !908, line: 34, baseType: !381, size: 32, align: 32, offset: 672)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !917, file: !908, line: 37, baseType: !381, size: 32, align: 32, offset: 704)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !917, file: !908, line: 43, baseType: !342, size: 64, align: 64, offset: 768)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !909, file: !908, line: 76, baseType: !935, size: 64, align: 64, offset: 192)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !908, line: 50, flags: DIFlagFwdDecl)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !909, file: !908, line: 77, baseType: !381, size: 32, align: 32, offset: 256)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !909, file: !908, line: 78, baseType: !368, size: 8, align: 8, offset: 288)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !909, file: !908, line: 80, baseType: !368, size: 8, align: 8, offset: 296)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !909, file: !908, line: 85, baseType: !381, size: 32, align: 32, offset: 320)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !909, file: !908, line: 86, baseType: !381, size: 32, align: 32, offset: 352)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !909, file: !908, line: 88, baseType: !943, size: 64, align: 64, offset: 384)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !908, line: 54, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!381, !342, !935, !381, !342}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !909, file: !908, line: 89, baseType: !943, size: 64, align: 64, offset: 448)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !909, file: !908, line: 90, baseType: !342, size: 64, align: 64, offset: 512)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !909, file: !908, line: 91, baseType: !342, size: 64, align: 64, offset: 576)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !909, file: !908, line: 93, baseType: !342, size: 64, align: 64, offset: 640)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !909, file: !908, line: 94, baseType: !342, size: 64, align: 64, offset: 704)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !909, file: !908, line: 95, baseType: !342, size: 64, align: 64, offset: 768)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !909, file: !908, line: 97, baseType: !342, size: 64, align: 64, offset: 832)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !909, file: !908, line: 98, baseType: !342, size: 64, align: 64, offset: 896)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !909, file: !908, line: 99, baseType: !342, size: 64, align: 64, offset: 960)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !909, file: !908, line: 101, baseType: !342, size: 64, align: 64, offset: 1024)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !909, file: !908, line: 103, baseType: !381, size: 32, align: 32, offset: 1088)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !909, file: !908, line: 105, baseType: !342, size: 64, align: 64, offset: 1152)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !909, file: !908, line: 106, baseType: !354, size: 64, align: 64, offset: 1216)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !909, file: !908, line: 108, baseType: !381, size: 32, align: 32, offset: 1280)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !909, file: !908, line: 109, baseType: !342, size: 64, align: 64, offset: 1344)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !909, file: !908, line: 134, baseType: !668, size: 64, align: 64, offset: 1408)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !909, file: !908, line: 135, baseType: !427, size: 64, align: 64, offset: 1472)
!964 = !DISubprogram(name: "check_force_ascii", scope: !1, file: !1, line: 95, type: !965, isLocal: true, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @check_force_ascii, variables: !967)
!965 = !DISubroutineType(types: !966)
!966 = !{!381}
!967 = !{!968, !969, !970, !972, !976, !977, !978, !982, !985, !986, !988, !989, !995, !996, !1000, !1001}
!968 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc", scope: !964, file: !1, line: 97, type: !389)
!969 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codeset", scope: !964, file: !1, line: 99, type: !389)
!970 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alias", scope: !964, file: !1, line: 99, type: !971)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!972 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "encoding", scope: !964, file: !1, line: 100, type: !973)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 800, align: 8, elements: !974)
!974 = !{!975}
!975 = !DISubrange(count: 100)
!976 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "is_ascii", scope: !964, file: !1, line: 101, type: !381)
!977 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !964, file: !1, line: 102, type: !679)
!978 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ascii_aliases", scope: !964, file: !1, line: 103, type: !979)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 896, align: 64, elements: !980)
!980 = !{!981}
!981 = !DISubrange(count: 14)
!982 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !983, file: !1, line: 124, type: !432)
!983 = distinct !DILexicalBlock(scope: !984, file: !1, line: 124, column: 9)
!984 = distinct !DILexicalBlock(scope: !964, file: !1, line: 124, column: 9)
!985 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !983, file: !1, line: 124, type: !432)
!986 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !987, file: !1, line: 124, type: !695)
!987 = distinct !DILexicalBlock(scope: !983, file: !1, line: 124, column: 9)
!988 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !987, file: !1, line: 124, type: !381)
!989 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !990, file: !1, line: 140, type: !432)
!990 = distinct !DILexicalBlock(scope: !991, file: !1, line: 140, column: 13)
!991 = distinct !DILexicalBlock(scope: !992, file: !1, line: 140, column: 13)
!992 = distinct !DILexicalBlock(scope: !993, file: !1, line: 139, column: 56)
!993 = distinct !DILexicalBlock(scope: !994, file: !1, line: 139, column: 5)
!994 = distinct !DILexicalBlock(scope: !964, file: !1, line: 139, column: 5)
!995 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !990, file: !1, line: 140, type: !432)
!996 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch", scope: !997, file: !1, line: 151, type: !684)
!997 = distinct !DILexicalBlock(scope: !998, file: !1, line: 150, column: 31)
!998 = distinct !DILexicalBlock(scope: !999, file: !1, line: 150, column: 5)
!999 = distinct !DILexicalBlock(scope: !964, file: !1, line: 150, column: 5)
!1000 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wch", scope: !997, file: !1, line: 152, type: !682)
!1001 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !997, file: !1, line: 153, type: !432)
!1002 = !DISubprogram(name: "decode_ascii_surrogateescape", scope: !1, file: !1, line: 218, type: !706, isLocal: true, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, variables: !1003)
!1003 = !{!1004, !1005, !1006, !1007, !1008}
!1004 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 1, scope: !1002, file: !1, line: 218, type: !366)
!1005 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !1002, file: !1, line: 218, type: !708)
!1006 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !1002, file: !1, line: 220, type: !681)
!1007 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !1002, file: !1, line: 221, type: !683)
!1008 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !1002, file: !1, line: 222, type: !681)
!1009 = !DISubprogram(name: "encode_ascii_surrogateescape", scope: !1, file: !1, line: 177, type: !740, isLocal: true, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: true, variables: !1010)
!1010 = !{!1011, !1012, !1013, !1014, !1015, !1016, !1017}
!1011 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "text", arg: 1, scope: !1009, file: !1, line: 177, type: !742)
!1012 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "error_pos", arg: 2, scope: !1009, file: !1, line: 177, type: !708)
!1013 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !1009, file: !1, line: 179, type: !389)
!1014 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !1009, file: !1, line: 179, type: !389)
!1015 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !1009, file: !1, line: 180, type: !432)
!1016 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !1009, file: !1, line: 180, type: !432)
!1017 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch", scope: !1009, file: !1, line: 181, type: !682)
!1018 = !DISubprogram(name: "stat64", scope: !1019, file: !1019, line: 503, type: !1020, isLocal: false, isDefinition: true, scopeLine: 504, flags: DIFlagPrototyped, isOptimized: true, variables: !1042)
!1019 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!381, !366, !1022}
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !764, line: 119, size: 1152, align: 64, elements: !1024)
!1024 = !{!1025, !1026, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1038, !1039, !1040, !1041}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1023, file: !764, line: 121, baseType: !767, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1023, file: !764, line: 123, baseType: !1027, size: 64, align: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !353, line: 137, baseType: !434)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1023, file: !764, line: 124, baseType: !771, size: 64, align: 64, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1023, file: !764, line: 125, baseType: !773, size: 32, align: 32, offset: 192)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1023, file: !764, line: 132, baseType: !775, size: 32, align: 32, offset: 224)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1023, file: !764, line: 133, baseType: !777, size: 32, align: 32, offset: 256)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1023, file: !764, line: 135, baseType: !381, size: 32, align: 32, offset: 288)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1023, file: !764, line: 136, baseType: !767, size: 64, align: 64, offset: 320)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1023, file: !764, line: 137, baseType: !412, size: 64, align: 64, offset: 384)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1023, file: !764, line: 143, baseType: !782, size: 64, align: 64, offset: 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1023, file: !764, line: 144, baseType: !1037, size: 64, align: 64, offset: 512)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !353, line: 168, baseType: !354)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1023, file: !764, line: 152, baseType: !786, size: 128, align: 64, offset: 576)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1023, file: !764, line: 153, baseType: !786, size: 128, align: 64, offset: 704)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1023, file: !764, line: 154, baseType: !786, size: 128, align: 64, offset: 832)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !1023, file: !764, line: 164, baseType: !796, size: 192, align: 64, offset: 960)
!1042 = !{!1043, !1044}
!1043 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__path", arg: 1, scope: !1018, file: !1019, line: 503, type: !366)
!1044 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__statbuf", arg: 2, scope: !1018, file: !1019, line: 503, type: !1022)
!1045 = !DISubprogram(name: "get_inheritable", scope: !1, file: !1, line: 571, type: !1046, isLocal: true, isDefinition: true, scopeLine: 572, flags: DIFlagPrototyped, isOptimized: true, variables: !1048)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!381, !381, !381}
!1048 = !{!1049, !1050, !1051}
!1049 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !1045, file: !1, line: 571, type: !381)
!1050 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "raise", arg: 2, scope: !1045, file: !1, line: 571, type: !381)
!1051 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !1045, file: !1, line: 598, type: !381)
!1052 = !DISubprogram(name: "set_inheritable", scope: !1, file: !1, line: 620, type: !1053, isLocal: true, isDefinition: true, scopeLine: 621, flags: DIFlagPrototyped, isOptimized: true, variables: !1055)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!381, !381, !381, !381, !822}
!1055 = !{!1056, !1057, !1058, !1059, !1060, !1061, !1062}
!1056 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !1052, file: !1, line: 620, type: !381)
!1057 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inheritable", arg: 2, scope: !1052, file: !1, line: 620, type: !381)
!1058 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "raise", arg: 3, scope: !1052, file: !1, line: 620, type: !381)
!1059 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atomic_flag_works", arg: 4, scope: !1052, file: !1, line: 620, type: !822)
!1060 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "request", scope: !1052, file: !1, line: 626, type: !381)
!1061 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !1052, file: !1, line: 627, type: !381)
!1062 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inheritable", scope: !1063, file: !1, line: 639, type: !381)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !1, line: 638, column: 39)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !1, line: 638, column: 13)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !1, line: 637, column: 52)
!1066 = distinct !DILexicalBlock(scope: !1052, file: !1, line: 637, column: 9)
!1067 = !DISubprogram(name: "make_non_inheritable", scope: !1, file: !1, line: 712, type: !815, isLocal: true, isDefinition: true, scopeLine: 713, flags: DIFlagPrototyped, isOptimized: true, variables: !1068)
!1068 = !{!1069}
!1069 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !1067, file: !1, line: 712, type: !381)
!1070 = !{!1071, !1072}
!1071 = !DIGlobalVariable(name: "_Py_open_cloexec_works", scope: !0, file: !1, line: 33, type: !381, isLocal: false, isDefinition: true, variable: i32* @_Py_open_cloexec_works)
!1072 = !DIGlobalVariable(name: "force_ascii", scope: !0, file: !1, line: 92, type: !381, isLocal: true, isDefinition: true, variable: i32* @force_ascii)
!1073 = !{i32 2, !"Dwarf Version", i32 4}
!1074 = !{i32 2, !"Debug Info Version", i32 3}
!1075 = !{!"clang version 3.7.0 (tags/RELEASE_370/final)"}
!1076 = !DIExpression()
!1077 = !DILocation(line: 37, column: 25, scope: !698)
!1078 = !DILocation(line: 42, column: 31, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !698, file: !1, line: 42, column: 9)
!1080 = !DILocation(line: 42, column: 9, scope: !698)
!1081 = !DILocation(line: 43, column: 9, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1079, file: !1, line: 42, column: 43)
!1083 = !{!1084, !1085, i64 0}
!1084 = !{!"_object", !1085, i64 0, !1088, i64 8}
!1085 = !{!"long", !1086, i64 0}
!1086 = !{!"omnipotent char", !1087, i64 0}
