; ModuleID = 'fileio.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyMethodDef = type { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !391, globals: !867)
!1 = !DIFile(filename: "./Modules/_io/fileio.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !42, !365, !99, !94, !379, !387, !14, !390, !20}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "fileio", file: !1, line: 58, baseType: !6)
!6 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 46, size: 320, align: 64, elements: !7)
!7 = !{!8, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !6, file: !1, line: 47, baseType: !9, size: 128, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !10, line: 109, baseType: !11)
!10 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!11 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !10, line: 105, size: 128, align: 64, elements: !12)
!12 = !{!13, !21}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !11, file: !10, line: 107, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !15, line: 177, baseType: !16)
!15 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !17, line: 102, baseType: !18)
!17 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !19, line: 181, baseType: !20)
!19 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!20 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !11, file: !10, line: 108, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !10, line: 334, size: 3200, align: 64, elements: !24)
!24 = !{!25, !31, !35, !36, !37, !43, !107, !112, !117, !118, !123, !175, !206, !218, !224, !225, !226, !228, !230, !261, !262, !263, !272, !273, !278, !279, !281, !283, !293, !303, !321, !322, !323, !325, !327, !328, !330, !335, !340, !345, !346, !347, !348, !349, !350, !351, !352, !354}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !23, file: !10, line: 335, baseType: !26, size: 192, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !10, line: 114, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 111, size: 192, align: 64, elements: !28)
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !27, file: !10, line: 112, baseType: !9, size: 128, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !27, file: !10, line: 113, baseType: !14, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !23, file: !10, line: 336, baseType: !32, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !23, file: !10, line: 337, baseType: !14, size: 64, align: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !23, file: !10, line: 337, baseType: !14, size: 64, align: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !23, file: !10, line: 341, baseType: !38, size: 64, align: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !10, line: 308, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !42}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !23, file: !10, line: 342, baseType: !44, size: 64, align: 64, offset: 448)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !10, line: 314, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{!48, !42, !49, !48}
!48 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !17, line: 48, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !52, line: 246, size: 1728, align: 64, elements: !53)
!52 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!53 = !{!54, !55, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !75, !76, !77, !78, !80, !82, !84, !88, !91, !93, !95, !96, !97, !98, !102, !103}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !51, file: !52, line: 247, baseType: !48, size: 32, align: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !51, file: !52, line: 252, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !51, file: !52, line: 253, baseType: !56, size: 64, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !51, file: !52, line: 254, baseType: !56, size: 64, align: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !51, file: !52, line: 255, baseType: !56, size: 64, align: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !51, file: !52, line: 256, baseType: !56, size: 64, align: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !51, file: !52, line: 257, baseType: !56, size: 64, align: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !51, file: !52, line: 258, baseType: !56, size: 64, align: 64, offset: 448)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !51, file: !52, line: 259, baseType: !56, size: 64, align: 64, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !51, file: !52, line: 261, baseType: !56, size: 64, align: 64, offset: 576)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !51, file: !52, line: 262, baseType: !56, size: 64, align: 64, offset: 640)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !51, file: !52, line: 263, baseType: !56, size: 64, align: 64, offset: 704)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !51, file: !52, line: 265, baseType: !68, size: 64, align: 64, offset: 768)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !52, line: 161, size: 192, align: 64, elements: !70)
!70 = !{!71, !72, !74}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !69, file: !52, line: 162, baseType: !68, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !69, file: !52, line: 163, baseType: !73, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !69, file: !52, line: 167, baseType: !48, size: 32, align: 32, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !51, file: !52, line: 267, baseType: !73, size: 64, align: 64, offset: 832)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !51, file: !52, line: 269, baseType: !48, size: 32, align: 32, offset: 896)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !51, file: !52, line: 273, baseType: !48, size: 32, align: 32, offset: 928)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !51, file: !52, line: 275, baseType: !79, size: 64, align: 64, offset: 960)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !19, line: 140, baseType: !20)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !51, file: !52, line: 279, baseType: !81, size: 16, align: 16, offset: 1024)
!81 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !51, file: !52, line: 280, baseType: !83, size: 8, align: 8, offset: 1040)
!83 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !51, file: !52, line: 281, baseType: !85, size: 8, align: 8, offset: 1048)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 8, align: 8, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 1)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !51, file: !52, line: 285, baseType: !89, size: 64, align: 64, offset: 1088)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !52, line: 155, baseType: null)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !51, file: !52, line: 294, baseType: !92, size: 64, align: 64, offset: 1152)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !19, line: 141, baseType: !20)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !51, file: !52, line: 303, baseType: !94, size: 64, align: 64, offset: 1216)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !51, file: !52, line: 304, baseType: !94, size: 64, align: 64, offset: 1280)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !51, file: !52, line: 305, baseType: !94, size: 64, align: 64, offset: 1344)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !51, file: !52, line: 306, baseType: !94, size: 64, align: 64, offset: 1408)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !51, file: !52, line: 307, baseType: !99, size: 64, align: 64, offset: 1472)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !100, line: 62, baseType: !101)
!100 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!101 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !51, file: !52, line: 309, baseType: !48, size: 32, align: 32, offset: 1536)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !51, file: !52, line: 311, baseType: !104, size: 160, align: 8, offset: 1568)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 160, align: 8, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 20)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !23, file: !10, line: 343, baseType: !108, size: 64, align: 64, offset: 512)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !10, line: 316, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!42, !42, !56}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !23, file: !10, line: 344, baseType: !113, size: 64, align: 64, offset: 576)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !10, line: 318, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!48, !42, !56, !42}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !23, file: !10, line: 345, baseType: !94, size: 64, align: 64, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !23, file: !10, line: 346, baseType: !119, size: 64, align: 64, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !10, line: 320, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!42, !42}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !23, file: !10, line: 350, baseType: !124, size: 64, align: 64, offset: 768)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !10, line: 278, baseType: !126)
!126 = !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 236, size: 2176, align: 64, elements: !127)
!127 = !{!128, !133, !134, !135, !136, !137, !142, !144, !145, !146, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !126, file: !10, line: 241, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !10, line: 166, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!42, !42, !42}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !126, file: !10, line: 242, baseType: !129, size: 64, align: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !126, file: !10, line: 243, baseType: !129, size: 64, align: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !126, file: !10, line: 244, baseType: !129, size: 64, align: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !126, file: !10, line: 245, baseType: !129, size: 64, align: 64, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !126, file: !10, line: 246, baseType: !138, size: 64, align: 64, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !10, line: 167, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!42, !42, !42, !42}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !126, file: !10, line: 247, baseType: !143, size: 64, align: 64, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !10, line: 165, baseType: !120)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !126, file: !10, line: 248, baseType: !143, size: 64, align: 64, offset: 448)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !126, file: !10, line: 249, baseType: !143, size: 64, align: 64, offset: 512)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !126, file: !10, line: 250, baseType: !147, size: 64, align: 64, offset: 576)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !10, line: 168, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!48, !42}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !126, file: !10, line: 251, baseType: !143, size: 64, align: 64, offset: 640)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !126, file: !10, line: 252, baseType: !129, size: 64, align: 64, offset: 704)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !126, file: !10, line: 253, baseType: !129, size: 64, align: 64, offset: 768)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !126, file: !10, line: 254, baseType: !129, size: 64, align: 64, offset: 832)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !126, file: !10, line: 255, baseType: !129, size: 64, align: 64, offset: 896)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !126, file: !10, line: 256, baseType: !129, size: 64, align: 64, offset: 960)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !126, file: !10, line: 257, baseType: !143, size: 64, align: 64, offset: 1024)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !126, file: !10, line: 258, baseType: !94, size: 64, align: 64, offset: 1088)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !126, file: !10, line: 259, baseType: !143, size: 64, align: 64, offset: 1152)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !126, file: !10, line: 261, baseType: !129, size: 64, align: 64, offset: 1216)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !126, file: !10, line: 262, baseType: !129, size: 64, align: 64, offset: 1280)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !126, file: !10, line: 263, baseType: !129, size: 64, align: 64, offset: 1344)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !126, file: !10, line: 264, baseType: !129, size: 64, align: 64, offset: 1408)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !126, file: !10, line: 265, baseType: !138, size: 64, align: 64, offset: 1472)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !126, file: !10, line: 266, baseType: !129, size: 64, align: 64, offset: 1536)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !126, file: !10, line: 267, baseType: !129, size: 64, align: 64, offset: 1600)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !126, file: !10, line: 268, baseType: !129, size: 64, align: 64, offset: 1664)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !126, file: !10, line: 269, baseType: !129, size: 64, align: 64, offset: 1728)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !126, file: !10, line: 270, baseType: !129, size: 64, align: 64, offset: 1792)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !126, file: !10, line: 272, baseType: !129, size: 64, align: 64, offset: 1856)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !126, file: !10, line: 273, baseType: !129, size: 64, align: 64, offset: 1920)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !126, file: !10, line: 274, baseType: !129, size: 64, align: 64, offset: 1984)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !126, file: !10, line: 275, baseType: !129, size: 64, align: 64, offset: 2048)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !126, file: !10, line: 277, baseType: !143, size: 64, align: 64, offset: 2112)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !23, file: !10, line: 351, baseType: !176, size: 64, align: 64, offset: 832)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !10, line: 292, baseType: !178)
!178 = !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 280, size: 640, align: 64, elements: !179)
!179 = !{!180, !185, !186, !191, !192, !193, !198, !199, !204, !205}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !178, file: !10, line: 281, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !10, line: 169, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!14, !42}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !178, file: !10, line: 282, baseType: !129, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !178, file: !10, line: 283, baseType: !187, size: 64, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !10, line: 170, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!42, !42, !14}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !178, file: !10, line: 284, baseType: !187, size: 64, align: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !178, file: !10, line: 285, baseType: !94, size: 64, align: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !178, file: !10, line: 286, baseType: !194, size: 64, align: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !10, line: 172, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!48, !42, !14, !42}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !178, file: !10, line: 287, baseType: !94, size: 64, align: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !178, file: !10, line: 288, baseType: !200, size: 64, align: 64, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !10, line: 231, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!48, !42, !42}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !178, file: !10, line: 290, baseType: !129, size: 64, align: 64, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !178, file: !10, line: 291, baseType: !187, size: 64, align: 64, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !23, file: !10, line: 352, baseType: !207, size: 64, align: 64, offset: 896)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !10, line: 298, baseType: !209)
!209 = !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 294, size: 192, align: 64, elements: !210)
!210 = !{!211, !212, !213}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !209, file: !10, line: 295, baseType: !181, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !209, file: !10, line: 296, baseType: !129, size: 64, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !209, file: !10, line: 297, baseType: !214, size: 64, align: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !10, line: 174, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!48, !42, !42, !42}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !23, file: !10, line: 356, baseType: !219, size: 64, align: 64, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !10, line: 321, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!223, !42}
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !15, line: 186, baseType: !14)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !23, file: !10, line: 357, baseType: !138, size: 64, align: 64, offset: 1024)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !23, file: !10, line: 358, baseType: !119, size: 64, align: 64, offset: 1088)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !23, file: !10, line: 359, baseType: !227, size: 64, align: 64, offset: 1152)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !10, line: 317, baseType: !130)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !23, file: !10, line: 360, baseType: !229, size: 64, align: 64, offset: 1216)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !10, line: 319, baseType: !215)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !23, file: !10, line: 363, baseType: !231, size: 64, align: 64, offset: 1280)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !10, line: 304, baseType: !233)
!233 = !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 301, size: 128, align: 64, elements: !234)
!234 = !{!235, !256}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !233, file: !10, line: 302, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !10, line: 193, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!48, !42, !240, !48}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !10, line: 191, baseType: !242)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !10, line: 178, size: 640, align: 64, elements: !243)
!243 = !{!244, !245, !246, !247, !248, !249, !250, !251, !253, !254, !255}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !242, file: !10, line: 179, baseType: !94, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !242, file: !10, line: 180, baseType: !42, size: 64, align: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !242, file: !10, line: 181, baseType: !14, size: 64, align: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !242, file: !10, line: 182, baseType: !14, size: 64, align: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !242, file: !10, line: 184, baseType: !48, size: 32, align: 32, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !242, file: !10, line: 185, baseType: !48, size: 32, align: 32, offset: 288)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !242, file: !10, line: 186, baseType: !56, size: 64, align: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !242, file: !10, line: 187, baseType: !252, size: 64, align: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !242, file: !10, line: 188, baseType: !252, size: 64, align: 64, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !242, file: !10, line: 189, baseType: !252, size: 64, align: 64, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !242, file: !10, line: 190, baseType: !94, size: 64, align: 64, offset: 576)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !233, file: !10, line: 303, baseType: !257, size: 64, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !10, line: 194, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !42, !240}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !23, file: !10, line: 366, baseType: !101, size: 64, align: 64, offset: 1344)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !23, file: !10, line: 368, baseType: !32, size: 64, align: 64, offset: 1408)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !23, file: !10, line: 372, baseType: !264, size: 64, align: 64, offset: 1472)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !10, line: 233, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!48, !42, !268, !94}
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !10, line: 232, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!48, !42, !94}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !23, file: !10, line: 375, baseType: !147, size: 64, align: 64, offset: 1536)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !23, file: !10, line: 379, baseType: !274, size: 64, align: 64, offset: 1600)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !10, line: 322, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!42, !42, !42, !48}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !23, file: !10, line: 382, baseType: !14, size: 64, align: 64, offset: 1664)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !23, file: !10, line: 385, baseType: !280, size: 64, align: 64, offset: 1728)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !10, line: 323, baseType: !120)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !23, file: !10, line: 386, baseType: !282, size: 64, align: 64, offset: 1792)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !10, line: 324, baseType: !120)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !23, file: !10, line: 389, baseType: !284, size: 64, align: 64, offset: 1856)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !286, line: 40, size: 256, align: 64, elements: !287)
!286 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!287 = !{!288, !289, !291, !292}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !285, file: !286, line: 41, baseType: !32, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !285, file: !286, line: 42, baseType: !290, size: 64, align: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !286, line: 18, baseType: !130)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !285, file: !286, line: 43, baseType: !48, size: 32, align: 32, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !285, file: !286, line: 45, baseType: !32, size: 64, align: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !23, file: !10, line: 390, baseType: !294, size: 64, align: 64, offset: 1920)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !296, line: 18, size: 320, align: 64, elements: !297)
!296 = !DIFile(filename: "Include/structmember.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!297 = !{!298, !299, !300, !301, !302}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !295, file: !296, line: 19, baseType: !56, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !295, file: !296, line: 20, baseType: !48, size: 32, align: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !295, file: !296, line: 21, baseType: !14, size: 64, align: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !295, file: !296, line: 22, baseType: !48, size: 32, align: 32, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !295, file: !296, line: 23, baseType: !56, size: 64, align: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !23, file: !10, line: 391, baseType: !304, size: 64, align: 64, offset: 1984)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !306, line: 11, size: 320, align: 64, elements: !307)
!306 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!307 = !{!308, !309, !314, !319, !320}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !305, file: !306, line: 12, baseType: !56, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !305, file: !306, line: 13, baseType: !310, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !306, line: 8, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!42, !42, !94}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !305, file: !306, line: 14, baseType: !315, size: 64, align: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !306, line: 9, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!48, !42, !42, !94}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !305, file: !306, line: 15, baseType: !56, size: 64, align: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !305, file: !306, line: 16, baseType: !94, size: 64, align: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !23, file: !10, line: 392, baseType: !22, size: 64, align: 64, offset: 2048)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !23, file: !10, line: 393, baseType: !42, size: 64, align: 64, offset: 2112)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !23, file: !10, line: 394, baseType: !324, size: 64, align: 64, offset: 2176)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !10, line: 325, baseType: !139)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !23, file: !10, line: 395, baseType: !326, size: 64, align: 64, offset: 2240)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !10, line: 326, baseType: !215)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !23, file: !10, line: 396, baseType: !14, size: 64, align: 64, offset: 2304)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !23, file: !10, line: 397, baseType: !329, size: 64, align: 64, offset: 2368)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !10, line: 327, baseType: !215)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !23, file: !10, line: 398, baseType: !331, size: 64, align: 64, offset: 2432)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !10, line: 329, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!42, !22, !14}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !23, file: !10, line: 399, baseType: !336, size: 64, align: 64, offset: 2496)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !10, line: 328, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!42, !22, !42, !42}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !23, file: !10, line: 400, baseType: !341, size: 64, align: 64, offset: 2560)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !10, line: 307, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{null, !94}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !23, file: !10, line: 401, baseType: !147, size: 64, align: 64, offset: 2624)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !23, file: !10, line: 402, baseType: !42, size: 64, align: 64, offset: 2688)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !23, file: !10, line: 403, baseType: !42, size: 64, align: 64, offset: 2752)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !23, file: !10, line: 404, baseType: !42, size: 64, align: 64, offset: 2816)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !23, file: !10, line: 405, baseType: !42, size: 64, align: 64, offset: 2880)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !23, file: !10, line: 406, baseType: !42, size: 64, align: 64, offset: 2944)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !23, file: !10, line: 407, baseType: !38, size: 64, align: 64, offset: 3008)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !23, file: !10, line: 410, baseType: !353, size: 32, align: 32, offset: 3072)
!353 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !23, file: !10, line: 412, baseType: !38, size: 64, align: 64, offset: 3136)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !6, file: !1, line: 48, baseType: !48, size: 32, align: 32, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !6, file: !1, line: 49, baseType: !353, size: 1, align: 32, offset: 160)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "readable", scope: !6, file: !1, line: 50, baseType: !353, size: 1, align: 32, offset: 161)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "writable", scope: !6, file: !1, line: 51, baseType: !353, size: 1, align: 32, offset: 162)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "appending", scope: !6, file: !1, line: 52, baseType: !353, size: 1, align: 32, offset: 163)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !6, file: !1, line: 53, baseType: !48, size: 2, align: 32, offset: 164)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "closefd", scope: !6, file: !1, line: 54, baseType: !353, size: 1, align: 32, offset: 166)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "finalizing", scope: !6, file: !1, line: 55, baseType: !34, size: 8, align: 8, offset: 168)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !6, file: !1, line: 56, baseType: !42, size: 64, align: 64, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !6, file: !1, line: 57, baseType: !42, size: 64, align: 64, offset: 256)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !367, line: 253, baseType: !368)
!367 = !DIFile(filename: "Include/objimpl.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!368 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !367, line: 246, size: 192, align: 64, elements: !369)
!369 = !{!370, !377}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !368, file: !367, line: 251, baseType: !371, size: 192, align: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, scope: !368, file: !367, line: 247, size: 192, align: 64, elements: !372)
!372 = !{!373, !375, !376}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !371, file: !367, line: 248, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !371, file: !367, line: 249, baseType: !374, size: 64, align: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !371, file: !367, line: 250, baseType: !14, size: 64, align: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !368, file: !367, line: 252, baseType: !378, size: 64, align: 64)
!378 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !381, line: 41, baseType: !382)
!381 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!382 = !DICompositeType(tag: DW_TAG_structure_type, file: !381, line: 31, size: 320, align: 64, elements: !383)
!383 = !{!384, !385, !386}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !382, file: !381, line: 32, baseType: !26, size: 192, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !382, file: !381, line: 33, baseType: !223, size: 64, align: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !382, file: !381, line: 34, baseType: !85, size: 8, align: 8, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_off_t", file: !388, line: 94, baseType: !389)
!388 = !DIFile(filename: "./Modules/_io/_iomodule.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !17, line: 92, baseType: !92)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!391 = !{!392, !395, !408, !419, !424, !435, !446, !533, !536, !549, !618, !645, !652, !664, !676, !682, !695, !699, !717, !726, !738, !748, !751, !754, !757, !763, !772, !775, !781, !785, !789, !835, !850, !857}
!392 = !DISubprogram(name: "_PyFileIO_closed", scope: !1, file: !1, line: 67, type: !149, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @_PyFileIO_closed, variables: !393)
!393 = !{!394}
!394 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !392, file: !1, line: 67, type: !42)
!395 = !DISubprogram(name: "fileio_dealloc", scope: !1, file: !1, line: 474, type: !396, isLocal: true, isDefinition: true, scopeLine: 475, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.fileio*)* @fileio_dealloc, variables: !398)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !4}
!398 = !{!399, !400, !402, !404}
!399 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !395, file: !1, line: 474, type: !4)
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !401, file: !1, line: 479, type: !365)
!401 = distinct !DILexicalBlock(scope: !395, file: !1, line: 479, column: 5)
!402 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !403, file: !1, line: 482, type: !42)
!403 = distinct !DILexicalBlock(scope: !395, file: !1, line: 482, column: 5)
!404 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !405, file: !1, line: 482, type: !42)
!405 = distinct !DILexicalBlock(scope: !406, file: !1, line: 482, column: 5)
!406 = distinct !DILexicalBlock(scope: !407, file: !1, line: 482, column: 5)
!407 = distinct !DILexicalBlock(scope: !403, file: !1, line: 482, column: 5)
!408 = !DISubprogram(name: "fileio_repr", scope: !1, file: !1, line: 1041, type: !409, isLocal: true, isDefinition: true, scopeLine: 1042, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*)* @fileio_repr, variables: !411)
!409 = !DISubroutineType(types: !410)
!410 = !{!42, !4}
!411 = !{!412, !413, !414, !415}
!412 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !408, file: !1, line: 1041, type: !4)
!413 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nameobj", scope: !408, file: !1, line: 1043, type: !42)
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !408, file: !1, line: 1043, type: !42)
!415 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !416, file: !1, line: 1060, type: !42)
!416 = distinct !DILexicalBlock(scope: !417, file: !1, line: 1060, column: 9)
!417 = distinct !DILexicalBlock(scope: !418, file: !1, line: 1057, column: 10)
!418 = distinct !DILexicalBlock(scope: !408, file: !1, line: 1049, column: 9)
!419 = !DISubprogram(name: "mode_string", scope: !1, file: !1, line: 1016, type: !420, isLocal: true, isDefinition: true, scopeLine: 1017, flags: DIFlagPrototyped, isOptimized: true, variables: !422)
!420 = !DISubroutineType(types: !421)
!421 = !{!56, !4}
!422 = !{!423}
!423 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !419, file: !1, line: 1016, type: !4)
!424 = !DISubprogram(name: "fileio_traverse", scope: !1, file: !1, line: 460, type: !425, isLocal: true, isDefinition: true, scopeLine: 461, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.fileio*, i32 (%struct._object*, i8*)*, i8*)* @fileio_traverse, variables: !427)
!425 = !DISubroutineType(types: !426)
!426 = !{!48, !4, !268, !94}
!427 = !{!428, !429, !430, !431}
!428 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !424, file: !1, line: 460, type: !4)
!429 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !424, file: !1, line: 460, type: !268)
!430 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !424, file: !1, line: 460, type: !94)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !432, file: !1, line: 462, type: !48)
!432 = distinct !DILexicalBlock(scope: !433, file: !1, line: 462, column: 5)
!433 = distinct !DILexicalBlock(scope: !434, file: !1, line: 462, column: 5)
!434 = distinct !DILexicalBlock(scope: !424, file: !1, line: 462, column: 5)
!435 = !DISubprogram(name: "fileio_clear", scope: !1, file: !1, line: 467, type: !436, isLocal: true, isDefinition: true, scopeLine: 468, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.fileio*)* @fileio_clear, variables: !438)
!436 = !DISubroutineType(types: !437)
!437 = !{!48, !4}
!438 = !{!439, !440, !442}
!439 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !435, file: !1, line: 467, type: !4)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !441, file: !1, line: 469, type: !42)
!441 = distinct !DILexicalBlock(scope: !435, file: !1, line: 469, column: 5)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !443, file: !1, line: 469, type: !42)
!443 = distinct !DILexicalBlock(scope: !444, file: !1, line: 469, column: 5)
!444 = distinct !DILexicalBlock(scope: !445, file: !1, line: 469, column: 5)
!445 = distinct !DILexicalBlock(scope: !441, file: !1, line: 469, column: 5)
!446 = !DISubprogram(name: "fileio_read", scope: !1, file: !1, line: 718, type: !447, isLocal: true, isDefinition: true, scopeLine: 719, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*, %struct._object*)* @fileio_read, variables: !449)
!447 = !DISubroutineType(types: !448)
!448 = !{!42, !4, !42}
!449 = !{!450, !451, !452, !453, !454, !455, !456, !518, !521, !523, !529}
!450 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !446, file: !1, line: 718, type: !4)
!451 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !446, file: !1, line: 718, type: !42)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !446, file: !1, line: 720, type: !56)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !446, file: !1, line: 721, type: !14)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !446, file: !1, line: 722, type: !14)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !446, file: !1, line: 723, type: !42)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !457, file: !1, line: 747, type: !460)
!457 = distinct !DILexicalBlock(scope: !458, file: !1, line: 747, column: 9)
!458 = distinct !DILexicalBlock(scope: !459, file: !1, line: 746, column: 33)
!459 = distinct !DILexicalBlock(scope: !446, file: !1, line: 746, column: 9)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !462, line: 139, baseType: !463)
!462 = !DIFile(filename: "Include/pystate.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !462, line: 69, size: 1536, align: 64, elements: !464)
!464 = !{!465, !467, !468, !488, !491, !492, !493, !494, !495, !496, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !463, file: !462, line: 72, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !462, line: 73, baseType: !466, size: 64, align: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !463, file: !462, line: 74, baseType: !469, size: 64, align: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !462, line: 44, baseType: !471)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !462, line: 19, size: 832, align: 64, elements: !472)
!472 = !{!473, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !471, file: !462, line: 21, baseType: !474, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !471, file: !462, line: 22, baseType: !466, size: 64, align: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !471, file: !462, line: 24, baseType: !42, size: 64, align: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !471, file: !462, line: 25, baseType: !42, size: 64, align: 64, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !471, file: !462, line: 26, baseType: !42, size: 64, align: 64, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !471, file: !462, line: 27, baseType: !42, size: 64, align: 64, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !471, file: !462, line: 28, baseType: !42, size: 64, align: 64, offset: 384)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !471, file: !462, line: 30, baseType: !42, size: 64, align: 64, offset: 448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !471, file: !462, line: 31, baseType: !42, size: 64, align: 64, offset: 512)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !471, file: !462, line: 32, baseType: !42, size: 64, align: 64, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !471, file: !462, line: 33, baseType: !48, size: 32, align: 32, offset: 640)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !471, file: !462, line: 34, baseType: !48, size: 32, align: 32, offset: 672)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !471, file: !462, line: 37, baseType: !48, size: 32, align: 32, offset: 704)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !471, file: !462, line: 43, baseType: !42, size: 64, align: 64, offset: 768)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !463, file: !462, line: 76, baseType: !489, size: 64, align: 64, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !462, line: 50, flags: DIFlagFwdDecl)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !463, file: !462, line: 77, baseType: !48, size: 32, align: 32, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !463, file: !462, line: 78, baseType: !34, size: 8, align: 8, offset: 288)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !463, file: !462, line: 80, baseType: !34, size: 8, align: 8, offset: 296)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !463, file: !462, line: 85, baseType: !48, size: 32, align: 32, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !463, file: !462, line: 86, baseType: !48, size: 32, align: 32, offset: 352)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !463, file: !462, line: 88, baseType: !497, size: 64, align: 64, offset: 384)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !462, line: 54, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DISubroutineType(types: !500)
!500 = !{!48, !42, !489, !48, !42}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !463, file: !462, line: 89, baseType: !497, size: 64, align: 64, offset: 448)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !463, file: !462, line: 90, baseType: !42, size: 64, align: 64, offset: 512)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !463, file: !462, line: 91, baseType: !42, size: 64, align: 64, offset: 576)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !463, file: !462, line: 93, baseType: !42, size: 64, align: 64, offset: 640)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !463, file: !462, line: 94, baseType: !42, size: 64, align: 64, offset: 704)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !463, file: !462, line: 95, baseType: !42, size: 64, align: 64, offset: 768)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !463, file: !462, line: 97, baseType: !42, size: 64, align: 64, offset: 832)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !463, file: !462, line: 98, baseType: !42, size: 64, align: 64, offset: 896)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !463, file: !462, line: 99, baseType: !42, size: 64, align: 64, offset: 960)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !463, file: !462, line: 101, baseType: !42, size: 64, align: 64, offset: 1024)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !463, file: !462, line: 103, baseType: !48, size: 32, align: 32, offset: 1088)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !463, file: !462, line: 105, baseType: !42, size: 64, align: 64, offset: 1152)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !463, file: !462, line: 106, baseType: !20, size: 64, align: 64, offset: 1216)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !463, file: !462, line: 108, baseType: !48, size: 32, align: 32, offset: 1280)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !463, file: !462, line: 109, baseType: !42, size: 64, align: 64, offset: 1344)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !463, file: !462, line: 134, baseType: !342, size: 64, align: 64, offset: 1408)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !463, file: !462, line: 135, baseType: !94, size: 64, align: 64, offset: 1472)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !519, file: !1, line: 759, type: !48)
!519 = distinct !DILexicalBlock(scope: !520, file: !1, line: 758, column: 16)
!520 = distinct !DILexicalBlock(scope: !446, file: !1, line: 758, column: 9)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !522, file: !1, line: 760, type: !42)
!522 = distinct !DILexicalBlock(scope: !519, file: !1, line: 760, column: 9)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !524, file: !1, line: 770, type: !42)
!524 = distinct !DILexicalBlock(scope: !525, file: !1, line: 770, column: 13)
!525 = distinct !DILexicalBlock(scope: !526, file: !1, line: 769, column: 45)
!526 = distinct !DILexicalBlock(scope: !527, file: !1, line: 769, column: 13)
!527 = distinct !DILexicalBlock(scope: !528, file: !1, line: 768, column: 20)
!528 = distinct !DILexicalBlock(scope: !446, file: !1, line: 768, column: 9)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !530, file: !1, line: 770, type: !42)
!530 = distinct !DILexicalBlock(scope: !531, file: !1, line: 770, column: 13)
!531 = distinct !DILexicalBlock(scope: !532, file: !1, line: 770, column: 13)
!532 = distinct !DILexicalBlock(scope: !524, file: !1, line: 770, column: 13)
!533 = !DISubprogram(name: "err_closed", scope: !1, file: !1, line: 487, type: !534, isLocal: true, isDefinition: true, scopeLine: 488, flags: DIFlagPrototyped, isOptimized: true, variables: !2)
!534 = !DISubroutineType(types: !535)
!535 = !{!42}
!536 = !DISubprogram(name: "err_mode", scope: !1, file: !1, line: 494, type: !537, isLocal: true, isDefinition: true, scopeLine: 495, flags: DIFlagPrototyped, isOptimized: true, variables: !539)
!537 = !DISubroutineType(types: !538)
!538 = !{!42, !56}
!539 = !{!540, !541}
!540 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "action", arg: 1, scope: !536, file: !1, line: 494, type: !56)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !536, file: !1, line: 496, type: !542)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyIO_State", file: !388, line: 135, baseType: !544)
!544 = !DICompositeType(tag: DW_TAG_structure_type, file: !388, line: 130, size: 192, align: 64, elements: !545)
!545 = !{!546, !547, !548}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !544, file: !388, line: 131, baseType: !48, size: 32, align: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "locale_module", scope: !544, file: !388, line: 132, baseType: !42, size: 64, align: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "unsupported_operation", scope: !544, file: !388, line: 134, baseType: !42, size: 64, align: 64, offset: 128)
!549 = !DISubprogram(name: "fileio_readall", scope: !1, file: !1, line: 619, type: !409, isLocal: true, isDefinition: true, scopeLine: 620, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*)* @fileio_readall, variables: !550)
!550 = !{!551, !552, !589, !590, !591, !592, !593, !594, !595, !602, !604, !612, !616}
!551 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !549, file: !1, line: 619, type: !4)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !549, file: !1, line: 621, type: !553)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !554, line: 46, size: 1152, align: 64, elements: !555)
!554 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!555 = !{!556, !558, !560, !562, !564, !566, !568, !569, !570, !571, !573, !575, !583, !584, !585}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !553, file: !554, line: 48, baseType: !557, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !19, line: 133, baseType: !101)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !553, file: !554, line: 53, baseType: !559, size: 64, align: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !19, line: 136, baseType: !101)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !553, file: !554, line: 61, baseType: !561, size: 64, align: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !19, line: 139, baseType: !101)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !553, file: !554, line: 62, baseType: !563, size: 32, align: 32, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !19, line: 138, baseType: !353)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !553, file: !554, line: 64, baseType: !565, size: 32, align: 32, offset: 224)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !19, line: 134, baseType: !353)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !553, file: !554, line: 65, baseType: !567, size: 32, align: 32, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !19, line: 135, baseType: !353)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !553, file: !554, line: 67, baseType: !48, size: 32, align: 32, offset: 288)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !553, file: !554, line: 69, baseType: !557, size: 64, align: 64, offset: 320)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !553, file: !554, line: 74, baseType: !79, size: 64, align: 64, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !553, file: !554, line: 78, baseType: !572, size: 64, align: 64, offset: 448)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !19, line: 162, baseType: !20)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !553, file: !554, line: 80, baseType: !574, size: 64, align: 64, offset: 512)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !19, line: 167, baseType: !20)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !553, file: !554, line: 91, baseType: !576, size: 128, align: 64, offset: 576)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !577, line: 120, size: 128, align: 64, elements: !578)
!577 = !DIFile(filename: "/usr/include/time.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!578 = !{!579, !581}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !576, file: !577, line: 122, baseType: !580, size: 64, align: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !19, line: 148, baseType: !20)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !576, file: !577, line: 123, baseType: !582, size: 64, align: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !19, line: 184, baseType: !20)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !553, file: !554, line: 92, baseType: !576, size: 128, align: 64, offset: 704)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !553, file: !554, line: 93, baseType: !576, size: 128, align: 64, offset: 832)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !553, file: !554, line: 106, baseType: !586, size: 192, align: 64, offset: 960)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 192, align: 64, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 3)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !549, file: !1, line: 622, type: !387)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !549, file: !1, line: 622, type: !387)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !549, file: !1, line: 623, type: !42)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes_read", scope: !549, file: !1, line: 624, type: !14)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !549, file: !1, line: 625, type: !14)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bufsize", scope: !549, file: !1, line: 626, type: !99)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !596, file: !1, line: 664, type: !42)
!596 = distinct !DILexicalBlock(scope: !597, file: !1, line: 664, column: 17)
!597 = distinct !DILexicalBlock(scope: !598, file: !1, line: 660, column: 59)
!598 = distinct !DILexicalBlock(scope: !599, file: !1, line: 660, column: 17)
!599 = distinct !DILexicalBlock(scope: !600, file: !1, line: 658, column: 48)
!600 = distinct !DILexicalBlock(scope: !601, file: !1, line: 658, column: 13)
!601 = distinct !DILexicalBlock(scope: !549, file: !1, line: 657, column: 15)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !603, file: !1, line: 673, type: !460)
!603 = distinct !DILexicalBlock(scope: !601, file: !1, line: 673, column: 9)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !605, file: !1, line: 689, type: !42)
!605 = distinct !DILexicalBlock(scope: !606, file: !1, line: 689, column: 21)
!606 = distinct !DILexicalBlock(scope: !607, file: !1, line: 688, column: 43)
!607 = distinct !DILexicalBlock(scope: !608, file: !1, line: 688, column: 21)
!608 = distinct !DILexicalBlock(scope: !609, file: !1, line: 687, column: 33)
!609 = distinct !DILexicalBlock(scope: !610, file: !1, line: 687, column: 17)
!610 = distinct !DILexicalBlock(scope: !611, file: !1, line: 686, column: 20)
!611 = distinct !DILexicalBlock(scope: !601, file: !1, line: 686, column: 13)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !613, file: !1, line: 697, type: !42)
!613 = distinct !DILexicalBlock(scope: !614, file: !1, line: 697, column: 17)
!614 = distinct !DILexicalBlock(scope: !615, file: !1, line: 696, column: 34)
!615 = distinct !DILexicalBlock(scope: !610, file: !1, line: 696, column: 17)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !617, file: !1, line: 700, type: !42)
!617 = distinct !DILexicalBlock(scope: !610, file: !1, line: 700, column: 13)
!618 = !DISubprogram(name: "fstat64", scope: !619, file: !619, line: 517, type: !620, isLocal: false, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: true, variables: !642)
!619 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!620 = !DISubroutineType(types: !621)
!621 = !{!48, !48, !622}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64, align: 64)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !554, line: 119, size: 1152, align: 64, elements: !624)
!624 = !{!625, !626, !628, !629, !630, !631, !632, !633, !634, !635, !636, !638, !639, !640, !641}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !623, file: !554, line: 121, baseType: !557, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !623, file: !554, line: 123, baseType: !627, size: 64, align: 64, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !19, line: 137, baseType: !101)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !623, file: !554, line: 124, baseType: !561, size: 64, align: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !623, file: !554, line: 125, baseType: !563, size: 32, align: 32, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !623, file: !554, line: 132, baseType: !565, size: 32, align: 32, offset: 224)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !623, file: !554, line: 133, baseType: !567, size: 32, align: 32, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !623, file: !554, line: 135, baseType: !48, size: 32, align: 32, offset: 288)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !623, file: !554, line: 136, baseType: !557, size: 64, align: 64, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !623, file: !554, line: 137, baseType: !79, size: 64, align: 64, offset: 384)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !623, file: !554, line: 143, baseType: !572, size: 64, align: 64, offset: 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !623, file: !554, line: 144, baseType: !637, size: 64, align: 64, offset: 512)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !19, line: 168, baseType: !20)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !623, file: !554, line: 152, baseType: !576, size: 128, align: 64, offset: 576)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !623, file: !554, line: 153, baseType: !576, size: 128, align: 64, offset: 704)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !623, file: !554, line: 154, baseType: !576, size: 128, align: 64, offset: 832)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !623, file: !554, line: 164, baseType: !586, size: 192, align: 64, offset: 960)
!642 = !{!643, !644}
!643 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__fd", arg: 1, scope: !618, file: !619, line: 517, type: !48)
!644 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__statbuf", arg: 2, scope: !618, file: !619, line: 517, type: !622)
!645 = !DISubprogram(name: "new_buffersize", scope: !1, file: !1, line: 600, type: !646, isLocal: true, isDefinition: true, scopeLine: 601, flags: DIFlagPrototyped, isOptimized: true, variables: !648)
!646 = !DISubroutineType(types: !647)
!647 = !{!99, !4, !99}
!648 = !{!649, !650, !651}
!649 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !645, file: !1, line: 600, type: !4)
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currentsize", arg: 2, scope: !645, file: !1, line: 600, type: !99)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "addend", scope: !645, file: !1, line: 602, type: !99)
!652 = !DISubprogram(name: "fileio_readinto", scope: !1, file: !1, line: 546, type: !447, isLocal: true, isDefinition: true, scopeLine: 547, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*, %struct._object*)* @fileio_readinto, variables: !653)
!653 = !{!654, !655, !656, !657, !658, !659, !660}
!654 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !652, file: !1, line: 546, type: !4)
!655 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !652, file: !1, line: 546, type: !42)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pbuf", scope: !652, file: !1, line: 548, type: !241)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !652, file: !1, line: 549, type: !14)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !652, file: !1, line: 549, type: !14)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !652, file: !1, line: 550, type: !48)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !661, file: !1, line: 562, type: !460)
!661 = distinct !DILexicalBlock(scope: !662, file: !1, line: 562, column: 9)
!662 = distinct !DILexicalBlock(scope: !663, file: !1, line: 560, column: 33)
!663 = distinct !DILexicalBlock(scope: !652, file: !1, line: 560, column: 9)
!664 = !DISubprogram(name: "fileio_write", scope: !1, file: !1, line: 779, type: !447, isLocal: true, isDefinition: true, scopeLine: 780, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*, %struct._object*)* @fileio_write, variables: !665)
!665 = !{!666, !667, !668, !669, !670, !671, !672}
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !664, file: !1, line: 779, type: !4)
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !664, file: !1, line: 779, type: !42)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pbuf", scope: !664, file: !1, line: 781, type: !241)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !664, file: !1, line: 782, type: !14)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !664, file: !1, line: 782, type: !14)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !664, file: !1, line: 783, type: !48)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !673, file: !1, line: 794, type: !460)
!673 = distinct !DILexicalBlock(scope: !674, file: !1, line: 794, column: 9)
!674 = distinct !DILexicalBlock(scope: !675, file: !1, line: 793, column: 33)
!675 = distinct !DILexicalBlock(scope: !664, file: !1, line: 793, column: 9)
!676 = !DISubprogram(name: "fileio_seek", scope: !1, file: !1, line: 889, type: !447, isLocal: true, isDefinition: true, scopeLine: 890, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*, %struct._object*)* @fileio_seek, variables: !677)
!677 = !{!678, !679, !680, !681}
!678 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !676, file: !1, line: 889, type: !4)
!679 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !676, file: !1, line: 889, type: !42)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "posobj", scope: !676, file: !1, line: 891, type: !42)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "whence", scope: !676, file: !1, line: 892, type: !48)
!682 = !DISubprogram(name: "portable_lseek", scope: !1, file: !1, line: 833, type: !683, isLocal: true, isDefinition: true, scopeLine: 834, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32, %struct._object*, i32)* @portable_lseek, variables: !685)
!683 = !DISubroutineType(types: !684)
!684 = !{!42, !48, !42, !48}
!685 = !{!686, !687, !688, !689, !690, !691}
!686 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !682, file: !1, line: 833, type: !48)
!687 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "posobj", arg: 2, scope: !682, file: !1, line: 833, type: !42)
!688 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "whence", arg: 3, scope: !682, file: !1, line: 833, type: !48)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !682, file: !1, line: 835, type: !387)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !682, file: !1, line: 835, type: !387)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !692, file: !1, line: 869, type: !460)
!692 = distinct !DILexicalBlock(scope: !693, file: !1, line: 869, column: 9)
!693 = distinct !DILexicalBlock(scope: !694, file: !1, line: 868, column: 27)
!694 = distinct !DILexicalBlock(scope: !682, file: !1, line: 868, column: 9)
!695 = !DISubprogram(name: "fileio_tell", scope: !1, file: !1, line: 904, type: !447, isLocal: true, isDefinition: true, scopeLine: 905, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*, %struct._object*)* @fileio_tell, variables: !696)
!696 = !{!697, !698}
!697 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !695, file: !1, line: 904, type: !4)
!698 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !695, file: !1, line: 904, type: !42)
!699 = !DISubprogram(name: "fileio_truncate", scope: !1, file: !1, line: 914, type: !447, isLocal: true, isDefinition: true, scopeLine: 915, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*, %struct._object*)* @fileio_truncate, variables: !700)
!700 = !{!701, !702, !703, !704, !705, !706, !707, !711, !713}
!701 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !699, file: !1, line: 914, type: !4)
!702 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !699, file: !1, line: 914, type: !42)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "posobj", scope: !699, file: !1, line: 916, type: !42)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !699, file: !1, line: 918, type: !387)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !699, file: !1, line: 920, type: !48)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !699, file: !1, line: 921, type: !48)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !708, file: !1, line: 994, type: !42)
!708 = distinct !DILexicalBlock(scope: !709, file: !1, line: 994, column: 9)
!709 = distinct !DILexicalBlock(scope: !710, file: !1, line: 993, column: 26)
!710 = distinct !DILexicalBlock(scope: !699, file: !1, line: 993, column: 9)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !712, file: !1, line: 998, type: !460)
!712 = distinct !DILexicalBlock(scope: !699, file: !1, line: 998, column: 5)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !714, file: !1, line: 1006, type: !42)
!714 = distinct !DILexicalBlock(scope: !715, file: !1, line: 1006, column: 9)
!715 = distinct !DILexicalBlock(scope: !716, file: !1, line: 1005, column: 19)
!716 = distinct !DILexicalBlock(scope: !699, file: !1, line: 1005, column: 9)
!717 = !DISubprogram(name: "fileio_close", scope: !1, file: !1, line: 127, type: !409, isLocal: true, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*)* @fileio_close, variables: !718)
!718 = !{!719, !720, !723}
!719 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !717, file: !1, line: 127, type: !4)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !721, file: !1, line: 135, type: !42)
!721 = distinct !DILexicalBlock(scope: !722, file: !1, line: 134, column: 27)
!722 = distinct !DILexicalBlock(scope: !717, file: !1, line: 134, column: 9)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !724, file: !1, line: 137, type: !42)
!724 = distinct !DILexicalBlock(scope: !725, file: !1, line: 137, column: 13)
!725 = distinct !DILexicalBlock(scope: !721, file: !1, line: 136, column: 13)
!726 = !DISubprogram(name: "internal_close", scope: !1, file: !1, line: 99, type: !436, isLocal: true, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, variables: !727)
!727 = !{!728, !729, !730, !731, !734}
!728 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !726, file: !1, line: 99, type: !4)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !726, file: !1, line: 101, type: !48)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "save_errno", scope: !726, file: !1, line: 102, type: !48)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !732, file: !1, line: 104, type: !48)
!732 = distinct !DILexicalBlock(scope: !733, file: !1, line: 103, column: 24)
!733 = distinct !DILexicalBlock(scope: !726, file: !1, line: 103, column: 9)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !735, file: !1, line: 108, type: !460)
!735 = distinct !DILexicalBlock(scope: !736, file: !1, line: 108, column: 13)
!736 = distinct !DILexicalBlock(scope: !737, file: !1, line: 107, column: 31)
!737 = distinct !DILexicalBlock(scope: !732, file: !1, line: 107, column: 13)
!738 = !DISubprogram(name: "fileio_seekable", scope: !1, file: !1, line: 528, type: !409, isLocal: true, isDefinition: true, scopeLine: 529, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*)* @fileio_seekable, variables: !739)
!739 = !{!740, !741, !744}
!740 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !738, file: !1, line: 528, type: !4)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !742, file: !1, line: 533, type: !42)
!742 = distinct !DILexicalBlock(scope: !743, file: !1, line: 532, column: 29)
!743 = distinct !DILexicalBlock(scope: !738, file: !1, line: 532, column: 9)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !745, file: !1, line: 538, type: !42)
!745 = distinct !DILexicalBlock(scope: !746, file: !1, line: 538, column: 13)
!746 = distinct !DILexicalBlock(scope: !747, file: !1, line: 537, column: 16)
!747 = distinct !DILexicalBlock(scope: !742, file: !1, line: 534, column: 13)
!748 = !DISubprogram(name: "fileio_readable", scope: !1, file: !1, line: 512, type: !409, isLocal: true, isDefinition: true, scopeLine: 513, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*)* @fileio_readable, variables: !749)
!749 = !{!750}
!750 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !748, file: !1, line: 512, type: !4)
!751 = !DISubprogram(name: "fileio_writable", scope: !1, file: !1, line: 520, type: !409, isLocal: true, isDefinition: true, scopeLine: 521, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*)* @fileio_writable, variables: !752)
!752 = !{!753}
!753 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !751, file: !1, line: 520, type: !4)
!754 = !DISubprogram(name: "fileio_fileno", scope: !1, file: !1, line: 504, type: !409, isLocal: true, isDefinition: true, scopeLine: 505, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*)* @fileio_fileno, variables: !755)
!755 = !{!756}
!756 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !754, file: !1, line: 504, type: !4)
!757 = !DISubprogram(name: "fileio_isatty", scope: !1, file: !1, line: 1066, type: !409, isLocal: true, isDefinition: true, scopeLine: 1067, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*)* @fileio_isatty, variables: !758)
!758 = !{!759, !760, !761}
!759 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !757, file: !1, line: 1066, type: !4)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !757, file: !1, line: 1068, type: !20)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !762, file: !1, line: 1072, type: !460)
!762 = distinct !DILexicalBlock(scope: !757, file: !1, line: 1072, column: 5)
!763 = !DISubprogram(name: "fileio_dealloc_warn", scope: !1, file: !1, line: 76, type: !447, isLocal: true, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*, %struct._object*)* @fileio_dealloc_warn, variables: !764)
!764 = !{!765, !766, !767, !770, !771}
!765 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !763, file: !1, line: 76, type: !4)
!766 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "source", arg: 2, scope: !763, file: !1, line: 76, type: !42)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc", scope: !768, file: !1, line: 79, type: !42)
!768 = distinct !DILexicalBlock(scope: !769, file: !1, line: 78, column: 41)
!769 = distinct !DILexicalBlock(scope: !763, file: !1, line: 78, column: 9)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !768, file: !1, line: 79, type: !42)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !768, file: !1, line: 79, type: !42)
!772 = !DISubprogram(name: "fileio_getstate", scope: !1, file: !1, line: 1079, type: !409, isLocal: true, isDefinition: true, scopeLine: 1080, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*)* @fileio_getstate, variables: !773)
!773 = !{!774}
!774 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !772, file: !1, line: 1079, type: !4)
!775 = !DISubprogram(name: "get_closed", scope: !1, file: !1, line: 1193, type: !776, isLocal: true, isDefinition: true, scopeLine: 1194, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*, i8*)* @get_closed, variables: !778)
!776 = !DISubroutineType(types: !777)
!777 = !{!42, !4, !94}
!778 = !{!779, !780}
!779 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !775, file: !1, line: 1193, type: !4)
!780 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !775, file: !1, line: 1193, type: !94)
!781 = !DISubprogram(name: "get_closefd", scope: !1, file: !1, line: 1199, type: !776, isLocal: true, isDefinition: true, scopeLine: 1200, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*, i8*)* @get_closefd, variables: !782)
!782 = !{!783, !784}
!783 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !781, file: !1, line: 1199, type: !4)
!784 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !781, file: !1, line: 1199, type: !94)
!785 = !DISubprogram(name: "get_mode", scope: !1, file: !1, line: 1205, type: !776, isLocal: true, isDefinition: true, scopeLine: 1206, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*, i8*)* @get_mode, variables: !786)
!786 = !{!787, !788}
!787 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !785, file: !1, line: 1205, type: !4)
!788 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !785, file: !1, line: 1205, type: !94)
!789 = !DISubprogram(name: "fileio_init", scope: !1, file: !1, line: 214, type: !216, isLocal: true, isDefinition: true, scopeLine: 215, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, %struct._object*)* @fileio_init, variables: !790)
!790 = !{!791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !810, !816, !818, !822, !824, !827, !829, !831}
!791 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "oself", arg: 1, scope: !789, file: !1, line: 214, type: !42)
!792 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !789, file: !1, line: 214, type: !42)
!793 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !789, file: !1, line: 214, type: !42)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !789, file: !1, line: 216, type: !4)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !789, file: !1, line: 218, type: !32)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nameobj", scope: !789, file: !1, line: 219, type: !42)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stringobj", scope: !789, file: !1, line: 219, type: !42)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "opener", scope: !789, file: !1, line: 219, type: !42)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !789, file: !1, line: 220, type: !56)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !789, file: !1, line: 221, type: !56)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !789, file: !1, line: 225, type: !48)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rwa", scope: !789, file: !1, line: 226, type: !48)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "plus", scope: !789, file: !1, line: 226, type: !48)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !789, file: !1, line: 227, type: !48)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !789, file: !1, line: 228, type: !48)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "closefd", scope: !789, file: !1, line: 229, type: !48)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd_is_own", scope: !789, file: !1, line: 230, type: !48)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_flag_works", scope: !789, file: !1, line: 232, type: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !811, file: !1, line: 378, type: !460)
!811 = distinct !DILexicalBlock(scope: !812, file: !1, line: 378, column: 13)
!812 = distinct !DILexicalBlock(scope: !813, file: !1, line: 377, column: 32)
!813 = distinct !DILexicalBlock(scope: !814, file: !1, line: 377, column: 13)
!814 = distinct !DILexicalBlock(scope: !815, file: !1, line: 368, column: 10)
!815 = distinct !DILexicalBlock(scope: !789, file: !1, line: 362, column: 9)
!816 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fdobj", scope: !817, file: !1, line: 389, type: !42)
!817 = distinct !DILexicalBlock(scope: !813, file: !1, line: 388, column: 14)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !819, file: !1, line: 400, type: !42)
!819 = distinct !DILexicalBlock(scope: !820, file: !1, line: 400, column: 17)
!820 = distinct !DILexicalBlock(scope: !821, file: !1, line: 399, column: 39)
!821 = distinct !DILexicalBlock(scope: !817, file: !1, line: 399, column: 17)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !823, file: !1, line: 407, type: !42)
!823 = distinct !DILexicalBlock(scope: !817, file: !1, line: 407, column: 13)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !825, file: !1, line: 439, type: !42)
!825 = distinct !DILexicalBlock(scope: !826, file: !1, line: 435, column: 26)
!826 = distinct !DILexicalBlock(scope: !789, file: !1, line: 435, column: 9)
!827 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !828, file: !1, line: 442, type: !42)
!828 = distinct !DILexicalBlock(scope: !825, file: !1, line: 442, column: 9)
!829 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !830, file: !1, line: 455, type: !42)
!830 = distinct !DILexicalBlock(scope: !789, file: !1, line: 455, column: 5)
!831 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !832, file: !1, line: 455, type: !42)
!832 = distinct !DILexicalBlock(scope: !833, file: !1, line: 455, column: 5)
!833 = distinct !DILexicalBlock(scope: !834, file: !1, line: 455, column: 5)
!834 = distinct !DILexicalBlock(scope: !830, file: !1, line: 455, column: 5)
!835 = !DISubprogram(name: "check_fd", scope: !1, file: !1, line: 192, type: !836, isLocal: true, isDefinition: true, scopeLine: 193, flags: DIFlagPrototyped, isOptimized: true, variables: !838)
!836 = !DISubroutineType(types: !837)
!837 = !{!48, !48}
!838 = !{!839, !840, !841, !844, !845, !847}
!839 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !835, file: !1, line: 192, type: !48)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !835, file: !1, line: 195, type: !553)
!841 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc", scope: !842, file: !1, line: 197, type: !42)
!842 = distinct !DILexicalBlock(scope: !843, file: !1, line: 196, column: 71)
!843 = distinct !DILexicalBlock(scope: !835, file: !1, line: 196, column: 9)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msg", scope: !842, file: !1, line: 198, type: !56)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !846, file: !1, line: 202, type: !42)
!846 = distinct !DILexicalBlock(scope: !842, file: !1, line: 202, column: 9)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !848, file: !1, line: 202, type: !42)
!848 = distinct !DILexicalBlock(scope: !849, file: !1, line: 202, column: 9)
!849 = distinct !DILexicalBlock(scope: !846, file: !1, line: 202, column: 9)
!850 = !DISubprogram(name: "dircheck", scope: !1, file: !1, line: 176, type: !851, isLocal: true, isDefinition: true, scopeLine: 177, flags: DIFlagPrototyped, isOptimized: true, variables: !853)
!851 = !DISubroutineType(types: !852)
!852 = !{!48, !4, !42}
!853 = !{!854, !855, !856}
!854 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !850, file: !1, line: 176, type: !4)
!855 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nameobj", arg: 2, scope: !850, file: !1, line: 176, type: !42)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !850, file: !1, line: 179, type: !553)
!857 = !DISubprogram(name: "fileio_new", scope: !1, file: !1, line: 150, type: !858, isLocal: true, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @fileio_new, variables: !862)
!858 = !DISubroutineType(types: !859)
!859 = !{!42, !860, !42, !42}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64, align: 64)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !10, line: 422, baseType: !23)
!862 = !{!863, !864, !865, !866}
!863 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !857, file: !1, line: 150, type: !860)
!864 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !857, file: !1, line: 150, type: !42)
!865 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !857, file: !1, line: 150, type: !42)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !857, file: !1, line: 152, type: !4)
!867 = !{!868, !869, !877, !881, !886, !890, !894, !898, !902, !906, !910, !911, !912, !916, !920, !924, !928, !932, !936, !941, !946}
!868 = !DIGlobalVariable(name: "PyFileIO_Type", scope: !0, file: !1, line: 1223, type: !861, isLocal: false, isDefinition: true, variable: { %struct.PyVarObject, i8*, i64, i64, void (%struct._object*)*, i32 (%struct._object*, %struct._IO_FILE*, i32)*, %struct._object* (%struct._object*, i8*)*, i32 (%struct._object*, i8*, %struct._object*)*, i8*, %struct._object* (%struct._object*)*, %struct.PyNumberMethods*, %struct.PySequenceMethods*, %struct.PyMappingMethods*, i64 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*)*, i32 (%struct._object*, %struct._object*, %struct._object*)*, %struct.PyBufferProcs*, i64, i8*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, i32)*, i64, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*)*, %struct.PyMethodDef*, %struct.PyMemberDef*, %struct.PyGetSetDef*, %struct._typeobject*, %struct._object*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, i32 (%struct._object*, %struct._object*, %struct._object*)*, i64, i32 (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._typeobject*, i64)*, %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)*, void (i8*)*, i32 (%struct._object*)*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, void (%struct._object*)*, i32, void (%struct._object*)* }* @PyFileIO_Type)
!869 = !DIGlobalVariable(name: "PyId_name", scope: !0, file: !1, line: 62, type: !870, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @PyId_name)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !10, line: 144, baseType: !871)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !10, line: 140, size: 192, align: 64, elements: !872)
!872 = !{!873, !875, !876}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !871, file: !10, line: 141, baseType: !874, size: 64, align: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64, align: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !871, file: !10, line: 142, baseType: !32, size: 64, align: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !871, file: !10, line: 143, baseType: !42, size: 64, align: 64, offset: 128)
!877 = !DIGlobalVariable(name: "fileio_doc", scope: !0, file: !1, line: 1087, type: !878, isLocal: true, isDefinition: true, variable: [845 x i8]* @fileio_doc)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 6760, align: 8, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 845)
!881 = !DIGlobalVariable(name: "fileio_methods", scope: !0, file: !1, line: 1169, type: !882, isLocal: true, isDefinition: true, variable: [16 x %struct.PyMethodDef]* @fileio_methods)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !883, size: 4096, align: 64, elements: !884)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !286, line: 47, baseType: !285)
!884 = !{!885}
!885 = !DISubrange(count: 16)
!886 = !DIGlobalVariable(name: "read_doc", scope: !0, file: !1, line: 1102, type: !887, isLocal: true, isDefinition: true, variable: [232 x i8]* @read_doc)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 1856, align: 8, elements: !888)
!888 = !{!889}
!889 = !DISubrange(count: 232)
!890 = !DIGlobalVariable(name: "readall_doc", scope: !0, file: !1, line: 1109, type: !891, isLocal: true, isDefinition: true, variable: [199 x i8]* @readall_doc)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 1592, align: 8, elements: !892)
!892 = !{!893}
!893 = !DISubrange(count: 199)
!894 = !DIGlobalVariable(name: "readinto_doc", scope: !0, file: !1, line: 1148, type: !895, isLocal: true, isDefinition: true, variable: [44 x i8]* @readinto_doc)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 352, align: 8, elements: !896)
!896 = !{!897}
!897 = !DISubrange(count: 44)
!898 = !DIGlobalVariable(name: "write_doc", scope: !0, file: !1, line: 1115, type: !899, isLocal: true, isDefinition: true, variable: [189 x i8]* @write_doc)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 1512, align: 8, elements: !900)
!900 = !{!901}
!901 = !DISubrange(count: 189)
!902 = !DIGlobalVariable(name: "seek_doc", scope: !0, file: !1, line: 1126, type: !903, isLocal: true, isDefinition: true, variable: [439 x i8]* @seek_doc)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 3512, align: 8, elements: !904)
!904 = !{!905}
!905 = !DISubrange(count: 439)
