; ModuleID = 'fileobject.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Py_Identifier = type { %struct._Py_Identifier*, i8*, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !417, globals: !681)
!1 = !DIFile(filename: "Objects/fileobject.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !12, !350, !358, !359, !377, !378, !382, !390, !406, !408, !410, !416, !24}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !14, line: 109, baseType: !15)
!14 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !14, line: 105, size: 128, align: 64, elements: !16)
!16 = !{!17, !25}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !15, file: !14, line: 107, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !19, line: 177, baseType: !20)
!19 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !21, line: 102, baseType: !22)
!21 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !23, line: 181, baseType: !24)
!23 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!24 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !15, file: !14, line: 108, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !14, line: 334, size: 3200, align: 64, elements: !28)
!28 = !{!29, !35, !39, !40, !41, !46, !109, !114, !119, !120, !125, !177, !208, !220, !226, !227, !228, !230, !232, !263, !264, !265, !274, !275, !280, !281, !283, !285, !295, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !27, file: !14, line: 335, baseType: !30, size: 192, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !14, line: 114, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 111, size: 192, align: 64, elements: !32)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !14, line: 112, baseType: !13, size: 128, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !31, file: !14, line: 113, baseType: !18, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !27, file: !14, line: 336, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !27, file: !14, line: 341, baseType: !42, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !14, line: 308, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !12}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !27, file: !14, line: 342, baseType: !47, size: 64, align: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !14, line: 314, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !12, !52, !51}
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !21, line: 48, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !55, line: 246, size: 1728, align: 64, elements: !56)
!55 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!56 = !{!57, !58, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !78, !79, !80, !81, !83, !85, !87, !91, !94, !96, !97, !98, !99, !100, !104, !105}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !54, file: !55, line: 247, baseType: !51, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !54, file: !55, line: 252, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !54, file: !55, line: 253, baseType: !59, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !54, file: !55, line: 254, baseType: !59, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !54, file: !55, line: 255, baseType: !59, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !54, file: !55, line: 256, baseType: !59, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !54, file: !55, line: 257, baseType: !59, size: 64, align: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !54, file: !55, line: 258, baseType: !59, size: 64, align: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !54, file: !55, line: 259, baseType: !59, size: 64, align: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !54, file: !55, line: 261, baseType: !59, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !54, file: !55, line: 262, baseType: !59, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !54, file: !55, line: 263, baseType: !59, size: 64, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !54, file: !55, line: 265, baseType: !71, size: 64, align: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !55, line: 161, size: 192, align: 64, elements: !73)
!73 = !{!74, !75, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !72, file: !55, line: 162, baseType: !71, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !72, file: !55, line: 163, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !72, file: !55, line: 167, baseType: !51, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !54, file: !55, line: 267, baseType: !76, size: 64, align: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !54, file: !55, line: 269, baseType: !51, size: 32, align: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !54, file: !55, line: 273, baseType: !51, size: 32, align: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !54, file: !55, line: 275, baseType: !82, size: 64, align: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !23, line: 140, baseType: !24)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !54, file: !55, line: 279, baseType: !84, size: 16, align: 16, offset: 1024)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !54, file: !55, line: 280, baseType: !86, size: 8, align: 8, offset: 1040)
!86 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !54, file: !55, line: 281, baseType: !88, size: 8, align: 8, offset: 1048)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !54, file: !55, line: 285, baseType: !92, size: 64, align: 64, offset: 1088)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !55, line: 155, baseType: null)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !54, file: !55, line: 294, baseType: !95, size: 64, align: 64, offset: 1152)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !23, line: 141, baseType: !24)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !54, file: !55, line: 303, baseType: !11, size: 64, align: 64, offset: 1216)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !54, file: !55, line: 304, baseType: !11, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !54, file: !55, line: 305, baseType: !11, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !54, file: !55, line: 306, baseType: !11, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !54, file: !55, line: 307, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !54, file: !55, line: 309, baseType: !51, size: 32, align: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !54, file: !55, line: 311, baseType: !106, size: 160, align: 8, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !27, file: !14, line: 343, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !14, line: 316, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!12, !12, !59}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !27, file: !14, line: 344, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !14, line: 318, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!51, !12, !59, !12}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !27, file: !14, line: 345, baseType: !11, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !27, file: !14, line: 346, baseType: !121, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !14, line: 320, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!12, !12}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !27, file: !14, line: 350, baseType: !126, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !14, line: 278, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 236, size: 2176, align: 64, elements: !129)
!129 = !{!130, !135, !136, !137, !138, !139, !144, !146, !147, !148, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !128, file: !14, line: 241, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !14, line: 166, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!12, !12, !12}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !128, file: !14, line: 242, baseType: !131, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !128, file: !14, line: 243, baseType: !131, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !128, file: !14, line: 244, baseType: !131, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !128, file: !14, line: 245, baseType: !131, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !128, file: !14, line: 246, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !14, line: 167, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!12, !12, !12, !12}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !128, file: !14, line: 247, baseType: !145, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !14, line: 165, baseType: !122)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !128, file: !14, line: 248, baseType: !145, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !128, file: !14, line: 249, baseType: !145, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !128, file: !14, line: 250, baseType: !149, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !14, line: 168, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!51, !12}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !128, file: !14, line: 251, baseType: !145, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !128, file: !14, line: 252, baseType: !131, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !128, file: !14, line: 253, baseType: !131, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !128, file: !14, line: 254, baseType: !131, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !128, file: !14, line: 255, baseType: !131, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !128, file: !14, line: 256, baseType: !131, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !128, file: !14, line: 257, baseType: !145, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !128, file: !14, line: 258, baseType: !11, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !128, file: !14, line: 259, baseType: !145, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !128, file: !14, line: 261, baseType: !131, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !128, file: !14, line: 262, baseType: !131, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !128, file: !14, line: 263, baseType: !131, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !128, file: !14, line: 264, baseType: !131, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !128, file: !14, line: 265, baseType: !140, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !128, file: !14, line: 266, baseType: !131, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !128, file: !14, line: 267, baseType: !131, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !128, file: !14, line: 268, baseType: !131, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !128, file: !14, line: 269, baseType: !131, size: 64, align: 64, offset: 1728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !128, file: !14, line: 270, baseType: !131, size: 64, align: 64, offset: 1792)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !128, file: !14, line: 272, baseType: !131, size: 64, align: 64, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !128, file: !14, line: 273, baseType: !131, size: 64, align: 64, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !128, file: !14, line: 274, baseType: !131, size: 64, align: 64, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !128, file: !14, line: 275, baseType: !131, size: 64, align: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !128, file: !14, line: 277, baseType: !145, size: 64, align: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !27, file: !14, line: 351, baseType: !178, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !14, line: 292, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 280, size: 640, align: 64, elements: !181)
!181 = !{!182, !187, !188, !193, !194, !195, !200, !201, !206, !207}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !180, file: !14, line: 281, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !14, line: 169, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!18, !12}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !180, file: !14, line: 282, baseType: !131, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !180, file: !14, line: 283, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !14, line: 170, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!12, !12, !18}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !180, file: !14, line: 284, baseType: !189, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !180, file: !14, line: 285, baseType: !11, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !180, file: !14, line: 286, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !14, line: 172, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!51, !12, !18, !12}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !180, file: !14, line: 287, baseType: !11, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !180, file: !14, line: 288, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !14, line: 231, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!51, !12, !12}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !180, file: !14, line: 290, baseType: !131, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !180, file: !14, line: 291, baseType: !189, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !27, file: !14, line: 352, baseType: !209, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !14, line: 298, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 294, size: 192, align: 64, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !211, file: !14, line: 295, baseType: !183, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !211, file: !14, line: 296, baseType: !131, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !211, file: !14, line: 297, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !14, line: 174, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!51, !12, !12, !12}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !27, file: !14, line: 356, baseType: !221, size: 64, align: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !14, line: 321, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !12}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !19, line: 186, baseType: !18)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !27, file: !14, line: 357, baseType: !140, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !27, file: !14, line: 358, baseType: !121, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !27, file: !14, line: 359, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !14, line: 317, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !27, file: !14, line: 360, baseType: !231, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !14, line: 319, baseType: !217)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !27, file: !14, line: 363, baseType: !233, size: 64, align: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !14, line: 304, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 301, size: 128, align: 64, elements: !236)
!236 = !{!237, !258}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !235, file: !14, line: 302, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !14, line: 193, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!51, !12, !242, !51}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !14, line: 191, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !14, line: 178, size: 640, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !255, !256, !257}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !244, file: !14, line: 179, baseType: !11, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !244, file: !14, line: 180, baseType: !12, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !14, line: 181, baseType: !18, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !244, file: !14, line: 182, baseType: !18, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !244, file: !14, line: 184, baseType: !51, size: 32, align: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !244, file: !14, line: 185, baseType: !51, size: 32, align: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !244, file: !14, line: 186, baseType: !59, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !244, file: !14, line: 187, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !244, file: !14, line: 188, baseType: !254, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !244, file: !14, line: 189, baseType: !254, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !244, file: !14, line: 190, baseType: !11, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !235, file: !14, line: 303, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !14, line: 194, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !12, !242}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !27, file: !14, line: 366, baseType: !103, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !27, file: !14, line: 368, baseType: !36, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !27, file: !14, line: 372, baseType: !266, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !14, line: 233, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!51, !12, !270, !11}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !14, line: 232, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!51, !12, !11}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !27, file: !14, line: 375, baseType: !149, size: 64, align: 64, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !27, file: !14, line: 379, baseType: !276, size: 64, align: 64, offset: 1600)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !14, line: 322, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!12, !12, !12, !51}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !27, file: !14, line: 382, baseType: !18, size: 64, align: 64, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !27, file: !14, line: 385, baseType: !282, size: 64, align: 64, offset: 1728)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !14, line: 323, baseType: !122)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !27, file: !14, line: 386, baseType: !284, size: 64, align: 64, offset: 1792)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !14, line: 324, baseType: !122)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !27, file: !14, line: 389, baseType: !286, size: 64, align: 64, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 40, size: 256, align: 64, elements: !289)
!288 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 41, baseType: !36, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 18, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 43, baseType: !51, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 45, baseType: !36, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !27, file: !14, line: 390, baseType: !296, size: 64, align: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !14, line: 390, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !27, file: !14, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !59, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!12, !12, !11}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!51, !12, !12, !11}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !59, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !11, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !27, file: !14, line: 392, baseType: !26, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !27, file: !14, line: 393, baseType: !12, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !27, file: !14, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !14, line: 325, baseType: !141)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !27, file: !14, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !14, line: 326, baseType: !217)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !27, file: !14, line: 396, baseType: !18, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !27, file: !14, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !14, line: 327, baseType: !217)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !27, file: !14, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !14, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!12, !26, !18}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !27, file: !14, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !14, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!12, !26, !12, !12}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !27, file: !14, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !14, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !11}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !27, file: !14, line: 401, baseType: !149, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !27, file: !14, line: 402, baseType: !12, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !27, file: !14, line: 403, baseType: !12, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !27, file: !14, line: 404, baseType: !12, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !27, file: !14, line: 405, baseType: !12, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !27, file: !14, line: 406, baseType: !12, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !27, file: !14, line: 407, baseType: !42, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !27, file: !14, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !27, file: !14, line: 412, baseType: !42, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !352, line: 41, baseType: !353)
!352 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!353 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 31, size: 320, align: 64, elements: !354)
!354 = !{!355, !356, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !353, file: !352, line: 32, baseType: !30, size: 192, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !353, file: !352, line: 33, baseType: !225, size: 64, align: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !353, file: !352, line: 34, baseType: !88, size: 8, align: 8, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !361)
!361 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !362)
!362 = !{!363, !364, !365, !366, !374}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !361, file: !4, line: 291, baseType: !13, size: 128, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !361, file: !4, line: 292, baseType: !18, size: 64, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !361, file: !4, line: 293, baseType: !225, size: 64, align: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !361, file: !4, line: 349, baseType: !367, size: 32, align: 32, offset: 256)
!367 = !DICompositeType(tag: DW_TAG_structure_type, scope: !361, file: !4, line: 294, size: 32, align: 32, elements: !368)
!368 = !{!369, !370, !371, !372, !373}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !367, file: !4, line: 303, baseType: !348, size: 2, align: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !367, file: !4, line: 331, baseType: !348, size: 3, align: 32, offset: 2)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !367, file: !4, line: 336, baseType: !348, size: 1, align: 32, offset: 5)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !367, file: !4, line: 340, baseType: !348, size: 1, align: 32, offset: 6)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !367, file: !4, line: 345, baseType: !348, size: 1, align: 32, offset: 7)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !361, file: !4, line: 350, baseType: !375, size: 64, align: 64, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !102, line: 90, baseType: !51)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !348)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !381)
!381 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !384)
!384 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !385)
!385 = !{!386, !387, !388, !389}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !384, file: !4, line: 357, baseType: !360, size: 384, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !384, file: !4, line: 358, baseType: !18, size: 64, align: 64, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !384, file: !4, line: 360, baseType: !59, size: 64, align: 64, offset: 448)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !384, file: !4, line: 361, baseType: !18, size: 64, align: 64, offset: 512)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !392)
!392 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !393)
!393 = !{!394, !395}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !392, file: !4, line: 369, baseType: !383, size: 576, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !392, file: !4, line: 375, baseType: !396, size: 64, align: 64, offset: 576)
!396 = !DICompositeType(tag: DW_TAG_union_type, scope: !392, file: !4, line: 370, size: 64, align: 64, elements: !397)
!397 = !{!398, !399, !401, !404}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !396, file: !4, line: 371, baseType: !11, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !396, file: !4, line: 372, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !396, file: !4, line: 373, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !84)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !396, file: !4, line: 374, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !403)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !377)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStdPrinter_Object", file: !1, line: 329, baseType: !412)
!412 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 326, size: 192, align: 64, elements: !413)
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !412, file: !1, line: 327, baseType: !13, size: 128, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !412, file: !1, line: 328, baseType: !51, size: 32, align: 32, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!417 = !{!418, !434, !483, !512, !525, !543, !555, !561, !567, !572, !575, !578, !642, !652, !658, !662, !666, !671}
!418 = !DISubprogram(name: "PyFile_FromFd", scope: !1, file: !1, line: 29, type: !419, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32, i8*, i8*, i32, i8*, i8*, i8*, i32)* @PyFile_FromFd, variables: !421)
!419 = !DISubroutineType(types: !420)
!420 = !{!12, !51, !36, !36, !51, !36, !36, !36, !51}
!421 = !{!422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432}
!422 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !418, file: !1, line: 29, type: !51)
!423 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !418, file: !1, line: 29, type: !36)
!424 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 3, scope: !418, file: !1, line: 29, type: !36)
!425 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buffering", arg: 4, scope: !418, file: !1, line: 29, type: !51)
!426 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 5, scope: !418, file: !1, line: 29, type: !36)
!427 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 6, scope: !418, file: !1, line: 30, type: !36)
!428 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newline", arg: 7, scope: !418, file: !1, line: 30, type: !36)
!429 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closefd", arg: 8, scope: !418, file: !1, line: 30, type: !51)
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "io", scope: !418, file: !1, line: 32, type: !12)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stream", scope: !418, file: !1, line: 32, type: !12)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !433, file: !1, line: 41, type: !12)
!433 = distinct !DILexicalBlock(scope: !418, file: !1, line: 41, column: 5)
!434 = !DISubprogram(name: "PyFile_GetLine", scope: !1, file: !1, line: 50, type: !435, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i32)* @PyFile_GetLine, variables: !437)
!435 = !DISubroutineType(types: !436)
!436 = !{!12, !12, !51}
!437 = !{!438, !439, !440, !441, !443, !444, !448, !450, !452, !456, !459, !460, !464, !469, !471, !474, !478, !481}
!438 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !434, file: !1, line: 50, type: !12)
!439 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !434, file: !1, line: 50, type: !51)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !434, file: !1, line: 52, type: !12)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reader", scope: !442, file: !1, line: 60, type: !12)
!442 = distinct !DILexicalBlock(scope: !434, file: !1, line: 59, column: 5)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !442, file: !1, line: 61, type: !12)
!444 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !445, file: !1, line: 72, type: !12)
!445 = distinct !DILexicalBlock(scope: !446, file: !1, line: 72, column: 13)
!446 = distinct !DILexicalBlock(scope: !447, file: !1, line: 71, column: 27)
!447 = distinct !DILexicalBlock(scope: !442, file: !1, line: 71, column: 13)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !449, file: !1, line: 76, type: !12)
!449 = distinct !DILexicalBlock(scope: !442, file: !1, line: 76, column: 9)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !451, file: !1, line: 77, type: !12)
!451 = distinct !DILexicalBlock(scope: !442, file: !1, line: 77, column: 9)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !453, file: !1, line: 80, type: !12)
!453 = distinct !DILexicalBlock(scope: !454, file: !1, line: 80, column: 13)
!454 = distinct !DILexicalBlock(scope: !455, file: !1, line: 79, column: 39)
!455 = distinct !DILexicalBlock(scope: !442, file: !1, line: 78, column: 13)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !457, file: !1, line: 88, type: !59)
!457 = distinct !DILexicalBlock(scope: !458, file: !1, line: 87, column: 59)
!458 = distinct !DILexicalBlock(scope: !434, file: !1, line: 87, column: 9)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !457, file: !1, line: 89, type: !18)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !461, file: !1, line: 91, type: !12)
!461 = distinct !DILexicalBlock(scope: !462, file: !1, line: 91, column: 13)
!462 = distinct !DILexicalBlock(scope: !463, file: !1, line: 90, column: 23)
!463 = distinct !DILexicalBlock(scope: !457, file: !1, line: 90, column: 13)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !465, file: !1, line: 100, type: !12)
!465 = distinct !DILexicalBlock(scope: !466, file: !1, line: 99, column: 18)
!466 = distinct !DILexicalBlock(scope: !467, file: !1, line: 97, column: 17)
!467 = distinct !DILexicalBlock(scope: !468, file: !1, line: 96, column: 36)
!468 = distinct !DILexicalBlock(scope: !463, file: !1, line: 96, column: 18)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !470, file: !1, line: 102, type: !12)
!470 = distinct !DILexicalBlock(scope: !465, file: !1, line: 102, column: 17)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !472, file: !1, line: 108, type: !18)
!472 = distinct !DILexicalBlock(scope: !473, file: !1, line: 107, column: 61)
!473 = distinct !DILexicalBlock(scope: !434, file: !1, line: 107, column: 9)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !475, file: !1, line: 110, type: !12)
!475 = distinct !DILexicalBlock(scope: !476, file: !1, line: 110, column: 13)
!476 = distinct !DILexicalBlock(scope: !477, file: !1, line: 109, column: 23)
!477 = distinct !DILexicalBlock(scope: !472, file: !1, line: 109, column: 13)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !479, file: !1, line: 116, type: !12)
!479 = distinct !DILexicalBlock(scope: !480, file: !1, line: 115, column: 62)
!480 = distinct !DILexicalBlock(scope: !477, file: !1, line: 115, column: 18)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !482, file: !1, line: 118, type: !12)
!482 = distinct !DILexicalBlock(scope: !479, file: !1, line: 118, column: 13)
!483 = !DISubprogram(name: "PyFile_WriteObject", scope: !1, file: !1, line: 128, type: !484, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, i32)* @PyFile_WriteObject, variables: !486)
!484 = !DISubroutineType(types: !485)
!485 = !{!51, !12, !12, !51}
!486 = !{!487, !488, !489, !490, !491, !492, !493, !494, !498, !502, !504, !506, !508, !510}
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !483, file: !1, line: 128, type: !12)
!488 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 2, scope: !483, file: !1, line: 128, type: !12)
!489 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 3, scope: !483, file: !1, line: 128, type: !51)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "writer", scope: !483, file: !1, line: 130, type: !12)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !483, file: !1, line: 130, type: !12)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !483, file: !1, line: 130, type: !12)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !483, file: !1, line: 130, type: !12)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !495, file: !1, line: 146, type: !12)
!495 = distinct !DILexicalBlock(scope: !496, file: !1, line: 146, column: 9)
!496 = distinct !DILexicalBlock(scope: !497, file: !1, line: 145, column: 24)
!497 = distinct !DILexicalBlock(scope: !483, file: !1, line: 145, column: 9)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !499, file: !1, line: 151, type: !12)
!499 = distinct !DILexicalBlock(scope: !500, file: !1, line: 151, column: 9)
!500 = distinct !DILexicalBlock(scope: !501, file: !1, line: 150, column: 23)
!501 = distinct !DILexicalBlock(scope: !483, file: !1, line: 150, column: 9)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !503, file: !1, line: 152, type: !12)
!503 = distinct !DILexicalBlock(scope: !500, file: !1, line: 152, column: 9)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !505, file: !1, line: 156, type: !12)
!505 = distinct !DILexicalBlock(scope: !483, file: !1, line: 156, column: 5)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !507, file: !1, line: 157, type: !12)
!507 = distinct !DILexicalBlock(scope: !483, file: !1, line: 157, column: 5)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !509, file: !1, line: 158, type: !12)
!509 = distinct !DILexicalBlock(scope: !483, file: !1, line: 158, column: 5)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !511, file: !1, line: 161, type: !12)
!511 = distinct !DILexicalBlock(scope: !483, file: !1, line: 161, column: 5)
!512 = !DISubprogram(name: "PyFile_WriteString", scope: !1, file: !1, line: 166, type: !513, isLocal: false, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._object*)* @PyFile_WriteString, variables: !515)
!513 = !DISubroutineType(types: !514)
!514 = !{!51, !36, !12}
!515 = !{!516, !517, !518, !522, !523}
!516 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !512, file: !1, line: 166, type: !36)
!517 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 2, scope: !512, file: !1, line: 166, type: !12)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !519, file: !1, line: 176, type: !12)
!519 = distinct !DILexicalBlock(scope: !520, file: !1, line: 175, column: 33)
!520 = distinct !DILexicalBlock(scope: !521, file: !1, line: 175, column: 14)
!521 = distinct !DILexicalBlock(scope: !512, file: !1, line: 168, column: 9)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !519, file: !1, line: 177, type: !51)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !524, file: !1, line: 181, type: !12)
!524 = distinct !DILexicalBlock(scope: !519, file: !1, line: 181, column: 9)
!525 = !DISubprogram(name: "PyObject_AsFileDescriptor", scope: !1, file: !1, line: 196, type: !151, isLocal: false, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @PyObject_AsFileDescriptor, variables: !526)
!526 = !{!527, !528, !529, !530, !534, !536, !540}
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !525, file: !1, line: 196, type: !12)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !525, file: !1, line: 198, type: !51)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "meth", scope: !525, file: !1, line: 199, type: !12)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fno", scope: !531, file: !1, line: 207, type: !12)
!531 = distinct !DILexicalBlock(scope: !532, file: !1, line: 206, column: 5)
!532 = distinct !DILexicalBlock(scope: !533, file: !1, line: 205, column: 14)
!533 = distinct !DILexicalBlock(scope: !525, file: !1, line: 202, column: 9)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !535, file: !1, line: 208, type: !12)
!535 = distinct !DILexicalBlock(scope: !531, file: !1, line: 208, column: 9)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !537, file: !1, line: 214, type: !12)
!537 = distinct !DILexicalBlock(scope: !538, file: !1, line: 214, column: 13)
!538 = distinct !DILexicalBlock(scope: !539, file: !1, line: 212, column: 32)
!539 = distinct !DILexicalBlock(scope: !531, file: !1, line: 212, column: 13)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !541, file: !1, line: 219, type: !12)
!541 = distinct !DILexicalBlock(scope: !542, file: !1, line: 219, column: 13)
!542 = distinct !DILexicalBlock(scope: !539, file: !1, line: 216, column: 14)
!543 = !DISubprogram(name: "Py_UniversalNewlineFgets", scope: !1, file: !1, line: 255, type: !544, isLocal: false, isDefinition: true, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i32, %struct._IO_FILE*, %struct._object*)* @Py_UniversalNewlineFgets, variables: !546)
!544 = !DISubroutineType(types: !545)
!545 = !{!59, !59, !51, !52, !12}
!546 = !{!547, !548, !549, !550, !551, !552, !553, !554}
!547 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 1, scope: !543, file: !1, line: 255, type: !59)
!548 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !543, file: !1, line: 255, type: !51)
!549 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stream", arg: 3, scope: !543, file: !1, line: 255, type: !52)
!550 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fobj", arg: 4, scope: !543, file: !1, line: 255, type: !12)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !543, file: !1, line: 257, type: !59)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !543, file: !1, line: 258, type: !51)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newlinetypes", scope: !543, file: !1, line: 259, type: !51)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "skipnextlf", scope: !543, file: !1, line: 260, type: !51)
!555 = !DISubprogram(name: "PyFile_NewStdPrinter", scope: !1, file: !1, line: 355, type: !556, isLocal: false, isDefinition: true, scopeLine: 356, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32)* @PyFile_NewStdPrinter, variables: !558)
!556 = !DISubroutineType(types: !557)
!557 = !{!12, !51}
!558 = !{!559, !560}
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !555, file: !1, line: 355, type: !51)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !555, file: !1, line: 357, type: !410)
!561 = !DISubprogram(name: "getc_unlocked", scope: !562, file: !562, line: 63, type: !563, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, variables: !565)
!562 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!563 = !DISubroutineType(types: !564)
!564 = !{!51, !52}
!565 = !{!566}
!566 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__fp", arg: 1, scope: !561, file: !562, line: 63, type: !52)
!567 = !DISubprogram(name: "stdprinter_repr", scope: !1, file: !1, line: 419, type: !568, isLocal: true, isDefinition: true, scopeLine: 420, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyStdPrinter_Object*)* @stdprinter_repr, variables: !570)
!568 = !DISubroutineType(types: !569)
!569 = !{!12, !410}
!570 = !{!571}
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !567, file: !1, line: 419, type: !410)
!572 = !DISubprogram(name: "stdprinter_noop", scope: !1, file: !1, line: 426, type: !568, isLocal: true, isDefinition: true, scopeLine: 427, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyStdPrinter_Object*)* @stdprinter_noop, variables: !573)
!573 = !{!574}
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !572, file: !1, line: 426, type: !410)
!575 = !DISubprogram(name: "stdprinter_fileno", scope: !1, file: !1, line: 413, type: !568, isLocal: true, isDefinition: true, scopeLine: 414, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyStdPrinter_Object*)* @stdprinter_fileno, variables: !576)
!576 = !{!577}
!577 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !575, file: !1, line: 413, type: !410)
!578 = !DISubprogram(name: "stdprinter_isatty", scope: !1, file: !1, line: 432, type: !568, isLocal: true, isDefinition: true, scopeLine: 433, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyStdPrinter_Object*)* @stdprinter_isatty, variables: !579)
!579 = !{!580, !581, !582}
!580 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !578, file: !1, line: 432, type: !410)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !578, file: !1, line: 434, type: !24)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !583, file: !1, line: 439, type: !584)
!583 = distinct !DILexicalBlock(scope: !578, file: !1, line: 439, column: 5)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !586, line: 139, baseType: !587)
!586 = !DIFile(filename: "Include/pystate.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !586, line: 69, size: 1536, align: 64, elements: !588)
!588 = !{!589, !591, !592, !612, !615, !616, !617, !618, !619, !620, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !587, file: !586, line: 72, baseType: !590, size: 64, align: 64)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !587, file: !586, line: 73, baseType: !590, size: 64, align: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !587, file: !586, line: 74, baseType: !593, size: 64, align: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !586, line: 44, baseType: !595)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !586, line: 19, size: 832, align: 64, elements: !596)
!596 = !{!597, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !595, file: !586, line: 21, baseType: !598, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !595, file: !586, line: 22, baseType: !590, size: 64, align: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !595, file: !586, line: 24, baseType: !12, size: 64, align: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !595, file: !586, line: 25, baseType: !12, size: 64, align: 64, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !595, file: !586, line: 26, baseType: !12, size: 64, align: 64, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !595, file: !586, line: 27, baseType: !12, size: 64, align: 64, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !595, file: !586, line: 28, baseType: !12, size: 64, align: 64, offset: 384)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !595, file: !586, line: 30, baseType: !12, size: 64, align: 64, offset: 448)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !595, file: !586, line: 31, baseType: !12, size: 64, align: 64, offset: 512)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !595, file: !586, line: 32, baseType: !12, size: 64, align: 64, offset: 576)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !595, file: !586, line: 33, baseType: !51, size: 32, align: 32, offset: 640)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !595, file: !586, line: 34, baseType: !51, size: 32, align: 32, offset: 672)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !595, file: !586, line: 37, baseType: !51, size: 32, align: 32, offset: 704)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !595, file: !586, line: 43, baseType: !12, size: 64, align: 64, offset: 768)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !587, file: !586, line: 76, baseType: !613, size: 64, align: 64, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64, align: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !586, line: 50, flags: DIFlagFwdDecl)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !587, file: !586, line: 77, baseType: !51, size: 32, align: 32, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !587, file: !586, line: 78, baseType: !38, size: 8, align: 8, offset: 288)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !587, file: !586, line: 80, baseType: !38, size: 8, align: 8, offset: 296)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !587, file: !586, line: 85, baseType: !51, size: 32, align: 32, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !587, file: !586, line: 86, baseType: !51, size: 32, align: 32, offset: 352)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !587, file: !586, line: 88, baseType: !621, size: 64, align: 64, offset: 384)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !586, line: 54, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64, align: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!51, !12, !613, !51, !12}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !587, file: !586, line: 89, baseType: !621, size: 64, align: 64, offset: 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !587, file: !586, line: 90, baseType: !12, size: 64, align: 64, offset: 512)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !587, file: !586, line: 91, baseType: !12, size: 64, align: 64, offset: 576)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !587, file: !586, line: 93, baseType: !12, size: 64, align: 64, offset: 640)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !587, file: !586, line: 94, baseType: !12, size: 64, align: 64, offset: 704)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !587, file: !586, line: 95, baseType: !12, size: 64, align: 64, offset: 768)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !587, file: !586, line: 97, baseType: !12, size: 64, align: 64, offset: 832)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !587, file: !586, line: 98, baseType: !12, size: 64, align: 64, offset: 896)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !587, file: !586, line: 99, baseType: !12, size: 64, align: 64, offset: 960)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !587, file: !586, line: 101, baseType: !12, size: 64, align: 64, offset: 1024)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !587, file: !586, line: 103, baseType: !51, size: 32, align: 32, offset: 1088)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !587, file: !586, line: 105, baseType: !12, size: 64, align: 64, offset: 1152)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !587, file: !586, line: 106, baseType: !24, size: 64, align: 64, offset: 1216)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !587, file: !586, line: 108, baseType: !51, size: 32, align: 32, offset: 1280)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !587, file: !586, line: 109, baseType: !12, size: 64, align: 64, offset: 1344)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !587, file: !586, line: 134, baseType: !337, size: 64, align: 64, offset: 1408)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !587, file: !586, line: 135, baseType: !11, size: 64, align: 64, offset: 1472)
!642 = !DISubprogram(name: "stdprinter_write", scope: !1, file: !1, line: 373, type: !643, isLocal: true, isDefinition: true, scopeLine: 374, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyStdPrinter_Object*, %struct._object*)* @stdprinter_write, variables: !645)
!643 = !DISubroutineType(types: !644)
!644 = !{!12, !410, !12}
!645 = !{!646, !647, !648, !649, !650}
!646 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !642, file: !1, line: 373, type: !410)
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !642, file: !1, line: 373, type: !12)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !642, file: !1, line: 375, type: !59)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !642, file: !1, line: 376, type: !18)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !651, file: !1, line: 391, type: !584)
!651 = distinct !DILexicalBlock(scope: !642, file: !1, line: 391, column: 5)
!652 = !DISubprogram(name: "get_closed", scope: !1, file: !1, line: 456, type: !653, isLocal: true, isDefinition: true, scopeLine: 457, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyStdPrinter_Object*, i8*)* @get_closed, variables: !655)
!653 = !DISubroutineType(types: !654)
!654 = !{!12, !410, !11}
!655 = !{!656, !657}
!656 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !652, file: !1, line: 456, type: !410)
!657 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !652, file: !1, line: 456, type: !11)
!658 = !DISubprogram(name: "get_encoding", scope: !1, file: !1, line: 469, type: !653, isLocal: true, isDefinition: true, scopeLine: 470, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyStdPrinter_Object*, i8*)* @get_encoding, variables: !659)
!659 = !{!660, !661}
!660 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !658, file: !1, line: 469, type: !410)
!661 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !658, file: !1, line: 469, type: !11)
!662 = !DISubprogram(name: "get_mode", scope: !1, file: !1, line: 463, type: !653, isLocal: true, isDefinition: true, scopeLine: 464, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyStdPrinter_Object*, i8*)* @get_mode, variables: !663)
!663 = !{!664, !665}
!664 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !662, file: !1, line: 463, type: !410)
!665 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !662, file: !1, line: 463, type: !11)
!666 = !DISubprogram(name: "stdprinter_init", scope: !1, file: !1, line: 347, type: !218, isLocal: true, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, %struct._object*)* @stdprinter_init, variables: !667)
!667 = !{!668, !669, !670}
!668 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !666, file: !1, line: 347, type: !12)
!669 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !666, file: !1, line: 347, type: !12)
!670 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !666, file: !1, line: 347, type: !12)
!671 = !DISubprogram(name: "stdprinter_new", scope: !1, file: !1, line: 332, type: !672, isLocal: true, isDefinition: true, scopeLine: 333, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @stdprinter_new, variables: !676)
!672 = !DISubroutineType(types: !673)
!673 = !{!12, !674, !12, !12}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64, align: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !14, line: 422, baseType: !27)
!676 = !{!677, !678, !679, !680}
!677 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !671, file: !1, line: 332, type: !674)
!678 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !671, file: !1, line: 332, type: !12)
!679 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kews", arg: 3, scope: !671, file: !1, line: 332, type: !12)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !671, file: !1, line: 334, type: !410)
!681 = !{!682, !690, !691, !692, !693, !694, !699}
!682 = !DIGlobalVariable(name: "PyId_open", scope: !418, file: !1, line: 33, type: !683, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @PyFile_FromFd.PyId_open)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !14, line: 144, baseType: !684)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !14, line: 140, size: 192, align: 64, elements: !685)
!685 = !{!686, !688, !689}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !684, file: !14, line: 141, baseType: !687, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !684, file: !14, line: 142, baseType: !36, size: 64, align: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !684, file: !14, line: 143, baseType: !12, size: 64, align: 64, offset: 128)
!690 = !DIGlobalVariable(name: "PyId_readline", scope: !434, file: !1, line: 62, type: !683, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @PyFile_GetLine.PyId_readline)
!691 = !DIGlobalVariable(name: "PyId_write", scope: !483, file: !1, line: 131, type: !683, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @PyFile_WriteObject.PyId_write)
!692 = !DIGlobalVariable(name: "PyId_fileno", scope: !525, file: !1, line: 200, type: !683, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @PyObject_AsFileDescriptor.PyId_fileno)
!693 = !DIGlobalVariable(name: "PyStdPrinter_Type", scope: !0, file: !1, line: 481, type: !675, isLocal: false, isDefinition: true, variable: %struct._typeobject* @PyStdPrinter_Type)
!694 = !DIGlobalVariable(name: "stdprinter_methods", scope: !0, file: !1, line: 446, type: !695, isLocal: true, isDefinition: true, variable: [6 x %struct.PyMethodDef]* @stdprinter_methods)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 1536, align: 64, elements: !697)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !288, line: 47, baseType: !287)
!697 = !{!698}
!698 = !DISubrange(count: 6)
!699 = !DIGlobalVariable(name: "stdprinter_getsetlist", scope: !0, file: !1, line: 474, type: !700, isLocal: true, isDefinition: true, variable: [4 x %struct.PyGetSetDef]* @stdprinter_getsetlist)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !701, size: 1280, align: 64, elements: !702)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !301, line: 17, baseType: !300)
!702 = !{!703}
!703 = !DISubrange(count: 4)
!704 = !{i32 2, !"Dwarf Version", i32 4}
!705 = !{i32 2, !"Debug Info Version", i32 3}
!706 = !{!"clang version 3.7.0 (tags/RELEASE_370/final)"}
!707 = !DIExpression()
!708 = !DILocation(line: 29, column: 19, scope: !418)
!709 = !DILocation(line: 29, column: 35, scope: !418)
!710 = !DILocation(line: 29, column: 53, scope: !418)
!711 = !DILocation(line: 29, column: 63, scope: !418)
!712 = !DILocation(line: 29, column: 86, scope: !418)
!713 = !DILocation(line: 30, column: 27, scope: !418)
!714 = !DILocation(line: 30, column: 47, scope: !418)
!715 = !DILocation(line: 30, column: 60, scope: !418)
!716 = !DILocation(line: 35, column: 10, scope: !418)
!717 = !DILocation(line: 32, column: 15, scope: !418)
!718 = !DILocation(line: 36, column: 12, scope: !719)
!719 = distinct !DILexicalBlock(scope: !418, file: !1, line: 36, column: 9)
!720 = !DILocation(line: 36, column: 9, scope: !418)
!721 = !DILocation(line: 38, column: 14, scope: !418)
!722 = !DILocation(line: 32, column: 20, scope: !418)
!723 = !DILocation(line: 41, column: 5, scope: !724)
!724 = !DILexicalBlockFile(scope: !433, file: !1, discriminator: 1)
!725 = !DILocation(line: 41, column: 5, scope: !726)
!726 = distinct !DILexicalBlock(scope: !433, file: !1, line: 41, column: 5)
!727 = !{!728, !729, i64 0}
!728 = !{!"_object", !729, i64 0, !732, i64 8}
!729 = !{!"long", !730, i64 0}
!730 = !{!"omnipotent char", !731, i64 0}
!731 = !{!"Simple C/C++ TBAA"}
!732 = !{!"any pointer", !730, i64 0}
!733 = !DILocation(line: 41, column: 5, scope: !433)
!734 = !DILocation(line: 41, column: 5, scope: !735)
!735 = !DILexicalBlockFile(scope: !726, file: !1, discriminator: 3)
!736 = !{!728, !732, i64 8}
!737 = !{!738, !732, i64 48}
