; ModuleID = 'firstsets.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.grammar = type { i32, %struct.dfa*, %struct.labellist, i32, i32 }
%struct.dfa = type { i32, i8*, i32, i32, %struct.state*, i8* }
%struct.state = type { i32, %struct.arc*, i32, i32, i32*, i32 }
%struct.arc = type { i16, i16 }
%struct.labellist = type { i32, %struct.label* }
%struct.label = type { i32, i8* }

@Py_DebugFlag = external global i32, align 4
@calcfirstset.dummy = internal unnamed_addr global i8* null, align 8
@.str.1 = private unnamed_addr constant [30 x i8] c"Calculate FIRST set for '%s'\0A\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.2 = private unnamed_addr constant [25 x i8] c"Left-recursion for '%s'\0A\00", align 1
@.str.3 = private unnamed_addr constant [39 x i8] c"Re-calculating FIRST set for '%s' ???\0A\00", align 1
@.str.4 = private unnamed_addr constant [35 x i8] c"no mem for new sym in calcfirstset\00", align 1
@.str.5 = private unnamed_addr constant [37 x i8] c"no mem to resize sym in calcfirstset\00", align 1
@.str.6 = private unnamed_addr constant [27 x i8] c"Left-recursion below '%s'\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !9, globals: !84)
!1 = !DIFile(filename: "Parser/firstsets.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !7}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!9 = !{!10, !67}
!10 = !DISubprogram(name: "_Py_addfirstsets", scope: !1, file: !1, line: 14, type: !11, isLocal: false, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.grammar*)* @_Py_addfirstsets, variables: !63)
!11 = !DISubroutineType(types: !12)
!12 = !{null, !13}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "grammar", file: !15, line: 67, baseType: !16)
!15 = !DIFile(filename: "Include/grammar.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!16 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 61, size: 320, align: 64, elements: !17)
!17 = !{!18, !19, !49, !61, !62}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "g_ndfas", scope: !16, file: !15, line: 62, baseType: !6, size: 32, align: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "g_dfa", scope: !16, file: !15, line: 63, baseType: !20, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "dfa", file: !15, line: 57, baseType: !22)
!22 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 50, size: 320, align: 64, elements: !23)
!23 = !{!24, !25, !26, !27, !28, !46}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !22, file: !15, line: 51, baseType: !6, size: 32, align: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !22, file: !15, line: 52, baseType: !7, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "d_initial", scope: !22, file: !15, line: 53, baseType: !6, size: 32, align: 32, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "d_nstates", scope: !22, file: !15, line: 54, baseType: !6, size: 32, align: 32, offset: 160)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "d_state", scope: !22, file: !15, line: 55, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "state", file: !15, line: 46, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 37, size: 320, align: 64, elements: !32)
!32 = !{!33, !34, !42, !43, !44, !45}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "s_narcs", scope: !31, file: !15, line: 38, baseType: !6, size: 32, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "s_arc", scope: !31, file: !15, line: 39, baseType: !35, size: 64, align: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc", file: !15, line: 33, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 30, size: 32, align: 16, elements: !38)
!38 = !{!39, !41}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "a_lbl", scope: !37, file: !15, line: 31, baseType: !40, size: 16, align: 16)
!40 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "a_arrow", scope: !37, file: !15, line: 32, baseType: !40, size: 16, align: 16, offset: 16)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "s_lower", scope: !31, file: !15, line: 42, baseType: !6, size: 32, align: 32, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "s_upper", scope: !31, file: !15, line: 43, baseType: !6, size: 32, align: 32, offset: 160)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "s_accel", scope: !31, file: !15, line: 44, baseType: !5, size: 64, align: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "s_accept", scope: !31, file: !15, line: 45, baseType: !6, size: 32, align: 32, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "d_first", scope: !22, file: !15, line: 56, baseType: !47, size: 64, align: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitset", file: !48, line: 12, baseType: !7)
!48 = !DIFile(filename: "Include/bitset.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!49 = !DIDerivedType(tag: DW_TAG_member, name: "g_ll", scope: !16, file: !15, line: 64, baseType: !50, size: 128, align: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "labellist", file: !15, line: 26, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 23, size: 128, align: 64, elements: !52)
!52 = !{!53, !54}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ll_nlabels", scope: !51, file: !15, line: 24, baseType: !6, size: 32, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ll_label", scope: !51, file: !15, line: 25, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "label", file: !15, line: 17, baseType: !57)
!57 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 14, size: 128, align: 64, elements: !58)
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !57, file: !15, line: 15, baseType: !6, size: 32, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "lb_str", scope: !57, file: !15, line: 16, baseType: !7, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "g_start", scope: !16, file: !15, line: 65, baseType: !6, size: 32, align: 32, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "g_accel", scope: !16, file: !15, line: 66, baseType: !6, size: 32, align: 32, offset: 288)
!63 = !{!64, !65, !66}
!64 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !10, file: !1, line: 14, type: !13)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !10, file: !1, line: 16, type: !6)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !10, file: !1, line: 17, type: !20)
!67 = !DISubprogram(name: "calcfirstset", scope: !1, file: !1, line: 29, type: !68, isLocal: true, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.grammar*, %struct.dfa*)* @calcfirstset, variables: !70)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !13, !20}
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83}
!71 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !67, file: !1, line: 29, type: !13)
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 2, scope: !67, file: !1, line: 29, type: !20)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !67, file: !1, line: 31, type: !6)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !67, file: !1, line: 31, type: !6)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !67, file: !1, line: 32, type: !29)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !67, file: !1, line: 33, type: !35)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nsyms", scope: !67, file: !1, line: 34, type: !6)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sym", scope: !67, file: !1, line: 35, type: !5)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbits", scope: !67, file: !1, line: 36, type: !6)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !67, file: !1, line: 38, type: !47)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !67, file: !1, line: 39, type: !6)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d1", scope: !67, file: !1, line: 40, type: !20)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l0", scope: !67, file: !1, line: 41, type: !55)
!84 = !{!85}
!85 = !DIGlobalVariable(name: "dummy", scope: !67, file: !1, line: 37, type: !47, isLocal: true, isDefinition: true, variable: i8** @calcfirstset.dummy)
!86 = !{i32 2, !"Dwarf Version", i32 4}
!87 = !{i32 2, !"Debug Info Version", i32 3}
!88 = !{!"clang version 3.7.0 (tags/RELEASE_370/final)"}
!89 = !DIExpression()
!90 = !DILocation(line: 14, column: 23, scope: !10)
!91 = !DILocation(line: 19, column: 9, scope: !92)
!92 = distinct !DILexicalBlock(scope: !10, file: !1, line: 19, column: 9)
!93 = !{!94, !94, i64 0}
!94 = !{!"int", !95, i64 0}
!95 = !{!"omnipotent char", !96, i64 0}
!96 = !{!"Simple C/C++ TBAA"}
!97 = !DILocation(line: 19, column: 9, scope: !10)
!98 = !DILocation(line: 20, column: 9, scope: !92)
!99 = !DILocation(line: 21, column: 24, scope: !100)
!100 = distinct !DILexicalBlock(scope: !101, file: !1, line: 21, column: 5)
!101 = distinct !DILexicalBlock(scope: !10, file: !1, line: 21, column: 5)
!102 = !{!103, !94, i64 0}
!103 = !{!"", !94, i64 0, !104, i64 8, !105, i64 16, !94, i64 32, !94, i64 36}
!104 = !{!"any pointer", !95, i64 0}
!105 = !{!"", !94, i64 0, !104, i64 8}
!106 = !DILocation(line: 21, column: 19, scope: !100)
!107 = !DILocation(line: 21, column: 5, scope: !101)
!108 = !DILocation(line: 22, column: 17, scope: !109)
!109 = distinct !DILexicalBlock(scope: !100, file: !1, line: 21, column: 38)
!110 = !DILocation(line: 22, column: 14, scope: !109)
!111 = !{!103, !104, i64 8}
!112 = !DILocation(line: 17, column: 10, scope: !10)
!113 = !DILocation(line: 23, column: 16, scope: !114)
!114 = distinct !DILexicalBlock(scope: !109, file: !1, line: 23, column: 13)
!115 = !{!116, !104, i64 32}
!116 = !{!"", !94, i64 0, !104, i64 8, !94, i64 16, !94, i64 20, !104, i64 24, !104, i64 32}
