; ModuleID = 'floatobject.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !15, subprograms: !396, globals: !958)
!1 = !DIFile(filename: "Objects/floatobject.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3, !8}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 1567, size: 32, align: 32, elements: !4)
!4 = !{!5, !6, !7}
!5 = !DIEnumerator(name: "unknown_format", value: 0)
!6 = !DIEnumerator(name: "ieee_big_endian_format", value: 1)
!7 = !DIEnumerator(name: "ieee_little_endian_format", value: 2)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !9, line: 451, size: 32, align: 32, elements: !10)
!9 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!10 = !{!11, !12, !13, !14}
!11 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!12 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!13 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!14 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!15 = !{!16, !17, !55, !363, !371, !372, !358, !47, !373, !69, !370, !40, !38, !111, !61, !374, !376, !45, !378}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !19, line: 33, baseType: !20)
!19 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!20 = !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 25, size: 256, align: 64, elements: !21)
!21 = !{!22, !361}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !20, file: !19, line: 26, baseType: !23, size: 192, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !24, line: 114, baseType: !25)
!24 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!25 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 111, size: 192, align: 64, elements: !26)
!26 = !{!27, !360}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !25, file: !24, line: 112, baseType: !28, size: 128, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !24, line: 109, baseType: !29)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !24, line: 105, size: 128, align: 64, elements: !30)
!30 = !{!31, !39}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !29, file: !24, line: 107, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !33, line: 177, baseType: !34)
!33 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !35, line: 102, baseType: !36)
!35 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !37, line: 181, baseType: !38)
!37 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!38 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !29, file: !24, line: 108, baseType: !40, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !24, line: 334, size: 3200, align: 64, elements: !42)
!42 = !{!43, !44, !48, !49, !50, !56, !119, !124, !129, !130, !135, !187, !218, !230, !236, !237, !238, !240, !242, !273, !274, !275, !284, !285, !290, !291, !293, !295, !305, !308, !326, !327, !328, !330, !332, !333, !335, !340, !345, !350, !351, !352, !353, !354, !355, !356, !357, !359}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !41, file: !24, line: 335, baseType: !23, size: 192, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !41, file: !24, line: 336, baseType: !45, size: 64, align: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!47 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !41, file: !24, line: 337, baseType: !32, size: 64, align: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !41, file: !24, line: 337, baseType: !32, size: 64, align: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !41, file: !24, line: 341, baseType: !51, size: 64, align: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !24, line: 308, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !55}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !41, file: !24, line: 342, baseType: !57, size: 64, align: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !24, line: 314, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !55, !62, !61}
!61 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !35, line: 48, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !65, line: 246, size: 1728, align: 64, elements: !66)
!65 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!66 = !{!67, !68, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !88, !89, !90, !91, !93, !95, !97, !101, !104, !106, !107, !108, !109, !110, !114, !115}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !64, file: !65, line: 247, baseType: !61, size: 32, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !64, file: !65, line: 252, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !64, file: !65, line: 253, baseType: !69, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !64, file: !65, line: 254, baseType: !69, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !64, file: !65, line: 255, baseType: !69, size: 64, align: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !64, file: !65, line: 256, baseType: !69, size: 64, align: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !64, file: !65, line: 257, baseType: !69, size: 64, align: 64, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !64, file: !65, line: 258, baseType: !69, size: 64, align: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !64, file: !65, line: 259, baseType: !69, size: 64, align: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !64, file: !65, line: 261, baseType: !69, size: 64, align: 64, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !64, file: !65, line: 262, baseType: !69, size: 64, align: 64, offset: 640)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !64, file: !65, line: 263, baseType: !69, size: 64, align: 64, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !64, file: !65, line: 265, baseType: !81, size: 64, align: 64, offset: 768)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !65, line: 161, size: 192, align: 64, elements: !83)
!83 = !{!84, !85, !87}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !82, file: !65, line: 162, baseType: !81, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !82, file: !65, line: 163, baseType: !86, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !82, file: !65, line: 167, baseType: !61, size: 32, align: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !64, file: !65, line: 267, baseType: !86, size: 64, align: 64, offset: 832)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !64, file: !65, line: 269, baseType: !61, size: 32, align: 32, offset: 896)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !64, file: !65, line: 273, baseType: !61, size: 32, align: 32, offset: 928)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !64, file: !65, line: 275, baseType: !92, size: 64, align: 64, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !37, line: 140, baseType: !38)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !64, file: !65, line: 279, baseType: !94, size: 16, align: 16, offset: 1024)
!94 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !64, file: !65, line: 280, baseType: !96, size: 8, align: 8, offset: 1040)
!96 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !64, file: !65, line: 281, baseType: !98, size: 8, align: 8, offset: 1048)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8, align: 8, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 1)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !64, file: !65, line: 285, baseType: !102, size: 64, align: 64, offset: 1088)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !65, line: 155, baseType: null)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !64, file: !65, line: 294, baseType: !105, size: 64, align: 64, offset: 1152)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !37, line: 141, baseType: !38)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !64, file: !65, line: 303, baseType: !16, size: 64, align: 64, offset: 1216)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !64, file: !65, line: 304, baseType: !16, size: 64, align: 64, offset: 1280)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !64, file: !65, line: 305, baseType: !16, size: 64, align: 64, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !64, file: !65, line: 306, baseType: !16, size: 64, align: 64, offset: 1408)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !64, file: !65, line: 307, baseType: !111, size: 64, align: 64, offset: 1472)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !112, line: 62, baseType: !113)
!112 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!113 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !64, file: !65, line: 309, baseType: !61, size: 32, align: 32, offset: 1536)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !64, file: !65, line: 311, baseType: !116, size: 160, align: 8, offset: 1568)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 160, align: 8, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 20)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !41, file: !24, line: 343, baseType: !120, size: 64, align: 64, offset: 512)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !24, line: 316, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!55, !55, !69}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !41, file: !24, line: 344, baseType: !125, size: 64, align: 64, offset: 576)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !24, line: 318, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!61, !55, !69, !55}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !41, file: !24, line: 345, baseType: !16, size: 64, align: 64, offset: 640)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !41, file: !24, line: 346, baseType: !131, size: 64, align: 64, offset: 704)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !24, line: 320, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!55, !55}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !41, file: !24, line: 350, baseType: !136, size: 64, align: 64, offset: 768)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !24, line: 278, baseType: !138)
!138 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 236, size: 2176, align: 64, elements: !139)
!139 = !{!140, !145, !146, !147, !148, !149, !154, !156, !157, !158, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !138, file: !24, line: 241, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !24, line: 166, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!55, !55, !55}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !138, file: !24, line: 242, baseType: !141, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !138, file: !24, line: 243, baseType: !141, size: 64, align: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !138, file: !24, line: 244, baseType: !141, size: 64, align: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !138, file: !24, line: 245, baseType: !141, size: 64, align: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !138, file: !24, line: 246, baseType: !150, size: 64, align: 64, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !24, line: 167, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!55, !55, !55, !55}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !138, file: !24, line: 247, baseType: !155, size: 64, align: 64, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !24, line: 165, baseType: !132)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !138, file: !24, line: 248, baseType: !155, size: 64, align: 64, offset: 448)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !138, file: !24, line: 249, baseType: !155, size: 64, align: 64, offset: 512)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !138, file: !24, line: 250, baseType: !159, size: 64, align: 64, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !24, line: 168, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!61, !55}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !138, file: !24, line: 251, baseType: !155, size: 64, align: 64, offset: 640)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !138, file: !24, line: 252, baseType: !141, size: 64, align: 64, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !138, file: !24, line: 253, baseType: !141, size: 64, align: 64, offset: 768)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !138, file: !24, line: 254, baseType: !141, size: 64, align: 64, offset: 832)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !138, file: !24, line: 255, baseType: !141, size: 64, align: 64, offset: 896)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !138, file: !24, line: 256, baseType: !141, size: 64, align: 64, offset: 960)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !138, file: !24, line: 257, baseType: !155, size: 64, align: 64, offset: 1024)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !138, file: !24, line: 258, baseType: !16, size: 64, align: 64, offset: 1088)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !138, file: !24, line: 259, baseType: !155, size: 64, align: 64, offset: 1152)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !138, file: !24, line: 261, baseType: !141, size: 64, align: 64, offset: 1216)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !138, file: !24, line: 262, baseType: !141, size: 64, align: 64, offset: 1280)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !138, file: !24, line: 263, baseType: !141, size: 64, align: 64, offset: 1344)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !138, file: !24, line: 264, baseType: !141, size: 64, align: 64, offset: 1408)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !138, file: !24, line: 265, baseType: !150, size: 64, align: 64, offset: 1472)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !138, file: !24, line: 266, baseType: !141, size: 64, align: 64, offset: 1536)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !138, file: !24, line: 267, baseType: !141, size: 64, align: 64, offset: 1600)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !138, file: !24, line: 268, baseType: !141, size: 64, align: 64, offset: 1664)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !138, file: !24, line: 269, baseType: !141, size: 64, align: 64, offset: 1728)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !138, file: !24, line: 270, baseType: !141, size: 64, align: 64, offset: 1792)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !138, file: !24, line: 272, baseType: !141, size: 64, align: 64, offset: 1856)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !138, file: !24, line: 273, baseType: !141, size: 64, align: 64, offset: 1920)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !138, file: !24, line: 274, baseType: !141, size: 64, align: 64, offset: 1984)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !138, file: !24, line: 275, baseType: !141, size: 64, align: 64, offset: 2048)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !138, file: !24, line: 277, baseType: !155, size: 64, align: 64, offset: 2112)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !41, file: !24, line: 351, baseType: !188, size: 64, align: 64, offset: 832)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !24, line: 292, baseType: !190)
!190 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 280, size: 640, align: 64, elements: !191)
!191 = !{!192, !197, !198, !203, !204, !205, !210, !211, !216, !217}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !190, file: !24, line: 281, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !24, line: 169, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!32, !55}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !190, file: !24, line: 282, baseType: !141, size: 64, align: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !190, file: !24, line: 283, baseType: !199, size: 64, align: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !24, line: 170, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!55, !55, !32}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !190, file: !24, line: 284, baseType: !199, size: 64, align: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !190, file: !24, line: 285, baseType: !16, size: 64, align: 64, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !190, file: !24, line: 286, baseType: !206, size: 64, align: 64, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !24, line: 172, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!61, !55, !32, !55}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !190, file: !24, line: 287, baseType: !16, size: 64, align: 64, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !190, file: !24, line: 288, baseType: !212, size: 64, align: 64, offset: 448)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !24, line: 231, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!61, !55, !55}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !190, file: !24, line: 290, baseType: !141, size: 64, align: 64, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !190, file: !24, line: 291, baseType: !199, size: 64, align: 64, offset: 576)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !41, file: !24, line: 352, baseType: !219, size: 64, align: 64, offset: 896)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !24, line: 298, baseType: !221)
!221 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 294, size: 192, align: 64, elements: !222)
!222 = !{!223, !224, !225}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !221, file: !24, line: 295, baseType: !193, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !221, file: !24, line: 296, baseType: !141, size: 64, align: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !221, file: !24, line: 297, baseType: !226, size: 64, align: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !24, line: 174, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!61, !55, !55, !55}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !41, file: !24, line: 356, baseType: !231, size: 64, align: 64, offset: 960)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !24, line: 321, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!235, !55}
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !33, line: 186, baseType: !32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !41, file: !24, line: 357, baseType: !150, size: 64, align: 64, offset: 1024)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !41, file: !24, line: 358, baseType: !131, size: 64, align: 64, offset: 1088)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !41, file: !24, line: 359, baseType: !239, size: 64, align: 64, offset: 1152)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !24, line: 317, baseType: !142)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !41, file: !24, line: 360, baseType: !241, size: 64, align: 64, offset: 1216)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !24, line: 319, baseType: !227)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !41, file: !24, line: 363, baseType: !243, size: 64, align: 64, offset: 1280)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !24, line: 304, baseType: !245)
!245 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 301, size: 128, align: 64, elements: !246)
!246 = !{!247, !268}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !245, file: !24, line: 302, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !24, line: 193, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!61, !55, !252, !61}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !24, line: 191, baseType: !254)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !24, line: 178, size: 640, align: 64, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263, !265, !266, !267}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !254, file: !24, line: 179, baseType: !16, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !254, file: !24, line: 180, baseType: !55, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !254, file: !24, line: 181, baseType: !32, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !254, file: !24, line: 182, baseType: !32, size: 64, align: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !254, file: !24, line: 184, baseType: !61, size: 32, align: 32, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !254, file: !24, line: 185, baseType: !61, size: 32, align: 32, offset: 288)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !254, file: !24, line: 186, baseType: !69, size: 64, align: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !254, file: !24, line: 187, baseType: !264, size: 64, align: 64, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !254, file: !24, line: 188, baseType: !264, size: 64, align: 64, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !254, file: !24, line: 189, baseType: !264, size: 64, align: 64, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !254, file: !24, line: 190, baseType: !16, size: 64, align: 64, offset: 576)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !245, file: !24, line: 303, baseType: !269, size: 64, align: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !24, line: 194, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !55, !252}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !41, file: !24, line: 366, baseType: !113, size: 64, align: 64, offset: 1344)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !41, file: !24, line: 368, baseType: !45, size: 64, align: 64, offset: 1408)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !41, file: !24, line: 372, baseType: !276, size: 64, align: 64, offset: 1472)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !24, line: 233, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!61, !55, !280, !16}
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !24, line: 232, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!61, !55, !16}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !41, file: !24, line: 375, baseType: !159, size: 64, align: 64, offset: 1536)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !41, file: !24, line: 379, baseType: !286, size: 64, align: 64, offset: 1600)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !24, line: 322, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!55, !55, !55, !61}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !41, file: !24, line: 382, baseType: !32, size: 64, align: 64, offset: 1664)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !41, file: !24, line: 385, baseType: !292, size: 64, align: 64, offset: 1728)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !24, line: 323, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !41, file: !24, line: 386, baseType: !294, size: 64, align: 64, offset: 1792)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !24, line: 324, baseType: !132)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !41, file: !24, line: 389, baseType: !296, size: 64, align: 64, offset: 1856)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !298, line: 40, size: 256, align: 64, elements: !299)
!298 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!299 = !{!300, !301, !303, !304}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !297, file: !298, line: 41, baseType: !45, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !297, file: !298, line: 42, baseType: !302, size: 64, align: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !298, line: 18, baseType: !142)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !297, file: !298, line: 43, baseType: !61, size: 32, align: 32, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !297, file: !298, line: 45, baseType: !45, size: 64, align: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !41, file: !24, line: 390, baseType: !306, size: 64, align: 64, offset: 1920)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !24, line: 390, flags: DIFlagFwdDecl)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !41, file: !24, line: 391, baseType: !309, size: 64, align: 64, offset: 1984)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !311, line: 11, size: 320, align: 64, elements: !312)
!311 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!312 = !{!313, !314, !319, !324, !325}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !310, file: !311, line: 12, baseType: !69, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !310, file: !311, line: 13, baseType: !315, size: 64, align: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !311, line: 8, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!55, !55, !16}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !310, file: !311, line: 14, baseType: !320, size: 64, align: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !311, line: 9, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!61, !55, !55, !16}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !310, file: !311, line: 15, baseType: !69, size: 64, align: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !310, file: !311, line: 16, baseType: !16, size: 64, align: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !41, file: !24, line: 392, baseType: !40, size: 64, align: 64, offset: 2048)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !41, file: !24, line: 393, baseType: !55, size: 64, align: 64, offset: 2112)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !41, file: !24, line: 394, baseType: !329, size: 64, align: 64, offset: 2176)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !24, line: 325, baseType: !151)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !41, file: !24, line: 395, baseType: !331, size: 64, align: 64, offset: 2240)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !24, line: 326, baseType: !227)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !41, file: !24, line: 396, baseType: !32, size: 64, align: 64, offset: 2304)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !41, file: !24, line: 397, baseType: !334, size: 64, align: 64, offset: 2368)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !24, line: 327, baseType: !227)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !41, file: !24, line: 398, baseType: !336, size: 64, align: 64, offset: 2432)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !24, line: 329, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!55, !40, !32}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !41, file: !24, line: 399, baseType: !341, size: 64, align: 64, offset: 2496)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !24, line: 328, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!55, !40, !55, !55}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !41, file: !24, line: 400, baseType: !346, size: 64, align: 64, offset: 2560)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !24, line: 307, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !16}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !41, file: !24, line: 401, baseType: !159, size: 64, align: 64, offset: 2624)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !41, file: !24, line: 402, baseType: !55, size: 64, align: 64, offset: 2688)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !41, file: !24, line: 403, baseType: !55, size: 64, align: 64, offset: 2752)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !41, file: !24, line: 404, baseType: !55, size: 64, align: 64, offset: 2816)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !41, file: !24, line: 405, baseType: !55, size: 64, align: 64, offset: 2880)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !41, file: !24, line: 406, baseType: !55, size: 64, align: 64, offset: 2944)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !41, file: !24, line: 407, baseType: !51, size: 64, align: 64, offset: 3008)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !41, file: !24, line: 410, baseType: !358, size: 32, align: 32, offset: 3072)
!358 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !41, file: !24, line: 412, baseType: !51, size: 64, align: 64, offset: 3136)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !25, file: !24, line: 113, baseType: !32, size: 64, align: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !20, file: !19, line: 27, baseType: !362, size: 64, align: 64, offset: 192)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 64, align: 64, elements: !99)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFloatObject", file: !365, line: 18, baseType: !366)
!365 = !DIFile(filename: "Include/floatobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!366 = !DICompositeType(tag: DW_TAG_structure_type, file: !365, line: 15, size: 192, align: 64, elements: !367)
!367 = !{!368, !369}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !366, file: !365, line: 16, baseType: !28, size: 128, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ob_fval", scope: !366, file: !365, line: 17, baseType: !370, size: 64, align: 64, offset: 128)
!370 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!371 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!373 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !371)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !9, line: 351, baseType: !380)
!380 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 217, size: 384, align: 64, elements: !381)
!381 = !{!382, !383, !384, !385, !393}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !380, file: !9, line: 291, baseType: !28, size: 128, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !380, file: !9, line: 292, baseType: !32, size: 64, align: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !380, file: !9, line: 293, baseType: !235, size: 64, align: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !380, file: !9, line: 349, baseType: !386, size: 32, align: 32, offset: 256)
!386 = !DICompositeType(tag: DW_TAG_structure_type, scope: !380, file: !9, line: 294, size: 32, align: 32, elements: !387)
!387 = !{!388, !389, !390, !391, !392}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !386, file: !9, line: 303, baseType: !358, size: 2, align: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !386, file: !9, line: 331, baseType: !358, size: 3, align: 32, offset: 2)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !386, file: !9, line: 336, baseType: !358, size: 1, align: 32, offset: 5)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !386, file: !9, line: 340, baseType: !358, size: 1, align: 32, offset: 6)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !386, file: !9, line: 345, baseType: !358, size: 1, align: 32, offset: 7)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !380, file: !9, line: 350, baseType: !394, size: 64, align: 64, offset: 320)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !112, line: 90, baseType: !61)
!396 = !{!397, !401, !402, !416, !422, !443, !453, !461, !466, !469, !474, !494, !511, !534, !556, !561, !568, !574, !583, !589, !595, !602, !611, !626, !629, !632, !635, !640, !649, !657, !663, !668, !715, !723, !744, !782, !809, !815, !829, !834, !839, !842, !867, !912, !933, !937, !945}
!397 = !DISubprogram(name: "PyFloat_GetMax", scope: !1, file: !1, line: 25, type: !398, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: true, function: double ()* @PyFloat_GetMax, variables: !400)
!398 = !DISubroutineType(types: !399)
!399 = !{!370}
!400 = !{}
!401 = !DISubprogram(name: "PyFloat_GetMin", scope: !1, file: !1, line: 31, type: !398, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, function: double ()* @PyFloat_GetMin, variables: !400)
!402 = !DISubprogram(name: "PyFloat_GetInfo", scope: !1, file: !1, line: 73, type: !403, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyFloat_GetInfo, variables: !405)
!403 = !DISubroutineType(types: !404)
!404 = !{!55}
!405 = !{!406, !407, !408, !412}
!406 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "floatinfo", scope: !402, file: !1, line: 75, type: !55)
!407 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !402, file: !1, line: 76, type: !61)
!408 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !409, file: !1, line: 103, type: !55)
!409 = distinct !DILexicalBlock(scope: !410, file: !1, line: 103, column: 9)
!410 = distinct !DILexicalBlock(scope: !411, file: !1, line: 102, column: 27)
!411 = distinct !DILexicalBlock(scope: !402, file: !1, line: 102, column: 9)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !413, file: !1, line: 103, type: !55)
!413 = distinct !DILexicalBlock(scope: !414, file: !1, line: 103, column: 9)
!414 = distinct !DILexicalBlock(scope: !415, file: !1, line: 103, column: 9)
!415 = distinct !DILexicalBlock(scope: !409, file: !1, line: 103, column: 9)
!416 = !DISubprogram(name: "PyFloat_FromDouble", scope: !1, file: !1, line: 110, type: !417, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (double)* @PyFloat_FromDouble, variables: !419)
!417 = !DISubroutineType(types: !418)
!418 = !{!55, !370}
!419 = !{!420, !421}
!420 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fval", arg: 1, scope: !416, file: !1, line: 110, type: !370)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !416, file: !1, line: 112, type: !363)
!422 = !DISubprogram(name: "PyFloat_FromString", scope: !1, file: !1, line: 128, type: !133, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyFloat_FromString, variables: !423)
!423 = !{!424, !425, !426, !427, !428, !429, !430, !431, !432, !438, !440}
!424 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !422, file: !1, line: 128, type: !55)
!425 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !422, file: !1, line: 130, type: !45)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "last", scope: !422, file: !1, line: 130, type: !45)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !422, file: !1, line: 130, type: !45)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !422, file: !1, line: 131, type: !370)
!429 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s_buffer", scope: !422, file: !1, line: 132, type: !55)
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !422, file: !1, line: 133, type: !32)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !422, file: !1, line: 134, type: !55)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !433, file: !1, line: 142, type: !55)
!433 = distinct !DILexicalBlock(scope: !434, file: !1, line: 142, column: 13)
!434 = distinct !DILexicalBlock(scope: !435, file: !1, line: 141, column: 24)
!435 = distinct !DILexicalBlock(scope: !436, file: !1, line: 141, column: 13)
!436 = distinct !DILexicalBlock(scope: !437, file: !1, line: 136, column: 29)
!437 = distinct !DILexicalBlock(scope: !422, file: !1, line: 136, column: 9)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !439, file: !1, line: 173, type: !55)
!439 = distinct !DILexicalBlock(scope: !422, file: !1, line: 173, column: 5)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !441, file: !1, line: 173, type: !55)
!441 = distinct !DILexicalBlock(scope: !442, file: !1, line: 173, column: 5)
!442 = distinct !DILexicalBlock(scope: !439, file: !1, line: 173, column: 5)
!443 = !DISubprogram(name: "PyFloat_AsDouble", scope: !1, file: !1, line: 194, type: !444, isLocal: false, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct._object*)* @PyFloat_AsDouble, variables: !446)
!444 = !DISubroutineType(types: !445)
!445 = !{!370, !55}
!446 = !{!447, !448, !449, !450, !451}
!447 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !443, file: !1, line: 194, type: !55)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nb", scope: !443, file: !1, line: 196, type: !136)
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fo", scope: !443, file: !1, line: 197, type: !363)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !443, file: !1, line: 198, type: !370)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !452, file: !1, line: 223, type: !55)
!452 = distinct !DILexicalBlock(scope: !443, file: !1, line: 223, column: 5)
!453 = !DISubprogram(name: "_PyFloat_Init", scope: !1, file: !1, line: 1858, type: !454, isLocal: false, isDefinition: true, scopeLine: 1859, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @_PyFloat_Init, variables: !456)
!454 = !DISubroutineType(types: !455)
!455 = !{!61}
!456 = !{!457, !459}
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !458, file: !1, line: 1877, type: !370)
!458 = distinct !DILexicalBlock(scope: !453, file: !1, line: 1876, column: 5)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !460, file: !1, line: 1891, type: !373)
!460 = distinct !DILexicalBlock(scope: !453, file: !1, line: 1890, column: 5)
!461 = !DISubprogram(name: "PyFloat_ClearFreeList", scope: !1, file: !1, line: 1915, type: !454, isLocal: false, isDefinition: true, scopeLine: 1916, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @PyFloat_ClearFreeList, variables: !462)
!462 = !{!463, !464, !465}
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !461, file: !1, line: 1917, type: !363)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next", scope: !461, file: !1, line: 1917, type: !363)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !461, file: !1, line: 1918, type: !61)
!466 = !DISubprogram(name: "PyFloat_Fini", scope: !1, file: !1, line: 1930, type: !467, isLocal: false, isDefinition: true, scopeLine: 1931, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyFloat_Fini, variables: !400)
!467 = !DISubroutineType(types: !468)
!468 = !{null}
!469 = !DISubprogram(name: "_PyFloat_DebugMallocStats", scope: !1, file: !1, line: 1937, type: !470, isLocal: false, isDefinition: true, scopeLine: 1938, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IO_FILE*)* @_PyFloat_DebugMallocStats, variables: !472)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !62}
!472 = !{!473}
!473 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !469, file: !1, line: 1937, type: !62)
!474 = !DISubprogram(name: "_PyFloat_Pack4", scope: !1, file: !1, line: 1949, type: !475, isLocal: false, isDefinition: true, scopeLine: 1950, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double, i8*, i32)* @_PyFloat_Pack4, variables: !478)
!475 = !DISubroutineType(types: !476)
!476 = !{!61, !370, !477, !61}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!478 = !{!479, !480, !481, !482, !485, !486, !487, !488, !489, !491, !492, !493}
!479 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !474, file: !1, line: 1949, type: !370)
!480 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !474, file: !1, line: 1949, type: !477)
!481 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "le", arg: 3, scope: !474, file: !1, line: 1949, type: !61)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !483, file: !1, line: 1952, type: !371)
!483 = distinct !DILexicalBlock(scope: !484, file: !1, line: 1951, column: 41)
!484 = distinct !DILexicalBlock(scope: !474, file: !1, line: 1951, column: 9)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !483, file: !1, line: 1953, type: !61)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !483, file: !1, line: 1954, type: !370)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fbits", scope: !483, file: !1, line: 1955, type: !358)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "incr", scope: !483, file: !1, line: 1956, type: !61)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !490, file: !1, line: 2028, type: !373)
!490 = distinct !DILexicalBlock(scope: !484, file: !1, line: 2027, column: 10)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !490, file: !1, line: 2029, type: !45)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !490, file: !1, line: 2030, type: !61)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "incr", scope: !490, file: !1, line: 2030, type: !61)
!494 = !DISubprogram(name: "_PyFloat_Pack8", scope: !1, file: !1, line: 2054, type: !475, isLocal: false, isDefinition: true, scopeLine: 2055, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double, i8*, i32)* @_PyFloat_Pack8, variables: !495)
!495 = !{!496, !497, !498, !499, !502, !503, !504, !505, !506, !507, !509, !510}
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !494, file: !1, line: 2054, type: !370)
!497 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !494, file: !1, line: 2054, type: !477)
!498 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "le", arg: 3, scope: !494, file: !1, line: 2054, type: !61)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !500, file: !1, line: 2057, type: !371)
!500 = distinct !DILexicalBlock(scope: !501, file: !1, line: 2056, column: 42)
!501 = distinct !DILexicalBlock(scope: !494, file: !1, line: 2056, column: 9)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !500, file: !1, line: 2058, type: !61)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !500, file: !1, line: 2059, type: !370)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fhi", scope: !500, file: !1, line: 2060, type: !358)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flo", scope: !500, file: !1, line: 2060, type: !358)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "incr", scope: !500, file: !1, line: 2061, type: !61)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !508, file: !1, line: 2165, type: !45)
!508 = distinct !DILexicalBlock(scope: !501, file: !1, line: 2164, column: 10)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !508, file: !1, line: 2166, type: !61)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "incr", scope: !508, file: !1, line: 2166, type: !61)
!511 = !DISubprogram(name: "_PyFloat_Unpack4", scope: !1, file: !1, line: 2183, type: !512, isLocal: false, isDefinition: true, scopeLine: 2184, flags: DIFlagPrototyped, isOptimized: true, function: double (i8*, i32)* @_PyFloat_Unpack4, variables: !514)
!512 = !DISubroutineType(types: !513)
!513 = !{!370, !376, !61}
!514 = !{!515, !516, !517, !520, !521, !522, !523, !524, !526, !532, !533}
!515 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !511, file: !1, line: 2183, type: !376)
!516 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "le", arg: 2, scope: !511, file: !1, line: 2183, type: !61)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !518, file: !1, line: 2186, type: !371)
!518 = distinct !DILexicalBlock(scope: !519, file: !1, line: 2185, column: 41)
!519 = distinct !DILexicalBlock(scope: !511, file: !1, line: 2185, column: 9)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !518, file: !1, line: 2187, type: !61)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !518, file: !1, line: 2188, type: !358)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !518, file: !1, line: 2189, type: !370)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "incr", scope: !518, file: !1, line: 2190, type: !61)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !525, file: !1, line: 2239, type: !373)
!525 = distinct !DILexicalBlock(scope: !519, file: !1, line: 2238, column: 10)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !527, file: !1, line: 2243, type: !529)
!527 = distinct !DILexicalBlock(scope: !528, file: !1, line: 2242, column: 64)
!528 = distinct !DILexicalBlock(scope: !525, file: !1, line: 2241, column: 13)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 32, align: 8, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 4)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !527, file: !1, line: 2244, type: !69)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !527, file: !1, line: 2245, type: !61)
!534 = !DISubprogram(name: "_PyFloat_Unpack8", scope: !1, file: !1, line: 2261, type: !512, isLocal: false, isDefinition: true, scopeLine: 2262, flags: DIFlagPrototyped, isOptimized: true, function: double (i8*, i32)* @_PyFloat_Unpack8, variables: !535)
!535 = !{!536, !537, !538, !541, !542, !543, !544, !545, !546, !548, !554, !555}
!536 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !534, file: !1, line: 2261, type: !376)
!537 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "le", arg: 2, scope: !534, file: !1, line: 2261, type: !61)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !539, file: !1, line: 2264, type: !371)
!539 = distinct !DILexicalBlock(scope: !540, file: !1, line: 2263, column: 42)
!540 = distinct !DILexicalBlock(scope: !534, file: !1, line: 2263, column: 9)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !539, file: !1, line: 2265, type: !61)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fhi", scope: !539, file: !1, line: 2266, type: !358)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flo", scope: !539, file: !1, line: 2266, type: !358)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !539, file: !1, line: 2267, type: !370)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "incr", scope: !539, file: !1, line: 2268, type: !61)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !547, file: !1, line: 2334, type: !370)
!547 = distinct !DILexicalBlock(scope: !540, file: !1, line: 2333, column: 10)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !549, file: !1, line: 2338, type: !551)
!549 = distinct !DILexicalBlock(scope: !550, file: !1, line: 2337, column: 65)
!550 = distinct !DILexicalBlock(scope: !547, file: !1, line: 2336, column: 13)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 64, align: 8, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 8)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !549, file: !1, line: 2339, type: !69)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !549, file: !1, line: 2340, type: !61)
!556 = !DISubprogram(name: "float_dealloc", scope: !1, file: !1, line: 178, type: !557, isLocal: true, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyFloatObject*)* @float_dealloc, variables: !559)
!557 = !DISubroutineType(types: !558)
!558 = !{null, !363}
!559 = !{!560}
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !556, file: !1, line: 178, type: !363)
!561 = !DISubprogram(name: "float_repr", scope: !1, file: !1, line: 263, type: !562, isLocal: true, isDefinition: true, scopeLine: 264, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyFloatObject*)* @float_repr, variables: !564)
!562 = !DISubroutineType(types: !563)
!563 = !{!55, !363}
!564 = !{!565, !566, !567}
!565 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !561, file: !1, line: 263, type: !363)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !561, file: !1, line: 265, type: !55)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !561, file: !1, line: 266, type: !69)
!568 = !DISubprogram(name: "float_add", scope: !1, file: !1, line: 488, type: !143, isLocal: true, isDefinition: true, scopeLine: 489, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @float_add, variables: !569)
!569 = !{!570, !571, !572, !573}
!570 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !568, file: !1, line: 488, type: !55)
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !568, file: !1, line: 488, type: !55)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !568, file: !1, line: 490, type: !370)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !568, file: !1, line: 490, type: !370)
!574 = !DISubprogram(name: "convert_to_double", scope: !1, file: !1, line: 243, type: !575, isLocal: true, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: true, variables: !579)
!575 = !DISubroutineType(types: !576)
!576 = !{!61, !577, !578}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!579 = !{!580, !581, !582}
!580 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !574, file: !1, line: 243, type: !577)
!581 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dbl", arg: 2, scope: !574, file: !1, line: 243, type: !578)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !574, file: !1, line: 245, type: !55)
!583 = !DISubprogram(name: "float_sub", scope: !1, file: !1, line: 500, type: !143, isLocal: true, isDefinition: true, scopeLine: 501, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @float_sub, variables: !584)
!584 = !{!585, !586, !587, !588}
!585 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !583, file: !1, line: 500, type: !55)
!586 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !583, file: !1, line: 500, type: !55)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !583, file: !1, line: 502, type: !370)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !583, file: !1, line: 502, type: !370)
!589 = !DISubprogram(name: "float_mul", scope: !1, file: !1, line: 512, type: !143, isLocal: true, isDefinition: true, scopeLine: 513, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @float_mul, variables: !590)
!590 = !{!591, !592, !593, !594}
!591 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !589, file: !1, line: 512, type: !55)
!592 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !589, file: !1, line: 512, type: !55)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !589, file: !1, line: 514, type: !370)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !589, file: !1, line: 514, type: !370)
!595 = !DISubprogram(name: "float_rem", scope: !1, file: !1, line: 541, type: !143, isLocal: true, isDefinition: true, scopeLine: 542, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @float_rem, variables: !596)
!596 = !{!597, !598, !599, !600, !601}
!597 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !595, file: !1, line: 541, type: !55)
!598 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !595, file: !1, line: 541, type: !55)
!599 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vx", scope: !595, file: !1, line: 543, type: !370)
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wx", scope: !595, file: !1, line: 543, type: !370)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !595, file: !1, line: 544, type: !370)
!602 = !DISubprogram(name: "float_divmod", scope: !1, file: !1, line: 571, type: !143, isLocal: true, isDefinition: true, scopeLine: 572, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @float_divmod, variables: !603)
!603 = !{!604, !605, !606, !607, !608, !609, !610}
!604 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !602, file: !1, line: 571, type: !55)
!605 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !602, file: !1, line: 571, type: !55)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vx", scope: !602, file: !1, line: 573, type: !370)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wx", scope: !602, file: !1, line: 573, type: !370)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "div", scope: !602, file: !1, line: 574, type: !370)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !602, file: !1, line: 574, type: !370)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "floordiv", scope: !602, file: !1, line: 574, type: !370)
!611 = !DISubprogram(name: "float_pow", scope: !1, file: !1, line: 637, type: !152, isLocal: true, isDefinition: true, scopeLine: 638, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @float_pow, variables: !612)
!612 = !{!613, !614, !615, !616, !617, !618, !619, !620, !623}
!613 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !611, file: !1, line: 637, type: !55)
!614 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !611, file: !1, line: 637, type: !55)
!615 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 3, scope: !611, file: !1, line: 637, type: !55)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iv", scope: !611, file: !1, line: 639, type: !370)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iw", scope: !611, file: !1, line: 639, type: !370)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ix", scope: !611, file: !1, line: 639, type: !370)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "negate_result", scope: !611, file: !1, line: 640, type: !61)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iw_is_odd", scope: !621, file: !1, line: 681, type: !61)
!621 = distinct !DILexicalBlock(scope: !622, file: !1, line: 676, column: 29)
!622 = distinct !DILexicalBlock(scope: !611, file: !1, line: 676, column: 9)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iw_is_odd", scope: !624, file: !1, line: 691, type: !61)
!624 = distinct !DILexicalBlock(scope: !625, file: !1, line: 688, column: 20)
!625 = distinct !DILexicalBlock(scope: !611, file: !1, line: 688, column: 9)
!626 = !DISubprogram(name: "float_neg", scope: !1, file: !1, line: 761, type: !562, isLocal: true, isDefinition: true, scopeLine: 762, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyFloatObject*)* @float_neg, variables: !627)
!627 = !{!628}
!628 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !626, file: !1, line: 761, type: !363)
!629 = !DISubprogram(name: "float_float", scope: !1, file: !1, line: 1019, type: !133, isLocal: true, isDefinition: true, scopeLine: 1020, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @float_float, variables: !630)
!630 = !{!631}
!631 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !629, file: !1, line: 1019, type: !55)
!632 = !DISubprogram(name: "float_abs", scope: !1, file: !1, line: 767, type: !562, isLocal: true, isDefinition: true, scopeLine: 768, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyFloatObject*)* @float_abs, variables: !633)
!633 = !{!634}
!634 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !632, file: !1, line: 767, type: !363)
!635 = !DISubprogram(name: "float_bool", scope: !1, file: !1, line: 773, type: !636, isLocal: true, isDefinition: true, scopeLine: 774, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyFloatObject*)* @float_bool, variables: !638)
!636 = !DISubroutineType(types: !637)
!637 = !{!61, !363}
!638 = !{!639}
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !635, file: !1, line: 773, type: !363)
!640 = !DISubprogram(name: "float_trunc", scope: !1, file: !1, line: 831, type: !133, isLocal: true, isDefinition: true, scopeLine: 832, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @float_trunc, variables: !641)
!641 = !{!642, !643, !644, !645}
!642 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !640, file: !1, line: 831, type: !55)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !640, file: !1, line: 833, type: !370)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wholepart", scope: !640, file: !1, line: 834, type: !370)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aslong", scope: !646, file: !1, line: 850, type: !648)
!646 = distinct !DILexicalBlock(scope: !647, file: !1, line: 849, column: 55)
!647 = distinct !DILexicalBlock(scope: !640, file: !1, line: 849, column: 9)
!648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!649 = !DISubprogram(name: "float_floor_div", scope: !1, file: !1, line: 618, type: !143, isLocal: true, isDefinition: true, scopeLine: 619, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @float_floor_div, variables: !650)
!650 = !{!651, !652, !653, !654, !655}
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !649, file: !1, line: 618, type: !55)
!652 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !649, file: !1, line: 618, type: !55)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !649, file: !1, line: 620, type: !55)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !649, file: !1, line: 620, type: !55)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !656, file: !1, line: 628, type: !55)
!656 = distinct !DILexicalBlock(scope: !649, file: !1, line: 628, column: 5)
!657 = !DISubprogram(name: "float_div", scope: !1, file: !1, line: 524, type: !143, isLocal: true, isDefinition: true, scopeLine: 525, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @float_div, variables: !658)
!658 = !{!659, !660, !661, !662}
!659 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !657, file: !1, line: 524, type: !55)
!660 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !657, file: !1, line: 524, type: !55)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !657, file: !1, line: 526, type: !370)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !657, file: !1, line: 526, type: !370)
!663 = !DISubprogram(name: "float_hash", scope: !1, file: !1, line: 482, type: !664, isLocal: true, isDefinition: true, scopeLine: 483, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.PyFloatObject*)* @float_hash, variables: !666)
!664 = !DISubroutineType(types: !665)
!665 = !{!235, !363}
!666 = !{!667}
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !663, file: !1, line: 482, type: !363)
!668 = !DISubprogram(name: "float_richcompare", scope: !1, file: !1, line: 295, type: !288, isLocal: true, isDefinition: true, scopeLine: 296, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @float_richcompare, variables: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !676, !681, !682, !683, !684, !686, !687, !688, !689, !690, !691, !694, !696, !698, !700, !702, !705, !707, !710, !712}
!670 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !668, file: !1, line: 295, type: !55)
!671 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !668, file: !1, line: 295, type: !55)
!672 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !668, file: !1, line: 295, type: !61)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !668, file: !1, line: 297, type: !370)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !668, file: !1, line: 297, type: !370)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !668, file: !1, line: 298, type: !61)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vsign", scope: !677, file: !1, line: 321, type: !61)
!677 = distinct !DILexicalBlock(scope: !678, file: !1, line: 320, column: 31)
!678 = distinct !DILexicalBlock(scope: !679, file: !1, line: 320, column: 14)
!679 = distinct !DILexicalBlock(scope: !680, file: !1, line: 309, column: 14)
!680 = distinct !DILexicalBlock(scope: !668, file: !1, line: 306, column: 9)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wsign", scope: !677, file: !1, line: 322, type: !61)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbits", scope: !677, file: !1, line: 323, type: !111)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exponent", scope: !677, file: !1, line: 324, type: !61)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fracpart", scope: !685, file: !1, line: 388, type: !370)
!685 = distinct !DILexicalBlock(scope: !677, file: !1, line: 387, column: 9)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "intpart", scope: !685, file: !1, line: 389, type: !370)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !685, file: !1, line: 390, type: !55)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "one", scope: !685, file: !1, line: 391, type: !55)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vv", scope: !685, file: !1, line: 392, type: !55)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ww", scope: !685, file: !1, line: 393, type: !55)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !692, file: !1, line: 412, type: !55)
!692 = distinct !DILexicalBlock(scope: !693, file: !1, line: 408, column: 34)
!693 = distinct !DILexicalBlock(scope: !685, file: !1, line: 408, column: 17)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !695, file: !1, line: 421, type: !55)
!695 = distinct !DILexicalBlock(scope: !692, file: !1, line: 421, column: 17)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !697, file: !1, line: 427, type: !55)
!697 = distinct !DILexicalBlock(scope: !692, file: !1, line: 427, column: 17)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !699, file: !1, line: 433, type: !55)
!699 = distinct !DILexicalBlock(scope: !692, file: !1, line: 433, column: 17)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !701, file: !1, line: 442, type: !55)
!701 = distinct !DILexicalBlock(scope: !685, file: !1, line: 442, column: 13)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !703, file: !1, line: 442, type: !55)
!703 = distinct !DILexicalBlock(scope: !704, file: !1, line: 442, column: 13)
!704 = distinct !DILexicalBlock(scope: !701, file: !1, line: 442, column: 13)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !706, file: !1, line: 443, type: !55)
!706 = distinct !DILexicalBlock(scope: !685, file: !1, line: 443, column: 13)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !708, file: !1, line: 443, type: !55)
!708 = distinct !DILexicalBlock(scope: !709, file: !1, line: 443, column: 13)
!709 = distinct !DILexicalBlock(scope: !706, file: !1, line: 443, column: 13)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !711, file: !1, line: 444, type: !55)
!711 = distinct !DILexicalBlock(scope: !685, file: !1, line: 444, column: 13)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !713, file: !1, line: 444, type: !55)
!713 = distinct !DILexicalBlock(scope: !714, file: !1, line: 444, column: 13)
!714 = distinct !DILexicalBlock(scope: !711, file: !1, line: 444, column: 13)
!715 = !DISubprogram(name: "float_round", scope: !1, file: !1, line: 973, type: !143, isLocal: true, isDefinition: true, scopeLine: 974, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @float_round, variables: !716)
!716 = !{!717, !718, !719, !720, !721, !722}
!717 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !715, file: !1, line: 973, type: !55)
!718 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !715, file: !1, line: 973, type: !55)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !715, file: !1, line: 975, type: !370)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rounded", scope: !715, file: !1, line: 975, type: !370)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o_ndigits", scope: !715, file: !1, line: 976, type: !55)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !715, file: !1, line: 977, type: !32)
!723 = !DISubprogram(name: "double_round", scope: !1, file: !1, line: 866, type: !724, isLocal: true, isDefinition: true, scopeLine: 866, flags: DIFlagPrototyped, isOptimized: true, variables: !726)
!724 = !DISubroutineType(types: !725)
!725 = !{!55, !370, !61}
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !738, !739, !740, !741, !742, !743}
!727 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !723, file: !1, line: 866, type: !370)
!728 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndigits", arg: 2, scope: !723, file: !1, line: 866, type: !61)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rounded", scope: !723, file: !1, line: 868, type: !370)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buflen", scope: !723, file: !1, line: 869, type: !32)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mybuflen", scope: !723, file: !1, line: 869, type: !32)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !723, file: !1, line: 870, type: !69)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf_end", scope: !723, file: !1, line: 870, type: !69)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shortbuf", scope: !723, file: !1, line: 870, type: !735)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 800, align: 8, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 100)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mybuf", scope: !723, file: !1, line: 870, type: !69)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decpt", scope: !723, file: !1, line: 871, type: !61)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !723, file: !1, line: 871, type: !61)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !723, file: !1, line: 872, type: !55)
!742 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_387controlword", scope: !723, file: !1, line: 873, type: !94)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_387controlword", scope: !723, file: !1, line: 873, type: !94)
!744 = !DISubprogram(name: "float_as_integer_ratio", scope: !1, file: !1, line: 1424, type: !143, isLocal: true, isDefinition: true, scopeLine: 1425, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @float_as_integer_ratio, variables: !745)
!745 = !{!746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !760, !764, !767, !769, !772, !774, !777, !779}
!746 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !744, file: !1, line: 1424, type: !55)
!747 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !744, file: !1, line: 1424, type: !55)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !744, file: !1, line: 1426, type: !370)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "float_part", scope: !744, file: !1, line: 1427, type: !370)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exponent", scope: !744, file: !1, line: 1428, type: !61)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !744, file: !1, line: 1429, type: !61)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !744, file: !1, line: 1431, type: !55)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "py_exponent", scope: !744, file: !1, line: 1432, type: !55)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numerator", scope: !744, file: !1, line: 1433, type: !55)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "denominator", scope: !744, file: !1, line: 1434, type: !55)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result_pair", scope: !744, file: !1, line: 1435, type: !55)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "long_methods", scope: !744, file: !1, line: 1436, type: !136)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !759, file: !1, line: 1475, type: !55)
!759 = distinct !DILexicalBlock(scope: !744, file: !1, line: 1475, column: 5)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !761, file: !1, line: 1479, type: !55)
!761 = distinct !DILexicalBlock(scope: !762, file: !1, line: 1479, column: 9)
!762 = distinct !DILexicalBlock(scope: !763, file: !1, line: 1478, column: 23)
!763 = distinct !DILexicalBlock(scope: !744, file: !1, line: 1478, column: 9)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !765, file: !1, line: 1484, type: !55)
!765 = distinct !DILexicalBlock(scope: !766, file: !1, line: 1484, column: 9)
!766 = distinct !DILexicalBlock(scope: !763, file: !1, line: 1483, column: 10)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !768, file: !1, line: 1493, type: !55)
!768 = distinct !DILexicalBlock(scope: !744, file: !1, line: 1493, column: 5)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !770, file: !1, line: 1493, type: !55)
!770 = distinct !DILexicalBlock(scope: !771, file: !1, line: 1493, column: 5)
!771 = distinct !DILexicalBlock(scope: !768, file: !1, line: 1493, column: 5)
!772 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !773, file: !1, line: 1494, type: !55)
!773 = distinct !DILexicalBlock(scope: !744, file: !1, line: 1494, column: 5)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !775, file: !1, line: 1494, type: !55)
!775 = distinct !DILexicalBlock(scope: !776, file: !1, line: 1494, column: 5)
!776 = distinct !DILexicalBlock(scope: !773, file: !1, line: 1494, column: 5)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !778, file: !1, line: 1495, type: !55)
!778 = distinct !DILexicalBlock(scope: !744, file: !1, line: 1495, column: 5)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !780, file: !1, line: 1495, type: !55)
!780 = distinct !DILexicalBlock(scope: !781, file: !1, line: 1495, column: 5)
!781 = distinct !DILexicalBlock(scope: !778, file: !1, line: 1495, column: 5)
!782 = !DISubprogram(name: "float_fromhex", scope: !1, file: !1, line: 1173, type: !143, isLocal: true, isDefinition: true, scopeLine: 1174, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @float_fromhex, variables: !783)
!783 = !{!784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807}
!784 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cls", arg: 1, scope: !782, file: !1, line: 1173, type: !55)
!785 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !782, file: !1, line: 1173, type: !55)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result_as_float", scope: !782, file: !1, line: 1175, type: !55)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !782, file: !1, line: 1175, type: !55)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !782, file: !1, line: 1176, type: !370)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exp", scope: !782, file: !1, line: 1177, type: !38)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "top_exp", scope: !782, file: !1, line: 1177, type: !38)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lsb", scope: !782, file: !1, line: 1177, type: !38)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key_digit", scope: !782, file: !1, line: 1177, type: !38)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !782, file: !1, line: 1178, type: !69)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coeff_start", scope: !782, file: !1, line: 1178, type: !69)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s_store", scope: !782, file: !1, line: 1178, type: !69)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coeff_end", scope: !782, file: !1, line: 1178, type: !69)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exp_start", scope: !782, file: !1, line: 1178, type: !69)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s_end", scope: !782, file: !1, line: 1178, type: !69)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "half_eps", scope: !782, file: !1, line: 1179, type: !61)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "digit", scope: !782, file: !1, line: 1179, type: !61)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "round_up", scope: !782, file: !1, line: 1179, type: !61)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "negate", scope: !782, file: !1, line: 1179, type: !61)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !782, file: !1, line: 1180, type: !32)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !782, file: !1, line: 1180, type: !32)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fdigits", scope: !782, file: !1, line: 1180, type: !32)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !782, file: !1, line: 1180, type: !32)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !808, file: !1, line: 1394, type: !55)
!808 = distinct !DILexicalBlock(scope: !782, file: !1, line: 1394, column: 5)
!809 = !DISubprogram(name: "hex_from_char", scope: !1, file: !1, line: 1038, type: !810, isLocal: true, isDefinition: true, scopeLine: 1038, flags: DIFlagPrototyped, isOptimized: true, variables: !812)
!810 = !DISubroutineType(types: !811)
!811 = !{!61, !47}
!812 = !{!813, !814}
!813 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !809, file: !1, line: 1038, type: !47)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !809, file: !1, line: 1039, type: !61)
!815 = !DISubprogram(name: "float_hex", scope: !1, file: !1, line: 1109, type: !133, isLocal: true, isDefinition: true, scopeLine: 1110, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @float_hex, variables: !816)
!816 = !{!817, !818, !819, !820, !821, !822, !823, !824, !825}
!817 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !815, file: !1, line: 1109, type: !55)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !815, file: !1, line: 1111, type: !370)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !815, file: !1, line: 1111, type: !370)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !815, file: !1, line: 1112, type: !61)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shift", scope: !815, file: !1, line: 1112, type: !61)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !815, file: !1, line: 1112, type: !61)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "si", scope: !815, file: !1, line: 1112, type: !61)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "esign", scope: !815, file: !1, line: 1112, type: !61)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !815, file: !1, line: 1115, type: !826)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 128, align: 8, elements: !827)
!827 = !{!828}
!828 = !DISubrange(count: 16)
!829 = !DISubprogram(name: "char_from_hex", scope: !1, file: !1, line: 1031, type: !830, isLocal: true, isDefinition: true, scopeLine: 1032, flags: DIFlagPrototyped, isOptimized: true, variables: !832)
!830 = !DISubroutineType(types: !831)
!831 = !{!47, !61}
!832 = !{!833}
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !829, file: !1, line: 1031, type: !61)
!834 = !DISubprogram(name: "float_is_integer", scope: !1, file: !1, line: 779, type: !133, isLocal: true, isDefinition: true, scopeLine: 780, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @float_is_integer, variables: !835)
!835 = !{!836, !837, !838}
!836 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !834, file: !1, line: 779, type: !55)
!837 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !834, file: !1, line: 781, type: !370)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !834, file: !1, line: 782, type: !55)
!839 = !DISubprogram(name: "float_getnewargs", scope: !1, file: !1, line: 1560, type: !562, isLocal: true, isDefinition: true, scopeLine: 1561, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyFloatObject*)* @float_getnewargs, variables: !840)
!840 = !{!841}
!841 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !839, file: !1, line: 1560, type: !363)
!842 = !DISubprogram(name: "float_getformat", scope: !1, file: !1, line: 1575, type: !843, isLocal: true, isDefinition: true, scopeLine: 1576, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*)* @float_getformat, variables: !847)
!843 = !DISubroutineType(types: !844)
!844 = !{!55, !845, !55}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64, align: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !24, line: 422, baseType: !41)
!847 = !{!848, !849, !850, !851, !853, !856, !857, !859, !860, !863, !864, !866}
!848 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !842, file: !1, line: 1575, type: !845)
!849 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !842, file: !1, line: 1575, type: !55)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !842, file: !1, line: 1577, type: !69)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !842, file: !1, line: 1578, type: !852)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_format_type", file: !1, line: 1569, baseType: !3)
!853 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !854, file: !1, line: 1589, type: !111)
!854 = distinct !DILexicalBlock(scope: !855, file: !1, line: 1589, column: 9)
!855 = distinct !DILexicalBlock(scope: !842, file: !1, line: 1589, column: 9)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !854, file: !1, line: 1589, type: !111)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !858, file: !1, line: 1589, type: !376)
!858 = distinct !DILexicalBlock(scope: !854, file: !1, line: 1589, column: 9)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !858, file: !1, line: 1589, type: !61)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !861, file: !1, line: 1592, type: !111)
!861 = distinct !DILexicalBlock(scope: !862, file: !1, line: 1592, column: 14)
!862 = distinct !DILexicalBlock(scope: !855, file: !1, line: 1592, column: 14)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !861, file: !1, line: 1592, type: !111)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !865, file: !1, line: 1592, type: !376)
!865 = distinct !DILexicalBlock(scope: !861, file: !1, line: 1592, column: 14)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !865, file: !1, line: 1592, type: !61)
!867 = !DISubprogram(name: "float_setformat", scope: !1, file: !1, line: 1626, type: !843, isLocal: true, isDefinition: true, scopeLine: 1627, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*)* @float_setformat, variables: !868)
!868 = !{!869, !870, !871, !872, !873, !874, !875, !877, !880, !881, !883, !884, !887, !888, !890, !891, !894, !895, !897, !898, !901, !902, !904, !905, !908, !909, !911}
!869 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !867, file: !1, line: 1626, type: !845)
!870 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !867, file: !1, line: 1626, type: !55)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typestr", scope: !867, file: !1, line: 1628, type: !69)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format", scope: !867, file: !1, line: 1629, type: !69)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !867, file: !1, line: 1630, type: !852)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "detected", scope: !867, file: !1, line: 1631, type: !852)
!875 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !867, file: !1, line: 1632, type: !876)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64, align: 64)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !878, file: !1, line: 1637, type: !111)
!878 = distinct !DILexicalBlock(scope: !879, file: !1, line: 1637, column: 9)
!879 = distinct !DILexicalBlock(scope: !867, file: !1, line: 1637, column: 9)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !878, file: !1, line: 1637, type: !111)
!881 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !882, file: !1, line: 1637, type: !376)
!882 = distinct !DILexicalBlock(scope: !878, file: !1, line: 1637, column: 9)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !882, file: !1, line: 1637, type: !61)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !885, file: !1, line: 1641, type: !111)
!885 = distinct !DILexicalBlock(scope: !886, file: !1, line: 1641, column: 14)
!886 = distinct !DILexicalBlock(scope: !879, file: !1, line: 1641, column: 14)
!887 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !885, file: !1, line: 1641, type: !111)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !889, file: !1, line: 1641, type: !376)
!889 = distinct !DILexicalBlock(scope: !885, file: !1, line: 1641, column: 14)
!890 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !889, file: !1, line: 1641, type: !61)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !892, file: !1, line: 1652, type: !111)
!892 = distinct !DILexicalBlock(scope: !893, file: !1, line: 1652, column: 9)
!893 = distinct !DILexicalBlock(scope: !867, file: !1, line: 1652, column: 9)
!894 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !892, file: !1, line: 1652, type: !111)
!895 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !896, file: !1, line: 1652, type: !376)
!896 = distinct !DILexicalBlock(scope: !892, file: !1, line: 1652, column: 9)
!897 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !896, file: !1, line: 1652, type: !61)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !899, file: !1, line: 1655, type: !111)
!899 = distinct !DILexicalBlock(scope: !900, file: !1, line: 1655, column: 14)
!900 = distinct !DILexicalBlock(scope: !893, file: !1, line: 1655, column: 14)
!901 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !899, file: !1, line: 1655, type: !111)
!902 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !903, file: !1, line: 1655, type: !376)
!903 = distinct !DILexicalBlock(scope: !899, file: !1, line: 1655, column: 14)
!904 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !903, file: !1, line: 1655, type: !61)
!905 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !906, file: !1, line: 1658, type: !111)
!906 = distinct !DILexicalBlock(scope: !907, file: !1, line: 1658, column: 14)
!907 = distinct !DILexicalBlock(scope: !900, file: !1, line: 1658, column: 14)
!908 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !906, file: !1, line: 1658, type: !111)
!909 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !910, file: !1, line: 1658, type: !376)
!910 = distinct !DILexicalBlock(scope: !906, file: !1, line: 1658, column: 14)
!911 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !910, file: !1, line: 1658, type: !61)
!912 = !DISubprogram(name: "float__format__", scope: !1, file: !1, line: 1701, type: !143, isLocal: true, isDefinition: true, scopeLine: 1702, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @float__format__, variables: !913)
!913 = !{!914, !915, !916, !917, !932}
!914 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !912, file: !1, line: 1701, type: !55)
!915 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !912, file: !1, line: 1701, type: !55)
!916 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format_spec", scope: !912, file: !1, line: 1703, type: !55)
!917 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "writer", scope: !912, file: !1, line: 1704, type: !918)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyUnicodeWriter", file: !9, line: 917, baseType: !919)
!919 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 897, size: 448, align: 64, elements: !920)
!920 = !{!921, !922, !923, !924, !926, !927, !928, !929, !930, !931}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !919, file: !9, line: 898, baseType: !55, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !919, file: !9, line: 899, baseType: !16, size: 64, align: 64, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !919, file: !9, line: 900, baseType: !8, size: 32, align: 32, offset: 128)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "maxchar", scope: !919, file: !9, line: 901, baseType: !925, size: 32, align: 32, offset: 160)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !9, line: 121, baseType: !358)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !919, file: !9, line: 902, baseType: !32, size: 64, align: 64, offset: 192)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !919, file: !9, line: 903, baseType: !32, size: 64, align: 64, offset: 256)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "min_length", scope: !919, file: !9, line: 906, baseType: !32, size: 64, align: 64, offset: 320)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "min_char", scope: !919, file: !9, line: 909, baseType: !925, size: 32, align: 32, offset: 384)
