; ModuleID = 'gcmodule.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.gc_generation = type { %union._gc_head, i32, i32 }
%union._gc_head = type { %struct.anon }
%struct.anon = type { %union._gc_head*, %union._gc_head*, i64 }
%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !395, globals: !896)
!1 = !DIFile(filename: "Modules/gcmodule.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !343, !344, !352, !94, !11, !17, !263, !366, !374, !383, !381, !52, !384}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !7, line: 109, baseType: !8)
!7 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !7, line: 105, size: 128, align: 64, elements: !9)
!9 = !{!10, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !8, file: !7, line: 107, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !12, line: 177, baseType: !13)
!12 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !14, line: 102, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !16, line: 181, baseType: !17)
!16 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !8, file: !7, line: 108, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !7, line: 334, size: 3200, align: 64, elements: !21)
!21 = !{!22, !28, !32, !33, !34, !39, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !291, !309, !310, !311, !313, !315, !316, !318, !323, !328, !333, !334, !335, !336, !337, !338, !339, !340, !342}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !20, file: !7, line: 335, baseType: !23, size: 192, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !7, line: 114, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 111, size: 192, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !24, file: !7, line: 112, baseType: !6, size: 128, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !24, file: !7, line: 113, baseType: !11, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !20, file: !7, line: 336, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !20, file: !7, line: 341, baseType: !35, size: 64, align: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !7, line: 308, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !5}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !20, file: !7, line: 342, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !7, line: 314, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !5, !45, !44}
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !14, line: 48, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 246, size: 1728, align: 64, elements: !49)
!48 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!49 = !{!50, !51, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !71, !72, !73, !74, !76, !78, !80, !84, !87, !89, !90, !91, !92, !93, !97, !98}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !48, line: 247, baseType: !44, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !47, file: !48, line: 252, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !47, file: !48, line: 253, baseType: !52, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !47, file: !48, line: 254, baseType: !52, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !47, file: !48, line: 255, baseType: !52, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !47, file: !48, line: 256, baseType: !52, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !47, file: !48, line: 257, baseType: !52, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !47, file: !48, line: 258, baseType: !52, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !47, file: !48, line: 259, baseType: !52, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !47, file: !48, line: 261, baseType: !52, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !47, file: !48, line: 262, baseType: !52, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !47, file: !48, line: 263, baseType: !52, size: 64, align: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !47, file: !48, line: 265, baseType: !64, size: 64, align: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !48, line: 161, size: 192, align: 64, elements: !66)
!66 = !{!67, !68, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !65, file: !48, line: 162, baseType: !64, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !65, file: !48, line: 163, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !65, file: !48, line: 167, baseType: !44, size: 32, align: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !47, file: !48, line: 267, baseType: !69, size: 64, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !47, file: !48, line: 269, baseType: !44, size: 32, align: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !47, file: !48, line: 273, baseType: !44, size: 32, align: 32, offset: 928)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !47, file: !48, line: 275, baseType: !75, size: 64, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !16, line: 140, baseType: !17)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !47, file: !48, line: 279, baseType: !77, size: 16, align: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !47, file: !48, line: 280, baseType: !79, size: 8, align: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !47, file: !48, line: 281, baseType: !81, size: 8, align: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !47, file: !48, line: 285, baseType: !85, size: 64, align: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !48, line: 155, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !47, file: !48, line: 294, baseType: !88, size: 64, align: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !16, line: 141, baseType: !17)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !47, file: !48, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !47, file: !48, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !47, file: !48, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !47, file: !48, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !47, file: !48, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !47, file: !48, line: 309, baseType: !44, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !47, file: !48, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !20, file: !7, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !7, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!5, !5, !52}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !20, file: !7, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !7, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!44, !5, !52, !5}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !20, file: !7, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !20, file: !7, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !7, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!5, !5}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !20, file: !7, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !7, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !7, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !7, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!5, !5, !5}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !7, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !7, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !7, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !7, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !7, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !7, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!5, !5, !5, !5}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !7, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !7, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !7, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !7, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !7, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !7, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!44, !5}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !7, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !7, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !7, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !7, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !7, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !7, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !7, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !7, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !7, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !7, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !7, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !7, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !7, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !7, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !7, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !7, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !7, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !7, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !7, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !7, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !7, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !7, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !7, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !7, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !20, file: !7, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !7, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !7, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !7, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!11, !5}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !7, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !7, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !7, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!5, !5, !11}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !7, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !7, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !7, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !7, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!44, !5, !11, !5}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !7, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !7, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !7, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!44, !5, !5}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !7, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !7, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !20, file: !7, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !7, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !7, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !7, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !7, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !7, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!44, !5, !5, !5}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !20, file: !7, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !7, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !5}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !12, line: 186, baseType: !11)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !20, file: !7, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !20, file: !7, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !20, file: !7, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !7, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !20, file: !7, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !7, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !20, file: !7, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !7, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !7, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !7, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!44, !5, !235, !44}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !7, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !7, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !7, line: 179, baseType: !4, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !7, line: 180, baseType: !5, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !7, line: 181, baseType: !11, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !7, line: 182, baseType: !11, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !7, line: 184, baseType: !44, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !7, line: 185, baseType: !44, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !7, line: 186, baseType: !52, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !7, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !7, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !7, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !7, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !7, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !7, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !5, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !20, file: !7, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !20, file: !7, line: 368, baseType: !29, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !20, file: !7, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !7, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!44, !5, !263, !4}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !7, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!44, !5, !4}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !20, file: !7, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !20, file: !7, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !7, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!5, !5, !5, !44}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !20, file: !7, line: 382, baseType: !11, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !20, file: !7, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !7, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !20, file: !7, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !7, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !20, file: !7, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !29, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !44, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !29, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !20, file: !7, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !7, line: 390, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !20, file: !7, line: 391, baseType: !292, size: 64, align: 64, offset: 1984)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !294, line: 11, size: 320, align: 64, elements: !295)
!294 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!295 = !{!296, !297, !302, !307, !308}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !293, file: !294, line: 12, baseType: !52, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !293, file: !294, line: 13, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !294, line: 8, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!5, !5, !4}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !293, file: !294, line: 14, baseType: !303, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !294, line: 9, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!44, !5, !5, !4}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !293, file: !294, line: 15, baseType: !52, size: 64, align: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !293, file: !294, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !20, file: !7, line: 392, baseType: !19, size: 64, align: 64, offset: 2048)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !20, file: !7, line: 393, baseType: !5, size: 64, align: 64, offset: 2112)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !20, file: !7, line: 394, baseType: !312, size: 64, align: 64, offset: 2176)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !7, line: 325, baseType: !134)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !20, file: !7, line: 395, baseType: !314, size: 64, align: 64, offset: 2240)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !7, line: 326, baseType: !210)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !20, file: !7, line: 396, baseType: !11, size: 64, align: 64, offset: 2304)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !20, file: !7, line: 397, baseType: !317, size: 64, align: 64, offset: 2368)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !7, line: 327, baseType: !210)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !20, file: !7, line: 398, baseType: !319, size: 64, align: 64, offset: 2432)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !7, line: 329, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!5, !19, !11}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !20, file: !7, line: 399, baseType: !324, size: 64, align: 64, offset: 2496)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !7, line: 328, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!5, !19, !5, !5}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !20, file: !7, line: 400, baseType: !329, size: 64, align: 64, offset: 2560)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !7, line: 307, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !4}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !20, file: !7, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !20, file: !7, line: 402, baseType: !5, size: 64, align: 64, offset: 2688)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !20, file: !7, line: 403, baseType: !5, size: 64, align: 64, offset: 2752)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !20, file: !7, line: 404, baseType: !5, size: 64, align: 64, offset: 2816)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !20, file: !7, line: 405, baseType: !5, size: 64, align: 64, offset: 2880)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !20, file: !7, line: 406, baseType: !5, size: 64, align: 64, offset: 2944)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !20, file: !7, line: 407, baseType: !35, size: 64, align: 64, offset: 3008)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !20, file: !7, line: 410, baseType: !341, size: 32, align: 32, offset: 3072)
!341 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !20, file: !7, line: 412, baseType: !35, size: 64, align: 64, offset: 3136)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !346, line: 41, baseType: !347)
!346 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!347 = !DICompositeType(tag: DW_TAG_structure_type, file: !346, line: 31, size: 320, align: 64, elements: !348)
!348 = !{!349, !350, !351}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !347, file: !346, line: 32, baseType: !23, size: 192, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !347, file: !346, line: 33, baseType: !218, size: 64, align: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !347, file: !346, line: 34, baseType: !81, size: 8, align: 8, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !354, line: 253, baseType: !355)
!354 = !DIFile(filename: "Include/objimpl.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!355 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !354, line: 246, size: 192, align: 64, elements: !356)
!356 = !{!357, !364}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !355, file: !354, line: 251, baseType: !358, size: 192, align: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, scope: !355, file: !354, line: 247, size: 192, align: 64, elements: !359)
!359 = !{!360, !362, !363}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !358, file: !354, line: 248, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !358, file: !354, line: 249, baseType: !361, size: 64, align: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !358, file: !354, line: 250, baseType: !11, size: 64, align: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !355, file: !354, line: 252, baseType: !365, size: 64, align: 64)
!365 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !368, line: 33, baseType: !369)
!368 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!369 = !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 25, size: 256, align: 64, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !369, file: !368, line: 26, baseType: !23, size: 192, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !369, file: !368, line: 27, baseType: !373, size: 64, align: 64, offset: 192)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, align: 64, elements: !82)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !376, line: 40, baseType: !377)
!376 = !DIFile(filename: "Include/listobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!377 = !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 23, size: 320, align: 64, elements: !378)
!378 = !{!379, !380, !382}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !377, file: !376, line: 24, baseType: !23, size: 192, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !377, file: !376, line: 26, baseType: !381, size: 64, align: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !377, file: !376, line: 39, baseType: !11, size: 64, align: 64, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyWeakReference", file: !386, line: 10, baseType: !387)
!386 = !DIFile(filename: "Include/weakrefobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyWeakReference", file: !386, line: 16, size: 448, align: 64, elements: !388)
!388 = !{!389, !390, !391, !392, !393, !394}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !387, file: !386, line: 17, baseType: !6, size: 128, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "wr_object", scope: !387, file: !386, line: 23, baseType: !5, size: 64, align: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "wr_callback", scope: !387, file: !386, line: 26, baseType: !5, size: 64, align: 64, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !387, file: !386, line: 31, baseType: !218, size: 64, align: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "wr_prev", scope: !387, file: !386, line: 38, baseType: !384, size: 64, align: 64, offset: 320)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "wr_next", scope: !387, file: !386, line: 39, baseType: !384, size: 64, align: 64, offset: 384)
!395 = !{!396, !401, !406, !409, !430, !444, !449, !454, !460, !467, !475, !483, !492, !496, !500, !504, !508, !512, !516, !520, !525, !529, !536, !549, !560, !592, !597, !610, !620, !625, !640, !644, !652, !679, !700, !707, !719, !726, !731, !735, !740, !747, !750, !761, !770, !777, !784, !794, !797, !802, !811, !817, !845, !857, !861, !865, !879, !888, !889, !893}
!396 = !DISubprogram(name: "PyInit_gc", scope: !1, file: !1, line: 1557, type: !397, isLocal: false, isDefinition: true, scopeLine: 1558, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_gc, variables: !399)
!397 = !DISubroutineType(types: !398)
!398 = !{!5}
!399 = !{!400}
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !396, file: !1, line: 1559, type: !5)
!401 = !DISubprogram(name: "PyGC_Collect", scope: !1, file: !1, line: 1608, type: !402, isLocal: false, isDefinition: true, scopeLine: 1609, flags: DIFlagPrototyped, isOptimized: true, function: i64 ()* @PyGC_Collect, variables: !404)
!402 = !DISubroutineType(types: !403)
!403 = !{!11}
!404 = !{!405}
!405 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !401, file: !1, line: 1610, type: !11)
!406 = !DISubprogram(name: "_PyGC_CollectNoFail", scope: !1, file: !1, line: 1624, type: !402, isLocal: false, isDefinition: true, scopeLine: 1625, flags: DIFlagPrototyped, isOptimized: true, function: i64 ()* @_PyGC_CollectNoFail, variables: !407)
!407 = !{!408}
!408 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !406, file: !1, line: 1626, type: !11)
!409 = !DISubprogram(name: "_PyGC_DumpShutdownStats", scope: !1, file: !1, line: 1645, type: !410, isLocal: false, isDefinition: true, scopeLine: 1646, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_PyGC_DumpShutdownStats, variables: !412)
!410 = !DISubroutineType(types: !411)
!411 = !{null}
!412 = !{!413, !416, !419, !420, !422, !425, !427}
!413 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "message", scope: !414, file: !1, line: 1649, type: !52)
!414 = distinct !DILexicalBlock(scope: !415, file: !1, line: 1648, column: 61)
!415 = distinct !DILexicalBlock(scope: !409, file: !1, line: 1647, column: 9)
!416 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "repr", scope: !417, file: !1, line: 1664, type: !5)
!417 = distinct !DILexicalBlock(scope: !418, file: !1, line: 1663, column: 42)
!418 = distinct !DILexicalBlock(scope: !414, file: !1, line: 1663, column: 13)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !417, file: !1, line: 1664, type: !5)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !421, file: !1, line: 1674, type: !5)
!421 = distinct !DILexicalBlock(scope: !417, file: !1, line: 1674, column: 13)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !423, file: !1, line: 1674, type: !5)
!423 = distinct !DILexicalBlock(scope: !424, file: !1, line: 1674, column: 13)
!424 = distinct !DILexicalBlock(scope: !421, file: !1, line: 1674, column: 13)
!425 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !426, file: !1, line: 1675, type: !5)
!426 = distinct !DILexicalBlock(scope: !417, file: !1, line: 1675, column: 13)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !428, file: !1, line: 1675, type: !5)
!428 = distinct !DILexicalBlock(scope: !429, file: !1, line: 1675, column: 13)
!429 = distinct !DILexicalBlock(scope: !426, file: !1, line: 1675, column: 13)
!430 = !DISubprogram(name: "_PyGC_Fini", scope: !1, file: !1, line: 1681, type: !410, isLocal: false, isDefinition: true, scopeLine: 1682, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_PyGC_Fini, variables: !431)
!431 = !{!432, !434, !438, !440}
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !433, file: !1, line: 1683, type: !5)
!433 = distinct !DILexicalBlock(scope: !430, file: !1, line: 1683, column: 5)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !435, file: !1, line: 1683, type: !5)
!435 = distinct !DILexicalBlock(scope: !436, file: !1, line: 1683, column: 5)
!436 = distinct !DILexicalBlock(scope: !437, file: !1, line: 1683, column: 5)
!437 = distinct !DILexicalBlock(scope: !433, file: !1, line: 1683, column: 5)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !439, file: !1, line: 1684, type: !5)
!439 = distinct !DILexicalBlock(scope: !430, file: !1, line: 1684, column: 5)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !441, file: !1, line: 1684, type: !5)
!441 = distinct !DILexicalBlock(scope: !442, file: !1, line: 1684, column: 5)
!442 = distinct !DILexicalBlock(scope: !443, file: !1, line: 1684, column: 5)
!443 = distinct !DILexicalBlock(scope: !439, file: !1, line: 1684, column: 5)
!444 = !DISubprogram(name: "_PyGC_Dump", scope: !1, file: !1, line: 1689, type: !445, isLocal: false, isDefinition: true, scopeLine: 1690, flags: DIFlagPrototyped, isOptimized: true, function: void (%union._gc_head*)* @_PyGC_Dump, variables: !447)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !352}
!447 = !{!448}
!448 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !444, file: !1, line: 1689, type: !352)
!449 = !DISubprogram(name: "PyObject_GC_Track", scope: !1, file: !1, line: 1703, type: !331, isLocal: false, isDefinition: true, scopeLine: 1704, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @PyObject_GC_Track, variables: !450)
!450 = !{!451, !452}
!451 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !449, file: !1, line: 1703, type: !4)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !453, file: !1, line: 1705, type: !352)
!453 = distinct !DILexicalBlock(scope: !449, file: !1, line: 1705, column: 5)
!454 = !DISubprogram(name: "PyObject_GC_UnTrack", scope: !1, file: !1, line: 1709, type: !331, isLocal: false, isDefinition: true, scopeLine: 1710, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @PyObject_GC_UnTrack, variables: !455)
!455 = !{!456, !457}
!456 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !454, file: !1, line: 1709, type: !4)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !458, file: !1, line: 1715, type: !352)
!458 = distinct !DILexicalBlock(scope: !459, file: !1, line: 1715, column: 9)
!459 = distinct !DILexicalBlock(scope: !454, file: !1, line: 1714, column: 9)
!460 = !DISubprogram(name: "_PyObject_GC_Malloc", scope: !1, file: !1, line: 1719, type: !461, isLocal: false, isDefinition: true, scopeLine: 1720, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i64)* @_PyObject_GC_Malloc, variables: !463)
!461 = !DISubroutineType(types: !462)
!462 = !{!5, !94}
!463 = !{!464, !465, !466}
!464 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "basicsize", arg: 1, scope: !460, file: !1, line: 1719, type: !94)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !460, file: !1, line: 1721, type: !5)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !460, file: !1, line: 1722, type: !352)
!467 = !DISubprogram(name: "_PyObject_GC_New", scope: !1, file: !1, line: 1746, type: !468, isLocal: false, isDefinition: true, scopeLine: 1747, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*)* @_PyObject_GC_New, variables: !472)
!468 = !DISubroutineType(types: !469)
!469 = !{!5, !470}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !7, line: 422, baseType: !20)
!472 = !{!473, !474}
!473 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tp", arg: 1, scope: !467, file: !1, line: 1746, type: !470)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !467, file: !1, line: 1748, type: !5)
!475 = !DISubprogram(name: "_PyObject_GC_NewVar", scope: !1, file: !1, line: 1755, type: !476, isLocal: false, isDefinition: true, scopeLine: 1756, flags: DIFlagPrototyped, isOptimized: true, function: %struct.PyVarObject* (%struct._typeobject*, i64)* @_PyObject_GC_NewVar, variables: !478)
!476 = !DISubroutineType(types: !477)
!477 = !{!343, !470, !11}
!478 = !{!479, !480, !481, !482}
!479 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tp", arg: 1, scope: !475, file: !1, line: 1755, type: !470)
!480 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nitems", arg: 2, scope: !475, file: !1, line: 1755, type: !11)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !475, file: !1, line: 1757, type: !94)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !475, file: !1, line: 1758, type: !343)
!483 = !DISubprogram(name: "_PyObject_GC_Resize", scope: !1, file: !1, line: 1772, type: !484, isLocal: false, isDefinition: true, scopeLine: 1773, flags: DIFlagPrototyped, isOptimized: true, function: %struct.PyVarObject* (%struct.PyVarObject*, i64)* @_PyObject_GC_Resize, variables: !486)
!484 = !DISubroutineType(types: !485)
!485 = !{!343, !343, !11}
!486 = !{!487, !488, !489, !491}
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !483, file: !1, line: 1772, type: !343)
!488 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nitems", arg: 2, scope: !483, file: !1, line: 1772, type: !11)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "basicsize", scope: !483, file: !1, line: 1774, type: !490)
!490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !483, file: !1, line: 1775, type: !352)
!492 = !DISubprogram(name: "PyObject_GC_Del", scope: !1, file: !1, line: 1787, type: !331, isLocal: false, isDefinition: true, scopeLine: 1788, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @PyObject_GC_Del, variables: !493)
!493 = !{!494, !495}
!494 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !492, file: !1, line: 1787, type: !4)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !492, file: !1, line: 1789, type: !352)
!496 = !DISubprogram(name: "gc_enable", scope: !1, file: !1, line: 1176, type: !126, isLocal: true, isDefinition: true, scopeLine: 1177, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @gc_enable, variables: !497)
!497 = !{!498, !499}
!498 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !496, file: !1, line: 1176, type: !5)
!499 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noargs", arg: 2, scope: !496, file: !1, line: 1176, type: !5)
!500 = !DISubprogram(name: "gc_disable", scope: !1, file: !1, line: 1189, type: !126, isLocal: true, isDefinition: true, scopeLine: 1190, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @gc_disable, variables: !501)
!501 = !{!502, !503}
!502 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !500, file: !1, line: 1189, type: !5)
!503 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noargs", arg: 2, scope: !500, file: !1, line: 1189, type: !5)
!504 = !DISubprogram(name: "gc_isenabled", scope: !1, file: !1, line: 1202, type: !126, isLocal: true, isDefinition: true, scopeLine: 1203, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @gc_isenabled, variables: !505)
!505 = !{!506, !507}
!506 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !504, file: !1, line: 1202, type: !5)
!507 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noargs", arg: 2, scope: !504, file: !1, line: 1202, type: !5)
!508 = !DISubprogram(name: "gc_set_debug", scope: !1, file: !1, line: 1256, type: !126, isLocal: true, isDefinition: true, scopeLine: 1257, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @gc_set_debug, variables: !509)
!509 = !{!510, !511}
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !508, file: !1, line: 1256, type: !5)
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !508, file: !1, line: 1256, type: !5)
!512 = !DISubprogram(name: "gc_get_debug", scope: !1, file: !1, line: 1271, type: !126, isLocal: true, isDefinition: true, scopeLine: 1272, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @gc_get_debug, variables: !513)
!513 = !{!514, !515}
!514 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !512, file: !1, line: 1271, type: !5)
!515 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noargs", arg: 2, scope: !512, file: !1, line: 1271, type: !5)
!516 = !DISubprogram(name: "gc_get_count", scope: !1, file: !1, line: 1320, type: !126, isLocal: true, isDefinition: true, scopeLine: 1321, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @gc_get_count, variables: !517)
!517 = !{!518, !519}
!518 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !516, file: !1, line: 1320, type: !5)
!519 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noargs", arg: 2, scope: !516, file: !1, line: 1320, type: !5)
!520 = !DISubprogram(name: "gc_set_thresh", scope: !1, file: !1, line: 1283, type: !126, isLocal: true, isDefinition: true, scopeLine: 1284, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @gc_set_thresh, variables: !521)
!521 = !{!522, !523, !524}
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !520, file: !1, line: 1283, type: !5)
!523 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !520, file: !1, line: 1283, type: !5)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !520, file: !1, line: 1285, type: !44)
!525 = !DISubprogram(name: "gc_get_thresh", scope: !1, file: !1, line: 1306, type: !126, isLocal: true, isDefinition: true, scopeLine: 1307, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @gc_get_thresh, variables: !526)
!526 = !{!527, !528}
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !525, file: !1, line: 1306, type: !5)
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noargs", arg: 2, scope: !525, file: !1, line: 1306, type: !5)
!529 = !DISubprogram(name: "gc_collect", scope: !1, file: !1, line: 1216, type: !135, isLocal: true, isDefinition: true, scopeLine: 1217, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @gc_collect, variables: !530)
!530 = !{!531, !532, !533, !534, !535}
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !529, file: !1, line: 1216, type: !5)
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !529, file: !1, line: 1216, type: !5)
!533 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kws", arg: 3, scope: !529, file: !1, line: 1216, type: !5)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "genarg", scope: !529, file: !1, line: 1219, type: !44)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !529, file: !1, line: 1220, type: !11)
!536 = !DISubprogram(name: "gc_get_objects", scope: !1, file: !1, line: 1421, type: !126, isLocal: true, isDefinition: true, scopeLine: 1422, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @gc_get_objects, variables: !537)
!537 = !{!538, !539, !540, !541, !542}
!538 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !536, file: !1, line: 1421, type: !5)
!539 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noargs", arg: 2, scope: !536, file: !1, line: 1421, type: !5)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !536, file: !1, line: 1423, type: !44)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !536, file: !1, line: 1424, type: !5)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !543, file: !1, line: 1431, type: !5)
!543 = distinct !DILexicalBlock(scope: !544, file: !1, line: 1431, column: 13)
!544 = distinct !DILexicalBlock(scope: !545, file: !1, line: 1430, column: 50)
!545 = distinct !DILexicalBlock(scope: !546, file: !1, line: 1430, column: 13)
!546 = distinct !DILexicalBlock(scope: !547, file: !1, line: 1429, column: 43)
!547 = distinct !DILexicalBlock(scope: !548, file: !1, line: 1429, column: 5)
!548 = distinct !DILexicalBlock(scope: !536, file: !1, line: 1429, column: 5)
!549 = !DISubprogram(name: "append_objects", scope: !1, file: !1, line: 318, type: !550, isLocal: true, isDefinition: true, scopeLine: 319, flags: DIFlagPrototyped, isOptimized: true, variables: !552)
!550 = !DISubroutineType(types: !551)
!551 = !{!44, !5, !352}
!552 = !{!553, !554, !555, !556}
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "py_list", arg: 1, scope: !549, file: !1, line: 318, type: !5)
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gc_list", arg: 2, scope: !549, file: !1, line: 318, type: !352)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gc", scope: !549, file: !1, line: 320, type: !352)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !557, file: !1, line: 322, type: !5)
!557 = distinct !DILexicalBlock(scope: !558, file: !1, line: 321, column: 72)
!558 = distinct !DILexicalBlock(scope: !559, file: !1, line: 321, column: 5)
!559 = distinct !DILexicalBlock(scope: !549, file: !1, line: 321, column: 5)
!560 = !DISubprogram(name: "gc_get_stats", scope: !1, file: !1, line: 1444, type: !126, isLocal: true, isDefinition: true, scopeLine: 1445, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @gc_get_stats, variables: !561)
!561 = !{!562, !563, !564, !565, !566, !575, !577, !581, !585, !587, !589}
!562 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !560, file: !1, line: 1444, type: !5)
!563 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noargs", arg: 2, scope: !560, file: !1, line: 1444, type: !5)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !560, file: !1, line: 1446, type: !44)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !560, file: !1, line: 1447, type: !5)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stats", scope: !560, file: !1, line: 1448, type: !567)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 576, align: 64, elements: !573)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "gc_generation_stats", file: !1, line: 172, size: 192, align: 64, elements: !569)
!569 = !{!570, !571, !572}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "collections", scope: !568, file: !1, line: 174, baseType: !11, size: 64, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "collected", scope: !568, file: !1, line: 176, baseType: !11, size: 64, align: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "uncollectable", scope: !568, file: !1, line: 178, baseType: !11, size: 64, align: 64, offset: 128)
!573 = !{!574}
!574 = !DISubrange(count: 3)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !560, file: !1, line: 1448, type: !576)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64, align: 64)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !578, file: !1, line: 1461, type: !5)
!578 = distinct !DILexicalBlock(scope: !579, file: !1, line: 1460, column: 43)
!579 = distinct !DILexicalBlock(scope: !580, file: !1, line: 1460, column: 5)
!580 = distinct !DILexicalBlock(scope: !560, file: !1, line: 1460, column: 5)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !582, file: !1, line: 1471, type: !5)
!582 = distinct !DILexicalBlock(scope: !583, file: !1, line: 1471, column: 13)
!583 = distinct !DILexicalBlock(scope: !584, file: !1, line: 1470, column: 42)
!584 = distinct !DILexicalBlock(scope: !578, file: !1, line: 1470, column: 13)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !586, file: !1, line: 1474, type: !5)
!586 = distinct !DILexicalBlock(scope: !578, file: !1, line: 1474, column: 9)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !588, file: !1, line: 1479, type: !5)
!588 = distinct !DILexicalBlock(scope: !560, file: !1, line: 1479, column: 5)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !590, file: !1, line: 1479, type: !5)
!590 = distinct !DILexicalBlock(scope: !591, file: !1, line: 1479, column: 5)
!591 = distinct !DILexicalBlock(scope: !588, file: !1, line: 1479, column: 5)
!592 = !DISubprogram(name: "gc_is_tracked", scope: !1, file: !1, line: 1492, type: !126, isLocal: true, isDefinition: true, scopeLine: 1493, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @gc_is_tracked, variables: !593)
!593 = !{!594, !595, !596}
!594 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !592, file: !1, line: 1492, type: !5)
!595 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !592, file: !1, line: 1492, type: !5)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !592, file: !1, line: 1494, type: !5)
!597 = !DISubprogram(name: "gc_get_referrers", scope: !1, file: !1, line: 1362, type: !126, isLocal: true, isDefinition: true, scopeLine: 1363, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @gc_get_referrers, variables: !598)
!598 = !{!599, !600, !601, !602, !603}
!599 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !597, file: !1, line: 1362, type: !5)
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !597, file: !1, line: 1362, type: !5)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !597, file: !1, line: 1364, type: !44)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !597, file: !1, line: 1365, type: !5)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !604, file: !1, line: 1370, type: !5)
!604 = distinct !DILexicalBlock(scope: !605, file: !1, line: 1370, column: 13)
!605 = distinct !DILexicalBlock(scope: !606, file: !1, line: 1369, column: 61)
!606 = distinct !DILexicalBlock(scope: !607, file: !1, line: 1369, column: 13)
!607 = distinct !DILexicalBlock(scope: !608, file: !1, line: 1368, column: 43)
!608 = distinct !DILexicalBlock(scope: !609, file: !1, line: 1368, column: 5)
!609 = distinct !DILexicalBlock(scope: !597, file: !1, line: 1368, column: 5)
!610 = !DISubprogram(name: "gc_referrers_for", scope: !1, file: !1, line: 1339, type: !611, isLocal: true, isDefinition: true, scopeLine: 1340, flags: DIFlagPrototyped, isOptimized: true, variables: !613)
!611 = !DISubroutineType(types: !612)
!612 = !{!44, !5, !352, !5}
!613 = !{!614, !615, !616, !617, !618, !619}
!614 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "objs", arg: 1, scope: !610, file: !1, line: 1339, type: !5)
!615 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 2, scope: !610, file: !1, line: 1339, type: !352)
!616 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "resultlist", arg: 3, scope: !610, file: !1, line: 1339, type: !5)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gc", scope: !610, file: !1, line: 1341, type: !352)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !610, file: !1, line: 1342, type: !5)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "traverse", scope: !610, file: !1, line: 1343, type: !259)
!620 = !DISubprogram(name: "referrersvisit", scope: !1, file: !1, line: 1329, type: !197, isLocal: true, isDefinition: true, scopeLine: 1330, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*)* @referrersvisit, variables: !621)
!621 = !{!622, !623, !624}
!622 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !620, file: !1, line: 1329, type: !5)
!623 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "objs", arg: 2, scope: !620, file: !1, line: 1329, type: !5)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !620, file: !1, line: 1331, type: !11)
!625 = !DISubprogram(name: "gc_get_referents", scope: !1, file: !1, line: 1389, type: !126, isLocal: true, isDefinition: true, scopeLine: 1390, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @gc_get_referents, variables: !626)
!626 = !{!627, !628, !629, !630, !631, !635, !636}
!627 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !625, file: !1, line: 1389, type: !5)
!628 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !625, file: !1, line: 1389, type: !5)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !625, file: !1, line: 1391, type: !11)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !625, file: !1, line: 1392, type: !5)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "traverse", scope: !632, file: !1, line: 1398, type: !259)
!632 = distinct !DILexicalBlock(scope: !633, file: !1, line: 1397, column: 50)
!633 = distinct !DILexicalBlock(scope: !634, file: !1, line: 1397, column: 5)
!634 = distinct !DILexicalBlock(scope: !625, file: !1, line: 1397, column: 5)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !632, file: !1, line: 1399, type: !5)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !637, file: !1, line: 1407, type: !5)
!637 = distinct !DILexicalBlock(scope: !638, file: !1, line: 1407, column: 13)
!638 = distinct !DILexicalBlock(scope: !639, file: !1, line: 1406, column: 63)
!639 = distinct !DILexicalBlock(scope: !632, file: !1, line: 1406, column: 13)
!640 = !DISubprogram(name: "referentsvisit", scope: !1, file: !1, line: 1379, type: !197, isLocal: true, isDefinition: true, scopeLine: 1380, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*)* @referentsvisit, variables: !641)
!641 = !{!642, !643}
!642 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !640, file: !1, line: 1379, type: !5)
!643 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 2, scope: !640, file: !1, line: 1379, type: !5)
!644 = !DISubprogram(name: "collect_with_callback", scope: !1, file: !1, line: 1136, type: !645, isLocal: true, isDefinition: true, scopeLine: 1137, flags: DIFlagPrototyped, isOptimized: true, variables: !647)
!645 = !DISubroutineType(types: !646)
!646 = !{!11, !44}
!647 = !{!648, !649, !650, !651}
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "generation", arg: 1, scope: !644, file: !1, line: 1136, type: !44)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !644, file: !1, line: 1138, type: !11)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "collected", scope: !644, file: !1, line: 1138, type: !11)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uncollectable", scope: !644, file: !1, line: 1138, type: !11)
!652 = !DISubprogram(name: "invoke_gc_callback", scope: !1, file: !1, line: 1099, type: !653, isLocal: true, isDefinition: true, scopeLine: 1101, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32, i64, i64)* @invoke_gc_callback, variables: !655)
!653 = !DISubroutineType(types: !654)
!654 = !{null, !29, !44, !11, !11}
!655 = !{!656, !657, !658, !659, !660, !661, !662, !666, !667, !669, !672, !674, !676}
!656 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "phase", arg: 1, scope: !652, file: !1, line: 1099, type: !29)
!657 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "generation", arg: 2, scope: !652, file: !1, line: 1099, type: !44)
!658 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "collected", arg: 3, scope: !652, file: !1, line: 1100, type: !11)
!659 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "uncollectable", arg: 4, scope: !652, file: !1, line: 1100, type: !11)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !652, file: !1, line: 1102, type: !11)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !652, file: !1, line: 1103, type: !5)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !663, file: !1, line: 1121, type: !5)
!663 = distinct !DILexicalBlock(scope: !664, file: !1, line: 1120, column: 50)
!664 = distinct !DILexicalBlock(scope: !665, file: !1, line: 1120, column: 5)
!665 = distinct !DILexicalBlock(scope: !652, file: !1, line: 1120, column: 5)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cb", scope: !663, file: !1, line: 1121, type: !5)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !668, file: !1, line: 1124, type: !5)
!668 = distinct !DILexicalBlock(scope: !663, file: !1, line: 1124, column: 9)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !670, file: !1, line: 1124, type: !5)
!670 = distinct !DILexicalBlock(scope: !671, file: !1, line: 1124, column: 9)
!671 = distinct !DILexicalBlock(scope: !668, file: !1, line: 1124, column: 9)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !673, file: !1, line: 1127, type: !5)
!673 = distinct !DILexicalBlock(scope: !663, file: !1, line: 1127, column: 9)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !675, file: !1, line: 1129, type: !5)
!675 = distinct !DILexicalBlock(scope: !652, file: !1, line: 1129, column: 5)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !677, file: !1, line: 1129, type: !5)
!677 = distinct !DILexicalBlock(scope: !678, file: !1, line: 1129, column: 5)
!678 = distinct !DILexicalBlock(scope: !675, file: !1, line: 1129, column: 5)
!679 = !DISubprogram(name: "collect", scope: !1, file: !1, line: 920, type: !680, isLocal: true, isDefinition: true, scopeLine: 922, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i32, i64*, i64*, i32)* @collect, variables: !682)
!680 = !DISubroutineType(types: !681)
!681 = !{!11, !44, !247, !247, !44}
!682 = !{!683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697}
!683 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "generation", arg: 1, scope: !679, file: !1, line: 920, type: !44)
!684 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_collected", arg: 2, scope: !679, file: !1, line: 920, type: !247)
!685 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_uncollectable", arg: 3, scope: !679, file: !1, line: 920, type: !247)
!686 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nofail", arg: 4, scope: !679, file: !1, line: 921, type: !44)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !679, file: !1, line: 923, type: !44)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !679, file: !1, line: 924, type: !11)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !679, file: !1, line: 925, type: !11)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "young", scope: !679, file: !1, line: 926, type: !352)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old", scope: !679, file: !1, line: 927, type: !352)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unreachable", scope: !679, file: !1, line: 928, type: !353)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "finalizers", scope: !679, file: !1, line: 929, type: !353)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gc", scope: !679, file: !1, line: 930, type: !352)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t1", scope: !679, file: !1, line: 931, type: !365)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stats", scope: !679, file: !1, line: 932, type: !576)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t2", scope: !698, file: !1, line: 1045, type: !365)
!698 = distinct !DILexicalBlock(scope: !699, file: !1, line: 1044, column: 30)
!699 = distinct !DILexicalBlock(scope: !679, file: !1, line: 1044, column: 9)
!700 = !DISubprogram(name: "gc_list_size", scope: !1, file: !1, line: 304, type: !701, isLocal: true, isDefinition: true, scopeLine: 305, flags: DIFlagPrototyped, isOptimized: true, variables: !703)
!701 = !DISubroutineType(types: !702)
!702 = !{!11, !352}
!703 = !{!704, !705, !706}
!704 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 1, scope: !700, file: !1, line: 304, type: !352)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gc", scope: !700, file: !1, line: 306, type: !352)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !700, file: !1, line: 307, type: !11)
!707 = !DISubprogram(name: "get_time", scope: !1, file: !1, line: 898, type: !708, isLocal: true, isDefinition: true, scopeLine: 899, flags: DIFlagPrototyped, isOptimized: true, variables: !710)
!708 = !DISubroutineType(types: !709)
!709 = !{!365}
!710 = !{!711, !712, !715}
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !707, file: !1, line: 900, type: !365)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !713, file: !1, line: 904, type: !5)
!713 = distinct !DILexicalBlock(scope: !714, file: !1, line: 901, column: 23)
!714 = distinct !DILexicalBlock(scope: !707, file: !1, line: 901, column: 9)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !716, file: !1, line: 911, type: !5)
!716 = distinct !DILexicalBlock(scope: !717, file: !1, line: 911, column: 13)
!717 = distinct !DILexicalBlock(scope: !718, file: !1, line: 908, column: 14)
!718 = distinct !DILexicalBlock(scope: !713, file: !1, line: 905, column: 13)
!719 = !DISubprogram(name: "gc_list_merge", scope: !1, file: !1, line: 289, type: !720, isLocal: true, isDefinition: true, scopeLine: 290, flags: DIFlagPrototyped, isOptimized: true, variables: !722)
!720 = !DISubroutineType(types: !721)
!721 = !{null, !352, !352}
!722 = !{!723, !724, !725}
!723 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "from", arg: 1, scope: !719, file: !1, line: 289, type: !352)
!724 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "to", arg: 2, scope: !719, file: !1, line: 289, type: !352)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tail", scope: !719, file: !1, line: 291, type: !352)
!726 = !DISubprogram(name: "gc_list_is_empty", scope: !1, file: !1, line: 241, type: !727, isLocal: true, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, variables: !729)
!727 = !DISubroutineType(types: !728)
!728 = !{!44, !352}
!729 = !{!730}
!730 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 1, scope: !726, file: !1, line: 241, type: !352)
!731 = !DISubprogram(name: "update_refs", scope: !1, file: !1, line: 340, type: !445, isLocal: true, isDefinition: true, scopeLine: 341, flags: DIFlagPrototyped, isOptimized: true, variables: !732)
!732 = !{!733, !734}
!733 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "containers", arg: 1, scope: !731, file: !1, line: 340, type: !352)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gc", scope: !731, file: !1, line: 342, type: !352)
!735 = !DISubprogram(name: "subtract_refs", scope: !1, file: !1, line: 392, type: !445, isLocal: true, isDefinition: true, scopeLine: 393, flags: DIFlagPrototyped, isOptimized: true, variables: !736)
!736 = !{!737, !738, !739}
!737 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "containers", arg: 1, scope: !735, file: !1, line: 392, type: !352)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "traverse", scope: !735, file: !1, line: 394, type: !259)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gc", scope: !735, file: !1, line: 395, type: !352)
!740 = !DISubprogram(name: "visit_decref", scope: !1, file: !1, line: 370, type: !265, isLocal: true, isDefinition: true, scopeLine: 371, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*)* @visit_decref, variables: !741)
!741 = !{!742, !743, !744}
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !740, file: !1, line: 370, type: !5)
!743 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 2, scope: !740, file: !1, line: 370, type: !4)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gc", scope: !745, file: !1, line: 374, type: !352)
!745 = distinct !DILexicalBlock(scope: !746, file: !1, line: 373, column: 29)
!746 = distinct !DILexicalBlock(scope: !740, file: !1, line: 373, column: 9)
!747 = !DISubprogram(name: "gc_list_init", scope: !1, file: !1, line: 234, type: !445, isLocal: true, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: true, variables: !748)
!748 = !{!749}
!749 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 1, scope: !747, file: !1, line: 234, type: !352)
!750 = !DISubprogram(name: "move_unreachable", scope: !1, file: !1, line: 456, type: !720, isLocal: true, isDefinition: true, scopeLine: 457, flags: DIFlagPrototyped, isOptimized: true, variables: !751)
!751 = !{!752, !753, !754, !755, !757, !760}
!752 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "young", arg: 1, scope: !750, file: !1, line: 456, type: !352)
!753 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unreachable", arg: 2, scope: !750, file: !1, line: 456, type: !352)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gc", scope: !750, file: !1, line: 458, type: !352)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next", scope: !756, file: !1, line: 470, type: !352)
!756 = distinct !DILexicalBlock(scope: !750, file: !1, line: 469, column: 25)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !758, file: !1, line: 481, type: !5)
!758 = distinct !DILexicalBlock(scope: !759, file: !1, line: 472, column: 33)
!759 = distinct !DILexicalBlock(scope: !756, file: !1, line: 472, column: 13)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "traverse", scope: !758, file: !1, line: 482, type: !259)
!761 = !DISubprogram(name: "visit_reachable", scope: !1, file: !1, line: 406, type: !550, isLocal: true, isDefinition: true, scopeLine: 407, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %union._gc_head*)* @visit_reachable, variables: !762)
!762 = !{!763, !764, !765, !768}
!763 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !761, file: !1, line: 406, type: !5)
!764 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "reachable", arg: 2, scope: !761, file: !1, line: 406, type: !352)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gc", scope: !766, file: !1, line: 409, type: !352)
!766 = distinct !DILexicalBlock(scope: !767, file: !1, line: 408, column: 29)
!767 = distinct !DILexicalBlock(scope: !761, file: !1, line: 408, column: 9)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gc_refs", scope: !766, file: !1, line: 410, type: !769)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!770 = !DISubprogram(name: "gc_list_move", scope: !1, file: !1, line: 273, type: !720, isLocal: true, isDefinition: true, scopeLine: 274, flags: DIFlagPrototyped, isOptimized: true, variables: !771)
!771 = !{!772, !773, !774, !775, !776}
!772 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "node", arg: 1, scope: !770, file: !1, line: 273, type: !352)
!773 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 2, scope: !770, file: !1, line: 273, type: !352)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_prev", scope: !770, file: !1, line: 275, type: !352)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "current_prev", scope: !770, file: !1, line: 276, type: !352)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "current_next", scope: !770, file: !1, line: 277, type: !352)
!777 = !DISubprogram(name: "untrack_dicts", scope: !1, file: !1, line: 511, type: !445, isLocal: true, isDefinition: true, scopeLine: 512, flags: DIFlagPrototyped, isOptimized: true, variables: !778)
!778 = !{!779, !780, !781, !782}
!779 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "head", arg: 1, scope: !777, file: !1, line: 511, type: !352)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next", scope: !777, file: !1, line: 513, type: !352)
!781 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gc", scope: !777, file: !1, line: 513, type: !352)
!782 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !783, file: !1, line: 515, type: !5)
!783 = distinct !DILexicalBlock(scope: !777, file: !1, line: 514, column: 24)
!784 = !DISubprogram(name: "move_legacy_finalizers", scope: !1, file: !1, line: 535, type: !720, isLocal: true, isDefinition: true, scopeLine: 536, flags: DIFlagPrototyped, isOptimized: true, variables: !785)
!785 = !{!786, !787, !788, !789, !790}
!786 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unreachable", arg: 1, scope: !784, file: !1, line: 535, type: !352)
!787 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "finalizers", arg: 2, scope: !784, file: !1, line: 535, type: !352)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gc", scope: !784, file: !1, line: 537, type: !352)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next", scope: !784, file: !1, line: 538, type: !352)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !791, file: !1, line: 544, type: !5)
!791 = distinct !DILexicalBlock(scope: !792, file: !1, line: 543, column: 70)
!792 = distinct !DILexicalBlock(scope: !793, file: !1, line: 543, column: 5)
!793 = distinct !DILexicalBlock(scope: !784, file: !1, line: 543, column: 5)
!794 = !DISubprogram(name: "has_legacy_finalizer", scope: !1, file: !1, line: 525, type: !144, isLocal: true, isDefinition: true, scopeLine: 526, flags: DIFlagPrototyped, isOptimized: true, variables: !795)
!795 = !{!796}
!796 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !794, file: !1, line: 525, type: !5)
!797 = !DISubprogram(name: "move_legacy_finalizer_reachable", scope: !1, file: !1, line: 574, type: !445, isLocal: true, isDefinition: true, scopeLine: 575, flags: DIFlagPrototyped, isOptimized: true, variables: !798)
!798 = !{!799, !800, !801}
!799 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "finalizers", arg: 1, scope: !797, file: !1, line: 574, type: !352)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "traverse", scope: !797, file: !1, line: 576, type: !259)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gc", scope: !797, file: !1, line: 577, type: !352)
!802 = !DISubprogram(name: "visit_move", scope: !1, file: !1, line: 558, type: !550, isLocal: true, isDefinition: true, scopeLine: 559, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %union._gc_head*)* @visit_move, variables: !803)
!803 = !{!804, !805, !806}
!804 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !802, file: !1, line: 558, type: !5)
!805 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tolist", arg: 2, scope: !802, file: !1, line: 558, type: !352)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gc", scope: !807, file: !1, line: 562, type: !352)
!807 = distinct !DILexicalBlock(scope: !808, file: !1, line: 561, column: 45)
!808 = distinct !DILexicalBlock(scope: !809, file: !1, line: 561, column: 13)
!809 = distinct !DILexicalBlock(scope: !810, file: !1, line: 560, column: 29)
!810 = distinct !DILexicalBlock(scope: !802, file: !1, line: 560, column: 9)
!811 = !DISubprogram(name: "debug_cycle", scope: !1, file: !1, line: 741, type: !812, isLocal: true, isDefinition: true, scopeLine: 742, flags: DIFlagPrototyped, isOptimized: true, variables: !814)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !52, !5}
!814 = !{!815, !816}
!815 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msg", arg: 1, scope: !811, file: !1, line: 741, type: !52)
!816 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 2, scope: !811, file: !1, line: 741, type: !5)
!817 = !DISubprogram(name: "handle_weakrefs", scope: !1, file: !1, line: 599, type: !818, isLocal: true, isDefinition: true, scopeLine: 600, flags: DIFlagPrototyped, isOptimized: true, variables: !820)
!818 = !DISubroutineType(types: !819)
!819 = !{!44, !352, !352}
!820 = !{!821, !822, !823, !824, !825, !826, !827, !828, !829, !833, !837, !839, !840, !843}
!821 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unreachable", arg: 1, scope: !817, file: !1, line: 599, type: !352)
!822 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "old", arg: 2, scope: !817, file: !1, line: 599, type: !352)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gc", scope: !817, file: !1, line: 601, type: !352)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !817, file: !1, line: 602, type: !5)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wr", scope: !817, file: !1, line: 603, type: !384)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wrcb_to_call", scope: !817, file: !1, line: 604, type: !353)
!827 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next", scope: !817, file: !1, line: 605, type: !352)
!828 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_freed", scope: !817, file: !1, line: 606, type: !44)
!829 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wrlist", scope: !830, file: !1, line: 619, type: !383)
!830 = distinct !DILexicalBlock(scope: !831, file: !1, line: 618, column: 70)
!831 = distinct !DILexicalBlock(scope: !832, file: !1, line: 618, column: 5)
!832 = distinct !DILexicalBlock(scope: !817, file: !1, line: 618, column: 5)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wrasgc", scope: !834, file: !1, line: 637, type: !352)
!834 = distinct !DILexicalBlock(scope: !835, file: !1, line: 636, column: 54)
!835 = distinct !DILexicalBlock(scope: !836, file: !1, line: 636, column: 9)
!836 = distinct !DILexicalBlock(scope: !830, file: !1, line: 636, column: 9)
!837 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !838, file: !1, line: 699, type: !5)
!838 = distinct !DILexicalBlock(scope: !817, file: !1, line: 698, column: 47)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "callback", scope: !838, file: !1, line: 700, type: !5)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !841, file: !1, line: 715, type: !5)
!841 = distinct !DILexicalBlock(scope: !842, file: !1, line: 715, column: 13)
!842 = distinct !DILexicalBlock(scope: !838, file: !1, line: 712, column: 13)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !844, file: !1, line: 728, type: !5)
!844 = distinct !DILexicalBlock(scope: !838, file: !1, line: 728, column: 9)
!845 = !DISubprogram(name: "finalize_garbage", scope: !1, file: !1, line: 784, type: !445, isLocal: true, isDefinition: true, scopeLine: 785, flags: DIFlagPrototyped, isOptimized: true, variables: !846)
!846 = !{!847, !848, !849, !850, !852, !853}
!847 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "collectable", arg: 1, scope: !845, file: !1, line: 784, type: !352)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "finalize", scope: !845, file: !1, line: 786, type: !35)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seen", scope: !845, file: !1, line: 787, type: !353)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gc", scope: !851, file: !1, line: 800, type: !352)
!851 = distinct !DILexicalBlock(scope: !845, file: !1, line: 799, column: 44)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !851, file: !1, line: 801, type: !5)
!853 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !854, file: !1, line: 809, type: !5)
!854 = distinct !DILexicalBlock(scope: !855, file: !1, line: 809, column: 13)
!855 = distinct !DILexicalBlock(scope: !856, file: !1, line: 805, column: 64)
!856 = distinct !DILexicalBlock(scope: !851, file: !1, line: 803, column: 13)
!857 = !DISubprogram(name: "check_garbage", scope: !1, file: !1, line: 819, type: !727, isLocal: true, isDefinition: true, scopeLine: 820, flags: DIFlagPrototyped, isOptimized: true, variables: !858)
!858 = !{!859, !860}
!859 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "collectable", arg: 1, scope: !857, file: !1, line: 819, type: !352)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gc", scope: !857, file: !1, line: 821, type: !352)
!861 = !DISubprogram(name: "revive_garbage", scope: !1, file: !1, line: 838, type: !445, isLocal: true, isDefinition: true, scopeLine: 839, flags: DIFlagPrototyped, isOptimized: true, variables: !862)
!862 = !{!863, !864}
!863 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "collectable", arg: 1, scope: !861, file: !1, line: 838, type: !352)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gc", scope: !861, file: !1, line: 840, type: !352)
!865 = !DISubprogram(name: "delete_garbage", scope: !1, file: !1, line: 852, type: !720, isLocal: true, isDefinition: true, scopeLine: 853, flags: DIFlagPrototyped, isOptimized: true, variables: !866)
!866 = !{!867, !868, !869, !870, !872, !873}
!867 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "collectable", arg: 1, scope: !865, file: !1, line: 852, type: !352)
!868 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "old", arg: 2, scope: !865, file: !1, line: 852, type: !352)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "clear", scope: !865, file: !1, line: 854, type: !142)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gc", scope: !871, file: !1, line: 857, type: !352)
!871 = distinct !DILexicalBlock(scope: !865, file: !1, line: 856, column: 44)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !871, file: !1, line: 858, type: !5)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !874, file: !1, line: 867, type: !5)
!874 = distinct !DILexicalBlock(scope: !875, file: !1, line: 867, column: 17)
!875 = distinct !DILexicalBlock(scope: !876, file: !1, line: 864, column: 58)
!876 = distinct !DILexicalBlock(scope: !877, file: !1, line: 864, column: 17)
!877 = distinct !DILexicalBlock(scope: !878, file: !1, line: 863, column: 14)
!878 = distinct !DILexicalBlock(scope: !871, file: !1, line: 860, column: 13)
!879 = !DISubprogram(name: "handle_legacy_finalizers", scope: !1, file: !1, line: 757, type: !818, isLocal: true, isDefinition: true, scopeLine: 758, flags: DIFlagPrototyped, isOptimized: true, variables: !880)
!880 = !{!881, !882, !883, !884}
!881 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "finalizers", arg: 1, scope: !879, file: !1, line: 757, type: !352)
!882 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "old", arg: 2, scope: !879, file: !1, line: 757, type: !352)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gc", scope: !879, file: !1, line: 759, type: !352)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !885, file: !1, line: 767, type: !5)
!885 = distinct !DILexicalBlock(scope: !886, file: !1, line: 766, column: 51)
!886 = distinct !DILexicalBlock(scope: !887, file: !1, line: 766, column: 5)
!887 = distinct !DILexicalBlock(scope: !879, file: !1, line: 766, column: 5)
!888 = !DISubprogram(name: "clear_freelists", scope: !1, file: !1, line: 884, type: !410, isLocal: true, isDefinition: true, scopeLine: 885, flags: DIFlagPrototyped, isOptimized: true, variables: !2)
!889 = !DISubprogram(name: "collect_generations", scope: !1, file: !1, line: 1146, type: !402, isLocal: true, isDefinition: true, scopeLine: 1147, flags: DIFlagPrototyped, isOptimized: true, variables: !890)
!890 = !{!891, !892}
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !889, file: !1, line: 1148, type: !44)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !889, file: !1, line: 1149, type: !11)
!893 = !DISubprogram(name: "gc_list_remove", scope: !1, file: !1, line: 261, type: !445, isLocal: true, isDefinition: true, scopeLine: 262, flags: DIFlagPrototyped, isOptimized: true, variables: !894)
!894 = !{!895}
!895 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "node", arg: 1, scope: !893, file: !1, line: 261, type: !352)
!896 = !{!897, !898, !899, !906, !929, !933, !937, !941, !945, !949, !953, !957, !961, !965, !969, !973, !977, !981, !982, !986, !990, !994, !998, !999, !1000, !1001, !1002, !1010, !1011, !1012, !1013}
!897 = !DIGlobalVariable(name: "_PyGC_generation0", scope: !0, file: !1, line: 55, type: !352, isLocal: false, isDefinition: true, variable: %union._gc_head** @_PyGC_generation0)
!898 = !DIGlobalVariable(name: "debug", scope: !0, file: !1, line: 168, type: !44, isLocal: true, isDefinition: true, variable: i32* @debug)
!899 = !DIGlobalVariable(name: "generations", scope: !0, file: !1, line: 48, type: !900, isLocal: true, isDefinition: true, variable: [3 x %struct.gc_generation]* @generations)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 768, align: 64, elements: !573)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "gc_generation", file: !1, line: 37, size: 256, align: 64, elements: !902)
!902 = !{!903, !904, !905}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !901, file: !1, line: 38, baseType: !353, size: 192, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !901, file: !1, line: 39, baseType: !44, size: 32, align: 32, offset: 192)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !901, file: !1, line: 40, baseType: !44, size: 32, align: 32, offset: 224)
!906 = !DIGlobalVariable(name: "gcmodule", scope: !0, file: !1, line: 1544, type: !907, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @gcmodule)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !908, line: 47, size: 832, align: 64, elements: !909)
!908 = !DIFile(filename: "Include/moduleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!909 = !{!910, !919, !920, !921, !922, !925, !926, !927, !928}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !907, file: !908, line: 48, baseType: !911, size: 320, align: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !908, line: 38, baseType: !912)
!912 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !908, line: 33, size: 320, align: 64, elements: !913)
!913 = !{!914, !915, !917, !918}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !912, file: !908, line: 34, baseType: !6, size: 128, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !912, file: !908, line: 35, baseType: !916, size: 64, align: 64, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !912, file: !908, line: 36, baseType: !11, size: 64, align: 64, offset: 192)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !912, file: !908, line: 37, baseType: !5, size: 64, align: 64, offset: 256)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !907, file: !908, line: 49, baseType: !29, size: 64, align: 64, offset: 320)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !907, file: !908, line: 50, baseType: !29, size: 64, align: 64, offset: 384)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !907, file: !908, line: 51, baseType: !11, size: 64, align: 64, offset: 448)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !907, file: !908, line: 52, baseType: !923, size: 64, align: 64, offset: 512)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
