; ModuleID = 'genobject.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !11, subprograms: !519, globals: !832)
!1 = !DIFile(filename: "Objects/genobject.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !4, line: 23, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!7 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!8 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!9 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!10 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!11 = !{!12, !103, !51, !426, !439, !108, !453, !390, !509, !372, !517}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGenObject", file: !14, line: 28, baseType: !15)
!14 = !DIFile(filename: "Include/genobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!15 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 13, size: 384, align: 64, elements: !16)
!16 = !{!17, !364, !423, !424, !425}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !15, file: !14, line: 14, baseType: !18, size: 128, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !19, line: 109, baseType: !20)
!19 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !19, line: 105, size: 128, align: 64, elements: !21)
!21 = !{!22, !30}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !20, file: !19, line: 107, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !24, line: 177, baseType: !25)
!24 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !26, line: 102, baseType: !27)
!26 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !28, line: 181, baseType: !29)
!28 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!29 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !20, file: !19, line: 108, baseType: !31, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !19, line: 334, size: 3200, align: 64, elements: !33)
!33 = !{!34, !40, !44, !45, !46, !52, !116, !121, !126, !127, !132, !184, !215, !227, !233, !234, !235, !237, !239, !270, !271, !272, !281, !282, !287, !288, !290, !292, !302, !312, !330, !331, !332, !334, !336, !337, !339, !344, !349, !354, !355, !356, !357, !358, !359, !360, !361, !363}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !32, file: !19, line: 335, baseType: !35, size: 192, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !19, line: 114, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 111, size: 192, align: 64, elements: !37)
!37 = !{!38, !39}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !36, file: !19, line: 112, baseType: !18, size: 128, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !36, file: !19, line: 113, baseType: !23, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !32, file: !19, line: 336, baseType: !41, size: 64, align: 64, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!43 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !32, file: !19, line: 337, baseType: !23, size: 64, align: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !32, file: !19, line: 337, baseType: !23, size: 64, align: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !32, file: !19, line: 341, baseType: !47, size: 64, align: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !19, line: 308, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !51}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !32, file: !19, line: 342, baseType: !53, size: 64, align: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !19, line: 314, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !51, !58, !57}
!57 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !26, line: 48, baseType: !60)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 246, size: 1728, align: 64, elements: !62)
!61 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!62 = !{!63, !64, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !84, !85, !86, !87, !89, !91, !93, !97, !100, !102, !104, !105, !106, !107, !111, !112}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !60, file: !61, line: 247, baseType: !57, size: 32, align: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !60, file: !61, line: 252, baseType: !65, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !60, file: !61, line: 253, baseType: !65, size: 64, align: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !60, file: !61, line: 254, baseType: !65, size: 64, align: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !60, file: !61, line: 255, baseType: !65, size: 64, align: 64, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !60, file: !61, line: 256, baseType: !65, size: 64, align: 64, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !60, file: !61, line: 257, baseType: !65, size: 64, align: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !60, file: !61, line: 258, baseType: !65, size: 64, align: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !60, file: !61, line: 259, baseType: !65, size: 64, align: 64, offset: 512)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !60, file: !61, line: 261, baseType: !65, size: 64, align: 64, offset: 576)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !60, file: !61, line: 262, baseType: !65, size: 64, align: 64, offset: 640)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !60, file: !61, line: 263, baseType: !65, size: 64, align: 64, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !60, file: !61, line: 265, baseType: !77, size: 64, align: 64, offset: 768)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !61, line: 161, size: 192, align: 64, elements: !79)
!79 = !{!80, !81, !83}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !78, file: !61, line: 162, baseType: !77, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !78, file: !61, line: 163, baseType: !82, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !78, file: !61, line: 167, baseType: !57, size: 32, align: 32, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !60, file: !61, line: 267, baseType: !82, size: 64, align: 64, offset: 832)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !60, file: !61, line: 269, baseType: !57, size: 32, align: 32, offset: 896)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !60, file: !61, line: 273, baseType: !57, size: 32, align: 32, offset: 928)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !60, file: !61, line: 275, baseType: !88, size: 64, align: 64, offset: 960)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !28, line: 140, baseType: !29)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !60, file: !61, line: 279, baseType: !90, size: 16, align: 16, offset: 1024)
!90 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !60, file: !61, line: 280, baseType: !92, size: 8, align: 8, offset: 1040)
!92 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !60, file: !61, line: 281, baseType: !94, size: 8, align: 8, offset: 1048)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, align: 8, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 1)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !60, file: !61, line: 285, baseType: !98, size: 64, align: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !61, line: 155, baseType: null)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !60, file: !61, line: 294, baseType: !101, size: 64, align: 64, offset: 1152)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !28, line: 141, baseType: !29)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !60, file: !61, line: 303, baseType: !103, size: 64, align: 64, offset: 1216)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !60, file: !61, line: 304, baseType: !103, size: 64, align: 64, offset: 1280)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !60, file: !61, line: 305, baseType: !103, size: 64, align: 64, offset: 1344)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !60, file: !61, line: 306, baseType: !103, size: 64, align: 64, offset: 1408)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !60, file: !61, line: 307, baseType: !108, size: 64, align: 64, offset: 1472)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !109, line: 62, baseType: !110)
!109 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!110 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !60, file: !61, line: 309, baseType: !57, size: 32, align: 32, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !60, file: !61, line: 311, baseType: !113, size: 160, align: 8, offset: 1568)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, align: 8, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 20)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !32, file: !19, line: 343, baseType: !117, size: 64, align: 64, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !19, line: 316, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!51, !51, !65}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !32, file: !19, line: 344, baseType: !122, size: 64, align: 64, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !19, line: 318, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!57, !51, !65, !51}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !32, file: !19, line: 345, baseType: !103, size: 64, align: 64, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !32, file: !19, line: 346, baseType: !128, size: 64, align: 64, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !19, line: 320, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!51, !51}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !32, file: !19, line: 350, baseType: !133, size: 64, align: 64, offset: 768)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !19, line: 278, baseType: !135)
!135 = !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 236, size: 2176, align: 64, elements: !136)
!136 = !{!137, !142, !143, !144, !145, !146, !151, !153, !154, !155, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !135, file: !19, line: 241, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !19, line: 166, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!51, !51, !51}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !135, file: !19, line: 242, baseType: !138, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !135, file: !19, line: 243, baseType: !138, size: 64, align: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !135, file: !19, line: 244, baseType: !138, size: 64, align: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !135, file: !19, line: 245, baseType: !138, size: 64, align: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !135, file: !19, line: 246, baseType: !147, size: 64, align: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !19, line: 167, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!51, !51, !51, !51}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !135, file: !19, line: 247, baseType: !152, size: 64, align: 64, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !19, line: 165, baseType: !129)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !135, file: !19, line: 248, baseType: !152, size: 64, align: 64, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !135, file: !19, line: 249, baseType: !152, size: 64, align: 64, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !135, file: !19, line: 250, baseType: !156, size: 64, align: 64, offset: 576)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !19, line: 168, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!57, !51}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !135, file: !19, line: 251, baseType: !152, size: 64, align: 64, offset: 640)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !135, file: !19, line: 252, baseType: !138, size: 64, align: 64, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !135, file: !19, line: 253, baseType: !138, size: 64, align: 64, offset: 768)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !135, file: !19, line: 254, baseType: !138, size: 64, align: 64, offset: 832)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !135, file: !19, line: 255, baseType: !138, size: 64, align: 64, offset: 896)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !135, file: !19, line: 256, baseType: !138, size: 64, align: 64, offset: 960)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !135, file: !19, line: 257, baseType: !152, size: 64, align: 64, offset: 1024)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !135, file: !19, line: 258, baseType: !103, size: 64, align: 64, offset: 1088)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !135, file: !19, line: 259, baseType: !152, size: 64, align: 64, offset: 1152)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !135, file: !19, line: 261, baseType: !138, size: 64, align: 64, offset: 1216)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !135, file: !19, line: 262, baseType: !138, size: 64, align: 64, offset: 1280)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !135, file: !19, line: 263, baseType: !138, size: 64, align: 64, offset: 1344)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !135, file: !19, line: 264, baseType: !138, size: 64, align: 64, offset: 1408)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !135, file: !19, line: 265, baseType: !147, size: 64, align: 64, offset: 1472)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !135, file: !19, line: 266, baseType: !138, size: 64, align: 64, offset: 1536)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !135, file: !19, line: 267, baseType: !138, size: 64, align: 64, offset: 1600)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !135, file: !19, line: 268, baseType: !138, size: 64, align: 64, offset: 1664)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !135, file: !19, line: 269, baseType: !138, size: 64, align: 64, offset: 1728)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !135, file: !19, line: 270, baseType: !138, size: 64, align: 64, offset: 1792)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !135, file: !19, line: 272, baseType: !138, size: 64, align: 64, offset: 1856)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !135, file: !19, line: 273, baseType: !138, size: 64, align: 64, offset: 1920)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !135, file: !19, line: 274, baseType: !138, size: 64, align: 64, offset: 1984)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !135, file: !19, line: 275, baseType: !138, size: 64, align: 64, offset: 2048)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !135, file: !19, line: 277, baseType: !152, size: 64, align: 64, offset: 2112)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !32, file: !19, line: 351, baseType: !185, size: 64, align: 64, offset: 832)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !19, line: 292, baseType: !187)
!187 = !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 280, size: 640, align: 64, elements: !188)
!188 = !{!189, !194, !195, !200, !201, !202, !207, !208, !213, !214}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !187, file: !19, line: 281, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !19, line: 169, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!23, !51}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !187, file: !19, line: 282, baseType: !138, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !187, file: !19, line: 283, baseType: !196, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !19, line: 170, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!51, !51, !23}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !187, file: !19, line: 284, baseType: !196, size: 64, align: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !187, file: !19, line: 285, baseType: !103, size: 64, align: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !187, file: !19, line: 286, baseType: !203, size: 64, align: 64, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !19, line: 172, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!57, !51, !23, !51}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !187, file: !19, line: 287, baseType: !103, size: 64, align: 64, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !187, file: !19, line: 288, baseType: !209, size: 64, align: 64, offset: 448)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !19, line: 231, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!57, !51, !51}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !187, file: !19, line: 290, baseType: !138, size: 64, align: 64, offset: 512)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !187, file: !19, line: 291, baseType: !196, size: 64, align: 64, offset: 576)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !32, file: !19, line: 352, baseType: !216, size: 64, align: 64, offset: 896)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !19, line: 298, baseType: !218)
!218 = !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 294, size: 192, align: 64, elements: !219)
!219 = !{!220, !221, !222}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !218, file: !19, line: 295, baseType: !190, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !218, file: !19, line: 296, baseType: !138, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !218, file: !19, line: 297, baseType: !223, size: 64, align: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !19, line: 174, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!57, !51, !51, !51}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !32, file: !19, line: 356, baseType: !228, size: 64, align: 64, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !19, line: 321, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!232, !51}
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !24, line: 186, baseType: !23)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !32, file: !19, line: 357, baseType: !147, size: 64, align: 64, offset: 1024)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !32, file: !19, line: 358, baseType: !128, size: 64, align: 64, offset: 1088)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !32, file: !19, line: 359, baseType: !236, size: 64, align: 64, offset: 1152)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !19, line: 317, baseType: !139)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !32, file: !19, line: 360, baseType: !238, size: 64, align: 64, offset: 1216)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !19, line: 319, baseType: !224)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !32, file: !19, line: 363, baseType: !240, size: 64, align: 64, offset: 1280)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !19, line: 304, baseType: !242)
!242 = !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 301, size: 128, align: 64, elements: !243)
!243 = !{!244, !265}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !242, file: !19, line: 302, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !19, line: 193, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!57, !51, !249, !57}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !19, line: 191, baseType: !251)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !19, line: 178, size: 640, align: 64, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260, !262, !263, !264}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !251, file: !19, line: 179, baseType: !103, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !251, file: !19, line: 180, baseType: !51, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !251, file: !19, line: 181, baseType: !23, size: 64, align: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !251, file: !19, line: 182, baseType: !23, size: 64, align: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !251, file: !19, line: 184, baseType: !57, size: 32, align: 32, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !251, file: !19, line: 185, baseType: !57, size: 32, align: 32, offset: 288)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !251, file: !19, line: 186, baseType: !65, size: 64, align: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !251, file: !19, line: 187, baseType: !261, size: 64, align: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !251, file: !19, line: 188, baseType: !261, size: 64, align: 64, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !251, file: !19, line: 189, baseType: !261, size: 64, align: 64, offset: 512)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !251, file: !19, line: 190, baseType: !103, size: 64, align: 64, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !242, file: !19, line: 303, baseType: !266, size: 64, align: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !19, line: 194, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !51, !249}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !32, file: !19, line: 366, baseType: !110, size: 64, align: 64, offset: 1344)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !32, file: !19, line: 368, baseType: !41, size: 64, align: 64, offset: 1408)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !32, file: !19, line: 372, baseType: !273, size: 64, align: 64, offset: 1472)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !19, line: 233, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!57, !51, !277, !103}
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !19, line: 232, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!57, !51, !103}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !32, file: !19, line: 375, baseType: !156, size: 64, align: 64, offset: 1536)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !32, file: !19, line: 379, baseType: !283, size: 64, align: 64, offset: 1600)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !19, line: 322, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!51, !51, !51, !57}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !32, file: !19, line: 382, baseType: !23, size: 64, align: 64, offset: 1664)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !32, file: !19, line: 385, baseType: !289, size: 64, align: 64, offset: 1728)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !19, line: 323, baseType: !129)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !32, file: !19, line: 386, baseType: !291, size: 64, align: 64, offset: 1792)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !19, line: 324, baseType: !129)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !32, file: !19, line: 389, baseType: !293, size: 64, align: 64, offset: 1856)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !295, line: 40, size: 256, align: 64, elements: !296)
!295 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!296 = !{!297, !298, !300, !301}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !294, file: !295, line: 41, baseType: !41, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !294, file: !295, line: 42, baseType: !299, size: 64, align: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !295, line: 18, baseType: !139)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !294, file: !295, line: 43, baseType: !57, size: 32, align: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !294, file: !295, line: 45, baseType: !41, size: 64, align: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !32, file: !19, line: 390, baseType: !303, size: 64, align: 64, offset: 1920)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !305, line: 18, size: 320, align: 64, elements: !306)
!305 = !DIFile(filename: "Include/structmember.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!306 = !{!307, !308, !309, !310, !311}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !304, file: !305, line: 19, baseType: !65, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !304, file: !305, line: 20, baseType: !57, size: 32, align: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !304, file: !305, line: 21, baseType: !23, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !304, file: !305, line: 22, baseType: !57, size: 32, align: 32, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !304, file: !305, line: 23, baseType: !65, size: 64, align: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !32, file: !19, line: 391, baseType: !313, size: 64, align: 64, offset: 1984)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !315, line: 11, size: 320, align: 64, elements: !316)
!315 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!316 = !{!317, !318, !323, !328, !329}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !314, file: !315, line: 12, baseType: !65, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !314, file: !315, line: 13, baseType: !319, size: 64, align: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !315, line: 8, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!51, !51, !103}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !314, file: !315, line: 14, baseType: !324, size: 64, align: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !315, line: 9, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!57, !51, !51, !103}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !314, file: !315, line: 15, baseType: !65, size: 64, align: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !314, file: !315, line: 16, baseType: !103, size: 64, align: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !32, file: !19, line: 392, baseType: !31, size: 64, align: 64, offset: 2048)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !32, file: !19, line: 393, baseType: !51, size: 64, align: 64, offset: 2112)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !32, file: !19, line: 394, baseType: !333, size: 64, align: 64, offset: 2176)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !19, line: 325, baseType: !148)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !32, file: !19, line: 395, baseType: !335, size: 64, align: 64, offset: 2240)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !19, line: 326, baseType: !224)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !32, file: !19, line: 396, baseType: !23, size: 64, align: 64, offset: 2304)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !32, file: !19, line: 397, baseType: !338, size: 64, align: 64, offset: 2368)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !19, line: 327, baseType: !224)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !32, file: !19, line: 398, baseType: !340, size: 64, align: 64, offset: 2432)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !19, line: 329, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!51, !31, !23}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !32, file: !19, line: 399, baseType: !345, size: 64, align: 64, offset: 2496)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !19, line: 328, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!51, !31, !51, !51}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !32, file: !19, line: 400, baseType: !350, size: 64, align: 64, offset: 2560)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !19, line: 307, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !103}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !32, file: !19, line: 401, baseType: !156, size: 64, align: 64, offset: 2624)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !32, file: !19, line: 402, baseType: !51, size: 64, align: 64, offset: 2688)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !32, file: !19, line: 403, baseType: !51, size: 64, align: 64, offset: 2752)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !32, file: !19, line: 404, baseType: !51, size: 64, align: 64, offset: 2816)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !32, file: !19, line: 405, baseType: !51, size: 64, align: 64, offset: 2880)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !32, file: !19, line: 406, baseType: !51, size: 64, align: 64, offset: 2944)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !32, file: !19, line: 407, baseType: !47, size: 64, align: 64, offset: 3008)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !32, file: !19, line: 410, baseType: !362, size: 32, align: 32, offset: 3072)
!362 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !32, file: !19, line: 412, baseType: !47, size: 64, align: 64, offset: 3136)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "gi_frame", scope: !15, file: !14, line: 18, baseType: !365, size: 64, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !367, line: 17, size: 3072, align: 64, elements: !368)
!367 = !DIFile(filename: "Include/frameobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!368 = !{!369, !370, !371, !398, !399, !400, !401, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !421}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !366, file: !367, line: 18, baseType: !35, size: 192, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "f_back", scope: !366, file: !367, line: 19, baseType: !365, size: 64, align: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "f_code", scope: !366, file: !367, line: 20, baseType: !372, size: 64, align: 64, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !374, line: 33, baseType: !375)
!374 = !DIFile(filename: "Include/code.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!375 = !DICompositeType(tag: DW_TAG_structure_type, file: !374, line: 11, size: 1152, align: 64, elements: !376)
!376 = !{!377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !392, !393, !394, !395, !396, !397}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !375, file: !374, line: 12, baseType: !18, size: 128, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !375, file: !374, line: 13, baseType: !57, size: 32, align: 32, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !375, file: !374, line: 14, baseType: !57, size: 32, align: 32, offset: 160)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !375, file: !374, line: 15, baseType: !57, size: 32, align: 32, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !375, file: !374, line: 16, baseType: !57, size: 32, align: 32, offset: 224)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !375, file: !374, line: 17, baseType: !57, size: 32, align: 32, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "co_code", scope: !375, file: !374, line: 18, baseType: !51, size: 64, align: 64, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !375, file: !374, line: 19, baseType: !51, size: 64, align: 64, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !375, file: !374, line: 20, baseType: !51, size: 64, align: 64, offset: 448)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "co_varnames", scope: !375, file: !374, line: 21, baseType: !51, size: 64, align: 64, offset: 512)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "co_freevars", scope: !375, file: !374, line: 22, baseType: !51, size: 64, align: 64, offset: 576)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "co_cellvars", scope: !375, file: !374, line: 23, baseType: !51, size: 64, align: 64, offset: 640)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "co_cell2arg", scope: !375, file: !374, line: 25, baseType: !390, size: 64, align: 64, offset: 704)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !375, file: !374, line: 26, baseType: !51, size: 64, align: 64, offset: 768)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !375, file: !374, line: 27, baseType: !51, size: 64, align: 64, offset: 832)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !375, file: !374, line: 28, baseType: !57, size: 32, align: 32, offset: 896)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "co_lnotab", scope: !375, file: !374, line: 29, baseType: !51, size: 64, align: 64, offset: 960)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "co_zombieframe", scope: !375, file: !374, line: 31, baseType: !103, size: 64, align: 64, offset: 1024)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !375, file: !374, line: 32, baseType: !51, size: 64, align: 64, offset: 1088)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "f_builtins", scope: !366, file: !367, line: 21, baseType: !51, size: 64, align: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "f_globals", scope: !366, file: !367, line: 22, baseType: !51, size: 64, align: 64, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "f_locals", scope: !366, file: !367, line: 23, baseType: !51, size: 64, align: 64, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "f_valuestack", scope: !366, file: !367, line: 24, baseType: !402, size: 64, align: 64, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "f_stacktop", scope: !366, file: !367, line: 28, baseType: !402, size: 64, align: 64, offset: 576)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "f_trace", scope: !366, file: !367, line: 29, baseType: !51, size: 64, align: 64, offset: 640)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_type", scope: !366, file: !367, line: 38, baseType: !51, size: 64, align: 64, offset: 704)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_value", scope: !366, file: !367, line: 38, baseType: !51, size: 64, align: 64, offset: 768)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_traceback", scope: !366, file: !367, line: 38, baseType: !51, size: 64, align: 64, offset: 832)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "f_gen", scope: !366, file: !367, line: 40, baseType: !51, size: 64, align: 64, offset: 896)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "f_lasti", scope: !366, file: !367, line: 42, baseType: !57, size: 32, align: 32, offset: 960)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "f_lineno", scope: !366, file: !367, line: 48, baseType: !57, size: 32, align: 32, offset: 992)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "f_iblock", scope: !366, file: !367, line: 49, baseType: !57, size: 32, align: 32, offset: 1024)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "f_executing", scope: !366, file: !367, line: 50, baseType: !43, size: 8, align: 8, offset: 1056)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "f_blockstack", scope: !366, file: !367, line: 51, baseType: !414, size: 1920, align: 32, offset: 1088)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 1920, align: 32, elements: !114)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTryBlock", file: !367, line: 15, baseType: !416)
!416 = !DICompositeType(tag: DW_TAG_structure_type, file: !367, line: 11, size: 96, align: 32, elements: !417)
!417 = !{!418, !419, !420}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "b_type", scope: !416, file: !367, line: 12, baseType: !57, size: 32, align: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "b_handler", scope: !416, file: !367, line: 13, baseType: !57, size: 32, align: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "b_level", scope: !416, file: !367, line: 14, baseType: !57, size: 32, align: 32, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "f_localsplus", scope: !366, file: !367, line: 52, baseType: !422, size: 64, align: 64, offset: 3008)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 64, align: 64, elements: !95)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "gi_running", scope: !15, file: !14, line: 21, baseType: !43, size: 8, align: 8, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "gi_code", scope: !15, file: !14, line: 24, baseType: !51, size: 64, align: 64, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "gi_weakreflist", scope: !15, file: !14, line: 27, baseType: !51, size: 64, align: 64, offset: 320)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStopIterationObject", file: !428, line: 66, baseType: !429)
!428 = !DIFile(filename: "Include/pyerrors.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!429 = !DICompositeType(tag: DW_TAG_structure_type, file: !428, line: 63, size: 576, align: 64, elements: !430)
!430 = !{!431, !432, !433, !434, !435, !436, !437, !438}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !429, file: !428, line: 64, baseType: !18, size: 128, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !429, file: !428, line: 64, baseType: !51, size: 64, align: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !429, file: !428, line: 64, baseType: !51, size: 64, align: 64, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !429, file: !428, line: 64, baseType: !51, size: 64, align: 64, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !429, file: !428, line: 64, baseType: !51, size: 64, align: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !429, file: !428, line: 64, baseType: !51, size: 64, align: 64, offset: 384)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !429, file: !428, line: 64, baseType: !43, size: 8, align: 8, offset: 448)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !429, file: !428, line: 65, baseType: !51, size: 64, align: 64, offset: 512)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !441, line: 253, baseType: !442)
!441 = !DIFile(filename: "Include/objimpl.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!442 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !441, line: 246, size: 192, align: 64, elements: !443)
!443 = !{!444, !451}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !442, file: !441, line: 251, baseType: !445, size: 192, align: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, scope: !442, file: !441, line: 247, size: 192, align: 64, elements: !446)
!446 = !{!447, !449, !450}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !445, file: !441, line: 248, baseType: !448, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !445, file: !441, line: 249, baseType: !448, size: 64, align: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !445, file: !441, line: 250, baseType: !23, size: 64, align: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !442, file: !441, line: 252, baseType: !452, size: 64, align: 64)
!452 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !455, line: 139, baseType: !456)
!455 = !DIFile(filename: "Include/pystate.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !455, line: 69, size: 1536, align: 64, elements: !457)
!457 = !{!458, !460, !461, !481, !482, !483, !484, !485, !486, !487, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !456, file: !455, line: 72, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !456, file: !455, line: 73, baseType: !459, size: 64, align: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !456, file: !455, line: 74, baseType: !462, size: 64, align: 64, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !455, line: 44, baseType: !464)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !455, line: 19, size: 832, align: 64, elements: !465)
!465 = !{!466, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !464, file: !455, line: 21, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !464, file: !455, line: 22, baseType: !459, size: 64, align: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !464, file: !455, line: 24, baseType: !51, size: 64, align: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !464, file: !455, line: 25, baseType: !51, size: 64, align: 64, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !464, file: !455, line: 26, baseType: !51, size: 64, align: 64, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !464, file: !455, line: 27, baseType: !51, size: 64, align: 64, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !464, file: !455, line: 28, baseType: !51, size: 64, align: 64, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !464, file: !455, line: 30, baseType: !51, size: 64, align: 64, offset: 448)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !464, file: !455, line: 31, baseType: !51, size: 64, align: 64, offset: 512)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !464, file: !455, line: 32, baseType: !51, size: 64, align: 64, offset: 576)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !464, file: !455, line: 33, baseType: !57, size: 32, align: 32, offset: 640)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !464, file: !455, line: 34, baseType: !57, size: 32, align: 32, offset: 672)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !464, file: !455, line: 37, baseType: !57, size: 32, align: 32, offset: 704)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !464, file: !455, line: 43, baseType: !51, size: 64, align: 64, offset: 768)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !456, file: !455, line: 76, baseType: !365, size: 64, align: 64, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !456, file: !455, line: 77, baseType: !57, size: 32, align: 32, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !456, file: !455, line: 78, baseType: !43, size: 8, align: 8, offset: 288)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !456, file: !455, line: 80, baseType: !43, size: 8, align: 8, offset: 296)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !456, file: !455, line: 85, baseType: !57, size: 32, align: 32, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !456, file: !455, line: 86, baseType: !57, size: 32, align: 32, offset: 352)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !456, file: !455, line: 88, baseType: !488, size: 64, align: 64, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !455, line: 54, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!57, !51, !365, !57, !51}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !456, file: !455, line: 89, baseType: !488, size: 64, align: 64, offset: 448)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !456, file: !455, line: 90, baseType: !51, size: 64, align: 64, offset: 512)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !456, file: !455, line: 91, baseType: !51, size: 64, align: 64, offset: 576)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !456, file: !455, line: 93, baseType: !51, size: 64, align: 64, offset: 640)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !456, file: !455, line: 94, baseType: !51, size: 64, align: 64, offset: 704)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !456, file: !455, line: 95, baseType: !51, size: 64, align: 64, offset: 768)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !456, file: !455, line: 97, baseType: !51, size: 64, align: 64, offset: 832)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !456, file: !455, line: 98, baseType: !51, size: 64, align: 64, offset: 896)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !456, file: !455, line: 99, baseType: !51, size: 64, align: 64, offset: 960)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !456, file: !455, line: 101, baseType: !51, size: 64, align: 64, offset: 1024)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !456, file: !455, line: 103, baseType: !57, size: 32, align: 32, offset: 1088)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !456, file: !455, line: 105, baseType: !51, size: 64, align: 64, offset: 1152)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !456, file: !455, line: 106, baseType: !29, size: 64, align: 64, offset: 1216)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !456, file: !455, line: 108, baseType: !57, size: 32, align: 32, offset: 1280)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !456, file: !455, line: 109, baseType: !51, size: 64, align: 64, offset: 1344)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !456, file: !455, line: 134, baseType: !351, size: 64, align: 64, offset: 1408)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !456, file: !455, line: 135, baseType: !103, size: 64, align: 64, offset: 1472)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !511, line: 41, baseType: !512)
!511 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!512 = !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 31, size: 320, align: 64, elements: !513)
!513 = !{!514, !515, !516}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !512, file: !511, line: 32, baseType: !35, size: 192, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !512, file: !511, line: 33, baseType: !232, size: 64, align: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !512, file: !511, line: 34, baseType: !94, size: 8, align: 8, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !19, line: 422, baseType: !32)
!519 = !{!520, !531, !537, !562, !576, !583, !651, !660, !665, !668, !683, !694, !710, !734, !737, !752, !762, !828}
!520 = !DISubprogram(name: "_PyGen_Finalize", scope: !1, file: !1, line: 19, type: !49, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @_PyGen_Finalize, variables: !521)
!521 = !{!522, !523, !524, !525, !526, !527, !528}
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !520, file: !1, line: 19, type: !51)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gen", scope: !520, file: !1, line: 21, type: !12)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !520, file: !1, line: 22, type: !51)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error_type", scope: !520, file: !1, line: 23, type: !51)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error_value", scope: !520, file: !1, line: 23, type: !51)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error_traceback", scope: !520, file: !1, line: 23, type: !51)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !529, file: !1, line: 37, type: !51)
!529 = distinct !DILexicalBlock(scope: !530, file: !1, line: 37, column: 9)
!530 = distinct !DILexicalBlock(scope: !520, file: !1, line: 34, column: 9)
!531 = !DISubprogram(name: "_PyGen_Send", scope: !1, file: !1, line: 156, type: !532, isLocal: false, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyGenObject*, %struct._object*)* @_PyGen_Send, variables: !534)
!532 = !DISubroutineType(types: !533)
!533 = !{!51, !12, !51}
!534 = !{!535, !536}
!535 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gen", arg: 1, scope: !531, file: !1, line: 156, type: !12)
!536 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !531, file: !1, line: 156, type: !51)
!537 = !DISubprogram(name: "_PyGen_FetchStopIterationValue", scope: !1, file: !1, line: 393, type: !538, isLocal: false, isDefinition: true, scopeLine: 393, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object**)* @_PyGen_FetchStopIterationValue, variables: !540)
!538 = !DISubroutineType(types: !539)
!539 = !{!57, !402}
!540 = !{!541, !542, !543, !544, !545, !546, !550, !553, !555, !558}
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pvalue", arg: 1, scope: !537, file: !1, line: 393, type: !402)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "et", scope: !537, file: !1, line: 394, type: !51)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ev", scope: !537, file: !1, line: 394, type: !51)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !537, file: !1, line: 394, type: !51)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !537, file: !1, line: 395, type: !51)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !547, file: !1, line: 399, type: !51)
!547 = distinct !DILexicalBlock(scope: !548, file: !1, line: 399, column: 9)
!548 = distinct !DILexicalBlock(scope: !549, file: !1, line: 397, column: 54)
!549 = distinct !DILexicalBlock(scope: !537, file: !1, line: 397, column: 9)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !551, file: !1, line: 399, type: !51)
!551 = distinct !DILexicalBlock(scope: !552, file: !1, line: 399, column: 9)
!552 = distinct !DILexicalBlock(scope: !547, file: !1, line: 399, column: 9)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !554, file: !1, line: 400, type: !51)
!554 = distinct !DILexicalBlock(scope: !548, file: !1, line: 400, column: 9)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !556, file: !1, line: 400, type: !51)
!556 = distinct !DILexicalBlock(scope: !557, file: !1, line: 400, column: 9)
!557 = distinct !DILexicalBlock(scope: !554, file: !1, line: 400, column: 9)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !559, file: !1, line: 404, type: !51)
!559 = distinct !DILexicalBlock(scope: !560, file: !1, line: 404, column: 13)
!560 = distinct !DILexicalBlock(scope: !561, file: !1, line: 401, column: 17)
!561 = distinct !DILexicalBlock(scope: !548, file: !1, line: 401, column: 13)
!562 = !DISubprogram(name: "PyGen_New", scope: !1, file: !1, line: 513, type: !563, isLocal: false, isDefinition: true, scopeLine: 514, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._frame*)* @PyGen_New, variables: !567)
!563 = !DISubroutineType(types: !564)
!564 = !{!51, !565}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFrameObject", file: !367, line: 53, baseType: !366)
!567 = !{!568, !569, !570, !574}
!568 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !562, file: !1, line: 513, type: !565)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gen", scope: !562, file: !1, line: 515, type: !12)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !571, file: !1, line: 517, type: !51)
!571 = distinct !DILexicalBlock(scope: !572, file: !1, line: 517, column: 9)
!572 = distinct !DILexicalBlock(scope: !573, file: !1, line: 516, column: 22)
!573 = distinct !DILexicalBlock(scope: !562, file: !1, line: 516, column: 9)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !575, file: !1, line: 526, type: !439)
!575 = distinct !DILexicalBlock(scope: !562, file: !1, line: 526, column: 5)
!576 = !DISubprogram(name: "PyGen_NeedsFinalizing", scope: !1, file: !1, line: 531, type: !577, isLocal: false, isDefinition: true, scopeLine: 532, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyGenObject*)* @PyGen_NeedsFinalizing, variables: !579)
!577 = !DISubroutineType(types: !578)
!578 = !{!57, !12}
!579 = !{!580, !581, !582}
!580 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gen", arg: 1, scope: !576, file: !1, line: 531, type: !12)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !576, file: !1, line: 533, type: !57)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !576, file: !1, line: 534, type: !565)
!583 = !DISubprogram(name: "gen_send_ex", scope: !1, file: !1, line: 65, type: !584, isLocal: true, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyGenObject*, %struct._object*, i32)* @gen_send_ex, variables: !586)
!584 = !DISubroutineType(types: !585)
!585 = !{!51, !12, !51, !57}
!586 = !{!587, !588, !589, !590, !591, !598, !599, !602, !604, !605, !606, !608, !610, !614, !619, !623, !625, !629, !632, !633, !634, !636, !639, !641, !644, !646, !649}
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gen", arg: 1, scope: !583, file: !1, line: 65, type: !12)
!588 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !583, file: !1, line: 65, type: !51)
!589 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 3, scope: !583, file: !1, line: 65, type: !57)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !583, file: !1, line: 67, type: !453)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !592, file: !1, line: 67, type: !593)
!592 = distinct !DILexicalBlock(scope: !583, file: !1, line: 67, column: 29)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !4, line: 33, baseType: !595)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !4, line: 31, size: 64, align: 64, elements: !596)
!596 = !{!597}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !595, file: !4, line: 32, baseType: !103, size: 64, align: 64)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !592, file: !1, line: 67, type: !103)
!599 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !592, file: !1, line: 67, type: !600)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64, align: 64)
!601 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !592, file: !1, line: 67, type: !603)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !4, line: 29, baseType: !3)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !583, file: !1, line: 68, type: !565)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !583, file: !1, line: 69, type: !51)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !607, file: !1, line: 99, type: !51)
!607 = distinct !DILexicalBlock(scope: !583, file: !1, line: 99, column: 5)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !609, file: !1, line: 111, type: !51)
!609 = distinct !DILexicalBlock(scope: !583, file: !1, line: 111, column: 5)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !611, file: !1, line: 111, type: !51)
!611 = distinct !DILexicalBlock(scope: !612, file: !1, line: 111, column: 5)
!612 = distinct !DILexicalBlock(scope: !613, file: !1, line: 111, column: 5)
!613 = distinct !DILexicalBlock(scope: !609, file: !1, line: 111, column: 5)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !615, file: !1, line: 120, type: !51)
!615 = distinct !DILexicalBlock(scope: !616, file: !1, line: 119, column: 16)
!616 = distinct !DILexicalBlock(scope: !617, file: !1, line: 116, column: 13)
!617 = distinct !DILexicalBlock(scope: !618, file: !1, line: 115, column: 42)
!618 = distinct !DILexicalBlock(scope: !583, file: !1, line: 115, column: 9)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !620, file: !1, line: 124, type: !51)
!620 = distinct !DILexicalBlock(scope: !621, file: !1, line: 124, column: 17)
!621 = distinct !DILexicalBlock(scope: !622, file: !1, line: 122, column: 28)
!622 = distinct !DILexicalBlock(scope: !615, file: !1, line: 122, column: 17)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !624, file: !1, line: 127, type: !51)
!624 = distinct !DILexicalBlock(scope: !617, file: !1, line: 127, column: 9)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !626, file: !1, line: 127, type: !51)
!626 = distinct !DILexicalBlock(scope: !627, file: !1, line: 127, column: 9)
!627 = distinct !DILexicalBlock(scope: !628, file: !1, line: 127, column: 9)
!628 = distinct !DILexicalBlock(scope: !624, file: !1, line: 127, column: 9)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !630, file: !1, line: 133, type: !51)
!630 = distinct !DILexicalBlock(scope: !631, file: !1, line: 130, column: 43)
!631 = distinct !DILexicalBlock(scope: !583, file: !1, line: 130, column: 9)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !630, file: !1, line: 133, type: !51)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !630, file: !1, line: 133, type: !51)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !635, file: !1, line: 140, type: !51)
!635 = distinct !DILexicalBlock(scope: !630, file: !1, line: 140, column: 9)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !637, file: !1, line: 140, type: !51)
!637 = distinct !DILexicalBlock(scope: !638, file: !1, line: 140, column: 9)
!638 = distinct !DILexicalBlock(scope: !635, file: !1, line: 140, column: 9)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !640, file: !1, line: 141, type: !51)
!640 = distinct !DILexicalBlock(scope: !630, file: !1, line: 141, column: 9)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !642, file: !1, line: 141, type: !51)
!642 = distinct !DILexicalBlock(scope: !643, file: !1, line: 141, column: 9)
!643 = distinct !DILexicalBlock(scope: !640, file: !1, line: 141, column: 9)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !645, file: !1, line: 142, type: !51)
!645 = distinct !DILexicalBlock(scope: !630, file: !1, line: 142, column: 9)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !647, file: !1, line: 142, type: !51)
!647 = distinct !DILexicalBlock(scope: !648, file: !1, line: 142, column: 9)
!648 = distinct !DILexicalBlock(scope: !645, file: !1, line: 142, column: 9)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !650, file: !1, line: 145, type: !51)
!650 = distinct !DILexicalBlock(scope: !630, file: !1, line: 145, column: 9)
!651 = !DISubprogram(name: "_Py_ANNOTATE_MEMORY_ORDER", scope: !4, file: !4, line: 59, type: !652, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, variables: !657)
!652 = !DISubroutineType(types: !653)
!653 = !{null, !654, !603}
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64, align: 64)
!655 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !656)
!656 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!657 = !{!658, !659}
!658 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "address", arg: 1, scope: !651, file: !4, line: 59, type: !654)
!659 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 2, scope: !651, file: !4, line: 59, type: !603)
!660 = !DISubprogram(name: "_Py_atomic_thread_fence", scope: !4, file: !4, line: 51, type: !661, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, variables: !663)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !603}
!663 = !{!664}
!664 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !660, file: !4, line: 51, type: !603)
!665 = !DISubprogram(name: "_Py_atomic_signal_fence", scope: !4, file: !4, line: 44, type: !661, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, variables: !666)
!666 = !{!667}
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !665, file: !4, line: 44, type: !603)
!668 = !DISubprogram(name: "gen_close", scope: !1, file: !1, line: 216, type: !532, isLocal: true, isDefinition: true, scopeLine: 217, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyGenObject*, %struct._object*)* @gen_close, variables: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !679}
!670 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gen", arg: 1, scope: !668, file: !1, line: 216, type: !12)
!671 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !668, file: !1, line: 216, type: !51)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !668, file: !1, line: 218, type: !51)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yf", scope: !668, file: !1, line: 219, type: !51)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !668, file: !1, line: 220, type: !57)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !676, file: !1, line: 226, type: !51)
!676 = distinct !DILexicalBlock(scope: !677, file: !1, line: 226, column: 9)
!677 = distinct !DILexicalBlock(scope: !678, file: !1, line: 222, column: 13)
!678 = distinct !DILexicalBlock(scope: !668, file: !1, line: 222, column: 9)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !680, file: !1, line: 232, type: !51)
!680 = distinct !DILexicalBlock(scope: !681, file: !1, line: 232, column: 9)
!681 = distinct !DILexicalBlock(scope: !682, file: !1, line: 231, column: 17)
!682 = distinct !DILexicalBlock(scope: !668, file: !1, line: 231, column: 9)
!683 = !DISubprogram(name: "gen_yf", scope: !1, file: !1, line: 197, type: !684, isLocal: true, isDefinition: true, scopeLine: 198, flags: DIFlagPrototyped, isOptimized: true, variables: !686)
!684 = !DISubroutineType(types: !685)
!685 = !{!51, !12}
!686 = !{!687, !688, !689, !690, !693}
!687 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gen", arg: 1, scope: !683, file: !1, line: 197, type: !12)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yf", scope: !683, file: !1, line: 199, type: !51)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !683, file: !1, line: 200, type: !565)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytecode", scope: !691, file: !1, line: 203, type: !51)
!691 = distinct !DILexicalBlock(scope: !692, file: !1, line: 202, column: 29)
!692 = distinct !DILexicalBlock(scope: !683, file: !1, line: 202, column: 9)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !691, file: !1, line: 204, type: !390)
!694 = !DISubprogram(name: "gen_close_iter", scope: !1, file: !1, line: 170, type: !158, isLocal: true, isDefinition: true, scopeLine: 171, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @gen_close_iter, variables: !695)
!695 = !{!696, !697, !698, !701, !705, !707}
!696 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "yf", arg: 1, scope: !694, file: !1, line: 170, type: !51)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !694, file: !1, line: 172, type: !51)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "meth", scope: !699, file: !1, line: 180, type: !51)
!699 = distinct !DILexicalBlock(scope: !700, file: !1, line: 179, column: 12)
!700 = distinct !DILexicalBlock(scope: !694, file: !1, line: 175, column: 9)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !702, file: !1, line: 187, type: !51)
!702 = distinct !DILexicalBlock(scope: !703, file: !1, line: 187, column: 13)
!703 = distinct !DILexicalBlock(scope: !704, file: !1, line: 185, column: 16)
!704 = distinct !DILexicalBlock(scope: !699, file: !1, line: 181, column: 13)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !706, file: !1, line: 192, type: !51)
!706 = distinct !DILexicalBlock(scope: !694, file: !1, line: 192, column: 5)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !708, file: !1, line: 192, type: !51)
!708 = distinct !DILexicalBlock(scope: !709, file: !1, line: 192, column: 5)
!709 = distinct !DILexicalBlock(scope: !706, file: !1, line: 192, column: 5)
!710 = !DISubprogram(name: "gen_dealloc", scope: !1, file: !1, line: 44, type: !711, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyGenObject*)* @gen_dealloc, variables: !713)
!711 = !DISubroutineType(types: !712)
!712 = !{null, !12}
!713 = !{!714, !715, !716, !718, !720, !722, !724, !728, !730}
!714 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gen", arg: 1, scope: !710, file: !1, line: 44, type: !12)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !710, file: !1, line: 46, type: !51)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !717, file: !1, line: 48, type: !439)
!717 = distinct !DILexicalBlock(scope: !710, file: !1, line: 48, column: 5)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !719, file: !1, line: 53, type: !439)
!719 = distinct !DILexicalBlock(scope: !710, file: !1, line: 53, column: 5)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !721, file: !1, line: 58, type: !439)
!721 = distinct !DILexicalBlock(scope: !710, file: !1, line: 58, column: 5)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !723, file: !1, line: 59, type: !51)
!723 = distinct !DILexicalBlock(scope: !710, file: !1, line: 59, column: 5)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !725, file: !1, line: 59, type: !51)
!725 = distinct !DILexicalBlock(scope: !726, file: !1, line: 59, column: 5)
!726 = distinct !DILexicalBlock(scope: !727, file: !1, line: 59, column: 5)
!727 = distinct !DILexicalBlock(scope: !723, file: !1, line: 59, column: 5)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !729, file: !1, line: 60, type: !51)
!729 = distinct !DILexicalBlock(scope: !710, file: !1, line: 60, column: 5)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !731, file: !1, line: 60, type: !51)
!731 = distinct !DILexicalBlock(scope: !732, file: !1, line: 60, column: 5)
!732 = distinct !DILexicalBlock(scope: !733, file: !1, line: 60, column: 5)
!733 = distinct !DILexicalBlock(scope: !729, file: !1, line: 60, column: 5)
!734 = !DISubprogram(name: "gen_repr", scope: !1, file: !1, line: 418, type: !684, isLocal: true, isDefinition: true, scopeLine: 419, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyGenObject*)* @gen_repr, variables: !735)
!735 = !{!736}
!736 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gen", arg: 1, scope: !734, file: !1, line: 418, type: !12)
!737 = !DISubprogram(name: "gen_traverse", scope: !1, file: !1, line: 11, type: !738, isLocal: true, isDefinition: true, scopeLine: 12, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyGenObject*, i32 (%struct._object*, i8*)*, i8*)* @gen_traverse, variables: !740)
!738 = !DISubroutineType(types: !739)
!739 = !{!57, !12, !277, !103}
!740 = !{!741, !742, !743, !744, !748}
!741 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gen", arg: 1, scope: !737, file: !1, line: 11, type: !12)
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !737, file: !1, line: 11, type: !277)
!743 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !737, file: !1, line: 11, type: !103)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !745, file: !1, line: 13, type: !57)
!745 = distinct !DILexicalBlock(scope: !746, file: !1, line: 13, column: 5)
!746 = distinct !DILexicalBlock(scope: !747, file: !1, line: 13, column: 5)
!747 = distinct !DILexicalBlock(scope: !737, file: !1, line: 13, column: 5)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !749, file: !1, line: 14, type: !57)
!749 = distinct !DILexicalBlock(scope: !750, file: !1, line: 14, column: 5)
!750 = distinct !DILexicalBlock(scope: !751, file: !1, line: 14, column: 5)
!751 = distinct !DILexicalBlock(scope: !737, file: !1, line: 14, column: 5)
!752 = !DISubprogram(name: "gen_iternext", scope: !1, file: !1, line: 374, type: !684, isLocal: true, isDefinition: true, scopeLine: 375, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyGenObject*)* @gen_iternext, variables: !753)
!753 = !{!754, !755, !756, !757, !759}
!754 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gen", arg: 1, scope: !752, file: !1, line: 374, type: !12)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !752, file: !1, line: 376, type: !51)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !752, file: !1, line: 377, type: !51)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !758, file: !1, line: 379, type: !51)
!758 = distinct !DILexicalBlock(scope: !752, file: !1, line: 379, column: 5)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !760, file: !1, line: 379, type: !51)
!760 = distinct !DILexicalBlock(scope: !761, file: !1, line: 379, column: 5)
!761 = distinct !DILexicalBlock(scope: !758, file: !1, line: 379, column: 5)
!762 = !DISubprogram(name: "gen_throw", scope: !1, file: !1, line: 252, type: !532, isLocal: true, isDefinition: true, scopeLine: 253, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyGenObject*, %struct._object*)* @gen_throw, variables: !763)
!763 = !{!764, !765, !766, !767, !768, !769, !770, !773, !774, !778, !781, !787, !789, !791, !793, !796, !798, !802, !804, !806, !813, !816, !818, !820, !823, !825}
!764 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gen", arg: 1, scope: !762, file: !1, line: 252, type: !12)
!765 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !762, file: !1, line: 252, type: !51)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typ", scope: !762, file: !1, line: 254, type: !51)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !762, file: !1, line: 255, type: !51)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !762, file: !1, line: 256, type: !51)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yf", scope: !762, file: !1, line: 257, type: !51)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !771, file: !1, line: 264, type: !51)
!771 = distinct !DILexicalBlock(scope: !772, file: !1, line: 263, column: 13)
!772 = distinct !DILexicalBlock(scope: !762, file: !1, line: 263, column: 9)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !771, file: !1, line: 265, type: !57)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !775, file: !1, line: 270, type: !51)
!775 = distinct !DILexicalBlock(scope: !776, file: !1, line: 270, column: 13)
!776 = distinct !DILexicalBlock(scope: !777, file: !1, line: 266, column: 68)
!777 = distinct !DILexicalBlock(scope: !771, file: !1, line: 266, column: 13)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "meth", scope: !779, file: !1, line: 280, type: !51)
!779 = distinct !DILexicalBlock(scope: !780, file: !1, line: 279, column: 16)
!780 = distinct !DILexicalBlock(scope: !771, file: !1, line: 275, column: 13)
!781 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !782, file: !1, line: 283, type: !51)
!782 = distinct !DILexicalBlock(scope: !783, file: !1, line: 283, column: 21)
!783 = distinct !DILexicalBlock(scope: !784, file: !1, line: 282, column: 68)
!784 = distinct !DILexicalBlock(scope: !785, file: !1, line: 282, column: 21)
!785 = distinct !DILexicalBlock(scope: !786, file: !1, line: 281, column: 31)
!786 = distinct !DILexicalBlock(scope: !779, file: !1, line: 281, column: 17)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !788, file: !1, line: 287, type: !51)
!788 = distinct !DILexicalBlock(scope: !785, file: !1, line: 287, column: 17)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !790, file: !1, line: 293, type: !51)
!790 = distinct !DILexicalBlock(scope: !779, file: !1, line: 293, column: 13)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !792, file: !1, line: 295, type: !51)
!792 = distinct !DILexicalBlock(scope: !771, file: !1, line: 295, column: 9)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !794, file: !1, line: 297, type: !51)
!794 = distinct !DILexicalBlock(scope: !795, file: !1, line: 296, column: 19)
!795 = distinct !DILexicalBlock(scope: !771, file: !1, line: 296, column: 13)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !797, file: !1, line: 301, type: !51)
!797 = distinct !DILexicalBlock(scope: !794, file: !1, line: 301, column: 13)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !799, file: !1, line: 306, type: !51)
!799 = distinct !DILexicalBlock(scope: !800, file: !1, line: 306, column: 17)
!800 = distinct !DILexicalBlock(scope: !801, file: !1, line: 304, column: 60)
!801 = distinct !DILexicalBlock(scope: !794, file: !1, line: 304, column: 17)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !803, file: !1, line: 327, type: !51)
!803 = distinct !DILexicalBlock(scope: !762, file: !1, line: 327, column: 5)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !805, file: !1, line: 328, type: !51)
!805 = distinct !DILexicalBlock(scope: !762, file: !1, line: 328, column: 5)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !807, file: !1, line: 342, type: !51)
!807 = distinct !DILexicalBlock(scope: !808, file: !1, line: 342, column: 13)
!808 = distinct !DILexicalBlock(scope: !809, file: !1, line: 340, column: 14)
!809 = distinct !DILexicalBlock(scope: !810, file: !1, line: 335, column: 13)
!810 = distinct !DILexicalBlock(scope: !811, file: !1, line: 333, column: 46)
!811 = distinct !DILexicalBlock(scope: !812, file: !1, line: 333, column: 14)
!812 = distinct !DILexicalBlock(scope: !762, file: !1, line: 330, column: 9)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !814, file: !1, line: 342, type: !51)
!814 = distinct !DILexicalBlock(scope: !815, file: !1, line: 342, column: 13)
!815 = distinct !DILexicalBlock(scope: !807, file: !1, line: 342, column: 13)
!816 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !817, file: !1, line: 366, type: !51)
!817 = distinct !DILexicalBlock(scope: !762, file: !1, line: 366, column: 5)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !819, file: !1, line: 367, type: !51)
!819 = distinct !DILexicalBlock(scope: !762, file: !1, line: 367, column: 5)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !821, file: !1, line: 367, type: !51)
!821 = distinct !DILexicalBlock(scope: !822, file: !1, line: 367, column: 5)
!822 = distinct !DILexicalBlock(scope: !819, file: !1, line: 367, column: 5)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !824, file: !1, line: 368, type: !51)
!824 = distinct !DILexicalBlock(scope: !762, file: !1, line: 368, column: 5)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !826, file: !1, line: 368, type: !51)
!826 = distinct !DILexicalBlock(scope: !827, file: !1, line: 368, column: 5)
!827 = distinct !DILexicalBlock(scope: !824, file: !1, line: 368, column: 5)
!828 = !DISubprogram(name: "gen_get_name", scope: !1, file: !1, line: 427, type: !684, isLocal: true, isDefinition: true, scopeLine: 428, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyGenObject*)* @gen_get_name, variables: !829)
!829 = !{!830, !831}
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gen", arg: 1, scope: !828, file: !1, line: 427, type: !12)
!831 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !828, file: !1, line: 429, type: !51)
!832 = !{!833, !834, !842, !847, !851, !852, !856, !860, !863, !868}
!833 = !DIGlobalVariable(name: "PyGen_Type", scope: !0, file: !1, line: 458, type: !518, isLocal: false, isDefinition: true, variable: { %struct.PyVarObject, i8*, i64, i64, void (%struct._object*)*, i32 (%struct._object*, %struct._IO_FILE*, i32)*, %struct._object* (%struct._object*, i8*)*, i32 (%struct._object*, i8*, %struct._object*)*, i8*, %struct._object* (%struct._object*)*, %struct.PyNumberMethods*, %struct.PySequenceMethods*, %struct.PyMappingMethods*, i64 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*)*, i32 (%struct._object*, %struct._object*, %struct._object*)*, %struct.PyBufferProcs*, i64, i8*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, i32)*, i64, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*)*, %struct.PyMethodDef*, %struct.PyMemberDef*, %struct.PyGetSetDef*, %struct._typeobject*, %struct._object*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, i32 (%struct._object*, %struct._object*, %struct._object*)*, i64, i32 (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._typeobject*, i64)*, %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)*, void (i8*)*, i32 (%struct._object*)*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, void (%struct._object*)*, i32, void (%struct._object*)* }* @PyGen_Type)
!834 = !DIGlobalVariable(name: "PyId_close", scope: !694, file: !1, line: 173, type: !835, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @gen_close_iter.PyId_close)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !19, line: 144, baseType: !836)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !19, line: 140, size: 192, align: 64, elements: !837)
!837 = !{!838, !840, !841}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !836, file: !19, line: 141, baseType: !839, size: 64, align: 64)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64, align: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !836, file: !19, line: 142, baseType: !41, size: 64, align: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !836, file: !19, line: 143, baseType: !51, size: 64, align: 64, offset: 128)
!842 = !DIGlobalVariable(name: "gen_methods", scope: !0, file: !1, line: 451, type: !843, isLocal: true, isDefinition: true, variable: [4 x %struct.PyMethodDef]* @gen_methods)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !844, size: 1024, align: 64, elements: !845)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !295, line: 47, baseType: !294)
!845 = !{!846}
!846 = !DISubrange(count: 4)
!847 = !DIGlobalVariable(name: "send_doc", scope: !0, file: !1, line: 151, type: !848, isLocal: true, isDefinition: true, variable: [90 x i8]* @send_doc)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 720, align: 8, elements: !849)
!849 = !{!850}
!850 = !DISubrange(count: 90)
!851 = !DIGlobalVariable(name: "PyId_throw", scope: !762, file: !1, line: 258, type: !835, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @gen_throw.PyId_throw)
!852 = !DIGlobalVariable(name: "throw_doc", scope: !0, file: !1, line: 247, type: !853, isLocal: true, isDefinition: true, variable: [105 x i8]* @throw_doc)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 840, align: 8, elements: !854)
!854 = !{!855}
!855 = !DISubrange(count: 105)
!856 = !DIGlobalVariable(name: "close_doc", scope: !0, file: !1, line: 161, type: !857, isLocal: true, isDefinition: true, variable: [49 x i8]* @close_doc)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 392, align: 8, elements: !858)
!858 = !{!859}
!859 = !DISubrange(count: 49)
!860 = !DIGlobalVariable(name: "gen_memberlist", scope: !0, file: !1, line: 444, type: !861, isLocal: true, isDefinition: true, variable: [4 x %struct.PyMemberDef]* @gen_memberlist)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !862, size: 1280, align: 64, elements: !845)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !305, line: 24, baseType: !304)
!863 = !DIGlobalVariable(name: "gen_getsetlist", scope: !0, file: !1, line: 438, type: !864, isLocal: true, isDefinition: true, variable: [2 x %struct.PyGetSetDef]* @gen_getsetlist)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !865, size: 640, align: 64, elements: !866)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !315, line: 17, baseType: !314)
!866 = !{!867}
!867 = !DISubrange(count: 2)
!868 = !DIGlobalVariable(name: "gen__name__doc__", scope: !0, file: !1, line: 435, type: !869, isLocal: true, isDefinition: true, variable: [59 x i8]* @gen__name__doc__)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 472, align: 8, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 59)
!872 = !{i32 2, !"Dwarf Version", i32 4}
!873 = !{i32 2, !"Debug Info Version", i32 3}
!874 = !{!"clang version 3.7.0 (tags/RELEASE_370/final)"}
!875 = !DIExpression()
!876 = !DILocation(line: 19, column: 27, scope: !520)
!877 = !DILocation(line: 21, column: 24, scope: !520)
!878 = !DILocation(line: 21, column: 18, scope: !520)
!879 = !DILocation(line: 23, column: 5, scope: !520)
!880 = !DILocation(line: 25, column: 14, scope: !881)
!881 = distinct !DILexicalBlock(scope: !520, file: !1, line: 25, column: 9)
!882 = !{!883, !888, i64 16}
!883 = !{!"", !884, i64 0, !888, i64 16, !886, i64 24, !888, i64 32, !888, i64 40}
!884 = !{!"_object", !885, i64 0, !888, i64 8}
!885 = !{!"long", !886, i64 0}
!886 = !{!"omnipotent char", !887, i64 0}
!887 = !{!"Simple C/C++ TBAA"}
!888 = !{!"any pointer", !886, i64 0}
!889 = !DILocation(line: 25, column: 23, scope: !881)
!890 = !DILocation(line: 25, column: 31, scope: !881)
!891 = !DILocation(line: 25, column: 49, scope: !881)
!892 = !{!893, !888, i64 72}
