; ModuleID = 'getargs.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !440)
!1 = !DIFile(filename: "Python/getargs.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !12, !350, !351, !359, !101, !18, !360, !24, !367, !84, !348, !368, !369, !370, !378, !388, !406, !414, !431, !432, !434, !436, !438, !242, !51, !36, !439, !59}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !14, line: 109, baseType: !15)
!14 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !14, line: 105, size: 128, align: 64, elements: !16)
!16 = !{!17, !25}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !15, file: !14, line: 107, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !19, line: 177, baseType: !20)
!19 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !21, line: 102, baseType: !22)
!21 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !23, line: 181, baseType: !24)
!23 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!24 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !15, file: !14, line: 108, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !14, line: 334, size: 3200, align: 64, elements: !28)
!28 = !{!29, !35, !39, !40, !41, !46, !109, !114, !119, !120, !125, !177, !208, !220, !226, !227, !228, !230, !232, !263, !264, !265, !274, !275, !280, !281, !283, !285, !295, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !27, file: !14, line: 335, baseType: !30, size: 192, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !14, line: 114, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 111, size: 192, align: 64, elements: !32)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !14, line: 112, baseType: !13, size: 128, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !31, file: !14, line: 113, baseType: !18, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !27, file: !14, line: 336, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !27, file: !14, line: 341, baseType: !42, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !14, line: 308, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !12}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !27, file: !14, line: 342, baseType: !47, size: 64, align: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !14, line: 314, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !12, !52, !51}
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !21, line: 48, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !55, line: 246, size: 1728, align: 64, elements: !56)
!55 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!56 = !{!57, !58, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !78, !79, !80, !81, !83, !85, !87, !91, !94, !96, !97, !98, !99, !100, !104, !105}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !54, file: !55, line: 247, baseType: !51, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !54, file: !55, line: 252, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !54, file: !55, line: 253, baseType: !59, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !54, file: !55, line: 254, baseType: !59, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !54, file: !55, line: 255, baseType: !59, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !54, file: !55, line: 256, baseType: !59, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !54, file: !55, line: 257, baseType: !59, size: 64, align: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !54, file: !55, line: 258, baseType: !59, size: 64, align: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !54, file: !55, line: 259, baseType: !59, size: 64, align: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !54, file: !55, line: 261, baseType: !59, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !54, file: !55, line: 262, baseType: !59, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !54, file: !55, line: 263, baseType: !59, size: 64, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !54, file: !55, line: 265, baseType: !71, size: 64, align: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !55, line: 161, size: 192, align: 64, elements: !73)
!73 = !{!74, !75, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !72, file: !55, line: 162, baseType: !71, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !72, file: !55, line: 163, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !72, file: !55, line: 167, baseType: !51, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !54, file: !55, line: 267, baseType: !76, size: 64, align: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !54, file: !55, line: 269, baseType: !51, size: 32, align: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !54, file: !55, line: 273, baseType: !51, size: 32, align: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !54, file: !55, line: 275, baseType: !82, size: 64, align: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !23, line: 140, baseType: !24)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !54, file: !55, line: 279, baseType: !84, size: 16, align: 16, offset: 1024)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !54, file: !55, line: 280, baseType: !86, size: 8, align: 8, offset: 1040)
!86 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !54, file: !55, line: 281, baseType: !88, size: 8, align: 8, offset: 1048)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !54, file: !55, line: 285, baseType: !92, size: 64, align: 64, offset: 1088)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !55, line: 155, baseType: null)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !54, file: !55, line: 294, baseType: !95, size: 64, align: 64, offset: 1152)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !23, line: 141, baseType: !24)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !54, file: !55, line: 303, baseType: !11, size: 64, align: 64, offset: 1216)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !54, file: !55, line: 304, baseType: !11, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !54, file: !55, line: 305, baseType: !11, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !54, file: !55, line: 306, baseType: !11, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !54, file: !55, line: 307, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !54, file: !55, line: 309, baseType: !51, size: 32, align: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !54, file: !55, line: 311, baseType: !106, size: 160, align: 8, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !27, file: !14, line: 343, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !14, line: 316, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!12, !12, !59}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !27, file: !14, line: 344, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !14, line: 318, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!51, !12, !59, !12}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !27, file: !14, line: 345, baseType: !11, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !27, file: !14, line: 346, baseType: !121, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !14, line: 320, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!12, !12}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !27, file: !14, line: 350, baseType: !126, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !14, line: 278, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 236, size: 2176, align: 64, elements: !129)
!129 = !{!130, !135, !136, !137, !138, !139, !144, !146, !147, !148, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !128, file: !14, line: 241, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !14, line: 166, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!12, !12, !12}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !128, file: !14, line: 242, baseType: !131, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !128, file: !14, line: 243, baseType: !131, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !128, file: !14, line: 244, baseType: !131, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !128, file: !14, line: 245, baseType: !131, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !128, file: !14, line: 246, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !14, line: 167, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!12, !12, !12, !12}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !128, file: !14, line: 247, baseType: !145, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !14, line: 165, baseType: !122)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !128, file: !14, line: 248, baseType: !145, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !128, file: !14, line: 249, baseType: !145, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !128, file: !14, line: 250, baseType: !149, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !14, line: 168, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!51, !12}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !128, file: !14, line: 251, baseType: !145, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !128, file: !14, line: 252, baseType: !131, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !128, file: !14, line: 253, baseType: !131, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !128, file: !14, line: 254, baseType: !131, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !128, file: !14, line: 255, baseType: !131, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !128, file: !14, line: 256, baseType: !131, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !128, file: !14, line: 257, baseType: !145, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !128, file: !14, line: 258, baseType: !11, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !128, file: !14, line: 259, baseType: !145, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !128, file: !14, line: 261, baseType: !131, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !128, file: !14, line: 262, baseType: !131, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !128, file: !14, line: 263, baseType: !131, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !128, file: !14, line: 264, baseType: !131, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !128, file: !14, line: 265, baseType: !140, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !128, file: !14, line: 266, baseType: !131, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !128, file: !14, line: 267, baseType: !131, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !128, file: !14, line: 268, baseType: !131, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !128, file: !14, line: 269, baseType: !131, size: 64, align: 64, offset: 1728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !128, file: !14, line: 270, baseType: !131, size: 64, align: 64, offset: 1792)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !128, file: !14, line: 272, baseType: !131, size: 64, align: 64, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !128, file: !14, line: 273, baseType: !131, size: 64, align: 64, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !128, file: !14, line: 274, baseType: !131, size: 64, align: 64, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !128, file: !14, line: 275, baseType: !131, size: 64, align: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !128, file: !14, line: 277, baseType: !145, size: 64, align: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !27, file: !14, line: 351, baseType: !178, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !14, line: 292, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 280, size: 640, align: 64, elements: !181)
!181 = !{!182, !187, !188, !193, !194, !195, !200, !201, !206, !207}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !180, file: !14, line: 281, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !14, line: 169, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!18, !12}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !180, file: !14, line: 282, baseType: !131, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !180, file: !14, line: 283, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !14, line: 170, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!12, !12, !18}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !180, file: !14, line: 284, baseType: !189, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !180, file: !14, line: 285, baseType: !11, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !180, file: !14, line: 286, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !14, line: 172, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!51, !12, !18, !12}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !180, file: !14, line: 287, baseType: !11, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !180, file: !14, line: 288, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !14, line: 231, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!51, !12, !12}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !180, file: !14, line: 290, baseType: !131, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !180, file: !14, line: 291, baseType: !189, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !27, file: !14, line: 352, baseType: !209, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !14, line: 298, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 294, size: 192, align: 64, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !211, file: !14, line: 295, baseType: !183, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !211, file: !14, line: 296, baseType: !131, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !211, file: !14, line: 297, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !14, line: 174, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!51, !12, !12, !12}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !27, file: !14, line: 356, baseType: !221, size: 64, align: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !14, line: 321, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !12}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !19, line: 186, baseType: !18)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !27, file: !14, line: 357, baseType: !140, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !27, file: !14, line: 358, baseType: !121, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !27, file: !14, line: 359, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !14, line: 317, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !27, file: !14, line: 360, baseType: !231, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !14, line: 319, baseType: !217)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !27, file: !14, line: 363, baseType: !233, size: 64, align: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !14, line: 304, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 301, size: 128, align: 64, elements: !236)
!236 = !{!237, !258}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !235, file: !14, line: 302, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !14, line: 193, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!51, !12, !242, !51}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !14, line: 191, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !14, line: 178, size: 640, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !255, !256, !257}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !244, file: !14, line: 179, baseType: !11, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !244, file: !14, line: 180, baseType: !12, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !14, line: 181, baseType: !18, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !244, file: !14, line: 182, baseType: !18, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !244, file: !14, line: 184, baseType: !51, size: 32, align: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !244, file: !14, line: 185, baseType: !51, size: 32, align: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !244, file: !14, line: 186, baseType: !59, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !244, file: !14, line: 187, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !244, file: !14, line: 188, baseType: !254, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !244, file: !14, line: 189, baseType: !254, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !244, file: !14, line: 190, baseType: !11, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !235, file: !14, line: 303, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !14, line: 194, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !12, !242}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !27, file: !14, line: 366, baseType: !103, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !27, file: !14, line: 368, baseType: !36, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !27, file: !14, line: 372, baseType: !266, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !14, line: 233, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!51, !12, !270, !11}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !14, line: 232, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!51, !12, !11}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !27, file: !14, line: 375, baseType: !149, size: 64, align: 64, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !27, file: !14, line: 379, baseType: !276, size: 64, align: 64, offset: 1600)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !14, line: 322, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!12, !12, !12, !51}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !27, file: !14, line: 382, baseType: !18, size: 64, align: 64, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !27, file: !14, line: 385, baseType: !282, size: 64, align: 64, offset: 1728)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !14, line: 323, baseType: !122)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !27, file: !14, line: 386, baseType: !284, size: 64, align: 64, offset: 1792)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !14, line: 324, baseType: !122)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !27, file: !14, line: 389, baseType: !286, size: 64, align: 64, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 40, size: 256, align: 64, elements: !289)
!288 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 41, baseType: !36, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 18, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 43, baseType: !51, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 45, baseType: !36, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !27, file: !14, line: 390, baseType: !296, size: 64, align: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !14, line: 390, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !27, file: !14, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !59, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!12, !12, !11}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!51, !12, !12, !11}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !59, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !11, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !27, file: !14, line: 392, baseType: !26, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !27, file: !14, line: 393, baseType: !12, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !27, file: !14, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !14, line: 325, baseType: !141)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !27, file: !14, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !14, line: 326, baseType: !217)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !27, file: !14, line: 396, baseType: !18, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !27, file: !14, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !14, line: 327, baseType: !217)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !27, file: !14, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !14, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!12, !26, !18}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !27, file: !14, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !14, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!12, !26, !12, !12}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !27, file: !14, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !14, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !11}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !27, file: !14, line: 401, baseType: !149, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !27, file: !14, line: 402, baseType: !12, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !27, file: !14, line: 403, baseType: !12, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !27, file: !14, line: 404, baseType: !12, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !27, file: !14, line: 405, baseType: !12, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !27, file: !14, line: 406, baseType: !12, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !27, file: !14, line: 407, baseType: !42, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !27, file: !14, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !27, file: !14, line: 412, baseType: !42, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !353, line: 33, baseType: !354)
!353 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!354 = !DICompositeType(tag: DW_TAG_structure_type, file: !353, line: 25, size: 256, align: 64, elements: !355)
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !354, file: !353, line: 26, baseType: !30, size: 192, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !354, file: !353, line: 27, baseType: !358, size: 64, align: 64, offset: 192)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, align: 64, elements: !89)
!359 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "freelistentry_t", file: !1, line: 46, baseType: !362)
!362 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 43, size: 128, align: 64, elements: !363)
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !362, file: !1, line: 44, baseType: !11, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !362, file: !1, line: 45, baseType: !366, size: 64, align: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "destr_t", file: !1, line: 36, baseType: !271)
!367 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!368 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!369 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !372, line: 41, baseType: !373)
!372 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!373 = !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 31, size: 320, align: 64, elements: !374)
!374 = !{!375, !376, !377}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !373, file: !372, line: 32, baseType: !30, size: 192, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !373, file: !372, line: 33, baseType: !225, size: 64, align: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !373, file: !372, line: 34, baseType: !88, size: 8, align: 8, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyByteArrayObject", file: !380, line: 30, baseType: !381)
!380 = !DIFile(filename: "Include/bytearrayobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!381 = !DICompositeType(tag: DW_TAG_structure_type, file: !380, line: 23, size: 448, align: 64, elements: !382)
!382 = !{!383, !384, !385, !386, !387}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !381, file: !380, line: 24, baseType: !30, size: 192, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ob_alloc", scope: !381, file: !380, line: 25, baseType: !18, size: 64, align: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ob_bytes", scope: !381, file: !380, line: 26, baseType: !59, size: 64, align: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ob_start", scope: !381, file: !380, line: 27, baseType: !59, size: 64, align: 64, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ob_exports", scope: !381, file: !380, line: 29, baseType: !51, size: 32, align: 32, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !390)
!390 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !391)
!391 = !{!392, !393, !394, !395, !403}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !390, file: !4, line: 291, baseType: !13, size: 128, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !390, file: !4, line: 292, baseType: !18, size: 64, align: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !390, file: !4, line: 293, baseType: !225, size: 64, align: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !390, file: !4, line: 349, baseType: !396, size: 32, align: 32, offset: 256)
!396 = !DICompositeType(tag: DW_TAG_structure_type, scope: !390, file: !4, line: 294, size: 32, align: 32, elements: !397)
!397 = !{!398, !399, !400, !401, !402}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !396, file: !4, line: 303, baseType: !348, size: 2, align: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !396, file: !4, line: 331, baseType: !348, size: 3, align: 32, offset: 2)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !396, file: !4, line: 336, baseType: !348, size: 1, align: 32, offset: 5)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !396, file: !4, line: 340, baseType: !348, size: 1, align: 32, offset: 6)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !396, file: !4, line: 345, baseType: !348, size: 1, align: 32, offset: 7)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !390, file: !4, line: 350, baseType: !404, size: 64, align: 64, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !102, line: 90, baseType: !51)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !408)
!408 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !409)
!409 = !{!410, !411, !412, !413}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !408, file: !4, line: 357, baseType: !389, size: 384, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !408, file: !4, line: 358, baseType: !18, size: 64, align: 64, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !408, file: !4, line: 360, baseType: !59, size: 64, align: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !408, file: !4, line: 361, baseType: !18, size: 64, align: 64, offset: 512)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !416)
!416 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !417)
!417 = !{!418, !419}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !416, file: !4, line: 369, baseType: !407, size: 576, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !416, file: !4, line: 375, baseType: !420, size: 64, align: 64, offset: 576)
!420 = !DICompositeType(tag: DW_TAG_union_type, scope: !416, file: !4, line: 370, size: 64, align: 64, elements: !421)
!421 = !{!422, !423, !426, !429}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !420, file: !4, line: 371, baseType: !11, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !420, file: !4, line: 372, baseType: !424, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !359)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !420, file: !4, line: 373, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !84)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !420, file: !4, line: 374, baseType: !430, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !348)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !428)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!440 = !{!441, !461, !469, !475, !481, !490, !498, !508, !516, !527, !536, !539, !552, !558, !562, !603, !611, !627, !659, !873, !876, !884, !891, !899, !904, !914, !918, !933, !965}
!441 = !DISubprogram(name: "PyArg_Parse", scope: !1, file: !1, line: 73, type: !442, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*, ...)* @PyArg_Parse, variables: !444)
!442 = !DISubroutineType(types: !443)
!443 = !{!51, !12, !36, null}
!444 = !{!445, !446, !447, !448}
!445 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 1, scope: !441, file: !1, line: 73, type: !12)
!446 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 2, scope: !441, file: !1, line: 73, type: !36)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !441, file: !1, line: 75, type: !51)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "va", scope: !441, file: !1, line: 76, type: !449)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !21, line: 79, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !451, line: 50, baseType: !452)
!451 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stdarg.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 76, baseType: !453)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 192, align: 64, elements: !89)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "__va_list_tag", file: !1, line: 76, baseType: !455)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 76, size: 192, align: 64, elements: !456)
!456 = !{!457, !458, !459, !460}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !455, file: !1, line: 76, baseType: !348, size: 32, align: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !455, file: !1, line: 76, baseType: !348, size: 32, align: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !455, file: !1, line: 76, baseType: !11, size: 64, align: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !455, file: !1, line: 76, baseType: !11, size: 64, align: 64, offset: 128)
!461 = !DISubprogram(name: "_PyArg_Parse_SizeT", scope: !1, file: !1, line: 85, type: !462, isLocal: false, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*, ...)* @_PyArg_Parse_SizeT, variables: !464)
!462 = !DISubroutineType(types: !463)
!463 = !{!51, !12, !59, null}
!464 = !{!465, !466, !467, !468}
!465 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 1, scope: !461, file: !1, line: 85, type: !12)
!466 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 2, scope: !461, file: !1, line: 85, type: !59)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !461, file: !1, line: 87, type: !51)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "va", scope: !461, file: !1, line: 88, type: !449)
!469 = !DISubprogram(name: "PyArg_ParseTuple", scope: !1, file: !1, line: 98, type: !442, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*, ...)* @PyArg_ParseTuple, variables: !470)
!470 = !{!471, !472, !473, !474}
!471 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 1, scope: !469, file: !1, line: 98, type: !12)
!472 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 2, scope: !469, file: !1, line: 98, type: !36)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !469, file: !1, line: 100, type: !51)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "va", scope: !469, file: !1, line: 101, type: !449)
!475 = !DISubprogram(name: "_PyArg_ParseTuple_SizeT", scope: !1, file: !1, line: 110, type: !462, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*, ...)* @_PyArg_ParseTuple_SizeT, variables: !476)
!476 = !{!477, !478, !479, !480}
!477 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 1, scope: !475, file: !1, line: 110, type: !12)
!478 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 2, scope: !475, file: !1, line: 110, type: !59)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !475, file: !1, line: 112, type: !51)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "va", scope: !475, file: !1, line: 113, type: !449)
!481 = !DISubprogram(name: "PyArg_VaParse", scope: !1, file: !1, line: 123, type: !482, isLocal: false, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*, %struct.__va_list_tag*)* @PyArg_VaParse, variables: !485)
!482 = !DISubroutineType(types: !483)
!483 = !{!51, !12, !36, !484}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!485 = !{!486, !487, !488, !489}
!486 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 1, scope: !481, file: !1, line: 123, type: !12)
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 2, scope: !481, file: !1, line: 123, type: !36)
!488 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "va", arg: 3, scope: !481, file: !1, line: 123, type: !484)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lva", scope: !481, file: !1, line: 125, type: !449)
!490 = !DISubprogram(name: "_PyArg_VaParse_SizeT", scope: !1, file: !1, line: 133, type: !491, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*, %struct.__va_list_tag*)* @_PyArg_VaParse_SizeT, variables: !493)
!491 = !DISubroutineType(types: !492)
!492 = !{!51, !12, !59, !484}
!493 = !{!494, !495, !496, !497}
!494 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 1, scope: !490, file: !1, line: 133, type: !12)
!495 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 2, scope: !490, file: !1, line: 133, type: !59)
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "va", arg: 3, scope: !490, file: !1, line: 133, type: !484)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lva", scope: !490, file: !1, line: 135, type: !449)
!498 = !DISubprogram(name: "PyArg_ParseTupleAndKeywords", scope: !1, file: !1, line: 1318, type: !499, isLocal: false, isDefinition: true, scopeLine: 1322, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, i8*, i8**, ...)* @PyArg_ParseTupleAndKeywords, variables: !501)
!499 = !DISubroutineType(types: !500)
!500 = !{!51, !12, !12, !36, !439, null}
!501 = !{!502, !503, !504, !505, !506, !507}
!502 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 1, scope: !498, file: !1, line: 1318, type: !12)
!503 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "keywords", arg: 2, scope: !498, file: !1, line: 1319, type: !12)
!504 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 3, scope: !498, file: !1, line: 1320, type: !36)
!505 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwlist", arg: 4, scope: !498, file: !1, line: 1321, type: !439)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !498, file: !1, line: 1323, type: !51)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "va", scope: !498, file: !1, line: 1324, type: !449)
!508 = !DISubprogram(name: "_PyArg_ParseTupleAndKeywords_SizeT", scope: !1, file: !1, line: 1342, type: !499, isLocal: false, isDefinition: true, scopeLine: 1346, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, i8*, i8**, ...)* @_PyArg_ParseTupleAndKeywords_SizeT, variables: !509)
!509 = !{!510, !511, !512, !513, !514, !515}
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 1, scope: !508, file: !1, line: 1342, type: !12)
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "keywords", arg: 2, scope: !508, file: !1, line: 1343, type: !12)
!512 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 3, scope: !508, file: !1, line: 1344, type: !36)
!513 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwlist", arg: 4, scope: !508, file: !1, line: 1345, type: !439)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !508, file: !1, line: 1347, type: !51)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "va", scope: !508, file: !1, line: 1348, type: !449)
!516 = !DISubprogram(name: "PyArg_VaParseTupleAndKeywords", scope: !1, file: !1, line: 1368, type: !517, isLocal: false, isDefinition: true, scopeLine: 1372, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, i8*, i8**, %struct.__va_list_tag*)* @PyArg_VaParseTupleAndKeywords, variables: !519)
!517 = !DISubroutineType(types: !518)
!518 = !{!51, !12, !12, !36, !439, !484}
!519 = !{!520, !521, !522, !523, !524, !525, !526}
!520 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 1, scope: !516, file: !1, line: 1368, type: !12)
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "keywords", arg: 2, scope: !516, file: !1, line: 1369, type: !12)
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 3, scope: !516, file: !1, line: 1370, type: !36)
!523 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwlist", arg: 4, scope: !516, file: !1, line: 1371, type: !439)
!524 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "va", arg: 5, scope: !516, file: !1, line: 1371, type: !484)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !516, file: !1, line: 1373, type: !51)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lva", scope: !516, file: !1, line: 1374, type: !449)
!527 = !DISubprogram(name: "_PyArg_VaParseTupleAndKeywords_SizeT", scope: !1, file: !1, line: 1392, type: !517, isLocal: false, isDefinition: true, scopeLine: 1396, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, i8*, i8**, %struct.__va_list_tag*)* @_PyArg_VaParseTupleAndKeywords_SizeT, variables: !528)
!528 = !{!529, !530, !531, !532, !533, !534, !535}
!529 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 1, scope: !527, file: !1, line: 1392, type: !12)
!530 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "keywords", arg: 2, scope: !527, file: !1, line: 1393, type: !12)
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 3, scope: !527, file: !1, line: 1394, type: !36)
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwlist", arg: 4, scope: !527, file: !1, line: 1395, type: !439)
!533 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "va", arg: 5, scope: !527, file: !1, line: 1395, type: !484)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !527, file: !1, line: 1397, type: !51)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lva", scope: !527, file: !1, line: 1398, type: !449)
!536 = !DISubprogram(name: "PyArg_ValidateKeywordArguments", scope: !1, file: !1, line: 1417, type: !151, isLocal: false, isDefinition: true, scopeLine: 1418, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @PyArg_ValidateKeywordArguments, variables: !537)
!537 = !{!538}
!538 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 1, scope: !536, file: !1, line: 1417, type: !12)
!539 = !DISubprogram(name: "PyArg_UnpackTuple", scope: !1, file: !1, line: 1754, type: !540, isLocal: false, isDefinition: true, scopeLine: 1755, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*, i64, i64, ...)* @PyArg_UnpackTuple, variables: !542)
!540 = !DISubroutineType(types: !541)
!541 = !{!51, !12, !36, !18, !18, null}
!542 = !{!543, !544, !545, !546, !547, !548, !549, !551}
!543 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 1, scope: !539, file: !1, line: 1754, type: !12)
!544 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !539, file: !1, line: 1754, type: !36)
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min", arg: 3, scope: !539, file: !1, line: 1754, type: !18)
!546 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "max", arg: 4, scope: !539, file: !1, line: 1754, type: !18)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !539, file: !1, line: 1756, type: !18)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !539, file: !1, line: 1756, type: !18)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !539, file: !1, line: 1757, type: !550)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vargs", scope: !539, file: !1, line: 1758, type: !449)
!552 = !DISubprogram(name: "_PyArg_NoKeywords", scope: !1, file: !1, line: 1820, type: !553, isLocal: false, isDefinition: true, scopeLine: 1821, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._object*)* @_PyArg_NoKeywords, variables: !555)
!553 = !DISubroutineType(types: !554)
!554 = !{!51, !36, !12}
!555 = !{!556, !557}
!556 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "funcname", arg: 1, scope: !552, file: !1, line: 1820, type: !36)
!557 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 2, scope: !552, file: !1, line: 1820, type: !12)
!558 = !DISubprogram(name: "_PyArg_NoPositional", scope: !1, file: !1, line: 1838, type: !553, isLocal: false, isDefinition: true, scopeLine: 1839, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._object*)* @_PyArg_NoPositional, variables: !559)
!559 = !{!560, !561}
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "funcname", arg: 1, scope: !558, file: !1, line: 1838, type: !36)
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !558, file: !1, line: 1838, type: !12)
!562 = !DISubprogram(name: "vgetargs1", scope: !1, file: !1, line: 199, type: !563, isLocal: true, isDefinition: true, scopeLine: 200, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*, [1 x %struct.__va_list_tag]*, i32)* @vgetargs1, variables: !566)
!563 = !DISubroutineType(types: !564)
!564 = !{!51, !12, !36, !565, !51}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!566 = !{!567, !568, !569, !570, !571, !575, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !594, !601}
!567 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 1, scope: !562, file: !1, line: 199, type: !12)
!568 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 2, scope: !562, file: !1, line: 199, type: !36)
!569 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_va", arg: 3, scope: !562, file: !1, line: 199, type: !565)
!570 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 4, scope: !562, file: !1, line: 199, type: !51)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msgbuf", scope: !562, file: !1, line: 201, type: !572)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 2048, align: 8, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 256)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "levels", scope: !562, file: !1, line: 202, type: !576)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 1024, align: 32, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 32)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fname", scope: !562, file: !1, line: 203, type: !36)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "message", scope: !562, file: !1, line: 204, type: !36)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min", scope: !562, file: !1, line: 205, type: !51)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max", scope: !562, file: !1, line: 206, type: !51)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "level", scope: !562, file: !1, line: 207, type: !51)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "endfmt", scope: !562, file: !1, line: 208, type: !51)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "formatsave", scope: !562, file: !1, line: 209, type: !36)
!586 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !562, file: !1, line: 210, type: !18)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !562, file: !1, line: 210, type: !18)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msg", scope: !562, file: !1, line: 211, type: !59)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "compat", scope: !562, file: !1, line: 212, type: !51)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "static_entries", scope: !562, file: !1, line: 213, type: !591)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 1024, align: 64, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 8)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "freelist", scope: !562, file: !1, line: 214, type: !595)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "freelist_t", file: !1, line: 52, baseType: !596)
!596 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 48, size: 128, align: 64, elements: !597)
!597 = !{!598, !599, !600}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !596, file: !1, line: 49, baseType: !360, size: 64, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "first_available", scope: !596, file: !1, line: 50, baseType: !51, size: 32, align: 32, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "entries_malloced", scope: !596, file: !1, line: 51, baseType: !51, size: 32, align: 32, offset: 96)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !602, file: !1, line: 224, type: !51)
!602 = distinct !DILexicalBlock(scope: !562, file: !1, line: 223, column: 25)
!603 = !DISubprogram(name: "cleanreturn", scope: !1, file: !1, line: 179, type: !604, isLocal: true, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: true, variables: !607)
!604 = !DISubroutineType(types: !605)
!605 = !{!51, !51, !606}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64, align: 64)
!607 = !{!608, !609, !610}
!608 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "retval", arg: 1, scope: !603, file: !1, line: 179, type: !51)
!609 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "freelist", arg: 2, scope: !603, file: !1, line: 179, type: !606)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !603, file: !1, line: 181, type: !51)
!611 = !DISubprogram(name: "convertitem", scope: !1, file: !1, line: 505, type: !612, isLocal: true, isDefinition: true, scopeLine: 507, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct._object*, i8**, [1 x %struct.__va_list_tag]*, i32, i32*, i8*, i64, %struct.freelist_t*)* @convertitem, variables: !616)
!612 = !DISubroutineType(types: !613)
!613 = !{!59, !12, !614, !565, !51, !615, !59, !101, !606}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625, !626}
!617 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 1, scope: !611, file: !1, line: 505, type: !12)
!618 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_format", arg: 2, scope: !611, file: !1, line: 505, type: !614)
!619 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_va", arg: 3, scope: !611, file: !1, line: 505, type: !565)
!620 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 4, scope: !611, file: !1, line: 505, type: !51)
!621 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "levels", arg: 5, scope: !611, file: !1, line: 506, type: !615)
!622 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgbuf", arg: 6, scope: !611, file: !1, line: 506, type: !59)
!623 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bufsize", arg: 7, scope: !611, file: !1, line: 506, type: !101)
!624 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "freelist", arg: 8, scope: !611, file: !1, line: 506, type: !606)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msg", scope: !611, file: !1, line: 508, type: !59)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format", scope: !611, file: !1, line: 509, type: !36)
!627 = !DISubprogram(name: "converttuple", scope: !1, file: !1, line: 420, type: !628, isLocal: true, isDefinition: true, scopeLine: 423, flags: DIFlagPrototyped, isOptimized: true, variables: !630)
!628 = !DISubroutineType(types: !629)
!629 = !{!59, !12, !614, !565, !51, !615, !59, !101, !51, !606}
!630 = !{!631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !649, !653, !654, !656}
!631 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 1, scope: !627, file: !1, line: 420, type: !12)
!632 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_format", arg: 2, scope: !627, file: !1, line: 420, type: !614)
!633 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_va", arg: 3, scope: !627, file: !1, line: 420, type: !565)
!634 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 4, scope: !627, file: !1, line: 420, type: !51)
!635 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "levels", arg: 5, scope: !627, file: !1, line: 421, type: !615)
!636 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgbuf", arg: 6, scope: !627, file: !1, line: 421, type: !59)
!637 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bufsize", arg: 7, scope: !627, file: !1, line: 421, type: !101)
!638 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "toplevel", arg: 8, scope: !627, file: !1, line: 421, type: !51)
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "freelist", arg: 9, scope: !627, file: !1, line: 422, type: !606)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "level", scope: !627, file: !1, line: 424, type: !51)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !627, file: !1, line: 425, type: !51)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format", scope: !627, file: !1, line: 426, type: !36)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !627, file: !1, line: 427, type: !51)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !627, file: !1, line: 428, type: !18)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !646, file: !1, line: 431, type: !51)
!646 = distinct !DILexicalBlock(scope: !647, file: !1, line: 430, column: 14)
!647 = distinct !DILexicalBlock(scope: !648, file: !1, line: 430, column: 5)
!648 = distinct !DILexicalBlock(scope: !627, file: !1, line: 430, column: 5)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msg", scope: !650, file: !1, line: 477, type: !59)
!650 = distinct !DILexicalBlock(scope: !651, file: !1, line: 476, column: 29)
!651 = distinct !DILexicalBlock(scope: !652, file: !1, line: 476, column: 5)
!652 = distinct !DILexicalBlock(scope: !627, file: !1, line: 476, column: 5)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !650, file: !1, line: 478, type: !12)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !655, file: !1, line: 490, type: !12)
!655 = distinct !DILexicalBlock(scope: !650, file: !1, line: 490, column: 9)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !657, file: !1, line: 490, type: !12)
!657 = distinct !DILexicalBlock(scope: !658, file: !1, line: 490, column: 9)
!658 = distinct !DILexicalBlock(scope: !655, file: !1, line: 490, column: 9)
!659 = !DISubprogram(name: "convertsimple", scope: !1, file: !1, line: 570, type: !660, isLocal: true, isDefinition: true, scopeLine: 572, flags: DIFlagPrototyped, isOptimized: true, variables: !662)
!660 = !DISubroutineType(types: !661)
!661 = !{!59, !12, !614, !565, !51, !59, !101, !606}
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !676, !677, !679, !680, !683, !684, !687, !688, !690, !691, !694, !695, !697, !698, !699, !703, !706, !707, !710, !711, !714, !715, !719, !720, !723, !725, !728, !729, !738, !739, !741, !743, !744, !745, !747, !748, !750, !751, !752, !755, !756, !760, !764, !766, !769, !770, !771, !775, !777, !778, !780, !781, !786, !789, !790, !794, !799, !801, !802, !803, !804, !805, !806, !809, !811, !815, !818, !819, !823, !829, !833, !838, !843, !847, !851, !853, !855, !857, !859, !863, !864, !869, !870, !871}
!663 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 1, scope: !659, file: !1, line: 570, type: !12)
!664 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_format", arg: 2, scope: !659, file: !1, line: 570, type: !614)
!665 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_va", arg: 3, scope: !659, file: !1, line: 570, type: !565)
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 4, scope: !659, file: !1, line: 570, type: !51)
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msgbuf", arg: 5, scope: !659, file: !1, line: 571, type: !59)
!668 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bufsize", arg: 6, scope: !659, file: !1, line: 571, type: !101)
!669 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "freelist", arg: 7, scope: !659, file: !1, line: 571, type: !606)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format", scope: !659, file: !1, line: 591, type: !36)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !659, file: !1, line: 592, type: !38)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sarg", scope: !659, file: !1, line: 593, type: !59)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !674, file: !1, line: 598, type: !59)
!674 = distinct !DILexicalBlock(scope: !675, file: !1, line: 597, column: 15)
!675 = distinct !DILexicalBlock(scope: !659, file: !1, line: 595, column: 16)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ival", scope: !674, file: !1, line: 599, type: !24)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !678, file: !1, line: 622, type: !59)
!678 = distinct !DILexicalBlock(scope: !675, file: !1, line: 620, column: 15)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ival", scope: !678, file: !1, line: 623, type: !24)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !681, file: !1, line: 635, type: !682)
!681 = distinct !DILexicalBlock(scope: !675, file: !1, line: 634, column: 15)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ival", scope: !681, file: !1, line: 636, type: !24)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !685, file: !1, line: 659, type: !686)
!685 = distinct !DILexicalBlock(scope: !675, file: !1, line: 657, column: 15)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ival", scope: !685, file: !1, line: 660, type: !24)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !689, file: !1, line: 672, type: !615)
!689 = distinct !DILexicalBlock(scope: !675, file: !1, line: 671, column: 15)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ival", scope: !689, file: !1, line: 673, type: !24)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !692, file: !1, line: 696, type: !693)
!692 = distinct !DILexicalBlock(scope: !675, file: !1, line: 694, column: 15)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ival", scope: !692, file: !1, line: 697, type: !348)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iobj", scope: !696, file: !1, line: 710, type: !12)
!696 = distinct !DILexicalBlock(scope: !675, file: !1, line: 709, column: 5)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !696, file: !1, line: 711, type: !254)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ival", scope: !696, file: !1, line: 712, type: !18)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !700, file: !1, line: 718, type: !12)
!700 = distinct !DILexicalBlock(scope: !701, file: !1, line: 718, column: 13)
!701 = distinct !DILexicalBlock(scope: !702, file: !1, line: 716, column: 27)
!702 = distinct !DILexicalBlock(scope: !696, file: !1, line: 716, column: 13)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !704, file: !1, line: 726, type: !705)
!704 = distinct !DILexicalBlock(scope: !675, file: !1, line: 725, column: 15)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ival", scope: !704, file: !1, line: 727, type: !24)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !708, file: !1, line: 739, type: !709)
!708 = distinct !DILexicalBlock(scope: !675, file: !1, line: 738, column: 15)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ival", scope: !708, file: !1, line: 740, type: !103)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !712, file: !1, line: 751, type: !713)
!712 = distinct !DILexicalBlock(scope: !675, file: !1, line: 750, column: 15)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ival", scope: !712, file: !1, line: 752, type: !368)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !716, file: !1, line: 764, type: !717)
!716 = distinct !DILexicalBlock(scope: !675, file: !1, line: 763, column: 15)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64, align: 64)
!718 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ival", scope: !716, file: !1, line: 765, type: !718)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !721, file: !1, line: 776, type: !722)
!721 = distinct !DILexicalBlock(scope: !675, file: !1, line: 775, column: 15)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dval", scope: !721, file: !1, line: 777, type: !724)
!724 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !726, file: !1, line: 786, type: !727)
!726 = distinct !DILexicalBlock(scope: !675, file: !1, line: 785, column: 15)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64, align: 64)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dval", scope: !726, file: !1, line: 787, type: !724)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !730, file: !1, line: 796, type: !731)
!730 = distinct !DILexicalBlock(scope: !675, file: !1, line: 795, column: 15)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64, align: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_complex", file: !733, line: 13, baseType: !734)
!733 = !DIFile(filename: "Include/complexobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!734 = !DICompositeType(tag: DW_TAG_structure_type, file: !733, line: 10, size: 128, align: 64, elements: !735)
!735 = !{!736, !737}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !734, file: !733, line: 11, baseType: !724, size: 64, align: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !734, file: !733, line: 12, baseType: !724, size: 64, align: 64, offset: 64)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cval", scope: !730, file: !1, line: 797, type: !732)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !740, file: !1, line: 807, type: !59)
!740 = distinct !DILexicalBlock(scope: !675, file: !1, line: 806, column: 15)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !742, file: !1, line: 818, type: !615)
!742 = distinct !DILexicalBlock(scope: !675, file: !1, line: 817, column: 15)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !742, file: !1, line: 819, type: !51)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !742, file: !1, line: 820, type: !11)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !746, file: !1, line: 838, type: !615)
!746 = distinct !DILexicalBlock(scope: !675, file: !1, line: 837, column: 15)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !746, file: !1, line: 839, type: !51)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !749, file: !1, line: 853, type: !438)
!749 = distinct !DILexicalBlock(scope: !675, file: !1, line: 852, column: 15)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !749, file: !1, line: 854, type: !59)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !749, file: !1, line: 855, type: !18)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !753, file: !1, line: 871, type: !615)
!753 = distinct !DILexicalBlock(scope: !754, file: !1, line: 870, column: 29)
!754 = distinct !DILexicalBlock(scope: !749, file: !1, line: 870, column: 13)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q2", scope: !753, file: !1, line: 871, type: !254)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !757, file: !1, line: 888, type: !242)
!757 = distinct !DILexicalBlock(scope: !758, file: !1, line: 886, column: 29)
!758 = distinct !DILexicalBlock(scope: !759, file: !1, line: 886, column: 13)
!759 = distinct !DILexicalBlock(scope: !675, file: !1, line: 885, column: 5)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !761, file: !1, line: 893, type: !18)
!761 = distinct !DILexicalBlock(scope: !762, file: !1, line: 892, column: 44)
!762 = distinct !DILexicalBlock(scope: !763, file: !1, line: 892, column: 22)
!763 = distinct !DILexicalBlock(scope: !757, file: !1, line: 890, column: 17)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !765, file: !1, line: 901, type: !59)
!765 = distinct !DILexicalBlock(scope: !762, file: !1, line: 900, column: 18)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !767, file: !1, line: 913, type: !438)
!767 = distinct !DILexicalBlock(scope: !768, file: !1, line: 911, column: 36)
!768 = distinct !DILexicalBlock(scope: !758, file: !1, line: 911, column: 20)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !767, file: !1, line: 914, type: !615)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q2", scope: !767, file: !1, line: 914, type: !254)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !772, file: !1, line: 921, type: !18)
!772 = distinct !DILexicalBlock(scope: !773, file: !1, line: 920, column: 44)
!773 = distinct !DILexicalBlock(scope: !774, file: !1, line: 920, column: 22)
!774 = distinct !DILexicalBlock(scope: !767, file: !1, line: 916, column: 17)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !776, file: !1, line: 931, type: !59)
!776 = distinct !DILexicalBlock(scope: !773, file: !1, line: 929, column: 18)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !776, file: !1, line: 932, type: !18)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !779, file: !1, line: 940, type: !439)
