; ModuleID = 'grammar.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.grammar = type { i32, %struct.dfa*, %struct.labellist, i32, i32 }
%struct.dfa = type { i32, i8*, i32, i32, %struct.state*, i8* }
%struct.state = type { i32, %struct.arc*, i32, i32, i32*, i32 }
%struct.arc = type { i16, i16 }
%struct.labellist = type { i32, %struct.label* }
%struct.label = type { i32, i8* }

@.str = private unnamed_addr constant [23 x i8] c"no mem for new grammar\00", align 1
@.str.1 = private unnamed_addr constant [31 x i8] c"no mem to resize dfa in adddfa\00", align 1
@.str.2 = private unnamed_addr constant [35 x i8] c"no mem to resize state in addstate\00", align 1
@.str.3 = private unnamed_addr constant [36 x i8] c"no mem to resize arc list in addarc\00", align 1
@.str.4 = private unnamed_addr constant [39 x i8] c"no mem to resize labellist in addlabel\00", align 1
@Py_DebugFlag = external global i32, align 4
@.str.5 = private unnamed_addr constant [21 x i8] c"Label @ %8p, %d: %s\0A\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.6 = private unnamed_addr constant [25 x i8] c"Label %d/'%s' not found\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !76)
!1 = !DIFile(filename: "Parser/grammar.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 47, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "_ISupper", value: 256)
!7 = !DIEnumerator(name: "_ISlower", value: 512)
!8 = !DIEnumerator(name: "_ISalpha", value: 1024)
!9 = !DIEnumerator(name: "_ISdigit", value: 2048)
!10 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!11 = !DIEnumerator(name: "_ISspace", value: 8192)
!12 = !DIEnumerator(name: "_ISprint", value: 16384)
!13 = !DIEnumerator(name: "_ISgraph", value: 32768)
!14 = !DIEnumerator(name: "_ISblank", value: 1)
!15 = !DIEnumerator(name: "_IScntrl", value: 2)
!16 = !DIEnumerator(name: "_ISpunct", value: 4)
!17 = !DIEnumerator(name: "_ISalnum", value: 8)
!18 = !{!19, !73, !27, !38, !25, !44, !65, !74, !75, !33}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "grammar", file: !21, line: 67, baseType: !22)
!21 = !DIFile(filename: "Include/grammar.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!22 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 61, size: 320, align: 64, elements: !23)
!23 = !{!24, !26, !59, !71, !72}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "g_ndfas", scope: !22, file: !21, line: 62, baseType: !25, size: 32, align: 32)
!25 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "g_dfa", scope: !22, file: !21, line: 63, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "dfa", file: !21, line: 57, baseType: !29)
!29 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 50, size: 320, align: 64, elements: !30)
!30 = !{!31, !32, !35, !36, !37, !56}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !29, file: !21, line: 51, baseType: !25, size: 32, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !29, file: !21, line: 52, baseType: !33, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "d_initial", scope: !29, file: !21, line: 53, baseType: !25, size: 32, align: 32, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "d_nstates", scope: !29, file: !21, line: 54, baseType: !25, size: 32, align: 32, offset: 160)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "d_state", scope: !29, file: !21, line: 55, baseType: !38, size: 64, align: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "state", file: !21, line: 46, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 37, size: 320, align: 64, elements: !41)
!41 = !{!42, !43, !51, !52, !53, !55}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "s_narcs", scope: !40, file: !21, line: 38, baseType: !25, size: 32, align: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "s_arc", scope: !40, file: !21, line: 39, baseType: !44, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc", file: !21, line: 33, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 30, size: 32, align: 16, elements: !47)
!47 = !{!48, !50}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "a_lbl", scope: !46, file: !21, line: 31, baseType: !49, size: 16, align: 16)
!49 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "a_arrow", scope: !46, file: !21, line: 32, baseType: !49, size: 16, align: 16, offset: 16)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "s_lower", scope: !40, file: !21, line: 42, baseType: !25, size: 32, align: 32, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "s_upper", scope: !40, file: !21, line: 43, baseType: !25, size: 32, align: 32, offset: 160)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "s_accel", scope: !40, file: !21, line: 44, baseType: !54, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "s_accept", scope: !40, file: !21, line: 45, baseType: !25, size: 32, align: 32, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "d_first", scope: !29, file: !21, line: 56, baseType: !57, size: 64, align: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitset", file: !58, line: 12, baseType: !33)
!58 = !DIFile(filename: "Include/bitset.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!59 = !DIDerivedType(tag: DW_TAG_member, name: "g_ll", scope: !22, file: !21, line: 64, baseType: !60, size: 128, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "labellist", file: !21, line: 26, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 23, size: 128, align: 64, elements: !62)
!62 = !{!63, !64}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "ll_nlabels", scope: !61, file: !21, line: 24, baseType: !25, size: 32, align: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "ll_label", scope: !61, file: !21, line: 25, baseType: !65, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "label", file: !21, line: 17, baseType: !67)
!67 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 14, size: 128, align: 64, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !67, file: !21, line: 15, baseType: !25, size: 32, align: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "lb_str", scope: !67, file: !21, line: 16, baseType: !33, size: 64, align: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "g_start", scope: !22, file: !21, line: 65, baseType: !25, size: 32, align: 32, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "g_accel", scope: !22, file: !21, line: 66, baseType: !25, size: 32, align: 32, offset: 288)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!74 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!75 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!76 = !{!77, !83, !93, !99, !109, !129, !135, !141}
!77 = !DISubprogram(name: "_Py_newgrammar", scope: !1, file: !1, line: 15, type: !78, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: true, function: %struct.grammar* (i32)* @_Py_newgrammar, variables: !80)
!78 = !DISubroutineType(types: !79)
!79 = !{!19, !25}
!80 = !{!81, !82}
!81 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 1, scope: !77, file: !1, line: 15, type: !25)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !77, file: !1, line: 17, type: !19)
!83 = !DISubprogram(name: "_Py_adddfa", scope: !1, file: !1, line: 32, type: !84, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, function: %struct.dfa* (%struct.grammar*, i32, i8*)* @_Py_adddfa, variables: !88)
!84 = !DISubroutineType(types: !85)
!85 = !{!27, !19, !25, !86}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!88 = !{!89, !90, !91, !92}
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !83, file: !1, line: 32, type: !19)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 2, scope: !83, file: !1, line: 32, type: !25)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 3, scope: !83, file: !1, line: 32, type: !86)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !83, file: !1, line: 34, type: !27)
!93 = !DISubprogram(name: "_Py_addstate", scope: !1, file: !1, line: 51, type: !94, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.dfa*)* @_Py_addstate, variables: !96)
!94 = !DISubroutineType(types: !95)
!95 = !{!25, !27}
!96 = !{!97, !98}
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 1, scope: !93, file: !1, line: 51, type: !27)
!98 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !93, file: !1, line: 53, type: !38)
!99 = !DISubprogram(name: "_Py_addarc", scope: !1, file: !1, line: 70, type: !100, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.dfa*, i32, i32, i32)* @_Py_addarc, variables: !102)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !27, !25, !25, !25}
!102 = !{!103, !104, !105, !106, !107, !108}
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 1, scope: !99, file: !1, line: 70, type: !27)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "from", arg: 2, scope: !99, file: !1, line: 70, type: !25)
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "to", arg: 3, scope: !99, file: !1, line: 70, type: !25)
!106 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lbl", arg: 4, scope: !99, file: !1, line: 70, type: !25)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !99, file: !1, line: 72, type: !38)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !99, file: !1, line: 73, type: !44)
!109 = !DISubprogram(name: "_Py_addlabel", scope: !1, file: !1, line: 88, type: !110, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.labellist*, i32, i8*)* @_Py_addlabel, variables: !113)
!110 = !DISubroutineType(types: !111)
!111 = !{!25, !112, !25, !86}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!113 = !{!114, !115, !116, !117, !118, !119, !128}
