; ModuleID = 'hashtable.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Py_hashtable_entry_t = type { %struct._Py_slist_item_s, i8*, i64 }
%struct._Py_slist_item_s = type { %struct._Py_slist_item_s* }
%struct._Py_hashtable_t = type { i64, i64, %struct._Py_slist_t*, i64, i64 (i8*)*, i32 (i8*, %struct._Py_hashtable_entry_t*)*, i8* (i8*)*, void (i8*)*, i64 (i8*)*, %struct._Py_hashtable_allocator_t }
%struct._Py_slist_t = type { %struct._Py_slist_item_s* }
%struct._Py_hashtable_allocator_t = type { i8* (i64)*, void (i8*)* }

; Function Attrs: nounwind readnone uwtable
define i64 @_Py_hashtable_hash_int(i8* %key) #0 {
entry:
  tail call void @llvm.dbg.value(metadata i8* %key, i64 0, metadata !83, metadata !272), !dbg !273
  %0 = ptrtoint i8* %key to i64, !dbg !274
  ret i64 %0, !dbg !275
}

; Function Attrs: nounwind readnone
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1

; Function Attrs: nounwind uwtable
define i64 @_Py_hashtable_hash_ptr(i8* %key) #2 {
entry:
  tail call void @llvm.dbg.value(metadata i8* %key, i64 0, metadata !86, metadata !272), !dbg !276
  %call = tail call i64 @_Py_HashPointer(i8* %key) #5, !dbg !277
  ret i64 %call, !dbg !278
}

declare i64 @_Py_HashPointer(i8*) #3

; Function Attrs: nounwind readonly uwtable
define i32 @_Py_hashtable_compare_direct(i8* readnone %key, %struct._Py_hashtable_entry_t* nocapture readonly %entry1) #4 {
entry:

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !80)
!1 = !DIFile(filename: "./Modules/hashtable.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !9, !10, !75, !18, !76, !77, !23, !79, !6}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_uhash_t", file: !5, line: 189, baseType: !6)
!5 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !7, line: 62, baseType: !8)
!7 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!8 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_t", file: !12, line: 67, baseType: !13)
!12 = !DIFile(filename: "./Modules/hashtable.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!13 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 55, size: 704, align: 64, elements: !14)
!14 = !{!15, !16, !17, !29, !30, !37, !51, !56, !61, !66}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "num_buckets", scope: !13, file: !12, line: 56, baseType: !6, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !13, file: !12, line: 57, baseType: !6, size: 64, align: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !13, file: !12, line: 58, baseType: !18, size: 64, align: 64, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_slist_t", file: !12, line: 13, baseType: !20)
!20 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 11, size: 64, align: 64, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !20, file: !12, line: 12, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_slist_item_t", file: !12, line: 9, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_slist_item_s", file: !12, line: 7, size: 64, align: 64, elements: !26)
!26 = !{!27}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !25, file: !12, line: 8, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !13, file: !12, line: 59, baseType: !6, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "hash_func", scope: !13, file: !12, line: 61, baseType: !31, size: 64, align: 64, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_hash_func", file: !12, line: 41, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{!4, !35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "compare_func", scope: !13, file: !12, line: 62, baseType: !38, size: 64, align: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_compare_func", file: !12, line: 42, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !35, !43}
!42 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_entry_t", file: !12, line: 27, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 19, size: 192, align: 64, elements: !47)
!47 = !{!48, !49, !50}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_Py_slist_item", scope: !46, file: !12, line: 21, baseType: !24, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !46, file: !12, line: 23, baseType: !35, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "key_hash", scope: !46, file: !12, line: 24, baseType: !4, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "copy_data_func", scope: !13, file: !12, line: 63, baseType: !52, size: 64, align: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_copy_data_func", file: !12, line: 43, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!9, !9}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "free_data_func", scope: !13, file: !12, line: 64, baseType: !57, size: 64, align: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_free_data_func", file: !12, line: 44, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !9}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "get_data_size_func", scope: !13, file: !12, line: 65, baseType: !62, size: 64, align: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_get_data_size_func", file: !12, line: 45, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!6, !9}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !13, file: !12, line: 66, baseType: !67, size: 128, align: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_allocator_t", file: !12, line: 53, baseType: !68)
!68 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 47, size: 128, align: 64, elements: !69)
!69 = !{!70, !74}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !68, file: !12, line: 49, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!9, !6}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !68, file: !12, line: 52, baseType: !58, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!79 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!80 = !{!81, !84, !87, !91, !107, !114, !131, !140, !151, !158, !164, !170, !189, !197, !207, !218, !224, !230, !240, !247, !264}
!81 = !DISubprogram(name: "_Py_hashtable_hash_int", scope: !1, file: !1, line: 91, type: !33, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8*)* @_Py_hashtable_hash_int, variables: !82)
!82 = !{!83}
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !81, file: !1, line: 91, type: !35)
!84 = !DISubprogram(name: "_Py_hashtable_hash_ptr", scope: !1, file: !1, line: 97, type: !33, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8*)* @_Py_hashtable_hash_ptr, variables: !85)
!85 = !{!86}
!86 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !84, file: !1, line: 97, type: !35)
!87 = !DISubprogram(name: "_Py_hashtable_compare_direct", scope: !1, file: !1, line: 103, type: !40, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._Py_hashtable_entry_t*)* @_Py_hashtable_compare_direct, variables: !88)
!88 = !{!89, !90}
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !87, file: !1, line: 103, type: !35)
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "entry", arg: 2, scope: !87, file: !1, line: 103, type: !43)
!91 = !DISubprogram(name: "_Py_hashtable_new_full", scope: !1, file: !1, line: 122, type: !92, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: true, function: %struct._Py_hashtable_t* (i64, i64, i64 (i8*)*, i32 (i8*, %struct._Py_hashtable_entry_t*)*, i8* (i8*)*, void (i8*)*, i64 (i8*)*, %struct._Py_hashtable_allocator_t*)* @_Py_hashtable_new_full, variables: !95)
!92 = !DISubroutineType(types: !93)
!93 = !{!10, !6, !6, !31, !38, !52, !57, !62, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!95 = !{!96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data_size", arg: 1, scope: !91, file: !1, line: 122, type: !6)
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "init_size", arg: 2, scope: !91, file: !1, line: 122, type: !6)
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hash_func", arg: 3, scope: !91, file: !1, line: 123, type: !31)
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "compare_func", arg: 4, scope: !91, file: !1, line: 124, type: !38)
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "copy_data_func", arg: 5, scope: !91, file: !1, line: 125, type: !52)
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "free_data_func", arg: 6, scope: !91, file: !1, line: 126, type: !57)
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "get_data_size_func", arg: 7, scope: !91, file: !1, line: 127, type: !62)
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "allocator", arg: 8, scope: !91, file: !1, line: 128, type: !94)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ht", scope: !91, file: !1, line: 130, type: !10)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buckets_size", scope: !91, file: !1, line: 131, type: !6)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alloc", scope: !91, file: !1, line: 132, type: !67)
