; ModuleID = 'import.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._inittab = type { i8*, %struct._object* ()* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !11, subprograms: !556, globals: !1392)
!1 = !DIFile(filename: "Python/import.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !4, line: 23, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!7 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!8 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!9 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!10 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!11 = !{!12, !13, !351, !465, !466, !474, !481, !492, !60, !387, !37, !518, !102, !19, !537, !543, !545, !417, !25}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !15, line: 109, baseType: !16)
!15 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !15, line: 105, size: 128, align: 64, elements: !17)
!17 = !{!18, !26}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !16, file: !15, line: 107, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !20, line: 177, baseType: !21)
!20 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !22, line: 102, baseType: !23)
!22 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !24, line: 181, baseType: !25)
!24 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!25 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !16, file: !15, line: 108, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !15, line: 334, size: 3200, align: 64, elements: !29)
!29 = !{!30, !36, !40, !41, !42, !47, !110, !115, !120, !121, !126, !178, !209, !221, !227, !228, !229, !231, !233, !264, !265, !266, !275, !276, !281, !282, !284, !286, !296, !299, !317, !318, !319, !321, !323, !324, !326, !331, !336, !341, !342, !343, !344, !345, !346, !347, !348, !350}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !28, file: !15, line: 335, baseType: !31, size: 192, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !15, line: 114, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 111, size: 192, align: 64, elements: !33)
!33 = !{!34, !35}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !32, file: !15, line: 112, baseType: !14, size: 128, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !32, file: !15, line: 113, baseType: !19, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !28, file: !15, line: 336, baseType: !37, size: 64, align: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !28, file: !15, line: 337, baseType: !19, size: 64, align: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !28, file: !15, line: 337, baseType: !19, size: 64, align: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !28, file: !15, line: 341, baseType: !43, size: 64, align: 64, offset: 384)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !15, line: 308, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !13}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !28, file: !15, line: 342, baseType: !48, size: 64, align: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !15, line: 314, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!52, !13, !53, !52}
!52 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !22, line: 48, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !56, line: 246, size: 1728, align: 64, elements: !57)
!56 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!57 = !{!58, !59, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !79, !80, !81, !82, !84, !86, !88, !92, !95, !97, !98, !99, !100, !101, !105, !106}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !55, file: !56, line: 247, baseType: !52, size: 32, align: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !55, file: !56, line: 252, baseType: !60, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !55, file: !56, line: 253, baseType: !60, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !55, file: !56, line: 254, baseType: !60, size: 64, align: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !55, file: !56, line: 255, baseType: !60, size: 64, align: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !55, file: !56, line: 256, baseType: !60, size: 64, align: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !55, file: !56, line: 257, baseType: !60, size: 64, align: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !55, file: !56, line: 258, baseType: !60, size: 64, align: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !55, file: !56, line: 259, baseType: !60, size: 64, align: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !55, file: !56, line: 261, baseType: !60, size: 64, align: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !55, file: !56, line: 262, baseType: !60, size: 64, align: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !55, file: !56, line: 263, baseType: !60, size: 64, align: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !55, file: !56, line: 265, baseType: !72, size: 64, align: 64, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !56, line: 161, size: 192, align: 64, elements: !74)
!74 = !{!75, !76, !78}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !73, file: !56, line: 162, baseType: !72, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !73, file: !56, line: 163, baseType: !77, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !73, file: !56, line: 167, baseType: !52, size: 32, align: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !55, file: !56, line: 267, baseType: !77, size: 64, align: 64, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !55, file: !56, line: 269, baseType: !52, size: 32, align: 32, offset: 896)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !55, file: !56, line: 273, baseType: !52, size: 32, align: 32, offset: 928)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !55, file: !56, line: 275, baseType: !83, size: 64, align: 64, offset: 960)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !24, line: 140, baseType: !25)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !55, file: !56, line: 279, baseType: !85, size: 16, align: 16, offset: 1024)
!85 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !55, file: !56, line: 280, baseType: !87, size: 8, align: 8, offset: 1040)
!87 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !55, file: !56, line: 281, baseType: !89, size: 8, align: 8, offset: 1048)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 8, align: 8, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 1)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !55, file: !56, line: 285, baseType: !93, size: 64, align: 64, offset: 1088)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !56, line: 155, baseType: null)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !55, file: !56, line: 294, baseType: !96, size: 64, align: 64, offset: 1152)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !24, line: 141, baseType: !25)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !55, file: !56, line: 303, baseType: !12, size: 64, align: 64, offset: 1216)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !55, file: !56, line: 304, baseType: !12, size: 64, align: 64, offset: 1280)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !55, file: !56, line: 305, baseType: !12, size: 64, align: 64, offset: 1344)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !55, file: !56, line: 306, baseType: !12, size: 64, align: 64, offset: 1408)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !55, file: !56, line: 307, baseType: !102, size: 64, align: 64, offset: 1472)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !103, line: 62, baseType: !104)
!103 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!104 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !55, file: !56, line: 309, baseType: !52, size: 32, align: 32, offset: 1536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !55, file: !56, line: 311, baseType: !107, size: 160, align: 8, offset: 1568)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 160, align: 8, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 20)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !28, file: !15, line: 343, baseType: !111, size: 64, align: 64, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !15, line: 316, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!13, !13, !60}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !28, file: !15, line: 344, baseType: !116, size: 64, align: 64, offset: 576)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !15, line: 318, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!52, !13, !60, !13}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !28, file: !15, line: 345, baseType: !12, size: 64, align: 64, offset: 640)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !28, file: !15, line: 346, baseType: !122, size: 64, align: 64, offset: 704)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !15, line: 320, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!13, !13}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !28, file: !15, line: 350, baseType: !127, size: 64, align: 64, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !15, line: 278, baseType: !129)
!129 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 236, size: 2176, align: 64, elements: !130)
!130 = !{!131, !136, !137, !138, !139, !140, !145, !147, !148, !149, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !129, file: !15, line: 241, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !15, line: 166, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!13, !13, !13}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !129, file: !15, line: 242, baseType: !132, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !129, file: !15, line: 243, baseType: !132, size: 64, align: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !129, file: !15, line: 244, baseType: !132, size: 64, align: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !129, file: !15, line: 245, baseType: !132, size: 64, align: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !129, file: !15, line: 246, baseType: !141, size: 64, align: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !15, line: 167, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!13, !13, !13, !13}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !129, file: !15, line: 247, baseType: !146, size: 64, align: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !15, line: 165, baseType: !123)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !129, file: !15, line: 248, baseType: !146, size: 64, align: 64, offset: 448)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !129, file: !15, line: 249, baseType: !146, size: 64, align: 64, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !129, file: !15, line: 250, baseType: !150, size: 64, align: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !15, line: 168, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!52, !13}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !129, file: !15, line: 251, baseType: !146, size: 64, align: 64, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !129, file: !15, line: 252, baseType: !132, size: 64, align: 64, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !129, file: !15, line: 253, baseType: !132, size: 64, align: 64, offset: 768)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !129, file: !15, line: 254, baseType: !132, size: 64, align: 64, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !129, file: !15, line: 255, baseType: !132, size: 64, align: 64, offset: 896)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !129, file: !15, line: 256, baseType: !132, size: 64, align: 64, offset: 960)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !129, file: !15, line: 257, baseType: !146, size: 64, align: 64, offset: 1024)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !129, file: !15, line: 258, baseType: !12, size: 64, align: 64, offset: 1088)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !129, file: !15, line: 259, baseType: !146, size: 64, align: 64, offset: 1152)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !129, file: !15, line: 261, baseType: !132, size: 64, align: 64, offset: 1216)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !129, file: !15, line: 262, baseType: !132, size: 64, align: 64, offset: 1280)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !129, file: !15, line: 263, baseType: !132, size: 64, align: 64, offset: 1344)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !129, file: !15, line: 264, baseType: !132, size: 64, align: 64, offset: 1408)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !129, file: !15, line: 265, baseType: !141, size: 64, align: 64, offset: 1472)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !129, file: !15, line: 266, baseType: !132, size: 64, align: 64, offset: 1536)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !129, file: !15, line: 267, baseType: !132, size: 64, align: 64, offset: 1600)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !129, file: !15, line: 268, baseType: !132, size: 64, align: 64, offset: 1664)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !129, file: !15, line: 269, baseType: !132, size: 64, align: 64, offset: 1728)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !129, file: !15, line: 270, baseType: !132, size: 64, align: 64, offset: 1792)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !129, file: !15, line: 272, baseType: !132, size: 64, align: 64, offset: 1856)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !129, file: !15, line: 273, baseType: !132, size: 64, align: 64, offset: 1920)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !129, file: !15, line: 274, baseType: !132, size: 64, align: 64, offset: 1984)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !129, file: !15, line: 275, baseType: !132, size: 64, align: 64, offset: 2048)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !129, file: !15, line: 277, baseType: !146, size: 64, align: 64, offset: 2112)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !28, file: !15, line: 351, baseType: !179, size: 64, align: 64, offset: 832)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !15, line: 292, baseType: !181)
!181 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 280, size: 640, align: 64, elements: !182)
!182 = !{!183, !188, !189, !194, !195, !196, !201, !202, !207, !208}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !181, file: !15, line: 281, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !15, line: 169, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!19, !13}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !181, file: !15, line: 282, baseType: !132, size: 64, align: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !181, file: !15, line: 283, baseType: !190, size: 64, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !15, line: 170, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!13, !13, !19}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !181, file: !15, line: 284, baseType: !190, size: 64, align: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !181, file: !15, line: 285, baseType: !12, size: 64, align: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !181, file: !15, line: 286, baseType: !197, size: 64, align: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !15, line: 172, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!52, !13, !19, !13}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !181, file: !15, line: 287, baseType: !12, size: 64, align: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !181, file: !15, line: 288, baseType: !203, size: 64, align: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !15, line: 231, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!52, !13, !13}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !181, file: !15, line: 290, baseType: !132, size: 64, align: 64, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !181, file: !15, line: 291, baseType: !190, size: 64, align: 64, offset: 576)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !28, file: !15, line: 352, baseType: !210, size: 64, align: 64, offset: 896)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !15, line: 298, baseType: !212)
!212 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 294, size: 192, align: 64, elements: !213)
!213 = !{!214, !215, !216}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !212, file: !15, line: 295, baseType: !184, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !212, file: !15, line: 296, baseType: !132, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !212, file: !15, line: 297, baseType: !217, size: 64, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !15, line: 174, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!52, !13, !13, !13}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !28, file: !15, line: 356, baseType: !222, size: 64, align: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !15, line: 321, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!226, !13}
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !20, line: 186, baseType: !19)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !28, file: !15, line: 357, baseType: !141, size: 64, align: 64, offset: 1024)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !28, file: !15, line: 358, baseType: !122, size: 64, align: 64, offset: 1088)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !28, file: !15, line: 359, baseType: !230, size: 64, align: 64, offset: 1152)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !15, line: 317, baseType: !133)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !28, file: !15, line: 360, baseType: !232, size: 64, align: 64, offset: 1216)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !15, line: 319, baseType: !218)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !28, file: !15, line: 363, baseType: !234, size: 64, align: 64, offset: 1280)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !15, line: 304, baseType: !236)
!236 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 301, size: 128, align: 64, elements: !237)
!237 = !{!238, !259}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !236, file: !15, line: 302, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !15, line: 193, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!52, !13, !243, !52}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !15, line: 191, baseType: !245)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !15, line: 178, size: 640, align: 64, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254, !256, !257, !258}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !245, file: !15, line: 179, baseType: !12, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !245, file: !15, line: 180, baseType: !13, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !245, file: !15, line: 181, baseType: !19, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !245, file: !15, line: 182, baseType: !19, size: 64, align: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !245, file: !15, line: 184, baseType: !52, size: 32, align: 32, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !245, file: !15, line: 185, baseType: !52, size: 32, align: 32, offset: 288)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !245, file: !15, line: 186, baseType: !60, size: 64, align: 64, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !245, file: !15, line: 187, baseType: !255, size: 64, align: 64, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !245, file: !15, line: 188, baseType: !255, size: 64, align: 64, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !245, file: !15, line: 189, baseType: !255, size: 64, align: 64, offset: 512)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !245, file: !15, line: 190, baseType: !12, size: 64, align: 64, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !236, file: !15, line: 303, baseType: !260, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !15, line: 194, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !13, !243}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !28, file: !15, line: 366, baseType: !104, size: 64, align: 64, offset: 1344)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !28, file: !15, line: 368, baseType: !37, size: 64, align: 64, offset: 1408)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !28, file: !15, line: 372, baseType: !267, size: 64, align: 64, offset: 1472)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !15, line: 233, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!52, !13, !271, !12}
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !15, line: 232, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!52, !13, !12}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !28, file: !15, line: 375, baseType: !150, size: 64, align: 64, offset: 1536)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !28, file: !15, line: 379, baseType: !277, size: 64, align: 64, offset: 1600)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !15, line: 322, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!13, !13, !13, !52}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !28, file: !15, line: 382, baseType: !19, size: 64, align: 64, offset: 1664)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !28, file: !15, line: 385, baseType: !283, size: 64, align: 64, offset: 1728)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !15, line: 323, baseType: !123)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !28, file: !15, line: 386, baseType: !285, size: 64, align: 64, offset: 1792)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !15, line: 324, baseType: !123)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !28, file: !15, line: 389, baseType: !287, size: 64, align: 64, offset: 1856)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !289, line: 40, size: 256, align: 64, elements: !290)
!289 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!290 = !{!291, !292, !294, !295}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !288, file: !289, line: 41, baseType: !37, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !288, file: !289, line: 42, baseType: !293, size: 64, align: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !289, line: 18, baseType: !133)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !288, file: !289, line: 43, baseType: !52, size: 32, align: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !288, file: !289, line: 45, baseType: !37, size: 64, align: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !28, file: !15, line: 390, baseType: !297, size: 64, align: 64, offset: 1920)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !15, line: 390, flags: DIFlagFwdDecl)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !28, file: !15, line: 391, baseType: !300, size: 64, align: 64, offset: 1984)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !302, line: 11, size: 320, align: 64, elements: !303)
!302 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!303 = !{!304, !305, !310, !315, !316}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !301, file: !302, line: 12, baseType: !60, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !301, file: !302, line: 13, baseType: !306, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !302, line: 8, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!13, !13, !12}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !301, file: !302, line: 14, baseType: !311, size: 64, align: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !302, line: 9, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!52, !13, !13, !12}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !301, file: !302, line: 15, baseType: !60, size: 64, align: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !301, file: !302, line: 16, baseType: !12, size: 64, align: 64, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !28, file: !15, line: 392, baseType: !27, size: 64, align: 64, offset: 2048)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !28, file: !15, line: 393, baseType: !13, size: 64, align: 64, offset: 2112)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !28, file: !15, line: 394, baseType: !320, size: 64, align: 64, offset: 2176)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !15, line: 325, baseType: !142)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !28, file: !15, line: 395, baseType: !322, size: 64, align: 64, offset: 2240)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !15, line: 326, baseType: !218)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !28, file: !15, line: 396, baseType: !19, size: 64, align: 64, offset: 2304)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !28, file: !15, line: 397, baseType: !325, size: 64, align: 64, offset: 2368)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !15, line: 327, baseType: !218)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !28, file: !15, line: 398, baseType: !327, size: 64, align: 64, offset: 2432)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !15, line: 329, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!13, !27, !19}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !28, file: !15, line: 399, baseType: !332, size: 64, align: 64, offset: 2496)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !15, line: 328, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!13, !27, !13, !13}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !28, file: !15, line: 400, baseType: !337, size: 64, align: 64, offset: 2560)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !15, line: 307, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !12}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !28, file: !15, line: 401, baseType: !150, size: 64, align: 64, offset: 2624)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !28, file: !15, line: 402, baseType: !13, size: 64, align: 64, offset: 2688)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !28, file: !15, line: 403, baseType: !13, size: 64, align: 64, offset: 2752)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !28, file: !15, line: 404, baseType: !13, size: 64, align: 64, offset: 2816)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !28, file: !15, line: 405, baseType: !13, size: 64, align: 64, offset: 2880)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !28, file: !15, line: 406, baseType: !13, size: 64, align: 64, offset: 2944)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !28, file: !15, line: 407, baseType: !43, size: 64, align: 64, offset: 3008)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !28, file: !15, line: 410, baseType: !349, size: 32, align: 32, offset: 3072)
!349 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !28, file: !15, line: 412, baseType: !43, size: 64, align: 64, offset: 3136)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !353, line: 139, baseType: !354)
!353 = !DIFile(filename: "Include/pystate.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !353, line: 69, size: 1536, align: 64, elements: !355)
!355 = !{!356, !358, !359, !379, !438, !439, !440, !441, !442, !443, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !354, file: !353, line: 72, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !354, file: !353, line: 73, baseType: !357, size: 64, align: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !354, file: !353, line: 74, baseType: !360, size: 64, align: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !353, line: 44, baseType: !362)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !353, line: 19, size: 832, align: 64, elements: !363)
!363 = !{!364, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !362, file: !353, line: 21, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !362, file: !353, line: 22, baseType: !357, size: 64, align: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !362, file: !353, line: 24, baseType: !13, size: 64, align: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !362, file: !353, line: 25, baseType: !13, size: 64, align: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !362, file: !353, line: 26, baseType: !13, size: 64, align: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !362, file: !353, line: 27, baseType: !13, size: 64, align: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !362, file: !353, line: 28, baseType: !13, size: 64, align: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !362, file: !353, line: 30, baseType: !13, size: 64, align: 64, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !362, file: !353, line: 31, baseType: !13, size: 64, align: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !362, file: !353, line: 32, baseType: !13, size: 64, align: 64, offset: 576)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !362, file: !353, line: 33, baseType: !52, size: 32, align: 32, offset: 640)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !362, file: !353, line: 34, baseType: !52, size: 32, align: 32, offset: 672)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !362, file: !353, line: 37, baseType: !52, size: 32, align: 32, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !362, file: !353, line: 43, baseType: !13, size: 64, align: 64, offset: 768)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !354, file: !353, line: 76, baseType: !380, size: 64, align: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !382, line: 17, size: 3072, align: 64, elements: !383)
!382 = !DIFile(filename: "Include/frameobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!383 = !{!384, !385, !386, !413, !414, !415, !416, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !436}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !381, file: !382, line: 18, baseType: !31, size: 192, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "f_back", scope: !381, file: !382, line: 19, baseType: !380, size: 64, align: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "f_code", scope: !381, file: !382, line: 20, baseType: !387, size: 64, align: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !389, line: 33, baseType: !390)
!389 = !DIFile(filename: "Include/code.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!390 = !DICompositeType(tag: DW_TAG_structure_type, file: !389, line: 11, size: 1152, align: 64, elements: !391)
!391 = !{!392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !407, !408, !409, !410, !411, !412}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !390, file: !389, line: 12, baseType: !14, size: 128, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !390, file: !389, line: 13, baseType: !52, size: 32, align: 32, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !390, file: !389, line: 14, baseType: !52, size: 32, align: 32, offset: 160)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !390, file: !389, line: 15, baseType: !52, size: 32, align: 32, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !390, file: !389, line: 16, baseType: !52, size: 32, align: 32, offset: 224)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !390, file: !389, line: 17, baseType: !52, size: 32, align: 32, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "co_code", scope: !390, file: !389, line: 18, baseType: !13, size: 64, align: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !390, file: !389, line: 19, baseType: !13, size: 64, align: 64, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !390, file: !389, line: 20, baseType: !13, size: 64, align: 64, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "co_varnames", scope: !390, file: !389, line: 21, baseType: !13, size: 64, align: 64, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "co_freevars", scope: !390, file: !389, line: 22, baseType: !13, size: 64, align: 64, offset: 576)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "co_cellvars", scope: !390, file: !389, line: 23, baseType: !13, size: 64, align: 64, offset: 640)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "co_cell2arg", scope: !390, file: !389, line: 25, baseType: !405, size: 64, align: 64, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !390, file: !389, line: 26, baseType: !13, size: 64, align: 64, offset: 768)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !390, file: !389, line: 27, baseType: !13, size: 64, align: 64, offset: 832)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !390, file: !389, line: 28, baseType: !52, size: 32, align: 32, offset: 896)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "co_lnotab", scope: !390, file: !389, line: 29, baseType: !13, size: 64, align: 64, offset: 960)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "co_zombieframe", scope: !390, file: !389, line: 31, baseType: !12, size: 64, align: 64, offset: 1024)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !390, file: !389, line: 32, baseType: !13, size: 64, align: 64, offset: 1088)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "f_builtins", scope: !381, file: !382, line: 21, baseType: !13, size: 64, align: 64, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "f_globals", scope: !381, file: !382, line: 22, baseType: !13, size: 64, align: 64, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "f_locals", scope: !381, file: !382, line: 23, baseType: !13, size: 64, align: 64, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "f_valuestack", scope: !381, file: !382, line: 24, baseType: !417, size: 64, align: 64, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "f_stacktop", scope: !381, file: !382, line: 28, baseType: !417, size: 64, align: 64, offset: 576)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "f_trace", scope: !381, file: !382, line: 29, baseType: !13, size: 64, align: 64, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_type", scope: !381, file: !382, line: 38, baseType: !13, size: 64, align: 64, offset: 704)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_value", scope: !381, file: !382, line: 38, baseType: !13, size: 64, align: 64, offset: 768)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_traceback", scope: !381, file: !382, line: 38, baseType: !13, size: 64, align: 64, offset: 832)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "f_gen", scope: !381, file: !382, line: 40, baseType: !13, size: 64, align: 64, offset: 896)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "f_lasti", scope: !381, file: !382, line: 42, baseType: !52, size: 32, align: 32, offset: 960)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "f_lineno", scope: !381, file: !382, line: 48, baseType: !52, size: 32, align: 32, offset: 992)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "f_iblock", scope: !381, file: !382, line: 49, baseType: !52, size: 32, align: 32, offset: 1024)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "f_executing", scope: !381, file: !382, line: 50, baseType: !39, size: 8, align: 8, offset: 1056)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "f_blockstack", scope: !381, file: !382, line: 51, baseType: !429, size: 1920, align: 32, offset: 1088)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 1920, align: 32, elements: !108)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTryBlock", file: !382, line: 15, baseType: !431)
!431 = !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 11, size: 96, align: 32, elements: !432)
!432 = !{!433, !434, !435}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "b_type", scope: !431, file: !382, line: 12, baseType: !52, size: 32, align: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "b_handler", scope: !431, file: !382, line: 13, baseType: !52, size: 32, align: 32, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "b_level", scope: !431, file: !382, line: 14, baseType: !52, size: 32, align: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "f_localsplus", scope: !381, file: !382, line: 52, baseType: !437, size: 64, align: 64, offset: 3008)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 64, align: 64, elements: !90)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !354, file: !353, line: 77, baseType: !52, size: 32, align: 32, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !354, file: !353, line: 78, baseType: !39, size: 8, align: 8, offset: 288)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !354, file: !353, line: 80, baseType: !39, size: 8, align: 8, offset: 296)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !354, file: !353, line: 85, baseType: !52, size: 32, align: 32, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !354, file: !353, line: 86, baseType: !52, size: 32, align: 32, offset: 352)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !354, file: !353, line: 88, baseType: !444, size: 64, align: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !353, line: 54, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!52, !13, !380, !52, !13}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !354, file: !353, line: 89, baseType: !444, size: 64, align: 64, offset: 448)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !354, file: !353, line: 90, baseType: !13, size: 64, align: 64, offset: 512)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !354, file: !353, line: 91, baseType: !13, size: 64, align: 64, offset: 576)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !354, file: !353, line: 93, baseType: !13, size: 64, align: 64, offset: 640)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !354, file: !353, line: 94, baseType: !13, size: 64, align: 64, offset: 704)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !354, file: !353, line: 95, baseType: !13, size: 64, align: 64, offset: 768)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !354, file: !353, line: 97, baseType: !13, size: 64, align: 64, offset: 832)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !354, file: !353, line: 98, baseType: !13, size: 64, align: 64, offset: 896)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !354, file: !353, line: 99, baseType: !13, size: 64, align: 64, offset: 960)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !354, file: !353, line: 101, baseType: !13, size: 64, align: 64, offset: 1024)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !354, file: !353, line: 103, baseType: !52, size: 32, align: 32, offset: 1088)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !354, file: !353, line: 105, baseType: !13, size: 64, align: 64, offset: 1152)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !354, file: !353, line: 106, baseType: !25, size: 64, align: 64, offset: 1216)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !354, file: !353, line: 108, baseType: !52, size: 32, align: 32, offset: 1280)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !354, file: !353, line: 109, baseType: !13, size: 64, align: 64, offset: 1344)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !354, file: !353, line: 134, baseType: !338, size: 64, align: 64, offset: 1408)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !354, file: !353, line: 135, baseType: !12, size: 64, align: 64, offset: 1472)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !468, line: 40, baseType: !469)
!468 = !DIFile(filename: "Include/listobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!469 = !DICompositeType(tag: DW_TAG_structure_type, file: !468, line: 23, size: 320, align: 64, elements: !470)
!470 = !{!471, !472, !473}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !469, file: !468, line: 24, baseType: !31, size: 192, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !469, file: !468, line: 26, baseType: !417, size: 64, align: 64, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !469, file: !468, line: 39, baseType: !19, size: 64, align: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !476, line: 33, baseType: !477)
!476 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!477 = !DICompositeType(tag: DW_TAG_structure_type, file: !476, line: 25, size: 256, align: 64, elements: !478)
!478 = !{!479, !480}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !477, file: !476, line: 26, baseType: !31, size: 192, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !477, file: !476, line: 27, baseType: !437, size: 64, align: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyWeakReference", file: !483, line: 10, baseType: !484)
!483 = !DIFile(filename: "Include/weakrefobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyWeakReference", file: !483, line: 16, size: 448, align: 64, elements: !485)
!485 = !{!486, !487, !488, !489, !490, !491}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !484, file: !483, line: 17, baseType: !14, size: 128, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "wr_object", scope: !484, file: !483, line: 23, baseType: !13, size: 64, align: 64, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "wr_callback", scope: !484, file: !483, line: 26, baseType: !13, size: 64, align: 64, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !484, file: !483, line: 31, baseType: !226, size: 64, align: 64, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "wr_prev", scope: !484, file: !483, line: 38, baseType: !481, size: 64, align: 64, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "wr_next", scope: !484, file: !483, line: 39, baseType: !481, size: 64, align: 64, offset: 384)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef", file: !494, line: 57, baseType: !495)
!494 = !DIFile(filename: "Include/moduleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !494, line: 47, size: 832, align: 64, elements: !496)
!496 = !{!497, !508, !509, !510, !511, !514, !515, !516, !517}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !495, file: !494, line: 48, baseType: !498, size: 320, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !494, line: 38, baseType: !499)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !494, line: 33, size: 320, align: 64, elements: !500)
!500 = !{!501, !502, !506, !507}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !499, file: !494, line: 34, baseType: !14, size: 128, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !499, file: !494, line: 35, baseType: !503, size: 64, align: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!13}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !499, file: !494, line: 36, baseType: !19, size: 64, align: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !499, file: !494, line: 37, baseType: !13, size: 64, align: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !495, file: !494, line: 49, baseType: !37, size: 64, align: 64, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !495, file: !494, line: 50, baseType: !37, size: 64, align: 64, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !495, file: !494, line: 51, baseType: !19, size: 64, align: 64, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !495, file: !494, line: 52, baseType: !512, size: 64, align: 64, offset: 512)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !289, line: 47, baseType: !288)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !495, file: !494, line: 53, baseType: !150, size: 64, align: 64, offset: 576)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !495, file: !494, line: 54, baseType: !267, size: 64, align: 64, offset: 640)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !495, file: !494, line: 55, baseType: !150, size: 64, align: 64, offset: 704)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !495, file: !494, line: 56, baseType: !337, size: 64, align: 64, offset: 768)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !520, line: 351, baseType: !521)
!520 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!521 = !DICompositeType(tag: DW_TAG_structure_type, file: !520, line: 217, size: 384, align: 64, elements: !522)
!522 = !{!523, !524, !525, !526, !534}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !521, file: !520, line: 291, baseType: !14, size: 128, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !521, file: !520, line: 292, baseType: !19, size: 64, align: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !521, file: !520, line: 293, baseType: !226, size: 64, align: 64, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !521, file: !520, line: 349, baseType: !527, size: 32, align: 32, offset: 256)
!527 = !DICompositeType(tag: DW_TAG_structure_type, scope: !521, file: !520, line: 294, size: 32, align: 32, elements: !528)
!528 = !{!529, !530, !531, !532, !533}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !527, file: !520, line: 303, baseType: !349, size: 2, align: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !527, file: !520, line: 331, baseType: !349, size: 3, align: 32, offset: 2)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !527, file: !520, line: 336, baseType: !349, size: 1, align: 32, offset: 5)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !527, file: !520, line: 340, baseType: !349, size: 1, align: 32, offset: 6)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !527, file: !520, line: 345, baseType: !349, size: 1, align: 32, offset: 7)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !521, file: !520, line: 350, baseType: !535, size: 64, align: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !103, line: 90, baseType: !52)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "_inittab", file: !539, line: 99, size: 128, align: 64, elements: !540)
!539 = !DIFile(filename: "Include/import.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!540 = !{!541, !542}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !538, file: !539, line: 100, baseType: !37, size: 64, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !538, file: !539, line: 101, baseType: !503, size: 64, align: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !15, line: 422, baseType: !28)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTracebackObject", file: !547, line: 20, baseType: !548)
!547 = !DIFile(filename: "Include/traceback.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "_traceback", file: !547, line: 14, size: 320, align: 64, elements: !549)
!549 = !{!550, !551, !553, !554, !555}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !548, file: !547, line: 15, baseType: !14, size: 128, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "tb_next", scope: !548, file: !547, line: 16, baseType: !552, size: 64, align: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "tb_frame", scope: !548, file: !547, line: 17, baseType: !380, size: 64, align: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "tb_lasti", scope: !548, file: !547, line: 18, baseType: !52, size: 32, align: 32, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "tb_lineno", scope: !548, file: !547, line: 19, baseType: !52, size: 32, align: 32, offset: 288)
!556 = !{!557, !562, !573, !587, !593, !598, !603, !611, !627, !683, !692, !696, !719, !729, !751, !760, !771, !778, !784, !791, !824, !840, !848, !878, !887, !894, !897, !1024, !1037, !1045, !1070, !1079, !1087, !1097, !1106, !1111, !1114, !1119, !1123, !1133, !1150, !1156, !1183, !1189, !1211, !1215, !1218, !1222, !1225, !1229, !1232, !1238, !1242, !1247, !1253, !1257, !1262, !1268, !1276, !1290, !1296, !1304, !1310, !1314, !1319, !1325, !1330, !1338, !1356, !1363, !1370, !1379}
!557 = !DISubprogram(name: "_PyImport_Init", scope: !1, file: !1, line: 50, type: !558, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_PyImport_Init, variables: !560)
!558 = !DISubroutineType(types: !559)
!559 = !{null}
!560 = !{!561}
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp", scope: !557, file: !1, line: 52, type: !360)
!562 = !DISubprogram(name: "_PyImportHooks_Init", scope: !1, file: !1, line: 62, type: !558, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_PyImportHooks_Init, variables: !563)
!563 = !{!564, !565, !566, !567, !569, !571}
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !562, file: !1, line: 64, type: !13)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path_hooks", scope: !562, file: !1, line: 64, type: !13)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !562, file: !1, line: 65, type: !52)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !568, file: !1, line: 72, type: !13)
!568 = distinct !DILexicalBlock(scope: !562, file: !1, line: 72, column: 5)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !570, file: !1, line: 79, type: !13)
!570 = distinct !DILexicalBlock(scope: !562, file: !1, line: 79, column: 5)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !572, file: !1, line: 92, type: !13)
!572 = distinct !DILexicalBlock(scope: !562, file: !1, line: 92, column: 5)
!573 = !DISubprogram(name: "_PyImportZip_Init", scope: !1, file: !1, line: 96, type: !558, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_PyImportZip_Init, variables: !574)
!574 = !{!575, !576, !577, !578, !581, !583}
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path_hooks", scope: !573, file: !1, line: 98, type: !13)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zimpimport", scope: !573, file: !1, line: 98, type: !13)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !573, file: !1, line: 99, type: !52)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zipimporter", scope: !579, file: !1, line: 118, type: !13)
!579 = distinct !DILexicalBlock(scope: !580, file: !1, line: 116, column: 10)
!580 = distinct !DILexicalBlock(scope: !573, file: !1, line: 111, column: 9)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !582, file: !1, line: 120, type: !13)
!582 = distinct !DILexicalBlock(scope: !579, file: !1, line: 120, column: 9)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !584, file: !1, line: 130, type: !13)
!584 = distinct !DILexicalBlock(scope: !585, file: !1, line: 130, column: 13)
!585 = distinct !DILexicalBlock(scope: !586, file: !1, line: 127, column: 14)
!586 = distinct !DILexicalBlock(scope: !579, file: !1, line: 121, column: 13)
!587 = !DISubprogram(name: "_PyImport_AcquireLock", scope: !1, file: !1, line: 160, type: !558, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_PyImport_AcquireLock, variables: !588)
!588 = !{!589, !590}
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "me", scope: !587, file: !1, line: 162, type: !25)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !591, file: !1, line: 176, type: !351)
!591 = distinct !DILexicalBlock(scope: !592, file: !1, line: 175, column: 5)
!592 = distinct !DILexicalBlock(scope: !587, file: !1, line: 174, column: 9)
!593 = !DISubprogram(name: "_PyImport_ReleaseLock", scope: !1, file: !1, line: 186, type: !594, isLocal: false, isDefinition: true, scopeLine: 187, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @_PyImport_ReleaseLock, variables: !596)
!594 = !DISubroutineType(types: !595)
!595 = !{!52}
!596 = !{!597}
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "me", scope: !593, file: !1, line: 188, type: !25)
!598 = !DISubprogram(name: "_PyImport_ReInitLock", scope: !1, file: !1, line: 208, type: !558, isLocal: false, isDefinition: true, scopeLine: 209, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_PyImport_ReInitLock, variables: !599)
!599 = !{!600}
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "me", scope: !601, file: !1, line: 214, type: !25)
!601 = distinct !DILexicalBlock(scope: !602, file: !1, line: 212, column: 32)
!602 = distinct !DILexicalBlock(scope: !598, file: !1, line: 212, column: 9)
!603 = !DISubprogram(name: "_PyImport_Fini", scope: !1, file: !1, line: 354, type: !558, isLocal: false, isDefinition: true, scopeLine: 355, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_PyImport_Fini, variables: !604)
!604 = !{!605, !607}
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !606, file: !1, line: 356, type: !13)
!606 = distinct !DILexicalBlock(scope: !603, file: !1, line: 356, column: 5)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !608, file: !1, line: 356, type: !13)
!608 = distinct !DILexicalBlock(scope: !609, file: !1, line: 356, column: 5)
!609 = distinct !DILexicalBlock(scope: !610, file: !1, line: 356, column: 5)
!610 = distinct !DILexicalBlock(scope: !606, file: !1, line: 356, column: 5)
!611 = !DISubprogram(name: "PyImport_GetModuleDict", scope: !1, file: !1, line: 368, type: !504, isLocal: false, isDefinition: true, scopeLine: 369, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyImport_GetModuleDict, variables: !612)
!612 = !{!613, !614, !621, !622, !625}
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp", scope: !611, file: !1, line: 370, type: !360)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !615, file: !1, line: 370, type: !616)
!615 = distinct !DILexicalBlock(scope: !611, file: !1, line: 370, column: 34)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64, align: 64)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !4, line: 33, baseType: !618)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !4, line: 31, size: 64, align: 64, elements: !619)
!619 = !{!620}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !618, file: !4, line: 32, baseType: !12, size: 64, align: 64)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !615, file: !1, line: 370, type: !12)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !615, file: !1, line: 370, type: !623)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !12)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !615, file: !1, line: 370, type: !626)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !4, line: 29, baseType: !3)
!627 = !DISubprogram(name: "PyImport_Cleanup", scope: !1, file: !1, line: 398, type: !558, isLocal: false, isDefinition: true, scopeLine: 399, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyImport_Cleanup, variables: !628)
!628 = !{!629, !630, !631, !632, !633, !634, !636, !637, !638, !639, !640, !641, !643, !649, !652, !654, !657, !659, !662, !664, !667, !670, !671, !675, !676, !677, !679, !681}
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !627, file: !1, line: 400, type: !19)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !627, file: !1, line: 401, type: !13)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !627, file: !1, line: 401, type: !13)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !627, file: !1, line: 401, type: !13)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp", scope: !627, file: !1, line: 402, type: !360)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !635, file: !1, line: 402, type: !616)
!635 = distinct !DILexicalBlock(scope: !627, file: !1, line: 402, column: 34)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !635, file: !1, line: 402, type: !12)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !635, file: !1, line: 402, type: !623)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !635, file: !1, line: 402, type: !626)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modules", scope: !627, file: !1, line: 403, type: !13)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "weaklist", scope: !627, file: !1, line: 404, type: !13)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !627, file: !1, line: 405, type: !642)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wr", scope: !644, file: !1, line: 464, type: !13)
!644 = distinct !DILexicalBlock(scope: !645, file: !1, line: 464, column: 13)
!645 = distinct !DILexicalBlock(scope: !646, file: !1, line: 464, column: 13)
!646 = distinct !DILexicalBlock(scope: !647, file: !1, line: 461, column: 36)
!647 = distinct !DILexicalBlock(scope: !648, file: !1, line: 461, column: 13)
!648 = distinct !DILexicalBlock(scope: !627, file: !1, line: 460, column: 54)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tup", scope: !650, file: !1, line: 464, type: !13)
!650 = distinct !DILexicalBlock(scope: !651, file: !1, line: 464, column: 13)
!651 = distinct !DILexicalBlock(scope: !644, file: !1, line: 464, column: 13)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !653, file: !1, line: 464, type: !13)
!653 = distinct !DILexicalBlock(scope: !650, file: !1, line: 464, column: 13)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !655, file: !1, line: 464, type: !13)
!655 = distinct !DILexicalBlock(scope: !656, file: !1, line: 464, column: 13)
!656 = distinct !DILexicalBlock(scope: !653, file: !1, line: 464, column: 13)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !658, file: !1, line: 464, type: !13)
!658 = distinct !DILexicalBlock(scope: !644, file: !1, line: 464, column: 13)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !660, file: !1, line: 464, type: !13)
!660 = distinct !DILexicalBlock(scope: !661, file: !1, line: 464, column: 13)
!661 = distinct !DILexicalBlock(scope: !658, file: !1, line: 464, column: 13)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !663, file: !1, line: 479, type: !13)
!663 = distinct !DILexicalBlock(scope: !627, file: !1, line: 479, column: 5)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !665, file: !1, line: 479, type: !13)
!665 = distinct !DILexicalBlock(scope: !666, file: !1, line: 479, column: 5)
!666 = distinct !DILexicalBlock(scope: !663, file: !1, line: 479, column: 5)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !668, file: !1, line: 500, type: !19)
!668 = distinct !DILexicalBlock(scope: !669, file: !1, line: 499, column: 27)
!669 = distinct !DILexicalBlock(scope: !627, file: !1, line: 499, column: 9)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !668, file: !1, line: 500, type: !19)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tup", scope: !672, file: !1, line: 503, type: !13)
!672 = distinct !DILexicalBlock(scope: !673, file: !1, line: 502, column: 33)
!673 = distinct !DILexicalBlock(scope: !674, file: !1, line: 502, column: 9)
!674 = distinct !DILexicalBlock(scope: !668, file: !1, line: 502, column: 9)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !672, file: !1, line: 504, type: !13)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !672, file: !1, line: 505, type: !13)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !678, file: !1, line: 516, type: !13)
!678 = distinct !DILexicalBlock(scope: !672, file: !1, line: 516, column: 13)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !680, file: !1, line: 518, type: !13)
!680 = distinct !DILexicalBlock(scope: !668, file: !1, line: 518, column: 9)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !682, file: !1, line: 533, type: !13)
!682 = distinct !DILexicalBlock(scope: !627, file: !1, line: 533, column: 5)
!683 = !DISubprogram(name: "PyImport_GetMagicNumber", scope: !1, file: !1, line: 545, type: !684, isLocal: false, isDefinition: true, scopeLine: 546, flags: DIFlagPrototyped, isOptimized: true, function: i64 ()* @PyImport_GetMagicNumber, variables: !686)
!684 = !DISubroutineType(types: !685)
!685 = !{!25}
!686 = !{!687, !688, !689, !690}
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !683, file: !1, line: 547, type: !25)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp", scope: !683, file: !1, line: 548, type: !360)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pyc_magic", scope: !683, file: !1, line: 549, type: !13)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !691, file: !1, line: 554, type: !13)
!691 = distinct !DILexicalBlock(scope: !683, file: !1, line: 554, column: 5)
!692 = !DISubprogram(name: "PyImport_GetMagicTag", scope: !1, file: !1, line: 562, type: !693, isLocal: false, isDefinition: true, scopeLine: 563, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @PyImport_GetMagicTag, variables: !695)
!693 = !DISubroutineType(types: !694)
!694 = !{!37}
!695 = !{}
!696 = !DISubprogram(name: "_PyImport_FixupExtensionObject", scope: !1, file: !1, line: 585, type: !219, isLocal: false, isDefinition: true, scopeLine: 587, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, %struct._object*)* @_PyImport_FixupExtensionObject, variables: !697)
!697 = !{!698, !699, !700, !701, !702, !703, !704, !706, !707, !713, !717}
!698 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mod", arg: 1, scope: !696, file: !1, line: 585, type: !13)
!699 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !696, file: !1, line: 585, type: !13)
!700 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 3, scope: !696, file: !1, line: 586, type: !13)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modules", scope: !696, file: !1, line: 588, type: !13)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !696, file: !1, line: 588, type: !13)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !696, file: !1, line: 588, type: !13)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "def", scope: !696, file: !1, line: 589, type: !705)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !696, file: !1, line: 590, type: !52)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !708, file: !1, line: 617, type: !13)
!708 = distinct !DILexicalBlock(scope: !709, file: !1, line: 617, column: 13)
!709 = distinct !DILexicalBlock(scope: !710, file: !1, line: 613, column: 33)
!710 = distinct !DILexicalBlock(scope: !711, file: !1, line: 613, column: 13)
!711 = distinct !DILexicalBlock(scope: !712, file: !1, line: 612, column: 28)
!712 = distinct !DILexicalBlock(scope: !696, file: !1, line: 612, column: 9)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !714, file: !1, line: 617, type: !13)
!714 = distinct !DILexicalBlock(scope: !715, file: !1, line: 617, column: 13)
!715 = distinct !DILexicalBlock(scope: !716, file: !1, line: 617, column: 13)
!716 = distinct !DILexicalBlock(scope: !708, file: !1, line: 617, column: 13)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !718, file: !1, line: 630, type: !13)
!718 = distinct !DILexicalBlock(scope: !696, file: !1, line: 630, column: 5)
!719 = !DISubprogram(name: "_PyImport_FixupBuiltin", scope: !1, file: !1, line: 637, type: !720, isLocal: false, isDefinition: true, scopeLine: 638, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*)* @_PyImport_FixupBuiltin, variables: !722)
!720 = !DISubroutineType(types: !721)
!721 = !{!52, !13, !37}
!722 = !{!723, !724, !725, !726, !727}
!723 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mod", arg: 1, scope: !719, file: !1, line: 637, type: !13)
!724 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !719, file: !1, line: 637, type: !37)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !719, file: !1, line: 639, type: !52)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nameobj", scope: !719, file: !1, line: 640, type: !13)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !728, file: !1, line: 645, type: !13)
!728 = distinct !DILexicalBlock(scope: !719, file: !1, line: 645, column: 5)
!729 = !DISubprogram(name: "_PyImport_FindExtensionObject", scope: !1, file: !1, line: 650, type: !134, isLocal: false, isDefinition: true, scopeLine: 651, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @_PyImport_FindExtensionObject, variables: !730)
!730 = !{!731, !732, !733, !734, !735, !736, !737, !739, !745, !747}
!731 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !729, file: !1, line: 650, type: !13)
!732 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 2, scope: !729, file: !1, line: 650, type: !13)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !729, file: !1, line: 652, type: !13)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mdict", scope: !729, file: !1, line: 652, type: !13)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !729, file: !1, line: 652, type: !13)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "def", scope: !729, file: !1, line: 653, type: !492)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !738, file: !1, line: 660, type: !13)
!738 = distinct !DILexicalBlock(scope: !729, file: !1, line: 660, column: 5)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !740, file: !1, line: 683, type: !13)
!740 = distinct !DILexicalBlock(scope: !741, file: !1, line: 683, column: 13)
!741 = distinct !DILexicalBlock(scope: !742, file: !1, line: 682, column: 72)
!742 = distinct !DILexicalBlock(scope: !743, file: !1, line: 682, column: 13)
!743 = distinct !DILexicalBlock(scope: !744, file: !1, line: 676, column: 10)
!744 = distinct !DILexicalBlock(scope: !729, file: !1, line: 663, column: 9)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !746, file: !1, line: 686, type: !13)
!746 = distinct !DILexicalBlock(scope: !743, file: !1, line: 686, column: 9)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !748, file: !1, line: 690, type: !13)
!748 = distinct !DILexicalBlock(scope: !749, file: !1, line: 690, column: 9)
!749 = distinct !DILexicalBlock(scope: !750, file: !1, line: 688, column: 43)
!750 = distinct !DILexicalBlock(scope: !729, file: !1, line: 688, column: 9)
!751 = !DISubprogram(name: "_PyImport_FindBuiltin", scope: !1, file: !1, line: 701, type: !752, isLocal: false, isDefinition: true, scopeLine: 702, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @_PyImport_FindBuiltin, variables: !754)
!752 = !DISubroutineType(types: !753)
!753 = !{!13, !37}
!754 = !{!755, !756, !757, !758}
!755 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !751, file: !1, line: 701, type: !37)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !751, file: !1, line: 703, type: !13)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nameobj", scope: !751, file: !1, line: 703, type: !13)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !759, file: !1, line: 708, type: !13)
!759 = distinct !DILexicalBlock(scope: !751, file: !1, line: 708, column: 5)
!760 = !DISubprogram(name: "PyImport_AddModuleObject", scope: !1, file: !1, line: 719, type: !124, isLocal: false, isDefinition: true, scopeLine: 720, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyImport_AddModuleObject, variables: !761)
!761 = !{!762, !763, !764, !765, !769}
!762 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !760, file: !1, line: 719, type: !13)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modules", scope: !760, file: !1, line: 721, type: !13)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !760, file: !1, line: 722, type: !13)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !766, file: !1, line: 731, type: !13)
!766 = distinct !DILexicalBlock(scope: !767, file: !1, line: 731, column: 9)
!767 = distinct !DILexicalBlock(scope: !768, file: !1, line: 730, column: 48)
!768 = distinct !DILexicalBlock(scope: !760, file: !1, line: 730, column: 9)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !770, file: !1, line: 734, type: !13)
!770 = distinct !DILexicalBlock(scope: !760, file: !1, line: 734, column: 5)
!771 = !DISubprogram(name: "PyImport_AddModule", scope: !1, file: !1, line: 740, type: !752, isLocal: false, isDefinition: true, scopeLine: 741, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @PyImport_AddModule, variables: !772)
!772 = !{!773, !774, !775, !776}
!773 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !771, file: !1, line: 740, type: !37)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nameobj", scope: !771, file: !1, line: 742, type: !13)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "module", scope: !771, file: !1, line: 742, type: !13)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !777, file: !1, line: 747, type: !13)
!777 = distinct !DILexicalBlock(scope: !771, file: !1, line: 747, column: 5)
!778 = !DISubprogram(name: "PyImport_ExecCodeModule", scope: !1, file: !1, line: 776, type: !779, isLocal: false, isDefinition: true, scopeLine: 777, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct._object*)* @PyImport_ExecCodeModule, variables: !781)
!779 = !DISubroutineType(types: !780)
!780 = !{!13, !37, !13}
!781 = !{!782, !783}
!782 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !778, file: !1, line: 776, type: !37)
!783 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "co", arg: 2, scope: !778, file: !1, line: 776, type: !13)
!784 = !DISubprogram(name: "PyImport_ExecCodeModuleEx", scope: !1, file: !1, line: 783, type: !785, isLocal: false, isDefinition: true, scopeLine: 784, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct._object*, i8*)* @PyImport_ExecCodeModuleEx, variables: !787)
!785 = !DISubroutineType(types: !786)
!786 = !{!13, !37, !13, !37}
!787 = !{!788, !789, !790}
!788 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !784, file: !1, line: 783, type: !37)
!789 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "co", arg: 2, scope: !784, file: !1, line: 783, type: !13)
!790 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pathname", arg: 3, scope: !784, file: !1, line: 783, type: !37)
!791 = !DISubprogram(name: "PyImport_ExecCodeModuleWithPathnames", scope: !1, file: !1, line: 790, type: !792, isLocal: false, isDefinition: true, scopeLine: 793, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct._object*, i8*, i8*)* @PyImport_ExecCodeModuleWithPathnames, variables: !794)
!792 = !DISubroutineType(types: !793)
!793 = !{!13, !37, !13, !37, !37}
!794 = !{!795, !796, !797, !798, !799, !800, !801, !802, !803, !807, !809, !810, !811, !812, !814, !816, !819, !821}
!795 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !791, file: !1, line: 790, type: !37)
!796 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "co", arg: 2, scope: !791, file: !1, line: 790, type: !13)
!797 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pathname", arg: 3, scope: !791, file: !1, line: 791, type: !37)
!798 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cpathname", arg: 4, scope: !791, file: !1, line: 792, type: !37)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !791, file: !1, line: 794, type: !13)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nameobj", scope: !791, file: !1, line: 795, type: !13)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pathobj", scope: !791, file: !1, line: 795, type: !13)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cpathobj", scope: !791, file: !1, line: 795, type: !13)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp", scope: !804, file: !1, line: 815, type: !360)
!804 = distinct !DILexicalBlock(scope: !805, file: !1, line: 814, column: 32)
!805 = distinct !DILexicalBlock(scope: !806, file: !1, line: 814, column: 14)
!806 = distinct !DILexicalBlock(scope: !791, file: !1, line: 809, column: 9)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !808, file: !1, line: 815, type: !616)
!808 = distinct !DILexicalBlock(scope: !804, file: !1, line: 815, column: 38)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !808, file: !1, line: 815, type: !12)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !808, file: !1, line: 815, type: !623)
!811 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !808, file: !1, line: 815, type: !626)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !813, file: !1, line: 834, type: !13)
!813 = distinct !DILexicalBlock(scope: !791, file: !1, line: 834, column: 5)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !815, file: !1, line: 835, type: !13)
!815 = distinct !DILexicalBlock(scope: !791, file: !1, line: 835, column: 5)
!816 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !817, file: !1, line: 835, type: !13)
!817 = distinct !DILexicalBlock(scope: !818, file: !1, line: 835, column: 5)
!818 = distinct !DILexicalBlock(scope: !815, file: !1, line: 835, column: 5)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !820, file: !1, line: 836, type: !13)
!820 = distinct !DILexicalBlock(scope: !791, file: !1, line: 836, column: 5)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !822, file: !1, line: 836, type: !13)
!822 = distinct !DILexicalBlock(scope: !823, file: !1, line: 836, column: 5)
!823 = distinct !DILexicalBlock(scope: !820, file: !1, line: 836, column: 5)
!824 = !DISubprogram(name: "PyImport_ExecCodeModuleObject", scope: !1, file: !1, line: 888, type: !825, isLocal: false, isDefinition: true, scopeLine: 890, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*, %struct._object*)* @PyImport_ExecCodeModuleObject, variables: !827)
!825 = !DISubroutineType(types: !826)
!826 = !{!13, !13, !13, !13, !13}
!827 = !{!828, !829, !830, !831, !832, !833, !834, !835, !837, !838, !839}
!828 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !824, file: !1, line: 888, type: !13)
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "co", arg: 2, scope: !824, file: !1, line: 888, type: !13)
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pathname", arg: 3, scope: !824, file: !1, line: 888, type: !13)
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cpathname", arg: 4, scope: !824, file: !1, line: 889, type: !13)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !824, file: !1, line: 891, type: !13)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !824, file: !1, line: 891, type: !13)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp", scope: !824, file: !1, line: 892, type: !360)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !836, file: !1, line: 892, type: !616)
!836 = distinct !DILexicalBlock(scope: !824, file: !1, line: 892, column: 34)
!837 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !836, file: !1, line: 892, type: !12)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !836, file: !1, line: 892, type: !623)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !836, file: !1, line: 892, type: !626)
!840 = !DISubprogram(name: "PyImport_GetImporter", scope: !1, file: !1, line: 1089, type: !124, isLocal: false, isDefinition: true, scopeLine: 1089, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyImport_GetImporter, variables: !841)
!841 = !{!842, !843, !844, !845, !846}
!842 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 1, scope: !840, file: !1, line: 1089, type: !13)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "importer", scope: !840, file: !1, line: 1090, type: !13)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path_importer_cache", scope: !840, file: !1, line: 1090, type: !13)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path_hooks", scope: !840, file: !1, line: 1090, type: !13)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !847, file: !1, line: 1098, type: !13)
!847 = distinct !DILexicalBlock(scope: !840, file: !1, line: 1098, column: 5)
!848 = !DISubprogram(name: "PyImport_ImportFrozenModuleObject", scope: !1, file: !1, line: 1220, type: !152, isLocal: false, isDefinition: true, scopeLine: 1221, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @PyImport_ImportFrozenModuleObject, variables: !849)
!849 = !{!850, !851, !861, !862, !863, !864, !865, !866, !869, !870, !872, !874, !876}
!850 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !848, file: !1, line: 1220, type: !13)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !848, file: !1, line: 1222, type: !852)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64, align: 64)
!853 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !854)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frozen", file: !539, line: 115, size: 192, align: 64, elements: !855)
!855 = !{!856, !857, !860}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !854, file: !539, line: 116, baseType: !37, size: 64, align: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !854, file: !539, line: 117, baseType: !858, size: 64, align: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64, align: 64)
!859 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !406)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !854, file: !539, line: 118, baseType: !52, size: 32, align: 32, offset: 128)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "co", scope: !848, file: !1, line: 1223, type: !13)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !848, file: !1, line: 1223, type: !13)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !848, file: !1, line: 1223, type: !13)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ispackage", scope: !848, file: !1, line: 1224, type: !52)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !848, file: !1, line: 1225, type: !52)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !867, file: !1, line: 1252, type: !13)
!867 = distinct !DILexicalBlock(scope: !868, file: !1, line: 1250, column: 20)
!868 = distinct !DILexicalBlock(scope: !848, file: !1, line: 1250, column: 9)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !867, file: !1, line: 1253, type: !52)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !871, file: !1, line: 1263, type: !13)
!871 = distinct !DILexicalBlock(scope: !867, file: !1, line: 1263, column: 9)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !873, file: !1, line: 1274, type: !13)
!873 = distinct !DILexicalBlock(scope: !848, file: !1, line: 1274, column: 5)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !875, file: !1, line: 1275, type: !13)
!875 = distinct !DILexicalBlock(scope: !848, file: !1, line: 1275, column: 5)
!876 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !877, file: !1, line: 1278, type: !13)
!877 = distinct !DILexicalBlock(scope: !848, file: !1, line: 1278, column: 5)
!878 = !DISubprogram(name: "PyImport_ImportFrozenModule", scope: !1, file: !1, line: 1283, type: !879, isLocal: false, isDefinition: true, scopeLine: 1284, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @PyImport_ImportFrozenModule, variables: !881)
!879 = !DISubroutineType(types: !880)
!880 = !{!52, !37}
!881 = !{!882, !883, !884, !885}
!882 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !878, file: !1, line: 1283, type: !37)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nameobj", scope: !878, file: !1, line: 1285, type: !13)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !878, file: !1, line: 1286, type: !52)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !886, file: !1, line: 1291, type: !13)
!886 = distinct !DILexicalBlock(scope: !878, file: !1, line: 1291, column: 5)
!887 = !DISubprogram(name: "PyImport_ImportModule", scope: !1, file: !1, line: 1300, type: !752, isLocal: false, isDefinition: true, scopeLine: 1301, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @PyImport_ImportModule, variables: !888)
!888 = !{!889, !890, !891, !892}
!889 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !887, file: !1, line: 1300, type: !37)
!890 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pname", scope: !887, file: !1, line: 1302, type: !13)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !887, file: !1, line: 1303, type: !13)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !893, file: !1, line: 1309, type: !13)
!893 = distinct !DILexicalBlock(scope: !887, file: !1, line: 1309, column: 5)
!894 = !DISubprogram(name: "PyImport_ImportModuleNoBlock", scope: !1, file: !1, line: 1323, type: !752, isLocal: false, isDefinition: true, scopeLine: 1324, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @PyImport_ImportModuleNoBlock, variables: !895)
!895 = !{!896}
