; ModuleID = 'itertoolsmodule.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !540, globals: !2466)
!1 = !DIFile(filename: "./Modules/itertoolsmodule.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !89, !350, !358, !359, !367, !377, !387, !395, !403, !94, !411, !421, !428, !435, !442, !10, !449, !457, !467, !478, !487, !494, !501, !511, !523, !531, !43}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !6, line: 109, baseType: !7)
!6 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 105, size: 128, align: 64, elements: !8)
!8 = !{!9, !17}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !7, file: !6, line: 107, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !11, line: 177, baseType: !12)
!11 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !13, line: 102, baseType: !14)
!13 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !15, line: 181, baseType: !16)
!15 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!16 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !7, file: !6, line: 108, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !6, line: 334, size: 3200, align: 64, elements: !20)
!20 = !{!21, !27, !31, !32, !33, !38, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !19, file: !6, line: 335, baseType: !22, size: 192, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 114, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 111, size: 192, align: 64, elements: !24)
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !23, file: !6, line: 112, baseType: !5, size: 128, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !23, file: !6, line: 113, baseType: !10, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !19, file: !6, line: 336, baseType: !28, size: 64, align: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !19, file: !6, line: 337, baseType: !10, size: 64, align: 64, offset: 256)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !19, file: !6, line: 337, baseType: !10, size: 64, align: 64, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !19, file: !6, line: 341, baseType: !34, size: 64, align: 64, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 308, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !4}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !19, file: !6, line: 342, baseType: !39, size: 64, align: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !6, line: 314, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !4, !44, !43}
!43 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !13, line: 48, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 246, size: 1728, align: 64, elements: !48)
!47 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!48 = !{!49, !50, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !70, !71, !72, !73, !75, !77, !79, !83, !86, !88, !90, !91, !92, !93, !97, !98}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !46, file: !47, line: 247, baseType: !43, size: 32, align: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !46, file: !47, line: 252, baseType: !51, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !46, file: !47, line: 253, baseType: !51, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !46, file: !47, line: 254, baseType: !51, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !46, file: !47, line: 255, baseType: !51, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !46, file: !47, line: 256, baseType: !51, size: 64, align: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !46, file: !47, line: 257, baseType: !51, size: 64, align: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !46, file: !47, line: 258, baseType: !51, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !46, file: !47, line: 259, baseType: !51, size: 64, align: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !46, file: !47, line: 261, baseType: !51, size: 64, align: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !46, file: !47, line: 262, baseType: !51, size: 64, align: 64, offset: 640)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !46, file: !47, line: 263, baseType: !51, size: 64, align: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !46, file: !47, line: 265, baseType: !63, size: 64, align: 64, offset: 768)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !47, line: 161, size: 192, align: 64, elements: !65)
!65 = !{!66, !67, !69}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !64, file: !47, line: 162, baseType: !63, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !64, file: !47, line: 163, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !64, file: !47, line: 167, baseType: !43, size: 32, align: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !46, file: !47, line: 267, baseType: !68, size: 64, align: 64, offset: 832)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !46, file: !47, line: 269, baseType: !43, size: 32, align: 32, offset: 896)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !46, file: !47, line: 273, baseType: !43, size: 32, align: 32, offset: 928)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !46, file: !47, line: 275, baseType: !74, size: 64, align: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !15, line: 140, baseType: !16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !46, file: !47, line: 279, baseType: !76, size: 16, align: 16, offset: 1024)
!76 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !46, file: !47, line: 280, baseType: !78, size: 8, align: 8, offset: 1040)
!78 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !46, file: !47, line: 281, baseType: !80, size: 8, align: 8, offset: 1048)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 8, align: 8, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 1)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !46, file: !47, line: 285, baseType: !84, size: 64, align: 64, offset: 1088)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !47, line: 155, baseType: null)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !46, file: !47, line: 294, baseType: !87, size: 64, align: 64, offset: 1152)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !15, line: 141, baseType: !16)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !46, file: !47, line: 303, baseType: !89, size: 64, align: 64, offset: 1216)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !46, file: !47, line: 304, baseType: !89, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !46, file: !47, line: 305, baseType: !89, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !46, file: !47, line: 306, baseType: !89, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !46, file: !47, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !46, file: !47, line: 309, baseType: !43, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !46, file: !47, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !19, file: !6, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!4, !4, !51}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !19, file: !6, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!43, !4, !51, !4}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !19, file: !6, line: 345, baseType: !89, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !19, file: !6, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!4, !4}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !19, file: !6, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !6, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !6, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!4, !4, !4}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !6, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !6, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !6, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !6, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !6, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!4, !4, !4, !4}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !6, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !6, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !6, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !6, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!43, !4}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !6, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !6, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !6, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !6, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !6, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !6, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !6, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !6, line: 258, baseType: !89, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !6, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !6, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !6, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !6, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !6, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !6, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !6, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !6, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !6, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !6, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !6, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !6, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !6, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !6, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !6, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !6, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !19, file: !6, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !6, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !6, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!10, !4}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !6, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !6, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!4, !4, !10}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !6, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !6, line: 285, baseType: !89, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !6, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!43, !4, !10, !4}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !6, line: 287, baseType: !89, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !6, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!43, !4, !4}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !6, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !6, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !19, file: !6, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !6, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !6, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !6, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !6, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!43, !4, !4, !4}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !19, file: !6, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !4}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !11, line: 186, baseType: !10)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !19, file: !6, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !19, file: !6, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !19, file: !6, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !19, file: !6, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !19, file: !6, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !6, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !6, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !6, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!43, !4, !235, !43}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !6, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !6, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !6, line: 179, baseType: !89, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !6, line: 180, baseType: !4, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !6, line: 181, baseType: !10, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !6, line: 182, baseType: !10, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !6, line: 184, baseType: !43, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !6, line: 185, baseType: !43, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !6, line: 186, baseType: !51, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !6, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !6, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !6, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !6, line: 190, baseType: !89, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !6, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !6, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !4, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !19, file: !6, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !19, file: !6, line: 368, baseType: !28, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !19, file: !6, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!43, !4, !263, !89}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!43, !4, !89}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !19, file: !6, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !19, file: !6, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!4, !4, !4, !43}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !19, file: !6, line: 382, baseType: !10, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !19, file: !6, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !19, file: !6, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !19, file: !6, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !28, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !43, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !28, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !19, file: !6, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !291, line: 18, size: 320, align: 64, elements: !292)
!291 = !DIFile(filename: "Include/structmember.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!292 = !{!293, !294, !295, !296, !297}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !291, line: 19, baseType: !51, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !290, file: !291, line: 20, baseType: !43, size: 32, align: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !290, file: !291, line: 21, baseType: !10, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !290, file: !291, line: 22, baseType: !43, size: 32, align: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !290, file: !291, line: 23, baseType: !51, size: 64, align: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !19, file: !6, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !51, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!4, !4, !89}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!43, !4, !4, !89}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !51, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !89, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !19, file: !6, line: 392, baseType: !18, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !19, file: !6, line: 393, baseType: !4, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !19, file: !6, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 325, baseType: !134)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !19, file: !6, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 326, baseType: !210)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !19, file: !6, line: 396, baseType: !10, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !19, file: !6, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 327, baseType: !210)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !19, file: !6, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!4, !18, !10}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !19, file: !6, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!4, !18, !4, !4}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !19, file: !6, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !89}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !19, file: !6, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !19, file: !6, line: 402, baseType: !4, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !19, file: !6, line: 403, baseType: !4, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !19, file: !6, line: 404, baseType: !4, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !19, file: !6, line: 405, baseType: !4, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !19, file: !6, line: 406, baseType: !4, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !19, file: !6, line: 407, baseType: !34, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !19, file: !6, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !19, file: !6, line: 412, baseType: !34, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "accumulateobject", file: !1, line: 3368, baseType: !352)
!352 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 3363, size: 320, align: 64, elements: !353)
!353 = !{!354, !355, !356, !357}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !352, file: !1, line: 3364, baseType: !5, size: 128, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !352, file: !1, line: 3365, baseType: !4, size: 64, align: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !352, file: !1, line: 3366, baseType: !4, size: 64, align: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "binop", scope: !352, file: !1, line: 3367, baseType: !4, size: 64, align: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !361, line: 33, baseType: !362)
!361 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!362 = !DICompositeType(tag: DW_TAG_structure_type, file: !361, line: 25, size: 256, align: 64, elements: !363)
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !362, file: !361, line: 26, baseType: !22, size: 192, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !362, file: !361, line: 27, baseType: !366, size: 64, align: 64, offset: 192)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, align: 64, elements: !81)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "combinationsobject", file: !1, line: 2333, baseType: !369)
!369 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 2326, size: 448, align: 64, elements: !370)
!370 = !{!371, !372, !373, !374, !375, !376}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !369, file: !1, line: 2327, baseType: !5, size: 128, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !369, file: !1, line: 2328, baseType: !4, size: 64, align: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !369, file: !1, line: 2329, baseType: !247, size: 64, align: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !369, file: !1, line: 2330, baseType: !4, size: 64, align: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !369, file: !1, line: 2331, baseType: !10, size: 64, align: 64, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !369, file: !1, line: 2332, baseType: !43, size: 32, align: 32, offset: 384)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "cwrobject", file: !1, line: 2674, baseType: !379)
!379 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 2667, size: 448, align: 64, elements: !380)
!380 = !{!381, !382, !383, !384, !385, !386}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !379, file: !1, line: 2668, baseType: !5, size: 128, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !379, file: !1, line: 2669, baseType: !4, size: 64, align: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !379, file: !1, line: 2670, baseType: !247, size: 64, align: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !379, file: !1, line: 2671, baseType: !4, size: 64, align: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !379, file: !1, line: 2672, baseType: !10, size: 64, align: 64, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !379, file: !1, line: 2673, baseType: !43, size: 32, align: 32, offset: 384)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "cycleobject", file: !1, line: 867, baseType: !389)
!389 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 862, size: 320, align: 64, elements: !390)
!390 = !{!391, !392, !393, !394}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !389, file: !1, line: 863, baseType: !5, size: 128, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !389, file: !1, line: 864, baseType: !4, size: 64, align: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !389, file: !1, line: 865, baseType: !4, size: 64, align: 64, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "firstpass", scope: !389, file: !1, line: 866, baseType: !43, size: 32, align: 32, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "dropwhileobject", file: !1, line: 1051, baseType: !397)
!397 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 1046, size: 320, align: 64, elements: !398)
!398 = !{!399, !400, !401, !402}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !397, file: !1, line: 1047, baseType: !5, size: 128, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !397, file: !1, line: 1048, baseType: !4, size: 64, align: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !397, file: !1, line: 1049, baseType: !4, size: 64, align: 64, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !397, file: !1, line: 1050, baseType: !16, size: 64, align: 64, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "takewhileobject", file: !1, line: 1220, baseType: !405)
!405 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 1215, size: 320, align: 64, elements: !406)
!406 = !{!407, !408, !409, !410}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !405, file: !1, line: 1216, baseType: !5, size: 128, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !405, file: !1, line: 1217, baseType: !4, size: 64, align: 64, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !405, file: !1, line: 1218, baseType: !4, size: 64, align: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !405, file: !1, line: 1219, baseType: !16, size: 64, align: 64, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "isliceobject", file: !1, line: 1386, baseType: !413)
!413 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 1379, size: 448, align: 64, elements: !414)
!414 = !{!415, !416, !417, !418, !419, !420}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !413, file: !1, line: 1380, baseType: !5, size: 128, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !413, file: !1, line: 1381, baseType: !4, size: 64, align: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !413, file: !1, line: 1382, baseType: !10, size: 64, align: 64, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !413, file: !1, line: 1383, baseType: !10, size: 64, align: 64, offset: 256)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !413, file: !1, line: 1384, baseType: !10, size: 64, align: 64, offset: 320)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !413, file: !1, line: 1385, baseType: !10, size: 64, align: 64, offset: 384)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "starmapobject", file: !1, line: 1637, baseType: !423)
!423 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 1633, size: 256, align: 64, elements: !424)
!424 = !{!425, !426, !427}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !423, file: !1, line: 1634, baseType: !5, size: 128, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !423, file: !1, line: 1635, baseType: !4, size: 64, align: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !423, file: !1, line: 1636, baseType: !4, size: 64, align: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "chainobject", file: !1, line: 1781, baseType: !430)
!430 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 1777, size: 256, align: 64, elements: !431)
!431 = !{!432, !433, !434}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !430, file: !1, line: 1778, baseType: !5, size: 128, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !430, file: !1, line: 1779, baseType: !4, size: 64, align: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !430, file: !1, line: 1780, baseType: !4, size: 64, align: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "compressobject", file: !1, line: 3544, baseType: !437)
!437 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 3540, size: 256, align: 64, elements: !438)
!438 = !{!439, !440, !441}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !437, file: !1, line: 3541, baseType: !5, size: 128, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !437, file: !1, line: 3542, baseType: !4, size: 64, align: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "selectors", scope: !437, file: !1, line: 3543, baseType: !4, size: 64, align: 64, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "filterfalseobject", file: !1, line: 3704, baseType: !444)
!444 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 3700, size: 256, align: 64, elements: !445)
!445 = !{!446, !447, !448}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !444, file: !1, line: 3701, baseType: !5, size: 128, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !444, file: !1, line: 3702, baseType: !4, size: 64, align: 64, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !444, file: !1, line: 3703, baseType: !4, size: 64, align: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "countobject", file: !1, line: 3863, baseType: !451)
!451 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 3858, size: 320, align: 64, elements: !452)
!452 = !{!453, !454, !455, !456}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !451, file: !1, line: 3859, baseType: !5, size: 128, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !451, file: !1, line: 3860, baseType: !10, size: 64, align: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "long_cnt", scope: !451, file: !1, line: 3861, baseType: !4, size: 64, align: 64, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "long_step", scope: !451, file: !1, line: 3862, baseType: !4, size: 64, align: 64, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "ziplongestobject", file: !1, line: 4256, baseType: !459)
!459 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 4249, size: 448, align: 64, elements: !460)
!460 = !{!461, !462, !463, !464, !465, !466}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !459, file: !1, line: 4250, baseType: !5, size: 128, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "tuplesize", scope: !459, file: !1, line: 4251, baseType: !10, size: 64, align: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "numactive", scope: !459, file: !1, line: 4252, baseType: !10, size: 64, align: 64, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ittuple", scope: !459, file: !1, line: 4253, baseType: !4, size: 64, align: 64, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !459, file: !1, line: 4254, baseType: !4, size: 64, align: 64, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "fillvalue", scope: !459, file: !1, line: 4255, baseType: !4, size: 64, align: 64, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "permutationsobject", file: !1, line: 3002, baseType: !469)
!469 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 2994, size: 512, align: 64, elements: !470)
!470 = !{!471, !472, !473, !474, !475, !476, !477}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !469, file: !1, line: 2995, baseType: !5, size: 128, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !469, file: !1, line: 2996, baseType: !4, size: 64, align: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !469, file: !1, line: 2997, baseType: !247, size: 64, align: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "cycles", scope: !469, file: !1, line: 2998, baseType: !247, size: 64, align: 64, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !469, file: !1, line: 2999, baseType: !4, size: 64, align: 64, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !469, file: !1, line: 3000, baseType: !10, size: 64, align: 64, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !469, file: !1, line: 3001, baseType: !43, size: 32, align: 32, offset: 448)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "productobject", file: !1, line: 1990, baseType: !480)
!480 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 1984, size: 384, align: 64, elements: !481)
!481 = !{!482, !483, !484, !485, !486}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !480, file: !1, line: 1985, baseType: !5, size: 128, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !480, file: !1, line: 1986, baseType: !4, size: 64, align: 64, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !480, file: !1, line: 1987, baseType: !247, size: 64, align: 64, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !480, file: !1, line: 1988, baseType: !4, size: 64, align: 64, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !480, file: !1, line: 1989, baseType: !43, size: 32, align: 32, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "repeatobject", file: !1, line: 4103, baseType: !489)
!489 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 4099, size: 256, align: 64, elements: !490)
!490 = !{!491, !492, !493}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !489, file: !1, line: 4100, baseType: !5, size: 128, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !489, file: !1, line: 4101, baseType: !4, size: 64, align: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !489, file: !1, line: 4102, baseType: !10, size: 64, align: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "_grouperobject", file: !1, line: 239, baseType: !496)
!496 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 235, size: 256, align: 64, elements: !497)
!497 = !{!498, !499, !500}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !496, file: !1, line: 236, baseType: !5, size: 128, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !496, file: !1, line: 237, baseType: !4, size: 64, align: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "tgtkey", scope: !496, file: !1, line: 238, baseType: !4, size: 64, align: 64, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "groupbyobject", file: !1, line: 21, baseType: !503)
!503 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 14, size: 448, align: 64, elements: !504)
!504 = !{!505, !506, !507, !508, !509, !510}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !503, file: !1, line: 15, baseType: !5, size: 128, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !503, file: !1, line: 16, baseType: !4, size: 64, align: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "keyfunc", scope: !503, file: !1, line: 17, baseType: !4, size: 64, align: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "tgtkey", scope: !503, file: !1, line: 18, baseType: !4, size: 64, align: 64, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "currkey", scope: !503, file: !1, line: 19, baseType: !4, size: 64, align: 64, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "currvalue", scope: !503, file: !1, line: 20, baseType: !4, size: 64, align: 64, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "teedataobject", file: !1, line: 407, baseType: !513)
!513 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 401, size: 3968, align: 64, elements: !514)
!514 = !{!515, !516, !517, !518, !519}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !513, file: !1, line: 402, baseType: !5, size: 128, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !513, file: !1, line: 403, baseType: !4, size: 64, align: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "numread", scope: !513, file: !1, line: 404, baseType: !43, size: 32, align: 32, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "nextlink", scope: !513, file: !1, line: 405, baseType: !4, size: 64, align: 64, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !513, file: !1, line: 406, baseType: !520, size: 3648, align: 64, offset: 320)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 3648, align: 64, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 57)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "teeobject", file: !1, line: 414, baseType: !525)
!525 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 409, size: 320, align: 64, elements: !526)
!526 = !{!527, !528, !529, !530}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !525, file: !1, line: 410, baseType: !5, size: 128, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "dataobj", scope: !525, file: !1, line: 411, baseType: !511, size: 64, align: 64, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !525, file: !1, line: 412, baseType: !43, size: 32, align: 32, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !525, file: !1, line: 413, baseType: !4, size: 64, align: 64, offset: 256)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !533, line: 40, baseType: !534)
!533 = !DIFile(filename: "Include/listobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!534 = !DICompositeType(tag: DW_TAG_structure_type, file: !533, line: 23, size: 320, align: 64, elements: !535)
!535 = !{!536, !537, !539}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !534, file: !533, line: 24, baseType: !22, size: 192, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !534, file: !533, line: 26, baseType: !538, size: 64, align: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !534, file: !533, line: 39, baseType: !10, size: 64, align: 64, offset: 256)
!540 = !{!541, !554, !574, !593, !605, !608, !620, !639, !654, !669, !696, !712, !737, !744, !761, !776, !791, !817, !833, !857, !864, !881, !896, !911, !928, !931, !947, !966, !981, !996, !1017, !1020, !1027, !1040, !1055, !1070, !1087, !1090, !1097, !1110, !1120, !1131, !1150, !1160, !1167, !1186, !1201, !1216, !1231, !1234, !1247, !1262, !1277, !1310, !1317, !1326, !1329, !1351, !1357, !1372, !1387, !1408, !1411, !1431, !1446, !1461, !1484, !1487, !1500, !1515, !1523, !1538, !1541, !1546, !1549, !1580, !1600, !1619, !1663, !1678, !1690, !1720, !1735, !1750, !1784, !1812, !1843, !1850, !1869, !1884, !1899, !1929, !1946, !1971, !1978, !2017, !2027, !2032, !2043, !2046, !2049, !2052, !2060, !2090, !2117, !2157, !2164, !2168, !2193, !2205, !2214, !2229, !2253, !2256, !2263, !2268, !2279, !2290, !2301, !2308, !2312, !2319, !2323, !2326, !2340, !2346, !2356, !2361, !2383, !2404, !2416, !2421, !2437}
!541 = !DISubprogram(name: "PyInit_itertools", scope: !1, file: !1, line: 4568, type: !542, isLocal: false, isDefinition: true, scopeLine: 4569, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_itertools, variables: !544)
!542 = !DISubroutineType(types: !543)
!543 = !{!4}
!544 = !{!545, !546, !547, !548}
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !541, file: !1, line: 4570, type: !43)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !541, file: !1, line: 4571, type: !4)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !541, file: !1, line: 4572, type: !51)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typelist", scope: !541, file: !1, line: 4573, type: !549)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 1344, align: 64, elements: !552)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !6, line: 422, baseType: !19)
!552 = !{!553}
!553 = !DISubrange(count: 21)
!554 = !DISubprogram(name: "accumulate_dealloc", scope: !1, file: !1, line: 3407, type: !555, isLocal: true, isDefinition: true, scopeLine: 3408, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.accumulateobject*)* @accumulate_dealloc, variables: !557)
!555 = !DISubroutineType(types: !556)
!556 = !{null, !350}
!557 = !{!558, !559, !561, !564, !566, !569, !571}
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !554, file: !1, line: 3407, type: !350)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !560, file: !1, line: 3410, type: !4)
!560 = distinct !DILexicalBlock(scope: !554, file: !1, line: 3410, column: 5)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !562, file: !1, line: 3410, type: !4)
!562 = distinct !DILexicalBlock(scope: !563, file: !1, line: 3410, column: 5)
!563 = distinct !DILexicalBlock(scope: !560, file: !1, line: 3410, column: 5)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !565, file: !1, line: 3411, type: !4)
!565 = distinct !DILexicalBlock(scope: !554, file: !1, line: 3411, column: 5)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !567, file: !1, line: 3411, type: !4)
!567 = distinct !DILexicalBlock(scope: !568, file: !1, line: 3411, column: 5)
!568 = distinct !DILexicalBlock(scope: !565, file: !1, line: 3411, column: 5)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !570, file: !1, line: 3412, type: !4)
!570 = distinct !DILexicalBlock(scope: !554, file: !1, line: 3412, column: 5)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !572, file: !1, line: 3412, type: !4)
!572 = distinct !DILexicalBlock(scope: !573, file: !1, line: 3412, column: 5)
!573 = distinct !DILexicalBlock(scope: !570, file: !1, line: 3412, column: 5)
!574 = !DISubprogram(name: "accumulate_traverse", scope: !1, file: !1, line: 3417, type: !575, isLocal: true, isDefinition: true, scopeLine: 3418, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.accumulateobject*, i32 (%struct._object*, i8*)*, i8*)* @accumulate_traverse, variables: !577)
!575 = !DISubroutineType(types: !576)
!576 = !{!43, !350, !263, !89}
!577 = !{!578, !579, !580, !581, !585, !589}
!578 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !574, file: !1, line: 3417, type: !350)
!579 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !574, file: !1, line: 3417, type: !263)
!580 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !574, file: !1, line: 3417, type: !89)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !582, file: !1, line: 3419, type: !43)
!582 = distinct !DILexicalBlock(scope: !583, file: !1, line: 3419, column: 5)
!583 = distinct !DILexicalBlock(scope: !584, file: !1, line: 3419, column: 5)
!584 = distinct !DILexicalBlock(scope: !574, file: !1, line: 3419, column: 5)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !586, file: !1, line: 3420, type: !43)
!586 = distinct !DILexicalBlock(scope: !587, file: !1, line: 3420, column: 5)
!587 = distinct !DILexicalBlock(scope: !588, file: !1, line: 3420, column: 5)
!588 = distinct !DILexicalBlock(scope: !574, file: !1, line: 3420, column: 5)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !590, file: !1, line: 3421, type: !43)
!590 = distinct !DILexicalBlock(scope: !591, file: !1, line: 3421, column: 5)
!591 = distinct !DILexicalBlock(scope: !592, file: !1, line: 3421, column: 5)
!592 = distinct !DILexicalBlock(scope: !574, file: !1, line: 3421, column: 5)
!593 = !DISubprogram(name: "accumulate_next", scope: !1, file: !1, line: 3426, type: !594, isLocal: true, isDefinition: true, scopeLine: 3427, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.accumulateobject*)* @accumulate_next, variables: !596)
!594 = !DISubroutineType(types: !595)
!595 = !{!4, !350}
!596 = !{!597, !598, !599, !600, !601, !603}
!597 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !593, file: !1, line: 3426, type: !350)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !593, file: !1, line: 3428, type: !4)
!599 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldtotal", scope: !593, file: !1, line: 3428, type: !4)
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newtotal", scope: !593, file: !1, line: 3428, type: !4)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !602, file: !1, line: 3444, type: !4)
!602 = distinct !DILexicalBlock(scope: !593, file: !1, line: 3444, column: 5)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !604, file: !1, line: 3450, type: !4)
!604 = distinct !DILexicalBlock(scope: !593, file: !1, line: 3450, column: 5)
!605 = !DISubprogram(name: "accumulate_reduce", scope: !1, file: !1, line: 3457, type: !594, isLocal: true, isDefinition: true, scopeLine: 3458, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.accumulateobject*)* @accumulate_reduce, variables: !606)
!606 = !{!607}
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !605, file: !1, line: 3457, type: !350)
!608 = !DISubprogram(name: "accumulate_setstate", scope: !1, file: !1, line: 3465, type: !609, isLocal: true, isDefinition: true, scopeLine: 3466, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.accumulateobject*, %struct._object*)* @accumulate_setstate, variables: !611)
!609 = !DISubroutineType(types: !610)
!610 = !{!4, !350, !4}
!611 = !{!612, !613, !614, !616}
!612 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !608, file: !1, line: 3465, type: !350)
!613 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 2, scope: !608, file: !1, line: 3465, type: !4)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !615, file: !1, line: 3467, type: !4)
!615 = distinct !DILexicalBlock(scope: !608, file: !1, line: 3467, column: 5)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !617, file: !1, line: 3467, type: !4)
!617 = distinct !DILexicalBlock(scope: !618, file: !1, line: 3467, column: 5)
!618 = distinct !DILexicalBlock(scope: !619, file: !1, line: 3467, column: 5)
!619 = distinct !DILexicalBlock(scope: !615, file: !1, line: 3467, column: 5)
!620 = !DISubprogram(name: "accumulate_new", scope: !1, file: !1, line: 3373, type: !621, isLocal: true, isDefinition: true, scopeLine: 3374, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @accumulate_new, variables: !623)
!621 = !DISubroutineType(types: !622)
!622 = !{!4, !550, !4, !4}
!623 = !{!624, !625, !626, !627, !628, !629, !630, !631, !635}
!624 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !620, file: !1, line: 3373, type: !550)
!625 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !620, file: !1, line: 3373, type: !4)
!626 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !620, file: !1, line: 3373, type: !4)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iterable", scope: !620, file: !1, line: 3376, type: !4)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !620, file: !1, line: 3377, type: !4)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "binop", scope: !620, file: !1, line: 3378, type: !4)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lz", scope: !620, file: !1, line: 3379, type: !350)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !632, file: !1, line: 3393, type: !4)
!632 = distinct !DILexicalBlock(scope: !633, file: !1, line: 3393, column: 9)
!633 = distinct !DILexicalBlock(scope: !634, file: !1, line: 3392, column: 21)
!634 = distinct !DILexicalBlock(scope: !620, file: !1, line: 3392, column: 9)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !636, file: !1, line: 3398, type: !4)
!636 = distinct !DILexicalBlock(scope: !637, file: !1, line: 3398, column: 9)
!637 = distinct !DILexicalBlock(scope: !638, file: !1, line: 3397, column: 27)
!638 = distinct !DILexicalBlock(scope: !620, file: !1, line: 3397, column: 9)
!639 = !DISubprogram(name: "combinations_dealloc", scope: !1, file: !1, line: 2392, type: !640, isLocal: true, isDefinition: true, scopeLine: 2393, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.combinationsobject*)* @combinations_dealloc, variables: !642)
!640 = !DISubroutineType(types: !641)
!641 = !{null, !367}
!642 = !{!643, !644, !646, !649, !651}
!643 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "co", arg: 1, scope: !639, file: !1, line: 2392, type: !367)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !645, file: !1, line: 2395, type: !4)
!645 = distinct !DILexicalBlock(scope: !639, file: !1, line: 2395, column: 5)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !647, file: !1, line: 2395, type: !4)
!647 = distinct !DILexicalBlock(scope: !648, file: !1, line: 2395, column: 5)
!648 = distinct !DILexicalBlock(scope: !645, file: !1, line: 2395, column: 5)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !650, file: !1, line: 2396, type: !4)
!650 = distinct !DILexicalBlock(scope: !639, file: !1, line: 2396, column: 5)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !652, file: !1, line: 2396, type: !4)
!652 = distinct !DILexicalBlock(scope: !653, file: !1, line: 2396, column: 5)
!653 = distinct !DILexicalBlock(scope: !650, file: !1, line: 2396, column: 5)
!654 = !DISubprogram(name: "combinations_traverse", scope: !1, file: !1, line: 2413, type: !655, isLocal: true, isDefinition: true, scopeLine: 2414, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.combinationsobject*, i32 (%struct._object*, i8*)*, i8*)* @combinations_traverse, variables: !657)
!655 = !DISubroutineType(types: !656)
!656 = !{!43, !367, !263, !89}
!657 = !{!658, !659, !660, !661, !665}
!658 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "co", arg: 1, scope: !654, file: !1, line: 2413, type: !367)
!659 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !654, file: !1, line: 2413, type: !263)
!660 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !654, file: !1, line: 2413, type: !89)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !662, file: !1, line: 2415, type: !43)
!662 = distinct !DILexicalBlock(scope: !663, file: !1, line: 2415, column: 5)
!663 = distinct !DILexicalBlock(scope: !664, file: !1, line: 2415, column: 5)
!664 = distinct !DILexicalBlock(scope: !654, file: !1, line: 2415, column: 5)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !666, file: !1, line: 2416, type: !43)
!666 = distinct !DILexicalBlock(scope: !667, file: !1, line: 2416, column: 5)
!667 = distinct !DILexicalBlock(scope: !668, file: !1, line: 2416, column: 5)
!668 = distinct !DILexicalBlock(scope: !654, file: !1, line: 2416, column: 5)
!669 = !DISubprogram(name: "combinations_next", scope: !1, file: !1, line: 2421, type: !670, isLocal: true, isDefinition: true, scopeLine: 2422, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.combinationsobject*)* @combinations_next, variables: !672)
!670 = !DISubroutineType(types: !671)
!671 = !{!4, !367}
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !689, !691}
!673 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "co", arg: 1, scope: !669, file: !1, line: 2421, type: !367)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "elem", scope: !669, file: !1, line: 2423, type: !4)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldelem", scope: !669, file: !1, line: 2424, type: !4)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pool", scope: !669, file: !1, line: 2425, type: !4)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !669, file: !1, line: 2426, type: !247)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !669, file: !1, line: 2427, type: !4)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !669, file: !1, line: 2428, type: !10)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !669, file: !1, line: 2429, type: !10)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !669, file: !1, line: 2430, type: !10)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !669, file: !1, line: 2430, type: !10)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !669, file: !1, line: 2430, type: !10)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_result", scope: !685, file: !1, line: 2450, type: !4)
!685 = distinct !DILexicalBlock(scope: !686, file: !1, line: 2449, column: 36)
!686 = distinct !DILexicalBlock(scope: !687, file: !1, line: 2449, column: 13)
!687 = distinct !DILexicalBlock(scope: !688, file: !1, line: 2447, column: 12)
!688 = distinct !DILexicalBlock(scope: !669, file: !1, line: 2435, column: 9)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !690, file: !1, line: 2460, type: !4)
!690 = distinct !DILexicalBlock(scope: !685, file: !1, line: 2460, column: 13)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !692, file: !1, line: 2494, type: !4)
!692 = distinct !DILexicalBlock(scope: !693, file: !1, line: 2494, column: 13)
!693 = distinct !DILexicalBlock(scope: !694, file: !1, line: 2488, column: 28)
!694 = distinct !DILexicalBlock(scope: !695, file: !1, line: 2488, column: 9)
!695 = distinct !DILexicalBlock(scope: !687, file: !1, line: 2488, column: 9)
!696 = !DISubprogram(name: "combinations_reduce", scope: !1, file: !1, line: 2507, type: !670, isLocal: true, isDefinition: true, scopeLine: 2508, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.combinationsobject*)* @combinations_reduce, variables: !697)
!697 = !{!698, !699, !703, !704, !708}
!698 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !696, file: !1, line: 2507, type: !367)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !700, file: !1, line: 2514, type: !4)
!700 = distinct !DILexicalBlock(scope: !701, file: !1, line: 2513, column: 12)
!701 = distinct !DILexicalBlock(scope: !702, file: !1, line: 2511, column: 16)
!702 = distinct !DILexicalBlock(scope: !696, file: !1, line: 2509, column: 9)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !700, file: !1, line: 2515, type: !10)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !705, file: !1, line: 2523, type: !4)
!705 = distinct !DILexicalBlock(scope: !706, file: !1, line: 2522, column: 9)
!706 = distinct !DILexicalBlock(scope: !707, file: !1, line: 2521, column: 9)
!707 = distinct !DILexicalBlock(scope: !700, file: !1, line: 2521, column: 9)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !709, file: !1, line: 2525, type: !4)
!709 = distinct !DILexicalBlock(scope: !710, file: !1, line: 2525, column: 17)
!710 = distinct !DILexicalBlock(scope: !711, file: !1, line: 2524, column: 25)
!711 = distinct !DILexicalBlock(scope: !705, file: !1, line: 2524, column: 17)
!712 = !DISubprogram(name: "combinations_setstate", scope: !1, file: !1, line: 2536, type: !713, isLocal: true, isDefinition: true, scopeLine: 2537, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.combinationsobject*, %struct._object*)* @combinations_setstate, variables: !715)
!713 = !DISubroutineType(types: !714)
!714 = !{!4, !367, !4}
!715 = !{!716, !717, !718, !719, !720, !721, !725, !726, !727, !731, !733}
!716 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !712, file: !1, line: 2536, type: !367)
!717 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 2, scope: !712, file: !1, line: 2536, type: !4)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !712, file: !1, line: 2538, type: !4)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !712, file: !1, line: 2539, type: !10)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !712, file: !1, line: 2540, type: !10)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max", scope: !722, file: !1, line: 2550, type: !10)
!722 = distinct !DILexicalBlock(scope: !723, file: !1, line: 2549, column: 5)
!723 = distinct !DILexicalBlock(scope: !724, file: !1, line: 2548, column: 5)
!724 = distinct !DILexicalBlock(scope: !712, file: !1, line: 2548, column: 5)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indexObject", scope: !722, file: !1, line: 2551, type: !4)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !722, file: !1, line: 2552, type: !10)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "element", scope: !728, file: !1, line: 2568, type: !4)
!728 = distinct !DILexicalBlock(scope: !729, file: !1, line: 2567, column: 29)
!729 = distinct !DILexicalBlock(scope: !730, file: !1, line: 2567, column: 5)
!730 = distinct !DILexicalBlock(scope: !712, file: !1, line: 2567, column: 5)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !732, file: !1, line: 2573, type: !4)
!732 = distinct !DILexicalBlock(scope: !712, file: !1, line: 2573, column: 5)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !734, file: !1, line: 2573, type: !4)
!734 = distinct !DILexicalBlock(scope: !735, file: !1, line: 2573, column: 5)
!735 = distinct !DILexicalBlock(scope: !736, file: !1, line: 2573, column: 5)
!736 = distinct !DILexicalBlock(scope: !732, file: !1, line: 2573, column: 5)
!737 = !DISubprogram(name: "combinations_sizeof", scope: !1, file: !1, line: 2403, type: !738, isLocal: true, isDefinition: true, scopeLine: 2404, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.combinationsobject*, i8*)* @combinations_sizeof, variables: !740)
!738 = !DISubroutineType(types: !739)
!739 = !{!4, !367, !89}
!740 = !{!741, !742, !743}
!741 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "co", arg: 1, scope: !737, file: !1, line: 2403, type: !367)
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !737, file: !1, line: 2403, type: !89)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !737, file: !1, line: 2405, type: !10)
!744 = !DISubprogram(name: "combinations_new", scope: !1, file: !1, line: 2338, type: !621, isLocal: true, isDefinition: true, scopeLine: 2339, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @combinations_new, variables: !745)
!745 = !{!746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !758}
!746 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !744, file: !1, line: 2338, type: !550)
!747 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !744, file: !1, line: 2338, type: !4)
!748 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !744, file: !1, line: 2338, type: !4)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "co", scope: !744, file: !1, line: 2340, type: !367)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !744, file: !1, line: 2341, type: !10)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !744, file: !1, line: 2342, type: !10)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pool", scope: !744, file: !1, line: 2343, type: !4)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iterable", scope: !744, file: !1, line: 2344, type: !4)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !744, file: !1, line: 2345, type: !247)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !744, file: !1, line: 2346, type: !10)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !757, file: !1, line: 2387, type: !4)
!757 = distinct !DILexicalBlock(scope: !744, file: !1, line: 2387, column: 5)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !759, file: !1, line: 2387, type: !4)
!759 = distinct !DILexicalBlock(scope: !760, file: !1, line: 2387, column: 5)
!760 = distinct !DILexicalBlock(scope: !757, file: !1, line: 2387, column: 5)
!761 = !DISubprogram(name: "cwr_dealloc", scope: !1, file: !1, line: 2733, type: !762, isLocal: true, isDefinition: true, scopeLine: 2734, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.cwrobject*)* @cwr_dealloc, variables: !764)
!762 = !DISubroutineType(types: !763)
!763 = !{null, !377}
!764 = !{!765, !766, !768, !771, !773}
!765 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "co", arg: 1, scope: !761, file: !1, line: 2733, type: !377)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !767, file: !1, line: 2736, type: !4)
!767 = distinct !DILexicalBlock(scope: !761, file: !1, line: 2736, column: 5)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !769, file: !1, line: 2736, type: !4)
!769 = distinct !DILexicalBlock(scope: !770, file: !1, line: 2736, column: 5)
!770 = distinct !DILexicalBlock(scope: !767, file: !1, line: 2736, column: 5)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !772, file: !1, line: 2737, type: !4)
!772 = distinct !DILexicalBlock(scope: !761, file: !1, line: 2737, column: 5)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !774, file: !1, line: 2737, type: !4)
!774 = distinct !DILexicalBlock(scope: !775, file: !1, line: 2737, column: 5)
!775 = distinct !DILexicalBlock(scope: !772, file: !1, line: 2737, column: 5)
!776 = !DISubprogram(name: "cwr_traverse", scope: !1, file: !1, line: 2754, type: !777, isLocal: true, isDefinition: true, scopeLine: 2755, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cwrobject*, i32 (%struct._object*, i8*)*, i8*)* @cwr_traverse, variables: !779)
!777 = !DISubroutineType(types: !778)
!778 = !{!43, !377, !263, !89}
!779 = !{!780, !781, !782, !783, !787}
!780 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "co", arg: 1, scope: !776, file: !1, line: 2754, type: !377)
!781 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !776, file: !1, line: 2754, type: !263)
!782 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !776, file: !1, line: 2754, type: !89)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !784, file: !1, line: 2756, type: !43)
!784 = distinct !DILexicalBlock(scope: !785, file: !1, line: 2756, column: 5)
!785 = distinct !DILexicalBlock(scope: !786, file: !1, line: 2756, column: 5)
!786 = distinct !DILexicalBlock(scope: !776, file: !1, line: 2756, column: 5)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !788, file: !1, line: 2757, type: !43)
!788 = distinct !DILexicalBlock(scope: !789, file: !1, line: 2757, column: 5)
!789 = distinct !DILexicalBlock(scope: !790, file: !1, line: 2757, column: 5)
!790 = distinct !DILexicalBlock(scope: !776, file: !1, line: 2757, column: 5)
!791 = !DISubprogram(name: "cwr_next", scope: !1, file: !1, line: 2762, type: !792, isLocal: true, isDefinition: true, scopeLine: 2763, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.cwrobject*)* @cwr_next, variables: !794)
!792 = !DISubroutineType(types: !793)
!793 = !{!4, !377}
!794 = !{!795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !810, !812}
!795 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "co", arg: 1, scope: !791, file: !1, line: 2762, type: !377)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "elem", scope: !791, file: !1, line: 2764, type: !4)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldelem", scope: !791, file: !1, line: 2765, type: !4)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pool", scope: !791, file: !1, line: 2766, type: !4)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !791, file: !1, line: 2767, type: !247)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !791, file: !1, line: 2768, type: !4)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !791, file: !1, line: 2769, type: !10)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !791, file: !1, line: 2770, type: !10)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !791, file: !1, line: 2771, type: !10)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !791, file: !1, line: 2771, type: !10)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_result", scope: !806, file: !1, line: 2791, type: !4)
!806 = distinct !DILexicalBlock(scope: !807, file: !1, line: 2790, column: 36)
!807 = distinct !DILexicalBlock(scope: !808, file: !1, line: 2790, column: 13)
!808 = distinct !DILexicalBlock(scope: !809, file: !1, line: 2788, column: 12)
!809 = distinct !DILexicalBlock(scope: !791, file: !1, line: 2776, column: 9)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !811, file: !1, line: 2801, type: !4)
!811 = distinct !DILexicalBlock(scope: !806, file: !1, line: 2801, column: 13)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !813, file: !1, line: 2827, type: !4)
!813 = distinct !DILexicalBlock(scope: !814, file: !1, line: 2827, column: 13)
!814 = distinct !DILexicalBlock(scope: !815, file: !1, line: 2822, column: 28)
!815 = distinct !DILexicalBlock(scope: !816, file: !1, line: 2822, column: 9)
!816 = distinct !DILexicalBlock(scope: !808, file: !1, line: 2822, column: 9)
!817 = !DISubprogram(name: "cwr_reduce", scope: !1, file: !1, line: 2840, type: !792, isLocal: true, isDefinition: true, scopeLine: 2841, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.cwrobject*)* @cwr_reduce, variables: !818)
!818 = !{!819, !820, !824, !825, !829}
!819 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !817, file: !1, line: 2840, type: !377)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !821, file: !1, line: 2847, type: !4)
!821 = distinct !DILexicalBlock(scope: !822, file: !1, line: 2846, column: 12)
!822 = distinct !DILexicalBlock(scope: !823, file: !1, line: 2844, column: 16)
!823 = distinct !DILexicalBlock(scope: !817, file: !1, line: 2842, column: 9)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !821, file: !1, line: 2848, type: !10)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !826, file: !1, line: 2856, type: !4)
!826 = distinct !DILexicalBlock(scope: !827, file: !1, line: 2855, column: 9)
!827 = distinct !DILexicalBlock(scope: !828, file: !1, line: 2854, column: 9)
!828 = distinct !DILexicalBlock(scope: !821, file: !1, line: 2854, column: 9)
!829 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !830, file: !1, line: 2858, type: !4)
!830 = distinct !DILexicalBlock(scope: !831, file: !1, line: 2858, column: 17)
!831 = distinct !DILexicalBlock(scope: !832, file: !1, line: 2857, column: 25)
!832 = distinct !DILexicalBlock(scope: !826, file: !1, line: 2857, column: 17)
!833 = !DISubprogram(name: "cwr_setstate", scope: !1, file: !1, line: 2869, type: !834, isLocal: true, isDefinition: true, scopeLine: 2870, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.cwrobject*, %struct._object*)* @cwr_setstate, variables: !836)
!834 = !DISubroutineType(types: !835)
!835 = !{!4, !377, !4}
!836 = !{!837, !838, !839, !840, !841, !842, !846, !847, !851, !853}
!837 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !833, file: !1, line: 2869, type: !377)
!838 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 2, scope: !833, file: !1, line: 2869, type: !4)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !833, file: !1, line: 2871, type: !4)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !833, file: !1, line: 2872, type: !10)
!841 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !833, file: !1, line: 2872, type: !10)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indexObject", scope: !843, file: !1, line: 2883, type: !4)
!843 = distinct !DILexicalBlock(scope: !844, file: !1, line: 2882, column: 5)
!844 = distinct !DILexicalBlock(scope: !845, file: !1, line: 2881, column: 5)
!845 = distinct !DILexicalBlock(scope: !833, file: !1, line: 2881, column: 5)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !843, file: !1, line: 2884, type: !10)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "element", scope: !848, file: !1, line: 2898, type: !4)
!848 = distinct !DILexicalBlock(scope: !849, file: !1, line: 2897, column: 29)
!849 = distinct !DILexicalBlock(scope: !850, file: !1, line: 2897, column: 5)
!850 = distinct !DILexicalBlock(scope: !833, file: !1, line: 2897, column: 5)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !852, file: !1, line: 2902, type: !4)
!852 = distinct !DILexicalBlock(scope: !833, file: !1, line: 2902, column: 5)
!853 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !854, file: !1, line: 2902, type: !4)
!854 = distinct !DILexicalBlock(scope: !855, file: !1, line: 2902, column: 5)
!855 = distinct !DILexicalBlock(scope: !856, file: !1, line: 2902, column: 5)
!856 = distinct !DILexicalBlock(scope: !852, file: !1, line: 2902, column: 5)
!857 = !DISubprogram(name: "cwr_sizeof", scope: !1, file: !1, line: 2744, type: !858, isLocal: true, isDefinition: true, scopeLine: 2745, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.cwrobject*, i8*)* @cwr_sizeof, variables: !860)
!858 = !DISubroutineType(types: !859)
!859 = !{!4, !377, !89}
!860 = !{!861, !862, !863}
!861 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "co", arg: 1, scope: !857, file: !1, line: 2744, type: !377)
!862 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !857, file: !1, line: 2744, type: !89)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !857, file: !1, line: 2746, type: !10)
!864 = !DISubprogram(name: "cwr_new", scope: !1, file: !1, line: 2679, type: !621, isLocal: true, isDefinition: true, scopeLine: 2680, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @cwr_new, variables: !865)
!865 = !{!866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !878}
!866 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !864, file: !1, line: 2679, type: !550)
!867 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !864, file: !1, line: 2679, type: !4)
!868 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !864, file: !1, line: 2679, type: !4)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "co", scope: !864, file: !1, line: 2681, type: !377)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !864, file: !1, line: 2682, type: !10)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !864, file: !1, line: 2683, type: !10)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pool", scope: !864, file: !1, line: 2684, type: !4)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iterable", scope: !864, file: !1, line: 2685, type: !4)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !864, file: !1, line: 2686, type: !247)
!875 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !864, file: !1, line: 2687, type: !10)
!876 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !877, file: !1, line: 2728, type: !4)
!877 = distinct !DILexicalBlock(scope: !864, file: !1, line: 2728, column: 5)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !879, file: !1, line: 2728, type: !4)
!879 = distinct !DILexicalBlock(scope: !880, file: !1, line: 2728, column: 5)
!880 = distinct !DILexicalBlock(scope: !877, file: !1, line: 2728, column: 5)
!881 = !DISubprogram(name: "cycle_dealloc", scope: !1, file: !1, line: 911, type: !882, isLocal: true, isDefinition: true, scopeLine: 912, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.cycleobject*)* @cycle_dealloc, variables: !884)
!882 = !DISubroutineType(types: !883)
!883 = !{null, !387}
!884 = !{!885, !886, !888, !891, !893}
!885 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !881, file: !1, line: 911, type: !387)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !887, file: !1, line: 914, type: !4)
!887 = distinct !DILexicalBlock(scope: !881, file: !1, line: 914, column: 5)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !889, file: !1, line: 914, type: !4)
!889 = distinct !DILexicalBlock(scope: !890, file: !1, line: 914, column: 5)
!890 = distinct !DILexicalBlock(scope: !887, file: !1, line: 914, column: 5)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !892, file: !1, line: 915, type: !4)
!892 = distinct !DILexicalBlock(scope: !881, file: !1, line: 915, column: 5)
!893 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !894, file: !1, line: 915, type: !4)
!894 = distinct !DILexicalBlock(scope: !895, file: !1, line: 915, column: 5)
!895 = distinct !DILexicalBlock(scope: !892, file: !1, line: 915, column: 5)
!896 = !DISubprogram(name: "cycle_traverse", scope: !1, file: !1, line: 920, type: !897, isLocal: true, isDefinition: true, scopeLine: 921, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cycleobject*, i32 (%struct._object*, i8*)*, i8*)* @cycle_traverse, variables: !899)
!897 = !DISubroutineType(types: !898)
!898 = !{!43, !387, !263, !89}
!899 = !{!900, !901, !902, !903, !907}
!900 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !896, file: !1, line: 920, type: !387)
!901 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !896, file: !1, line: 920, type: !263)
!902 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !896, file: !1, line: 920, type: !89)
!903 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !904, file: !1, line: 922, type: !43)
!904 = distinct !DILexicalBlock(scope: !905, file: !1, line: 922, column: 5)
!905 = distinct !DILexicalBlock(scope: !906, file: !1, line: 922, column: 5)
!906 = distinct !DILexicalBlock(scope: !896, file: !1, line: 922, column: 5)
!907 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !908, file: !1, line: 923, type: !43)
!908 = distinct !DILexicalBlock(scope: !909, file: !1, line: 923, column: 5)
!909 = distinct !DILexicalBlock(scope: !910, file: !1, line: 923, column: 5)
!910 = distinct !DILexicalBlock(scope: !896, file: !1, line: 923, column: 5)
!911 = !DISubprogram(name: "cycle_next", scope: !1, file: !1, line: 928, type: !912, isLocal: true, isDefinition: true, scopeLine: 929, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.cycleobject*)* @cycle_next, variables: !914)
!912 = !DISubroutineType(types: !913)
!913 = !{!4, !387}
!914 = !{!915, !916, !917, !918, !919, !926}
!915 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !911, file: !1, line: 928, type: !387)
!916 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !911, file: !1, line: 930, type: !4)
!917 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !911, file: !1, line: 931, type: !4)
!918 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !911, file: !1, line: 932, type: !4)
!919 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !920, file: !1, line: 938, type: !4)
!920 = distinct !DILexicalBlock(scope: !921, file: !1, line: 938, column: 17)
!921 = distinct !DILexicalBlock(scope: !922, file: !1, line: 937, column: 67)
!922 = distinct !DILexicalBlock(scope: !923, file: !1, line: 937, column: 17)
!923 = distinct !DILexicalBlock(scope: !924, file: !1, line: 936, column: 27)
!924 = distinct !DILexicalBlock(scope: !925, file: !1, line: 936, column: 13)
!925 = distinct !DILexicalBlock(scope: !911, file: !1, line: 934, column: 15)
!926 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !927, file: !1, line: 957, type: !4)
!927 = distinct !DILexicalBlock(scope: !925, file: !1, line: 957, column: 9)
!928 = !DISubprogram(name: "cycle_reduce", scope: !1, file: !1, line: 962, type: !912, isLocal: true, isDefinition: true, scopeLine: 963, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.cycleobject*)* @cycle_reduce, variables: !929)
!929 = !{!930}
!930 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !928, file: !1, line: 962, type: !387)
!931 = !DISubprogram(name: "cycle_setstate", scope: !1, file: !1, line: 972, type: !932, isLocal: true, isDefinition: true, scopeLine: 973, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.cycleobject*, %struct._object*)* @cycle_setstate, variables: !934)
!932 = !DISubroutineType(types: !933)
!933 = !{!4, !387, !4}
!934 = !{!935, !936, !937, !938, !939, !941, !945}
!935 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !931, file: !1, line: 972, type: !387)
!936 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 2, scope: !931, file: !1, line: 972, type: !4)
!937 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "saved", scope: !931, file: !1, line: 974, type: !4)
!938 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "firstpass", scope: !931, file: !1, line: 975, type: !43)
