; ModuleID = 'longobject.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !448, globals: !2135)
!1 = !DIFile(filename: "Objects/longobject.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !350, !96, !17, !101, !362, !363, !103, !359, !366, !23, !50, !367, !369, !370, !372, !373, !374, !58, !375, !383, !401, !403, !411, !422, !425, !37, !427, !429, !225, !430, !438}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !13, line: 109, baseType: !14)
!13 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !13, line: 105, size: 128, align: 64, elements: !15)
!15 = !{!16, !24}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !14, file: !13, line: 107, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !18, line: 177, baseType: !19)
!18 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !20, line: 102, baseType: !21)
!20 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !22, line: 181, baseType: !23)
!22 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!23 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !14, file: !13, line: 108, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !13, line: 334, size: 3200, align: 64, elements: !27)
!27 = !{!28, !34, !38, !39, !40, !45, !109, !114, !119, !120, !125, !177, !208, !220, !226, !227, !228, !230, !232, !263, !264, !265, !274, !275, !280, !281, !283, !285, !295, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !26, file: !13, line: 335, baseType: !29, size: 192, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !13, line: 114, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 111, size: 192, align: 64, elements: !31)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !30, file: !13, line: 112, baseType: !12, size: 128, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !30, file: !13, line: 113, baseType: !17, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !26, file: !13, line: 336, baseType: !35, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!37 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !26, file: !13, line: 337, baseType: !17, size: 64, align: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !26, file: !13, line: 337, baseType: !17, size: 64, align: 64, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !26, file: !13, line: 341, baseType: !41, size: 64, align: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !13, line: 308, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !11}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !26, file: !13, line: 342, baseType: !46, size: 64, align: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !13, line: 314, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !11, !51, !50}
!50 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !20, line: 48, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !54, line: 246, size: 1728, align: 64, elements: !55)
!54 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!55 = !{!56, !57, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !77, !78, !79, !80, !82, !84, !86, !90, !93, !95, !97, !98, !99, !100, !104, !105}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !53, file: !54, line: 247, baseType: !50, size: 32, align: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !53, file: !54, line: 252, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !53, file: !54, line: 253, baseType: !58, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !53, file: !54, line: 254, baseType: !58, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !53, file: !54, line: 255, baseType: !58, size: 64, align: 64, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !53, file: !54, line: 256, baseType: !58, size: 64, align: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !53, file: !54, line: 257, baseType: !58, size: 64, align: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !53, file: !54, line: 258, baseType: !58, size: 64, align: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !53, file: !54, line: 259, baseType: !58, size: 64, align: 64, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !53, file: !54, line: 261, baseType: !58, size: 64, align: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !53, file: !54, line: 262, baseType: !58, size: 64, align: 64, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !53, file: !54, line: 263, baseType: !58, size: 64, align: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !53, file: !54, line: 265, baseType: !70, size: 64, align: 64, offset: 768)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !54, line: 161, size: 192, align: 64, elements: !72)
!72 = !{!73, !74, !76}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !71, file: !54, line: 162, baseType: !70, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !71, file: !54, line: 163, baseType: !75, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !71, file: !54, line: 167, baseType: !50, size: 32, align: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !53, file: !54, line: 267, baseType: !75, size: 64, align: 64, offset: 832)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !53, file: !54, line: 269, baseType: !50, size: 32, align: 32, offset: 896)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !53, file: !54, line: 273, baseType: !50, size: 32, align: 32, offset: 928)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !53, file: !54, line: 275, baseType: !81, size: 64, align: 64, offset: 960)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !22, line: 140, baseType: !23)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !53, file: !54, line: 279, baseType: !83, size: 16, align: 16, offset: 1024)
!83 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !53, file: !54, line: 280, baseType: !85, size: 8, align: 8, offset: 1040)
!85 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !53, file: !54, line: 281, baseType: !87, size: 8, align: 8, offset: 1048)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, align: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 1)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !53, file: !54, line: 285, baseType: !91, size: 64, align: 64, offset: 1088)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !54, line: 155, baseType: null)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !53, file: !54, line: 294, baseType: !94, size: 64, align: 64, offset: 1152)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !22, line: 141, baseType: !23)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !53, file: !54, line: 303, baseType: !96, size: 64, align: 64, offset: 1216)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !53, file: !54, line: 304, baseType: !96, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !53, file: !54, line: 305, baseType: !96, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !53, file: !54, line: 306, baseType: !96, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !53, file: !54, line: 307, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !53, file: !54, line: 309, baseType: !50, size: 32, align: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !53, file: !54, line: 311, baseType: !106, size: 160, align: 8, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 160, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !26, file: !13, line: 343, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !13, line: 316, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!11, !11, !58}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !26, file: !13, line: 344, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !13, line: 318, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!50, !11, !58, !11}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !26, file: !13, line: 345, baseType: !96, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !26, file: !13, line: 346, baseType: !121, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !13, line: 320, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!11, !11}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !26, file: !13, line: 350, baseType: !126, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !13, line: 278, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 236, size: 2176, align: 64, elements: !129)
!129 = !{!130, !135, !136, !137, !138, !139, !144, !146, !147, !148, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !128, file: !13, line: 241, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !13, line: 166, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!11, !11, !11}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !128, file: !13, line: 242, baseType: !131, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !128, file: !13, line: 243, baseType: !131, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !128, file: !13, line: 244, baseType: !131, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !128, file: !13, line: 245, baseType: !131, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !128, file: !13, line: 246, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !13, line: 167, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!11, !11, !11, !11}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !128, file: !13, line: 247, baseType: !145, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !13, line: 165, baseType: !122)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !128, file: !13, line: 248, baseType: !145, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !128, file: !13, line: 249, baseType: !145, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !128, file: !13, line: 250, baseType: !149, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !13, line: 168, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!50, !11}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !128, file: !13, line: 251, baseType: !145, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !128, file: !13, line: 252, baseType: !131, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !128, file: !13, line: 253, baseType: !131, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !128, file: !13, line: 254, baseType: !131, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !128, file: !13, line: 255, baseType: !131, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !128, file: !13, line: 256, baseType: !131, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !128, file: !13, line: 257, baseType: !145, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !128, file: !13, line: 258, baseType: !96, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !128, file: !13, line: 259, baseType: !145, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !128, file: !13, line: 261, baseType: !131, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !128, file: !13, line: 262, baseType: !131, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !128, file: !13, line: 263, baseType: !131, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !128, file: !13, line: 264, baseType: !131, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !128, file: !13, line: 265, baseType: !140, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !128, file: !13, line: 266, baseType: !131, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !128, file: !13, line: 267, baseType: !131, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !128, file: !13, line: 268, baseType: !131, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !128, file: !13, line: 269, baseType: !131, size: 64, align: 64, offset: 1728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !128, file: !13, line: 270, baseType: !131, size: 64, align: 64, offset: 1792)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !128, file: !13, line: 272, baseType: !131, size: 64, align: 64, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !128, file: !13, line: 273, baseType: !131, size: 64, align: 64, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !128, file: !13, line: 274, baseType: !131, size: 64, align: 64, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !128, file: !13, line: 275, baseType: !131, size: 64, align: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !128, file: !13, line: 277, baseType: !145, size: 64, align: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !26, file: !13, line: 351, baseType: !178, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !13, line: 292, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 280, size: 640, align: 64, elements: !181)
!181 = !{!182, !187, !188, !193, !194, !195, !200, !201, !206, !207}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !180, file: !13, line: 281, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !13, line: 169, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!17, !11}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !180, file: !13, line: 282, baseType: !131, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !180, file: !13, line: 283, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !13, line: 170, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!11, !11, !17}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !180, file: !13, line: 284, baseType: !189, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !180, file: !13, line: 285, baseType: !96, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !180, file: !13, line: 286, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !13, line: 172, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!50, !11, !17, !11}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !180, file: !13, line: 287, baseType: !96, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !180, file: !13, line: 288, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !13, line: 231, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!50, !11, !11}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !180, file: !13, line: 290, baseType: !131, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !180, file: !13, line: 291, baseType: !189, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !26, file: !13, line: 352, baseType: !209, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !13, line: 298, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 294, size: 192, align: 64, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !211, file: !13, line: 295, baseType: !183, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !211, file: !13, line: 296, baseType: !131, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !211, file: !13, line: 297, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !13, line: 174, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!50, !11, !11, !11}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !26, file: !13, line: 356, baseType: !221, size: 64, align: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !13, line: 321, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !11}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !18, line: 186, baseType: !17)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !26, file: !13, line: 357, baseType: !140, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !26, file: !13, line: 358, baseType: !121, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !26, file: !13, line: 359, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !13, line: 317, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !26, file: !13, line: 360, baseType: !231, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !13, line: 319, baseType: !217)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !26, file: !13, line: 363, baseType: !233, size: 64, align: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !13, line: 304, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 301, size: 128, align: 64, elements: !236)
!236 = !{!237, !258}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !235, file: !13, line: 302, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !13, line: 193, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!50, !11, !242, !50}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !13, line: 191, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !13, line: 178, size: 640, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !255, !256, !257}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !244, file: !13, line: 179, baseType: !96, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !244, file: !13, line: 180, baseType: !11, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !13, line: 181, baseType: !17, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !244, file: !13, line: 182, baseType: !17, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !244, file: !13, line: 184, baseType: !50, size: 32, align: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !244, file: !13, line: 185, baseType: !50, size: 32, align: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !244, file: !13, line: 186, baseType: !58, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !244, file: !13, line: 187, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !244, file: !13, line: 188, baseType: !254, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !244, file: !13, line: 189, baseType: !254, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !244, file: !13, line: 190, baseType: !96, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !235, file: !13, line: 303, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !13, line: 194, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !11, !242}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !26, file: !13, line: 366, baseType: !103, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !26, file: !13, line: 368, baseType: !35, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !26, file: !13, line: 372, baseType: !266, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !13, line: 233, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!50, !11, !270, !96}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !13, line: 232, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!50, !11, !96}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !26, file: !13, line: 375, baseType: !149, size: 64, align: 64, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !26, file: !13, line: 379, baseType: !276, size: 64, align: 64, offset: 1600)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !13, line: 322, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!11, !11, !11, !50}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !26, file: !13, line: 382, baseType: !17, size: 64, align: 64, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !26, file: !13, line: 385, baseType: !282, size: 64, align: 64, offset: 1728)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !13, line: 323, baseType: !122)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !26, file: !13, line: 386, baseType: !284, size: 64, align: 64, offset: 1792)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !13, line: 324, baseType: !122)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !26, file: !13, line: 389, baseType: !286, size: 64, align: 64, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 40, size: 256, align: 64, elements: !289)
!288 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 41, baseType: !35, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 18, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 43, baseType: !50, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 45, baseType: !35, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !26, file: !13, line: 390, baseType: !296, size: 64, align: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !13, line: 390, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !26, file: !13, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !58, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!11, !11, !96}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!50, !11, !11, !96}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !58, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !96, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !26, file: !13, line: 392, baseType: !25, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !26, file: !13, line: 393, baseType: !11, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !26, file: !13, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !13, line: 325, baseType: !141)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !26, file: !13, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !13, line: 326, baseType: !217)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !26, file: !13, line: 396, baseType: !17, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !26, file: !13, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !13, line: 327, baseType: !217)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !26, file: !13, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !13, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!11, !25, !17}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !26, file: !13, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !13, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!11, !25, !11, !11}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !26, file: !13, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !13, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !96}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !26, file: !13, line: 401, baseType: !149, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !26, file: !13, line: 402, baseType: !11, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !26, file: !13, line: 403, baseType: !11, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !26, file: !13, line: 404, baseType: !11, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !26, file: !13, line: 405, baseType: !11, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !26, file: !13, line: 406, baseType: !11, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !26, file: !13, line: 407, baseType: !41, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !26, file: !13, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !26, file: !13, line: 412, baseType: !41, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLongObject", file: !352, line: 10, baseType: !353)
!352 = !DIFile(filename: "Include/longobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "_longobject", file: !354, line: 89, size: 256, align: 64, elements: !355)
!354 = !DIFile(filename: "Include/longintrepr.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !353, file: !354, line: 90, baseType: !29, size: 192, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ob_digit", scope: !353, file: !354, line: 91, baseType: !358, size: 32, align: 32, offset: 192)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 32, align: 32, elements: !88)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit", file: !354, line: 49, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !361, line: 51, baseType: !348)
!361 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "sdigit", file: !354, line: 50, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !365, line: 196, baseType: !50)
!365 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!366 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "twodigits", file: !354, line: 51, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !361, line: 55, baseType: !103)
!369 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_uintptr_t", file: !18, line: 153, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !361, line: 122, baseType: !103)
!372 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!374 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !377, line: 33, baseType: !378)
!377 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!378 = !DICompositeType(tag: DW_TAG_structure_type, file: !377, line: 25, size: 256, align: 64, elements: !379)
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !378, file: !377, line: 26, baseType: !29, size: 192, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !378, file: !377, line: 27, baseType: !382, size: 64, align: 64, offset: 192)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 64, align: 64, elements: !88)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !385)
!385 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !386)
!386 = !{!387, !388, !389, !390, !398}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !385, file: !4, line: 291, baseType: !12, size: 128, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !385, file: !4, line: 292, baseType: !17, size: 64, align: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !385, file: !4, line: 293, baseType: !225, size: 64, align: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !385, file: !4, line: 349, baseType: !391, size: 32, align: 32, offset: 256)
!391 = !DICompositeType(tag: DW_TAG_structure_type, scope: !385, file: !4, line: 294, size: 32, align: 32, elements: !392)
!392 = !{!393, !394, !395, !396, !397}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !391, file: !4, line: 303, baseType: !348, size: 2, align: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !391, file: !4, line: 331, baseType: !348, size: 3, align: 32, offset: 2)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !391, file: !4, line: 336, baseType: !348, size: 1, align: 32, offset: 5)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !391, file: !4, line: 340, baseType: !348, size: 1, align: 32, offset: 6)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !391, file: !4, line: 345, baseType: !348, size: 1, align: 32, offset: 7)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !385, file: !4, line: 350, baseType: !399, size: 64, align: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !102, line: 90, baseType: !50)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !369)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !405)
!405 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !406)
!406 = !{!407, !408, !409, !410}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !405, file: !4, line: 357, baseType: !384, size: 384, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !405, file: !4, line: 358, baseType: !17, size: 64, align: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !405, file: !4, line: 360, baseType: !58, size: 64, align: 64, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !405, file: !4, line: 361, baseType: !17, size: 64, align: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !413)
!413 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !414)
!414 = !{!415, !416}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !413, file: !4, line: 369, baseType: !404, size: 576, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !413, file: !4, line: 375, baseType: !417, size: 64, align: 64, offset: 576)
!417 = !DICompositeType(tag: DW_TAG_union_type, scope: !413, file: !4, line: 370, size: 64, align: 64, elements: !418)
!418 = !{!419, !420, !421, !424}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !417, file: !4, line: 371, baseType: !96, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !417, file: !4, line: 372, baseType: !401, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !417, file: !4, line: 373, baseType: !422, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !83)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !417, file: !4, line: 374, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !348)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "stwodigits", file: !354, line: 52, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !365, line: 197, baseType: !23)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_uhash_t", file: !18, line: 189, baseType: !101)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !432, line: 41, baseType: !433)
!432 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!433 = !DICompositeType(tag: DW_TAG_structure_type, file: !432, line: 31, size: 320, align: 64, elements: !434)
!434 = !{!435, !436, !437}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !433, file: !432, line: 32, baseType: !29, size: 192, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !433, file: !432, line: 33, baseType: !225, size: 64, align: 64, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !433, file: !432, line: 34, baseType: !87, size: 8, align: 8, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyByteArrayObject", file: !440, line: 30, baseType: !441)
!440 = !DIFile(filename: "Include/bytearrayobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!441 = !DICompositeType(tag: DW_TAG_structure_type, file: !440, line: 23, size: 448, align: 64, elements: !442)
!442 = !{!443, !444, !445, !446, !447}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !441, file: !440, line: 24, baseType: !29, size: 192, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ob_alloc", scope: !441, file: !440, line: 25, baseType: !17, size: 64, align: 64, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ob_bytes", scope: !441, file: !440, line: 26, baseType: !58, size: 64, align: 64, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ob_start", scope: !441, file: !440, line: 27, baseType: !58, size: 64, align: 64, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ob_exports", scope: !441, file: !440, line: 29, baseType: !50, size: 32, align: 32, offset: 384)
!448 = !{!449, !464, !470, !480, !494, !505, !520, !538, !545, !550, !558, !567, !576, !583, !587, !596, !629, !661, !666, !672, !685, !696, !709, !720, !733, !741, !748, !765, !773, !795, !848, !867, !880, !905, !922, !929, !971, !985, !999, !1005, !1011, !1018, !1025, !1032, !1088, !1148, !1165, !1175, !1181, !1195, !1208, !1249, !1259, !1270, !1322, !1330, !1345, !1349, !1359, !1369, !1393, !1408, !1416, !1419, !1423, !1431, !1499, !1536, !1559, !1576, !1586, !1594, !1599, !1638, !1651, !1822, !1825, !1828, !1833, !1840, !1862, !1867, !1898, !1907, !1912, !1917, !1921, !1926, !1972, !1980, !1987, !2006, !2026, !2058, !2084, !2087, !2094, !2098, !2104, !2108, !2120}
!449 = !DISubprogram(name: "_PyLong_FromNbInt", scope: !1, file: !1, line: 133, type: !450, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: true, function: %struct._longobject* (%struct._object*)* @_PyLong_FromNbInt, variables: !452)
!450 = !DISubroutineType(types: !451)
!451 = !{!350, !11}
!452 = !{!453, !454, !455, !456, !460}
!453 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "integral", arg: 1, scope: !449, file: !1, line: 133, type: !11)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nb", scope: !449, file: !1, line: 135, type: !126)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !449, file: !1, line: 136, type: !11)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !457, file: !1, line: 161, type: !11)
!457 = distinct !DILexicalBlock(scope: !458, file: !1, line: 161, column: 9)
!458 = distinct !DILexicalBlock(scope: !459, file: !1, line: 157, column: 32)
!459 = distinct !DILexicalBlock(scope: !449, file: !1, line: 157, column: 9)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !461, file: !1, line: 170, type: !11)
!461 = distinct !DILexicalBlock(scope: !462, file: !1, line: 170, column: 9)
!462 = distinct !DILexicalBlock(scope: !463, file: !1, line: 169, column: 40)
!463 = distinct !DILexicalBlock(scope: !449, file: !1, line: 165, column: 9)
!464 = !DISubprogram(name: "_PyLong_New", scope: !1, file: !1, line: 184, type: !465, isLocal: false, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: true, function: %struct._longobject* (i64)* @_PyLong_New, variables: !467)
!465 = !DISubroutineType(types: !466)
!466 = !{!350, !17}
!467 = !{!468, !469}
!468 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !464, file: !1, line: 184, type: !17)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !464, file: !1, line: 186, type: !350)
!470 = !DISubprogram(name: "_PyLong_Copy", scope: !1, file: !1, line: 207, type: !471, isLocal: false, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._longobject*)* @_PyLong_Copy, variables: !473)
!471 = !DISubroutineType(types: !472)
!472 = !{!11, !350}
!473 = !{!474, !475, !476, !477}
!474 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 1, scope: !470, file: !1, line: 207, type: !350)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !470, file: !1, line: 209, type: !350)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !470, file: !1, line: 210, type: !17)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ival", scope: !478, file: !1, line: 217, type: !363)
!478 = distinct !DILexicalBlock(scope: !479, file: !1, line: 216, column: 16)
!479 = distinct !DILexicalBlock(scope: !470, file: !1, line: 216, column: 9)
!480 = !DISubprogram(name: "PyLong_FromLong", scope: !1, file: !1, line: 232, type: !481, isLocal: false, isDefinition: true, scopeLine: 233, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i64)* @PyLong_FromLong, variables: !483)
!481 = !DISubroutineType(types: !482)
!482 = !{!11, !23}
!483 = !{!484, !485, !486, !487, !488, !489, !490}
!484 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ival", arg: 1, scope: !480, file: !1, line: 232, type: !23)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !480, file: !1, line: 234, type: !350)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "abs_ival", scope: !480, file: !1, line: 235, type: !103)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !480, file: !1, line: 236, type: !103)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !480, file: !1, line: 237, type: !50)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !480, file: !1, line: 238, type: !50)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !491, file: !1, line: 286, type: !493)
!491 = distinct !DILexicalBlock(scope: !492, file: !1, line: 285, column: 20)
!492 = distinct !DILexicalBlock(scope: !480, file: !1, line: 285, column: 9)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!494 = !DISubprogram(name: "PyLong_FromUnsignedLong", scope: !1, file: !1, line: 301, type: !495, isLocal: false, isDefinition: true, scopeLine: 302, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i64)* @PyLong_FromUnsignedLong, variables: !497)
!495 = !DISubroutineType(types: !496)
!496 = !{!11, !103}
!497 = !{!498, !499, !500, !501, !502}
!498 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ival", arg: 1, scope: !494, file: !1, line: 301, type: !103)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !494, file: !1, line: 303, type: !350)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !494, file: !1, line: 304, type: !103)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !494, file: !1, line: 305, type: !50)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !503, file: !1, line: 317, type: !493)
!503 = distinct !DILexicalBlock(scope: !504, file: !1, line: 316, column: 20)
!504 = distinct !DILexicalBlock(scope: !494, file: !1, line: 316, column: 9)
!505 = !DISubprogram(name: "PyLong_FromDouble", scope: !1, file: !1, line: 330, type: !506, isLocal: false, isDefinition: true, scopeLine: 331, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (double)* @PyLong_FromDouble, variables: !508)
!506 = !DISubroutineType(types: !507)
!507 = !{!11, !366}
!508 = !{!509, !510, !511, !512, !513, !514, !515, !516}
!509 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dval", arg: 1, scope: !505, file: !1, line: 330, type: !366)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !505, file: !1, line: 332, type: !350)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frac", scope: !505, file: !1, line: 333, type: !366)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !505, file: !1, line: 334, type: !50)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndig", scope: !505, file: !1, line: 334, type: !50)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "expo", scope: !505, file: !1, line: 334, type: !50)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "neg", scope: !505, file: !1, line: 334, type: !50)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bits", scope: !517, file: !1, line: 359, type: !359)
!517 = distinct !DILexicalBlock(scope: !518, file: !1, line: 358, column: 32)
!518 = distinct !DILexicalBlock(scope: !519, file: !1, line: 358, column: 5)
!519 = distinct !DILexicalBlock(scope: !505, file: !1, line: 358, column: 5)
!520 = !DISubprogram(name: "PyLong_AsLongAndOverflow", scope: !1, file: !1, line: 392, type: !521, isLocal: false, isDefinition: true, scopeLine: 393, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*, i32*)* @PyLong_AsLongAndOverflow, variables: !524)
!521 = !DISubroutineType(types: !522)
!522 = !{!23, !11, !523}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532, !533, !534}
!525 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vv", arg: 1, scope: !520, file: !1, line: 392, type: !11)
!526 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "overflow", arg: 2, scope: !520, file: !1, line: 392, type: !523)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !520, file: !1, line: 395, type: !350)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !520, file: !1, line: 396, type: !103)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !520, file: !1, line: 396, type: !103)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !520, file: !1, line: 397, type: !23)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !520, file: !1, line: 398, type: !17)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !520, file: !1, line: 399, type: !50)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "do_decref", scope: !520, file: !1, line: 400, type: !50)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !535, file: !1, line: 462, type: !11)
!535 = distinct !DILexicalBlock(scope: !536, file: !1, line: 462, column: 9)
!536 = distinct !DILexicalBlock(scope: !537, file: !1, line: 461, column: 20)
!537 = distinct !DILexicalBlock(scope: !520, file: !1, line: 461, column: 9)
!538 = !DISubprogram(name: "PyLong_AsLong", scope: !1, file: !1, line: 471, type: !539, isLocal: false, isDefinition: true, scopeLine: 472, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyLong_AsLong, variables: !541)
!539 = !DISubroutineType(types: !540)
!540 = !{!23, !11}
!541 = !{!542, !543, !544}
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !538, file: !1, line: 471, type: !11)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overflow", scope: !538, file: !1, line: 473, type: !50)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !538, file: !1, line: 474, type: !23)
!545 = !DISubprogram(name: "_PyLong_AsInt", scope: !1, file: !1, line: 488, type: !151, isLocal: false, isDefinition: true, scopeLine: 489, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @_PyLong_AsInt, variables: !546)
!546 = !{!547, !548, !549}
!547 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !545, file: !1, line: 488, type: !11)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overflow", scope: !545, file: !1, line: 490, type: !50)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !545, file: !1, line: 491, type: !23)
!550 = !DISubprogram(name: "PyLong_AsSsize_t", scope: !1, file: !1, line: 506, type: !185, isLocal: false, isDefinition: true, scopeLine: 506, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyLong_AsSsize_t, variables: !551)
!551 = !{!552, !553, !554, !555, !556, !557}
!552 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vv", arg: 1, scope: !550, file: !1, line: 506, type: !11)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !550, file: !1, line: 507, type: !350)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !550, file: !1, line: 508, type: !101)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !550, file: !1, line: 508, type: !101)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !550, file: !1, line: 509, type: !17)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !550, file: !1, line: 510, type: !50)
!558 = !DISubprogram(name: "PyLong_AsUnsignedLong", scope: !1, file: !1, line: 561, type: !559, isLocal: false, isDefinition: true, scopeLine: 562, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyLong_AsUnsignedLong, variables: !561)
!559 = !DISubroutineType(types: !560)
!560 = !{!103, !11}
!561 = !{!562, !563, !564, !565, !566}
!562 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vv", arg: 1, scope: !558, file: !1, line: 561, type: !11)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !558, file: !1, line: 563, type: !350)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !558, file: !1, line: 564, type: !103)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !558, file: !1, line: 564, type: !103)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !558, file: !1, line: 565, type: !17)
!567 = !DISubprogram(name: "PyLong_AsSize_t", scope: !1, file: !1, line: 605, type: !568, isLocal: false, isDefinition: true, scopeLine: 606, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyLong_AsSize_t, variables: !570)
!568 = !DISubroutineType(types: !569)
!569 = !{!101, !11}
!570 = !{!571, !572, !573, !574, !575}
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vv", arg: 1, scope: !567, file: !1, line: 605, type: !11)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !567, file: !1, line: 607, type: !350)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !567, file: !1, line: 608, type: !101)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !567, file: !1, line: 608, type: !101)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !567, file: !1, line: 609, type: !17)
!576 = !DISubprogram(name: "PyLong_AsUnsignedLongMask", scope: !1, file: !1, line: 678, type: !559, isLocal: false, isDefinition: true, scopeLine: 679, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyLong_AsUnsignedLongMask, variables: !577)
!577 = !{!578, !579, !580, !581}
!578 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !576, file: !1, line: 678, type: !11)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lo", scope: !576, file: !1, line: 680, type: !350)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !576, file: !1, line: 681, type: !103)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !582, file: !1, line: 697, type: !11)
!582 = distinct !DILexicalBlock(scope: !576, file: !1, line: 697, column: 5)
!583 = !DISubprogram(name: "_PyLong_Sign", scope: !1, file: !1, line: 702, type: !151, isLocal: false, isDefinition: true, scopeLine: 703, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @_PyLong_Sign, variables: !584)
!584 = !{!585, !586}
!585 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vv", arg: 1, scope: !583, file: !1, line: 702, type: !11)
!586 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !583, file: !1, line: 704, type: !350)
!587 = !DISubprogram(name: "_PyLong_NumBits", scope: !1, file: !1, line: 713, type: !568, isLocal: false, isDefinition: true, scopeLine: 714, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @_PyLong_NumBits, variables: !588)
!588 = !{!589, !590, !591, !592, !593}
!589 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vv", arg: 1, scope: !587, file: !1, line: 713, type: !11)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !587, file: !1, line: 715, type: !350)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !587, file: !1, line: 716, type: !101)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !587, file: !1, line: 717, type: !17)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msd", scope: !594, file: !1, line: 724, type: !359)
!594 = distinct !DILexicalBlock(scope: !595, file: !1, line: 723, column: 22)
!595 = distinct !DILexicalBlock(scope: !587, file: !1, line: 723, column: 9)
!596 = !DISubprogram(name: "_PyLong_FromByteArray", scope: !1, file: !1, line: 744, type: !597, isLocal: false, isDefinition: true, scopeLine: 746, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i64, i32, i32)* @_PyLong_FromByteArray, variables: !601)
!597 = !DISubroutineType(types: !598)
!598 = !{!11, !599, !101, !50, !50}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!601 = !{!602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !615, !616, !618, !619, !621, !622, !623, !624, !625}
!602 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bytes", arg: 1, scope: !596, file: !1, line: 744, type: !599)
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !596, file: !1, line: 744, type: !101)
!604 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "little_endian", arg: 3, scope: !596, file: !1, line: 745, type: !50)
!605 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "is_signed", arg: 4, scope: !596, file: !1, line: 745, type: !50)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pstartbyte", scope: !596, file: !1, line: 747, type: !599)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "incr", scope: !596, file: !1, line: 748, type: !50)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pendbyte", scope: !596, file: !1, line: 749, type: !599)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numsignificantbytes", scope: !596, file: !1, line: 750, type: !101)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !596, file: !1, line: 751, type: !17)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !596, file: !1, line: 752, type: !350)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idigit", scope: !596, file: !1, line: 753, type: !17)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !614, file: !1, line: 776, type: !101)
!614 = distinct !DILexicalBlock(scope: !596, file: !1, line: 775, column: 5)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !614, file: !1, line: 777, type: !599)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pincr", scope: !614, file: !1, line: 778, type: !617)
!617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "insignficant", scope: !614, file: !1, line: 779, type: !600)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !620, file: !1, line: 813, type: !101)
!620 = distinct !DILexicalBlock(scope: !596, file: !1, line: 812, column: 5)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "carry", scope: !620, file: !1, line: 814, type: !367)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "accum", scope: !620, file: !1, line: 815, type: !367)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "accumbits", scope: !620, file: !1, line: 816, type: !348)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !620, file: !1, line: 817, type: !599)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thisbyte", scope: !626, file: !1, line: 820, type: !367)
!626 = distinct !DILexicalBlock(scope: !627, file: !1, line: 819, column: 62)
!627 = distinct !DILexicalBlock(scope: !628, file: !1, line: 819, column: 9)
!628 = distinct !DILexicalBlock(scope: !620, file: !1, line: 819, column: 9)
!629 = !DISubprogram(name: "_PyLong_AsByteArray", scope: !1, file: !1, line: 855, type: !630, isLocal: false, isDefinition: true, scopeLine: 858, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._longobject*, i8*, i64, i32, i32)* @_PyLong_AsByteArray, variables: !632)
!630 = !DISubroutineType(types: !631)
!631 = !{!50, !350, !373, !101, !50, !50}
!632 = !{!633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !651, !654, !658, !659}
!633 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !629, file: !1, line: 855, type: !350)
!634 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bytes", arg: 2, scope: !629, file: !1, line: 856, type: !373)
!635 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 3, scope: !629, file: !1, line: 856, type: !101)
!636 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "little_endian", arg: 4, scope: !629, file: !1, line: 857, type: !50)
!637 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "is_signed", arg: 5, scope: !629, file: !1, line: 857, type: !50)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !629, file: !1, line: 859, type: !17)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !629, file: !1, line: 860, type: !17)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "accum", scope: !629, file: !1, line: 861, type: !367)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "accumbits", scope: !629, file: !1, line: 862, type: !348)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "do_twos_comp", scope: !629, file: !1, line: 863, type: !50)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "carry", scope: !629, file: !1, line: 864, type: !359)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !629, file: !1, line: 865, type: !101)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !629, file: !1, line: 866, type: !373)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pincr", scope: !629, file: !1, line: 867, type: !50)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thisdigit", scope: !648, file: !1, line: 904, type: !359)
!648 = distinct !DILexicalBlock(scope: !649, file: !1, line: 903, column: 35)
!649 = distinct !DILexicalBlock(scope: !650, file: !1, line: 903, column: 5)
!650 = distinct !DILexicalBlock(scope: !629, file: !1, line: 903, column: 5)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !652, file: !1, line: 921, type: !359)
!652 = distinct !DILexicalBlock(scope: !653, file: !1, line: 917, column: 31)
!653 = distinct !DILexicalBlock(scope: !648, file: !1, line: 917, column: 13)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msb", scope: !655, file: !1, line: 963, type: !369)
!655 = distinct !DILexicalBlock(scope: !656, file: !1, line: 958, column: 44)
!656 = distinct !DILexicalBlock(scope: !657, file: !1, line: 958, column: 14)
!657 = distinct !DILexicalBlock(scope: !629, file: !1, line: 945, column: 9)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign_bit_set", scope: !655, file: !1, line: 964, type: !50)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signbyte", scope: !660, file: !1, line: 974, type: !369)
!660 = distinct !DILexicalBlock(scope: !629, file: !1, line: 973, column: 5)
!661 = !DISubprogram(name: "PyLong_FromVoidPtr", scope: !1, file: !1, line: 990, type: !662, isLocal: false, isDefinition: true, scopeLine: 991, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @PyLong_FromVoidPtr, variables: !664)
!662 = !DISubroutineType(types: !663)
!663 = !{!11, !96}
!664 = !{!665}
!665 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !661, file: !1, line: 990, type: !96)
!666 = !DISubprogram(name: "PyLong_AsVoidPtr", scope: !1, file: !1, line: 1010, type: !667, isLocal: false, isDefinition: true, scopeLine: 1011, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct._object*)* @PyLong_AsVoidPtr, variables: !669)
!667 = !DISubroutineType(types: !668)
!668 = !{!96, !11}
!669 = !{!670, !671}
!670 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vv", arg: 1, scope: !666, file: !1, line: 1010, type: !11)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !666, file: !1, line: 1013, type: !23)
!672 = !DISubprogram(name: "PyLong_FromLongLong", scope: !1, file: !1, line: 1052, type: !673, isLocal: false, isDefinition: true, scopeLine: 1053, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i64)* @PyLong_FromLongLong, variables: !675)
!673 = !DISubroutineType(types: !674)
!674 = !{!11, !374}
!675 = !{!676, !677, !678, !679, !680, !681, !682}
!676 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ival", arg: 1, scope: !672, file: !1, line: 1052, type: !374)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !672, file: !1, line: 1054, type: !350)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "abs_ival", scope: !672, file: !1, line: 1055, type: !372)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !672, file: !1, line: 1056, type: !372)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !672, file: !1, line: 1057, type: !50)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "negative", scope: !672, file: !1, line: 1058, type: !50)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !683, file: !1, line: 1082, type: !493)
!683 = distinct !DILexicalBlock(scope: !684, file: !1, line: 1081, column: 20)
!684 = distinct !DILexicalBlock(scope: !672, file: !1, line: 1081, column: 9)
!685 = !DISubprogram(name: "PyLong_FromUnsignedLongLong", scope: !1, file: !1, line: 1096, type: !686, isLocal: false, isDefinition: true, scopeLine: 1097, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i64)* @PyLong_FromUnsignedLongLong, variables: !688)
!686 = !DISubroutineType(types: !687)
!687 = !{!11, !372}
!688 = !{!689, !690, !691, !692, !693}
!689 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ival", arg: 1, scope: !685, file: !1, line: 1096, type: !372)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !685, file: !1, line: 1098, type: !350)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !685, file: !1, line: 1099, type: !372)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !685, file: !1, line: 1100, type: !50)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !694, file: !1, line: 1112, type: !493)
!694 = distinct !DILexicalBlock(scope: !695, file: !1, line: 1111, column: 20)
!695 = distinct !DILexicalBlock(scope: !685, file: !1, line: 1111, column: 9)
!696 = !DISubprogram(name: "PyLong_FromSsize_t", scope: !1, file: !1, line: 1125, type: !697, isLocal: false, isDefinition: true, scopeLine: 1126, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i64)* @PyLong_FromSsize_t, variables: !699)
!697 = !DISubroutineType(types: !698)
!698 = !{!11, !17}
!699 = !{!700, !701, !702, !703, !704, !705, !706}
!700 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ival", arg: 1, scope: !696, file: !1, line: 1125, type: !17)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !696, file: !1, line: 1127, type: !350)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "abs_ival", scope: !696, file: !1, line: 1128, type: !101)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !696, file: !1, line: 1129, type: !101)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !696, file: !1, line: 1130, type: !50)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "negative", scope: !696, file: !1, line: 1131, type: !50)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !707, file: !1, line: 1151, type: !493)
!707 = distinct !DILexicalBlock(scope: !708, file: !1, line: 1150, column: 20)
!708 = distinct !DILexicalBlock(scope: !696, file: !1, line: 1150, column: 9)
!709 = !DISubprogram(name: "PyLong_FromSize_t", scope: !1, file: !1, line: 1165, type: !710, isLocal: false, isDefinition: true, scopeLine: 1166, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i64)* @PyLong_FromSize_t, variables: !712)
!710 = !DISubroutineType(types: !711)
!711 = !{!11, !101}
!712 = !{!713, !714, !715, !716, !717}
!713 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ival", arg: 1, scope: !709, file: !1, line: 1165, type: !101)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !709, file: !1, line: 1167, type: !350)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !709, file: !1, line: 1168, type: !101)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !709, file: !1, line: 1169, type: !50)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !718, file: !1, line: 1181, type: !493)
!718 = distinct !DILexicalBlock(scope: !719, file: !1, line: 1180, column: 20)
!719 = distinct !DILexicalBlock(scope: !709, file: !1, line: 1180, column: 9)
!720 = !DISubprogram(name: "PyLong_AsLongLong", scope: !1, file: !1, line: 1195, type: !721, isLocal: false, isDefinition: true, scopeLine: 1196, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyLong_AsLongLong, variables: !723)
!721 = !DISubroutineType(types: !722)
!722 = !{!374, !11}
!723 = !{!724, !725, !726, !727, !728, !729}
!724 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vv", arg: 1, scope: !720, file: !1, line: 1195, type: !11)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !720, file: !1, line: 1197, type: !350)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !720, file: !1, line: 1198, type: !374)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !720, file: !1, line: 1199, type: !50)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "do_decref", scope: !720, file: !1, line: 1200, type: !50)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !730, file: !1, line: 1233, type: !11)
!730 = distinct !DILexicalBlock(scope: !731, file: !1, line: 1233, column: 9)
!731 = distinct !DILexicalBlock(scope: !732, file: !1, line: 1232, column: 20)
!732 = distinct !DILexicalBlock(scope: !720, file: !1, line: 1232, column: 9)
!733 = !DISubprogram(name: "PyLong_AsUnsignedLongLong", scope: !1, file: !1, line: 1247, type: !734, isLocal: false, isDefinition: true, scopeLine: 1248, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyLong_AsUnsignedLongLong, variables: !736)
!734 = !DISubroutineType(types: !735)
!735 = !{!372, !11}
!736 = !{!737, !738, !739, !740}
!737 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vv", arg: 1, scope: !733, file: !1, line: 1247, type: !11)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !733, file: !1, line: 1249, type: !350)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !733, file: !1, line: 1250, type: !372)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !733, file: !1, line: 1251, type: !50)
!741 = !DISubprogram(name: "PyLong_AsUnsignedLongLongMask", scope: !1, file: !1, line: 1312, type: !734, isLocal: false, isDefinition: true, scopeLine: 1313, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyLong_AsUnsignedLongLongMask, variables: !742)
!742 = !{!743, !744, !745, !746}
!743 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !741, file: !1, line: 1312, type: !11)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lo", scope: !741, file: !1, line: 1314, type: !350)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !741, file: !1, line: 1315, type: !372)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !747, file: !1, line: 1331, type: !11)
!747 = distinct !DILexicalBlock(scope: !741, file: !1, line: 1331, column: 5)
!748 = !DISubprogram(name: "PyLong_AsLongLongAndOverflow", scope: !1, file: !1, line: 1346, type: !749, isLocal: false, isDefinition: true, scopeLine: 1347, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*, i32*)* @PyLong_AsLongLongAndOverflow, variables: !751)
!749 = !DISubroutineType(types: !750)
!750 = !{!374, !11, !523}
!751 = !{!752, !753, !754, !755, !756, !757, !758, !759, !760, !761}
!752 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vv", arg: 1, scope: !748, file: !1, line: 1346, type: !11)
!753 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "overflow", arg: 2, scope: !748, file: !1, line: 1346, type: !523)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !748, file: !1, line: 1349, type: !350)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !748, file: !1, line: 1350, type: !372)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !748, file: !1, line: 1350, type: !372)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !748, file: !1, line: 1351, type: !374)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !748, file: !1, line: 1352, type: !17)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !748, file: !1, line: 1353, type: !50)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "do_decref", scope: !748, file: !1, line: 1354, type: !50)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !762, file: !1, line: 1416, type: !11)
!762 = distinct !DILexicalBlock(scope: !763, file: !1, line: 1416, column: 9)
!763 = distinct !DILexicalBlock(scope: !764, file: !1, line: 1415, column: 20)
!764 = distinct !DILexicalBlock(scope: !748, file: !1, line: 1415, column: 9)
!765 = !DISubprogram(name: "_PyLong_Format", scope: !1, file: !1, line: 1896, type: !766, isLocal: false, isDefinition: true, scopeLine: 1897, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i32)* @_PyLong_Format, variables: !768)
!766 = !DISubroutineType(types: !767)
!767 = !{!11, !11, !50}
!768 = !{!769, !770, !771, !772}
!769 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !765, file: !1, line: 1896, type: !11)
!770 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 2, scope: !765, file: !1, line: 1896, type: !50)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !765, file: !1, line: 1898, type: !11)
!772 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !765, file: !1, line: 1899, type: !50)
!773 = !DISubprogram(name: "_PyLong_FormatWriter", scope: !1, file: !1, line: 1910, type: !774, isLocal: false, isDefinition: true, scopeLine: 1913, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyUnicodeWriter*, %struct._object*, i32, i32)* @_PyLong_FormatWriter, variables: !790)
!774 = !DISubroutineType(types: !775)
!775 = !{!50, !776, !11, !50, !50}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64, align: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyUnicodeWriter", file: !4, line: 917, baseType: !778)
!778 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 897, size: 448, align: 64, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !785, !786, !787, !788, !789}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !778, file: !4, line: 898, baseType: !11, size: 64, align: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !778, file: !4, line: 899, baseType: !96, size: 64, align: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !778, file: !4, line: 900, baseType: !3, size: 32, align: 32, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "maxchar", scope: !778, file: !4, line: 901, baseType: !426, size: 32, align: 32, offset: 160)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !778, file: !4, line: 902, baseType: !17, size: 64, align: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !778, file: !4, line: 903, baseType: !17, size: 64, align: 64, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "min_length", scope: !778, file: !4, line: 906, baseType: !17, size: 64, align: 64, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "min_char", scope: !778, file: !4, line: 909, baseType: !426, size: 32, align: 32, offset: 384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "overallocate", scope: !778, file: !4, line: 912, baseType: !369, size: 8, align: 8, offset: 416)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !778, file: !4, line: 916, baseType: !369, size: 8, align: 8, offset: 424)
!790 = !{!791, !792, !793, !794}
!791 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "writer", arg: 1, scope: !773, file: !1, line: 1910, type: !776)
!792 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !773, file: !1, line: 1911, type: !11)
!793 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 3, scope: !773, file: !1, line: 1912, type: !50)
!794 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alternate", arg: 4, scope: !773, file: !1, line: 1912, type: !50)
!795 = !DISubprogram(name: "PyLong_FromString", scope: !1, file: !1, line: 2021, type: !796, isLocal: false, isDefinition: true, scopeLine: 2022, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i8**, i32)* @PyLong_FromString, variables: !799)
!796 = !DISubroutineType(types: !797)
!797 = !{!11, !35, !798, !50}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!799 = !{!800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !813, !814, !815, !816, !817, !818, !819, !820, !821, !824, !825, !829, !835, !839, !841, !843, !846}
!800 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !795, file: !1, line: 2021, type: !35)
!801 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pend", arg: 2, scope: !795, file: !1, line: 2021, type: !798)
!802 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 3, scope: !795, file: !1, line: 2021, type: !50)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !795, file: !1, line: 2023, type: !50)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error_if_nonzero", scope: !795, file: !1, line: 2023, type: !50)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !795, file: !1, line: 2024, type: !35)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "orig_str", scope: !795, file: !1, line: 2024, type: !35)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !795, file: !1, line: 2025, type: !350)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "strobj", scope: !795, file: !1, line: 2026, type: !11)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slen", scope: !795, file: !1, line: 2027, type: !17)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !811, file: !1, line: 2153, type: !367)
!811 = distinct !DILexicalBlock(scope: !812, file: !1, line: 2067, column: 10)
!812 = distinct !DILexicalBlock(scope: !795, file: !1, line: 2065, column: 9)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size_z", scope: !811, file: !1, line: 2154, type: !17)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !811, file: !1, line: 2155, type: !50)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "convwidth", scope: !811, file: !1, line: 2156, type: !50)
!816 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "convmultmax", scope: !811, file: !1, line: 2157, type: !367)
!817 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "convmult", scope: !811, file: !1, line: 2157, type: !367)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pz", scope: !811, file: !1, line: 2158, type: !493)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pzstop", scope: !811, file: !1, line: 2158, type: !493)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "scan", scope: !811, file: !1, line: 2159, type: !35)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "convmax", scope: !822, file: !1, line: 2166, type: !367)
!822 = distinct !DILexicalBlock(scope: !823, file: !1, line: 2165, column: 41)
!823 = distinct !DILexicalBlock(scope: !811, file: !1, line: 2165, column: 13)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !822, file: !1, line: 2167, type: !50)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next", scope: !826, file: !1, line: 2172, type: !367)
!826 = distinct !DILexicalBlock(scope: !827, file: !1, line: 2171, column: 22)
!827 = distinct !DILexicalBlock(scope: !828, file: !1, line: 2171, column: 13)
!828 = distinct !DILexicalBlock(scope: !822, file: !1, line: 2171, column: 13)
!829 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !830, file: !1, line: 2244, type: !350)
!830 = distinct !DILexicalBlock(scope: !831, file: !1, line: 2243, column: 22)
!831 = distinct !DILexicalBlock(scope: !832, file: !1, line: 2239, column: 21)
!832 = distinct !DILexicalBlock(scope: !833, file: !1, line: 2237, column: 20)
!833 = distinct !DILexicalBlock(scope: !834, file: !1, line: 2237, column: 17)
!834 = distinct !DILexicalBlock(scope: !811, file: !1, line: 2209, column: 28)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !836, file: !1, line: 2249, type: !11)
!836 = distinct !DILexicalBlock(scope: !837, file: !1, line: 2249, column: 25)
!837 = distinct !DILexicalBlock(scope: !838, file: !1, line: 2248, column: 38)
!838 = distinct !DILexicalBlock(scope: !830, file: !1, line: 2248, column: 25)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !840, file: !1, line: 2255, type: !11)
!840 = distinct !DILexicalBlock(scope: !830, file: !1, line: 2255, column: 21)
!841 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !842, file: !1, line: 2293, type: !11)
!842 = distinct !DILexicalBlock(scope: !795, file: !1, line: 2293, column: 5)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !844, file: !1, line: 2293, type: !11)
!844 = distinct !DILexicalBlock(scope: !845, file: !1, line: 2293, column: 5)
!845 = distinct !DILexicalBlock(scope: !842, file: !1, line: 2293, column: 5)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !847, file: !1, line: 2301, type: !11)
!847 = distinct !DILexicalBlock(scope: !795, file: !1, line: 2301, column: 5)
!848 = !DISubprogram(name: "_PyLong_FromBytes", scope: !1, file: !1, line: 2311, type: !849, isLocal: false, isDefinition: true, scopeLine: 2312, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i64, i32)* @_PyLong_FromBytes, variables: !851)
!849 = !DISubroutineType(types: !850)
!850 = !{!11, !35, !17, !50}
!851 = !{!852, !853, !854, !855, !856, !857, !858, !860, !863}
!852 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !848, file: !1, line: 2311, type: !35)
!853 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !848, file: !1, line: 2311, type: !17)
!854 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 3, scope: !848, file: !1, line: 2311, type: !50)
!855 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !848, file: !1, line: 2313, type: !11)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "strobj", scope: !848, file: !1, line: 2313, type: !11)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !848, file: !1, line: 2314, type: !58)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !859, file: !1, line: 2319, type: !11)
!859 = distinct !DILexicalBlock(scope: !848, file: !1, line: 2319, column: 5)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !861, file: !1, line: 2319, type: !11)
!861 = distinct !DILexicalBlock(scope: !862, file: !1, line: 2319, column: 5)
!862 = distinct !DILexicalBlock(scope: !859, file: !1, line: 2319, column: 5)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !864, file: !1, line: 2325, type: !11)
!864 = distinct !DILexicalBlock(scope: !865, file: !1, line: 2325, column: 9)
!865 = distinct !DILexicalBlock(scope: !866, file: !1, line: 2321, column: 25)
!866 = distinct !DILexicalBlock(scope: !848, file: !1, line: 2321, column: 9)
!867 = !DISubprogram(name: "PyLong_FromUnicode", scope: !1, file: !1, line: 2331, type: !868, isLocal: false, isDefinition: true, scopeLine: 2332, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32*, i64, i32)* @PyLong_FromUnicode, variables: !872)
!868 = !DISubroutineType(types: !869)
!869 = !{!11, !870, !17, !50}
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64, align: 64)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UNICODE", file: !4, line: 93, baseType: !400)
!872 = !{!873, !874, !875, !876, !877, !878}
!873 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "u", arg: 1, scope: !867, file: !1, line: 2331, type: !870)
!874 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 2, scope: !867, file: !1, line: 2331, type: !17)
!875 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 3, scope: !867, file: !1, line: 2331, type: !50)
!876 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !867, file: !1, line: 2333, type: !11)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unicode", scope: !867, file: !1, line: 2333, type: !11)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !879, file: !1, line: 2337, type: !11)
!879 = distinct !DILexicalBlock(scope: !867, file: !1, line: 2337, column: 5)
!880 = !DISubprogram(name: "PyLong_FromUnicodeObject", scope: !1, file: !1, line: 2342, type: !766, isLocal: false, isDefinition: true, scopeLine: 2343, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i32)* @PyLong_FromUnicodeObject, variables: !881)
!881 = !{!882, !883, !884, !885, !886, !887, !888, !889, !893, !898, !900, !902}
!882 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "u", arg: 1, scope: !880, file: !1, line: 2342, type: !11)
!883 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 2, scope: !880, file: !1, line: 2342, type: !50)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !880, file: !1, line: 2344, type: !11)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "asciidig", scope: !880, file: !1, line: 2344, type: !11)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !880, file: !1, line: 2345, type: !58)
!887 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !880, file: !1, line: 2345, type: !58)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buflen", scope: !880, file: !1, line: 2346, type: !17)
!889 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !890, file: !1, line: 2353, type: !11)
!890 = distinct !DILexicalBlock(scope: !891, file: !1, line: 2353, column: 9)
!891 = distinct !DILexicalBlock(scope: !892, file: !1, line: 2352, column: 25)
!892 = distinct !DILexicalBlock(scope: !880, file: !1, line: 2352, column: 9)
!893 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !894, file: !1, line: 2360, type: !11)
!894 = distinct !DILexicalBlock(scope: !895, file: !1, line: 2360, column: 13)
!895 = distinct !DILexicalBlock(scope: !896, file: !1, line: 2359, column: 72)
!896 = distinct !DILexicalBlock(scope: !897, file: !1, line: 2359, column: 13)
!897 = distinct !DILexicalBlock(scope: !892, file: !1, line: 2357, column: 10)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !899, file: !1, line: 2363, type: !11)
!899 = distinct !DILexicalBlock(scope: !897, file: !1, line: 2363, column: 9)
!900 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !901, file: !1, line: 2364, type: !11)
!901 = distinct !DILexicalBlock(scope: !897, file: !1, line: 2364, column: 9)
!902 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !903, file: !1, line: 2364, type: !11)
!903 = distinct !DILexicalBlock(scope: !904, file: !1, line: 2364, column: 9)
!904 = distinct !DILexicalBlock(scope: !901, file: !1, line: 2364, column: 9)
!905 = !DISubprogram(name: "_PyLong_Frexp", scope: !1, file: !1, line: 2583, type: !906, isLocal: false, isDefinition: true, scopeLine: 2584, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct._longobject*, i64*)* @_PyLong_Frexp, variables: !908)
!906 = !DISubroutineType(types: !907)
!907 = !{!366, !350, !254}
!908 = !{!909, !910, !911, !912, !913, !914, !915, !916, !917, !921}
!909 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !905, file: !1, line: 2583, type: !350)
!910 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "e", arg: 2, scope: !905, file: !1, line: 2583, type: !254)
!911 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a_size", scope: !905, file: !1, line: 2585, type: !17)
!912 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a_bits", scope: !905, file: !1, line: 2585, type: !17)
!913 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shift_digits", scope: !905, file: !1, line: 2585, type: !17)
!914 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shift_bits", scope: !905, file: !1, line: 2585, type: !17)
!915 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x_size", scope: !905, file: !1, line: 2585, type: !17)
!916 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rem", scope: !905, file: !1, line: 2587, type: !359)
!917 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x_digits", scope: !905, file: !1, line: 2587, type: !918)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 96, align: 32, elements: !919)
!919 = !{!920}
!920 = !DISubrange(count: 3)
!921 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !905, file: !1, line: 2588, type: !366)
!922 = !DISubprogram(name: "PyLong_AsDouble", scope: !1, file: !1, line: 2696, type: !923, isLocal: false, isDefinition: true, scopeLine: 2697, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct._object*)* @PyLong_AsDouble, variables: !925)
!923 = !DISubroutineType(types: !924)
!924 = !{!366, !11}
!925 = !{!926, !927, !928}
!926 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !922, file: !1, line: 2696, type: !11)
!927 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exponent", scope: !922, file: !1, line: 2698, type: !17)
!928 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !922, file: !1, line: 2699, type: !366)
!929 = !DISubprogram(name: "_PyLong_DivmodNear", scope: !1, file: !1, line: 4469, type: !133, isLocal: false, isDefinition: true, scopeLine: 4470, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @_PyLong_DivmodNear, variables: !930)
!930 = !{!931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !946, !948, !952, !954, !956, !958, !961, !963, !966, !968}
!931 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !929, file: !1, line: 4469, type: !11)
!932 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !929, file: !1, line: 4469, type: !11)
!933 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "quo", scope: !929, file: !1, line: 4471, type: !350)
