; ModuleID = 'marshal.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !467, globals: !1138)
!1 = !DIFile(filename: "Python/marshal.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !12, !59, !101, !350, !18, !38, !358, !370, !51, !378, !379, !397, !400, !408, !399, !24, !424, !432, !441, !466, !459, !367}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !14, line: 109, baseType: !15)
!14 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !14, line: 105, size: 128, align: 64, elements: !16)
!16 = !{!17, !25}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !15, file: !14, line: 107, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !19, line: 177, baseType: !20)
!19 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !21, line: 102, baseType: !22)
!21 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !23, line: 181, baseType: !24)
!23 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!24 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !15, file: !14, line: 108, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !14, line: 334, size: 3200, align: 64, elements: !28)
!28 = !{!29, !35, !39, !40, !41, !46, !109, !114, !119, !120, !125, !177, !208, !220, !226, !227, !228, !230, !232, !263, !264, !265, !274, !275, !280, !281, !283, !285, !295, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !27, file: !14, line: 335, baseType: !30, size: 192, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !14, line: 114, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 111, size: 192, align: 64, elements: !32)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !14, line: 112, baseType: !13, size: 128, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !31, file: !14, line: 113, baseType: !18, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !27, file: !14, line: 336, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !27, file: !14, line: 341, baseType: !42, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !14, line: 308, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !12}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !27, file: !14, line: 342, baseType: !47, size: 64, align: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !14, line: 314, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !12, !52, !51}
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !21, line: 48, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !55, line: 246, size: 1728, align: 64, elements: !56)
!55 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!56 = !{!57, !58, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !78, !79, !80, !81, !83, !85, !87, !91, !94, !96, !97, !98, !99, !100, !104, !105}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !54, file: !55, line: 247, baseType: !51, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !54, file: !55, line: 252, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !54, file: !55, line: 253, baseType: !59, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !54, file: !55, line: 254, baseType: !59, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !54, file: !55, line: 255, baseType: !59, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !54, file: !55, line: 256, baseType: !59, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !54, file: !55, line: 257, baseType: !59, size: 64, align: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !54, file: !55, line: 258, baseType: !59, size: 64, align: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !54, file: !55, line: 259, baseType: !59, size: 64, align: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !54, file: !55, line: 261, baseType: !59, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !54, file: !55, line: 262, baseType: !59, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !54, file: !55, line: 263, baseType: !59, size: 64, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !54, file: !55, line: 265, baseType: !71, size: 64, align: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !55, line: 161, size: 192, align: 64, elements: !73)
!73 = !{!74, !75, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !72, file: !55, line: 162, baseType: !71, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !72, file: !55, line: 163, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !72, file: !55, line: 167, baseType: !51, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !54, file: !55, line: 267, baseType: !76, size: 64, align: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !54, file: !55, line: 269, baseType: !51, size: 32, align: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !54, file: !55, line: 273, baseType: !51, size: 32, align: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !54, file: !55, line: 275, baseType: !82, size: 64, align: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !23, line: 140, baseType: !24)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !54, file: !55, line: 279, baseType: !84, size: 16, align: 16, offset: 1024)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !54, file: !55, line: 280, baseType: !86, size: 8, align: 8, offset: 1040)
!86 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !54, file: !55, line: 281, baseType: !88, size: 8, align: 8, offset: 1048)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !54, file: !55, line: 285, baseType: !92, size: 64, align: 64, offset: 1088)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !55, line: 155, baseType: null)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !54, file: !55, line: 294, baseType: !95, size: 64, align: 64, offset: 1152)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !23, line: 141, baseType: !24)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !54, file: !55, line: 303, baseType: !11, size: 64, align: 64, offset: 1216)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !54, file: !55, line: 304, baseType: !11, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !54, file: !55, line: 305, baseType: !11, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !54, file: !55, line: 306, baseType: !11, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !54, file: !55, line: 307, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !54, file: !55, line: 309, baseType: !51, size: 32, align: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !54, file: !55, line: 311, baseType: !106, size: 160, align: 8, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !27, file: !14, line: 343, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !14, line: 316, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!12, !12, !59}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !27, file: !14, line: 344, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !14, line: 318, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!51, !12, !59, !12}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !27, file: !14, line: 345, baseType: !11, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !27, file: !14, line: 346, baseType: !121, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !14, line: 320, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!12, !12}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !27, file: !14, line: 350, baseType: !126, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !14, line: 278, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 236, size: 2176, align: 64, elements: !129)
!129 = !{!130, !135, !136, !137, !138, !139, !144, !146, !147, !148, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !128, file: !14, line: 241, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !14, line: 166, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!12, !12, !12}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !128, file: !14, line: 242, baseType: !131, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !128, file: !14, line: 243, baseType: !131, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !128, file: !14, line: 244, baseType: !131, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !128, file: !14, line: 245, baseType: !131, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !128, file: !14, line: 246, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !14, line: 167, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!12, !12, !12, !12}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !128, file: !14, line: 247, baseType: !145, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !14, line: 165, baseType: !122)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !128, file: !14, line: 248, baseType: !145, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !128, file: !14, line: 249, baseType: !145, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !128, file: !14, line: 250, baseType: !149, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !14, line: 168, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!51, !12}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !128, file: !14, line: 251, baseType: !145, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !128, file: !14, line: 252, baseType: !131, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !128, file: !14, line: 253, baseType: !131, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !128, file: !14, line: 254, baseType: !131, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !128, file: !14, line: 255, baseType: !131, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !128, file: !14, line: 256, baseType: !131, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !128, file: !14, line: 257, baseType: !145, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !128, file: !14, line: 258, baseType: !11, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !128, file: !14, line: 259, baseType: !145, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !128, file: !14, line: 261, baseType: !131, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !128, file: !14, line: 262, baseType: !131, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !128, file: !14, line: 263, baseType: !131, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !128, file: !14, line: 264, baseType: !131, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !128, file: !14, line: 265, baseType: !140, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !128, file: !14, line: 266, baseType: !131, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !128, file: !14, line: 267, baseType: !131, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !128, file: !14, line: 268, baseType: !131, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !128, file: !14, line: 269, baseType: !131, size: 64, align: 64, offset: 1728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !128, file: !14, line: 270, baseType: !131, size: 64, align: 64, offset: 1792)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !128, file: !14, line: 272, baseType: !131, size: 64, align: 64, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !128, file: !14, line: 273, baseType: !131, size: 64, align: 64, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !128, file: !14, line: 274, baseType: !131, size: 64, align: 64, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !128, file: !14, line: 275, baseType: !131, size: 64, align: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !128, file: !14, line: 277, baseType: !145, size: 64, align: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !27, file: !14, line: 351, baseType: !178, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !14, line: 292, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 280, size: 640, align: 64, elements: !181)
!181 = !{!182, !187, !188, !193, !194, !195, !200, !201, !206, !207}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !180, file: !14, line: 281, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !14, line: 169, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!18, !12}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !180, file: !14, line: 282, baseType: !131, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !180, file: !14, line: 283, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !14, line: 170, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!12, !12, !18}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !180, file: !14, line: 284, baseType: !189, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !180, file: !14, line: 285, baseType: !11, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !180, file: !14, line: 286, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !14, line: 172, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!51, !12, !18, !12}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !180, file: !14, line: 287, baseType: !11, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !180, file: !14, line: 288, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !14, line: 231, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!51, !12, !12}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !180, file: !14, line: 290, baseType: !131, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !180, file: !14, line: 291, baseType: !189, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !27, file: !14, line: 352, baseType: !209, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !14, line: 298, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 294, size: 192, align: 64, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !211, file: !14, line: 295, baseType: !183, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !211, file: !14, line: 296, baseType: !131, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !211, file: !14, line: 297, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !14, line: 174, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!51, !12, !12, !12}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !27, file: !14, line: 356, baseType: !221, size: 64, align: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !14, line: 321, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !12}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !19, line: 186, baseType: !18)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !27, file: !14, line: 357, baseType: !140, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !27, file: !14, line: 358, baseType: !121, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !27, file: !14, line: 359, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !14, line: 317, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !27, file: !14, line: 360, baseType: !231, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !14, line: 319, baseType: !217)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !27, file: !14, line: 363, baseType: !233, size: 64, align: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !14, line: 304, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 301, size: 128, align: 64, elements: !236)
!236 = !{!237, !258}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !235, file: !14, line: 302, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !14, line: 193, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!51, !12, !242, !51}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !14, line: 191, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !14, line: 178, size: 640, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !255, !256, !257}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !244, file: !14, line: 179, baseType: !11, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !244, file: !14, line: 180, baseType: !12, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !14, line: 181, baseType: !18, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !244, file: !14, line: 182, baseType: !18, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !244, file: !14, line: 184, baseType: !51, size: 32, align: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !244, file: !14, line: 185, baseType: !51, size: 32, align: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !244, file: !14, line: 186, baseType: !59, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !244, file: !14, line: 187, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !244, file: !14, line: 188, baseType: !254, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !244, file: !14, line: 189, baseType: !254, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !244, file: !14, line: 190, baseType: !11, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !235, file: !14, line: 303, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !14, line: 194, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !12, !242}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !27, file: !14, line: 366, baseType: !103, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !27, file: !14, line: 368, baseType: !36, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !27, file: !14, line: 372, baseType: !266, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !14, line: 233, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!51, !12, !270, !11}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !14, line: 232, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!51, !12, !11}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !27, file: !14, line: 375, baseType: !149, size: 64, align: 64, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !27, file: !14, line: 379, baseType: !276, size: 64, align: 64, offset: 1600)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !14, line: 322, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!12, !12, !12, !51}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !27, file: !14, line: 382, baseType: !18, size: 64, align: 64, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !27, file: !14, line: 385, baseType: !282, size: 64, align: 64, offset: 1728)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !14, line: 323, baseType: !122)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !27, file: !14, line: 386, baseType: !284, size: 64, align: 64, offset: 1792)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !14, line: 324, baseType: !122)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !27, file: !14, line: 389, baseType: !286, size: 64, align: 64, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 40, size: 256, align: 64, elements: !289)
!288 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 41, baseType: !36, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 18, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 43, baseType: !51, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 45, baseType: !36, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !27, file: !14, line: 390, baseType: !296, size: 64, align: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !14, line: 390, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !27, file: !14, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !59, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!12, !12, !11}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!51, !12, !12, !11}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !59, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !11, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !27, file: !14, line: 392, baseType: !26, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !27, file: !14, line: 393, baseType: !12, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !27, file: !14, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !14, line: 325, baseType: !141)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !27, file: !14, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !14, line: 326, baseType: !217)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !27, file: !14, line: 396, baseType: !18, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !27, file: !14, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !14, line: 327, baseType: !217)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !27, file: !14, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !14, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!12, !26, !18}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !27, file: !14, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !14, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!12, !26, !12, !12}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !27, file: !14, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !14, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !11}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !27, file: !14, line: 401, baseType: !149, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !27, file: !14, line: 402, baseType: !12, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !27, file: !14, line: 403, baseType: !12, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !27, file: !14, line: 404, baseType: !12, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !27, file: !14, line: 405, baseType: !12, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !27, file: !14, line: 406, baseType: !12, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !27, file: !14, line: 407, baseType: !42, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !27, file: !14, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !27, file: !14, line: 412, baseType: !42, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !352, line: 41, baseType: !353)
!352 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!353 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 31, size: 320, align: 64, elements: !354)
!354 = !{!355, !356, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !353, file: !352, line: 32, baseType: !30, size: 192, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !353, file: !352, line: 33, baseType: !225, size: 64, align: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !353, file: !352, line: 34, baseType: !88, size: 8, align: 8, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLongObject", file: !360, line: 10, baseType: !361)
!360 = !DIFile(filename: "Include/longobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "_longobject", file: !362, line: 89, size: 256, align: 64, elements: !363)
!362 = !DIFile(filename: "Include/longintrepr.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !361, file: !362, line: 90, baseType: !30, size: 192, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ob_digit", scope: !361, file: !362, line: 91, baseType: !366, size: 32, align: 32, offset: 192)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 32, align: 32, elements: !89)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit", file: !362, line: 49, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !369, line: 51, baseType: !348)
!369 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFloatObject", file: !372, line: 18, baseType: !373)
!372 = !DIFile(filename: "Include/floatobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!373 = !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 15, size: 192, align: 64, elements: !374)
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !373, file: !372, line: 16, baseType: !13, size: 128, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ob_fval", scope: !373, file: !372, line: 17, baseType: !377, size: 64, align: 64, offset: 128)
!377 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !381)
!381 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !382)
!382 = !{!383, !384, !385, !386, !394}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !381, file: !4, line: 291, baseType: !13, size: 128, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !381, file: !4, line: 292, baseType: !18, size: 64, align: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !381, file: !4, line: 293, baseType: !225, size: 64, align: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !381, file: !4, line: 349, baseType: !387, size: 32, align: 32, offset: 256)
!387 = !DICompositeType(tag: DW_TAG_structure_type, scope: !381, file: !4, line: 294, size: 32, align: 32, elements: !388)
!388 = !{!389, !390, !391, !392, !393}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !387, file: !4, line: 303, baseType: !348, size: 2, align: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !387, file: !4, line: 331, baseType: !348, size: 3, align: 32, offset: 2)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !387, file: !4, line: 336, baseType: !348, size: 1, align: 32, offset: 5)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !387, file: !4, line: 340, baseType: !348, size: 1, align: 32, offset: 6)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !387, file: !4, line: 345, baseType: !348, size: 1, align: 32, offset: 7)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !381, file: !4, line: 350, baseType: !395, size: 64, align: 64, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !102, line: 90, baseType: !51)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !399)
!399 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !402)
!402 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !403)
!403 = !{!404, !405, !406, !407}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !402, file: !4, line: 357, baseType: !380, size: 384, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !402, file: !4, line: 358, baseType: !18, size: 64, align: 64, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !402, file: !4, line: 360, baseType: !59, size: 64, align: 64, offset: 448)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !402, file: !4, line: 361, baseType: !18, size: 64, align: 64, offset: 512)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !410)
!410 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !411)
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !410, file: !4, line: 369, baseType: !401, size: 576, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !410, file: !4, line: 375, baseType: !414, size: 64, align: 64, offset: 576)
!414 = !DICompositeType(tag: DW_TAG_union_type, scope: !410, file: !4, line: 370, size: 64, align: 64, elements: !415)
!415 = !{!416, !417, !418, !421}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !414, file: !4, line: 371, baseType: !11, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !414, file: !4, line: 372, baseType: !397, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !414, file: !4, line: 373, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !84)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !414, file: !4, line: 374, baseType: !422, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !348)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !426, line: 33, baseType: !427)
!426 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!427 = !DICompositeType(tag: DW_TAG_structure_type, file: !426, line: 25, size: 256, align: 64, elements: !428)
!428 = !{!429, !430}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !427, file: !426, line: 26, baseType: !30, size: 192, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !427, file: !426, line: 27, baseType: !431, size: 64, align: 64, offset: 192)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, align: 64, elements: !89)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !434, line: 40, baseType: !435)
!434 = !DIFile(filename: "Include/listobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!435 = !DICompositeType(tag: DW_TAG_structure_type, file: !434, line: 23, size: 320, align: 64, elements: !436)
!436 = !{!437, !438, !440}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !435, file: !434, line: 24, baseType: !30, size: 192, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !435, file: !434, line: 26, baseType: !439, size: 64, align: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !435, file: !434, line: 39, baseType: !18, size: 64, align: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !443, line: 33, baseType: !444)
!443 = !DIFile(filename: "Include/code.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!444 = !DICompositeType(tag: DW_TAG_structure_type, file: !443, line: 11, size: 1152, align: 64, elements: !445)
!445 = !{!446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !460, !461, !462, !463, !464, !465}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !444, file: !443, line: 12, baseType: !13, size: 128, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !444, file: !443, line: 13, baseType: !51, size: 32, align: 32, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !444, file: !443, line: 14, baseType: !51, size: 32, align: 32, offset: 160)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !444, file: !443, line: 15, baseType: !51, size: 32, align: 32, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !444, file: !443, line: 16, baseType: !51, size: 32, align: 32, offset: 224)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !444, file: !443, line: 17, baseType: !51, size: 32, align: 32, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "co_code", scope: !444, file: !443, line: 18, baseType: !12, size: 64, align: 64, offset: 320)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !444, file: !443, line: 19, baseType: !12, size: 64, align: 64, offset: 384)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !444, file: !443, line: 20, baseType: !12, size: 64, align: 64, offset: 448)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "co_varnames", scope: !444, file: !443, line: 21, baseType: !12, size: 64, align: 64, offset: 512)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "co_freevars", scope: !444, file: !443, line: 22, baseType: !12, size: 64, align: 64, offset: 576)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "co_cellvars", scope: !444, file: !443, line: 23, baseType: !12, size: 64, align: 64, offset: 640)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "co_cell2arg", scope: !444, file: !443, line: 25, baseType: !459, size: 64, align: 64, offset: 704)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !444, file: !443, line: 26, baseType: !12, size: 64, align: 64, offset: 768)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !444, file: !443, line: 27, baseType: !12, size: 64, align: 64, offset: 832)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !444, file: !443, line: 28, baseType: !51, size: 32, align: 32, offset: 896)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "co_lnotab", scope: !444, file: !443, line: 29, baseType: !12, size: 64, align: 64, offset: 960)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "co_zombieframe", scope: !444, file: !443, line: 31, baseType: !11, size: 64, align: 64, offset: 1024)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !444, file: !443, line: 32, baseType: !12, size: 64, align: 64, offset: 1088)
!466 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!467 = !{!468, !491, !504, !512, !519, !533, !540, !550, !576, !581, !588, !596, !603, !627, !693, !707, !713, !720, !725, !730, !738, !758, !765, !807, !834, !1013, !1020, !1031, !1069, !1078, !1091, !1102, !1117, !1121, !1127}
!468 = !DISubprogram(name: "PyMarshal_WriteLongToFile", scope: !1, file: !1, line: 552, type: !469, isLocal: false, isDefinition: true, scopeLine: 553, flags: DIFlagPrototyped, isOptimized: true, function: void (i64, %struct._IO_FILE*, i32)* @PyMarshal_WriteLongToFile, variables: !471)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !24, !52, !51}
!471 = !{!472, !473, !474, !475}
!472 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !468, file: !1, line: 552, type: !24)
!473 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !468, file: !1, line: 552, type: !52)
!474 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "version", arg: 3, scope: !468, file: !1, line: 552, type: !51)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wf", scope: !468, file: !1, line: 554, type: !476)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "WFILE", file: !1, line: 79, baseType: !477)
!477 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 65, size: 704, align: 64, elements: !478)
!478 = !{!479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !477, file: !1, line: 66, baseType: !52, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !477, file: !1, line: 67, baseType: !51, size: 32, align: 32, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !477, file: !1, line: 68, baseType: !51, size: 32, align: 32, offset: 96)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "readable", scope: !477, file: !1, line: 70, baseType: !12, size: 64, align: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !477, file: !1, line: 71, baseType: !12, size: 64, align: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "current_filename", scope: !477, file: !1, line: 72, baseType: !12, size: 64, align: 64, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !477, file: !1, line: 73, baseType: !59, size: 64, align: 64, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !477, file: !1, line: 74, baseType: !59, size: 64, align: 64, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !477, file: !1, line: 75, baseType: !59, size: 64, align: 64, offset: 448)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !477, file: !1, line: 76, baseType: !18, size: 64, align: 64, offset: 512)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !477, file: !1, line: 77, baseType: !12, size: 64, align: 64, offset: 576)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !477, file: !1, line: 78, baseType: !51, size: 32, align: 32, offset: 640)
!491 = !DISubprogram(name: "PyMarshal_WriteObjectToFile", scope: !1, file: !1, line: 564, type: !492, isLocal: false, isDefinition: true, scopeLine: 565, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, %struct._IO_FILE*, i32)* @PyMarshal_WriteObjectToFile, variables: !494)
!492 = !DISubroutineType(types: !493)
!493 = !{null, !12, !52, !51}
!494 = !{!495, !496, !497, !498, !499, !501}
!495 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !491, file: !1, line: 564, type: !12)
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !491, file: !1, line: 564, type: !52)
!497 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "version", arg: 3, scope: !491, file: !1, line: 564, type: !51)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wf", scope: !491, file: !1, line: 566, type: !476)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !500, file: !1, line: 577, type: !12)
!500 = distinct !DILexicalBlock(scope: !491, file: !1, line: 577, column: 5)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !502, file: !1, line: 577, type: !12)
!502 = distinct !DILexicalBlock(scope: !503, file: !1, line: 577, column: 5)
!503 = distinct !DILexicalBlock(scope: !500, file: !1, line: 577, column: 5)
!504 = !DISubprogram(name: "PyMarshal_ReadShortFromFile", scope: !1, file: !1, line: 1388, type: !505, isLocal: false, isDefinition: true, scopeLine: 1389, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._IO_FILE*)* @PyMarshal_ReadShortFromFile, variables: !507)
!505 = !DISubroutineType(types: !506)
!506 = !{!51, !52}
!507 = !{!508, !509, !511}
!508 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !504, file: !1, line: 1388, type: !52)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rf", scope: !504, file: !1, line: 1390, type: !510)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "RFILE", file: !1, line: 580, baseType: !476)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !504, file: !1, line: 1391, type: !51)
!512 = !DISubprogram(name: "PyMarshal_ReadLongFromFile", scope: !1, file: !1, line: 1405, type: !513, isLocal: false, isDefinition: true, scopeLine: 1406, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._IO_FILE*)* @PyMarshal_ReadLongFromFile, variables: !515)
!513 = !DISubroutineType(types: !514)
!514 = !{!24, !52}
!515 = !{!516, !517, !518}
!516 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !512, file: !1, line: 1405, type: !52)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rf", scope: !512, file: !1, line: 1407, type: !510)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !512, file: !1, line: 1408, type: !24)
!519 = !DISubprogram(name: "PyMarshal_ReadLastObjectFromFile", scope: !1, file: !1, line: 1440, type: !520, isLocal: false, isDefinition: true, scopeLine: 1441, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._IO_FILE*)* @PyMarshal_ReadLastObjectFromFile, variables: !522)
!520 = !DISubroutineType(types: !521)
!521 = !{!12, !52}
!522 = !{!523, !524, !526, !529, !532}
!523 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !519, file: !1, line: 1440, type: !52)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filesize", scope: !519, file: !1, line: 1445, type: !525)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !21, line: 92, baseType: !95)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pBuf", scope: !527, file: !1, line: 1448, type: !59)
!527 = distinct !DILexicalBlock(scope: !528, file: !1, line: 1447, column: 60)
!528 = distinct !DILexicalBlock(scope: !519, file: !1, line: 1447, column: 9)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !530, file: !1, line: 1450, type: !101)
!530 = distinct !DILexicalBlock(scope: !531, file: !1, line: 1449, column: 27)
!531 = distinct !DILexicalBlock(scope: !527, file: !1, line: 1449, column: 13)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !530, file: !1, line: 1451, type: !12)
!533 = !DISubprogram(name: "PyMarshal_ReadObjectFromFile", scope: !1, file: !1, line: 1467, type: !520, isLocal: false, isDefinition: true, scopeLine: 1468, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._IO_FILE*)* @PyMarshal_ReadObjectFromFile, variables: !534)
!534 = !{!535, !536, !537, !538}
!535 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !533, file: !1, line: 1467, type: !52)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rf", scope: !533, file: !1, line: 1469, type: !510)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !533, file: !1, line: 1470, type: !12)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !539, file: !1, line: 1481, type: !12)
!539 = distinct !DILexicalBlock(scope: !533, file: !1, line: 1481, column: 5)
!540 = !DISubprogram(name: "PyMarshal_ReadObjectFromString", scope: !1, file: !1, line: 1488, type: !541, isLocal: false, isDefinition: true, scopeLine: 1489, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i64)* @PyMarshal_ReadObjectFromString, variables: !543)
!541 = !DISubroutineType(types: !542)
!542 = !{!12, !36, !18}
!543 = !{!544, !545, !546, !547, !548}
!544 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !540, file: !1, line: 1488, type: !36)
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !540, file: !1, line: 1488, type: !18)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rf", scope: !540, file: !1, line: 1490, type: !510)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !540, file: !1, line: 1491, type: !12)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !549, file: !1, line: 1503, type: !12)
!549 = distinct !DILexicalBlock(scope: !540, file: !1, line: 1503, column: 5)
!550 = !DISubprogram(name: "PyMarshal_WriteObjectToString", scope: !1, file: !1, line: 1510, type: !551, isLocal: false, isDefinition: true, scopeLine: 1511, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i32)* @PyMarshal_WriteObjectToString, variables: !553)
!551 = !DISubroutineType(types: !552)
!552 = !{!12, !12, !51}
!553 = !{!554, !555, !556, !557, !559, !562, !565, !569, !573}
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !550, file: !1, line: 1510, type: !12)
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "version", arg: 2, scope: !550, file: !1, line: 1510, type: !51)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wf", scope: !550, file: !1, line: 1512, type: !476)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !558, file: !1, line: 1530, type: !12)
!558 = distinct !DILexicalBlock(scope: !550, file: !1, line: 1530, column: 5)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !560, file: !1, line: 1530, type: !12)
!560 = distinct !DILexicalBlock(scope: !561, file: !1, line: 1530, column: 5)
!561 = distinct !DILexicalBlock(scope: !558, file: !1, line: 1530, column: 5)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !563, file: !1, line: 1532, type: !59)
!563 = distinct !DILexicalBlock(scope: !564, file: !1, line: 1531, column: 25)
!564 = distinct !DILexicalBlock(scope: !550, file: !1, line: 1531, column: 9)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !566, file: !1, line: 1534, type: !12)
!566 = distinct !DILexicalBlock(scope: !567, file: !1, line: 1534, column: 13)
!567 = distinct !DILexicalBlock(scope: !568, file: !1, line: 1533, column: 45)
!568 = distinct !DILexicalBlock(scope: !563, file: !1, line: 1533, column: 13)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !570, file: !1, line: 1543, type: !12)
!570 = distinct !DILexicalBlock(scope: !571, file: !1, line: 1543, column: 9)
!571 = distinct !DILexicalBlock(scope: !572, file: !1, line: 1542, column: 31)
!572 = distinct !DILexicalBlock(scope: !550, file: !1, line: 1542, column: 9)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !574, file: !1, line: 1543, type: !12)
!574 = distinct !DILexicalBlock(scope: !575, file: !1, line: 1543, column: 9)
!575 = distinct !DILexicalBlock(scope: !570, file: !1, line: 1543, column: 9)
!576 = !DISubprogram(name: "PyMarshal_Init", scope: !1, file: !1, line: 1752, type: !577, isLocal: false, isDefinition: true, scopeLine: 1753, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyMarshal_Init, variables: !579)
!577 = !DISubroutineType(types: !578)
!578 = !{!12}
!579 = !{!580}
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !576, file: !1, line: 1754, type: !12)
!581 = !DISubprogram(name: "w_long", scope: !1, file: !1, line: 129, type: !582, isLocal: true, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: true, function: void (i64, %struct.WFILE*)* @w_long, variables: !585)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !24, !584}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!585 = !{!586, !587}
!586 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !581, file: !1, line: 129, type: !24)
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !581, file: !1, line: 129, type: !584)
!588 = !DISubprogram(name: "w_more", scope: !1, file: !1, line: 86, type: !589, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, variables: !591)
!589 = !DISubroutineType(types: !590)
!590 = !{null, !38, !584}
!591 = !{!592, !593, !594, !595}
!592 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !588, file: !1, line: 86, type: !38)
!593 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !588, file: !1, line: 86, type: !584)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !588, file: !1, line: 88, type: !18)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newsize", scope: !588, file: !1, line: 88, type: !18)
!596 = !DISubprogram(name: "w_object", scope: !1, file: !1, line: 280, type: !597, isLocal: true, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, %struct.WFILE*)* @w_object, variables: !599)
!597 = !DISubroutineType(types: !598)
!598 = !{null, !12, !584}
!599 = !{!600, !601, !602}
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !596, file: !1, line: 280, type: !12)
!601 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !596, file: !1, line: 280, type: !584)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flag", scope: !596, file: !1, line: 282, type: !38)
!603 = !DISubprogram(name: "w_ref", scope: !1, file: !1, line: 226, type: !604, isLocal: true, isDefinition: true, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: true, variables: !606)
!604 = !DISubroutineType(types: !605)
!605 = !{!51, !12, !59, !584}
!606 = !{!607, !608, !609, !610, !611, !612, !615, !617, !619, !620, !622, !624}
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !603, file: !1, line: 226, type: !12)
!608 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flag", arg: 2, scope: !603, file: !1, line: 226, type: !59)
!609 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 3, scope: !603, file: !1, line: 226, type: !584)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "id", scope: !603, file: !1, line: 228, type: !12)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !603, file: !1, line: 229, type: !12)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !613, file: !1, line: 244, type: !24)
!613 = distinct !DILexicalBlock(scope: !614, file: !1, line: 242, column: 22)
!614 = distinct !DILexicalBlock(scope: !603, file: !1, line: 242, column: 9)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !616, file: !1, line: 245, type: !12)
!616 = distinct !DILexicalBlock(scope: !613, file: !1, line: 245, column: 9)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ok", scope: !618, file: !1, line: 255, type: !51)
!618 = distinct !DILexicalBlock(scope: !614, file: !1, line: 254, column: 12)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !618, file: !1, line: 256, type: !18)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !621, file: !1, line: 264, type: !12)
!621 = distinct !DILexicalBlock(scope: !618, file: !1, line: 264, column: 9)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !623, file: !1, line: 265, type: !12)
!623 = distinct !DILexicalBlock(scope: !618, file: !1, line: 265, column: 9)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !625, file: !1, line: 265, type: !12)
!625 = distinct !DILexicalBlock(scope: !626, file: !1, line: 265, column: 9)
!626 = distinct !DILexicalBlock(scope: !623, file: !1, line: 265, column: 9)
!627 = !DISubprogram(name: "w_complex_object", scope: !1, file: !1, line: 314, type: !628, isLocal: true, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true, variables: !630)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !12, !38, !584}
!630 = !{!631, !632, !633, !634, !635, !636, !639, !642, !644, !652, !654, !659, !661, !667, !669, !671, !676, !677, !678, !681, !682, !685, !687, !690}
!631 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !627, file: !1, line: 314, type: !12)
!632 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flag", arg: 2, scope: !627, file: !1, line: 314, type: !38)
!633 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 3, scope: !627, file: !1, line: 314, type: !584)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !627, file: !1, line: 316, type: !18)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !627, file: !1, line: 316, type: !18)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !637, file: !1, line: 319, type: !24)
!637 = distinct !DILexicalBlock(scope: !638, file: !1, line: 318, column: 31)
!638 = distinct !DILexicalBlock(scope: !627, file: !1, line: 318, column: 9)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ob", scope: !640, file: !1, line: 321, type: !358)
!640 = distinct !DILexicalBlock(scope: !641, file: !1, line: 320, column: 45)
!641 = distinct !DILexicalBlock(scope: !637, file: !1, line: 320, column: 13)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !643, file: !1, line: 327, type: !24)
!643 = distinct !DILexicalBlock(scope: !641, file: !1, line: 325, column: 14)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !645, file: !1, line: 342, type: !649)
!645 = distinct !DILexicalBlock(scope: !646, file: !1, line: 341, column: 29)
!646 = distinct !DILexicalBlock(scope: !647, file: !1, line: 341, column: 13)
!647 = distinct !DILexicalBlock(scope: !648, file: !1, line: 340, column: 37)
!648 = distinct !DILexicalBlock(scope: !638, file: !1, line: 340, column: 14)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 64, align: 8, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 8)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !653, file: !1, line: 352, type: !59)
!653 = distinct !DILexicalBlock(scope: !646, file: !1, line: 351, column: 14)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !655, file: !1, line: 367, type: !649)
!655 = distinct !DILexicalBlock(scope: !656, file: !1, line: 366, column: 29)
!656 = distinct !DILexicalBlock(scope: !657, file: !1, line: 366, column: 13)
!657 = distinct !DILexicalBlock(scope: !658, file: !1, line: 365, column: 39)
!658 = distinct !DILexicalBlock(scope: !648, file: !1, line: 365, column: 14)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !660, file: !1, line: 383, type: !59)
!660 = distinct !DILexicalBlock(scope: !656, file: !1, line: 382, column: 14)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "is_short", scope: !662, file: !1, line: 413, type: !51)
!662 = distinct !DILexicalBlock(scope: !663, file: !1, line: 412, column: 55)
!663 = distinct !DILexicalBlock(scope: !664, file: !1, line: 412, column: 13)
!664 = distinct !DILexicalBlock(scope: !665, file: !1, line: 411, column: 39)
!665 = distinct !DILexicalBlock(scope: !666, file: !1, line: 411, column: 14)
!666 = distinct !DILexicalBlock(scope: !658, file: !1, line: 407, column: 14)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "utf8", scope: !668, file: !1, line: 432, type: !12)
!668 = distinct !DILexicalBlock(scope: !663, file: !1, line: 431, column: 14)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !670, file: !1, line: 444, type: !12)
!670 = distinct !DILexicalBlock(scope: !668, file: !1, line: 444, column: 13)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !672, file: !1, line: 470, type: !18)
!672 = distinct !DILexicalBlock(scope: !673, file: !1, line: 469, column: 36)
!673 = distinct !DILexicalBlock(scope: !674, file: !1, line: 469, column: 14)
!674 = distinct !DILexicalBlock(scope: !675, file: !1, line: 461, column: 14)
!675 = distinct !DILexicalBlock(scope: !665, file: !1, line: 447, column: 14)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !672, file: !1, line: 471, type: !12)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !672, file: !1, line: 471, type: !12)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !679, file: !1, line: 482, type: !12)
!679 = distinct !DILexicalBlock(scope: !680, file: !1, line: 481, column: 38)
!680 = distinct !DILexicalBlock(scope: !673, file: !1, line: 481, column: 14)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !679, file: !1, line: 482, type: !12)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !683, file: !1, line: 503, type: !12)
!683 = distinct !DILexicalBlock(scope: !684, file: !1, line: 503, column: 13)
!684 = distinct !DILexicalBlock(scope: !679, file: !1, line: 501, column: 51)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !686, file: !1, line: 505, type: !12)
!686 = distinct !DILexicalBlock(scope: !679, file: !1, line: 505, column: 9)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "co", scope: !688, file: !1, line: 513, type: !441)
!688 = distinct !DILexicalBlock(scope: !689, file: !1, line: 512, column: 31)
!689 = distinct !DILexicalBlock(scope: !680, file: !1, line: 512, column: 14)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view", scope: !691, file: !1, line: 533, type: !243)
!691 = distinct !DILexicalBlock(scope: !692, file: !1, line: 531, column: 39)
!692 = distinct !DILexicalBlock(scope: !689, file: !1, line: 531, column: 14)
!693 = !DISubprogram(name: "w_PyLong", scope: !1, file: !1, line: 183, type: !694, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._longobject*, i8, %struct.WFILE*)* @w_PyLong, variables: !698)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !696, !38, !584}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !359)
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706}
!699 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ob", arg: 1, scope: !693, file: !1, line: 183, type: !696)
!700 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flag", arg: 2, scope: !693, file: !1, line: 183, type: !38)
!701 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 3, scope: !693, file: !1, line: 183, type: !584)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !693, file: !1, line: 185, type: !18)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !693, file: !1, line: 185, type: !18)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !693, file: !1, line: 185, type: !18)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !693, file: !1, line: 185, type: !18)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !693, file: !1, line: 186, type: !367)
!707 = !DISubprogram(name: "w_short", scope: !1, file: !1, line: 122, type: !708, isLocal: true, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true, variables: !710)
!708 = !DISubroutineType(types: !709)
!709 = !{null, !51, !584}
!710 = !{!711, !712}
!711 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !707, file: !1, line: 122, type: !51)
!712 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !707, file: !1, line: 122, type: !584)
!713 = !DISubprogram(name: "w_string", scope: !1, file: !1, line: 108, type: !714, isLocal: true, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: true, variables: !716)
!714 = !DISubroutineType(types: !715)
!715 = !{null, !36, !18, !584}
!716 = !{!717, !718, !719}
!717 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !713, file: !1, line: 108, type: !36)
!718 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !713, file: !1, line: 108, type: !18)
!719 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 3, scope: !713, file: !1, line: 108, type: !584)
!720 = !DISubprogram(name: "w_pstring", scope: !1, file: !1, line: 153, type: !714, isLocal: true, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true, variables: !721)
!721 = !{!722, !723, !724}
!722 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !720, file: !1, line: 153, type: !36)
!723 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !720, file: !1, line: 153, type: !18)
!724 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 3, scope: !720, file: !1, line: 153, type: !584)
!725 = !DISubprogram(name: "w_short_pstring", scope: !1, file: !1, line: 160, type: !714, isLocal: true, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: true, variables: !726)
!726 = !{!727, !728, !729}
!727 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !725, file: !1, line: 160, type: !36)
!728 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !725, file: !1, line: 160, type: !18)
!729 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 3, scope: !725, file: !1, line: 160, type: !584)
!730 = !DISubprogram(name: "r_short", scope: !1, file: !1, line: 676, type: !731, isLocal: true, isDefinition: true, scopeLine: 677, flags: DIFlagPrototyped, isOptimized: true, variables: !734)
!731 = !DISubroutineType(types: !732)
!732 = !{!51, !733}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!734 = !{!735, !736, !737}
!735 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !730, file: !1, line: 676, type: !733)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !730, file: !1, line: 678, type: !466)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !730, file: !1, line: 679, type: !459)
!738 = !DISubprogram(name: "r_string", scope: !1, file: !1, line: 583, type: !739, isLocal: true, isDefinition: true, scopeLine: 584, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i64, %struct.WFILE*)* @r_string, variables: !741)
!739 = !DISubroutineType(types: !740)
!740 = !{!59, !18, !733}
!741 = !{!742, !743, !744, !745, !748, !749, !752, !753, !754}
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !738, file: !1, line: 583, type: !18)
!743 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !738, file: !1, line: 583, type: !733)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "read", scope: !738, file: !1, line: 585, type: !18)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !746, file: !1, line: 589, type: !59)
!746 = distinct !DILexicalBlock(scope: !747, file: !1, line: 587, column: 25)
!747 = distinct !DILexicalBlock(scope: !738, file: !1, line: 587, column: 9)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left", scope: !746, file: !1, line: 590, type: !18)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !750, file: !1, line: 622, type: !12)
!750 = distinct !DILexicalBlock(scope: !751, file: !1, line: 620, column: 10)
!751 = distinct !DILexicalBlock(scope: !738, file: !1, line: 616, column: 9)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mview", scope: !750, file: !1, line: 622, type: !12)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !750, file: !1, line: 623, type: !243)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !755, file: !1, line: 634, type: !12)
!755 = distinct !DILexicalBlock(scope: !756, file: !1, line: 634, column: 13)
!756 = distinct !DILexicalBlock(scope: !757, file: !1, line: 632, column: 26)
!757 = distinct !DILexicalBlock(scope: !750, file: !1, line: 632, column: 13)
!758 = !DISubprogram(name: "r_long", scope: !1, file: !1, line: 692, type: !759, isLocal: true, isDefinition: true, scopeLine: 693, flags: DIFlagPrototyped, isOptimized: true, variables: !761)
!759 = !DISubroutineType(types: !760)
!760 = !{!24, !733}
!761 = !{!762, !763, !764}
!762 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !758, file: !1, line: 692, type: !733)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !758, file: !1, line: 694, type: !24)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !758, file: !1, line: 695, type: !459)
!765 = !DISubprogram(name: "getfilesize", scope: !1, file: !1, line: 1423, type: !766, isLocal: true, isDefinition: true, scopeLine: 1424, flags: DIFlagPrototyped, isOptimized: true, variables: !768)
!766 = !DISubroutineType(types: !767)
!767 = !{!525, !52}
!768 = !{!769, !770}
!769 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !765, file: !1, line: 1423, type: !52)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !765, file: !1, line: 1425, type: !771)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !772, line: 46, size: 1152, align: 64, elements: !773)
!772 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!773 = !{!774, !776, !778, !780, !782, !784, !786, !787, !788, !789, !791, !793, !801, !802, !803}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !771, file: !772, line: 48, baseType: !775, size: 64, align: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !23, line: 133, baseType: !103)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !771, file: !772, line: 53, baseType: !777, size: 64, align: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !23, line: 136, baseType: !103)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !771, file: !772, line: 61, baseType: !779, size: 64, align: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !23, line: 139, baseType: !103)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !771, file: !772, line: 62, baseType: !781, size: 32, align: 32, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !23, line: 138, baseType: !348)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !771, file: !772, line: 64, baseType: !783, size: 32, align: 32, offset: 224)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !23, line: 134, baseType: !348)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !771, file: !772, line: 65, baseType: !785, size: 32, align: 32, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !23, line: 135, baseType: !348)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !771, file: !772, line: 67, baseType: !51, size: 32, align: 32, offset: 288)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !771, file: !772, line: 69, baseType: !775, size: 64, align: 64, offset: 320)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !771, file: !772, line: 74, baseType: !82, size: 64, align: 64, offset: 384)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !771, file: !772, line: 78, baseType: !790, size: 64, align: 64, offset: 448)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !23, line: 162, baseType: !24)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !771, file: !772, line: 80, baseType: !792, size: 64, align: 64, offset: 512)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !23, line: 167, baseType: !24)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !771, file: !772, line: 91, baseType: !794, size: 128, align: 64, offset: 576)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !795, line: 120, size: 128, align: 64, elements: !796)
!795 = !DIFile(filename: "/usr/include/time.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!796 = !{!797, !799}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !794, file: !795, line: 122, baseType: !798, size: 64, align: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !23, line: 148, baseType: !24)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !794, file: !795, line: 123, baseType: !800, size: 64, align: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !23, line: 184, baseType: !24)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !771, file: !772, line: 92, baseType: !794, size: 128, align: 64, offset: 704)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !771, file: !772, line: 93, baseType: !794, size: 128, align: 64, offset: 832)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !771, file: !772, line: 106, baseType: !804, size: 192, align: 64, offset: 960)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 192, align: 64, elements: !805)
!805 = !{!806}
!806 = !DISubrange(count: 3)
!807 = !DISubprogram(name: "fstat64", scope: !808, file: !808, line: 517, type: !809, isLocal: false, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: true, variables: !831)
!808 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!809 = !DISubroutineType(types: !810)
!810 = !{!51, !51, !811}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64, align: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !772, line: 119, size: 1152, align: 64, elements: !813)
!813 = !{!814, !815, !817, !818, !819, !820, !821, !822, !823, !824, !825, !827, !828, !829, !830}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !812, file: !772, line: 121, baseType: !775, size: 64, align: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !812, file: !772, line: 123, baseType: !816, size: 64, align: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !23, line: 137, baseType: !103)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !812, file: !772, line: 124, baseType: !779, size: 64, align: 64, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !812, file: !772, line: 125, baseType: !781, size: 32, align: 32, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !812, file: !772, line: 132, baseType: !783, size: 32, align: 32, offset: 224)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !812, file: !772, line: 133, baseType: !785, size: 32, align: 32, offset: 256)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !812, file: !772, line: 135, baseType: !51, size: 32, align: 32, offset: 288)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !812, file: !772, line: 136, baseType: !775, size: 64, align: 64, offset: 320)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !812, file: !772, line: 137, baseType: !82, size: 64, align: 64, offset: 384)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !812, file: !772, line: 143, baseType: !790, size: 64, align: 64, offset: 448)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !812, file: !772, line: 144, baseType: !826, size: 64, align: 64, offset: 512)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !23, line: 168, baseType: !24)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !812, file: !772, line: 152, baseType: !794, size: 128, align: 64, offset: 576)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !812, file: !772, line: 153, baseType: !794, size: 128, align: 64, offset: 704)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !812, file: !772, line: 154, baseType: !794, size: 128, align: 64, offset: 832)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !812, file: !772, line: 164, baseType: !804, size: 192, align: 64, offset: 960)
!831 = !{!832, !833}
!832 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__fd", arg: 1, scope: !807, file: !808, line: 517, type: !51)
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__statbuf", arg: 2, scope: !807, file: !808, line: 517, type: !811)
!834 = !DISubprogram(name: "r_object", scope: !1, file: !1, line: 841, type: !835, isLocal: true, isDefinition: true, scopeLine: 842, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.WFILE*)* @r_object, variables: !837)
!835 = !DISubroutineType(types: !836)
!836 = !{!12, !733}
!837 = !{!838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !855, !856, !857, !859, !860, !862, !863, !870, !872, !873, !875, !879, !881, !883, !890, !897, !901, !902, !906, !910, !912, !914, !916, !920, !925, !929, !936, !940, !942, !944, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !968, !970, !973, !975, !978, !980, !983, !985, !988, !990, !993, !995, !998, !1000, !1003, !1005, !1008, !1010}
!838 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !834, file: !1, line: 841, type: !733)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !834, file: !1, line: 845, type: !12)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v2", scope: !834, file: !1, line: 845, type: !12)
!841 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !834, file: !1, line: 846, type: !18)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !834, file: !1, line: 847, type: !24)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !834, file: !1, line: 847, type: !24)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !834, file: !1, line: 848, type: !51)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !834, file: !1, line: 848, type: !51)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flag", scope: !834, file: !1, line: 849, type: !51)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "is_interned", scope: !834, file: !1, line: 849, type: !51)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !834, file: !1, line: 850, type: !12)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !850, file: !1, line: 917, type: !852)
!850 = distinct !DILexicalBlock(scope: !851, file: !1, line: 916, column: 9)
!851 = distinct !DILexicalBlock(scope: !834, file: !1, line: 874, column: 19)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 2048, align: 8, elements: !853)
!853 = !{!854}
!854 = !DISubrange(count: 256)
!855 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !850, file: !1, line: 917, type: !59)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !850, file: !1, line: 918, type: !377)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !858, file: !1, line: 940, type: !459)
!858 = distinct !DILexicalBlock(scope: !851, file: !1, line: 939, column: 9)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !858, file: !1, line: 941, type: !377)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !861, file: !1, line: 955, type: !852)
!861 = distinct !DILexicalBlock(scope: !851, file: !1, line: 954, column: 9)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !861, file: !1, line: 955, type: !59)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !861, file: !1, line: 956, type: !864)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_complex", file: !865, line: 13, baseType: !866)
!865 = !DIFile(filename: "Include/complexobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!866 = !DICompositeType(tag: DW_TAG_structure_type, file: !865, line: 10, size: 128, align: 64, elements: !867)
!867 = !{!868, !869}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !866, file: !865, line: 11, baseType: !377, size: 64, align: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !866, file: !865, line: 12, baseType: !377, size: 64, align: 64, offset: 64)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !871, file: !1, line: 992, type: !459)
!871 = distinct !DILexicalBlock(scope: !851, file: !1, line: 991, column: 9)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !871, file: !1, line: 993, type: !864)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !874, file: !1, line: 1013, type: !59)
!874 = distinct !DILexicalBlock(scope: !851, file: !1, line: 1012, column: 9)
!875 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !876, file: !1, line: 1026, type: !12)
!876 = distinct !DILexicalBlock(scope: !877, file: !1, line: 1026, column: 17)
!877 = distinct !DILexicalBlock(scope: !878, file: !1, line: 1025, column: 30)
!878 = distinct !DILexicalBlock(scope: !874, file: !1, line: 1025, column: 17)
!879 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !880, file: !1, line: 1058, type: !59)
!880 = distinct !DILexicalBlock(scope: !851, file: !1, line: 1057, column: 9)
!881 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !882, file: !1, line: 1076, type: !59)
!882 = distinct !DILexicalBlock(scope: !851, file: !1, line: 1075, column: 9)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !884, file: !1, line: 1128, type: !12)
!884 = distinct !DILexicalBlock(scope: !885, file: !1, line: 1128, column: 17)
!885 = distinct !DILexicalBlock(scope: !886, file: !1, line: 1124, column: 31)
!886 = distinct !DILexicalBlock(scope: !887, file: !1, line: 1124, column: 18)
!887 = distinct !DILexicalBlock(scope: !888, file: !1, line: 1122, column: 33)
!888 = distinct !DILexicalBlock(scope: !889, file: !1, line: 1122, column: 9)
!889 = distinct !DILexicalBlock(scope: !851, file: !1, line: 1122, column: 9)
!890 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !891, file: !1, line: 1155, type: !12)
!891 = distinct !DILexicalBlock(scope: !892, file: !1, line: 1155, column: 17)
!892 = distinct !DILexicalBlock(scope: !893, file: !1, line: 1151, column: 31)
!893 = distinct !DILexicalBlock(scope: !894, file: !1, line: 1151, column: 18)
!894 = distinct !DILexicalBlock(scope: !895, file: !1, line: 1149, column: 33)
!895 = distinct !DILexicalBlock(scope: !896, file: !1, line: 1149, column: 9)
!896 = distinct !DILexicalBlock(scope: !851, file: !1, line: 1149, column: 9)
!897 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !898, file: !1, line: 1170, type: !12)
!898 = distinct !DILexicalBlock(scope: !899, file: !1, line: 1169, column: 18)
!899 = distinct !DILexicalBlock(scope: !900, file: !1, line: 1169, column: 9)
!900 = distinct !DILexicalBlock(scope: !851, file: !1, line: 1169, column: 9)
!901 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !898, file: !1, line: 1170, type: !12)
!902 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !903, file: !1, line: 1176, type: !12)
!903 = distinct !DILexicalBlock(scope: !904, file: !1, line: 1176, column: 17)
!904 = distinct !DILexicalBlock(scope: !905, file: !1, line: 1175, column: 30)
!905 = distinct !DILexicalBlock(scope: !898, file: !1, line: 1175, column: 17)
!906 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !907, file: !1, line: 1180, type: !12)
!907 = distinct !DILexicalBlock(scope: !908, file: !1, line: 1180, column: 17)
!908 = distinct !DILexicalBlock(scope: !909, file: !1, line: 1179, column: 50)
!909 = distinct !DILexicalBlock(scope: !898, file: !1, line: 1179, column: 17)
!910 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !911, file: !1, line: 1181, type: !12)
!911 = distinct !DILexicalBlock(scope: !908, file: !1, line: 1181, column: 17)
!912 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !913, file: !1, line: 1184, type: !12)
!913 = distinct !DILexicalBlock(scope: !898, file: !1, line: 1184, column: 13)
!914 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !915, file: !1, line: 1185, type: !12)
!915 = distinct !DILexicalBlock(scope: !898, file: !1, line: 1185, column: 13)
!916 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !917, file: !1, line: 1188, type: !12)
!917 = distinct !DILexicalBlock(scope: !918, file: !1, line: 1188, column: 13)
!918 = distinct !DILexicalBlock(scope: !919, file: !1, line: 1187, column: 31)
!919 = distinct !DILexicalBlock(scope: !851, file: !1, line: 1187, column: 13)
!920 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !921, file: !1, line: 1212, type: !12)
!921 = distinct !DILexicalBlock(scope: !922, file: !1, line: 1212, column: 17)
!922 = distinct !DILexicalBlock(scope: !923, file: !1, line: 1211, column: 17)
!923 = distinct !DILexicalBlock(scope: !924, file: !1, line: 1206, column: 16)
!924 = distinct !DILexicalBlock(scope: !851, file: !1, line: 1204, column: 13)
!925 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !926, file: !1, line: 1212, type: !12)
!926 = distinct !DILexicalBlock(scope: !927, file: !1, line: 1212, column: 17)
!927 = distinct !DILexicalBlock(scope: !928, file: !1, line: 1212, column: 17)
!928 = distinct !DILexicalBlock(scope: !921, file: !1, line: 1212, column: 17)
!929 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !930, file: !1, line: 1223, type: !12)
!930 = distinct !DILexicalBlock(scope: !931, file: !1, line: 1223, column: 17)
!931 = distinct !DILexicalBlock(scope: !932, file: !1, line: 1219, column: 31)
!932 = distinct !DILexicalBlock(scope: !933, file: !1, line: 1219, column: 18)
!933 = distinct !DILexicalBlock(scope: !934, file: !1, line: 1217, column: 33)
!934 = distinct !DILexicalBlock(scope: !935, file: !1, line: 1217, column: 9)
!935 = distinct !DILexicalBlock(scope: !851, file: !1, line: 1217, column: 9)
!936 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !937, file: !1, line: 1228, type: !12)
!937 = distinct !DILexicalBlock(scope: !938, file: !1, line: 1228, column: 17)
!938 = distinct !DILexicalBlock(scope: !939, file: !1, line: 1227, column: 41)
!939 = distinct !DILexicalBlock(scope: !933, file: !1, line: 1227, column: 17)
!940 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !941, file: !1, line: 1229, type: !12)
!941 = distinct !DILexicalBlock(scope: !938, file: !1, line: 1229, column: 17)
!942 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !943, file: !1, line: 1233, type: !12)
!943 = distinct !DILexicalBlock(scope: !933, file: !1, line: 1233, column: 13)
!944 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "argcount", scope: !945, file: !1, line: 1242, type: !51)
!945 = distinct !DILexicalBlock(scope: !851, file: !1, line: 1241, column: 9)
!946 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kwonlyargcount", scope: !945, file: !1, line: 1243, type: !51)
!947 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nlocals", scope: !945, file: !1, line: 1244, type: !51)
