; ModuleID = 'memoryobject.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !418, globals: !1443)
!1 = !DIFile(filename: "Objects/memoryobject.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !343, !350, !52, !369, !94, !383, !384, !386, !387, !388, !79, !396, !44, !17, !96, !385, !77, !341, !397, !398, !11, !399, !382, !400, !401, !409}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !7, line: 109, baseType: !8)
!7 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !7, line: 105, size: 128, align: 64, elements: !9)
!9 = !{!10, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !8, file: !7, line: 107, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !12, line: 177, baseType: !13)
!12 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !14, line: 102, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !16, line: 181, baseType: !17)
!16 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !8, file: !7, line: 108, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !7, line: 334, size: 3200, align: 64, elements: !21)
!21 = !{!22, !28, !32, !33, !34, !39, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !291, !309, !310, !311, !313, !315, !316, !318, !323, !328, !333, !334, !335, !336, !337, !338, !339, !340, !342}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !20, file: !7, line: 335, baseType: !23, size: 192, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !7, line: 114, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 111, size: 192, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !24, file: !7, line: 112, baseType: !6, size: 128, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !24, file: !7, line: 113, baseType: !11, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !20, file: !7, line: 336, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !20, file: !7, line: 341, baseType: !35, size: 64, align: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !7, line: 308, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !5}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !20, file: !7, line: 342, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !7, line: 314, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !5, !45, !44}
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !14, line: 48, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 246, size: 1728, align: 64, elements: !49)
!48 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!49 = !{!50, !51, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !71, !72, !73, !74, !76, !78, !80, !84, !87, !89, !90, !91, !92, !93, !97, !98}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !48, line: 247, baseType: !44, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !47, file: !48, line: 252, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !47, file: !48, line: 253, baseType: !52, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !47, file: !48, line: 254, baseType: !52, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !47, file: !48, line: 255, baseType: !52, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !47, file: !48, line: 256, baseType: !52, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !47, file: !48, line: 257, baseType: !52, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !47, file: !48, line: 258, baseType: !52, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !47, file: !48, line: 259, baseType: !52, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !47, file: !48, line: 261, baseType: !52, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !47, file: !48, line: 262, baseType: !52, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !47, file: !48, line: 263, baseType: !52, size: 64, align: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !47, file: !48, line: 265, baseType: !64, size: 64, align: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !48, line: 161, size: 192, align: 64, elements: !66)
!66 = !{!67, !68, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !65, file: !48, line: 162, baseType: !64, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !65, file: !48, line: 163, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !65, file: !48, line: 167, baseType: !44, size: 32, align: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !47, file: !48, line: 267, baseType: !69, size: 64, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !47, file: !48, line: 269, baseType: !44, size: 32, align: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !47, file: !48, line: 273, baseType: !44, size: 32, align: 32, offset: 928)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !47, file: !48, line: 275, baseType: !75, size: 64, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !16, line: 140, baseType: !17)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !47, file: !48, line: 279, baseType: !77, size: 16, align: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !47, file: !48, line: 280, baseType: !79, size: 8, align: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !47, file: !48, line: 281, baseType: !81, size: 8, align: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !47, file: !48, line: 285, baseType: !85, size: 64, align: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !48, line: 155, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !47, file: !48, line: 294, baseType: !88, size: 64, align: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !16, line: 141, baseType: !17)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !47, file: !48, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !47, file: !48, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !47, file: !48, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !47, file: !48, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !47, file: !48, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !47, file: !48, line: 309, baseType: !44, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !47, file: !48, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !20, file: !7, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !7, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!5, !5, !52}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !20, file: !7, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !7, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!44, !5, !52, !5}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !20, file: !7, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !20, file: !7, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !7, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!5, !5}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !20, file: !7, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !7, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !7, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !7, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!5, !5, !5}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !7, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !7, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !7, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !7, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !7, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !7, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!5, !5, !5, !5}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !7, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !7, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !7, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !7, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !7, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !7, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!44, !5}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !7, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !7, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !7, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !7, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !7, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !7, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !7, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !7, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !7, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !7, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !7, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !7, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !7, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !7, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !7, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !7, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !7, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !7, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !7, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !7, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !7, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !7, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !7, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !7, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !20, file: !7, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !7, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !7, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !7, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!11, !5}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !7, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !7, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !7, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!5, !5, !11}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !7, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !7, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !7, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !7, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!44, !5, !11, !5}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !7, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !7, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !7, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!44, !5, !5}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !7, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !7, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !20, file: !7, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !7, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !7, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !7, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !7, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !7, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!44, !5, !5, !5}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !20, file: !7, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !7, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !5}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !12, line: 186, baseType: !11)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !20, file: !7, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !20, file: !7, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !20, file: !7, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !7, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !20, file: !7, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !7, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !20, file: !7, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !7, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !7, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !7, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!44, !5, !235, !44}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !7, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !7, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !7, line: 179, baseType: !4, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !7, line: 180, baseType: !5, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !7, line: 181, baseType: !11, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !7, line: 182, baseType: !11, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !7, line: 184, baseType: !44, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !7, line: 185, baseType: !44, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !7, line: 186, baseType: !52, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !7, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !7, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !7, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !7, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !7, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !7, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !5, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !20, file: !7, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !20, file: !7, line: 368, baseType: !29, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !20, file: !7, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !7, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!44, !5, !263, !4}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !7, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!44, !5, !4}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !20, file: !7, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !20, file: !7, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !7, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!5, !5, !5, !44}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !20, file: !7, line: 382, baseType: !11, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !20, file: !7, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !7, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !20, file: !7, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !7, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !20, file: !7, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !29, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !44, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !29, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !20, file: !7, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !7, line: 390, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !20, file: !7, line: 391, baseType: !292, size: 64, align: 64, offset: 1984)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !294, line: 11, size: 320, align: 64, elements: !295)
!294 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!295 = !{!296, !297, !302, !307, !308}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !293, file: !294, line: 12, baseType: !52, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !293, file: !294, line: 13, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !294, line: 8, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!5, !5, !4}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !293, file: !294, line: 14, baseType: !303, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !294, line: 9, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!44, !5, !5, !4}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !293, file: !294, line: 15, baseType: !52, size: 64, align: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !293, file: !294, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !20, file: !7, line: 392, baseType: !19, size: 64, align: 64, offset: 2048)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !20, file: !7, line: 393, baseType: !5, size: 64, align: 64, offset: 2112)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !20, file: !7, line: 394, baseType: !312, size: 64, align: 64, offset: 2176)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !7, line: 325, baseType: !134)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !20, file: !7, line: 395, baseType: !314, size: 64, align: 64, offset: 2240)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !7, line: 326, baseType: !210)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !20, file: !7, line: 396, baseType: !11, size: 64, align: 64, offset: 2304)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !20, file: !7, line: 397, baseType: !317, size: 64, align: 64, offset: 2368)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !7, line: 327, baseType: !210)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !20, file: !7, line: 398, baseType: !319, size: 64, align: 64, offset: 2432)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !7, line: 329, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!5, !19, !11}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !20, file: !7, line: 399, baseType: !324, size: 64, align: 64, offset: 2496)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !7, line: 328, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!5, !19, !5, !5}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !20, file: !7, line: 400, baseType: !329, size: 64, align: 64, offset: 2560)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !7, line: 307, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !4}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !20, file: !7, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !20, file: !7, line: 402, baseType: !5, size: 64, align: 64, offset: 2688)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !20, file: !7, line: 403, baseType: !5, size: 64, align: 64, offset: 2752)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !20, file: !7, line: 404, baseType: !5, size: 64, align: 64, offset: 2816)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !20, file: !7, line: 405, baseType: !5, size: 64, align: 64, offset: 2880)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !20, file: !7, line: 406, baseType: !5, size: 64, align: 64, offset: 2944)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !20, file: !7, line: 407, baseType: !35, size: 64, align: 64, offset: 3008)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !20, file: !7, line: 410, baseType: !341, size: 32, align: 32, offset: 3072)
!341 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !20, file: !7, line: 412, baseType: !35, size: 64, align: 64, offset: 3136)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemoryViewObject", file: !345, line: 68, baseType: !346)
!345 = !DIFile(filename: "Include/memoryobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!346 = !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 58, size: 1280, align: 64, elements: !347)
!347 = !{!348, !349, !358, !359, !360, !361, !362, !366, !367}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !346, file: !345, line: 59, baseType: !23, size: 192, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "mbuf", scope: !346, file: !345, line: 60, baseType: !350, size: 64, align: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyManagedBufferObject", file: !345, line: 45, baseType: !352)
!352 = !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 40, size: 896, align: 64, elements: !353)
!353 = !{!354, !355, !356, !357}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !352, file: !345, line: 41, baseType: !6, size: 128, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !352, file: !345, line: 42, baseType: !44, size: 32, align: 32, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "exports", scope: !352, file: !345, line: 43, baseType: !11, size: 64, align: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !352, file: !345, line: 44, baseType: !236, size: 640, align: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !346, file: !345, line: 61, baseType: !218, size: 64, align: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !346, file: !345, line: 62, baseType: !44, size: 32, align: 32, offset: 320)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "exports", scope: !346, file: !345, line: 63, baseType: !11, size: 64, align: 64, offset: 384)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !346, file: !345, line: 64, baseType: !236, size: 640, align: 64, offset: 448)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !346, file: !345, line: 65, baseType: !363, size: 24, align: 8, offset: 1088)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 24, align: 8, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 3)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !346, file: !345, line: 66, baseType: !5, size: 64, align: 64, offset: 1152)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ob_array", scope: !346, file: !345, line: 67, baseType: !368, size: 64, align: 64, offset: 1216)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 64, align: 64, elements: !82)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !371, line: 253, baseType: !372)
!371 = !DIFile(filename: "Include/objimpl.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!372 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !371, line: 246, size: 192, align: 64, elements: !373)
!373 = !{!374, !381}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !372, file: !371, line: 251, baseType: !375, size: 192, align: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, scope: !372, file: !371, line: 247, size: 192, align: 64, elements: !376)
!376 = !{!377, !379, !380}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !375, file: !371, line: 248, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !375, file: !371, line: 249, baseType: !378, size: 64, align: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !375, file: !371, line: 250, baseType: !11, size: 64, align: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !372, file: !371, line: 252, baseType: !382, size: 64, align: 64)
!382 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !390, line: 33, baseType: !391)
!390 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!391 = !DICompositeType(tag: DW_TAG_structure_type, file: !390, line: 25, size: 256, align: 64, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !391, file: !390, line: 26, baseType: !23, size: 192, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !391, file: !390, line: 27, baseType: !395, size: 64, align: 64, offset: 192)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, align: 64, elements: !82)
!396 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!397 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!398 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!399 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!400 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !403, line: 41, baseType: !404)
!403 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!404 = !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 31, size: 320, align: 64, elements: !405)
!405 = !{!406, !407, !408}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !404, file: !403, line: 32, baseType: !23, size: 192, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !404, file: !403, line: 33, baseType: !218, size: 64, align: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !404, file: !403, line: 34, baseType: !81, size: 8, align: 8, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !411, line: 40, baseType: !412)
!411 = !DIFile(filename: "Include/listobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!412 = !DICompositeType(tag: DW_TAG_structure_type, file: !411, line: 23, size: 320, align: 64, elements: !413)
!413 = !{!414, !415, !417}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !412, file: !411, line: 24, baseType: !23, size: 192, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !412, file: !411, line: 26, baseType: !416, size: 64, align: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !412, file: !411, line: 39, baseType: !11, size: 64, align: 64, offset: 256)
!418 = !{!419, !431, !440, !452, !472, !488, !493, !498, !509, !514, !521, !531, !539, !546, !554, !577, !586, !595, !601, !605, !612, !618, !628, !633, !637, !659, !686, !692, !697, !702, !712, !723, !728, !733, !738, !749, !755, !763, !807, !829, !843, !848, !857, !877, !926, !935, !944, !953, !962, !969, !978, !983, !986, !989, !994, !1005, !1012, !1021, !1027, !1038, !1047, !1070, !1098, !1103, !1106, !1159, !1178, !1190, !1211, !1233, !1250, !1254, !1264, !1270, !1290, !1311, !1324, !1329, !1343, !1354, !1369, !1373, !1377, !1381, !1384, !1387, !1390, !1393, !1396, !1399, !1415, !1418, !1421, !1425, !1429, !1433}
!419 = !DISubprogram(name: "PyMemoryView_FromMemory", scope: !1, file: !1, line: 719, type: !420, isLocal: false, isDefinition: true, scopeLine: 720, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i64, i32)* @PyMemoryView_FromMemory, variables: !422)
!420 = !DISubroutineType(types: !421)
!421 = !{!5, !52, !11, !44}
!422 = !{!423, !424, !425, !426, !427, !428, !429}
!423 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mem", arg: 1, scope: !419, file: !1, line: 719, type: !52)
!424 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !419, file: !1, line: 719, type: !11)
!425 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 3, scope: !419, file: !1, line: 719, type: !44)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mbuf", scope: !419, file: !1, line: 721, type: !350)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv", scope: !419, file: !1, line: 722, type: !5)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "readonly", scope: !419, file: !1, line: 723, type: !44)
!429 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !430, file: !1, line: 737, type: !5)
!430 = distinct !DILexicalBlock(scope: !419, file: !1, line: 737, column: 5)
!431 = !DISubprogram(name: "PyMemoryView_FromBuffer", scope: !1, file: !1, line: 748, type: !432, isLocal: false, isDefinition: true, scopeLine: 749, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.bufferinfo*)* @PyMemoryView_FromBuffer, variables: !434)
!432 = !DISubroutineType(types: !433)
!433 = !{!5, !235}
!434 = !{!435, !436, !437, !438}
!435 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "info", arg: 1, scope: !431, file: !1, line: 748, type: !235)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mbuf", scope: !431, file: !1, line: 750, type: !350)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv", scope: !431, file: !1, line: 751, type: !5)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !439, file: !1, line: 769, type: !5)
!439 = distinct !DILexicalBlock(scope: !431, file: !1, line: 769, column: 5)
!440 = !DISubprogram(name: "PyMemoryView_FromObject", scope: !1, file: !1, line: 778, type: !116, isLocal: false, isDefinition: true, scopeLine: 779, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyMemoryView_FromObject, variables: !441)
!441 = !{!442, !443, !444, !447, !450}
!442 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !440, file: !1, line: 778, type: !5)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mbuf", scope: !440, file: !1, line: 780, type: !350)
!444 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv", scope: !445, file: !1, line: 783, type: !343)
!445 = distinct !DILexicalBlock(scope: !446, file: !1, line: 782, column: 32)
!446 = distinct !DILexicalBlock(scope: !440, file: !1, line: 782, column: 9)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !448, file: !1, line: 788, type: !5)
!448 = distinct !DILexicalBlock(scope: !449, file: !1, line: 787, column: 39)
!449 = distinct !DILexicalBlock(scope: !446, file: !1, line: 787, column: 14)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !451, file: !1, line: 793, type: !5)
!451 = distinct !DILexicalBlock(scope: !448, file: !1, line: 793, column: 9)
!452 = !DISubprogram(name: "PyMemoryView_GetContiguous", scope: !1, file: !1, line: 910, type: !453, isLocal: false, isDefinition: true, scopeLine: 911, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i32, i8)* @PyMemoryView_GetContiguous, variables: !455)
!453 = !DISubroutineType(types: !454)
!454 = !{!5, !5, !44, !31}
!455 = !{!456, !457, !458, !459, !460, !461, !462, !466, !470}
!456 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !452, file: !1, line: 910, type: !5)
!457 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buffertype", arg: 2, scope: !452, file: !1, line: 910, type: !44)
!458 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 3, scope: !452, file: !1, line: 910, type: !31)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv", scope: !452, file: !1, line: 912, type: !343)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !452, file: !1, line: 913, type: !5)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view", scope: !452, file: !1, line: 914, type: !235)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !463, file: !1, line: 927, type: !5)
!463 = distinct !DILexicalBlock(scope: !464, file: !1, line: 927, column: 9)
!464 = distinct !DILexicalBlock(scope: !465, file: !1, line: 924, column: 54)
!465 = distinct !DILexicalBlock(scope: !452, file: !1, line: 924, column: 9)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !467, file: !1, line: 938, type: !5)
!467 = distinct !DILexicalBlock(scope: !468, file: !1, line: 938, column: 9)
!468 = distinct !DILexicalBlock(scope: !469, file: !1, line: 934, column: 36)
!469 = distinct !DILexicalBlock(scope: !452, file: !1, line: 934, column: 9)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !471, file: !1, line: 943, type: !5)
!471 = distinct !DILexicalBlock(scope: !452, file: !1, line: 943, column: 5)
!472 = !DISubprogram(name: "PyBuffer_ToContiguous", scope: !1, file: !1, line: 973, type: !473, isLocal: false, isDefinition: true, scopeLine: 974, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct.bufferinfo*, i64, i8)* @PyBuffer_ToContiguous, variables: !475)
!473 = !DISubroutineType(types: !474)
!474 = !{!44, !4, !235, !11, !31}
!475 = !{!476, !477, !478, !479, !480, !487}
!476 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 1, scope: !472, file: !1, line: 973, type: !4)
!477 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !472, file: !1, line: 973, type: !235)
!478 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 3, scope: !472, file: !1, line: 973, type: !11)
!479 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 4, scope: !472, file: !1, line: 973, type: !31)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fb", scope: !472, file: !1, line: 975, type: !481)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer_full", file: !1, line: 970, baseType: !483)
!483 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 967, size: 704, align: 64, elements: !484)
!484 = !{!485, !486}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !483, file: !1, line: 968, baseType: !236, size: 640, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !483, file: !1, line: 969, baseType: !368, size: 64, align: 64, offset: 640)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !472, file: !1, line: 976, type: !44)
!488 = !DISubprogram(name: "mbuf_dealloc", scope: !1, file: !1, line: 113, type: !489, isLocal: true, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._PyManagedBufferObject*)* @mbuf_dealloc, variables: !491)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !350}
!491 = !{!492}
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !488, file: !1, line: 113, type: !350)
!493 = !DISubprogram(name: "mbuf_release", scope: !1, file: !1, line: 98, type: !489, isLocal: true, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: true, variables: !494)
!494 = !{!495, !496}
!495 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !493, file: !1, line: 98, type: !350)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !497, file: !1, line: 108, type: !369)
!497 = distinct !DILexicalBlock(scope: !493, file: !1, line: 108, column: 5)
!498 = !DISubprogram(name: "mbuf_traverse", scope: !1, file: !1, line: 123, type: !499, isLocal: true, isDefinition: true, scopeLine: 124, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyManagedBufferObject*, i32 (%struct._object*, i8*)*, i8*)* @mbuf_traverse, variables: !501)
!499 = !DISubroutineType(types: !500)
!500 = !{!44, !350, !263, !4}
!501 = !{!502, !503, !504, !505}
!502 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !498, file: !1, line: 123, type: !350)
!503 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !498, file: !1, line: 123, type: !263)
!504 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !498, file: !1, line: 123, type: !4)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !506, file: !1, line: 125, type: !44)
!506 = distinct !DILexicalBlock(scope: !507, file: !1, line: 125, column: 5)
!507 = distinct !DILexicalBlock(scope: !508, file: !1, line: 125, column: 5)
!508 = distinct !DILexicalBlock(scope: !498, file: !1, line: 125, column: 5)
!509 = !DISubprogram(name: "mbuf_clear", scope: !1, file: !1, line: 130, type: !510, isLocal: true, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyManagedBufferObject*)* @mbuf_clear, variables: !512)
!510 = !DISubroutineType(types: !511)
!511 = !{!44, !350}
!512 = !{!513}
!513 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !509, file: !1, line: 130, type: !350)
!514 = !DISubprogram(name: "mbuf_alloc", scope: !1, file: !1, line: 63, type: !515, isLocal: true, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, variables: !517)
!515 = !DISubroutineType(types: !516)
!516 = !{!350}
!517 = !{!518, !519}
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mbuf", scope: !514, file: !1, line: 65, type: !350)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !520, file: !1, line: 74, type: !369)
!520 = distinct !DILexicalBlock(scope: !514, file: !1, line: 74, column: 5)
!521 = !DISubprogram(name: "mbuf_add_view", scope: !1, file: !1, line: 652, type: !522, isLocal: true, isDefinition: true, scopeLine: 653, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._PyManagedBufferObject*, %struct.bufferinfo*)* @mbuf_add_view, variables: !526)
!522 = !DISubroutineType(types: !523)
!523 = !{!5, !350, !524}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!526 = !{!527, !528, !529, !530}
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mbuf", arg: 1, scope: !521, file: !1, line: 652, type: !350)
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !521, file: !1, line: 652, type: !524)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv", scope: !521, file: !1, line: 654, type: !343)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !521, file: !1, line: 655, type: !235)
!531 = !DISubprogram(name: "memory_alloc", scope: !1, file: !1, line: 620, type: !532, isLocal: true, isDefinition: true, scopeLine: 621, flags: DIFlagPrototyped, isOptimized: true, variables: !534)
!532 = !DISubroutineType(types: !533)
!533 = !{!343, !44}
!534 = !{!535, !536, !537}
!535 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndim", arg: 1, scope: !531, file: !1, line: 620, type: !44)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv", scope: !531, file: !1, line: 622, type: !343)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !538, file: !1, line: 639, type: !369)
!538 = distinct !DILexicalBlock(scope: !531, file: !1, line: 639, column: 5)
!539 = !DISubprogram(name: "init_flags", scope: !1, file: !1, line: 587, type: !540, isLocal: true, isDefinition: true, scopeLine: 588, flags: DIFlagPrototyped, isOptimized: true, variables: !542)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !343}
!542 = !{!543, !544, !545}
!543 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mv", arg: 1, scope: !539, file: !1, line: 587, type: !343)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view", scope: !539, file: !1, line: 589, type: !524)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !539, file: !1, line: 590, type: !44)
!546 = !DISubprogram(name: "_PyManagedBuffer_FromObject", scope: !1, file: !1, line: 80, type: !116, isLocal: true, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: true, variables: !547)
!547 = !{!548, !549, !550}
!548 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 1, scope: !546, file: !1, line: 80, type: !5)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mbuf", scope: !546, file: !1, line: 82, type: !350)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !551, file: !1, line: 90, type: !5)
!551 = distinct !DILexicalBlock(scope: !552, file: !1, line: 90, column: 9)
!552 = distinct !DILexicalBlock(scope: !553, file: !1, line: 88, column: 69)
!553 = distinct !DILexicalBlock(scope: !546, file: !1, line: 88, column: 9)
!554 = !DISubprogram(name: "memory_from_contiguous_copy", scope: !1, file: !1, line: 833, type: !555, isLocal: true, isDefinition: true, scopeLine: 834, flags: DIFlagPrototyped, isOptimized: true, variables: !557)
!555 = !DISubroutineType(types: !556)
!556 = !{!5, !235, !31}
!557 = !{!558, !559, !560, !561, !562, !563, !564, !565, !567, !571, !573}
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 1, scope: !554, file: !1, line: 833, type: !235)
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 2, scope: !554, file: !1, line: 833, type: !31)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mbuf", scope: !554, file: !1, line: 835, type: !350)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv", scope: !554, file: !1, line: 836, type: !343)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !554, file: !1, line: 837, type: !5)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !554, file: !1, line: 838, type: !235)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !554, file: !1, line: 839, type: !44)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !566, file: !1, line: 849, type: !5)
!566 = distinct !DILexicalBlock(scope: !554, file: !1, line: 849, column: 5)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !568, file: !1, line: 854, type: !5)
!568 = distinct !DILexicalBlock(scope: !569, file: !1, line: 854, column: 9)
!569 = distinct !DILexicalBlock(scope: !570, file: !1, line: 853, column: 50)
!570 = distinct !DILexicalBlock(scope: !554, file: !1, line: 853, column: 9)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !572, file: !1, line: 859, type: !5)
!572 = distinct !DILexicalBlock(scope: !554, file: !1, line: 859, column: 5)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !574, file: !1, line: 885, type: !5)
!574 = distinct !DILexicalBlock(scope: !575, file: !1, line: 885, column: 9)
!575 = distinct !DILexicalBlock(scope: !576, file: !1, line: 884, column: 37)
!576 = distinct !DILexicalBlock(scope: !554, file: !1, line: 884, column: 9)
!577 = !DISubprogram(name: "mbuf_copy_format", scope: !1, file: !1, line: 805, type: !578, isLocal: true, isDefinition: true, scopeLine: 806, flags: DIFlagPrototyped, isOptimized: true, variables: !580)
!578 = !DISubroutineType(types: !579)
!579 = !{!44, !350, !29}
!580 = !{!581, !582, !583}
!581 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mbuf", arg: 1, scope: !577, file: !1, line: 805, type: !350)
!582 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt", arg: 2, scope: !577, file: !1, line: 805, type: !29)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cp", scope: !584, file: !1, line: 808, type: !52)
!584 = distinct !DILexicalBlock(scope: !585, file: !1, line: 807, column: 22)
!585 = distinct !DILexicalBlock(scope: !577, file: !1, line: 807, column: 9)
!586 = !DISubprogram(name: "mbuf_add_incomplete_view", scope: !1, file: !1, line: 690, type: !587, isLocal: true, isDefinition: true, scopeLine: 692, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._PyManagedBufferObject*, %struct.bufferinfo*, i32)* @mbuf_add_incomplete_view, variables: !589)
!587 = !DISubroutineType(types: !588)
!588 = !{!5, !350, !524, !44}
!589 = !{!590, !591, !592, !593, !594}
!590 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mbuf", arg: 1, scope: !586, file: !1, line: 690, type: !350)
!591 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !586, file: !1, line: 690, type: !524)
!592 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndim", arg: 3, scope: !586, file: !1, line: 691, type: !44)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv", scope: !586, file: !1, line: 693, type: !343)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !586, file: !1, line: 694, type: !235)
!595 = !DISubprogram(name: "init_strides_from_shape", scope: !1, file: !1, line: 444, type: !596, isLocal: true, isDefinition: true, scopeLine: 445, flags: DIFlagPrototyped, isOptimized: true, variables: !598)
!596 = !DISubroutineType(types: !597)
!597 = !{null, !235}
!598 = !{!599, !600}
!599 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 1, scope: !595, file: !1, line: 444, type: !235)
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !595, file: !1, line: 446, type: !11)
!601 = !DISubprogram(name: "init_fortran_strides_from_shape", scope: !1, file: !1, line: 457, type: !596, isLocal: true, isDefinition: true, scopeLine: 458, flags: DIFlagPrototyped, isOptimized: true, variables: !602)
!602 = !{!603, !604}
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 1, scope: !601, file: !1, line: 457, type: !235)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !601, file: !1, line: 459, type: !11)
!605 = !DISubprogram(name: "copy_buffer", scope: !1, file: !1, line: 414, type: !606, isLocal: true, isDefinition: true, scopeLine: 415, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.bufferinfo*, %struct.bufferinfo*)* @copy_buffer, variables: !608)
!606 = !DISubroutineType(types: !607)
!607 = !{!44, !235, !235}
!608 = !{!609, !610, !611}
!609 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !605, file: !1, line: 414, type: !235)
!610 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !605, file: !1, line: 414, type: !235)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mem", scope: !605, file: !1, line: 416, type: !52)
!612 = !DISubprogram(name: "equiv_structure", scope: !1, file: !1, line: 305, type: !613, isLocal: true, isDefinition: true, scopeLine: 306, flags: DIFlagPrototyped, isOptimized: true, variables: !615)
!613 = !DISubroutineType(types: !614)
!614 = !{!44, !524, !524}
!615 = !{!616, !617}
!616 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !612, file: !1, line: 305, type: !524)
!617 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !612, file: !1, line: 305, type: !524)
!618 = !DISubprogram(name: "equiv_format", scope: !1, file: !1, line: 265, type: !613, isLocal: true, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: true, variables: !619)
!619 = !{!620, !621, !622, !623, !624, !627}
!620 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !618, file: !1, line: 265, type: !524)
!621 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !618, file: !1, line: 265, type: !524)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dfmt", scope: !618, file: !1, line: 267, type: !29)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sfmt", scope: !618, file: !1, line: 267, type: !29)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !625, file: !1, line: 273, type: !94)
!625 = distinct !DILexicalBlock(scope: !626, file: !1, line: 273, column: 9)
!626 = distinct !DILexicalBlock(scope: !618, file: !1, line: 273, column: 9)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !625, file: !1, line: 273, type: !94)
!628 = !DISubprogram(name: "equiv_shape", scope: !1, file: !1, line: 285, type: !613, isLocal: true, isDefinition: true, scopeLine: 286, flags: DIFlagPrototyped, isOptimized: true, variables: !629)
!629 = !{!630, !631, !632}
!630 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !628, file: !1, line: 285, type: !524)
!631 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !628, file: !1, line: 285, type: !524)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !628, file: !1, line: 287, type: !44)
!633 = !DISubprogram(name: "last_dim_is_contiguous", scope: !1, file: !1, line: 249, type: !613, isLocal: true, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: true, variables: !634)
!634 = !{!635, !636}
!635 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !633, file: !1, line: 249, type: !524)
!636 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !633, file: !1, line: 249, type: !524)
!637 = !DISubprogram(name: "copy_rec", scope: !1, file: !1, line: 352, type: !638, isLocal: true, isDefinition: true, scopeLine: 356, flags: DIFlagPrototyped, isOptimized: true, function: void (i64*, i64, i64, i8*, i64*, i64*, i8*, i64*, i64*, i8*)* @copy_rec, variables: !642)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !640, !11, !11, !52, !640, !640, !52, !640, !640, !52}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !658}
!643 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "shape", arg: 1, scope: !637, file: !1, line: 352, type: !640)
!644 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndim", arg: 2, scope: !637, file: !1, line: 352, type: !11)
!645 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "itemsize", arg: 3, scope: !637, file: !1, line: 352, type: !11)
!646 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dptr", arg: 4, scope: !637, file: !1, line: 353, type: !52)
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dstrides", arg: 5, scope: !637, file: !1, line: 353, type: !640)
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsuboffsets", arg: 6, scope: !637, file: !1, line: 353, type: !640)
!649 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sptr", arg: 7, scope: !637, file: !1, line: 354, type: !52)
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sstrides", arg: 8, scope: !637, file: !1, line: 354, type: !640)
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ssuboffsets", arg: 9, scope: !637, file: !1, line: 354, type: !640)
!652 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mem", arg: 10, scope: !637, file: !1, line: 355, type: !52)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !637, file: !1, line: 357, type: !11)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xdptr", scope: !655, file: !1, line: 370, type: !52)
!655 = distinct !DILexicalBlock(scope: !656, file: !1, line: 369, column: 74)
!656 = distinct !DILexicalBlock(scope: !657, file: !1, line: 369, column: 5)
!657 = distinct !DILexicalBlock(scope: !637, file: !1, line: 369, column: 5)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xsptr", scope: !655, file: !1, line: 371, type: !52)
!659 = !DISubprogram(name: "copy_base", scope: !1, file: !1, line: 322, type: !660, isLocal: true, isDefinition: true, scopeLine: 326, flags: DIFlagPrototyped, isOptimized: true, variables: !662)
!660 = !DISubroutineType(types: !661)
!661 = !{null, !640, !11, !52, !640, !640, !52, !640, !640, !52}
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !675, !677, !678, !682}
!663 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "shape", arg: 1, scope: !659, file: !1, line: 322, type: !640)
!664 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "itemsize", arg: 2, scope: !659, file: !1, line: 322, type: !11)
!665 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dptr", arg: 3, scope: !659, file: !1, line: 323, type: !52)
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dstrides", arg: 4, scope: !659, file: !1, line: 323, type: !640)
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsuboffsets", arg: 5, scope: !659, file: !1, line: 323, type: !640)
!668 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sptr", arg: 6, scope: !659, file: !1, line: 324, type: !52)
!669 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sstrides", arg: 7, scope: !659, file: !1, line: 324, type: !640)
!670 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ssuboffsets", arg: 8, scope: !659, file: !1, line: 324, type: !640)
!671 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mem", arg: 9, scope: !659, file: !1, line: 325, type: !52)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !673, file: !1, line: 328, type: !11)
!673 = distinct !DILexicalBlock(scope: !674, file: !1, line: 327, column: 22)
!674 = distinct !DILexicalBlock(scope: !659, file: !1, line: 327, column: 9)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !676, file: !1, line: 335, type: !52)
!676 = distinct !DILexicalBlock(scope: !674, file: !1, line: 334, column: 10)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !676, file: !1, line: 336, type: !11)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xsptr", scope: !679, file: !1, line: 338, type: !52)
!679 = distinct !DILexicalBlock(scope: !680, file: !1, line: 337, column: 77)
!680 = distinct !DILexicalBlock(scope: !681, file: !1, line: 337, column: 9)
!681 = distinct !DILexicalBlock(scope: !676, file: !1, line: 337, column: 9)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xdptr", scope: !683, file: !1, line: 342, type: !52)
!683 = distinct !DILexicalBlock(scope: !684, file: !1, line: 341, column: 77)
!684 = distinct !DILexicalBlock(scope: !685, file: !1, line: 341, column: 9)
!685 = distinct !DILexicalBlock(scope: !676, file: !1, line: 341, column: 9)
!686 = !DISubprogram(name: "init_shared_values", scope: !1, file: !1, line: 519, type: !687, isLocal: true, isDefinition: true, scopeLine: 520, flags: DIFlagPrototyped, isOptimized: true, variables: !689)
!687 = !DISubroutineType(types: !688)
!688 = !{null, !235, !524}
!689 = !{!690, !691}
!690 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !686, file: !1, line: 519, type: !235)
!691 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !686, file: !1, line: 519, type: !524)
!692 = !DISubprogram(name: "init_shape_strides", scope: !1, file: !1, line: 532, type: !687, isLocal: true, isDefinition: true, scopeLine: 533, flags: DIFlagPrototyped, isOptimized: true, variables: !693)
!693 = !{!694, !695, !696}
!694 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !692, file: !1, line: 532, type: !235)
!695 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !692, file: !1, line: 532, type: !524)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !692, file: !1, line: 534, type: !11)
!697 = !DISubprogram(name: "init_suboffsets", scope: !1, file: !1, line: 559, type: !687, isLocal: true, isDefinition: true, scopeLine: 560, flags: DIFlagPrototyped, isOptimized: true, variables: !698)
!698 = !{!699, !700, !701}
!699 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !697, file: !1, line: 559, type: !235)
!700 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !697, file: !1, line: 559, type: !524)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !697, file: !1, line: 561, type: !11)
!702 = !DISubprogram(name: "buffer_to_contiguous", scope: !1, file: !1, line: 472, type: !703, isLocal: true, isDefinition: true, scopeLine: 473, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct.bufferinfo*, i8)* @buffer_to_contiguous, variables: !705)
!703 = !DISubroutineType(types: !704)
!704 = !{!44, !52, !235, !31}
!705 = !{!706, !707, !708, !709, !710, !711}
!706 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mem", arg: 1, scope: !702, file: !1, line: 472, type: !52)
!707 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !702, file: !1, line: 472, type: !235)
!708 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 3, scope: !702, file: !1, line: 472, type: !31)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !702, file: !1, line: 474, type: !236)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "strides", scope: !702, file: !1, line: 475, type: !247)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !702, file: !1, line: 476, type: !44)
!712 = !DISubprogram(name: "memory_dealloc", scope: !1, file: !1, line: 1057, type: !540, isLocal: true, isDefinition: true, scopeLine: 1058, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyMemoryViewObject*)* @memory_dealloc, variables: !713)
!713 = !{!714, !715, !717, !719}
!714 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !712, file: !1, line: 1057, type: !343)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !716, file: !1, line: 1060, type: !369)
!716 = distinct !DILexicalBlock(scope: !712, file: !1, line: 1060, column: 5)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !718, file: !1, line: 1062, type: !5)
!718 = distinct !DILexicalBlock(scope: !712, file: !1, line: 1062, column: 5)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !720, file: !1, line: 1062, type: !5)
!720 = distinct !DILexicalBlock(scope: !721, file: !1, line: 1062, column: 5)
!721 = distinct !DILexicalBlock(scope: !722, file: !1, line: 1062, column: 5)
!722 = distinct !DILexicalBlock(scope: !718, file: !1, line: 1062, column: 5)
!723 = !DISubprogram(name: "_memory_release", scope: !1, file: !1, line: 1025, type: !724, isLocal: true, isDefinition: true, scopeLine: 1026, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyMemoryViewObject*)* @_memory_release, variables: !726)
!724 = !DISubroutineType(types: !725)
!725 = !{!44, !343}
!726 = !{!727}
!727 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !723, file: !1, line: 1025, type: !343)
!728 = !DISubprogram(name: "memory_repr", scope: !1, file: !1, line: 2116, type: !729, isLocal: true, isDefinition: true, scopeLine: 2117, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyMemoryViewObject*)* @memory_repr, variables: !731)
!729 = !DISubroutineType(types: !730)
!730 = !{!5, !343}
!731 = !{!732}
!732 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !728, file: !1, line: 2116, type: !343)
!733 = !DISubprogram(name: "memory_length", scope: !1, file: !1, line: 2390, type: !734, isLocal: true, isDefinition: true, scopeLine: 2391, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.PyMemoryViewObject*)* @memory_length, variables: !736)
!734 = !DISubroutineType(types: !735)
!735 = !{!11, !343}
!736 = !{!737}
!737 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !733, file: !1, line: 2390, type: !343)
!738 = !DISubprogram(name: "memory_item", scope: !1, file: !1, line: 2160, type: !739, isLocal: true, isDefinition: true, scopeLine: 2161, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyMemoryViewObject*, i64)* @memory_item, variables: !741)
!739 = !DISubroutineType(types: !740)
!740 = !{!5, !343, !11}
!741 = !{!742, !743, !744, !745, !746}
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !738, file: !1, line: 2160, type: !343)
!743 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 2, scope: !738, file: !1, line: 2160, type: !11)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view", scope: !738, file: !1, line: 2162, type: !235)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmt", scope: !738, file: !1, line: 2163, type: !29)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !747, file: !1, line: 2176, type: !52)
!747 = distinct !DILexicalBlock(scope: !748, file: !1, line: 2175, column: 26)
!748 = distinct !DILexicalBlock(scope: !738, file: !1, line: 2175, column: 9)
!749 = !DISubprogram(name: "adjust_fmt", scope: !1, file: !1, line: 1988, type: !750, isLocal: true, isDefinition: true, scopeLine: 1989, flags: DIFlagPrototyped, isOptimized: true, variables: !752)
!750 = !DISubroutineType(types: !751)
!751 = !{!29, !524}
!752 = !{!753, !754}
!753 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 1, scope: !749, file: !1, line: 1988, type: !524)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmt", scope: !749, file: !1, line: 1990, type: !29)
!755 = !DISubprogram(name: "ptr_from_index", scope: !1, file: !1, line: 2131, type: !756, isLocal: true, isDefinition: true, scopeLine: 2132, flags: DIFlagPrototyped, isOptimized: true, variables: !758)
!756 = !DISubroutineType(types: !757)
!757 = !{!52, !235, !11}
!758 = !{!759, !760, !761, !762}
!759 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 1, scope: !755, file: !1, line: 2131, type: !235)
!760 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 2, scope: !755, file: !1, line: 2131, type: !11)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !755, file: !1, line: 2133, type: !52)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nitems", scope: !755, file: !1, line: 2134, type: !11)
!763 = !DISubprogram(name: "unpack_single", scope: !1, file: !1, line: 1620, type: !764, isLocal: true, isDefinition: true, scopeLine: 1621, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i8*)* @unpack_single, variables: !766)
!764 = !DISubroutineType(types: !765)
!765 = !{!5, !29, !29}
!766 = !{!767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !781, !783, !785, !787, !789, !791, !793, !795, !797, !799, !801, !803, !805}
!767 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !763, file: !1, line: 1620, type: !29)
!768 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt", arg: 2, scope: !763, file: !1, line: 1620, type: !29)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "llu", scope: !763, file: !1, line: 1622, type: !398)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lu", scope: !763, file: !1, line: 1623, type: !96)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zu", scope: !763, file: !1, line: 1624, type: !94)
!772 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lld", scope: !763, file: !1, line: 1625, type: !397)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ld", scope: !763, file: !1, line: 1626, type: !17)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zd", scope: !763, file: !1, line: 1627, type: !11)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !763, file: !1, line: 1628, type: !382)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uc", scope: !763, file: !1, line: 1629, type: !385)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !763, file: !1, line: 1630, type: !4)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !779, file: !1, line: 1637, type: !396)
!779 = distinct !DILexicalBlock(scope: !780, file: !1, line: 1637, column: 15)
!780 = distinct !DILexicalBlock(scope: !763, file: !1, line: 1632, column: 21)
!781 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !782, file: !1, line: 1638, type: !44)
!782 = distinct !DILexicalBlock(scope: !780, file: !1, line: 1638, column: 15)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !784, file: !1, line: 1639, type: !17)
!784 = distinct !DILexicalBlock(scope: !780, file: !1, line: 1639, column: 15)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !786, file: !1, line: 1643, type: !400)
!786 = distinct !DILexicalBlock(scope: !780, file: !1, line: 1643, column: 15)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !788, file: !1, line: 1649, type: !77)
!788 = distinct !DILexicalBlock(scope: !780, file: !1, line: 1649, column: 15)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !790, file: !1, line: 1650, type: !341)
!790 = distinct !DILexicalBlock(scope: !780, file: !1, line: 1650, column: 15)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !792, file: !1, line: 1651, type: !96)
!792 = distinct !DILexicalBlock(scope: !780, file: !1, line: 1651, column: 15)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !794, file: !1, line: 1655, type: !397)
!794 = distinct !DILexicalBlock(scope: !780, file: !1, line: 1655, column: 15)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !796, file: !1, line: 1656, type: !398)
!796 = distinct !DILexicalBlock(scope: !780, file: !1, line: 1656, column: 15)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !798, file: !1, line: 1660, type: !11)
!798 = distinct !DILexicalBlock(scope: !780, file: !1, line: 1660, column: 15)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !800, file: !1, line: 1661, type: !94)
!800 = distinct !DILexicalBlock(scope: !780, file: !1, line: 1661, column: 15)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !802, file: !1, line: 1664, type: !399)
!802 = distinct !DILexicalBlock(scope: !780, file: !1, line: 1664, column: 15)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !804, file: !1, line: 1665, type: !382)
!804 = distinct !DILexicalBlock(scope: !780, file: !1, line: 1665, column: 15)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !806, file: !1, line: 1671, type: !4)
!806 = distinct !DILexicalBlock(scope: !780, file: !1, line: 1671, column: 15)
!807 = !DISubprogram(name: "memory_subscript", scope: !1, file: !1, line: 2242, type: !808, isLocal: true, isDefinition: true, scopeLine: 2243, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyMemoryViewObject*, %struct._object*)* @memory_subscript, variables: !810)
!808 = !DISubroutineType(types: !809)
!809 = !{!5, !343, !5}
!810 = !{!811, !812, !813, !814, !819, !822, !825}
!811 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !807, file: !1, line: 2242, type: !343)
!812 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !807, file: !1, line: 2242, type: !5)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view", scope: !807, file: !1, line: 2244, type: !235)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmt", scope: !815, file: !1, line: 2251, type: !29)
!815 = distinct !DILexicalBlock(scope: !816, file: !1, line: 2250, column: 63)
!816 = distinct !DILexicalBlock(scope: !817, file: !1, line: 2250, column: 13)
!817 = distinct !DILexicalBlock(scope: !818, file: !1, line: 2249, column: 26)
!818 = distinct !DILexicalBlock(scope: !807, file: !1, line: 2249, column: 9)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !820, file: !1, line: 2268, type: !11)
!820 = distinct !DILexicalBlock(scope: !821, file: !1, line: 2267, column: 29)
!821 = distinct !DILexicalBlock(scope: !807, file: !1, line: 2267, column: 9)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sliced", scope: !823, file: !1, line: 2275, type: !343)
!823 = distinct !DILexicalBlock(scope: !824, file: !1, line: 2274, column: 34)
!824 = distinct !DILexicalBlock(scope: !821, file: !1, line: 2274, column: 14)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !826, file: !1, line: 2282, type: !5)
!826 = distinct !DILexicalBlock(scope: !827, file: !1, line: 2282, column: 13)
!827 = distinct !DILexicalBlock(scope: !828, file: !1, line: 2281, column: 52)
!828 = distinct !DILexicalBlock(scope: !823, file: !1, line: 2281, column: 13)
!829 = !DISubprogram(name: "init_slice", scope: !1, file: !1, line: 2188, type: !830, isLocal: true, isDefinition: true, scopeLine: 2189, flags: DIFlagPrototyped, isOptimized: true, variables: !832)
!830 = !DISubroutineType(types: !831)
!831 = !{!44, !235, !5, !44}
!832 = !{!833, !834, !835, !836, !837, !838, !839, !840}
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 1, scope: !829, file: !1, line: 2188, type: !235)
!834 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !829, file: !1, line: 2188, type: !5)
!835 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 3, scope: !829, file: !1, line: 2188, type: !44)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !829, file: !1, line: 2190, type: !11)
!837 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stop", scope: !829, file: !1, line: 2190, type: !11)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step", scope: !829, file: !1, line: 2190, type: !11)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slicelength", scope: !829, file: !1, line: 2190, type: !11)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !841, file: !1, line: 2203, type: !11)
!841 = distinct !DILexicalBlock(scope: !842, file: !1, line: 2202, column: 10)
!842 = distinct !DILexicalBlock(scope: !829, file: !1, line: 2198, column: 9)
!843 = !DISubprogram(name: "init_len", scope: !1, file: !1, line: 573, type: !596, isLocal: true, isDefinition: true, scopeLine: 574, flags: DIFlagPrototyped, isOptimized: true, variables: !844)
!844 = !{!845, !846, !847}
!845 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 1, scope: !843, file: !1, line: 573, type: !235)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !843, file: !1, line: 575, type: !11)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !843, file: !1, line: 575, type: !11)
!848 = !DISubprogram(name: "is_multislice", scope: !1, file: !1, line: 2217, type: !144, isLocal: true, isDefinition: true, scopeLine: 2218, flags: DIFlagPrototyped, isOptimized: true, variables: !849)
!849 = !{!850, !851, !852, !853}
!850 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !848, file: !1, line: 2217, type: !5)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !848, file: !1, line: 2219, type: !11)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !848, file: !1, line: 2219, type: !11)
!853 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !854, file: !1, line: 2228, type: !5)
!854 = distinct !DILexicalBlock(scope: !855, file: !1, line: 2227, column: 32)
!855 = distinct !DILexicalBlock(scope: !856, file: !1, line: 2227, column: 5)
!856 = distinct !DILexicalBlock(scope: !848, file: !1, line: 2227, column: 5)
!857 = !DISubprogram(name: "memory_ass_sub", scope: !1, file: !1, line: 2301, type: !858, isLocal: true, isDefinition: true, scopeLine: 2302, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyMemoryViewObject*, %struct._object*, %struct._object*)* @memory_ass_sub, variables: !860)
!858 = !DISubroutineType(types: !859)
!859 = !{!44, !343, !5, !5}
!860 = !{!861, !862, !863, !864, !865, !866, !867, !868, !871, !874, !876}
!861 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !857, file: !1, line: 2301, type: !343)
!862 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !857, file: !1, line: 2301, type: !5)
!863 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !857, file: !1, line: 2301, type: !5)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view", scope: !857, file: !1, line: 2303, type: !235)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "src", scope: !857, file: !1, line: 2304, type: !236)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmt", scope: !857, file: !1, line: 2305, type: !29)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !857, file: !1, line: 2306, type: !52)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !869, file: !1, line: 2341, type: !11)
!869 = distinct !DILexicalBlock(scope: !870, file: !1, line: 2340, column: 29)
!870 = distinct !DILexicalBlock(scope: !857, file: !1, line: 2340, column: 9)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !872, file: !1, line: 2351, type: !236)
!872 = distinct !DILexicalBlock(scope: !873, file: !1, line: 2350, column: 48)
!873 = distinct !DILexicalBlock(scope: !857, file: !1, line: 2350, column: 9)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arrays", scope: !872, file: !1, line: 2352, type: !875)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 192, align: 64, elements: !364)
!876 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !872, file: !1, line: 2353, type: !44)
!877 = !DISubprogram(name: "pack_single", scope: !1, file: !1, line: 1716, type: !878, isLocal: true, isDefinition: true, scopeLine: 1717, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._object*, i8*)* @pack_single, variables: !880)
!878 = !DISubroutineType(types: !879)
!879 = !{!44, !52, !5, !29}
!880 = !{!881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !896, !898, !900, !903, !905, !907, !909, !911, !913, !915, !919, !922, !924}
!881 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !877, file: !1, line: 1716, type: !52)
!882 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 2, scope: !877, file: !1, line: 1716, type: !5)
!883 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt", arg: 3, scope: !877, file: !1, line: 1716, type: !29)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "llu", scope: !877, file: !1, line: 1718, type: !398)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lu", scope: !877, file: !1, line: 1719, type: !96)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zu", scope: !877, file: !1, line: 1720, type: !94)
!887 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lld", scope: !877, file: !1, line: 1721, type: !397)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ld", scope: !877, file: !1, line: 1722, type: !17)
!889 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zd", scope: !877, file: !1, line: 1723, type: !11)
!890 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !877, file: !1, line: 1724, type: !382)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !877, file: !1, line: 1725, type: !4)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !893, file: !1, line: 1739, type: !396)
!893 = distinct !DILexicalBlock(scope: !894, file: !1, line: 1739, column: 13)
!894 = distinct !DILexicalBlock(scope: !895, file: !1, line: 1733, column: 25)
!895 = distinct !DILexicalBlock(scope: !877, file: !1, line: 1727, column: 21)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !897, file: !1, line: 1742, type: !44)
!897 = distinct !DILexicalBlock(scope: !894, file: !1, line: 1742, column: 13)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !899, file: !1, line: 1744, type: !17)
!899 = distinct !DILexicalBlock(scope: !894, file: !1, line: 1744, column: 13)
!900 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !901, file: !1, line: 1759, type: !77)
!901 = distinct !DILexicalBlock(scope: !902, file: !1, line: 1759, column: 13)
!902 = distinct !DILexicalBlock(scope: !895, file: !1, line: 1753, column: 25)
!903 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !904, file: !1, line: 1762, type: !341)
!904 = distinct !DILexicalBlock(scope: !902, file: !1, line: 1762, column: 13)
!905 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !906, file: !1, line: 1764, type: !96)
!906 = distinct !DILexicalBlock(scope: !902, file: !1, line: 1764, column: 13)
!907 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !908, file: !1, line: 1774, type: !397)
!908 = distinct !DILexicalBlock(scope: !895, file: !1, line: 1774, column: 9)
!909 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !910, file: !1, line: 1780, type: !398)
!910 = distinct !DILexicalBlock(scope: !895, file: !1, line: 1780, column: 9)
!911 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !912, file: !1, line: 1789, type: !11)
!912 = distinct !DILexicalBlock(scope: !895, file: !1, line: 1789, column: 9)
!913 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !914, file: !1, line: 1795, type: !94)
!914 = distinct !DILexicalBlock(scope: !895, file: !1, line: 1795, column: 9)
!915 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !916, file: !1, line: 1804, type: !399)
!916 = distinct !DILexicalBlock(scope: !917, file: !1, line: 1804, column: 13)
!917 = distinct !DILexicalBlock(scope: !918, file: !1, line: 1803, column: 28)
!918 = distinct !DILexicalBlock(scope: !895, file: !1, line: 1803, column: 13)
!919 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !920, file: !1, line: 1807, type: !382)
!920 = distinct !DILexicalBlock(scope: !921, file: !1, line: 1807, column: 13)
!921 = distinct !DILexicalBlock(scope: !918, file: !1, line: 1806, column: 14)
!922 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !923, file: !1, line: 1817, type: !400)
!923 = distinct !DILexicalBlock(scope: !895, file: !1, line: 1817, column: 9)
!924 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !925, file: !1, line: 1837, type: !4)
!925 = distinct !DILexicalBlock(scope: !895, file: !1, line: 1837, column: 9)
!926 = !DISubprogram(name: "pylong_as_ld", scope: !1, file: !1, line: 1515, type: !927, isLocal: true, isDefinition: true, scopeLine: 1516, flags: DIFlagPrototyped, isOptimized: true, variables: !929)
!927 = !DISubroutineType(types: !928)
!928 = !{!17, !5}
!929 = !{!930, !931, !932, !933}
!930 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 1, scope: !926, file: !1, line: 1515, type: !5)
!931 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !926, file: !1, line: 1517, type: !5)
!932 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ld", scope: !926, file: !1, line: 1518, type: !17)
!933 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !934, file: !1, line: 1525, type: !5)
!934 = distinct !DILexicalBlock(scope: !926, file: !1, line: 1525, column: 5)
!935 = !DISubprogram(name: "pylong_as_lu", scope: !1, file: !1, line: 1530, type: !936, isLocal: true, isDefinition: true, scopeLine: 1531, flags: DIFlagPrototyped, isOptimized: true, variables: !938)
!936 = !DISubroutineType(types: !937)
!937 = !{!96, !5}
!938 = !{!939, !940, !941, !942}
!939 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 1, scope: !935, file: !1, line: 1530, type: !5)
!940 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !935, file: !1, line: 1532, type: !5)
!941 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lu", scope: !935, file: !1, line: 1533, type: !96)
!942 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !943, file: !1, line: 1540, type: !5)
!943 = distinct !DILexicalBlock(scope: !935, file: !1, line: 1540, column: 5)
!944 = !DISubprogram(name: "pylong_as_lld", scope: !1, file: !1, line: 1546, type: !945, isLocal: true, isDefinition: true, scopeLine: 1547, flags: DIFlagPrototyped, isOptimized: true, variables: !947)
!945 = !DISubroutineType(types: !946)
!946 = !{!397, !5}
!947 = !{!948, !949, !950, !951}
!948 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 1, scope: !944, file: !1, line: 1546, type: !5)
!949 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !944, file: !1, line: 1548, type: !5)
!950 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lld", scope: !944, file: !1, line: 1549, type: !397)
!951 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !952, file: !1, line: 1556, type: !5)
!952 = distinct !DILexicalBlock(scope: !944, file: !1, line: 1556, column: 5)
!953 = !DISubprogram(name: "pylong_as_llu", scope: !1, file: !1, line: 1561, type: !954, isLocal: true, isDefinition: true, scopeLine: 1562, flags: DIFlagPrototyped, isOptimized: true, variables: !956)
!954 = !DISubroutineType(types: !955)
!955 = !{!398, !5}
!956 = !{!957, !958, !959, !960}
!957 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 1, scope: !953, file: !1, line: 1561, type: !5)
!958 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !953, file: !1, line: 1563, type: !5)
!959 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "llu", scope: !953, file: !1, line: 1564, type: !398)
!960 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !961, file: !1, line: 1571, type: !5)
!961 = distinct !DILexicalBlock(scope: !953, file: !1, line: 1571, column: 5)
