; ModuleID = 'metagrammar.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.grammar = type { i32, %struct.dfa*, %struct.labellist, i32, i32 }
%struct.dfa = type { i32, i8*, i32, i32, %struct.state*, i8* }
%struct.state = type { i32, %struct.arc*, i32, i32, i32*, i32 }
%struct.arc = type { i16, i16 }
%struct.labellist = type { i32, %struct.label* }
%struct.label = type { i32, i8* }

@_PyParser_Grammar = internal global %struct.grammar { i32 6, %struct.dfa* getelementptr inbounds ([6 x %struct.dfa], [6 x %struct.dfa]* @dfas, i32 0, i32 0), %struct.labellist { i32 19, %struct.label* getelementptr inbounds ([19 x %struct.label], [19 x %struct.label]* @labels, i32 0, i32 0) }, i32 256, i32 0 }, align 8
@dfas = internal global [6 x %struct.dfa] [%struct.dfa { i32 256, i8* getelementptr inbounds ([7 x i8], [7 x i8]* @.str, i32 0, i32 0), i32 0, i32 2, %struct.state* getelementptr inbounds ([2 x %struct.state], [2 x %struct.state]* @states_0, i32 0, i32 0), i8* getelementptr inbounds ([4 x i8], [4 x i8]* @.str.1, i32 0, i32 0) }, %struct.dfa { i32 257, i8* getelementptr inbounds ([5 x i8], [5 x i8]* @.str.2, i32 0, i32 0), i32 0, i32 5, %struct.state* getelementptr inbounds ([5 x %struct.state], [5 x %struct.state]* @states_1, i32 0, i32 0), i8* getelementptr inbounds ([4 x i8], [4 x i8]* @.str.3, i32 0, i32 0) }, %struct.dfa { i32 258, i8* getelementptr inbounds ([4 x i8], [4 x i8]* @.str.4, i32 0, i32 0), i32 0, i32 2, %struct.state* getelementptr inbounds ([2 x %struct.state], [2 x %struct.state]* @states_2, i32 0, i32 0), i8* getelementptr inbounds ([4 x i8], [4 x i8]* @.str.5, i32 0, i32 0) }, %struct.dfa { i32 259, i8* getelementptr inbounds ([4 x i8], [4 x i8]* @.str.6, i32 0, i32 0), i32 0, i32 2, %struct.state* getelementptr inbounds ([2 x %struct.state], [2 x %struct.state]* @states_3, i32 0, i32 0), i8* getelementptr inbounds ([4 x i8], [4 x i8]* @.str.5, i32 0, i32 0) }, %struct.dfa { i32 260, i8* getelementptr inbounds ([5 x i8], [5 x i8]* @.str.7, i32 0, i32 0), i32 0, i32 5, %struct.state* getelementptr inbounds ([5 x %struct.state], [5 x %struct.state]* @states_4, i32 0, i32 0), i8* getelementptr inbounds ([4 x i8], [4 x i8]* @.str.5, i32 0, i32 0) }, %struct.dfa { i32 261, i8* getelementptr inbounds ([5 x i8], [5 x i8]* @.str.8, i32 0, i32 0), i32 0, i32 4, %struct.state* getelementptr inbounds ([4 x %struct.state], [4 x %struct.state]* @states_5, i32 0, i32 0), i8* getelementptr inbounds ([4 x i8], [4 x i8]* @.str.9, i32 0, i32 0) }], align 16
@labels = internal global [19 x %struct.label] [%struct.label { i32 0, i8* getelementptr inbounds ([6 x i8], [6 x i8]* @.str.10, i32 0, i32 0) }, %struct.label { i32 256, i8* null }, %struct.label { i32 257, i8* null }, %struct.label { i32 4, i8* null }, %struct.label zeroinitializer, %struct.label { i32 1, i8* null }, %struct.label { i32 11, i8* null }, %struct.label { i32 258, i8* null }, %struct.label { i32 259, i8* null }, %struct.label { i32 18, i8* null }, %struct.label { i32 260, i8* null }, %struct.label { i32 9, i8* null }, %struct.label { i32 10, i8* null }, %struct.label { i32 261, i8* null }, %struct.label { i32 16, i8* null }, %struct.label { i32 14, i8* null }, %struct.label { i32 3, i8* null }, %struct.label { i32 7, i8* null }, %struct.label { i32 8, i8* null }], align 16
@.str = private unnamed_addr constant [7 x i8] c"MSTART\00", align 1
@states_0 = internal global [2 x %struct.state] [%struct.state { i32 3, %struct.arc* getelementptr inbounds ([3 x %struct.arc], [3 x %struct.arc]* @arcs_0_0, i32 0, i32 0), i32 0, i32 0, i32* null, i32 0 }, %struct.state { i32 1, %struct.arc* getelementptr inbounds ([1 x %struct.arc], [1 x %struct.arc]* @arcs_0_1, i32 0, i32 0), i32 0, i32 0, i32* null, i32 0 }], align 16
@.str.1 = private unnamed_addr constant [4 x i8] c"8\00\00\00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c"RULE\00", align 1
@states_1 = internal global [5 x %struct.state] [%struct.state { i32 1, %struct.arc* getelementptr inbounds ([1 x %struct.arc], [1 x %struct.arc]* @arcs_1_0, i32 0, i32 0), i32 0, i32 0, i32* null, i32 0 }, %struct.state { i32 1, %struct.arc* getelementptr inbounds ([1 x %struct.arc], [1 x %struct.arc]* @arcs_1_1, i32 0, i32 0), i32 0, i32 0, i32* null, i32 0 }, %struct.state { i32 1, %struct.arc* getelementptr inbounds ([1 x %struct.arc], [1 x %struct.arc]* @arcs_1_2, i32 0, i32 0), i32 0, i32 0, i32* null, i32 0 }, %struct.state { i32 1, %struct.arc* getelementptr inbounds ([1 x %struct.arc], [1 x %struct.arc]* @arcs_1_3, i32 0, i32 0), i32 0, i32 0, i32* null, i32 0 }, %struct.state { i32 1, %struct.arc* getelementptr inbounds ([1 x %struct.arc], [1 x %struct.arc]* @arcs_1_4, i32 0, i32 0), i32 0, i32 0, i32* null, i32 0 }], align 16
@.str.3 = private unnamed_addr constant [4 x i8] c" \00\00\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"RHS\00", align 1
@states_2 = internal global [2 x %struct.state] [%struct.state { i32 1, %struct.arc* getelementptr inbounds ([1 x %struct.arc], [1 x %struct.arc]* @arcs_2_0, i32 0, i32 0), i32 0, i32 0, i32* null, i32 0 }, %struct.state { i32 2, %struct.arc* getelementptr inbounds ([2 x %struct.arc], [2 x %struct.arc]* @arcs_2_1, i32 0, i32 0), i32 0, i32 0, i32* null, i32 0 }], align 16
@.str.5 = private unnamed_addr constant [4 x i8] c" \08\03\00", align 1
@.str.6 = private unnamed_addr constant [4 x i8] c"ALT\00", align 1
@states_3 = internal global [2 x %struct.state] [%struct.state { i32 1, %struct.arc* getelementptr inbounds ([1 x %struct.arc], [1 x %struct.arc]* @arcs_3_0, i32 0, i32 0), i32 0, i32 0, i32* null, i32 0 }, %struct.state { i32 2, %struct.arc* getelementptr inbounds ([2 x %struct.arc], [2 x %struct.arc]* @arcs_3_1, i32 0, i32 0), i32 0, i32 0, i32* null, i32 0 }], align 16
@.str.7 = private unnamed_addr constant [5 x i8] c"ITEM\00", align 1
@states_4 = internal global [5 x %struct.state] [%struct.state { i32 2, %struct.arc* getelementptr inbounds ([2 x %struct.arc], [2 x %struct.arc]* @arcs_4_0, i32 0, i32 0), i32 0, i32 0, i32* null, i32 0 }, %struct.state { i32 1, %struct.arc* getelementptr inbounds ([1 x %struct.arc], [1 x %struct.arc]* @arcs_4_1, i32 0, i32 0), i32 0, i32 0, i32* null, i32 0 }, %struct.state { i32 3, %struct.arc* getelementptr inbounds ([3 x %struct.arc], [3 x %struct.arc]* @arcs_4_2, i32 0, i32 0), i32 0, i32 0, i32* null, i32 0 }, %struct.state { i32 1, %struct.arc* getelementptr inbounds ([1 x %struct.arc], [1 x %struct.arc]* @arcs_4_3, i32 0, i32 0), i32 0, i32 0, i32* null, i32 0 }, %struct.state { i32 1, %struct.arc* getelementptr inbounds ([1 x %struct.arc], [1 x %struct.arc]* @arcs_4_4, i32 0, i32 0), i32 0, i32 0, i32* null, i32 0 }], align 16
@.str.8 = private unnamed_addr constant [5 x i8] c"ATOM\00", align 1
@states_5 = internal global [4 x %struct.state] [%struct.state { i32 3, %struct.arc* getelementptr inbounds ([3 x %struct.arc], [3 x %struct.arc]* @arcs_5_0, i32 0, i32 0), i32 0, i32 0, i32* null, i32 0 }, %struct.state { i32 1, %struct.arc* getelementptr inbounds ([1 x %struct.arc], [1 x %struct.arc]* @arcs_5_1, i32 0, i32 0), i32 0, i32 0, i32* null, i32 0 }, %struct.state { i32 1, %struct.arc* getelementptr inbounds ([1 x %struct.arc], [1 x %struct.arc]* @arcs_5_2, i32 0, i32 0), i32 0, i32 0, i32* null, i32 0 }, %struct.state { i32 1, %struct.arc* getelementptr inbounds ([1 x %struct.arc], [1 x %struct.arc]* @arcs_5_3, i32 0, i32 0), i32 0, i32 0, i32* null, i32 0 }], align 16
@.str.9 = private unnamed_addr constant [4 x i8] c" \00\03\00", align 1
@arcs_0_0 = internal global [3 x %struct.arc] [%struct.arc { i16 2, i16 0 }, %struct.arc { i16 3, i16 0 }, %struct.arc { i16 4, i16 1 }], align 2
@arcs_0_1 = internal global [1 x %struct.arc] [%struct.arc { i16 0, i16 1 }], align 2
@arcs_1_0 = internal global [1 x %struct.arc] [%struct.arc { i16 5, i16 1 }], align 2
@arcs_1_1 = internal global [1 x %struct.arc] [%struct.arc { i16 6, i16 2 }], align 2
@arcs_1_2 = internal global [1 x %struct.arc] [%struct.arc { i16 7, i16 3 }], align 2
@arcs_1_3 = internal global [1 x %struct.arc] [%struct.arc { i16 3, i16 4 }], align 2
@arcs_1_4 = internal global [1 x %struct.arc] [%struct.arc { i16 0, i16 4 }], align 2
@arcs_2_0 = internal global [1 x %struct.arc] [%struct.arc { i16 8, i16 1 }], align 2
@arcs_2_1 = internal global [2 x %struct.arc] [%struct.arc { i16 9, i16 0 }, %struct.arc { i16 0, i16 1 }], align 2
@arcs_3_0 = internal global [1 x %struct.arc] [%struct.arc { i16 10, i16 1 }], align 2
@arcs_3_1 = internal global [2 x %struct.arc] [%struct.arc { i16 10, i16 1 }, %struct.arc { i16 0, i16 1 }], align 2
@arcs_4_0 = internal global [2 x %struct.arc] [%struct.arc { i16 11, i16 1 }, %struct.arc { i16 13, i16 2 }], align 2
@arcs_4_1 = internal global [1 x %struct.arc] [%struct.arc { i16 7, i16 3 }], align 2
@arcs_4_2 = internal global [3 x %struct.arc] [%struct.arc { i16 14, i16 4 }, %struct.arc { i16 15, i16 4 }, %struct.arc { i16 0, i16 2 }], align 2
@arcs_4_3 = internal global [1 x %struct.arc] [%struct.arc { i16 12, i16 4 }], align 2
@arcs_4_4 = internal global [1 x %struct.arc] [%struct.arc { i16 0, i16 4 }], align 2
@arcs_5_0 = internal global [3 x %struct.arc] [%struct.arc { i16 5, i16 1 }, %struct.arc { i16 16, i16 1 }, %struct.arc { i16 17, i16 2 }], align 2
@arcs_5_1 = internal global [1 x %struct.arc] [%struct.arc { i16 0, i16 1 }], align 2
@arcs_5_2 = internal global [1 x %struct.arc] [%struct.arc { i16 7, i16 3 }], align 2
@arcs_5_3 = internal global [1 x %struct.arc] [%struct.arc { i16 18, i16 1 }], align 2
@.str.10 = private unnamed_addr constant [6 x i8] c"EMPTY\00", align 1

; Function Attrs: nounwind readnone uwtable
define %struct.grammar* @_Py_meta_grammar() #0 {
entry:
  ret %struct.grammar* @_PyParser_Grammar, !dbg !117
}

; Function Attrs: nounwind readnone uwtable
define %struct.grammar* @Py_meta_grammar() #0 {
entry:
  ret %struct.grammar* @_PyParser_Grammar, !dbg !118
}

attributes #0 = { nounwind readnone uwtable "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="false" "no-infs-fp-math"="false" "no-nans-fp-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+sse,+sse2" "unsafe-fp-math"="false" "use-soft-float"="false" }

!llvm.dbg.cu = !{!0}
!llvm.module.flags = !{!114, !115}
!llvm.ident = !{!116}

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !62)
!1 = !DIFile(filename: "Parser/metagrammar.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !61}
!4 = !DISubprogram(name: "_Py_meta_grammar", scope: !1, file: !1, line: 150, type: !5, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: true, function: %struct.grammar* ()* @_Py_meta_grammar, variables: !2)
!5 = !DISubroutineType(types: !6)
!6 = !{!7}
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "grammar", file: !9, line: 67, baseType: !10)
!9 = !DIFile(filename: "Include/grammar.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!10 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 61, size: 320, align: 64, elements: !11)
!11 = !{!12, !14, !47, !59, !60}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "g_ndfas", scope: !10, file: !9, line: 62, baseType: !13, size: 32, align: 32)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "g_dfa", scope: !10, file: !9, line: 63, baseType: !15, size: 64, align: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "dfa", file: !9, line: 57, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 50, size: 320, align: 64, elements: !18)
!18 = !{!19, !20, !23, !24, !25, !44}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !17, file: !9, line: 51, baseType: !13, size: 32, align: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !17, file: !9, line: 52, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "d_initial", scope: !17, file: !9, line: 53, baseType: !13, size: 32, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "d_nstates", scope: !17, file: !9, line: 54, baseType: !13, size: 32, align: 32, offset: 160)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "d_state", scope: !17, file: !9, line: 55, baseType: !26, size: 64, align: 64, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "state", file: !9, line: 46, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 37, size: 320, align: 64, elements: !29)
!29 = !{!30, !31, !39, !40, !41, !43}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "s_narcs", scope: !28, file: !9, line: 38, baseType: !13, size: 32, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "s_arc", scope: !28, file: !9, line: 39, baseType: !32, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc", file: !9, line: 33, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 30, size: 32, align: 16, elements: !35)
!35 = !{!36, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "a_lbl", scope: !34, file: !9, line: 31, baseType: !37, size: 16, align: 16)
!37 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "a_arrow", scope: !34, file: !9, line: 32, baseType: !37, size: 16, align: 16, offset: 16)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "s_lower", scope: !28, file: !9, line: 42, baseType: !13, size: 32, align: 32, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "s_upper", scope: !28, file: !9, line: 43, baseType: !13, size: 32, align: 32, offset: 160)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "s_accel", scope: !28, file: !9, line: 44, baseType: !42, size: 64, align: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "s_accept", scope: !28, file: !9, line: 45, baseType: !13, size: 32, align: 32, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "d_first", scope: !17, file: !9, line: 56, baseType: !45, size: 64, align: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitset", file: !46, line: 12, baseType: !21)
!46 = !DIFile(filename: "Include/bitset.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!47 = !DIDerivedType(tag: DW_TAG_member, name: "g_ll", scope: !10, file: !9, line: 64, baseType: !48, size: 128, align: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "labellist", file: !9, line: 26, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 23, size: 128, align: 64, elements: !50)
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ll_nlabels", scope: !49, file: !9, line: 24, baseType: !13, size: 32, align: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ll_label", scope: !49, file: !9, line: 25, baseType: !53, size: 64, align: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "label", file: !9, line: 17, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 14, size: 128, align: 64, elements: !56)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !55, file: !9, line: 15, baseType: !13, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "lb_str", scope: !55, file: !9, line: 16, baseType: !21, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "g_start", scope: !10, file: !9, line: 65, baseType: !13, size: 32, align: 32, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "g_accel", scope: !10, file: !9, line: 66, baseType: !13, size: 32, align: 32, offset: 288)
!61 = !DISubprogram(name: "Py_meta_grammar", scope: !1, file: !1, line: 156, type: !5, isLocal: false, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: true, function: %struct.grammar* ()* @Py_meta_grammar, variables: !2)
!62 = !{!63, !64, !68, !72, !76, !80, !84, !85, !86, !87, !88, !89, !90, !91, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !106, !107, !108, !109, !110}
!63 = !DIGlobalVariable(name: "_PyParser_Grammar", scope: !0, file: !1, line: 142, type: !8, isLocal: true, isDefinition: true, variable: %struct.grammar* @_PyParser_Grammar)
!64 = !DIGlobalVariable(name: "dfas", scope: !0, file: !1, line: 107, type: !65, isLocal: true, isDefinition: true, variable: [6 x %struct.dfa]* @dfas)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 1920, align: 64, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 6)
!68 = !DIGlobalVariable(name: "states_0", scope: !0, file: !1, line: 14, type: !69, isLocal: true, isDefinition: true, variable: [2 x %struct.state]* @states_0)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 640, align: 64, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 2)
!72 = !DIGlobalVariable(name: "arcs_0_0", scope: !0, file: !1, line: 6, type: !73, isLocal: true, isDefinition: true, variable: [3 x %struct.arc]* @arcs_0_0)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 96, align: 16, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 3)
!76 = !DIGlobalVariable(name: "arcs_0_1", scope: !0, file: !1, line: 11, type: !77, isLocal: true, isDefinition: true, variable: [1 x %struct.arc]* @arcs_0_1)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 32, align: 16, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 1)
!80 = !DIGlobalVariable(name: "states_1", scope: !0, file: !1, line: 33, type: !81, isLocal: true, isDefinition: true, variable: [5 x %struct.state]* @states_1)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1600, align: 64, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 5)
!84 = !DIGlobalVariable(name: "arcs_1_0", scope: !0, file: !1, line: 18, type: !77, isLocal: true, isDefinition: true, variable: [1 x %struct.arc]* @arcs_1_0)
!85 = !DIGlobalVariable(name: "arcs_1_1", scope: !0, file: !1, line: 21, type: !77, isLocal: true, isDefinition: true, variable: [1 x %struct.arc]* @arcs_1_1)
!86 = !DIGlobalVariable(name: "arcs_1_2", scope: !0, file: !1, line: 24, type: !77, isLocal: true, isDefinition: true, variable: [1 x %struct.arc]* @arcs_1_2)
!87 = !DIGlobalVariable(name: "arcs_1_3", scope: !0, file: !1, line: 27, type: !77, isLocal: true, isDefinition: true, variable: [1 x %struct.arc]* @arcs_1_3)
!88 = !DIGlobalVariable(name: "arcs_1_4", scope: !0, file: !1, line: 30, type: !77, isLocal: true, isDefinition: true, variable: [1 x %struct.arc]* @arcs_1_4)
!89 = !DIGlobalVariable(name: "states_2", scope: !0, file: !1, line: 47, type: !69, isLocal: true, isDefinition: true, variable: [2 x %struct.state]* @states_2)
!90 = !DIGlobalVariable(name: "arcs_2_0", scope: !0, file: !1, line: 40, type: !77, isLocal: true, isDefinition: true, variable: [1 x %struct.arc]* @arcs_2_0)
!91 = !DIGlobalVariable(name: "arcs_2_1", scope: !0, file: !1, line: 43, type: !92, isLocal: true, isDefinition: true, variable: [2 x %struct.arc]* @arcs_2_1)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 64, align: 16, elements: !70)
!93 = !DIGlobalVariable(name: "states_3", scope: !0, file: !1, line: 58, type: !69, isLocal: true, isDefinition: true, variable: [2 x %struct.state]* @states_3)
!94 = !DIGlobalVariable(name: "arcs_3_0", scope: !0, file: !1, line: 51, type: !77, isLocal: true, isDefinition: true, variable: [1 x %struct.arc]* @arcs_3_0)
!95 = !DIGlobalVariable(name: "arcs_3_1", scope: !0, file: !1, line: 54, type: !92, isLocal: true, isDefinition: true, variable: [2 x %struct.arc]* @arcs_3_1)
!96 = !DIGlobalVariable(name: "states_4", scope: !0, file: !1, line: 80, type: !81, isLocal: true, isDefinition: true, variable: [5 x %struct.state]* @states_4)
!97 = !DIGlobalVariable(name: "arcs_4_0", scope: !0, file: !1, line: 62, type: !92, isLocal: true, isDefinition: true, variable: [2 x %struct.arc]* @arcs_4_0)
!98 = !DIGlobalVariable(name: "arcs_4_1", scope: !0, file: !1, line: 66, type: !77, isLocal: true, isDefinition: true, variable: [1 x %struct.arc]* @arcs_4_1)
!99 = !DIGlobalVariable(name: "arcs_4_2", scope: !0, file: !1, line: 69, type: !73, isLocal: true, isDefinition: true, variable: [3 x %struct.arc]* @arcs_4_2)
!100 = !DIGlobalVariable(name: "arcs_4_3", scope: !0, file: !1, line: 74, type: !77, isLocal: true, isDefinition: true, variable: [1 x %struct.arc]* @arcs_4_3)
!101 = !DIGlobalVariable(name: "arcs_4_4", scope: !0, file: !1, line: 77, type: !77, isLocal: true, isDefinition: true, variable: [1 x %struct.arc]* @arcs_4_4)
!102 = !DIGlobalVariable(name: "states_5", scope: !0, file: !1, line: 101, type: !103, isLocal: true, isDefinition: true, variable: [4 x %struct.state]* @states_5)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1280, align: 64, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 4)
!106 = !DIGlobalVariable(name: "arcs_5_0", scope: !0, file: !1, line: 87, type: !73, isLocal: true, isDefinition: true, variable: [3 x %struct.arc]* @arcs_5_0)
!107 = !DIGlobalVariable(name: "arcs_5_1", scope: !0, file: !1, line: 92, type: !77, isLocal: true, isDefinition: true, variable: [1 x %struct.arc]* @arcs_5_1)
!108 = !DIGlobalVariable(name: "arcs_5_2", scope: !0, file: !1, line: 95, type: !77, isLocal: true, isDefinition: true, variable: [1 x %struct.arc]* @arcs_5_2)
!109 = !DIGlobalVariable(name: "arcs_5_3", scope: !0, file: !1, line: 98, type: !77, isLocal: true, isDefinition: true, variable: [1 x %struct.arc]* @arcs_5_3)
!110 = !DIGlobalVariable(name: "labels", scope: !0, file: !1, line: 121, type: !111, isLocal: true, isDefinition: true, variable: [19 x %struct.label]* @labels)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 2432, align: 64, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 19)
!114 = !{i32 2, !"Dwarf Version", i32 4}
!115 = !{i32 2, !"Debug Info Version", i32 3}
!116 = !{!"clang version 3.7.0 (tags/RELEASE_370/final)"}
!117 = !DILocation(line: 152, column: 5, scope: !4)
!118 = !DILocation(line: 158, column: 3, scope: !61)
