; ModuleID = 'methodobject.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyCFunctionObject = type { %struct._object, %struct.PyMethodDef*, %struct._object*, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !384, globals: !534)
!1 = !DIFile(filename: "Objects/methodobject.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !44, !360, !100, !374, !375, !376}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionObject", file: !7, line: 80, baseType: !8)
!7 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!8 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 75, size: 320, align: 64, elements: !9)
!9 = !{!10, !355, !358, !359}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !8, file: !7, line: 76, baseType: !11, size: 128, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !12, line: 109, baseType: !13)
!12 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !12, line: 105, size: 128, align: 64, elements: !14)
!14 = !{!15, !23}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !13, file: !12, line: 107, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !17, line: 177, baseType: !18)
!17 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !19, line: 102, baseType: !20)
!19 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !21, line: 181, baseType: !22)
!21 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!22 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !13, file: !12, line: 108, baseType: !24, size: 64, align: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !12, line: 334, size: 3200, align: 64, elements: !26)
!26 = !{!27, !33, !37, !38, !39, !45, !108, !113, !118, !119, !124, !176, !207, !219, !225, !226, !227, !229, !231, !262, !263, !264, !273, !274, !279, !280, !282, !284, !293, !303, !321, !322, !323, !325, !327, !328, !330, !335, !340, !345, !346, !347, !348, !349, !350, !351, !352, !354}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !25, file: !12, line: 335, baseType: !28, size: 192, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !12, line: 114, baseType: !29)
!29 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 111, size: 192, align: 64, elements: !30)
!30 = !{!31, !32}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !29, file: !12, line: 112, baseType: !11, size: 128, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !29, file: !12, line: 113, baseType: !16, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !25, file: !12, line: 336, baseType: !34, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!36 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !25, file: !12, line: 337, baseType: !16, size: 64, align: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !25, file: !12, line: 337, baseType: !16, size: 64, align: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !25, file: !12, line: 341, baseType: !40, size: 64, align: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !12, line: 308, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{null, !44}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !25, file: !12, line: 342, baseType: !46, size: 64, align: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !12, line: 314, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !44, !51, !50}
!50 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !19, line: 48, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !54, line: 246, size: 1728, align: 64, elements: !55)
!54 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!55 = !{!56, !57, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !77, !78, !79, !80, !82, !84, !86, !90, !93, !95, !96, !97, !98, !99, !103, !104}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !53, file: !54, line: 247, baseType: !50, size: 32, align: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !53, file: !54, line: 252, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !53, file: !54, line: 253, baseType: !58, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !53, file: !54, line: 254, baseType: !58, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !53, file: !54, line: 255, baseType: !58, size: 64, align: 64, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !53, file: !54, line: 256, baseType: !58, size: 64, align: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !53, file: !54, line: 257, baseType: !58, size: 64, align: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !53, file: !54, line: 258, baseType: !58, size: 64, align: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !53, file: !54, line: 259, baseType: !58, size: 64, align: 64, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !53, file: !54, line: 261, baseType: !58, size: 64, align: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !53, file: !54, line: 262, baseType: !58, size: 64, align: 64, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !53, file: !54, line: 263, baseType: !58, size: 64, align: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !53, file: !54, line: 265, baseType: !70, size: 64, align: 64, offset: 768)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !54, line: 161, size: 192, align: 64, elements: !72)
!72 = !{!73, !74, !76}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !71, file: !54, line: 162, baseType: !70, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !71, file: !54, line: 163, baseType: !75, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !71, file: !54, line: 167, baseType: !50, size: 32, align: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !53, file: !54, line: 267, baseType: !75, size: 64, align: 64, offset: 832)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !53, file: !54, line: 269, baseType: !50, size: 32, align: 32, offset: 896)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !53, file: !54, line: 273, baseType: !50, size: 32, align: 32, offset: 928)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !53, file: !54, line: 275, baseType: !81, size: 64, align: 64, offset: 960)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !21, line: 140, baseType: !22)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !53, file: !54, line: 279, baseType: !83, size: 16, align: 16, offset: 1024)
!83 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !53, file: !54, line: 280, baseType: !85, size: 8, align: 8, offset: 1040)
!85 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !53, file: !54, line: 281, baseType: !87, size: 8, align: 8, offset: 1048)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 8, align: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 1)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !53, file: !54, line: 285, baseType: !91, size: 64, align: 64, offset: 1088)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !54, line: 155, baseType: null)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !53, file: !54, line: 294, baseType: !94, size: 64, align: 64, offset: 1152)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !21, line: 141, baseType: !22)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !53, file: !54, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !53, file: !54, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !53, file: !54, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !53, file: !54, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !53, file: !54, line: 307, baseType: !100, size: 64, align: 64, offset: 1472)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !101, line: 62, baseType: !102)
!101 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!102 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !53, file: !54, line: 309, baseType: !50, size: 32, align: 32, offset: 1536)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !53, file: !54, line: 311, baseType: !105, size: 160, align: 8, offset: 1568)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 160, align: 8, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 20)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !25, file: !12, line: 343, baseType: !109, size: 64, align: 64, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !12, line: 316, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!44, !44, !58}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !25, file: !12, line: 344, baseType: !114, size: 64, align: 64, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !12, line: 318, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!50, !44, !58, !44}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !25, file: !12, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !25, file: !12, line: 346, baseType: !120, size: 64, align: 64, offset: 704)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !12, line: 320, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!44, !44}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !25, file: !12, line: 350, baseType: !125, size: 64, align: 64, offset: 768)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !12, line: 278, baseType: !127)
!127 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 236, size: 2176, align: 64, elements: !128)
!128 = !{!129, !134, !135, !136, !137, !138, !143, !145, !146, !147, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !127, file: !12, line: 241, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !12, line: 166, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!44, !44, !44}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !127, file: !12, line: 242, baseType: !130, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !127, file: !12, line: 243, baseType: !130, size: 64, align: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !127, file: !12, line: 244, baseType: !130, size: 64, align: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !127, file: !12, line: 245, baseType: !130, size: 64, align: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !127, file: !12, line: 246, baseType: !139, size: 64, align: 64, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !12, line: 167, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!44, !44, !44, !44}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !127, file: !12, line: 247, baseType: !144, size: 64, align: 64, offset: 384)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !12, line: 165, baseType: !121)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !127, file: !12, line: 248, baseType: !144, size: 64, align: 64, offset: 448)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !127, file: !12, line: 249, baseType: !144, size: 64, align: 64, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !127, file: !12, line: 250, baseType: !148, size: 64, align: 64, offset: 576)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !12, line: 168, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!50, !44}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !127, file: !12, line: 251, baseType: !144, size: 64, align: 64, offset: 640)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !127, file: !12, line: 252, baseType: !130, size: 64, align: 64, offset: 704)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !127, file: !12, line: 253, baseType: !130, size: 64, align: 64, offset: 768)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !127, file: !12, line: 254, baseType: !130, size: 64, align: 64, offset: 832)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !127, file: !12, line: 255, baseType: !130, size: 64, align: 64, offset: 896)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !127, file: !12, line: 256, baseType: !130, size: 64, align: 64, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !127, file: !12, line: 257, baseType: !144, size: 64, align: 64, offset: 1024)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !127, file: !12, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !127, file: !12, line: 259, baseType: !144, size: 64, align: 64, offset: 1152)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !127, file: !12, line: 261, baseType: !130, size: 64, align: 64, offset: 1216)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !127, file: !12, line: 262, baseType: !130, size: 64, align: 64, offset: 1280)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !127, file: !12, line: 263, baseType: !130, size: 64, align: 64, offset: 1344)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !127, file: !12, line: 264, baseType: !130, size: 64, align: 64, offset: 1408)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !127, file: !12, line: 265, baseType: !139, size: 64, align: 64, offset: 1472)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !127, file: !12, line: 266, baseType: !130, size: 64, align: 64, offset: 1536)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !127, file: !12, line: 267, baseType: !130, size: 64, align: 64, offset: 1600)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !127, file: !12, line: 268, baseType: !130, size: 64, align: 64, offset: 1664)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !127, file: !12, line: 269, baseType: !130, size: 64, align: 64, offset: 1728)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !127, file: !12, line: 270, baseType: !130, size: 64, align: 64, offset: 1792)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !127, file: !12, line: 272, baseType: !130, size: 64, align: 64, offset: 1856)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !127, file: !12, line: 273, baseType: !130, size: 64, align: 64, offset: 1920)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !127, file: !12, line: 274, baseType: !130, size: 64, align: 64, offset: 1984)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !127, file: !12, line: 275, baseType: !130, size: 64, align: 64, offset: 2048)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !127, file: !12, line: 277, baseType: !144, size: 64, align: 64, offset: 2112)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !25, file: !12, line: 351, baseType: !177, size: 64, align: 64, offset: 832)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !12, line: 292, baseType: !179)
!179 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 280, size: 640, align: 64, elements: !180)
!180 = !{!181, !186, !187, !192, !193, !194, !199, !200, !205, !206}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !179, file: !12, line: 281, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !12, line: 169, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!16, !44}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !179, file: !12, line: 282, baseType: !130, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !179, file: !12, line: 283, baseType: !188, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !12, line: 170, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!44, !44, !16}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !179, file: !12, line: 284, baseType: !188, size: 64, align: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !179, file: !12, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !179, file: !12, line: 286, baseType: !195, size: 64, align: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !12, line: 172, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!50, !44, !16, !44}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !179, file: !12, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !179, file: !12, line: 288, baseType: !201, size: 64, align: 64, offset: 448)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !12, line: 231, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!50, !44, !44}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !179, file: !12, line: 290, baseType: !130, size: 64, align: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !179, file: !12, line: 291, baseType: !188, size: 64, align: 64, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !25, file: !12, line: 352, baseType: !208, size: 64, align: 64, offset: 896)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !12, line: 298, baseType: !210)
!210 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 294, size: 192, align: 64, elements: !211)
!211 = !{!212, !213, !214}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !210, file: !12, line: 295, baseType: !182, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !210, file: !12, line: 296, baseType: !130, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !210, file: !12, line: 297, baseType: !215, size: 64, align: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !12, line: 174, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!50, !44, !44, !44}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !25, file: !12, line: 356, baseType: !220, size: 64, align: 64, offset: 960)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !12, line: 321, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!224, !44}
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !17, line: 186, baseType: !16)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !25, file: !12, line: 357, baseType: !139, size: 64, align: 64, offset: 1024)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !25, file: !12, line: 358, baseType: !120, size: 64, align: 64, offset: 1088)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !25, file: !12, line: 359, baseType: !228, size: 64, align: 64, offset: 1152)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !12, line: 317, baseType: !131)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !25, file: !12, line: 360, baseType: !230, size: 64, align: 64, offset: 1216)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !12, line: 319, baseType: !216)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !25, file: !12, line: 363, baseType: !232, size: 64, align: 64, offset: 1280)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !12, line: 304, baseType: !234)
!234 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 301, size: 128, align: 64, elements: !235)
!235 = !{!236, !257}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !234, file: !12, line: 302, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !12, line: 193, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!50, !44, !241, !50}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !12, line: 191, baseType: !243)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !12, line: 178, size: 640, align: 64, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !254, !255, !256}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !243, file: !12, line: 179, baseType: !4, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !243, file: !12, line: 180, baseType: !44, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !243, file: !12, line: 181, baseType: !16, size: 64, align: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !243, file: !12, line: 182, baseType: !16, size: 64, align: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !243, file: !12, line: 184, baseType: !50, size: 32, align: 32, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !243, file: !12, line: 185, baseType: !50, size: 32, align: 32, offset: 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !243, file: !12, line: 186, baseType: !58, size: 64, align: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !243, file: !12, line: 187, baseType: !253, size: 64, align: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !243, file: !12, line: 188, baseType: !253, size: 64, align: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !243, file: !12, line: 189, baseType: !253, size: 64, align: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !243, file: !12, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !234, file: !12, line: 303, baseType: !258, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !12, line: 194, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !44, !241}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !25, file: !12, line: 366, baseType: !102, size: 64, align: 64, offset: 1344)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !25, file: !12, line: 368, baseType: !34, size: 64, align: 64, offset: 1408)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !25, file: !12, line: 372, baseType: !265, size: 64, align: 64, offset: 1472)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !12, line: 233, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!50, !44, !269, !4}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !12, line: 232, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!50, !44, !4}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !25, file: !12, line: 375, baseType: !148, size: 64, align: 64, offset: 1536)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !25, file: !12, line: 379, baseType: !275, size: 64, align: 64, offset: 1600)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !12, line: 322, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!44, !44, !44, !50}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !25, file: !12, line: 382, baseType: !16, size: 64, align: 64, offset: 1664)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !25, file: !12, line: 385, baseType: !281, size: 64, align: 64, offset: 1728)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !12, line: 323, baseType: !121)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !25, file: !12, line: 386, baseType: !283, size: 64, align: 64, offset: 1792)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !12, line: 324, baseType: !121)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !25, file: !12, line: 389, baseType: !285, size: 64, align: 64, offset: 1856)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !7, line: 40, size: 256, align: 64, elements: !287)
!287 = !{!288, !289, !291, !292}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !286, file: !7, line: 41, baseType: !34, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !286, file: !7, line: 42, baseType: !290, size: 64, align: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !7, line: 18, baseType: !131)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !286, file: !7, line: 43, baseType: !50, size: 32, align: 32, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !286, file: !7, line: 45, baseType: !34, size: 64, align: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !25, file: !12, line: 390, baseType: !294, size: 64, align: 64, offset: 1920)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !296, line: 18, size: 320, align: 64, elements: !297)
!296 = !DIFile(filename: "Include/structmember.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!297 = !{!298, !299, !300, !301, !302}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !295, file: !296, line: 19, baseType: !58, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !295, file: !296, line: 20, baseType: !50, size: 32, align: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !295, file: !296, line: 21, baseType: !16, size: 64, align: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !295, file: !296, line: 22, baseType: !50, size: 32, align: 32, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !295, file: !296, line: 23, baseType: !58, size: 64, align: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !25, file: !12, line: 391, baseType: !304, size: 64, align: 64, offset: 1984)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !306, line: 11, size: 320, align: 64, elements: !307)
!306 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!307 = !{!308, !309, !314, !319, !320}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !305, file: !306, line: 12, baseType: !58, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !305, file: !306, line: 13, baseType: !310, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !306, line: 8, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!44, !44, !4}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !305, file: !306, line: 14, baseType: !315, size: 64, align: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !306, line: 9, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!50, !44, !44, !4}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !305, file: !306, line: 15, baseType: !58, size: 64, align: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !305, file: !306, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !25, file: !12, line: 392, baseType: !24, size: 64, align: 64, offset: 2048)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !25, file: !12, line: 393, baseType: !44, size: 64, align: 64, offset: 2112)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !25, file: !12, line: 394, baseType: !324, size: 64, align: 64, offset: 2176)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !12, line: 325, baseType: !140)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !25, file: !12, line: 395, baseType: !326, size: 64, align: 64, offset: 2240)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !12, line: 326, baseType: !216)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !25, file: !12, line: 396, baseType: !16, size: 64, align: 64, offset: 2304)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !25, file: !12, line: 397, baseType: !329, size: 64, align: 64, offset: 2368)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !12, line: 327, baseType: !216)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !25, file: !12, line: 398, baseType: !331, size: 64, align: 64, offset: 2432)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !12, line: 329, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!44, !24, !16}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !25, file: !12, line: 399, baseType: !336, size: 64, align: 64, offset: 2496)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !12, line: 328, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!44, !24, !44, !44}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !25, file: !12, line: 400, baseType: !341, size: 64, align: 64, offset: 2560)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !12, line: 307, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{null, !4}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !25, file: !12, line: 401, baseType: !148, size: 64, align: 64, offset: 2624)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !25, file: !12, line: 402, baseType: !44, size: 64, align: 64, offset: 2688)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !25, file: !12, line: 403, baseType: !44, size: 64, align: 64, offset: 2752)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !25, file: !12, line: 404, baseType: !44, size: 64, align: 64, offset: 2816)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !25, file: !12, line: 405, baseType: !44, size: 64, align: 64, offset: 2880)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !25, file: !12, line: 406, baseType: !44, size: 64, align: 64, offset: 2944)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !25, file: !12, line: 407, baseType: !40, size: 64, align: 64, offset: 3008)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !25, file: !12, line: 410, baseType: !353, size: 32, align: 32, offset: 3072)
!353 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !25, file: !12, line: 412, baseType: !40, size: 64, align: 64, offset: 3136)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "m_ml", scope: !8, file: !7, line: 77, baseType: !356, size: 64, align: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !7, line: 47, baseType: !286)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "m_self", scope: !8, file: !7, line: 78, baseType: !44, size: 64, align: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "m_module", scope: !8, file: !7, line: 79, baseType: !44, size: 64, align: 64, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !362, line: 253, baseType: !363)
!362 = !DIFile(filename: "Include/objimpl.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!363 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !362, line: 246, size: 192, align: 64, elements: !364)
!364 = !{!365, !372}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !363, file: !362, line: 251, baseType: !366, size: 192, align: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, scope: !363, file: !362, line: 247, size: 192, align: 64, elements: !367)
!367 = !{!368, !370, !371}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !366, file: !362, line: 248, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !366, file: !362, line: 249, baseType: !369, size: 64, align: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !366, file: !362, line: 250, baseType: !16, size: 64, align: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !363, file: !362, line: 252, baseType: !373, size: 64, align: 64)
!373 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionWithKeywords", file: !7, line: 19, baseType: !140)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !378, line: 33, baseType: !379)
!378 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!379 = !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 25, size: 256, align: 64, elements: !380)
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !379, file: !378, line: 26, baseType: !28, size: 192, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !379, file: !378, line: 27, baseType: !383, size: 64, align: 64, offset: 192)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 64, align: 64, elements: !88)
!384 = !{!385, !391, !405, !410, !413, !416, !426, !433, !436, !441, !458, !463, !470, !485, !494, !499, !505, !509, !525, !530}
!385 = !DISubprogram(name: "PyCFunction_New", scope: !1, file: !1, line: 20, type: !386, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyMethodDef*, %struct._object*)* @PyCFunction_New, variables: !388)
!386 = !DISubroutineType(types: !387)
!387 = !{!44, !356, !44}
!388 = !{!389, !390}
!389 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ml", arg: 1, scope: !385, file: !1, line: 20, type: !356)
!390 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 2, scope: !385, file: !1, line: 20, type: !44)
!391 = !DISubprogram(name: "PyCFunction_NewEx", scope: !1, file: !1, line: 26, type: !392, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyMethodDef*, %struct._object*, %struct._object*)* @PyCFunction_NewEx, variables: !394)
!392 = !DISubroutineType(types: !393)
!393 = !{!44, !356, !44, !44}
!394 = !{!395, !396, !397, !398, !399, !401, !403}
!395 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ml", arg: 1, scope: !391, file: !1, line: 26, type: !356)
!396 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 2, scope: !391, file: !1, line: 26, type: !44)
!397 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 3, scope: !391, file: !1, line: 26, type: !44)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !391, file: !1, line: 28, type: !5)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !400, file: !1, line: 41, type: !44)
!400 = distinct !DILexicalBlock(scope: !391, file: !1, line: 41, column: 5)
!401 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !402, file: !1, line: 43, type: !44)
!402 = distinct !DILexicalBlock(scope: !391, file: !1, line: 43, column: 5)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !404, file: !1, line: 45, type: !360)
!404 = distinct !DILexicalBlock(scope: !391, file: !1, line: 45, column: 5)
!405 = !DISubprogram(name: "PyCFunction_GetFunction", scope: !1, file: !1, line: 50, type: !406, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* (%struct._object*)* @PyCFunction_GetFunction, variables: !408)
!406 = !DISubroutineType(types: !407)
!407 = !{!290, !44}
!408 = !{!409}
!409 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !405, file: !1, line: 50, type: !44)
!410 = !DISubprogram(name: "PyCFunction_GetSelf", scope: !1, file: !1, line: 60, type: !122, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyCFunction_GetSelf, variables: !411)
!411 = !{!412}
!412 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !410, file: !1, line: 60, type: !44)
!413 = !DISubprogram(name: "PyCFunction_GetFlags", scope: !1, file: !1, line: 70, type: !150, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @PyCFunction_GetFlags, variables: !414)
!414 = !{!415}
!415 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !413, file: !1, line: 70, type: !44)
!416 = !DISubprogram(name: "PyCFunction_Call", scope: !1, file: !1, line: 80, type: !141, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @PyCFunction_Call, variables: !417)
!417 = !{!418, !419, !420, !421, !422, !423, !424, !425}
!418 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !416, file: !1, line: 80, type: !44)
!419 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !416, file: !1, line: 80, type: !44)
!420 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !416, file: !1, line: 80, type: !44)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !416, file: !1, line: 84, type: !5)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "meth", scope: !416, file: !1, line: 85, type: !290)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !416, file: !1, line: 86, type: !44)
!424 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !416, file: !1, line: 87, type: !44)
!425 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !416, file: !1, line: 88, type: !16)
!426 = !DISubprogram(name: "PyCFunction_ClearFreeList", scope: !1, file: !1, line: 368, type: !427, isLocal: false, isDefinition: true, scopeLine: 369, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @PyCFunction_ClearFreeList, variables: !429)
!427 = !DISubroutineType(types: !428)
!428 = !{!50}
!429 = !{!430, !431}
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "freelist_size", scope: !426, file: !1, line: 370, type: !50)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !432, file: !1, line: 373, type: !5)
!432 = distinct !DILexicalBlock(scope: !426, file: !1, line: 372, column: 23)
!433 = !DISubprogram(name: "PyCFunction_Fini", scope: !1, file: !1, line: 383, type: !434, isLocal: false, isDefinition: true, scopeLine: 384, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyCFunction_Fini, variables: !2)
!434 = !DISubroutineType(types: !435)
!435 = !{null}
!436 = !DISubprogram(name: "_PyCFunction_DebugMallocStats", scope: !1, file: !1, line: 390, type: !437, isLocal: false, isDefinition: true, scopeLine: 391, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IO_FILE*)* @_PyCFunction_DebugMallocStats, variables: !439)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !51}
!439 = !{!440}
!440 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !436, file: !1, line: 390, type: !51)
!441 = !DISubprogram(name: "meth_dealloc", scope: !1, file: !1, line: 147, type: !442, isLocal: true, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyCFunctionObject*)* @meth_dealloc, variables: !444)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !5}
!444 = !{!445, !446, !448, !450, !453, !455}
!445 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !441, file: !1, line: 147, type: !5)
!446 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !447, file: !1, line: 149, type: !360)
!447 = distinct !DILexicalBlock(scope: !441, file: !1, line: 149, column: 5)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !449, file: !1, line: 150, type: !44)
!449 = distinct !DILexicalBlock(scope: !441, file: !1, line: 150, column: 5)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !451, file: !1, line: 150, type: !44)
!451 = distinct !DILexicalBlock(scope: !452, file: !1, line: 150, column: 5)
!452 = distinct !DILexicalBlock(scope: !449, file: !1, line: 150, column: 5)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !454, file: !1, line: 151, type: !44)
!454 = distinct !DILexicalBlock(scope: !441, file: !1, line: 151, column: 5)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !456, file: !1, line: 151, type: !44)
!456 = distinct !DILexicalBlock(scope: !457, file: !1, line: 151, column: 5)
!457 = distinct !DILexicalBlock(scope: !454, file: !1, line: 151, column: 5)
!458 = !DISubprogram(name: "meth_repr", scope: !1, file: !1, line: 272, type: !459, isLocal: true, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyCFunctionObject*)* @meth_repr, variables: !461)
!459 = !DISubroutineType(types: !460)
!460 = !{!44, !5}
!461 = !{!462}
!462 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !458, file: !1, line: 272, type: !5)
!463 = !DISubprogram(name: "meth_hash", scope: !1, file: !1, line: 310, type: !464, isLocal: true, isDefinition: true, scopeLine: 311, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.PyCFunctionObject*)* @meth_hash, variables: !466)
!464 = !DISubroutineType(types: !465)
!465 = !{!224, !5}
!466 = !{!467, !468, !469}
!467 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !463, file: !1, line: 310, type: !5)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !463, file: !1, line: 312, type: !224)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !463, file: !1, line: 312, type: !224)
!470 = !DISubprogram(name: "meth_traverse", scope: !1, file: !1, line: 236, type: !471, isLocal: true, isDefinition: true, scopeLine: 237, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyCFunctionObject*, i32 (%struct._object*, i8*)*, i8*)* @meth_traverse, variables: !473)
!471 = !DISubroutineType(types: !472)
!472 = !{!50, !5, !269, !4}
!473 = !{!474, !475, !476, !477, !481}
!474 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !470, file: !1, line: 236, type: !5)
!475 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !470, file: !1, line: 236, type: !269)
!476 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !470, file: !1, line: 236, type: !4)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !478, file: !1, line: 238, type: !50)
!478 = distinct !DILexicalBlock(scope: !479, file: !1, line: 238, column: 5)
!479 = distinct !DILexicalBlock(scope: !480, file: !1, line: 238, column: 5)
!480 = distinct !DILexicalBlock(scope: !470, file: !1, line: 238, column: 5)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !482, file: !1, line: 239, type: !50)
!482 = distinct !DILexicalBlock(scope: !483, file: !1, line: 239, column: 5)
!483 = distinct !DILexicalBlock(scope: !484, file: !1, line: 239, column: 5)
!484 = distinct !DILexicalBlock(scope: !470, file: !1, line: 239, column: 5)
!485 = !DISubprogram(name: "meth_richcompare", scope: !1, file: !1, line: 284, type: !277, isLocal: true, isDefinition: true, scopeLine: 285, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @meth_richcompare, variables: !486)
!486 = !{!487, !488, !489, !490, !491, !492, !493}
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !485, file: !1, line: 284, type: !44)
!488 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "other", arg: 2, scope: !485, file: !1, line: 284, type: !44)
!489 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !485, file: !1, line: 284, type: !50)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !485, file: !1, line: 286, type: !5)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !485, file: !1, line: 286, type: !5)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !485, file: !1, line: 287, type: !44)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eq", scope: !485, file: !1, line: 288, type: !50)
!494 = !DISubprogram(name: "meth_reduce", scope: !1, file: !1, line: 163, type: !459, isLocal: true, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyCFunctionObject*)* @meth_reduce, variables: !495)
!495 = !{!496, !497, !498}
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !494, file: !1, line: 163, type: !5)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "builtins", scope: !494, file: !1, line: 165, type: !44)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "getattr", scope: !494, file: !1, line: 166, type: !44)
!499 = !DISubprogram(name: "meth_get__doc__", scope: !1, file: !1, line: 189, type: !500, isLocal: true, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyCFunctionObject*, i8*)* @meth_get__doc__, variables: !502)
!500 = !DISubroutineType(types: !501)
!501 = !{!44, !5, !4}
!502 = !{!503, !504}
!503 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !499, file: !1, line: 189, type: !5)
!504 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !499, file: !1, line: 189, type: !4)
!505 = !DISubprogram(name: "meth_get__name__", scope: !1, file: !1, line: 195, type: !500, isLocal: true, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyCFunctionObject*, i8*)* @meth_get__name__, variables: !506)
!506 = !{!507, !508}
!507 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !505, file: !1, line: 195, type: !5)
!508 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !505, file: !1, line: 195, type: !4)
!509 = !DISubprogram(name: "meth_get__qualname__", scope: !1, file: !1, line: 201, type: !500, isLocal: true, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyCFunctionObject*, i8*)* @meth_get__qualname__, variables: !510)
!510 = !{!511, !512, !513, !514, !515, !516, !520, !523}
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !509, file: !1, line: 201, type: !5)
!512 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !509, file: !1, line: 201, type: !4)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !509, file: !1, line: 211, type: !44)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type_qualname", scope: !509, file: !1, line: 211, type: !44)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !509, file: !1, line: 211, type: !44)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !517, file: !1, line: 226, type: !44)
!517 = distinct !DILexicalBlock(scope: !518, file: !1, line: 226, column: 9)
!518 = distinct !DILexicalBlock(scope: !519, file: !1, line: 223, column: 42)
!519 = distinct !DILexicalBlock(scope: !509, file: !1, line: 223, column: 9)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !521, file: !1, line: 226, type: !44)
!521 = distinct !DILexicalBlock(scope: !522, file: !1, line: 226, column: 9)
!522 = distinct !DILexicalBlock(scope: !517, file: !1, line: 226, column: 9)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !524, file: !1, line: 231, type: !44)
!524 = distinct !DILexicalBlock(scope: !509, file: !1, line: 231, column: 5)
!525 = !DISubprogram(name: "meth_get__self__", scope: !1, file: !1, line: 244, type: !500, isLocal: true, isDefinition: true, scopeLine: 245, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyCFunctionObject*, i8*)* @meth_get__self__, variables: !526)
!526 = !{!527, !528, !529}
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !525, file: !1, line: 244, type: !5)
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !525, file: !1, line: 244, type: !4)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !525, file: !1, line: 246, type: !44)
!530 = !DISubprogram(name: "meth_get__text_signature__", scope: !1, file: !1, line: 183, type: !500, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyCFunctionObject*, i8*)* @meth_get__text_signature__, variables: !531)
!531 = !{!532, !533}
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !530, file: !1, line: 183, type: !5)
!533 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !530, file: !1, line: 183, type: !4)
!534 = !{!535, !537, !538, !539, !543, !551, !554, !559}
!535 = !DIGlobalVariable(name: "PyCFunction_Type", scope: !0, file: !1, line: 330, type: !536, isLocal: false, isDefinition: true, variable: %struct._typeobject* @PyCFunction_Type)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !12, line: 422, baseType: !25)
!537 = !DIGlobalVariable(name: "free_list", scope: !0, file: !1, line: 10, type: !5, isLocal: true, isDefinition: true, variable: %struct.PyCFunctionObject** @free_list)
!538 = !DIGlobalVariable(name: "numfree", scope: !0, file: !1, line: 11, type: !50, isLocal: true, isDefinition: true, variable: i32* @numfree)
!539 = !DIGlobalVariable(name: "meth_methods", scope: !0, file: !1, line: 177, type: !540, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMethodDef]* @meth_methods)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 512, align: 64, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 2)
!543 = !DIGlobalVariable(name: "PyId_getattr", scope: !494, file: !1, line: 167, type: !544, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @meth_reduce.PyId_getattr)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !12, line: 144, baseType: !545)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !12, line: 140, size: 192, align: 64, elements: !546)
!546 = !{!547, !549, !550}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !545, file: !12, line: 141, baseType: !548, size: 64, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !545, file: !12, line: 142, baseType: !34, size: 64, align: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !545, file: !12, line: 143, baseType: !44, size: 64, align: 64, offset: 128)
!551 = !DIGlobalVariable(name: "meth_members", scope: !0, file: !1, line: 266, type: !552, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMemberDef]* @meth_members)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 640, align: 64, elements: !541)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !296, line: 24, baseType: !295)
!554 = !DIGlobalVariable(name: "meth_getsets", scope: !0, file: !1, line: 255, type: !555, isLocal: true, isDefinition: true, variable: [6 x %struct.PyGetSetDef]* @meth_getsets)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 1920, align: 64, elements: !557)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !306, line: 17, baseType: !305)
!557 = !{!558}
!558 = !DISubrange(count: 6)
!559 = !DIGlobalVariable(name: "PyId___qualname__", scope: !509, file: !1, line: 212, type: !544, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @meth_get__qualname__.PyId___qualname__)
!560 = !{i32 2, !"Dwarf Version", i32 4}
!561 = !{i32 2, !"Debug Info Version", i32 3}
!562 = !{!"clang version 3.7.0 (tags/RELEASE_370/final)"}
!563 = !DIExpression()
!564 = !DILocation(line: 20, column: 30, scope: !385)
!565 = !DILocation(line: 20, column: 44, scope: !385)
!566 = !DILocation(line: 26, column: 32, scope: !391, inlinedAt: !567)
!567 = distinct !DILocation(line: 22, column: 12, scope: !385)
!568 = !DILocation(line: 26, column: 46, scope: !391, inlinedAt: !567)
!569 = !DILocation(line: 26, column: 62, scope: !391, inlinedAt: !567)
!570 = !DILocation(line: 29, column: 10, scope: !391, inlinedAt: !567)
!571 = !{!572, !572, i64 0}
!572 = !{!"any pointer", !573, i64 0}
!573 = !{!"omnipotent char", !574, i64 0}
!574 = !{!"Simple C/C++ TBAA"}
!575 = !DILocation(line: 28, column: 24, scope: !391, inlinedAt: !567)
!576 = !DILocation(line: 30, column: 12, scope: !577, inlinedAt: !567)
!577 = distinct !DILexicalBlock(scope: !391, file: !1, line: 30, column: 9)
!578 = !DILocation(line: 30, column: 9, scope: !391, inlinedAt: !567)
!579 = !DILocation(line: 31, column: 47, scope: !580, inlinedAt: !567)
!580 = distinct !DILexicalBlock(scope: !577, file: !1, line: 30, column: 21)
!581 = !{!582, !572, i64 24}
!582 = !{!"", !583, i64 0, !572, i64 16, !572, i64 24, !572, i64 32}
!583 = !{!"_object", !584, i64 0, !572, i64 8}
!584 = !{!"long", !573, i64 0}
!585 = !DILocation(line: 31, column: 19, scope: !580, inlinedAt: !567)
!586 = !DILocation(line: 32, column: 15, scope: !580, inlinedAt: !567)
!587 = !{!583, !572, i64 8}
!588 = !{!583, !584, i64 0}
!589 = !DILocation(line: 33, column: 16, scope: !580, inlinedAt: !567)
!590 = !{!591, !591, i64 0}
!591 = !{!"int", !573, i64 0}
!592 = !DILocation(line: 34, column: 5, scope: !580, inlinedAt: !567)
!593 = !DILocation(line: 36, column: 14, scope: !594, inlinedAt: !567)
!594 = distinct !DILexicalBlock(scope: !577, file: !1, line: 35, column: 10)
!595 = !DILocation(line: 37, column: 16, scope: !596, inlinedAt: !567)
!596 = distinct !DILexicalBlock(scope: !594, file: !1, line: 37, column: 13)
!597 = !DILocation(line: 37, column: 13, scope: !594, inlinedAt: !567)
!598 = !DILocation(line: 22, column: 12, scope: !385)
!599 = !DILocation(line: 40, column: 9, scope: !391, inlinedAt: !567)
!600 = !DILocation(line: 40, column: 14, scope: !391, inlinedAt: !567)
!601 = !{!582, !572, i64 16}
!602 = !DILocation(line: 41, column: 5, scope: !603, inlinedAt: !567)
!603 = !DILexicalBlockFile(scope: !400, file: !1, discriminator: 1)
!604 = !DILocation(line: 41, column: 5, scope: !605, inlinedAt: !567)
!605 = distinct !DILexicalBlock(scope: !400, file: !1, line: 41, column: 5)
!606 = !DILocation(line: 41, column: 5, scope: !400, inlinedAt: !567)
!607 = !DILocation(line: 41, column: 5, scope: !608, inlinedAt: !567)
!608 = !DILexicalBlockFile(scope: !605, file: !1, discriminator: 2)
