; ModuleID = 'moduleobject.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !509, globals: !786)
!1 = !DIFile(filename: "Objects/moduleobject.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3, !10}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !11, line: 23, size: 32, align: 32, elements: !12)
!11 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!12 = !{!13, !14, !15, !16, !17}
!13 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!14 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!15 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!16 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!17 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!18 = !{!19, !109, !57, !400, !401, !419, !423, !431, !447, !449, !451}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleObject", file: !1, line: 16, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 9, size: 448, align: 64, elements: !22)
!22 = !{!23, !370, !371, !397, !398, !399}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !21, file: !1, line: 10, baseType: !24, size: 128, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !25, line: 109, baseType: !26)
!25 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !25, line: 105, size: 128, align: 64, elements: !27)
!27 = !{!28, !36}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !26, file: !25, line: 107, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !30, line: 177, baseType: !31)
!30 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !32, line: 102, baseType: !33)
!32 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !34, line: 181, baseType: !35)
!34 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!35 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !26, file: !25, line: 108, baseType: !37, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !25, line: 334, size: 3200, align: 64, elements: !39)
!39 = !{!40, !46, !50, !51, !52, !58, !122, !127, !132, !133, !138, !190, !221, !233, !239, !240, !241, !243, !245, !276, !277, !278, !287, !288, !293, !294, !296, !298, !308, !318, !336, !337, !338, !340, !342, !343, !345, !350, !355, !360, !361, !362, !363, !364, !365, !366, !367, !369}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !38, file: !25, line: 335, baseType: !41, size: 192, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !25, line: 114, baseType: !42)
!42 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 111, size: 192, align: 64, elements: !43)
!43 = !{!44, !45}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !42, file: !25, line: 112, baseType: !24, size: 128, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !42, file: !25, line: 113, baseType: !29, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !38, file: !25, line: 336, baseType: !47, size: 64, align: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!49 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !38, file: !25, line: 337, baseType: !29, size: 64, align: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !38, file: !25, line: 337, baseType: !29, size: 64, align: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !38, file: !25, line: 341, baseType: !53, size: 64, align: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !25, line: 308, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !57}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !38, file: !25, line: 342, baseType: !59, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !25, line: 314, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !57, !64, !63}
!63 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !32, line: 48, baseType: !66)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !67, line: 246, size: 1728, align: 64, elements: !68)
!67 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!68 = !{!69, !70, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !90, !91, !92, !93, !95, !97, !99, !103, !106, !108, !110, !111, !112, !113, !117, !118}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !66, file: !67, line: 247, baseType: !63, size: 32, align: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !66, file: !67, line: 252, baseType: !71, size: 64, align: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !66, file: !67, line: 253, baseType: !71, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !66, file: !67, line: 254, baseType: !71, size: 64, align: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !66, file: !67, line: 255, baseType: !71, size: 64, align: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !66, file: !67, line: 256, baseType: !71, size: 64, align: 64, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !66, file: !67, line: 257, baseType: !71, size: 64, align: 64, offset: 384)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !66, file: !67, line: 258, baseType: !71, size: 64, align: 64, offset: 448)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !66, file: !67, line: 259, baseType: !71, size: 64, align: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !66, file: !67, line: 261, baseType: !71, size: 64, align: 64, offset: 576)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !66, file: !67, line: 262, baseType: !71, size: 64, align: 64, offset: 640)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !66, file: !67, line: 263, baseType: !71, size: 64, align: 64, offset: 704)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !66, file: !67, line: 265, baseType: !83, size: 64, align: 64, offset: 768)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !67, line: 161, size: 192, align: 64, elements: !85)
!85 = !{!86, !87, !89}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !84, file: !67, line: 162, baseType: !83, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !84, file: !67, line: 163, baseType: !88, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !84, file: !67, line: 167, baseType: !63, size: 32, align: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !66, file: !67, line: 267, baseType: !88, size: 64, align: 64, offset: 832)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !66, file: !67, line: 269, baseType: !63, size: 32, align: 32, offset: 896)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !66, file: !67, line: 273, baseType: !63, size: 32, align: 32, offset: 928)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !66, file: !67, line: 275, baseType: !94, size: 64, align: 64, offset: 960)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !34, line: 140, baseType: !35)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !66, file: !67, line: 279, baseType: !96, size: 16, align: 16, offset: 1024)
!96 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !66, file: !67, line: 280, baseType: !98, size: 8, align: 8, offset: 1040)
!98 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !66, file: !67, line: 281, baseType: !100, size: 8, align: 8, offset: 1048)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 8, align: 8, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 1)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !66, file: !67, line: 285, baseType: !104, size: 64, align: 64, offset: 1088)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !67, line: 155, baseType: null)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !66, file: !67, line: 294, baseType: !107, size: 64, align: 64, offset: 1152)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !34, line: 141, baseType: !35)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !66, file: !67, line: 303, baseType: !109, size: 64, align: 64, offset: 1216)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !66, file: !67, line: 304, baseType: !109, size: 64, align: 64, offset: 1280)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !66, file: !67, line: 305, baseType: !109, size: 64, align: 64, offset: 1344)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !66, file: !67, line: 306, baseType: !109, size: 64, align: 64, offset: 1408)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !66, file: !67, line: 307, baseType: !114, size: 64, align: 64, offset: 1472)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !115, line: 62, baseType: !116)
!115 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!116 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !66, file: !67, line: 309, baseType: !63, size: 32, align: 32, offset: 1536)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !66, file: !67, line: 311, baseType: !119, size: 160, align: 8, offset: 1568)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 160, align: 8, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 20)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !38, file: !25, line: 343, baseType: !123, size: 64, align: 64, offset: 512)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !25, line: 316, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!57, !57, !71}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !38, file: !25, line: 344, baseType: !128, size: 64, align: 64, offset: 576)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !25, line: 318, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!63, !57, !71, !57}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !38, file: !25, line: 345, baseType: !109, size: 64, align: 64, offset: 640)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !38, file: !25, line: 346, baseType: !134, size: 64, align: 64, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !25, line: 320, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!57, !57}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !38, file: !25, line: 350, baseType: !139, size: 64, align: 64, offset: 768)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !25, line: 278, baseType: !141)
!141 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 236, size: 2176, align: 64, elements: !142)
!142 = !{!143, !148, !149, !150, !151, !152, !157, !159, !160, !161, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !141, file: !25, line: 241, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !25, line: 166, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!57, !57, !57}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !141, file: !25, line: 242, baseType: !144, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !141, file: !25, line: 243, baseType: !144, size: 64, align: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !141, file: !25, line: 244, baseType: !144, size: 64, align: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !141, file: !25, line: 245, baseType: !144, size: 64, align: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !141, file: !25, line: 246, baseType: !153, size: 64, align: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !25, line: 167, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!57, !57, !57, !57}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !141, file: !25, line: 247, baseType: !158, size: 64, align: 64, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !25, line: 165, baseType: !135)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !141, file: !25, line: 248, baseType: !158, size: 64, align: 64, offset: 448)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !141, file: !25, line: 249, baseType: !158, size: 64, align: 64, offset: 512)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !141, file: !25, line: 250, baseType: !162, size: 64, align: 64, offset: 576)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !25, line: 168, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!63, !57}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !141, file: !25, line: 251, baseType: !158, size: 64, align: 64, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !141, file: !25, line: 252, baseType: !144, size: 64, align: 64, offset: 704)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !141, file: !25, line: 253, baseType: !144, size: 64, align: 64, offset: 768)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !141, file: !25, line: 254, baseType: !144, size: 64, align: 64, offset: 832)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !141, file: !25, line: 255, baseType: !144, size: 64, align: 64, offset: 896)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !141, file: !25, line: 256, baseType: !144, size: 64, align: 64, offset: 960)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !141, file: !25, line: 257, baseType: !158, size: 64, align: 64, offset: 1024)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !141, file: !25, line: 258, baseType: !109, size: 64, align: 64, offset: 1088)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !141, file: !25, line: 259, baseType: !158, size: 64, align: 64, offset: 1152)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !141, file: !25, line: 261, baseType: !144, size: 64, align: 64, offset: 1216)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !141, file: !25, line: 262, baseType: !144, size: 64, align: 64, offset: 1280)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !141, file: !25, line: 263, baseType: !144, size: 64, align: 64, offset: 1344)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !141, file: !25, line: 264, baseType: !144, size: 64, align: 64, offset: 1408)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !141, file: !25, line: 265, baseType: !153, size: 64, align: 64, offset: 1472)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !141, file: !25, line: 266, baseType: !144, size: 64, align: 64, offset: 1536)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !141, file: !25, line: 267, baseType: !144, size: 64, align: 64, offset: 1600)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !141, file: !25, line: 268, baseType: !144, size: 64, align: 64, offset: 1664)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !141, file: !25, line: 269, baseType: !144, size: 64, align: 64, offset: 1728)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !141, file: !25, line: 270, baseType: !144, size: 64, align: 64, offset: 1792)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !141, file: !25, line: 272, baseType: !144, size: 64, align: 64, offset: 1856)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !141, file: !25, line: 273, baseType: !144, size: 64, align: 64, offset: 1920)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !141, file: !25, line: 274, baseType: !144, size: 64, align: 64, offset: 1984)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !141, file: !25, line: 275, baseType: !144, size: 64, align: 64, offset: 2048)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !141, file: !25, line: 277, baseType: !158, size: 64, align: 64, offset: 2112)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !38, file: !25, line: 351, baseType: !191, size: 64, align: 64, offset: 832)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !25, line: 292, baseType: !193)
!193 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 280, size: 640, align: 64, elements: !194)
!194 = !{!195, !200, !201, !206, !207, !208, !213, !214, !219, !220}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !193, file: !25, line: 281, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !25, line: 169, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!29, !57}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !193, file: !25, line: 282, baseType: !144, size: 64, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !193, file: !25, line: 283, baseType: !202, size: 64, align: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !25, line: 170, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!57, !57, !29}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !193, file: !25, line: 284, baseType: !202, size: 64, align: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !193, file: !25, line: 285, baseType: !109, size: 64, align: 64, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !193, file: !25, line: 286, baseType: !209, size: 64, align: 64, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !25, line: 172, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!63, !57, !29, !57}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !193, file: !25, line: 287, baseType: !109, size: 64, align: 64, offset: 384)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !193, file: !25, line: 288, baseType: !215, size: 64, align: 64, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !25, line: 231, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!63, !57, !57}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !193, file: !25, line: 290, baseType: !144, size: 64, align: 64, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !193, file: !25, line: 291, baseType: !202, size: 64, align: 64, offset: 576)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !38, file: !25, line: 352, baseType: !222, size: 64, align: 64, offset: 896)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !25, line: 298, baseType: !224)
!224 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 294, size: 192, align: 64, elements: !225)
!225 = !{!226, !227, !228}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !224, file: !25, line: 295, baseType: !196, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !224, file: !25, line: 296, baseType: !144, size: 64, align: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !224, file: !25, line: 297, baseType: !229, size: 64, align: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !25, line: 174, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!63, !57, !57, !57}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !38, file: !25, line: 356, baseType: !234, size: 64, align: 64, offset: 960)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !25, line: 321, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!238, !57}
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !30, line: 186, baseType: !29)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !38, file: !25, line: 357, baseType: !153, size: 64, align: 64, offset: 1024)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !38, file: !25, line: 358, baseType: !134, size: 64, align: 64, offset: 1088)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !38, file: !25, line: 359, baseType: !242, size: 64, align: 64, offset: 1152)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !25, line: 317, baseType: !145)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !38, file: !25, line: 360, baseType: !244, size: 64, align: 64, offset: 1216)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !25, line: 319, baseType: !230)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !38, file: !25, line: 363, baseType: !246, size: 64, align: 64, offset: 1280)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !25, line: 304, baseType: !248)
!248 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 301, size: 128, align: 64, elements: !249)
!249 = !{!250, !271}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !248, file: !25, line: 302, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !25, line: 193, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!63, !57, !255, !63}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !25, line: 191, baseType: !257)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !25, line: 178, size: 640, align: 64, elements: !258)
!258 = !{!259, !260, !261, !262, !263, !264, !265, !266, !268, !269, !270}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !257, file: !25, line: 179, baseType: !109, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !257, file: !25, line: 180, baseType: !57, size: 64, align: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !257, file: !25, line: 181, baseType: !29, size: 64, align: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !257, file: !25, line: 182, baseType: !29, size: 64, align: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !257, file: !25, line: 184, baseType: !63, size: 32, align: 32, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !257, file: !25, line: 185, baseType: !63, size: 32, align: 32, offset: 288)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !257, file: !25, line: 186, baseType: !71, size: 64, align: 64, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !257, file: !25, line: 187, baseType: !267, size: 64, align: 64, offset: 384)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !257, file: !25, line: 188, baseType: !267, size: 64, align: 64, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !257, file: !25, line: 189, baseType: !267, size: 64, align: 64, offset: 512)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !257, file: !25, line: 190, baseType: !109, size: 64, align: 64, offset: 576)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !248, file: !25, line: 303, baseType: !272, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !25, line: 194, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !57, !255}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !38, file: !25, line: 366, baseType: !116, size: 64, align: 64, offset: 1344)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !38, file: !25, line: 368, baseType: !47, size: 64, align: 64, offset: 1408)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !38, file: !25, line: 372, baseType: !279, size: 64, align: 64, offset: 1472)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !25, line: 233, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!63, !57, !283, !109}
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !25, line: 232, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!63, !57, !109}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !38, file: !25, line: 375, baseType: !162, size: 64, align: 64, offset: 1536)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !38, file: !25, line: 379, baseType: !289, size: 64, align: 64, offset: 1600)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !25, line: 322, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!57, !57, !57, !63}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !38, file: !25, line: 382, baseType: !29, size: 64, align: 64, offset: 1664)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !38, file: !25, line: 385, baseType: !295, size: 64, align: 64, offset: 1728)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !25, line: 323, baseType: !135)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !38, file: !25, line: 386, baseType: !297, size: 64, align: 64, offset: 1792)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !25, line: 324, baseType: !135)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !38, file: !25, line: 389, baseType: !299, size: 64, align: 64, offset: 1856)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !301, line: 40, size: 256, align: 64, elements: !302)
!301 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!302 = !{!303, !304, !306, !307}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !300, file: !301, line: 41, baseType: !47, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !300, file: !301, line: 42, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !301, line: 18, baseType: !145)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !300, file: !301, line: 43, baseType: !63, size: 32, align: 32, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !300, file: !301, line: 45, baseType: !47, size: 64, align: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !38, file: !25, line: 390, baseType: !309, size: 64, align: 64, offset: 1920)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !311, line: 18, size: 320, align: 64, elements: !312)
!311 = !DIFile(filename: "Include/structmember.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!312 = !{!313, !314, !315, !316, !317}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !310, file: !311, line: 19, baseType: !71, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !310, file: !311, line: 20, baseType: !63, size: 32, align: 32, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !310, file: !311, line: 21, baseType: !29, size: 64, align: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !310, file: !311, line: 22, baseType: !63, size: 32, align: 32, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !310, file: !311, line: 23, baseType: !71, size: 64, align: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !38, file: !25, line: 391, baseType: !319, size: 64, align: 64, offset: 1984)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !321, line: 11, size: 320, align: 64, elements: !322)
!321 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!322 = !{!323, !324, !329, !334, !335}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !320, file: !321, line: 12, baseType: !71, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !320, file: !321, line: 13, baseType: !325, size: 64, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !321, line: 8, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!57, !57, !109}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !320, file: !321, line: 14, baseType: !330, size: 64, align: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !321, line: 9, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!63, !57, !57, !109}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !320, file: !321, line: 15, baseType: !71, size: 64, align: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !320, file: !321, line: 16, baseType: !109, size: 64, align: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !38, file: !25, line: 392, baseType: !37, size: 64, align: 64, offset: 2048)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !38, file: !25, line: 393, baseType: !57, size: 64, align: 64, offset: 2112)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !38, file: !25, line: 394, baseType: !339, size: 64, align: 64, offset: 2176)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !25, line: 325, baseType: !154)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !38, file: !25, line: 395, baseType: !341, size: 64, align: 64, offset: 2240)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !25, line: 326, baseType: !230)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !38, file: !25, line: 396, baseType: !29, size: 64, align: 64, offset: 2304)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !38, file: !25, line: 397, baseType: !344, size: 64, align: 64, offset: 2368)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !25, line: 327, baseType: !230)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !38, file: !25, line: 398, baseType: !346, size: 64, align: 64, offset: 2432)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !25, line: 329, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!57, !37, !29}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !38, file: !25, line: 399, baseType: !351, size: 64, align: 64, offset: 2496)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !25, line: 328, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!57, !37, !57, !57}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !38, file: !25, line: 400, baseType: !356, size: 64, align: 64, offset: 2560)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !25, line: 307, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !109}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !38, file: !25, line: 401, baseType: !162, size: 64, align: 64, offset: 2624)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !38, file: !25, line: 402, baseType: !57, size: 64, align: 64, offset: 2688)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !38, file: !25, line: 403, baseType: !57, size: 64, align: 64, offset: 2752)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !38, file: !25, line: 404, baseType: !57, size: 64, align: 64, offset: 2816)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !38, file: !25, line: 405, baseType: !57, size: 64, align: 64, offset: 2880)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !38, file: !25, line: 406, baseType: !57, size: 64, align: 64, offset: 2944)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !38, file: !25, line: 407, baseType: !53, size: 64, align: 64, offset: 3008)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !38, file: !25, line: 410, baseType: !368, size: 32, align: 32, offset: 3072)
!368 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !38, file: !25, line: 412, baseType: !53, size: 64, align: 64, offset: 3136)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "md_dict", scope: !21, file: !1, line: 11, baseType: !57, size: 64, align: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "md_def", scope: !21, file: !1, line: 12, baseType: !372, size: 64, align: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !374, line: 47, size: 832, align: 64, elements: !375)
!374 = !DIFile(filename: "Include/moduleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!375 = !{!376, !387, !388, !389, !390, !393, !394, !395, !396}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !373, file: !374, line: 48, baseType: !377, size: 320, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !374, line: 38, baseType: !378)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !374, line: 33, size: 320, align: 64, elements: !379)
!379 = !{!380, !381, !385, !386}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !378, file: !374, line: 34, baseType: !24, size: 128, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !378, file: !374, line: 35, baseType: !382, size: 64, align: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!57}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !378, file: !374, line: 36, baseType: !29, size: 64, align: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !378, file: !374, line: 37, baseType: !57, size: 64, align: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !373, file: !374, line: 49, baseType: !47, size: 64, align: 64, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !373, file: !374, line: 50, baseType: !47, size: 64, align: 64, offset: 384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !373, file: !374, line: 51, baseType: !29, size: 64, align: 64, offset: 448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !373, file: !374, line: 52, baseType: !391, size: 64, align: 64, offset: 512)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !301, line: 47, baseType: !300)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !373, file: !374, line: 53, baseType: !162, size: 64, align: 64, offset: 576)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !373, file: !374, line: 54, baseType: !279, size: 64, align: 64, offset: 640)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !373, file: !374, line: 55, baseType: !162, size: 64, align: 64, offset: 704)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !373, file: !374, line: 56, baseType: !356, size: 64, align: 64, offset: 768)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "md_state", scope: !21, file: !1, line: 13, baseType: !109, size: 64, align: 64, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "md_weaklist", scope: !21, file: !1, line: 14, baseType: !57, size: 64, align: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "md_name", scope: !21, file: !1, line: 15, baseType: !57, size: 64, align: 64, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !368)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !403)
!403 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !404)
!404 = !{!405, !406, !407, !408, !416}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !403, file: !4, line: 291, baseType: !24, size: 128, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !403, file: !4, line: 292, baseType: !29, size: 64, align: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !403, file: !4, line: 293, baseType: !238, size: 64, align: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !403, file: !4, line: 349, baseType: !409, size: 32, align: 32, offset: 256)
!409 = !DICompositeType(tag: DW_TAG_structure_type, scope: !403, file: !4, line: 294, size: 32, align: 32, elements: !410)
!410 = !{!411, !412, !413, !414, !415}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !409, file: !4, line: 303, baseType: !368, size: 2, align: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !409, file: !4, line: 331, baseType: !368, size: 3, align: 32, offset: 2)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !409, file: !4, line: 336, baseType: !368, size: 1, align: 32, offset: 5)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !409, file: !4, line: 340, baseType: !368, size: 1, align: 32, offset: 6)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !409, file: !4, line: 345, baseType: !368, size: 1, align: 32, offset: 7)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !403, file: !4, line: 350, baseType: !417, size: 64, align: 64, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !115, line: 90, baseType: !63)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !422)
!422 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !425)
!425 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !426)
!426 = !{!427, !428, !429, !430}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !425, file: !4, line: 357, baseType: !402, size: 384, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !425, file: !4, line: 358, baseType: !29, size: 64, align: 64, offset: 384)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !425, file: !4, line: 360, baseType: !71, size: 64, align: 64, offset: 448)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !425, file: !4, line: 361, baseType: !29, size: 64, align: 64, offset: 512)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !433)
!433 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !434)
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !433, file: !4, line: 369, baseType: !424, size: 576, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !433, file: !4, line: 375, baseType: !437, size: 64, align: 64, offset: 576)
!437 = !DICompositeType(tag: DW_TAG_union_type, scope: !433, file: !4, line: 370, size: 64, align: 64, elements: !438)
!438 = !{!439, !440, !442, !445}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !437, file: !4, line: 371, baseType: !109, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !437, file: !4, line: 372, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !437, file: !4, line: 373, baseType: !443, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !96)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !437, file: !4, line: 374, baseType: !446, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !444)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !453, line: 139, baseType: !454)
!453 = !DIFile(filename: "Include/pystate.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !453, line: 69, size: 1536, align: 64, elements: !455)
!455 = !{!456, !458, !459, !479, !482, !483, !484, !485, !486, !487, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !454, file: !453, line: 72, baseType: !457, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !454, file: !453, line: 73, baseType: !457, size: 64, align: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !454, file: !453, line: 74, baseType: !460, size: 64, align: 64, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !453, line: 44, baseType: !462)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !453, line: 19, size: 832, align: 64, elements: !463)
!463 = !{!464, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !462, file: !453, line: 21, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !462, file: !453, line: 22, baseType: !457, size: 64, align: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !462, file: !453, line: 24, baseType: !57, size: 64, align: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !462, file: !453, line: 25, baseType: !57, size: 64, align: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !462, file: !453, line: 26, baseType: !57, size: 64, align: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !462, file: !453, line: 27, baseType: !57, size: 64, align: 64, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !462, file: !453, line: 28, baseType: !57, size: 64, align: 64, offset: 384)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !462, file: !453, line: 30, baseType: !57, size: 64, align: 64, offset: 448)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !462, file: !453, line: 31, baseType: !57, size: 64, align: 64, offset: 512)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !462, file: !453, line: 32, baseType: !57, size: 64, align: 64, offset: 576)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !462, file: !453, line: 33, baseType: !63, size: 32, align: 32, offset: 640)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !462, file: !453, line: 34, baseType: !63, size: 32, align: 32, offset: 672)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !462, file: !453, line: 37, baseType: !63, size: 32, align: 32, offset: 704)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !462, file: !453, line: 43, baseType: !57, size: 64, align: 64, offset: 768)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !454, file: !453, line: 76, baseType: !480, size: 64, align: 64, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !453, line: 50, flags: DIFlagFwdDecl)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !454, file: !453, line: 77, baseType: !63, size: 32, align: 32, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !454, file: !453, line: 78, baseType: !49, size: 8, align: 8, offset: 288)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !454, file: !453, line: 80, baseType: !49, size: 8, align: 8, offset: 296)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !454, file: !453, line: 85, baseType: !63, size: 32, align: 32, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !454, file: !453, line: 86, baseType: !63, size: 32, align: 32, offset: 352)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !454, file: !453, line: 88, baseType: !488, size: 64, align: 64, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !453, line: 54, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!63, !57, !480, !63, !57}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !454, file: !453, line: 89, baseType: !488, size: 64, align: 64, offset: 448)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !454, file: !453, line: 90, baseType: !57, size: 64, align: 64, offset: 512)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !454, file: !453, line: 91, baseType: !57, size: 64, align: 64, offset: 576)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !454, file: !453, line: 93, baseType: !57, size: 64, align: 64, offset: 640)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !454, file: !453, line: 94, baseType: !57, size: 64, align: 64, offset: 704)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !454, file: !453, line: 95, baseType: !57, size: 64, align: 64, offset: 768)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !454, file: !453, line: 97, baseType: !57, size: 64, align: 64, offset: 832)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !454, file: !453, line: 98, baseType: !57, size: 64, align: 64, offset: 896)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !454, file: !453, line: 99, baseType: !57, size: 64, align: 64, offset: 960)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !454, file: !453, line: 101, baseType: !57, size: 64, align: 64, offset: 1024)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !454, file: !453, line: 103, baseType: !63, size: 32, align: 32, offset: 1088)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !454, file: !453, line: 105, baseType: !57, size: 64, align: 64, offset: 1152)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !454, file: !453, line: 106, baseType: !35, size: 64, align: 64, offset: 1216)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !454, file: !453, line: 108, baseType: !63, size: 32, align: 32, offset: 1280)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !454, file: !453, line: 109, baseType: !57, size: 64, align: 64, offset: 1344)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !454, file: !453, line: 134, baseType: !357, size: 64, align: 64, offset: 1408)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !454, file: !453, line: 135, baseType: !109, size: 64, align: 64, offset: 1472)
!509 = !{!510, !516, !525, !600, !604, !609, !617, !622, !629, !634, !639, !643, !665, !680, !695, !715, !724, !729, !732, !746, !760, !776}
!510 = !DISubprogram(name: "PyModule_NewObject", scope: !1, file: !1, line: 61, type: !136, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyModule_NewObject, variables: !511)
!511 = !{!512, !513, !514}
!512 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !510, file: !1, line: 61, type: !57)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !510, file: !1, line: 63, type: !19)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !515, file: !1, line: 78, type: !57)
!515 = distinct !DILexicalBlock(scope: !510, file: !1, line: 78, column: 5)
!516 = !DISubprogram(name: "PyModule_New", scope: !1, file: !1, line: 83, type: !517, isLocal: false, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @PyModule_New, variables: !519)
!517 = !DISubroutineType(types: !518)
!518 = !{!57, !47}
!519 = !{!520, !521, !522, !523}
!520 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !516, file: !1, line: 83, type: !47)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nameobj", scope: !516, file: !1, line: 85, type: !57)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "module", scope: !516, file: !1, line: 85, type: !57)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !524, file: !1, line: 90, type: !57)
!524 = distinct !DILexicalBlock(scope: !516, file: !1, line: 90, column: 5)
!525 = !DISubprogram(name: "PyModule_Create2", scope: !1, file: !1, line: 96, type: !526, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyModuleDef*, i32)* @PyModule_Create2, variables: !528)
!526 = !DISubroutineType(types: !527)
!527 = !{!57, !372, !63}
!528 = !{!529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !541, !544, !547, !548, !554, !560, !567, !569, !573, !575, !579, !581, !583, !585, !587, !593, !596, !598}
!529 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !525, file: !1, line: 96, type: !372)
!530 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module_api_version", arg: 2, scope: !525, file: !1, line: 96, type: !63)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !525, file: !1, line: 98, type: !57)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !525, file: !1, line: 98, type: !57)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !525, file: !1, line: 98, type: !57)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ml", scope: !525, file: !1, line: 99, type: !391)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !525, file: !1, line: 100, type: !47)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !525, file: !1, line: 101, type: !19)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp", scope: !525, file: !1, line: 102, type: !460)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !539, file: !1, line: 115, type: !63)
!539 = distinct !DILexicalBlock(scope: !540, file: !1, line: 114, column: 95)
!540 = distinct !DILexicalBlock(scope: !525, file: !1, line: 114, column: 9)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !542, file: !1, line: 134, type: !71)
!542 = distinct !DILexicalBlock(scope: !543, file: !1, line: 133, column: 37)
!543 = distinct !DILexicalBlock(scope: !525, file: !1, line: 133, column: 9)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !545, file: !1, line: 135, type: !114)
!545 = distinct !DILexicalBlock(scope: !546, file: !1, line: 135, column: 26)
!546 = distinct !DILexicalBlock(scope: !542, file: !1, line: 135, column: 13)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !545, file: !1, line: 135, type: !114)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !549, file: !1, line: 147, type: !57)
!549 = distinct !DILexicalBlock(scope: !550, file: !1, line: 147, column: 13)
!550 = distinct !DILexicalBlock(scope: !551, file: !1, line: 145, column: 27)
!551 = distinct !DILexicalBlock(scope: !552, file: !1, line: 145, column: 13)
!552 = distinct !DILexicalBlock(scope: !553, file: !1, line: 143, column: 29)
!553 = distinct !DILexicalBlock(scope: !525, file: !1, line: 143, column: 9)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !555, file: !1, line: 157, type: !57)
!555 = distinct !DILexicalBlock(scope: !556, file: !1, line: 157, column: 13)
!556 = distinct !DILexicalBlock(scope: !557, file: !1, line: 156, column: 24)
!557 = distinct !DILexicalBlock(scope: !558, file: !1, line: 156, column: 13)
!558 = distinct !DILexicalBlock(scope: !559, file: !1, line: 154, column: 36)
!559 = distinct !DILexicalBlock(scope: !525, file: !1, line: 154, column: 9)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !561, file: !1, line: 166, type: !57)
!561 = distinct !DILexicalBlock(scope: !562, file: !1, line: 166, column: 17)
!562 = distinct !DILexicalBlock(scope: !563, file: !1, line: 162, column: 47)
!563 = distinct !DILexicalBlock(scope: !564, file: !1, line: 161, column: 17)
!564 = distinct !DILexicalBlock(scope: !565, file: !1, line: 160, column: 65)
!565 = distinct !DILexicalBlock(scope: !566, file: !1, line: 160, column: 9)
!566 = distinct !DILexicalBlock(scope: !558, file: !1, line: 160, column: 9)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !568, file: !1, line: 167, type: !57)
!568 = distinct !DILexicalBlock(scope: !562, file: !1, line: 167, column: 17)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !570, file: !1, line: 172, type: !57)
!570 = distinct !DILexicalBlock(scope: !571, file: !1, line: 172, column: 17)
!571 = distinct !DILexicalBlock(scope: !572, file: !1, line: 171, column: 28)
!572 = distinct !DILexicalBlock(scope: !564, file: !1, line: 171, column: 17)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !574, file: !1, line: 173, type: !57)
!574 = distinct !DILexicalBlock(scope: !571, file: !1, line: 173, column: 17)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !576, file: !1, line: 177, type: !57)
!576 = distinct !DILexicalBlock(scope: !577, file: !1, line: 177, column: 17)
!577 = distinct !DILexicalBlock(scope: !578, file: !1, line: 176, column: 63)
!578 = distinct !DILexicalBlock(scope: !564, file: !1, line: 176, column: 17)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !580, file: !1, line: 178, type: !57)
!580 = distinct !DILexicalBlock(scope: !577, file: !1, line: 178, column: 17)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !582, file: !1, line: 179, type: !57)
!582 = distinct !DILexicalBlock(scope: !577, file: !1, line: 179, column: 17)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !584, file: !1, line: 182, type: !57)
!584 = distinct !DILexicalBlock(scope: !564, file: !1, line: 182, column: 13)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !586, file: !1, line: 184, type: !57)
!586 = distinct !DILexicalBlock(scope: !558, file: !1, line: 184, column: 9)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !588, file: !1, line: 189, type: !57)
!588 = distinct !DILexicalBlock(scope: !589, file: !1, line: 189, column: 13)
!589 = distinct !DILexicalBlock(scope: !590, file: !1, line: 188, column: 70)
!590 = distinct !DILexicalBlock(scope: !591, file: !1, line: 188, column: 13)
!591 = distinct !DILexicalBlock(scope: !592, file: !1, line: 186, column: 32)
!592 = distinct !DILexicalBlock(scope: !525, file: !1, line: 186, column: 9)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !594, file: !1, line: 189, type: !57)
!594 = distinct !DILexicalBlock(scope: !595, file: !1, line: 189, column: 13)
!595 = distinct !DILexicalBlock(scope: !588, file: !1, line: 189, column: 13)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !597, file: !1, line: 190, type: !57)
!597 = distinct !DILexicalBlock(scope: !589, file: !1, line: 190, column: 13)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !599, file: !1, line: 193, type: !57)
!599 = distinct !DILexicalBlock(scope: !591, file: !1, line: 193, column: 9)
!600 = !DISubprogram(name: "PyModule_GetDict", scope: !1, file: !1, line: 201, type: !136, isLocal: false, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyModule_GetDict, variables: !601)
!601 = !{!602, !603}
!602 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !600, file: !1, line: 201, type: !57)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !600, file: !1, line: 203, type: !57)
!604 = !DISubprogram(name: "PyModule_GetNameObject", scope: !1, file: !1, line: 215, type: !136, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyModule_GetNameObject, variables: !605)
!605 = !{!606, !607, !608}
!606 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !604, file: !1, line: 215, type: !57)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !604, file: !1, line: 217, type: !57)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !604, file: !1, line: 218, type: !57)
!609 = !DISubprogram(name: "PyModule_GetName", scope: !1, file: !1, line: 236, type: !610, isLocal: false, isDefinition: true, scopeLine: 237, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct._object*)* @PyModule_GetName, variables: !612)
!610 = !DISubroutineType(types: !611)
!611 = !{!47, !57}
!612 = !{!613, !614, !615}
!613 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !609, file: !1, line: 236, type: !57)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !609, file: !1, line: 238, type: !57)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !616, file: !1, line: 241, type: !57)
!616 = distinct !DILexicalBlock(scope: !609, file: !1, line: 241, column: 5)
!617 = !DISubprogram(name: "PyModule_GetFilenameObject", scope: !1, file: !1, line: 246, type: !136, isLocal: false, isDefinition: true, scopeLine: 247, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyModule_GetFilenameObject, variables: !618)
!618 = !{!619, !620, !621}
!619 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !617, file: !1, line: 246, type: !57)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !617, file: !1, line: 248, type: !57)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fileobj", scope: !617, file: !1, line: 249, type: !57)
!622 = !DISubprogram(name: "PyModule_GetFilename", scope: !1, file: !1, line: 267, type: !610, isLocal: false, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct._object*)* @PyModule_GetFilename, variables: !623)
!623 = !{!624, !625, !626, !627}
!624 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !622, file: !1, line: 267, type: !57)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fileobj", scope: !622, file: !1, line: 269, type: !57)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "utf8", scope: !622, file: !1, line: 270, type: !71)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !628, file: !1, line: 275, type: !57)
!628 = distinct !DILexicalBlock(scope: !622, file: !1, line: 275, column: 5)
!629 = !DISubprogram(name: "PyModule_GetDef", scope: !1, file: !1, line: 280, type: !630, isLocal: false, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: true, function: %struct.PyModuleDef* (%struct._object*)* @PyModule_GetDef, variables: !632)
!630 = !DISubroutineType(types: !631)
!631 = !{!372, !57}
!632 = !{!633}
!633 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !629, file: !1, line: 280, type: !57)
!634 = !DISubprogram(name: "PyModule_GetState", scope: !1, file: !1, line: 290, type: !635, isLocal: false, isDefinition: true, scopeLine: 291, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct._object*)* @PyModule_GetState, variables: !637)
!635 = !DISubroutineType(types: !636)
!636 = !{!109, !57}
!637 = !{!638}
!638 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !634, file: !1, line: 290, type: !57)
!639 = !DISubprogram(name: "_PyModule_Clear", scope: !1, file: !1, line: 300, type: !55, isLocal: false, isDefinition: true, scopeLine: 301, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @_PyModule_Clear, variables: !640)
!640 = !{!641, !642}
!641 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !639, file: !1, line: 300, type: !57)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !639, file: !1, line: 302, type: !57)
!643 = !DISubprogram(name: "_PyModule_ClearDict", scope: !1, file: !1, line: 308, type: !55, isLocal: false, isDefinition: true, scopeLine: 309, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @_PyModule_ClearDict, variables: !644)
!644 = !{!645, !646, !647, !648, !649, !657}
!645 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 1, scope: !643, file: !1, line: 308, type: !57)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !643, file: !1, line: 317, type: !29)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !643, file: !1, line: 318, type: !57)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !643, file: !1, line: 318, type: !57)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !650, file: !1, line: 327, type: !47)
!650 = distinct !DILexicalBlock(scope: !651, file: !1, line: 326, column: 41)
!651 = distinct !DILexicalBlock(scope: !652, file: !1, line: 326, column: 21)
!652 = distinct !DILexicalBlock(scope: !653, file: !1, line: 325, column: 53)
!653 = distinct !DILexicalBlock(scope: !654, file: !1, line: 324, column: 17)
!654 = distinct !DILexicalBlock(scope: !655, file: !1, line: 323, column: 55)
!655 = distinct !DILexicalBlock(scope: !656, file: !1, line: 323, column: 13)
!656 = distinct !DILexicalBlock(scope: !643, file: !1, line: 322, column: 48)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !658, file: !1, line: 347, type: !47)
!658 = distinct !DILexicalBlock(scope: !659, file: !1, line: 346, column: 41)
!659 = distinct !DILexicalBlock(scope: !660, file: !1, line: 346, column: 21)
!660 = distinct !DILexicalBlock(scope: !661, file: !1, line: 345, column: 13)
!661 = distinct !DILexicalBlock(scope: !662, file: !1, line: 343, column: 17)
!662 = distinct !DILexicalBlock(scope: !663, file: !1, line: 342, column: 55)
!663 = distinct !DILexicalBlock(scope: !664, file: !1, line: 342, column: 13)
!664 = distinct !DILexicalBlock(scope: !643, file: !1, line: 341, column: 48)
!665 = !DISubprogram(name: "module_init_dict", scope: !1, file: !1, line: 32, type: !666, isLocal: true, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyModuleObject*, %struct._object*, %struct._object*, %struct._object*)* @module_init_dict, variables: !668)
!666 = !DISubroutineType(types: !667)
!667 = !{!63, !19, !57, !57, !57}
!668 = !{!669, !670, !671, !672, !673, !677}
!669 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mod", arg: 1, scope: !665, file: !1, line: 32, type: !19)
!670 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "md_dict", arg: 2, scope: !665, file: !1, line: 32, type: !57)
!671 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 3, scope: !665, file: !1, line: 33, type: !57)
!672 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "doc", arg: 4, scope: !665, file: !1, line: 33, type: !57)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !674, file: !1, line: 52, type: !57)
!674 = distinct !DILexicalBlock(scope: !675, file: !1, line: 52, column: 9)
!675 = distinct !DILexicalBlock(scope: !676, file: !1, line: 50, column: 37)
!676 = distinct !DILexicalBlock(scope: !665, file: !1, line: 50, column: 9)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !678, file: !1, line: 52, type: !57)
!678 = distinct !DILexicalBlock(scope: !679, file: !1, line: 52, column: 9)
!679 = distinct !DILexicalBlock(scope: !674, file: !1, line: 52, column: 9)
!680 = !DISubprogram(name: "module_dealloc", scope: !1, file: !1, line: 388, type: !681, isLocal: true, isDefinition: true, scopeLine: 389, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyModuleObject*)* @module_dealloc, variables: !683)
!681 = !DISubroutineType(types: !682)
!682 = !{null, !19}
!683 = !{!684, !685, !687, !690, !692}
!684 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !680, file: !1, line: 388, type: !19)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !686, file: !1, line: 398, type: !57)
!686 = distinct !DILexicalBlock(scope: !680, file: !1, line: 398, column: 5)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !688, file: !1, line: 398, type: !57)
!688 = distinct !DILexicalBlock(scope: !689, file: !1, line: 398, column: 5)
!689 = distinct !DILexicalBlock(scope: !686, file: !1, line: 398, column: 5)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !691, file: !1, line: 399, type: !57)
!691 = distinct !DILexicalBlock(scope: !680, file: !1, line: 399, column: 5)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !693, file: !1, line: 399, type: !57)
!693 = distinct !DILexicalBlock(scope: !694, file: !1, line: 399, column: 5)
!694 = distinct !DILexicalBlock(scope: !691, file: !1, line: 399, column: 5)
!695 = !DISubprogram(name: "module_repr", scope: !1, file: !1, line: 406, type: !696, isLocal: true, isDefinition: true, scopeLine: 407, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyModuleObject*)* @module_repr, variables: !698)
!696 = !DISubroutineType(types: !697)
!697 = !{!57, !19}
!698 = !{!699, !700, !701, !708, !709, !712, !714}
!699 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !695, file: !1, line: 406, type: !19)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !695, file: !1, line: 408, type: !451)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !702, file: !1, line: 408, type: !703)
!702 = distinct !DILexicalBlock(scope: !695, file: !1, line: 408, column: 29)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64, align: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !11, line: 33, baseType: !705)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !11, line: 31, size: 64, align: 64, elements: !706)
!706 = !{!707}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !705, file: !11, line: 32, baseType: !109, size: 64, align: 64)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !702, file: !1, line: 408, type: !109)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !702, file: !1, line: 408, type: !710)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64, align: 64)
!711 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !109)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !702, file: !1, line: 408, type: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !11, line: 29, baseType: !10)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp", scope: !695, file: !1, line: 409, type: !460)
!715 = !DISubprogram(name: "_Py_ANNOTATE_MEMORY_ORDER", scope: !11, file: !11, line: 59, type: !716, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, variables: !721)
!716 = !DISubroutineType(types: !717)
!717 = !{null, !718, !713}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64, align: 64)
!719 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!721 = !{!722, !723}
!722 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "address", arg: 1, scope: !715, file: !11, line: 59, type: !718)
!723 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 2, scope: !715, file: !11, line: 59, type: !713)
!724 = !DISubprogram(name: "_Py_atomic_thread_fence", scope: !11, file: !11, line: 51, type: !725, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, variables: !727)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !713}
!727 = !{!728}
!728 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !724, file: !11, line: 51, type: !713)
!729 = !DISubprogram(name: "_Py_atomic_signal_fence", scope: !11, file: !11, line: 44, type: !725, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, variables: !730)
!730 = !{!731}
!731 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !729, file: !11, line: 44, type: !713)
!732 = !DISubprogram(name: "module_traverse", scope: !1, file: !1, line: 415, type: !733, isLocal: true, isDefinition: true, scopeLine: 416, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyModuleObject*, i32 (%struct._object*, i8*)*, i8*)* @module_traverse, variables: !735)
!733 = !DISubroutineType(types: !734)
!734 = !{!63, !19, !283, !109}
!735 = !{!736, !737, !738, !739, !742}
!736 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !732, file: !1, line: 415, type: !19)
!737 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !732, file: !1, line: 415, type: !283)
!738 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !732, file: !1, line: 415, type: !109)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !740, file: !1, line: 418, type: !63)
!740 = distinct !DILexicalBlock(scope: !741, file: !1, line: 417, column: 45)
!741 = distinct !DILexicalBlock(scope: !732, file: !1, line: 417, column: 9)
!742 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !743, file: !1, line: 422, type: !63)
!743 = distinct !DILexicalBlock(scope: !744, file: !1, line: 422, column: 5)
!744 = distinct !DILexicalBlock(scope: !745, file: !1, line: 422, column: 5)
!745 = distinct !DILexicalBlock(scope: !732, file: !1, line: 422, column: 5)
!746 = !DISubprogram(name: "module_clear", scope: !1, file: !1, line: 427, type: !747, isLocal: true, isDefinition: true, scopeLine: 428, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyModuleObject*)* @module_clear, variables: !749)
!747 = !DISubroutineType(types: !748)
!748 = !{!63, !19}
!749 = !{!750, !751, !754, !756}
!750 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !746, file: !1, line: 427, type: !19)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !752, file: !1, line: 430, type: !63)
!752 = distinct !DILexicalBlock(scope: !753, file: !1, line: 429, column: 42)
!753 = distinct !DILexicalBlock(scope: !746, file: !1, line: 429, column: 9)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !755, file: !1, line: 434, type: !57)
!755 = distinct !DILexicalBlock(scope: !746, file: !1, line: 434, column: 5)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !757, file: !1, line: 434, type: !57)
!757 = distinct !DILexicalBlock(scope: !758, file: !1, line: 434, column: 5)
!758 = distinct !DILexicalBlock(scope: !759, file: !1, line: 434, column: 5)
!759 = distinct !DILexicalBlock(scope: !755, file: !1, line: 434, column: 5)
!760 = !DISubprogram(name: "module_dir", scope: !1, file: !1, line: 439, type: !146, isLocal: true, isDefinition: true, scopeLine: 440, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @module_dir, variables: !761)
!761 = !{!762, !763, !764, !765, !766, !771, !773}
!762 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !760, file: !1, line: 439, type: !57)
!763 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !760, file: !1, line: 439, type: !57)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !760, file: !1, line: 442, type: !57)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !760, file: !1, line: 443, type: !57)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !767, file: !1, line: 449, type: !47)
!767 = distinct !DILexicalBlock(scope: !768, file: !1, line: 448, column: 14)
!768 = distinct !DILexicalBlock(scope: !769, file: !1, line: 446, column: 13)
!769 = distinct !DILexicalBlock(scope: !770, file: !1, line: 445, column: 23)
!770 = distinct !DILexicalBlock(scope: !760, file: !1, line: 445, column: 9)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !772, file: !1, line: 457, type: !57)
!772 = distinct !DILexicalBlock(scope: !760, file: !1, line: 457, column: 5)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !774, file: !1, line: 457, type: !57)
!774 = distinct !DILexicalBlock(scope: !775, file: !1, line: 457, column: 5)
!775 = distinct !DILexicalBlock(scope: !772, file: !1, line: 457, column: 5)
!776 = !DISubprogram(name: "module_init", scope: !1, file: !1, line: 368, type: !777, isLocal: true, isDefinition: true, scopeLine: 369, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyModuleObject*, %struct._object*, %struct._object*)* @module_init, variables: !779)
!777 = !DISubroutineType(types: !778)
!778 = !{!63, !19, !57, !57}
!779 = !{!780, !781, !782, !783, !784, !785}
!780 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !776, file: !1, line: 368, type: !19)
!781 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !776, file: !1, line: 368, type: !57)
!782 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !776, file: !1, line: 368, type: !57)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !776, file: !1, line: 371, type: !57)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !776, file: !1, line: 371, type: !57)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "doc", scope: !776, file: !1, line: 371, type: !57)
!786 = !{!787, !789, !790, !791, !795, !799, !807, !810}
!787 = !DIGlobalVariable(name: "PyModule_Type", scope: !0, file: !1, line: 474, type: !788, isLocal: false, isDefinition: true, variable: { %struct.PyVarObject, i8*, i64, i64, void (%struct._object*)*, i32 (%struct._object*, %struct._IO_FILE*, i32)*, %struct._object* (%struct._object*, i8*)*, i32 (%struct._object*, i8*, %struct._object*)*, i8*, %struct._object* (%struct._object*)*, %struct.PyNumberMethods*, %struct.PySequenceMethods*, %struct.PyMappingMethods*, i64 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*)*, i32 (%struct._object*, %struct._object*, %struct._object*)*, %struct.PyBufferProcs*, i64, i8*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, i32)*, i64, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*)*, %struct.PyMethodDef*, %struct.PyMemberDef*, %struct.PyGetSetDef*, %struct._typeobject*, %struct._object*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, i32 (%struct._object*, %struct._object*, %struct._object*)*, i64, i32 (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._typeobject*, i64)*, %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)*, void (i8*)*, i32 (%struct._object*)*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, void (%struct._object*)*, i32, void (%struct._object*)* }* @PyModule_Type)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !25, line: 422, baseType: !38)
!789 = !DIGlobalVariable(name: "max_module_number", scope: !0, file: !1, line: 7, type: !29, isLocal: true, isDefinition: true, variable: i64* @max_module_number)
!790 = !DIGlobalVariable(name: "moduledef_type", scope: !0, file: !1, line: 23, type: !788, isLocal: true, isDefinition: true, variable: { %struct.PyVarObject, i8*, i64, i64, void (%struct._object*)*, i32 (%struct._object*, %struct._IO_FILE*, i32)*, %struct._object* (%struct._object*, i8*)*, i32 (%struct._object*, i8*, %struct._object*)*, i8*, %struct._object* (%struct._object*)*, %struct.PyNumberMethods*, %struct.PySequenceMethods*, %struct.PyMappingMethods*, i64 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*)*, i32 (%struct._object*, %struct._object*, %struct._object*)*, %struct.PyBufferProcs*, i64, i8*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, i32)*, i64, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*)*, %struct.PyMethodDef*, %struct.PyMemberDef*, %struct.PyGetSetDef*, %struct._typeobject*, %struct._object*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, i32 (%struct._object*, %struct._object*, %struct._object*)*, i64, i32 (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._typeobject*, i64)*, %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)*, void (i8*)*, i32 (%struct._object*)*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, void (%struct._object*)*, i32, void (%struct._object*)* }* @moduledef_type)
!791 = !DIGlobalVariable(name: "module_doc", scope: !0, file: !1, line: 468, type: !792, isLocal: true, isDefinition: true, variable: [117 x i8]* @module_doc)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 936, align: 8, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 117)
!795 = !DIGlobalVariable(name: "module_methods", scope: !0, file: !1, line: 461, type: !796, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMethodDef]* @module_methods)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 512, align: 64, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 2)
!799 = !DIGlobalVariable(name: "PyId___dict__", scope: !760, file: !1, line: 441, type: !800, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @module_dir.PyId___dict__)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !25, line: 144, baseType: !801)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !25, line: 140, size: 192, align: 64, elements: !802)
!802 = !{!803, !805, !806}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !801, file: !25, line: 141, baseType: !804, size: 64, align: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64, align: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !801, file: !25, line: 142, baseType: !47, size: 64, align: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !801, file: !25, line: 143, baseType: !57, size: 64, align: 64, offset: 128)
!807 = !DIGlobalVariable(name: "module_members", scope: !0, file: !1, line: 18, type: !808, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMemberDef]* @module_members)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !809, size: 640, align: 64, elements: !797)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !311, line: 24, baseType: !310)
!810 = !DIGlobalVariable(name: "kwlist", scope: !776, file: !1, line: 370, type: !811, isLocal: true, isDefinition: true, variable: [3 x i8*]* @module_init.kwlist)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 192, align: 64, elements: !812)
!812 = !{!813}
!813 = !DISubrange(count: 3)
!814 = !{i32 2, !"Dwarf Version", i32 4}
!815 = !{i32 2, !"Debug Info Version", i32 3}
!816 = !{!"clang version 3.7.0 (tags/RELEASE_370/final)"}
!817 = !DIExpression()
!818 = !DILocation(line: 61, column: 30, scope: !510)
!819 = !DILocation(line: 64, column: 9, scope: !510)
!820 = !DILocation(line: 63, column: 21, scope: !510)
!821 = !DILocation(line: 65, column: 11, scope: !822)
!822 = distinct !DILexicalBlock(scope: !510, file: !1, line: 65, column: 9)
!823 = !DILocation(line: 65, column: 9, scope: !510)
!824 = !DILocation(line: 67, column: 8, scope: !510)
!825 = !DILocation(line: 71, column: 18, scope: !510)
!826 = !DILocation(line: 68, column: 17, scope: !510)
!827 = !DILocation(line: 71, column: 8, scope: !510)
!828 = !DILocation(line: 71, column: 16, scope: !510)
!829 = !{!830, !835, i64 16}
!830 = !{!"", !831, i64 0, !835, i64 16, !835, i64 24, !835, i64 32, !835, i64 40, !835, i64 48}
!831 = !{!"_object", !832, i64 0, !835, i64 8}
!832 = !{!"long", !833, i64 0}
!833 = !{!"omnipotent char", !834, i64 0}
!834 = !{!"Simple C/C++ TBAA"}
!835 = !{!"any pointer", !833, i64 0}
!836 = !DILocation(line: 72, column: 9, scope: !837)
!837 = distinct !DILexicalBlock(scope: !510, file: !1, line: 72, column: 9)
!838 = !DILocation(line: 72, column: 53, scope: !837)
!839 = !DILocation(line: 72, column: 9, scope: !510)
!840 = !DILocation(line: 74, column: 23, scope: !510)
!841 = !DILocation(line: 74, column: 5, scope: !510)
!842 = !DILocation(line: 75, column: 5, scope: !510)
!843 = !DILocation(line: 78, column: 5, scope: !844)
!844 = !DILexicalBlockFile(scope: !515, file: !1, discriminator: 1)
!845 = !DILocation(line: 78, column: 5, scope: !846)
!846 = distinct !DILexicalBlock(scope: !515, file: !1, line: 78, column: 5)
!847 = !{!831, !832, i64 0}
!848 = !DILocation(line: 78, column: 5, scope: !515)
!849 = !DILocation(line: 78, column: 5, scope: !850)
!850 = !DILexicalBlockFile(scope: !846, file: !1, discriminator: 3)
!851 = !{!831, !835, i64 8}
!852 = !{!853, !835, i64 48}
!853 = !{!"_typeobject", !854, i64 0, !835, i64 24, !832, i64 32, !832, i64 40, !835, i64 48, !835, i64 56, !835, i64 64, !835, i64 72, !835, i64 80, !835, i64 88, !835, i64 96, !835, i64 104, !835, i64 112, !835, i64 120, !835, i64 128, !835, i64 136, !835, i64 144, !835, i64 152, !835, i64 160, !832, i64 168, !835, i64 176, !835, i64 184, !835, i64 192, !835, i64 200, !832, i64 208, !835, i64 216, !835, i64 224, !835, i64 232, !835, i64 240, !835, i64 248, !835, i64 256, !835, i64 264, !835, i64 272, !835, i64 280, !832, i64 288, !835, i64 296, !835, i64 304, !835, i64 312, !835, i64 320, !835, i64 328, !835, i64 336, !835, i64 344, !835, i64 352, !835, i64 360, !835, i64 368, !835, i64 376, !855, i64 384, !835, i64 392}
!854 = !{!"", !831, i64 0, !832, i64 16}
!855 = !{!"int", !833, i64 0}
!856 = !DILocation(line: 80, column: 1, scope: !510)
!857 = !DILocation(line: 32, column: 34, scope: !665)
!858 = !DILocation(line: 32, column: 49, scope: !665)
!859 = !DILocation(line: 33, column: 28, scope: !665)
!860 = !DILocation(line: 33, column: 44, scope: !665)
!861 = !DILocation(line: 35, column: 17, scope: !862)
