; ModuleID = 'object.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !16, subprograms: !519, globals: !1109)
!1 = !DIFile(filename: "Objects/object.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3, !8}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 190, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pystate.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "PyGILState_LOCKED", value: 0)
!7 = !DIEnumerator(name: "PyGILState_UNLOCKED", value: 1)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !9, line: 23, size: 32, align: 32, elements: !10)
!9 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!10 = !{!11, !12, !13, !14, !15}
!11 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!12 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!13 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!14 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!15 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!16 = !{!17, !102, !356, !107, !357, !29, !371, !379, !398, !64, !463, !56, !511}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !19, line: 109, baseType: !20)
!19 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !19, line: 105, size: 128, align: 64, elements: !21)
!21 = !{!22, !30}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !20, file: !19, line: 107, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !24, line: 177, baseType: !25)
!24 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !26, line: 102, baseType: !27)
!26 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !28, line: 181, baseType: !29)
!28 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!29 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !20, file: !19, line: 108, baseType: !31, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !19, line: 334, size: 3200, align: 64, elements: !33)
!33 = !{!34, !40, !44, !45, !46, !51, !115, !120, !125, !126, !131, !183, !214, !226, !232, !233, !234, !236, !238, !269, !270, !271, !280, !281, !286, !287, !289, !291, !301, !304, !322, !323, !324, !326, !328, !329, !331, !336, !341, !346, !347, !348, !349, !350, !351, !352, !353, !355}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !32, file: !19, line: 335, baseType: !35, size: 192, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !19, line: 114, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 111, size: 192, align: 64, elements: !37)
!37 = !{!38, !39}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !36, file: !19, line: 112, baseType: !18, size: 128, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !36, file: !19, line: 113, baseType: !23, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !32, file: !19, line: 336, baseType: !41, size: 64, align: 64, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!43 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !32, file: !19, line: 337, baseType: !23, size: 64, align: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !32, file: !19, line: 337, baseType: !23, size: 64, align: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !32, file: !19, line: 341, baseType: !47, size: 64, align: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !19, line: 308, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !17}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !32, file: !19, line: 342, baseType: !52, size: 64, align: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !19, line: 314, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !17, !57, !56}
!56 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !26, line: 48, baseType: !59)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 246, size: 1728, align: 64, elements: !61)
!60 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!61 = !{!62, !63, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !83, !84, !85, !86, !88, !90, !92, !96, !99, !101, !103, !104, !105, !106, !110, !111}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !59, file: !60, line: 247, baseType: !56, size: 32, align: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !59, file: !60, line: 252, baseType: !64, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !59, file: !60, line: 253, baseType: !64, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !59, file: !60, line: 254, baseType: !64, size: 64, align: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !59, file: !60, line: 255, baseType: !64, size: 64, align: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !59, file: !60, line: 256, baseType: !64, size: 64, align: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !59, file: !60, line: 257, baseType: !64, size: 64, align: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !59, file: !60, line: 258, baseType: !64, size: 64, align: 64, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !59, file: !60, line: 259, baseType: !64, size: 64, align: 64, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !59, file: !60, line: 261, baseType: !64, size: 64, align: 64, offset: 576)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !59, file: !60, line: 262, baseType: !64, size: 64, align: 64, offset: 640)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !59, file: !60, line: 263, baseType: !64, size: 64, align: 64, offset: 704)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !59, file: !60, line: 265, baseType: !76, size: 64, align: 64, offset: 768)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !60, line: 161, size: 192, align: 64, elements: !78)
!78 = !{!79, !80, !82}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !77, file: !60, line: 162, baseType: !76, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !77, file: !60, line: 163, baseType: !81, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !77, file: !60, line: 167, baseType: !56, size: 32, align: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !59, file: !60, line: 267, baseType: !81, size: 64, align: 64, offset: 832)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !59, file: !60, line: 269, baseType: !56, size: 32, align: 32, offset: 896)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !59, file: !60, line: 273, baseType: !56, size: 32, align: 32, offset: 928)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !59, file: !60, line: 275, baseType: !87, size: 64, align: 64, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !28, line: 140, baseType: !29)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !59, file: !60, line: 279, baseType: !89, size: 16, align: 16, offset: 1024)
!89 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !59, file: !60, line: 280, baseType: !91, size: 8, align: 8, offset: 1040)
!91 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !59, file: !60, line: 281, baseType: !93, size: 8, align: 8, offset: 1048)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, align: 8, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 1)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !59, file: !60, line: 285, baseType: !97, size: 64, align: 64, offset: 1088)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !60, line: 155, baseType: null)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !59, file: !60, line: 294, baseType: !100, size: 64, align: 64, offset: 1152)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !28, line: 141, baseType: !29)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !59, file: !60, line: 303, baseType: !102, size: 64, align: 64, offset: 1216)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !59, file: !60, line: 304, baseType: !102, size: 64, align: 64, offset: 1280)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !59, file: !60, line: 305, baseType: !102, size: 64, align: 64, offset: 1344)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !59, file: !60, line: 306, baseType: !102, size: 64, align: 64, offset: 1408)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !59, file: !60, line: 307, baseType: !107, size: 64, align: 64, offset: 1472)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 62, baseType: !109)
!108 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!109 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !59, file: !60, line: 309, baseType: !56, size: 32, align: 32, offset: 1536)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !59, file: !60, line: 311, baseType: !112, size: 160, align: 8, offset: 1568)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, align: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 20)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !32, file: !19, line: 343, baseType: !116, size: 64, align: 64, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !19, line: 316, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!17, !17, !64}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !32, file: !19, line: 344, baseType: !121, size: 64, align: 64, offset: 576)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !19, line: 318, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!56, !17, !64, !17}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !32, file: !19, line: 345, baseType: !102, size: 64, align: 64, offset: 640)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !32, file: !19, line: 346, baseType: !127, size: 64, align: 64, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !19, line: 320, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!17, !17}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !32, file: !19, line: 350, baseType: !132, size: 64, align: 64, offset: 768)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !19, line: 278, baseType: !134)
!134 = !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 236, size: 2176, align: 64, elements: !135)
!135 = !{!136, !141, !142, !143, !144, !145, !150, !152, !153, !154, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !134, file: !19, line: 241, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !19, line: 166, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!17, !17, !17}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !134, file: !19, line: 242, baseType: !137, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !134, file: !19, line: 243, baseType: !137, size: 64, align: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !134, file: !19, line: 244, baseType: !137, size: 64, align: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !134, file: !19, line: 245, baseType: !137, size: 64, align: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !134, file: !19, line: 246, baseType: !146, size: 64, align: 64, offset: 320)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !19, line: 167, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!17, !17, !17, !17}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !134, file: !19, line: 247, baseType: !151, size: 64, align: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !19, line: 165, baseType: !128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !134, file: !19, line: 248, baseType: !151, size: 64, align: 64, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !134, file: !19, line: 249, baseType: !151, size: 64, align: 64, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !134, file: !19, line: 250, baseType: !155, size: 64, align: 64, offset: 576)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !19, line: 168, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!56, !17}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !134, file: !19, line: 251, baseType: !151, size: 64, align: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !134, file: !19, line: 252, baseType: !137, size: 64, align: 64, offset: 704)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !134, file: !19, line: 253, baseType: !137, size: 64, align: 64, offset: 768)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !134, file: !19, line: 254, baseType: !137, size: 64, align: 64, offset: 832)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !134, file: !19, line: 255, baseType: !137, size: 64, align: 64, offset: 896)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !134, file: !19, line: 256, baseType: !137, size: 64, align: 64, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !134, file: !19, line: 257, baseType: !151, size: 64, align: 64, offset: 1024)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !134, file: !19, line: 258, baseType: !102, size: 64, align: 64, offset: 1088)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !134, file: !19, line: 259, baseType: !151, size: 64, align: 64, offset: 1152)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !134, file: !19, line: 261, baseType: !137, size: 64, align: 64, offset: 1216)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !134, file: !19, line: 262, baseType: !137, size: 64, align: 64, offset: 1280)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !134, file: !19, line: 263, baseType: !137, size: 64, align: 64, offset: 1344)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !134, file: !19, line: 264, baseType: !137, size: 64, align: 64, offset: 1408)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !134, file: !19, line: 265, baseType: !146, size: 64, align: 64, offset: 1472)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !134, file: !19, line: 266, baseType: !137, size: 64, align: 64, offset: 1536)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !134, file: !19, line: 267, baseType: !137, size: 64, align: 64, offset: 1600)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !134, file: !19, line: 268, baseType: !137, size: 64, align: 64, offset: 1664)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !134, file: !19, line: 269, baseType: !137, size: 64, align: 64, offset: 1728)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !134, file: !19, line: 270, baseType: !137, size: 64, align: 64, offset: 1792)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !134, file: !19, line: 272, baseType: !137, size: 64, align: 64, offset: 1856)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !134, file: !19, line: 273, baseType: !137, size: 64, align: 64, offset: 1920)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !134, file: !19, line: 274, baseType: !137, size: 64, align: 64, offset: 1984)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !134, file: !19, line: 275, baseType: !137, size: 64, align: 64, offset: 2048)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !134, file: !19, line: 277, baseType: !151, size: 64, align: 64, offset: 2112)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !32, file: !19, line: 351, baseType: !184, size: 64, align: 64, offset: 832)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !19, line: 292, baseType: !186)
!186 = !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 280, size: 640, align: 64, elements: !187)
!187 = !{!188, !193, !194, !199, !200, !201, !206, !207, !212, !213}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !186, file: !19, line: 281, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !19, line: 169, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!23, !17}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !186, file: !19, line: 282, baseType: !137, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !186, file: !19, line: 283, baseType: !195, size: 64, align: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !19, line: 170, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!17, !17, !23}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !186, file: !19, line: 284, baseType: !195, size: 64, align: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !186, file: !19, line: 285, baseType: !102, size: 64, align: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !186, file: !19, line: 286, baseType: !202, size: 64, align: 64, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !19, line: 172, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!56, !17, !23, !17}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !186, file: !19, line: 287, baseType: !102, size: 64, align: 64, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !186, file: !19, line: 288, baseType: !208, size: 64, align: 64, offset: 448)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !19, line: 231, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!56, !17, !17}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !186, file: !19, line: 290, baseType: !137, size: 64, align: 64, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !186, file: !19, line: 291, baseType: !195, size: 64, align: 64, offset: 576)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !32, file: !19, line: 352, baseType: !215, size: 64, align: 64, offset: 896)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !19, line: 298, baseType: !217)
!217 = !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 294, size: 192, align: 64, elements: !218)
!218 = !{!219, !220, !221}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !217, file: !19, line: 295, baseType: !189, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !217, file: !19, line: 296, baseType: !137, size: 64, align: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !217, file: !19, line: 297, baseType: !222, size: 64, align: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !19, line: 174, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!56, !17, !17, !17}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !32, file: !19, line: 356, baseType: !227, size: 64, align: 64, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !19, line: 321, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!231, !17}
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !24, line: 186, baseType: !23)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !32, file: !19, line: 357, baseType: !146, size: 64, align: 64, offset: 1024)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !32, file: !19, line: 358, baseType: !127, size: 64, align: 64, offset: 1088)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !32, file: !19, line: 359, baseType: !235, size: 64, align: 64, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !19, line: 317, baseType: !138)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !32, file: !19, line: 360, baseType: !237, size: 64, align: 64, offset: 1216)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !19, line: 319, baseType: !223)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !32, file: !19, line: 363, baseType: !239, size: 64, align: 64, offset: 1280)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !19, line: 304, baseType: !241)
!241 = !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 301, size: 128, align: 64, elements: !242)
!242 = !{!243, !264}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !241, file: !19, line: 302, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !19, line: 193, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!56, !17, !248, !56}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !19, line: 191, baseType: !250)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !19, line: 178, size: 640, align: 64, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !261, !262, !263}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !250, file: !19, line: 179, baseType: !102, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !250, file: !19, line: 180, baseType: !17, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !250, file: !19, line: 181, baseType: !23, size: 64, align: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !250, file: !19, line: 182, baseType: !23, size: 64, align: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !250, file: !19, line: 184, baseType: !56, size: 32, align: 32, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !250, file: !19, line: 185, baseType: !56, size: 32, align: 32, offset: 288)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !250, file: !19, line: 186, baseType: !64, size: 64, align: 64, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !250, file: !19, line: 187, baseType: !260, size: 64, align: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !250, file: !19, line: 188, baseType: !260, size: 64, align: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !250, file: !19, line: 189, baseType: !260, size: 64, align: 64, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !250, file: !19, line: 190, baseType: !102, size: 64, align: 64, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !241, file: !19, line: 303, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !19, line: 194, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !17, !248}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !32, file: !19, line: 366, baseType: !109, size: 64, align: 64, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !32, file: !19, line: 368, baseType: !41, size: 64, align: 64, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !32, file: !19, line: 372, baseType: !272, size: 64, align: 64, offset: 1472)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !19, line: 233, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!56, !17, !276, !102}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !19, line: 232, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!56, !17, !102}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !32, file: !19, line: 375, baseType: !155, size: 64, align: 64, offset: 1536)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !32, file: !19, line: 379, baseType: !282, size: 64, align: 64, offset: 1600)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !19, line: 322, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!17, !17, !17, !56}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !32, file: !19, line: 382, baseType: !23, size: 64, align: 64, offset: 1664)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !32, file: !19, line: 385, baseType: !288, size: 64, align: 64, offset: 1728)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !19, line: 323, baseType: !128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !32, file: !19, line: 386, baseType: !290, size: 64, align: 64, offset: 1792)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !19, line: 324, baseType: !128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !32, file: !19, line: 389, baseType: !292, size: 64, align: 64, offset: 1856)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !294, line: 40, size: 256, align: 64, elements: !295)
!294 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!295 = !{!296, !297, !299, !300}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !293, file: !294, line: 41, baseType: !41, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !293, file: !294, line: 42, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !294, line: 18, baseType: !138)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !293, file: !294, line: 43, baseType: !56, size: 32, align: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !293, file: !294, line: 45, baseType: !41, size: 64, align: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !32, file: !19, line: 390, baseType: !302, size: 64, align: 64, offset: 1920)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !19, line: 390, flags: DIFlagFwdDecl)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !32, file: !19, line: 391, baseType: !305, size: 64, align: 64, offset: 1984)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !307, line: 11, size: 320, align: 64, elements: !308)
!307 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!308 = !{!309, !310, !315, !320, !321}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !307, line: 12, baseType: !64, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !306, file: !307, line: 13, baseType: !311, size: 64, align: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !307, line: 8, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!17, !17, !102}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !306, file: !307, line: 14, baseType: !316, size: 64, align: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !307, line: 9, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!56, !17, !17, !102}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !306, file: !307, line: 15, baseType: !64, size: 64, align: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !306, file: !307, line: 16, baseType: !102, size: 64, align: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !32, file: !19, line: 392, baseType: !31, size: 64, align: 64, offset: 2048)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !32, file: !19, line: 393, baseType: !17, size: 64, align: 64, offset: 2112)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !32, file: !19, line: 394, baseType: !325, size: 64, align: 64, offset: 2176)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !19, line: 325, baseType: !147)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !32, file: !19, line: 395, baseType: !327, size: 64, align: 64, offset: 2240)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !19, line: 326, baseType: !223)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !32, file: !19, line: 396, baseType: !23, size: 64, align: 64, offset: 2304)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !32, file: !19, line: 397, baseType: !330, size: 64, align: 64, offset: 2368)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !19, line: 327, baseType: !223)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !32, file: !19, line: 398, baseType: !332, size: 64, align: 64, offset: 2432)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !19, line: 329, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!17, !31, !23}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !32, file: !19, line: 399, baseType: !337, size: 64, align: 64, offset: 2496)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !19, line: 328, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!17, !31, !17, !17}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !32, file: !19, line: 400, baseType: !342, size: 64, align: 64, offset: 2560)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !19, line: 307, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !102}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !32, file: !19, line: 401, baseType: !155, size: 64, align: 64, offset: 2624)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !32, file: !19, line: 402, baseType: !17, size: 64, align: 64, offset: 2688)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !32, file: !19, line: 403, baseType: !17, size: 64, align: 64, offset: 2752)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !32, file: !19, line: 404, baseType: !17, size: 64, align: 64, offset: 2816)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !32, file: !19, line: 405, baseType: !17, size: 64, align: 64, offset: 2880)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !32, file: !19, line: 406, baseType: !17, size: 64, align: 64, offset: 2944)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !32, file: !19, line: 407, baseType: !47, size: 64, align: 64, offset: 3008)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !32, file: !19, line: 410, baseType: !354, size: 32, align: 32, offset: 3072)
!354 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !32, file: !19, line: 412, baseType: !47, size: 64, align: 64, offset: 3136)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !359, line: 253, baseType: !360)
!359 = !DIFile(filename: "Include/objimpl.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!360 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !359, line: 246, size: 192, align: 64, elements: !361)
!361 = !{!362, !369}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !360, file: !359, line: 251, baseType: !363, size: 192, align: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, scope: !360, file: !359, line: 247, size: 192, align: 64, elements: !364)
!364 = !{!365, !367, !368}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !363, file: !359, line: 248, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !363, file: !359, line: 249, baseType: !366, size: 64, align: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !363, file: !359, line: 250, baseType: !23, size: 64, align: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !360, file: !359, line: 252, baseType: !370, size: 64, align: 64)
!370 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !373, line: 41, baseType: !374)
!373 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!374 = !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 31, size: 320, align: 64, elements: !375)
!375 = !{!376, !377, !378}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !374, file: !373, line: 32, baseType: !35, size: 192, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !374, file: !373, line: 33, baseType: !231, size: 64, align: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !374, file: !373, line: 34, baseType: !93, size: 8, align: 8, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !381, line: 351, baseType: !382)
!381 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!382 = !DICompositeType(tag: DW_TAG_structure_type, file: !381, line: 217, size: 384, align: 64, elements: !383)
!383 = !{!384, !385, !386, !387, !395}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !382, file: !381, line: 291, baseType: !18, size: 128, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !382, file: !381, line: 292, baseType: !23, size: 64, align: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !382, file: !381, line: 293, baseType: !231, size: 64, align: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !382, file: !381, line: 349, baseType: !388, size: 32, align: 32, offset: 256)
!388 = !DICompositeType(tag: DW_TAG_structure_type, scope: !382, file: !381, line: 294, size: 32, align: 32, elements: !389)
!389 = !{!390, !391, !392, !393, !394}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !388, file: !381, line: 303, baseType: !354, size: 2, align: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !388, file: !381, line: 331, baseType: !354, size: 3, align: 32, offset: 2)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !388, file: !381, line: 336, baseType: !354, size: 1, align: 32, offset: 5)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !388, file: !381, line: 340, baseType: !354, size: 1, align: 32, offset: 6)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !388, file: !381, line: 345, baseType: !354, size: 1, align: 32, offset: 7)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !382, file: !381, line: 350, baseType: !396, size: 64, align: 64, offset: 320)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !108, line: 90, baseType: !56)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !4, line: 139, baseType: !400)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !4, line: 69, size: 1536, align: 64, elements: !401)
!401 = !{!402, !404, !405, !425, !484, !485, !486, !487, !488, !489, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !400, file: !4, line: 72, baseType: !403, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !400, file: !4, line: 73, baseType: !403, size: 64, align: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !400, file: !4, line: 74, baseType: !406, size: 64, align: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !4, line: 44, baseType: !408)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !4, line: 19, size: 832, align: 64, elements: !409)
!409 = !{!410, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !408, file: !4, line: 21, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !408, file: !4, line: 22, baseType: !403, size: 64, align: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !408, file: !4, line: 24, baseType: !17, size: 64, align: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !408, file: !4, line: 25, baseType: !17, size: 64, align: 64, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !408, file: !4, line: 26, baseType: !17, size: 64, align: 64, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !408, file: !4, line: 27, baseType: !17, size: 64, align: 64, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !408, file: !4, line: 28, baseType: !17, size: 64, align: 64, offset: 384)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !408, file: !4, line: 30, baseType: !17, size: 64, align: 64, offset: 448)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !408, file: !4, line: 31, baseType: !17, size: 64, align: 64, offset: 512)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !408, file: !4, line: 32, baseType: !17, size: 64, align: 64, offset: 576)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !408, file: !4, line: 33, baseType: !56, size: 32, align: 32, offset: 640)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !408, file: !4, line: 34, baseType: !56, size: 32, align: 32, offset: 672)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !408, file: !4, line: 37, baseType: !56, size: 32, align: 32, offset: 704)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !408, file: !4, line: 43, baseType: !17, size: 64, align: 64, offset: 768)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !400, file: !4, line: 76, baseType: !426, size: 64, align: 64, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !428, line: 17, size: 3072, align: 64, elements: !429)
!428 = !DIFile(filename: "Include/frameobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!429 = !{!430, !431, !432, !459, !460, !461, !462, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !482}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !427, file: !428, line: 18, baseType: !35, size: 192, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "f_back", scope: !427, file: !428, line: 19, baseType: !426, size: 64, align: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "f_code", scope: !427, file: !428, line: 20, baseType: !433, size: 64, align: 64, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !435, line: 33, baseType: !436)
!435 = !DIFile(filename: "Include/code.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!436 = !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 11, size: 1152, align: 64, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !453, !454, !455, !456, !457, !458}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !436, file: !435, line: 12, baseType: !18, size: 128, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !436, file: !435, line: 13, baseType: !56, size: 32, align: 32, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !436, file: !435, line: 14, baseType: !56, size: 32, align: 32, offset: 160)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !436, file: !435, line: 15, baseType: !56, size: 32, align: 32, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !436, file: !435, line: 16, baseType: !56, size: 32, align: 32, offset: 224)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !436, file: !435, line: 17, baseType: !56, size: 32, align: 32, offset: 256)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "co_code", scope: !436, file: !435, line: 18, baseType: !17, size: 64, align: 64, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !436, file: !435, line: 19, baseType: !17, size: 64, align: 64, offset: 384)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !436, file: !435, line: 20, baseType: !17, size: 64, align: 64, offset: 448)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "co_varnames", scope: !436, file: !435, line: 21, baseType: !17, size: 64, align: 64, offset: 512)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "co_freevars", scope: !436, file: !435, line: 22, baseType: !17, size: 64, align: 64, offset: 576)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "co_cellvars", scope: !436, file: !435, line: 23, baseType: !17, size: 64, align: 64, offset: 640)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "co_cell2arg", scope: !436, file: !435, line: 25, baseType: !451, size: 64, align: 64, offset: 704)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!452 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !436, file: !435, line: 26, baseType: !17, size: 64, align: 64, offset: 768)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !436, file: !435, line: 27, baseType: !17, size: 64, align: 64, offset: 832)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !436, file: !435, line: 28, baseType: !56, size: 32, align: 32, offset: 896)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "co_lnotab", scope: !436, file: !435, line: 29, baseType: !17, size: 64, align: 64, offset: 960)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "co_zombieframe", scope: !436, file: !435, line: 31, baseType: !102, size: 64, align: 64, offset: 1024)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !436, file: !435, line: 32, baseType: !17, size: 64, align: 64, offset: 1088)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "f_builtins", scope: !427, file: !428, line: 21, baseType: !17, size: 64, align: 64, offset: 320)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "f_globals", scope: !427, file: !428, line: 22, baseType: !17, size: 64, align: 64, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "f_locals", scope: !427, file: !428, line: 23, baseType: !17, size: 64, align: 64, offset: 448)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "f_valuestack", scope: !427, file: !428, line: 24, baseType: !463, size: 64, align: 64, offset: 512)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "f_stacktop", scope: !427, file: !428, line: 28, baseType: !463, size: 64, align: 64, offset: 576)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "f_trace", scope: !427, file: !428, line: 29, baseType: !17, size: 64, align: 64, offset: 640)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_type", scope: !427, file: !428, line: 38, baseType: !17, size: 64, align: 64, offset: 704)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_value", scope: !427, file: !428, line: 38, baseType: !17, size: 64, align: 64, offset: 768)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_traceback", scope: !427, file: !428, line: 38, baseType: !17, size: 64, align: 64, offset: 832)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "f_gen", scope: !427, file: !428, line: 40, baseType: !17, size: 64, align: 64, offset: 896)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "f_lasti", scope: !427, file: !428, line: 42, baseType: !56, size: 32, align: 32, offset: 960)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "f_lineno", scope: !427, file: !428, line: 48, baseType: !56, size: 32, align: 32, offset: 992)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "f_iblock", scope: !427, file: !428, line: 49, baseType: !56, size: 32, align: 32, offset: 1024)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "f_executing", scope: !427, file: !428, line: 50, baseType: !43, size: 8, align: 8, offset: 1056)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "f_blockstack", scope: !427, file: !428, line: 51, baseType: !475, size: 1920, align: 32, offset: 1088)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 1920, align: 32, elements: !113)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTryBlock", file: !428, line: 15, baseType: !477)
!477 = !DICompositeType(tag: DW_TAG_structure_type, file: !428, line: 11, size: 96, align: 32, elements: !478)
!478 = !{!479, !480, !481}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "b_type", scope: !477, file: !428, line: 12, baseType: !56, size: 32, align: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "b_handler", scope: !477, file: !428, line: 13, baseType: !56, size: 32, align: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "b_level", scope: !477, file: !428, line: 14, baseType: !56, size: 32, align: 32, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "f_localsplus", scope: !427, file: !428, line: 52, baseType: !483, size: 64, align: 64, offset: 3008)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 64, align: 64, elements: !94)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !400, file: !4, line: 77, baseType: !56, size: 32, align: 32, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !400, file: !4, line: 78, baseType: !43, size: 8, align: 8, offset: 288)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !400, file: !4, line: 80, baseType: !43, size: 8, align: 8, offset: 296)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !400, file: !4, line: 85, baseType: !56, size: 32, align: 32, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !400, file: !4, line: 86, baseType: !56, size: 32, align: 32, offset: 352)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !400, file: !4, line: 88, baseType: !490, size: 64, align: 64, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !4, line: 54, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!56, !17, !426, !56, !17}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !400, file: !4, line: 89, baseType: !490, size: 64, align: 64, offset: 448)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !400, file: !4, line: 90, baseType: !17, size: 64, align: 64, offset: 512)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !400, file: !4, line: 91, baseType: !17, size: 64, align: 64, offset: 576)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !400, file: !4, line: 93, baseType: !17, size: 64, align: 64, offset: 640)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !400, file: !4, line: 94, baseType: !17, size: 64, align: 64, offset: 704)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !400, file: !4, line: 95, baseType: !17, size: 64, align: 64, offset: 768)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !400, file: !4, line: 97, baseType: !17, size: 64, align: 64, offset: 832)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !400, file: !4, line: 98, baseType: !17, size: 64, align: 64, offset: 896)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !400, file: !4, line: 99, baseType: !17, size: 64, align: 64, offset: 960)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !400, file: !4, line: 101, baseType: !17, size: 64, align: 64, offset: 1024)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !400, file: !4, line: 103, baseType: !56, size: 32, align: 32, offset: 1088)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !400, file: !4, line: 105, baseType: !17, size: 64, align: 64, offset: 1152)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !400, file: !4, line: 106, baseType: !29, size: 64, align: 64, offset: 1216)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !400, file: !4, line: 108, baseType: !56, size: 32, align: 32, offset: 1280)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !400, file: !4, line: 109, baseType: !17, size: 64, align: 64, offset: 1344)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !400, file: !4, line: 134, baseType: !343, size: 64, align: 64, offset: 1408)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !400, file: !4, line: 135, baseType: !102, size: 64, align: 64, offset: 1472)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !513, line: 40, baseType: !514)
!513 = !DIFile(filename: "Include/listobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!514 = !DICompositeType(tag: DW_TAG_structure_type, file: !513, line: 23, size: 320, align: 64, elements: !515)
!515 = !{!516, !517, !518}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !514, file: !513, line: 24, baseType: !35, size: 192, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !514, file: !513, line: 26, baseType: !463, size: 64, align: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !514, file: !513, line: 39, baseType: !23, size: 64, align: 64, offset: 256)
!519 = !{!520, !525, !533, !541, !548, !554, !563, !567, !571, !601, !605, !615, !623, !657, !667, !680, !704, !715, !718, !722, !732, !743, !757, !764, !780, !788, !797, !805, !814, !832, !843, !846, !856, !859, !895, !899, !925, !930, !944, !948, !952, !955, !958, !959, !964, !974, !983, !986, !995, !1000, !1011, !1014, !1023, !1028, !1031, !1051, !1065, !1079, !1082, !1085, !1088, !1095, !1098, !1101, !1104}
!520 = !DISubprogram(name: "Py_IncRef", scope: !1, file: !1, line: 209, type: !49, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @Py_IncRef, variables: !521)
!521 = !{!522, !523}
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !520, file: !1, line: 209, type: !17)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !524, file: !1, line: 211, type: !17)
!524 = distinct !DILexicalBlock(scope: !520, file: !1, line: 211, column: 5)
!525 = !DISubprogram(name: "Py_DecRef", scope: !1, file: !1, line: 215, type: !49, isLocal: false, isDefinition: true, scopeLine: 216, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @Py_DecRef, variables: !526)
!526 = !{!527, !528, !530}
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !525, file: !1, line: 215, type: !17)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !529, file: !1, line: 217, type: !17)
!529 = distinct !DILexicalBlock(scope: !525, file: !1, line: 217, column: 5)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !531, file: !1, line: 217, type: !17)
!531 = distinct !DILexicalBlock(scope: !532, file: !1, line: 217, column: 5)
!532 = distinct !DILexicalBlock(scope: !529, file: !1, line: 217, column: 5)
!533 = !DISubprogram(name: "PyObject_Init", scope: !1, file: !1, line: 221, type: !534, isLocal: false, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._typeobject*)* @PyObject_Init, variables: !538)
!534 = !DISubroutineType(types: !535)
!535 = !{!17, !17, !536}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !19, line: 422, baseType: !32)
!538 = !{!539, !540}
!539 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !533, file: !1, line: 221, type: !17)
!540 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tp", arg: 2, scope: !533, file: !1, line: 221, type: !536)
!541 = !DISubprogram(name: "PyObject_InitVar", scope: !1, file: !1, line: 232, type: !542, isLocal: false, isDefinition: true, scopeLine: 233, flags: DIFlagPrototyped, isOptimized: true, function: %struct.PyVarObject* (%struct.PyVarObject*, %struct._typeobject*, i64)* @PyObject_InitVar, variables: !544)
!542 = !DISubroutineType(types: !543)
!543 = !{!356, !356, !536, !23}
!544 = !{!545, !546, !547}
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !541, file: !1, line: 232, type: !356)
!546 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tp", arg: 2, scope: !541, file: !1, line: 232, type: !536)
!547 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 3, scope: !541, file: !1, line: 232, type: !23)
!548 = !DISubprogram(name: "_PyObject_New", scope: !1, file: !1, line: 244, type: !549, isLocal: false, isDefinition: true, scopeLine: 245, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*)* @_PyObject_New, variables: !551)
!549 = !DISubroutineType(types: !550)
!550 = !{!17, !536}
!551 = !{!552, !553}
!552 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tp", arg: 1, scope: !548, file: !1, line: 244, type: !536)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !548, file: !1, line: 246, type: !17)
!554 = !DISubprogram(name: "_PyObject_NewVar", scope: !1, file: !1, line: 254, type: !555, isLocal: false, isDefinition: true, scopeLine: 255, flags: DIFlagPrototyped, isOptimized: true, function: %struct.PyVarObject* (%struct._typeobject*, i64)* @_PyObject_NewVar, variables: !557)
!555 = !DISubroutineType(types: !556)
!556 = !{!356, !536, !23}
!557 = !{!558, !559, !560, !561}
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tp", arg: 1, scope: !554, file: !1, line: 254, type: !536)
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nitems", arg: 2, scope: !554, file: !1, line: 254, type: !23)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !554, file: !1, line: 256, type: !356)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !554, file: !1, line: 257, type: !562)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!563 = !DISubprogram(name: "PyObject_CallFinalizer", scope: !1, file: !1, line: 265, type: !49, isLocal: false, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @PyObject_CallFinalizer, variables: !564)
!564 = !{!565, !566}
!565 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !563, file: !1, line: 265, type: !17)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tp", scope: !563, file: !1, line: 267, type: !536)
!567 = !DISubprogram(name: "PyObject_CallFinalizerFromDealloc", scope: !1, file: !1, line: 284, type: !157, isLocal: false, isDefinition: true, scopeLine: 285, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @PyObject_CallFinalizerFromDealloc, variables: !568)
!568 = !{!569, !570}
!569 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !567, file: !1, line: 284, type: !17)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "refcnt", scope: !567, file: !1, line: 286, type: !23)
!571 = !DISubprogram(name: "PyObject_Print", scope: !1, file: !1, line: 331, type: !54, isLocal: false, isDefinition: true, scopeLine: 332, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._IO_FILE*, i32)* @PyObject_Print, variables: !572)
!572 = !{!573, !574, !575, !576, !577, !581, !585, !587, !592, !596, !598}
!573 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !571, file: !1, line: 331, type: !17)
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !571, file: !1, line: 331, type: !57)
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 3, scope: !571, file: !1, line: 331, type: !56)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !571, file: !1, line: 333, type: !56)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !578, file: !1, line: 344, type: !398)
!578 = distinct !DILexicalBlock(scope: !579, file: !1, line: 344, column: 9)
!579 = distinct !DILexicalBlock(scope: !580, file: !1, line: 343, column: 21)
!580 = distinct !DILexicalBlock(scope: !571, file: !1, line: 343, column: 9)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !582, file: !1, line: 352, type: !398)
!582 = distinct !DILexicalBlock(scope: !583, file: !1, line: 352, column: 13)
!583 = distinct !DILexicalBlock(scope: !584, file: !1, line: 349, column: 13)
!584 = distinct !DILexicalBlock(scope: !580, file: !1, line: 348, column: 10)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !586, file: !1, line: 357, type: !17)
!586 = distinct !DILexicalBlock(scope: !583, file: !1, line: 356, column: 14)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !588, file: !1, line: 369, type: !17)
!588 = distinct !DILexicalBlock(scope: !589, file: !1, line: 368, column: 42)
!589 = distinct !DILexicalBlock(scope: !590, file: !1, line: 368, column: 22)
!590 = distinct !DILexicalBlock(scope: !591, file: !1, line: 364, column: 22)
!591 = distinct !DILexicalBlock(scope: !586, file: !1, line: 362, column: 17)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !593, file: !1, line: 376, type: !17)
!593 = distinct !DILexicalBlock(scope: !594, file: !1, line: 376, column: 21)
!594 = distinct !DILexicalBlock(scope: !595, file: !1, line: 373, column: 22)
!595 = distinct !DILexicalBlock(scope: !588, file: !1, line: 371, column: 21)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !597, file: !1, line: 385, type: !17)
!597 = distinct !DILexicalBlock(scope: !586, file: !1, line: 385, column: 13)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !599, file: !1, line: 385, type: !17)
!599 = distinct !DILexicalBlock(scope: !600, file: !1, line: 385, column: 13)
!600 = distinct !DILexicalBlock(scope: !597, file: !1, line: 385, column: 13)
!601 = !DISubprogram(name: "_Py_BreakPoint", scope: !1, file: !1, line: 400, type: !602, isLocal: false, isDefinition: true, scopeLine: 401, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_Py_BreakPoint, variables: !604)
!602 = !DISubroutineType(types: !603)
!603 = !{null}
!604 = !{}
!605 = !DISubprogram(name: "_PyObject_Dump", scope: !1, file: !1, line: 407, type: !49, isLocal: false, isDefinition: true, scopeLine: 408, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @_PyObject_Dump, variables: !606)
!606 = !{!607, !608, !612, !613, !614}
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !605, file: !1, line: 407, type: !17)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gil", scope: !609, file: !1, line: 413, type: !611)
!609 = distinct !DILexicalBlock(scope: !610, file: !1, line: 411, column: 10)
!610 = distinct !DILexicalBlock(scope: !605, file: !1, line: 409, column: 9)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGILState_STATE", file: !4, line: 191, baseType: !3)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error_type", scope: !609, file: !1, line: 415, type: !17)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error_value", scope: !609, file: !1, line: 415, type: !17)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error_traceback", scope: !609, file: !1, line: 415, type: !17)
!615 = !DISubprogram(name: "PyObject_Repr", scope: !1, file: !1, line: 442, type: !129, isLocal: false, isDefinition: true, scopeLine: 443, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyObject_Repr, variables: !616)
!616 = !{!617, !618, !619}
!617 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !615, file: !1, line: 442, type: !17)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !615, file: !1, line: 444, type: !17)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !620, file: !1, line: 473, type: !17)
!620 = distinct !DILexicalBlock(scope: !621, file: !1, line: 473, column: 9)
!621 = distinct !DILexicalBlock(scope: !622, file: !1, line: 469, column: 32)
!622 = distinct !DILexicalBlock(scope: !615, file: !1, line: 469, column: 9)
!623 = !DISubprogram(name: "PyObject_Str", scope: !1, file: !1, line: 484, type: !129, isLocal: false, isDefinition: true, scopeLine: 485, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyObject_Str, variables: !624)
!624 = !{!625, !626, !627, !635, !636, !639, !641, !645, !646, !647, !648, !650, !651, !652, !653}
!625 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !623, file: !1, line: 484, type: !17)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !623, file: !1, line: 486, type: !17)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !628, file: !1, line: 517, type: !630)
!628 = distinct !DILexicalBlock(scope: !629, file: !1, line: 517, column: 9)
!629 = distinct !DILexicalBlock(scope: !623, file: !1, line: 517, column: 9)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !9, line: 33, baseType: !632)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !9, line: 31, size: 64, align: 64, elements: !633)
!633 = !{!634}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !632, file: !9, line: 32, baseType: !102, size: 64, align: 64)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !628, file: !1, line: 517, type: !102)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !628, file: !1, line: 517, type: !637)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !102)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !628, file: !1, line: 517, type: !640)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !9, line: 29, baseType: !8)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !642, file: !1, line: 520, type: !630)
!642 = distinct !DILexicalBlock(scope: !643, file: !1, line: 520, column: 5)
!643 = distinct !DILexicalBlock(scope: !644, file: !1, line: 520, column: 5)
!644 = distinct !DILexicalBlock(scope: !623, file: !1, line: 520, column: 5)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !642, file: !1, line: 520, type: !102)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !642, file: !1, line: 520, type: !637)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !642, file: !1, line: 520, type: !640)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !649, file: !1, line: 520, type: !630)
!649 = distinct !DILexicalBlock(scope: !643, file: !1, line: 520, column: 5)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !649, file: !1, line: 520, type: !102)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !649, file: !1, line: 520, type: !637)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !649, file: !1, line: 520, type: !640)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !654, file: !1, line: 527, type: !17)
!654 = distinct !DILexicalBlock(scope: !655, file: !1, line: 527, column: 9)
!655 = distinct !DILexicalBlock(scope: !656, file: !1, line: 523, column: 32)
!656 = distinct !DILexicalBlock(scope: !623, file: !1, line: 523, column: 9)
!657 = !DISubprogram(name: "PyObject_ASCII", scope: !1, file: !1, line: 539, type: !129, isLocal: false, isDefinition: true, scopeLine: 540, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyObject_ASCII, variables: !658)
!658 = !{!659, !660, !661, !662, !663, !665}
!659 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !657, file: !1, line: 539, type: !17)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "repr", scope: !657, file: !1, line: 541, type: !17)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ascii", scope: !657, file: !1, line: 541, type: !17)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !657, file: !1, line: 541, type: !17)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !664, file: !1, line: 552, type: !17)
!664 = distinct !DILexicalBlock(scope: !657, file: !1, line: 552, column: 5)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !666, file: !1, line: 561, type: !17)
!666 = distinct !DILexicalBlock(scope: !657, file: !1, line: 561, column: 5)
!667 = !DISubprogram(name: "PyObject_Bytes", scope: !1, file: !1, line: 566, type: !129, isLocal: false, isDefinition: true, scopeLine: 567, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyObject_Bytes, variables: !668)
!668 = !{!669, !670, !671, !672, !676}
!669 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !667, file: !1, line: 566, type: !17)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !667, file: !1, line: 568, type: !17)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !667, file: !1, line: 568, type: !17)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !673, file: !1, line: 581, type: !17)
!673 = distinct !DILexicalBlock(scope: !674, file: !1, line: 581, column: 9)
!674 = distinct !DILexicalBlock(scope: !675, file: !1, line: 579, column: 23)
!675 = distinct !DILexicalBlock(scope: !667, file: !1, line: 579, column: 9)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !677, file: !1, line: 588, type: !17)
!677 = distinct !DILexicalBlock(scope: !678, file: !1, line: 588, column: 13)
!678 = distinct !DILexicalBlock(scope: !679, file: !1, line: 584, column: 37)
!679 = distinct !DILexicalBlock(scope: !674, file: !1, line: 584, column: 13)
!680 = !DISubprogram(name: "PyObject_RichCompare", scope: !1, file: !1, line: 689, type: !284, isLocal: false, isDefinition: true, scopeLine: 690, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @PyObject_RichCompare, variables: !681)
!681 = !{!682, !683, !684, !685, !686, !689, !690, !691, !692, !696, !697, !698, !699, !701, !702, !703}
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !680, file: !1, line: 689, type: !17)
!683 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !680, file: !1, line: 689, type: !17)
!684 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !680, file: !1, line: 689, type: !56)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !680, file: !1, line: 691, type: !17)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !687, file: !1, line: 699, type: !630)
!687 = distinct !DILexicalBlock(scope: !688, file: !1, line: 699, column: 9)
!688 = distinct !DILexicalBlock(scope: !680, file: !1, line: 699, column: 9)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !687, file: !1, line: 699, type: !102)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !687, file: !1, line: 699, type: !637)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !687, file: !1, line: 699, type: !640)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !693, file: !1, line: 702, type: !630)
!693 = distinct !DILexicalBlock(scope: !694, file: !1, line: 702, column: 5)
!694 = distinct !DILexicalBlock(scope: !695, file: !1, line: 702, column: 5)
!695 = distinct !DILexicalBlock(scope: !680, file: !1, line: 702, column: 5)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !693, file: !1, line: 702, type: !102)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !693, file: !1, line: 702, type: !637)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !693, file: !1, line: 702, type: !640)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !700, file: !1, line: 702, type: !630)
!700 = distinct !DILexicalBlock(scope: !694, file: !1, line: 702, column: 5)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !700, file: !1, line: 702, type: !102)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !700, file: !1, line: 702, type: !637)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !700, file: !1, line: 702, type: !640)
!704 = !DISubprogram(name: "PyObject_RichCompareBool", scope: !1, file: !1, line: 709, type: !705, isLocal: false, isDefinition: true, scopeLine: 710, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, i32)* @PyObject_RichCompareBool, variables: !707)
!705 = !DISubroutineType(types: !706)
!706 = !{!56, !17, !17, !56}
!707 = !{!708, !709, !710, !711, !712, !713}
!708 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !704, file: !1, line: 709, type: !17)
!709 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !704, file: !1, line: 709, type: !17)
!710 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !704, file: !1, line: 709, type: !56)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !704, file: !1, line: 711, type: !17)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ok", scope: !704, file: !1, line: 712, type: !56)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !714, file: !1, line: 730, type: !17)
!714 = distinct !DILexicalBlock(scope: !704, file: !1, line: 730, column: 5)
!715 = !DISubprogram(name: "PyObject_HashNotImplemented", scope: !1, file: !1, line: 735, type: !229, isLocal: false, isDefinition: true, scopeLine: 736, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyObject_HashNotImplemented, variables: !716)
!716 = !{!717}
!717 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !715, file: !1, line: 735, type: !17)
!718 = !DISubprogram(name: "PyObject_Hash", scope: !1, file: !1, line: 743, type: !229, isLocal: false, isDefinition: true, scopeLine: 744, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyObject_Hash, variables: !719)
!719 = !{!720, !721}
!720 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !718, file: !1, line: 743, type: !17)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tp", scope: !718, file: !1, line: 745, type: !536)
!722 = !DISubprogram(name: "PyObject_GetAttrString", scope: !1, file: !1, line: 764, type: !723, isLocal: false, isDefinition: true, scopeLine: 765, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*)* @PyObject_GetAttrString, variables: !725)
!723 = !DISubroutineType(types: !724)
!724 = !{!17, !17, !41}
!725 = !{!726, !727, !728, !729, !730}
!726 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !722, file: !1, line: 764, type: !17)
!727 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !722, file: !1, line: 764, type: !41)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !722, file: !1, line: 766, type: !17)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !722, file: !1, line: 766, type: !17)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !731, file: !1, line: 774, type: !17)
!731 = distinct !DILexicalBlock(scope: !722, file: !1, line: 774, column: 5)
!732 = !DISubprogram(name: "PyObject_HasAttrString", scope: !1, file: !1, line: 779, type: !733, isLocal: false, isDefinition: true, scopeLine: 780, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*)* @PyObject_HasAttrString, variables: !735)
!733 = !DISubroutineType(types: !734)
!734 = !{!56, !17, !41}
!735 = !{!736, !737, !738, !739}
!736 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !732, file: !1, line: 779, type: !17)
!737 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !732, file: !1, line: 779, type: !41)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !732, file: !1, line: 781, type: !17)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !740, file: !1, line: 783, type: !17)
!740 = distinct !DILexicalBlock(scope: !741, file: !1, line: 783, column: 9)
!741 = distinct !DILexicalBlock(scope: !742, file: !1, line: 782, column: 22)
!742 = distinct !DILexicalBlock(scope: !732, file: !1, line: 782, column: 9)
!743 = !DISubprogram(name: "PyObject_SetAttrString", scope: !1, file: !1, line: 791, type: !744, isLocal: false, isDefinition: true, scopeLine: 792, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*, %struct._object*)* @PyObject_SetAttrString, variables: !746)
!744 = !DISubroutineType(types: !745)
!745 = !{!56, !17, !41, !17}
!746 = !{!747, !748, !749, !750, !751, !752, !754}
!747 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !743, file: !1, line: 791, type: !17)
!748 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !743, file: !1, line: 791, type: !41)
!749 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 3, scope: !743, file: !1, line: 791, type: !17)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !743, file: !1, line: 793, type: !17)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !743, file: !1, line: 794, type: !56)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !753, file: !1, line: 802, type: !17)
!753 = distinct !DILexicalBlock(scope: !743, file: !1, line: 802, column: 5)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !755, file: !1, line: 802, type: !17)
!755 = distinct !DILexicalBlock(scope: !756, file: !1, line: 802, column: 5)
!756 = distinct !DILexicalBlock(scope: !753, file: !1, line: 802, column: 5)
!757 = !DISubprogram(name: "_PyObject_IsAbstract", scope: !1, file: !1, line: 807, type: !157, isLocal: false, isDefinition: true, scopeLine: 808, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @_PyObject_IsAbstract, variables: !758)
!758 = !{!759, !760, !761, !762}
!759 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !757, file: !1, line: 807, type: !17)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !757, file: !1, line: 809, type: !56)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "isabstract", scope: !757, file: !1, line: 810, type: !17)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !763, file: !1, line: 824, type: !17)
!763 = distinct !DILexicalBlock(scope: !757, file: !1, line: 824, column: 5)
!764 = !DISubprogram(name: "_PyObject_GetAttrId", scope: !1, file: !1, line: 829, type: !765, isLocal: false, isDefinition: true, scopeLine: 830, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._Py_Identifier*)* @_PyObject_GetAttrId, variables: !775)
!765 = !DISubroutineType(types: !766)
!766 = !{!17, !17, !767}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64, align: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !19, line: 144, baseType: !769)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !19, line: 140, size: 192, align: 64, elements: !770)
!770 = !{!771, !773, !774}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !769, file: !19, line: 141, baseType: !772, size: 64, align: 64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64, align: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !769, file: !19, line: 142, baseType: !41, size: 64, align: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !769, file: !19, line: 143, baseType: !17, size: 64, align: 64, offset: 128)
!775 = !{!776, !777, !778, !779}
!776 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !764, file: !1, line: 829, type: !17)
!777 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !764, file: !1, line: 829, type: !767)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !764, file: !1, line: 831, type: !17)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oname", scope: !764, file: !1, line: 832, type: !17)
!780 = !DISubprogram(name: "_PyObject_HasAttrId", scope: !1, file: !1, line: 840, type: !781, isLocal: false, isDefinition: true, scopeLine: 841, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._Py_Identifier*)* @_PyObject_HasAttrId, variables: !783)
!781 = !DISubroutineType(types: !782)
!782 = !{!56, !17, !767}
!783 = !{!784, !785, !786, !787}
!784 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !780, file: !1, line: 840, type: !17)
!785 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !780, file: !1, line: 840, type: !767)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !780, file: !1, line: 842, type: !56)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oname", scope: !780, file: !1, line: 843, type: !17)
!788 = !DISubprogram(name: "_PyObject_SetAttrId", scope: !1, file: !1, line: 851, type: !789, isLocal: false, isDefinition: true, scopeLine: 852, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._Py_Identifier*, %struct._object*)* @_PyObject_SetAttrId, variables: !791)
!789 = !DISubroutineType(types: !790)
!790 = !{!56, !17, !767, !17}
!791 = !{!792, !793, !794, !795, !796}
!792 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !788, file: !1, line: 851, type: !17)
!793 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !788, file: !1, line: 851, type: !767)
!794 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 3, scope: !788, file: !1, line: 851, type: !17)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !788, file: !1, line: 853, type: !56)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oname", scope: !788, file: !1, line: 854, type: !17)
!797 = !DISubprogram(name: "PyObject_GetAttr", scope: !1, file: !1, line: 862, type: !139, isLocal: false, isDefinition: true, scopeLine: 863, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyObject_GetAttr, variables: !798)
!798 = !{!799, !800, !801, !802}
!799 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !797, file: !1, line: 862, type: !17)
!800 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !797, file: !1, line: 862, type: !17)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tp", scope: !797, file: !1, line: 864, type: !536)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name_str", scope: !803, file: !1, line: 875, type: !64)
!803 = distinct !DILexicalBlock(scope: !804, file: !1, line: 874, column: 33)
!804 = distinct !DILexicalBlock(scope: !797, file: !1, line: 874, column: 9)
!805 = !DISubprogram(name: "PyObject_HasAttr", scope: !1, file: !1, line: 887, type: !210, isLocal: false, isDefinition: true, scopeLine: 888, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*)* @PyObject_HasAttr, variables: !806)
!806 = !{!807, !808, !809, !810}
!807 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !805, file: !1, line: 887, type: !17)
!808 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !805, file: !1, line: 887, type: !17)
