; ModuleID = 'obmalloc.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyMemAllocator = type { i8*, i8* (i8*, i64)*, i8* (i8*, i8*, i64)*, void (i8*, i8*)* }
%struct.PyObjectArenaAllocator = type { i8*, i8* (i8*, i64)*, void (i8*, i8*, i64)* }
%struct.arena_object = type { i64, i8*, i32, i32, %struct.pool_header*, %struct.arena_object*, %struct.arena_object* }
%struct.pool_header = type { %union.anon, i8*, %struct.pool_header*, %struct.pool_header*, i32, i32, i32, i32 }
%union.anon = type { i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@_PyMem_Raw = internal unnamed_addr global %struct.PyMemAllocator { i8* null, i8* (i8*, i64)* @_PyMem_RawMalloc, i8* (i8*, i8*, i64)* @_PyMem_RawRealloc, void (i8*, i8*)* @_PyMem_RawFree }, align 8
@_PyMem = internal unnamed_addr global %struct.PyMemAllocator { i8* null, i8* (i8*, i64)* @_PyMem_RawMalloc, i8* (i8*, i8*, i64)* @_PyMem_RawRealloc, void (i8*, i8*)* @_PyMem_RawFree }, align 8
@_PyObject = internal unnamed_addr global %struct.PyMemAllocator { i8* null, i8* (i8*, i64)* @_PyObject_Malloc, i8* (i8*, i8*, i64)* @_PyObject_Realloc, void (i8*, i8*)* @_PyObject_Free }, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !9, subprograms: !57, globals: !355)
!1 = !DIFile(filename: "Objects/obmalloc.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 117, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pymem.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "PYMEM_DOMAIN_RAW", value: 0)
!7 = !DIEnumerator(name: "PYMEM_DOMAIN_MEM", value: 1)
!8 = !DIEnumerator(name: "PYMEM_DOMAIN_OBJ", value: 2)
!9 = !{!10, !11, !14, !21, !24, !36, !44, !32, !45, !55, !56}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !12, line: 62, baseType: !13)
!12 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!13 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !15, line: 177, baseType: !16)
!15 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !17, line: 102, baseType: !18)
!17 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !19, line: 181, baseType: !20)
!19 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!20 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_uintptr_t", file: !15, line: 153, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 122, baseType: !13)
!23 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "poolp", file: !1, line: 633, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "pool_header", file: !1, line: 621, size: 384, align: 64, elements: !27)
!27 = !{!28, !37, !38, !39, !40, !41, !42, !43}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !26, file: !1, line: 623, baseType: !29, size: 64, align: 64)
!29 = !DICompositeType(tag: DW_TAG_union_type, scope: !26, file: !1, line: 622, size: 64, align: 64, elements: !30)
!30 = !{!31, !35}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_padding", scope: !29, file: !1, line: 622, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "block", file: !1, line: 618, baseType: !34)
!34 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !29, file: !1, line: 623, baseType: !36, size: 32, align: 32)
!36 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "freeblock", scope: !26, file: !1, line: 624, baseType: !32, size: 64, align: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "nextpool", scope: !26, file: !1, line: 625, baseType: !25, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "prevpool", scope: !26, file: !1, line: 626, baseType: !25, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "arenaindex", scope: !26, file: !1, line: 627, baseType: !36, size: 32, align: 32, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "szidx", scope: !26, file: !1, line: 628, baseType: !36, size: 32, align: 32, offset: 288)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "nextoffset", scope: !26, file: !1, line: 629, baseType: !36, size: 32, align: 32, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "maxnextoffset", scope: !26, file: !1, line: 630, baseType: !36, size: 32, align: 32, offset: 352)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "arena_object", file: !1, line: 636, size: 384, align: 64, elements: !47)
!47 = !{!48, !49, !50, !51, !52, !53, !54}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !46, file: !1, line: 642, baseType: !21, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "pool_address", scope: !46, file: !1, line: 645, baseType: !32, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "nfreepools", scope: !46, file: !1, line: 650, baseType: !36, size: 32, align: 32, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ntotalpools", scope: !46, file: !1, line: 653, baseType: !36, size: 32, align: 32, offset: 160)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "freepools", scope: !46, file: !1, line: 656, baseType: !25, size: 64, align: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "nextarena", scope: !46, file: !1, line: 672, baseType: !45, size: 64, align: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "prevarena", scope: !46, file: !1, line: 673, baseType: !45, size: 64, align: 64, offset: 320)
!55 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!56 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!57 = !{!58, !62, !86, !90, !106, !109, !114, !118, !123, !126, !130, !133, !143, !148, !151, !155, !158, !161, !227, !268, !272, !277, !281, !291, !303, !312, !328, !333, !338}
!58 = !DISubprogram(name: "PyMem_SetupDebugHooks", scope: !1, file: !1, line: 193, type: !59, isLocal: false, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyMem_SetupDebugHooks, variables: !61)
!59 = !DISubroutineType(types: !60)
!60 = !{null}
!61 = !{}
!62 = !DISubprogram(name: "PyMem_GetAllocator", scope: !1, file: !1, line: 223, type: !63, isLocal: false, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, %struct.PyMemAllocator*)* @PyMem_GetAllocator, variables: !83)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !65, !66}
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemAllocatorDomain", file: !4, line: 126, baseType: !3)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemAllocator", file: !4, line: 140, baseType: !68)
!68 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 128, size: 256, align: 64, elements: !69)
!69 = !{!70, !71, !75, !79}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !68, file: !4, line: 130, baseType: !10, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !68, file: !4, line: 133, baseType: !72, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!10, !10, !11}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !68, file: !4, line: 136, baseType: !76, size: 64, align: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!10, !10, !10, !11}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !68, file: !4, line: 139, baseType: !80, size: 64, align: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !10, !10}
!83 = !{!84, !85}
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "domain", arg: 1, scope: !62, file: !1, line: 223, type: !65)
!85 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "allocator", arg: 2, scope: !62, file: !1, line: 223, type: !66)
!86 = !DISubprogram(name: "PyMem_SetAllocator", scope: !1, file: !1, line: 240, type: !63, isLocal: false, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, %struct.PyMemAllocator*)* @PyMem_SetAllocator, variables: !87)
!87 = !{!88, !89}
!88 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "domain", arg: 1, scope: !86, file: !1, line: 240, type: !65)
!89 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "allocator", arg: 2, scope: !86, file: !1, line: 240, type: !66)
!90 = !DISubprogram(name: "PyObject_GetArenaAllocator", scope: !1, file: !1, line: 253, type: !91, isLocal: false, isDefinition: true, scopeLine: 254, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyObjectArenaAllocator*)* @PyObject_GetArenaAllocator, variables: !104)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !93}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObjectArenaAllocator", file: !95, line: 211, baseType: !96)
!95 = !DIFile(filename: "Include/objimpl.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!96 = !DICompositeType(tag: DW_TAG_structure_type, file: !95, line: 202, size: 192, align: 64, elements: !97)
!97 = !{!98, !99, !100}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !96, file: !95, line: 204, baseType: !10, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !96, file: !95, line: 207, baseType: !72, size: 64, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !96, file: !95, line: 210, baseType: !101, size: 64, align: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !10, !10, !11}
!104 = !{!105}
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "allocator", arg: 1, scope: !90, file: !1, line: 253, type: !93)
!106 = !DISubprogram(name: "PyObject_SetArenaAllocator", scope: !1, file: !1, line: 259, type: !91, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyObjectArenaAllocator*)* @PyObject_SetArenaAllocator, variables: !107)
!107 = !{!108}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "allocator", arg: 1, scope: !106, file: !1, line: 259, type: !93)
!109 = !DISubprogram(name: "PyMem_RawMalloc", scope: !1, file: !1, line: 265, type: !110, isLocal: false, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i64)* @PyMem_RawMalloc, variables: !112)
!110 = !DISubroutineType(types: !111)
!111 = !{!10, !11}
!112 = !{!113}
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !109, file: !1, line: 265, type: !11)
!114 = !DISubprogram(name: "PyMem_RawRealloc", scope: !1, file: !1, line: 280, type: !73, isLocal: false, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i64)* @PyMem_RawRealloc, variables: !115)
!115 = !{!116, !117}
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !114, file: !1, line: 280, type: !10)
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "new_size", arg: 2, scope: !114, file: !1, line: 280, type: !11)
!118 = !DISubprogram(name: "PyMem_RawFree", scope: !1, file: !1, line: 288, type: !119, isLocal: false, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @PyMem_RawFree, variables: !121)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !10}
!121 = !{!122}
!122 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !118, file: !1, line: 288, type: !10)
!123 = !DISubprogram(name: "PyMem_Malloc", scope: !1, file: !1, line: 294, type: !110, isLocal: false, isDefinition: true, scopeLine: 295, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i64)* @PyMem_Malloc, variables: !124)
!124 = !{!125}
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !123, file: !1, line: 294, type: !11)
!126 = !DISubprogram(name: "PyMem_Realloc", scope: !1, file: !1, line: 303, type: !73, isLocal: false, isDefinition: true, scopeLine: 304, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i64)* @PyMem_Realloc, variables: !127)
!127 = !{!128, !129}
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !126, file: !1, line: 303, type: !10)
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "new_size", arg: 2, scope: !126, file: !1, line: 303, type: !11)
!130 = !DISubprogram(name: "PyMem_Free", scope: !1, file: !1, line: 312, type: !119, isLocal: false, isDefinition: true, scopeLine: 313, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @PyMem_Free, variables: !131)
!131 = !{!132}
!132 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !130, file: !1, line: 312, type: !10)
!133 = !DISubprogram(name: "_PyMem_RawStrdup", scope: !1, file: !1, line: 318, type: !134, isLocal: false, isDefinition: true, scopeLine: 319, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*)* @_PyMem_RawStrdup, variables: !139)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!139 = !{!140, !141, !142}
!140 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !133, file: !1, line: 318, type: !137)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !133, file: !1, line: 320, type: !11)
!142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "copy", scope: !133, file: !1, line: 321, type: !136)
!143 = !DISubprogram(name: "_PyMem_Strdup", scope: !1, file: !1, line: 332, type: !134, isLocal: false, isDefinition: true, scopeLine: 333, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*)* @_PyMem_Strdup, variables: !144)
!144 = !{!145, !146, !147}
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !143, file: !1, line: 332, type: !137)
!146 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !143, file: !1, line: 334, type: !11)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "copy", scope: !143, file: !1, line: 335, type: !136)
!148 = !DISubprogram(name: "PyObject_Malloc", scope: !1, file: !1, line: 346, type: !110, isLocal: false, isDefinition: true, scopeLine: 347, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i64)* @PyObject_Malloc, variables: !149)
!149 = !{!150}
!150 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !148, file: !1, line: 346, type: !11)
!151 = !DISubprogram(name: "PyObject_Realloc", scope: !1, file: !1, line: 355, type: !73, isLocal: false, isDefinition: true, scopeLine: 356, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i64)* @PyObject_Realloc, variables: !152)
!152 = !{!153, !154}
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !151, file: !1, line: 355, type: !10)
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "new_size", arg: 2, scope: !151, file: !1, line: 355, type: !11)
!155 = !DISubprogram(name: "PyObject_Free", scope: !1, file: !1, line: 364, type: !119, isLocal: false, isDefinition: true, scopeLine: 365, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @PyObject_Free, variables: !156)
!156 = !{!157}
!157 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !155, file: !1, line: 364, type: !10)
!158 = !DISubprogram(name: "_Py_GetAllocatedBlocks", scope: !1, file: !1, line: 891, type: !159, isLocal: false, isDefinition: true, scopeLine: 892, flags: DIFlagPrototyped, isOptimized: true, function: i64 ()* @_Py_GetAllocatedBlocks, variables: !61)
!159 = !DISubroutineType(types: !160)
!160 = !{!14}
!161 = !DISubprogram(name: "_PyDebugAllocatorStats", scope: !1, file: !1, line: 2056, type: !162, isLocal: false, isDefinition: true, scopeLine: 2058, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IO_FILE*, i8*, i32, i64)* @_PyDebugAllocatorStats, variables: !217)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !164, !137, !55, !11}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !17, line: 48, baseType: !166)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !167, line: 246, size: 1728, align: 64, elements: !168)
!167 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!168 = !{!169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !189, !190, !191, !192, !194, !196, !198, !202, !205, !207, !208, !209, !210, !211, !212, !213}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !166, file: !167, line: 247, baseType: !55, size: 32, align: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !166, file: !167, line: 252, baseType: !136, size: 64, align: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !166, file: !167, line: 253, baseType: !136, size: 64, align: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !166, file: !167, line: 254, baseType: !136, size: 64, align: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !166, file: !167, line: 255, baseType: !136, size: 64, align: 64, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !166, file: !167, line: 256, baseType: !136, size: 64, align: 64, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !166, file: !167, line: 257, baseType: !136, size: 64, align: 64, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !166, file: !167, line: 258, baseType: !136, size: 64, align: 64, offset: 448)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !166, file: !167, line: 259, baseType: !136, size: 64, align: 64, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !166, file: !167, line: 261, baseType: !136, size: 64, align: 64, offset: 576)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !166, file: !167, line: 262, baseType: !136, size: 64, align: 64, offset: 640)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !166, file: !167, line: 263, baseType: !136, size: 64, align: 64, offset: 704)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !166, file: !167, line: 265, baseType: !182, size: 64, align: 64, offset: 768)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !167, line: 161, size: 192, align: 64, elements: !184)
!184 = !{!185, !186, !188}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !183, file: !167, line: 162, baseType: !182, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !183, file: !167, line: 163, baseType: !187, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !183, file: !167, line: 167, baseType: !55, size: 32, align: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !166, file: !167, line: 267, baseType: !187, size: 64, align: 64, offset: 832)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !166, file: !167, line: 269, baseType: !55, size: 32, align: 32, offset: 896)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !166, file: !167, line: 273, baseType: !55, size: 32, align: 32, offset: 928)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !166, file: !167, line: 275, baseType: !193, size: 64, align: 64, offset: 960)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !19, line: 140, baseType: !20)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !166, file: !167, line: 279, baseType: !195, size: 16, align: 16, offset: 1024)
!195 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !166, file: !167, line: 280, baseType: !197, size: 8, align: 8, offset: 1040)
!197 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !166, file: !167, line: 281, baseType: !199, size: 8, align: 8, offset: 1048)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8, align: 8, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 1)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !166, file: !167, line: 285, baseType: !203, size: 64, align: 64, offset: 1088)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !167, line: 155, baseType: null)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !166, file: !167, line: 294, baseType: !206, size: 64, align: 64, offset: 1152)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !19, line: 141, baseType: !20)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !166, file: !167, line: 303, baseType: !10, size: 64, align: 64, offset: 1216)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !166, file: !167, line: 304, baseType: !10, size: 64, align: 64, offset: 1280)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !166, file: !167, line: 305, baseType: !10, size: 64, align: 64, offset: 1344)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !166, file: !167, line: 306, baseType: !10, size: 64, align: 64, offset: 1408)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !166, file: !167, line: 307, baseType: !11, size: 64, align: 64, offset: 1472)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !166, file: !167, line: 309, baseType: !55, size: 32, align: 32, offset: 1536)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !166, file: !167, line: 311, baseType: !214, size: 160, align: 8, offset: 1568)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 160, align: 8, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 20)
!217 = !{!218, !219, !220, !221, !222, !226}
!218 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !161, file: !1, line: 2056, type: !164)
!219 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "block_name", arg: 2, scope: !161, file: !1, line: 2057, type: !137)
!220 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num_blocks", arg: 3, scope: !161, file: !1, line: 2057, type: !55)
!221 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sizeof_block", arg: 4, scope: !161, file: !1, line: 2057, type: !11)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf1", scope: !161, file: !1, line: 2059, type: !223)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 1024, align: 8, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 128)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf2", scope: !161, file: !1, line: 2060, type: !223)
!227 = !DISubprogram(name: "_PyObject_DebugMallocStats", scope: !1, file: !1, line: 2076, type: !228, isLocal: false, isDefinition: true, scopeLine: 2077, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IO_FILE*)* @_PyObject_DebugMallocStats, variables: !230)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !164}
!230 = !{!231, !232, !233, !235, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !254, !255, !259, !260, !261, !265, !266, !267}
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !227, file: !1, line: 2076, type: !164)
!232 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !227, file: !1, line: 2078, type: !36)
!233 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numclasses", scope: !227, file: !1, line: 2079, type: !234)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numpools", scope: !227, file: !1, line: 2081, type: !236)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 4096, align: 64, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 64)
!239 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numblocks", scope: !227, file: !1, line: 2082, type: !236)
!240 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numfreeblocks", scope: !227, file: !1, line: 2083, type: !236)
!241 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "allocated_bytes", scope: !227, file: !1, line: 2085, type: !11)
!242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "available_bytes", scope: !227, file: !1, line: 2087, type: !11)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numfreepools", scope: !227, file: !1, line: 2089, type: !36)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arena_alignment", scope: !227, file: !1, line: 2091, type: !11)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pool_header_bytes", scope: !227, file: !1, line: 2093, type: !11)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "quantization", scope: !227, file: !1, line: 2098, type: !11)
!247 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "narenas", scope: !227, file: !1, line: 2100, type: !11)
!248 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "total", scope: !227, file: !1, line: 2102, type: !11)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !227, file: !1, line: 2103, type: !223)
!250 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !251, file: !1, line: 2116, type: !36)
!251 = distinct !DILexicalBlock(scope: !252, file: !1, line: 2115, column: 37)
!252 = distinct !DILexicalBlock(scope: !253, file: !1, line: 2115, column: 5)
!253 = distinct !DILexicalBlock(scope: !227, file: !1, line: 2115, column: 5)
