; ModuleID = 'parser.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.parser_state = type { %struct.stack, %struct.grammar*, %struct._node*, i64 }
%struct.stack = type { %struct.stackentry*, [1500 x %struct.stackentry] }
%struct.stackentry = type { i32, %struct.dfa*, %struct._node* }
%struct.dfa = type { i32, i8*, i32, i32, %struct.state*, i8* }
%struct.state = type { i32, %struct.arc*, i32, i32, i32*, i32 }
%struct.arc = type { i16, i16 }
%struct._node = type { i16, i8*, i32, i32, i32, %struct._node* }
%struct.grammar = type { i32, %struct.dfa*, %struct.labellist, i32, i32 }
%struct.labellist = type { i32, %struct.label* }
%struct.label = type { i32, i8* }

@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [31 x i8] c"s_push: parser stack overflow\0A\00", align 1

; Function Attrs: nounwind uwtable
define %struct.parser_state* @PyParser_New(%struct.grammar* %g, i32 %start) #0 {
entry:
  tail call void @llvm.dbg.value(metadata %struct.grammar* %g, i64 0, metadata !101, metadata !204), !dbg !205

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !96)
!1 = !DIFile(filename: "Parser/parser.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !95, !28}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "parser_state", file: !6, line: 31, baseType: !7)
!6 = !DIFile(filename: "Parser/parser.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!7 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 24, size: 288256, align: 64, elements: !8)
!8 = !{!9, !69, !90, !93}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "p_stack", scope: !7, file: !6, line: 25, baseType: !10, size: 288064, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "stack", file: !6, line: 22, baseType: !11)
!11 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 18, size: 288064, align: 64, elements: !12)
!12 = !{!13, !65}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "s_top", scope: !11, file: !6, line: 19, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "stackentry", file: !6, line: 16, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 12, size: 192, align: 64, elements: !17)
!17 = !{!18, !20, !54}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "s_state", scope: !16, file: !6, line: 13, baseType: !19, size: 32, align: 32)
!19 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "s_dfa", scope: !16, file: !6, line: 14, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "dfa", file: !23, line: 57, baseType: !24)
!23 = !DIFile(filename: "Include/grammar.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 50, size: 320, align: 64, elements: !25)
!25 = !{!26, !27, !30, !31, !32, !51}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !24, file: !23, line: 51, baseType: !19, size: 32, align: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !24, file: !23, line: 52, baseType: !28, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "d_initial", scope: !24, file: !23, line: 53, baseType: !19, size: 32, align: 32, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "d_nstates", scope: !24, file: !23, line: 54, baseType: !19, size: 32, align: 32, offset: 160)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "d_state", scope: !24, file: !23, line: 55, baseType: !33, size: 64, align: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "state", file: !23, line: 46, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 37, size: 320, align: 64, elements: !36)
!36 = !{!37, !38, !46, !47, !48, !50}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "s_narcs", scope: !35, file: !23, line: 38, baseType: !19, size: 32, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "s_arc", scope: !35, file: !23, line: 39, baseType: !39, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc", file: !23, line: 33, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 30, size: 32, align: 16, elements: !42)
!42 = !{!43, !45}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "a_lbl", scope: !41, file: !23, line: 31, baseType: !44, size: 16, align: 16)
!44 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "a_arrow", scope: !41, file: !23, line: 32, baseType: !44, size: 16, align: 16, offset: 16)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "s_lower", scope: !35, file: !23, line: 42, baseType: !19, size: 32, align: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "s_upper", scope: !35, file: !23, line: 43, baseType: !19, size: 32, align: 32, offset: 160)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "s_accel", scope: !35, file: !23, line: 44, baseType: !49, size: 64, align: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "s_accept", scope: !35, file: !23, line: 45, baseType: !19, size: 32, align: 32, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "d_first", scope: !24, file: !23, line: 56, baseType: !52, size: 64, align: 64, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitset", file: !53, line: 12, baseType: !28)
!53 = !DIFile(filename: "Include/bitset.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!54 = !DIDerivedType(tag: DW_TAG_member, name: "s_parent", scope: !16, file: !6, line: 15, baseType: !55, size: 64, align: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "_node", file: !57, line: 10, size: 320, align: 64, elements: !58)
!57 = !DIFile(filename: "Include/node.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!58 = !{!59, !60, !61, !62, !63, !64}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "n_type", scope: !56, file: !57, line: 11, baseType: !44, size: 16, align: 16)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "n_str", scope: !56, file: !57, line: 12, baseType: !28, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "n_lineno", scope: !56, file: !57, line: 13, baseType: !19, size: 32, align: 32, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "n_col_offset", scope: !56, file: !57, line: 14, baseType: !19, size: 32, align: 32, offset: 160)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "n_nchildren", scope: !56, file: !57, line: 15, baseType: !19, size: 32, align: 32, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "n_child", scope: !56, file: !57, line: 16, baseType: !55, size: 64, align: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "s_base", scope: !11, file: !6, line: 20, baseType: !66, size: 288000, align: 64, offset: 64)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 288000, align: 64, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1500)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "p_grammar", scope: !7, file: !6, line: 26, baseType: !70, size: 64, align: 64, offset: 288064)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "grammar", file: !23, line: 67, baseType: !72)
!72 = !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 61, size: 320, align: 64, elements: !73)
!73 = !{!74, !75, !76, !88, !89}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "g_ndfas", scope: !72, file: !23, line: 62, baseType: !19, size: 32, align: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "g_dfa", scope: !72, file: !23, line: 63, baseType: !21, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "g_ll", scope: !72, file: !23, line: 64, baseType: !77, size: 128, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "labellist", file: !23, line: 26, baseType: !78)
!78 = !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 23, size: 128, align: 64, elements: !79)
!79 = !{!80, !81}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ll_nlabels", scope: !78, file: !23, line: 24, baseType: !19, size: 32, align: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ll_label", scope: !78, file: !23, line: 25, baseType: !82, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "label", file: !23, line: 17, baseType: !84)
!84 = !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 14, size: 128, align: 64, elements: !85)
!85 = !{!86, !87}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !84, file: !23, line: 15, baseType: !19, size: 32, align: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "lb_str", scope: !84, file: !23, line: 16, baseType: !28, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "g_start", scope: !72, file: !23, line: 65, baseType: !19, size: 32, align: 32, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "g_accel", scope: !72, file: !23, line: 66, baseType: !19, size: 32, align: 32, offset: 288)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "p_tree", scope: !7, file: !6, line: 27, baseType: !91, size: 64, align: 64, offset: 288128)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "node", file: !57, line: 17, baseType: !56)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "p_flags", scope: !7, file: !6, line: 29, baseType: !94, size: 64, align: 64, offset: 288192)
!94 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!96 = !{!97, !104, !109, !136, !142, !150, !178, !190}
!97 = !DISubprogram(name: "PyParser_New", scope: !1, file: !1, line: 72, type: !98, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: true, function: %struct.parser_state* (%struct.grammar*, i32)* @PyParser_New, variables: !100)
!98 = !DISubroutineType(types: !99)
!99 = !{!4, !70, !19}
!100 = !{!101, !102, !103}
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !97, file: !1, line: 72, type: !70)
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !97, file: !1, line: 72, type: !19)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ps", scope: !97, file: !1, line: 74, type: !4)
!104 = !DISubprogram(name: "PyParser_Delete", scope: !1, file: !1, line: 96, type: !105, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.parser_state*)* @PyParser_Delete, variables: !107)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !4}
!107 = !{!108}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ps", arg: 1, scope: !104, file: !1, line: 96, type: !4)
!109 = !DISubprogram(name: "PyParser_AddToken", scope: !1, file: !1, line: 228, type: !110, isLocal: false, isDefinition: true, scopeLine: 230, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.parser_state*, i32, i8*, i32, i32, i32*)* @PyParser_AddToken, variables: !112)
!110 = !DISubroutineType(types: !111)
!111 = !{!19, !4, !19, !28, !19, !19, !49}
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !121, !125, !126, !129, !134, !135}
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ps", arg: 1, scope: !109, file: !1, line: 228, type: !4)
!114 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 2, scope: !109, file: !1, line: 228, type: !19)
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 3, scope: !109, file: !1, line: 228, type: !28)
!116 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 4, scope: !109, file: !1, line: 229, type: !19)
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "col_offset", arg: 5, scope: !109, file: !1, line: 229, type: !19)
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "expected_ret", arg: 6, scope: !109, file: !1, line: 229, type: !49)
!119 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ilabel", scope: !109, file: !1, line: 231, type: !19)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !109, file: !1, line: 232, type: !19)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !122, file: !1, line: 244, type: !21)
!122 = distinct !DILexicalBlock(scope: !123, file: !1, line: 242, column: 14)
!123 = distinct !DILexicalBlock(scope: !124, file: !1, line: 242, column: 5)
!124 = distinct !DILexicalBlock(scope: !109, file: !1, line: 242, column: 5)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !122, file: !1, line: 245, type: !33)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !127, file: !1, line: 252, type: !19)
!127 = distinct !DILexicalBlock(scope: !128, file: !1, line: 251, column: 58)
!128 = distinct !DILexicalBlock(scope: !122, file: !1, line: 251, column: 13)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nt", scope: !130, file: !1, line: 256, type: !19)
!130 = distinct !DILexicalBlock(scope: !131, file: !1, line: 254, column: 33)
!131 = distinct !DILexicalBlock(scope: !132, file: !1, line: 254, column: 21)
!132 = distinct !DILexicalBlock(scope: !133, file: !1, line: 253, column: 26)
