; ModuleID = 'pgen.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.grammar = type { i32, %struct.dfa*, %struct.labellist, i32, i32 }
%struct.dfa = type { i32, i8*, i32, i32, %struct.state*, i8* }
%struct.state = type { i32, %struct.arc*, i32, i32, i32*, i32 }
%struct.arc = type { i16, i16 }
%struct.labellist = type { i32, %struct.label* }
%struct.label = type { i32, i8* }
%struct._node = type { i16, i8*, i32, i32, i32, %struct._node* }
%struct._nfa = type { i32, i8*, i32, %struct._nfastate*, i32, i32 }
%struct._nfastate = type { i32, %struct._nfaarc* }
%struct._nfaarc = type { i32, i32 }
%struct._ss_state = type { i8*, i32, %struct._ss_arc*, i32, i32, i32 }
%struct._ss_arc = type { i8*, i32, i32 }

@Py_DebugFlag = external global i32, align 4
@.str.1 = private unnamed_addr constant [27 x i8] c"no mem for new nfa grammar\00", align 1
@.str.2 = private unnamed_addr constant [6 x i8] c"EMPTY\00", align 1
@.str.3 = private unnamed_addr constant [11 x i8] c"out of mem\00", align 1
@newnfa.type = internal unnamed_addr global i32 256, align 4
@.str.4 = private unnamed_addr constant [19 x i8] c"no mem for new nfa\00", align 1
@.str.5 = private unnamed_addr constant [26 x i8] c"Dump of NFA for '%s' ...\0A\00", align 1
@.str.6 = private unnamed_addr constant [25 x i8] c"Making DFA for '%s' ...\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !70, globals: !335)
!1 = !DIFile(filename: "Parser/pgen.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !49, !11, !12, !22, !28, !50, !68}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfagrammar", file: !1, line: 99, baseType: !6)
!6 = !DICompositeType(tag: DW_TAG_structure_type, name: "_nfagrammar", file: !1, line: 95, size: 256, align: 64, elements: !7)
!7 = !{!8, !10, !36}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "gr_nnfas", scope: !6, file: !1, line: 96, baseType: !9, size: 32, align: 32)
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "gr_nfa", scope: !6, file: !1, line: 97, baseType: !11, size: 64, align: 64, offset: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfa", file: !1, line: 35, baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "_nfa", file: !1, line: 29, size: 320, align: 64, elements: !15)
!15 = !{!16, !17, !20, !21, !34, !35}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "nf_type", scope: !14, file: !1, line: 30, baseType: !9, size: 32, align: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "nf_name", scope: !14, file: !1, line: 31, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "nf_nstates", scope: !14, file: !1, line: 32, baseType: !9, size: 32, align: 32, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "nf_state", scope: !14, file: !1, line: 33, baseType: !22, size: 64, align: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfastate", file: !1, line: 27, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "_nfastate", file: !1, line: 24, size: 128, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "st_narcs", scope: !24, file: !1, line: 25, baseType: !9, size: 32, align: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "st_arc", scope: !24, file: !1, line: 26, baseType: !28, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfaarc", file: !1, line: 22, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_nfaarc", file: !1, line: 19, size: 64, align: 32, elements: !31)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ar_label", scope: !30, file: !1, line: 20, baseType: !9, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ar_arrow", scope: !30, file: !1, line: 21, baseType: !9, size: 32, align: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "nf_start", scope: !14, file: !1, line: 34, baseType: !9, size: 32, align: 32, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "nf_finish", scope: !14, file: !1, line: 34, baseType: !9, size: 32, align: 32, offset: 288)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "gr_ll", scope: !6, file: !1, line: 98, baseType: !37, size: 128, align: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "labellist", file: !38, line: 26, baseType: !39)
!38 = !DIFile(filename: "Include/grammar.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!39 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 23, size: 128, align: 64, elements: !40)
!40 = !{!41, !42}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ll_nlabels", scope: !39, file: !38, line: 24, baseType: !9, size: 32, align: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ll_label", scope: !39, file: !38, line: 25, baseType: !43, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "label", file: !38, line: 17, baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 14, size: 128, align: 64, elements: !46)
!46 = !{!47, !48}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !45, file: !38, line: 15, baseType: !9, size: 32, align: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "lb_str", scope: !45, file: !38, line: 16, baseType: !18, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ss_state", file: !1, line: 372, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ss_state", file: !1, line: 365, size: 320, align: 64, elements: !53)
!53 = !{!54, !57, !58, !65, !66, !67}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ss_ss", scope: !52, file: !1, line: 366, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitset", file: !56, line: 12, baseType: !18)
!56 = !DIFile(filename: "Include/bitset.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ss_narcs", scope: !52, file: !1, line: 367, baseType: !9, size: 32, align: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ss_arc", scope: !52, file: !1, line: 368, baseType: !59, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ss_arc", file: !1, line: 359, size: 128, align: 64, elements: !61)
!61 = !{!62, !63, !64}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "sa_bitset", scope: !60, file: !1, line: 360, baseType: !55, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "sa_arrow", scope: !60, file: !1, line: 361, baseType: !9, size: 32, align: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "sa_label", scope: !60, file: !1, line: 362, baseType: !9, size: 32, align: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ss_deleted", scope: !52, file: !1, line: 369, baseType: !9, size: 32, align: 32, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ss_finish", scope: !52, file: !1, line: 370, baseType: !9, size: 32, align: 32, offset: 224)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ss_rename", scope: !52, file: !1, line: 371, baseType: !9, size: 32, align: 32, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ss_arc", file: !1, line: 363, baseType: !60)
!70 = !{!71, !127, !130, !137, !142, !149, !156, !162, !175, !185, !195, !203, !209, !219, !228, !235, !245, !272, !284, !298, !307, !314, !324}
!71 = !DISubprogram(name: "_Py_pgen", scope: !1, file: !1, line: 662, type: !72, isLocal: false, isDefinition: true, scopeLine: 663, flags: DIFlagPrototyped, isOptimized: true, function: %struct.grammar* (%struct._node*)* @_Py_pgen, variables: !123)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !111}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "grammar", file: !38, line: 67, baseType: !76)
!76 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 61, size: 320, align: 64, elements: !77)
!77 = !{!78, !79, !108, !109, !110}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "g_ndfas", scope: !76, file: !38, line: 62, baseType: !9, size: 32, align: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "g_dfa", scope: !76, file: !38, line: 63, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "dfa", file: !38, line: 57, baseType: !82)
!82 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 50, size: 320, align: 64, elements: !83)
!83 = !{!84, !85, !86, !87, !88, !107}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !82, file: !38, line: 51, baseType: !9, size: 32, align: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !82, file: !38, line: 52, baseType: !18, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "d_initial", scope: !82, file: !38, line: 53, baseType: !9, size: 32, align: 32, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "d_nstates", scope: !82, file: !38, line: 54, baseType: !9, size: 32, align: 32, offset: 160)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "d_state", scope: !82, file: !38, line: 55, baseType: !89, size: 64, align: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "state", file: !38, line: 46, baseType: !91)
!91 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 37, size: 320, align: 64, elements: !92)
!92 = !{!93, !94, !102, !103, !104, !106}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "s_narcs", scope: !91, file: !38, line: 38, baseType: !9, size: 32, align: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "s_arc", scope: !91, file: !38, line: 39, baseType: !95, size: 64, align: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc", file: !38, line: 33, baseType: !97)
!97 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 30, size: 32, align: 16, elements: !98)
!98 = !{!99, !101}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "a_lbl", scope: !97, file: !38, line: 31, baseType: !100, size: 16, align: 16)
!100 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "a_arrow", scope: !97, file: !38, line: 32, baseType: !100, size: 16, align: 16, offset: 16)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "s_lower", scope: !91, file: !38, line: 42, baseType: !9, size: 32, align: 32, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "s_upper", scope: !91, file: !38, line: 43, baseType: !9, size: 32, align: 32, offset: 160)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "s_accel", scope: !91, file: !38, line: 44, baseType: !105, size: 64, align: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "s_accept", scope: !91, file: !38, line: 45, baseType: !9, size: 32, align: 32, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "d_first", scope: !82, file: !38, line: 56, baseType: !55, size: 64, align: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "g_ll", scope: !76, file: !38, line: 64, baseType: !37, size: 128, align: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "g_start", scope: !76, file: !38, line: 65, baseType: !9, size: 32, align: 32, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "g_accel", scope: !76, file: !38, line: 66, baseType: !9, size: 32, align: 32, offset: 288)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "node", file: !113, line: 17, baseType: !114)
!113 = !DIFile(filename: "Include/node.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "_node", file: !113, line: 10, size: 320, align: 64, elements: !115)
!115 = !{!116, !117, !118, !119, !120, !121}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "n_type", scope: !114, file: !113, line: 11, baseType: !100, size: 16, align: 16)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "n_str", scope: !114, file: !113, line: 12, baseType: !18, size: 64, align: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "n_lineno", scope: !114, file: !113, line: 13, baseType: !9, size: 32, align: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "n_col_offset", scope: !114, file: !113, line: 14, baseType: !9, size: 32, align: 32, offset: 160)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "n_nchildren", scope: !114, file: !113, line: 15, baseType: !9, size: 32, align: 32, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "n_child", scope: !114, file: !113, line: 16, baseType: !122, size: 64, align: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!123 = !{!124, !125, !126}
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !71, file: !1, line: 662, type: !111)
!125 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gr", scope: !71, file: !1, line: 664, type: !4)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !71, file: !1, line: 665, type: !74)
!127 = !DISubprogram(name: "Py_pgen", scope: !1, file: !1, line: 676, type: !72, isLocal: false, isDefinition: true, scopeLine: 677, flags: DIFlagPrototyped, isOptimized: true, function: %struct.grammar* (%struct._node*)* @Py_pgen, variables: !128)
!128 = !{!129}
!129 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !127, file: !1, line: 676, type: !111)
!130 = !DISubprogram(name: "metacompile", scope: !1, file: !1, line: 150, type: !131, isLocal: true, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: true, variables: !133)
!131 = !DISubroutineType(types: !132)
!132 = !{!4, !111}
!133 = !{!134, !135, !136}
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !130, file: !1, line: 150, type: !111)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gr", scope: !130, file: !1, line: 152, type: !4)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !130, file: !1, line: 153, type: !9)
!137 = !DISubprogram(name: "newnfagrammar", scope: !1, file: !1, line: 105, type: !138, isLocal: true, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, variables: !140)
!138 = !DISubroutineType(types: !139)
!139 = !{!4}
!140 = !{!141}
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gr", scope: !137, file: !1, line: 107, type: !4)
!142 = !DISubprogram(name: "compile_rule", scope: !1, file: !1, line: 169, type: !143, isLocal: true, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: true, variables: !145)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !4, !111}
!145 = !{!146, !147, !148}
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gr", arg: 1, scope: !142, file: !1, line: 169, type: !4)
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !142, file: !1, line: 169, type: !111)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nf", scope: !142, file: !1, line: 171, type: !12)
!149 = !DISubprogram(name: "addnfa", scope: !1, file: !1, line: 121, type: !150, isLocal: true, isDefinition: true, scopeLine: 122, flags: DIFlagPrototyped, isOptimized: true, variables: !152)
!150 = !DISubroutineType(types: !151)
!151 = !{!12, !4, !18}
!152 = !{!153, !154, !155}
!153 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gr", arg: 1, scope: !149, file: !1, line: 121, type: !4)
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !149, file: !1, line: 121, type: !18)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nf", scope: !149, file: !1, line: 123, type: !12)
!156 = !DISubprogram(name: "newnfa", scope: !1, file: !1, line: 79, type: !157, isLocal: true, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: true, variables: !159)
!157 = !DISubroutineType(types: !158)
!158 = !{!12, !18}
!159 = !{!160, !161}
!160 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !156, file: !1, line: 79, type: !18)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nf", scope: !156, file: !1, line: 81, type: !12)
!162 = !DISubprogram(name: "compile_rhs", scope: !1, file: !1, line: 188, type: !163, isLocal: true, isDefinition: true, scopeLine: 189, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.labellist*, %struct._nfa*, i32, %struct._node*, i32*, i32*)* @compile_rhs, variables: !166)
!163 = !DISubroutineType(types: !164)
