; ModuleID = 'posixmodule.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!215 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!216 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!217 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!218 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!219 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!220 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!221 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !222, line: 57, size: 32, align: 32, elements: !223)
!222 = !DIFile(filename: "Include/pytime.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!223 = !{!224, !225}
!224 = !DIEnumerator(name: "_PyTime_ROUND_DOWN", value: 0)
!225 = !DIEnumerator(name: "_PyTime_ROUND_UP", value: 1)
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !227, line: 100, size: 32, align: 32, elements: !228)
!227 = !DIFile(filename: "/usr/include/sys/wait.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!228 = !{!229, !230, !231}
!229 = !DIEnumerator(name: "P_ALL", value: 0)
!230 = !DIEnumerator(name: "P_PID", value: 1)
!231 = !DIEnumerator(name: "P_PGID", value: 2)
!232 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__priority_which", file: !233, line: 292, size: 32, align: 32, elements: !234)
!233 = !DIFile(filename: "/usr/include/bits/resource.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!234 = !{!235, !236, !237}
!235 = !DIEnumerator(name: "PRIO_PROCESS", value: 0)
!236 = !DIEnumerator(name: "PRIO_PGRP", value: 1)
!237 = !DIEnumerator(name: "PRIO_USER", value: 2)
!238 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !239, line: 80, size: 32, align: 32, elements: !240)
!239 = !DIFile(filename: "/usr/include/bits/statvfs.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252}
!241 = !DIEnumerator(name: "ST_RDONLY", value: 1)
!242 = !DIEnumerator(name: "ST_NOSUID", value: 2)
!243 = !DIEnumerator(name: "ST_NODEV", value: 4)
!244 = !DIEnumerator(name: "ST_NOEXEC", value: 8)
!245 = !DIEnumerator(name: "ST_SYNCHRONOUS", value: 16)
!246 = !DIEnumerator(name: "ST_MANDLOCK", value: 64)
!247 = !DIEnumerator(name: "ST_WRITE", value: 128)
!248 = !DIEnumerator(name: "ST_APPEND", value: 256)
!249 = !DIEnumerator(name: "ST_IMMUTABLE", value: 512)
!250 = !DIEnumerator(name: "ST_NOATIME", value: 1024)
!251 = !DIEnumerator(name: "ST_NODIRATIME", value: 2048)
!252 = !DIEnumerator(name: "ST_RELATIME", value: 4096)
!253 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !254, line: 246, size: 32, align: 32, elements: !255)
!254 = !DIFile(filename: "/usr/include/bits/siginfo.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!255 = !{!256, !257, !258, !259, !260, !261}
!256 = !DIEnumerator(name: "CLD_EXITED", value: 1)
!257 = !DIEnumerator(name: "CLD_KILLED", value: 2)
!258 = !DIEnumerator(name: "CLD_DUMPED", value: 3)
!259 = !DIEnumerator(name: "CLD_TRAPPED", value: 4)
!260 = !DIEnumerator(name: "CLD_STOPPED", value: 5)
!261 = !DIEnumerator(name: "CLD_CONTINUED", value: 6)
!262 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !263, line: 29, size: 32, align: 32, elements: !264)
!263 = !DIFile(filename: "/usr/include/sys/xattr.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!264 = !{!265, !266}
!265 = !DIEnumerator(name: "XATTR_CREATE", value: 1)
!266 = !DIEnumerator(name: "XATTR_REPLACE", value: 2)
!267 = !{!268, !273, !275, !276, !287, !366, !612, !613, !314, !614, !630, !631, !639, !647, !648, !651, !364, !282, !652, !322, !653, !655, !656, !658, !667, !669, !671, !505, !272, !677, !349, !678, !684, !687}
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !269, line: 80, baseType: !270)
!269 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !271, line: 134, baseType: !272)
!271 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!272 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !269, line: 65, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !271, line: 135, baseType: !272)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !278, line: 109, baseType: !279)
!278 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !278, line: 105, size: 128, align: 64, elements: !280)
!280 = !{!281, !288}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !279, file: !278, line: 107, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !283, line: 177, baseType: !284)
!283 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !285, line: 102, baseType: !286)
!285 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !271, line: 181, baseType: !287)
!287 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !279, file: !278, line: 108, baseType: !289, size: 64, align: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !278, line: 334, size: 3200, align: 64, elements: !291)
!291 = !{!292, !298, !302, !303, !304, !309, !372, !377, !382, !383, !388, !440, !471, !483, !489, !490, !491, !493, !495, !526, !527, !528, !537, !538, !543, !544, !546, !548, !558, !561, !579, !580, !581, !583, !585, !586, !588, !593, !598, !603, !604, !605, !606, !607, !608, !609, !610, !611}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !290, file: !278, line: 335, baseType: !293, size: 192, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !278, line: 114, baseType: !294)
!294 = !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 111, size: 192, align: 64, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !294, file: !278, line: 112, baseType: !277, size: 128, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !294, file: !278, line: 113, baseType: !282, size: 64, align: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !290, file: !278, line: 336, baseType: !299, size: 64, align: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !301)
!301 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !290, file: !278, line: 337, baseType: !282, size: 64, align: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !290, file: !278, line: 337, baseType: !282, size: 64, align: 64, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !290, file: !278, line: 341, baseType: !305, size: 64, align: 64, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !278, line: 308, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !276}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !290, file: !278, line: 342, baseType: !310, size: 64, align: 64, offset: 448)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !278, line: 314, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!314, !276, !315, !314}
!314 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !285, line: 48, baseType: !317)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !318, line: 246, size: 1728, align: 64, elements: !319)
!318 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!319 = !{!320, !321, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !341, !342, !343, !344, !346, !348, !350, !354, !357, !359, !360, !361, !362, !363, !367, !368}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !317, file: !318, line: 247, baseType: !314, size: 32, align: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !317, file: !318, line: 252, baseType: !322, size: 64, align: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !317, file: !318, line: 253, baseType: !322, size: 64, align: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !317, file: !318, line: 254, baseType: !322, size: 64, align: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !317, file: !318, line: 255, baseType: !322, size: 64, align: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !317, file: !318, line: 256, baseType: !322, size: 64, align: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !317, file: !318, line: 257, baseType: !322, size: 64, align: 64, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !317, file: !318, line: 258, baseType: !322, size: 64, align: 64, offset: 448)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !317, file: !318, line: 259, baseType: !322, size: 64, align: 64, offset: 512)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !317, file: !318, line: 261, baseType: !322, size: 64, align: 64, offset: 576)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !317, file: !318, line: 262, baseType: !322, size: 64, align: 64, offset: 640)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !317, file: !318, line: 263, baseType: !322, size: 64, align: 64, offset: 704)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !317, file: !318, line: 265, baseType: !334, size: 64, align: 64, offset: 768)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !318, line: 161, size: 192, align: 64, elements: !336)
!336 = !{!337, !338, !340}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !335, file: !318, line: 162, baseType: !334, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !335, file: !318, line: 163, baseType: !339, size: 64, align: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !335, file: !318, line: 167, baseType: !314, size: 32, align: 32, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !317, file: !318, line: 267, baseType: !339, size: 64, align: 64, offset: 832)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !317, file: !318, line: 269, baseType: !314, size: 32, align: 32, offset: 896)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !317, file: !318, line: 273, baseType: !314, size: 32, align: 32, offset: 928)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !317, file: !318, line: 275, baseType: !345, size: 64, align: 64, offset: 960)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !271, line: 140, baseType: !287)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !317, file: !318, line: 279, baseType: !347, size: 16, align: 16, offset: 1024)
!347 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !317, file: !318, line: 280, baseType: !349, size: 8, align: 8, offset: 1040)
!349 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !317, file: !318, line: 281, baseType: !351, size: 8, align: 8, offset: 1048)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 8, align: 8, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 1)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !317, file: !318, line: 285, baseType: !355, size: 64, align: 64, offset: 1088)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !318, line: 155, baseType: null)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !317, file: !318, line: 294, baseType: !358, size: 64, align: 64, offset: 1152)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !271, line: 141, baseType: !287)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !317, file: !318, line: 303, baseType: !275, size: 64, align: 64, offset: 1216)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !317, file: !318, line: 304, baseType: !275, size: 64, align: 64, offset: 1280)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !317, file: !318, line: 305, baseType: !275, size: 64, align: 64, offset: 1344)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !317, file: !318, line: 306, baseType: !275, size: 64, align: 64, offset: 1408)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !317, file: !318, line: 307, baseType: !364, size: 64, align: 64, offset: 1472)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !365, line: 62, baseType: !366)
!365 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!366 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !317, file: !318, line: 309, baseType: !314, size: 32, align: 32, offset: 1536)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !317, file: !318, line: 311, baseType: !369, size: 160, align: 8, offset: 1568)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 160, align: 8, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 20)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !290, file: !278, line: 343, baseType: !373, size: 64, align: 64, offset: 512)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !278, line: 316, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!276, !276, !322}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !290, file: !278, line: 344, baseType: !378, size: 64, align: 64, offset: 576)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !278, line: 318, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!314, !276, !322, !276}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !290, file: !278, line: 345, baseType: !275, size: 64, align: 64, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !290, file: !278, line: 346, baseType: !384, size: 64, align: 64, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !278, line: 320, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!276, !276}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !290, file: !278, line: 350, baseType: !389, size: 64, align: 64, offset: 768)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !278, line: 278, baseType: !391)
!391 = !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 236, size: 2176, align: 64, elements: !392)
!392 = !{!393, !398, !399, !400, !401, !402, !407, !409, !410, !411, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !391, file: !278, line: 241, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !278, line: 166, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!276, !276, !276}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !391, file: !278, line: 242, baseType: !394, size: 64, align: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !391, file: !278, line: 243, baseType: !394, size: 64, align: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !391, file: !278, line: 244, baseType: !394, size: 64, align: 64, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !391, file: !278, line: 245, baseType: !394, size: 64, align: 64, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !391, file: !278, line: 246, baseType: !403, size: 64, align: 64, offset: 320)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !278, line: 167, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!276, !276, !276, !276}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !391, file: !278, line: 247, baseType: !408, size: 64, align: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !278, line: 165, baseType: !385)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !391, file: !278, line: 248, baseType: !408, size: 64, align: 64, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !391, file: !278, line: 249, baseType: !408, size: 64, align: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !391, file: !278, line: 250, baseType: !412, size: 64, align: 64, offset: 576)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !278, line: 168, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!314, !276}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !391, file: !278, line: 251, baseType: !408, size: 64, align: 64, offset: 640)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !391, file: !278, line: 252, baseType: !394, size: 64, align: 64, offset: 704)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !391, file: !278, line: 253, baseType: !394, size: 64, align: 64, offset: 768)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !391, file: !278, line: 254, baseType: !394, size: 64, align: 64, offset: 832)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !391, file: !278, line: 255, baseType: !394, size: 64, align: 64, offset: 896)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !391, file: !278, line: 256, baseType: !394, size: 64, align: 64, offset: 960)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !391, file: !278, line: 257, baseType: !408, size: 64, align: 64, offset: 1024)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !391, file: !278, line: 258, baseType: !275, size: 64, align: 64, offset: 1088)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !391, file: !278, line: 259, baseType: !408, size: 64, align: 64, offset: 1152)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !391, file: !278, line: 261, baseType: !394, size: 64, align: 64, offset: 1216)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !391, file: !278, line: 262, baseType: !394, size: 64, align: 64, offset: 1280)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !391, file: !278, line: 263, baseType: !394, size: 64, align: 64, offset: 1344)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !391, file: !278, line: 264, baseType: !394, size: 64, align: 64, offset: 1408)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !391, file: !278, line: 265, baseType: !403, size: 64, align: 64, offset: 1472)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !391, file: !278, line: 266, baseType: !394, size: 64, align: 64, offset: 1536)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !391, file: !278, line: 267, baseType: !394, size: 64, align: 64, offset: 1600)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !391, file: !278, line: 268, baseType: !394, size: 64, align: 64, offset: 1664)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !391, file: !278, line: 269, baseType: !394, size: 64, align: 64, offset: 1728)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !391, file: !278, line: 270, baseType: !394, size: 64, align: 64, offset: 1792)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !391, file: !278, line: 272, baseType: !394, size: 64, align: 64, offset: 1856)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !391, file: !278, line: 273, baseType: !394, size: 64, align: 64, offset: 1920)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !391, file: !278, line: 274, baseType: !394, size: 64, align: 64, offset: 1984)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !391, file: !278, line: 275, baseType: !394, size: 64, align: 64, offset: 2048)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !391, file: !278, line: 277, baseType: !408, size: 64, align: 64, offset: 2112)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !290, file: !278, line: 351, baseType: !441, size: 64, align: 64, offset: 832)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !278, line: 292, baseType: !443)
!443 = !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 280, size: 640, align: 64, elements: !444)
!444 = !{!445, !450, !451, !456, !457, !458, !463, !464, !469, !470}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !443, file: !278, line: 281, baseType: !446, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !278, line: 169, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!282, !276}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !443, file: !278, line: 282, baseType: !394, size: 64, align: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !443, file: !278, line: 283, baseType: !452, size: 64, align: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !278, line: 170, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!276, !276, !282}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !443, file: !278, line: 284, baseType: !452, size: 64, align: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !443, file: !278, line: 285, baseType: !275, size: 64, align: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !443, file: !278, line: 286, baseType: !459, size: 64, align: 64, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !278, line: 172, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!314, !276, !282, !276}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !443, file: !278, line: 287, baseType: !275, size: 64, align: 64, offset: 384)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !443, file: !278, line: 288, baseType: !465, size: 64, align: 64, offset: 448)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !278, line: 231, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!314, !276, !276}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !443, file: !278, line: 290, baseType: !394, size: 64, align: 64, offset: 512)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !443, file: !278, line: 291, baseType: !452, size: 64, align: 64, offset: 576)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !290, file: !278, line: 352, baseType: !472, size: 64, align: 64, offset: 896)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !278, line: 298, baseType: !474)
!474 = !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 294, size: 192, align: 64, elements: !475)
!475 = !{!476, !477, !478}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !474, file: !278, line: 295, baseType: !446, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !474, file: !278, line: 296, baseType: !394, size: 64, align: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !474, file: !278, line: 297, baseType: !479, size: 64, align: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !278, line: 174, baseType: !480)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!314, !276, !276, !276}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !290, file: !278, line: 356, baseType: !484, size: 64, align: 64, offset: 960)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !278, line: 321, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!488, !276}
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !283, line: 186, baseType: !282)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !290, file: !278, line: 357, baseType: !403, size: 64, align: 64, offset: 1024)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !290, file: !278, line: 358, baseType: !384, size: 64, align: 64, offset: 1088)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !290, file: !278, line: 359, baseType: !492, size: 64, align: 64, offset: 1152)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !278, line: 317, baseType: !395)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !290, file: !278, line: 360, baseType: !494, size: 64, align: 64, offset: 1216)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !278, line: 319, baseType: !480)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !290, file: !278, line: 363, baseType: !496, size: 64, align: 64, offset: 1280)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !278, line: 304, baseType: !498)
!498 = !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 301, size: 128, align: 64, elements: !499)
!499 = !{!500, !521}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !498, file: !278, line: 302, baseType: !501, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !278, line: 193, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64, align: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!314, !276, !505, !314}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !278, line: 191, baseType: !507)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !278, line: 178, size: 640, align: 64, elements: !508)
!508 = !{!509, !510, !511, !512, !513, !514, !515, !516, !518, !519, !520}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !507, file: !278, line: 179, baseType: !275, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !507, file: !278, line: 180, baseType: !276, size: 64, align: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !507, file: !278, line: 181, baseType: !282, size: 64, align: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !507, file: !278, line: 182, baseType: !282, size: 64, align: 64, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !507, file: !278, line: 184, baseType: !314, size: 32, align: 32, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !507, file: !278, line: 185, baseType: !314, size: 32, align: 32, offset: 288)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !507, file: !278, line: 186, baseType: !322, size: 64, align: 64, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !507, file: !278, line: 187, baseType: !517, size: 64, align: 64, offset: 384)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !507, file: !278, line: 188, baseType: !517, size: 64, align: 64, offset: 448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !507, file: !278, line: 189, baseType: !517, size: 64, align: 64, offset: 512)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !507, file: !278, line: 190, baseType: !275, size: 64, align: 64, offset: 576)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !498, file: !278, line: 303, baseType: !522, size: 64, align: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !278, line: 194, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !276, !505}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !290, file: !278, line: 366, baseType: !366, size: 64, align: 64, offset: 1344)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !290, file: !278, line: 368, baseType: !299, size: 64, align: 64, offset: 1408)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !290, file: !278, line: 372, baseType: !529, size: 64, align: 64, offset: 1472)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !278, line: 233, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!314, !276, !533, !275}
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !278, line: 232, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!314, !276, !275}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !290, file: !278, line: 375, baseType: !412, size: 64, align: 64, offset: 1536)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !290, file: !278, line: 379, baseType: !539, size: 64, align: 64, offset: 1600)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !278, line: 322, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!276, !276, !276, !314}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !290, file: !278, line: 382, baseType: !282, size: 64, align: 64, offset: 1664)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !290, file: !278, line: 385, baseType: !545, size: 64, align: 64, offset: 1728)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !278, line: 323, baseType: !385)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !290, file: !278, line: 386, baseType: !547, size: 64, align: 64, offset: 1792)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !278, line: 324, baseType: !385)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !290, file: !278, line: 389, baseType: !549, size: 64, align: 64, offset: 1856)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64, align: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !551, line: 40, size: 256, align: 64, elements: !552)
!551 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!552 = !{!553, !554, !556, !557}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !550, file: !551, line: 41, baseType: !299, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !550, file: !551, line: 42, baseType: !555, size: 64, align: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !551, line: 18, baseType: !395)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !550, file: !551, line: 43, baseType: !314, size: 32, align: 32, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !550, file: !551, line: 45, baseType: !299, size: 64, align: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !290, file: !278, line: 390, baseType: !559, size: 64, align: 64, offset: 1920)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !278, line: 390, flags: DIFlagFwdDecl)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !290, file: !278, line: 391, baseType: !562, size: 64, align: 64, offset: 1984)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !564, line: 11, size: 320, align: 64, elements: !565)
!564 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!565 = !{!566, !567, !572, !577, !578}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !563, file: !564, line: 12, baseType: !322, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !563, file: !564, line: 13, baseType: !568, size: 64, align: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !564, line: 8, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64, align: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!276, !276, !275}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !563, file: !564, line: 14, baseType: !573, size: 64, align: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !564, line: 9, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64, align: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!314, !276, !276, !275}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !563, file: !564, line: 15, baseType: !322, size: 64, align: 64, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !563, file: !564, line: 16, baseType: !275, size: 64, align: 64, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !290, file: !278, line: 392, baseType: !289, size: 64, align: 64, offset: 2048)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !290, file: !278, line: 393, baseType: !276, size: 64, align: 64, offset: 2112)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !290, file: !278, line: 394, baseType: !582, size: 64, align: 64, offset: 2176)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !278, line: 325, baseType: !404)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !290, file: !278, line: 395, baseType: !584, size: 64, align: 64, offset: 2240)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !278, line: 326, baseType: !480)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !290, file: !278, line: 396, baseType: !282, size: 64, align: 64, offset: 2304)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !290, file: !278, line: 397, baseType: !587, size: 64, align: 64, offset: 2368)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !278, line: 327, baseType: !480)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !290, file: !278, line: 398, baseType: !589, size: 64, align: 64, offset: 2432)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !278, line: 329, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64, align: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!276, !289, !282}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !290, file: !278, line: 399, baseType: !594, size: 64, align: 64, offset: 2496)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !278, line: 328, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!276, !289, !276, !276}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !290, file: !278, line: 400, baseType: !599, size: 64, align: 64, offset: 2560)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !278, line: 307, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64, align: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !275}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !290, file: !278, line: 401, baseType: !412, size: 64, align: 64, offset: 2624)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !290, file: !278, line: 402, baseType: !276, size: 64, align: 64, offset: 2688)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !290, file: !278, line: 403, baseType: !276, size: 64, align: 64, offset: 2752)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !290, file: !278, line: 404, baseType: !276, size: 64, align: 64, offset: 2816)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !290, file: !278, line: 405, baseType: !276, size: 64, align: 64, offset: 2880)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !290, file: !278, line: 406, baseType: !276, size: 64, align: 64, offset: 2944)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !290, file: !278, line: 407, baseType: !305, size: 64, align: 64, offset: 3008)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !290, file: !278, line: 410, baseType: !272, size: 32, align: 32, offset: 3072)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !290, file: !278, line: 412, baseType: !305, size: 64, align: 64, offset: 3136)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "path_t", file: !1, line: 775, baseType: !616)
!616 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 764, size: 576, align: 64, elements: !617)
!617 = !{!618, !619, !620, !621, !622, !625, !626, !627, !628, !629}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "function_name", scope: !616, file: !1, line: 765, baseType: !299, size: 64, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "argument_name", scope: !616, file: !1, line: 766, baseType: !299, size: 64, align: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "nullable", scope: !616, file: !1, line: 767, baseType: !314, size: 32, align: 32, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "allow_fd", scope: !616, file: !1, line: 768, baseType: !314, size: 32, align: 32, offset: 160)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "wide", scope: !616, file: !1, line: 769, baseType: !623, size: 64, align: 64, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !365, line: 90, baseType: !314)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "narrow", scope: !616, file: !1, line: 770, baseType: !322, size: 64, align: 64, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !616, file: !1, line: 771, baseType: !314, size: 32, align: 32, offset: 320)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !616, file: !1, line: 772, baseType: !282, size: 64, align: 64, offset: 384)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !616, file: !1, line: 773, baseType: !276, size: 64, align: 64, offset: 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !616, file: !1, line: 774, baseType: !276, size: 64, align: 64, offset: 512)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64, align: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !633, line: 41, baseType: !634)
!633 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!634 = !DICompositeType(tag: DW_TAG_structure_type, file: !633, line: 31, size: 320, align: 64, elements: !635)
!635 = !{!636, !637, !638}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !634, file: !633, line: 32, baseType: !293, size: 192, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !634, file: !633, line: 33, baseType: !488, size: 64, align: 64, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !634, file: !633, line: 34, baseType: !351, size: 8, align: 8, offset: 256)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !641, line: 33, baseType: !642)
!641 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!642 = !DICompositeType(tag: DW_TAG_structure_type, file: !641, line: 25, size: 256, align: 64, elements: !643)
!643 = !{!644, !645}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !642, file: !641, line: 26, baseType: !293, size: 192, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !642, file: !641, line: 27, baseType: !646, size: 64, align: 64, offset: 192)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 64, align: 64, elements: !352)
!647 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_t", file: !649, line: 59, baseType: !650)
!649 = !DIFile(filename: "/usr/include/time.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !271, line: 144, baseType: !287)
!651 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "__cpu_mask", file: !654, line: 119, baseType: !366)
!654 = !DIFile(filename: "/usr/include/bits/sched.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64, align: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64, align: 64)
!657 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !653)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !660, line: 40, baseType: !661)
!660 = !DIFile(filename: "Include/listobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!661 = !DICompositeType(tag: DW_TAG_structure_type, file: !660, line: 23, size: 320, align: 64, elements: !662)
!662 = !{!663, !664, !666}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !661, file: !660, line: 24, baseType: !293, size: 192, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !661, file: !660, line: 26, baseType: !665, size: 64, align: 64, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !661, file: !660, line: 39, baseType: !282, size: 64, align: 64, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !278, line: 422, baseType: !290)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !285, line: 92, baseType: !358)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64, align: 64)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !673, line: 43, size: 128, align: 64, elements: !674)
!673 = !DIFile(filename: "/usr/include/bits/uio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !672, file: !673, line: 45, baseType: !275, size: 64, align: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !672, file: !673, line: 46, baseType: !364, size: 64, align: 64, offset: 64)
!677 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !680)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "constdef", file: !1, line: 9331, size: 128, align: 64, elements: !681)
!681 = !{!682, !683}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !680, file: !1, line: 9332, baseType: !322, size: 64, align: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !680, file: !1, line: 9333, baseType: !287, size: 64, align: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStructSequence", file: !686, line: 35, baseType: !640)
!686 = !DIFile(filename: "Include/structseq.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!688 = !{!689, !694, !699, !712, !725, !745, !780, !805, !817, !825, !928, !935, !942, !947, !974, !980, !988, !992, !997, !1011, !1050, !1063, !1074, !1091, !1100, !1107, !1109, !1119, !1133, !1142, !1156, !1166, !1176, !1180, !1195, !1204, !1207, !1219, !1222, !1236, !1242, !1250, !1327, !1336, !1348, !1354, !1361, !1369, !1384, !1389, !1408, !1413, !1424, !1429, !1442, !1453, !1458, !1509, !1520, !1553, !1569, !1582, !1593, !1601, !1607, !1620, !1660, !1665, !1688, !1706, !1716, !1723, !1735, !1784, !1792, !1798, !1804, !1819, !1825, !1831, !1837, !1845, !1852, !1856, !1901, !1931, !1937, !1944, !1948, !1952, !1956, !1974, !1996, !2000, !2004, !2008, !2012, !2019, !2025, !2031, !2036, !2041, !2046, !2052, !2058, !2063, !2085, !2095, !2101, !2105, !2113, !2203, !2221, !2231, !2309, !2318, !2324, !2328, !2334, !2340, !2346, !2360, !2368, !2377, !2382, !2387, !2405, !2415, !2419, !2430, !2444, !2456, !2481, !2489, !2504, !2514, !2526, !2536, !2553, !2562, !2567, !2580, !2587, !2599, !2612, !2620, !2627, !2632, !2638, !2643, !2646, !2652, !2658, !2667, !2678, !2688, !2699, !2726, !2738, !2744, !2748, !2761, !2765, !2771, !2775, !2780, !2785, !2790, !2795, !2800, !2805, !2810, !2815, !2841, !2851, !2862, !2876, !2882, !2902, !2911, !2915, !2925, !2929, !2940, !2944, !2950, !2961, !2968, !2975, !2982, !2989, !3003, !3025, !3037, !3075, !3096, !3100, !3106, !3112, !3130, !3133, !3136, !3161, !3174, !3190, !3197, !3203, !3209, !3213, !3218, !3222}
!689 = !DISubprogram(name: "_PyLong_FromUid", scope: !1, file: !1, line: 396, type: !690, isLocal: false, isDefinition: true, scopeLine: 397, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32)* @_PyLong_FromUid, variables: !692)
!690 = !DISubroutineType(types: !691)
!691 = !{!276, !268}
!692 = !{!693}
!693 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "uid", arg: 1, scope: !689, file: !1, line: 396, type: !268)
!694 = !DISubprogram(name: "_PyLong_FromGid", scope: !1, file: !1, line: 404, type: !695, isLocal: false, isDefinition: true, scopeLine: 405, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32)* @_PyLong_FromGid, variables: !697)
!695 = !DISubroutineType(types: !696)
!696 = !{!276, !273}
!697 = !{!698}
!698 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gid", arg: 1, scope: !694, file: !1, line: 404, type: !273)
!699 = !DISubprogram(name: "_Py_Uid_Converter", scope: !1, file: !1, line: 412, type: !535, isLocal: false, isDefinition: true, scopeLine: 413, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*)* @_Py_Uid_Converter, variables: !700)
!700 = !{!701, !702, !703, !704, !705, !706, !707, !708, !710}
!701 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !699, file: !1, line: 412, type: !276)
!702 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !699, file: !1, line: 412, type: !275)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uid", scope: !699, file: !1, line: 414, type: !268)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !699, file: !1, line: 415, type: !276)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overflow", scope: !699, file: !1, line: 416, type: !314)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !699, file: !1, line: 417, type: !287)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uresult", scope: !699, file: !1, line: 418, type: !366)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !709, file: !1, line: 498, type: !276)
!709 = distinct !DILexicalBlock(scope: !699, file: !1, line: 498, column: 5)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !711, file: !1, line: 513, type: !276)
!711 = distinct !DILexicalBlock(scope: !699, file: !1, line: 513, column: 5)
!712 = !DISubprogram(name: "_Py_Gid_Converter", scope: !1, file: !1, line: 518, type: !535, isLocal: false, isDefinition: true, scopeLine: 519, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*)* @_Py_Gid_Converter, variables: !713)
!713 = !{!714, !715, !716, !717, !718, !719, !720, !721, !723}
!714 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !712, file: !1, line: 518, type: !276)
!715 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !712, file: !1, line: 518, type: !275)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gid", scope: !712, file: !1, line: 520, type: !273)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !712, file: !1, line: 521, type: !276)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overflow", scope: !712, file: !1, line: 522, type: !314)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !712, file: !1, line: 523, type: !287)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uresult", scope: !712, file: !1, line: 524, type: !366)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !722, file: !1, line: 605, type: !276)
!722 = distinct !DILexicalBlock(scope: !712, file: !1, line: 605, column: 5)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !724, file: !1, line: 620, type: !276)
!724 = distinct !DILexicalBlock(scope: !712, file: !1, line: 620, column: 5)
!725 = !DISubprogram(name: "PyInit_posix", scope: !1, file: !1, line: 12208, type: !726, isLocal: false, isDefinition: true, scopeLine: 12209, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_posix, variables: !728)
!726 = !DISubroutineType(types: !727)
!727 = !{!276}
!728 = !{!729, !730, !731, !732, !733, !735, !737, !739, !743}
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !725, file: !1, line: 12210, type: !276)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !725, file: !1, line: 12210, type: !276)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !725, file: !1, line: 12211, type: !276)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "trace", scope: !725, file: !1, line: 12212, type: !652)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !734, file: !1, line: 12224, type: !276)
!734 = distinct !DILexicalBlock(scope: !725, file: !1, line: 12224, column: 5)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !736, file: !1, line: 12227, type: !276)
!736 = distinct !DILexicalBlock(scope: !725, file: !1, line: 12227, column: 5)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ignored", scope: !738, file: !1, line: 12357, type: !314)
!738 = distinct !DILexicalBlock(scope: !725, file: !1, line: 12356, column: 5)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unicode", scope: !740, file: !1, line: 12373, type: !276)
!740 = distinct !DILexicalBlock(scope: !741, file: !1, line: 12372, column: 51)
!741 = distinct !DILexicalBlock(scope: !742, file: !1, line: 12372, column: 5)
!742 = distinct !DILexicalBlock(scope: !725, file: !1, line: 12372, column: 5)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !744, file: !1, line: 12378, type: !276)
!744 = distinct !DILexicalBlock(scope: !740, file: !1, line: 12378, column: 9)
!745 = !DISubprogram(name: "os_stat", scope: !1, file: !1, line: 2480, type: !746, isLocal: true, isDefinition: true, scopeLine: 2481, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyModuleDef*, %struct._object*, %struct._object*)* @os_stat, variables: !772)
!746 = !DISubroutineType(types: !747)
!747 = !{!276, !748, !276, !276}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64, align: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef", file: !750, line: 57, baseType: !751)
!750 = !DIFile(filename: "Include/moduleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !750, line: 47, size: 832, align: 64, elements: !752)
!752 = !{!753, !762, !763, !764, !765, !768, !769, !770, !771}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !751, file: !750, line: 48, baseType: !754, size: 320, align: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !750, line: 38, baseType: !755)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !750, line: 33, size: 320, align: 64, elements: !756)
!756 = !{!757, !758, !760, !761}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !755, file: !750, line: 34, baseType: !277, size: 128, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !755, file: !750, line: 35, baseType: !759, size: 64, align: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64, align: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !755, file: !750, line: 36, baseType: !282, size: 64, align: 64, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !755, file: !750, line: 37, baseType: !276, size: 64, align: 64, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !751, file: !750, line: 49, baseType: !299, size: 64, align: 64, offset: 320)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !751, file: !750, line: 50, baseType: !299, size: 64, align: 64, offset: 384)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !751, file: !750, line: 51, baseType: !282, size: 64, align: 64, offset: 448)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !751, file: !750, line: 52, baseType: !766, size: 64, align: 64, offset: 512)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64, align: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !551, line: 47, baseType: !550)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !751, file: !750, line: 53, baseType: !412, size: 64, align: 64, offset: 576)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !751, file: !750, line: 54, baseType: !529, size: 64, align: 64, offset: 640)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !751, file: !750, line: 55, baseType: !412, size: 64, align: 64, offset: 704)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !751, file: !750, line: 56, baseType: !599, size: 64, align: 64, offset: 768)
!772 = !{!773, !774, !775, !776, !777, !778, !779}
!773 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !745, file: !1, line: 2480, type: !748)
!774 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !745, file: !1, line: 2480, type: !276)
!775 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !745, file: !1, line: 2480, type: !276)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_value", scope: !745, file: !1, line: 2482, type: !276)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !745, file: !1, line: 2484, type: !615)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dir_fd", scope: !745, file: !1, line: 2485, type: !314)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "follow_symlinks", scope: !745, file: !1, line: 2486, type: !314)
!780 = !DISubprogram(name: "path_converter", scope: !1, file: !1, line: 788, type: !535, isLocal: true, isDefinition: true, scopeLine: 788, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*)* @path_converter, variables: !781)
!781 = !{!782, !783, !784, !785, !786, !787, !788, !789, !792, !794, !800, !801}
!782 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !780, file: !1, line: 788, type: !276)
!783 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !780, file: !1, line: 788, type: !275)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !780, file: !1, line: 789, type: !614)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unicode", scope: !780, file: !1, line: 790, type: !276)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !780, file: !1, line: 790, type: !276)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !780, file: !1, line: 791, type: !282)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "narrow", scope: !780, file: !1, line: 792, type: !322)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "converted", scope: !790, file: !1, line: 847, type: !314)
!790 = distinct !DILexicalBlock(scope: !791, file: !1, line: 824, column: 18)
!791 = distinct !DILexicalBlock(scope: !780, file: !1, line: 824, column: 9)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !793, file: !1, line: 848, type: !276)
!793 = distinct !DILexicalBlock(scope: !790, file: !1, line: 848, column: 9)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !795, file: !1, line: 862, type: !314)
!795 = distinct !DILexicalBlock(scope: !796, file: !1, line: 861, column: 33)
!796 = distinct !DILexicalBlock(scope: !797, file: !1, line: 861, column: 17)
!797 = distinct !DILexicalBlock(scope: !798, file: !1, line: 859, column: 21)
!798 = distinct !DILexicalBlock(scope: !799, file: !1, line: 859, column: 13)
!799 = distinct !DILexicalBlock(scope: !791, file: !1, line: 853, column: 10)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !795, file: !1, line: 863, type: !314)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !802, file: !1, line: 902, type: !276)
!802 = distinct !DILexicalBlock(scope: !803, file: !1, line: 902, column: 9)
!803 = distinct !DILexicalBlock(scope: !804, file: !1, line: 900, column: 35)
!804 = distinct !DILexicalBlock(scope: !780, file: !1, line: 900, column: 9)
!805 = !DISubprogram(name: "_fd_converter", scope: !1, file: !1, line: 640, type: !806, isLocal: true, isDefinition: true, scopeLine: 641, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i32*, i8*)* @_fd_converter, variables: !808)
!806 = !DISubroutineType(types: !807)
!807 = !{!314, !276, !687, !299}
!808 = !{!809, !810, !811, !812, !813, !814, !815}
!809 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !805, file: !1, line: 640, type: !276)
!810 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !805, file: !1, line: 640, type: !687)
!811 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "allowed", arg: 3, scope: !805, file: !1, line: 640, type: !299)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overflow", scope: !805, file: !1, line: 642, type: !314)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "long_value", scope: !805, file: !1, line: 643, type: !287)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !805, file: !1, line: 645, type: !276)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !816, file: !1, line: 654, type: !276)
!816 = distinct !DILexicalBlock(scope: !805, file: !1, line: 654, column: 5)
!817 = !DISubprogram(name: "os_stat_impl", scope: !1, file: !1, line: 2502, type: !818, isLocal: true, isDefinition: true, scopeLine: 2504, flags: DIFlagPrototyped, isOptimized: true, variables: !820)
!818 = !DISubroutineType(types: !819)
!819 = !{!276, !748, !614, !314, !314}
!820 = !{!821, !822, !823, !824}
!821 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !817, file: !1, line: 2502, type: !748)
!822 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 2, scope: !817, file: !1, line: 2502, type: !614)
!823 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir_fd", arg: 3, scope: !817, file: !1, line: 2502, type: !314)
!824 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "follow_symlinks", arg: 4, scope: !817, file: !1, line: 2502, type: !314)
!825 = !DISubprogram(name: "posix_do_stat", scope: !1, file: !1, line: 2313, type: !826, isLocal: true, isDefinition: true, scopeLine: 2315, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.path_t*, i32, i32)* @posix_do_stat, variables: !828)
!826 = !DISubroutineType(types: !827)
!827 = !{!276, !322, !614, !314, !314}
!828 = !{!829, !830, !831, !832, !833, !867, !868}
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "function_name", arg: 1, scope: !825, file: !1, line: 2313, type: !322)
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 2, scope: !825, file: !1, line: 2313, type: !614)
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir_fd", arg: 3, scope: !825, file: !1, line: 2314, type: !314)
!832 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "follow_symlinks", arg: 4, scope: !825, file: !1, line: 2314, type: !314)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !825, file: !1, line: 2316, type: !834)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !835, line: 46, size: 1152, align: 64, elements: !836)
!835 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!836 = !{!837, !839, !841, !843, !845, !846, !847, !848, !849, !850, !852, !854, !861, !862, !863}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !834, file: !835, line: 48, baseType: !838, size: 64, align: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !271, line: 133, baseType: !366)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !834, file: !835, line: 53, baseType: !840, size: 64, align: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !271, line: 136, baseType: !366)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !834, file: !835, line: 61, baseType: !842, size: 64, align: 64, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !271, line: 139, baseType: !366)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !834, file: !835, line: 62, baseType: !844, size: 32, align: 32, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !271, line: 138, baseType: !272)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !834, file: !835, line: 64, baseType: !270, size: 32, align: 32, offset: 224)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !834, file: !835, line: 65, baseType: !274, size: 32, align: 32, offset: 256)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !834, file: !835, line: 67, baseType: !314, size: 32, align: 32, offset: 288)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !834, file: !835, line: 69, baseType: !838, size: 64, align: 64, offset: 320)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !834, file: !835, line: 74, baseType: !345, size: 64, align: 64, offset: 384)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !834, file: !835, line: 78, baseType: !851, size: 64, align: 64, offset: 448)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !271, line: 162, baseType: !287)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !834, file: !835, line: 80, baseType: !853, size: 64, align: 64, offset: 512)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !271, line: 167, baseType: !287)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !834, file: !835, line: 91, baseType: !855, size: 128, align: 64, offset: 576)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !649, line: 120, size: 128, align: 64, elements: !856)
!856 = !{!857, !859}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !855, file: !649, line: 122, baseType: !858, size: 64, align: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !271, line: 148, baseType: !287)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !855, file: !649, line: 123, baseType: !860, size: 64, align: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !271, line: 184, baseType: !287)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !834, file: !835, line: 92, baseType: !855, size: 128, align: 64, offset: 704)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !834, file: !835, line: 93, baseType: !855, size: 128, align: 64, offset: 832)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !834, file: !835, line: 106, baseType: !864, size: 192, align: 64, offset: 960)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !860, size: 192, align: 64, elements: !865)
!865 = !{!866}
!866 = !DISubrange(count: 3)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !825, file: !1, line: 2317, type: !314)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !869, file: !1, line: 2329, type: !870)
!869 = distinct !DILexicalBlock(scope: !825, file: !1, line: 2329, column: 5)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64, align: 64)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !872, line: 139, baseType: !873)
!872 = !DIFile(filename: "Include/pystate.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !872, line: 69, size: 1536, align: 64, elements: !874)
!874 = !{!875, !877, !878, !898, !901, !902, !903, !904, !905, !906, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !873, file: !872, line: 72, baseType: !876, size: 64, align: 64)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64, align: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !873, file: !872, line: 73, baseType: !876, size: 64, align: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !873, file: !872, line: 74, baseType: !879, size: 64, align: 64, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64, align: 64)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !872, line: 44, baseType: !881)
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !872, line: 19, size: 832, align: 64, elements: !882)
!882 = !{!883, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !881, file: !872, line: 21, baseType: !884, size: 64, align: 64)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64, align: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !881, file: !872, line: 22, baseType: !876, size: 64, align: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !881, file: !872, line: 24, baseType: !276, size: 64, align: 64, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !881, file: !872, line: 25, baseType: !276, size: 64, align: 64, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !881, file: !872, line: 26, baseType: !276, size: 64, align: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !881, file: !872, line: 27, baseType: !276, size: 64, align: 64, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !881, file: !872, line: 28, baseType: !276, size: 64, align: 64, offset: 384)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !881, file: !872, line: 30, baseType: !276, size: 64, align: 64, offset: 448)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !881, file: !872, line: 31, baseType: !276, size: 64, align: 64, offset: 512)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !881, file: !872, line: 32, baseType: !276, size: 64, align: 64, offset: 576)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !881, file: !872, line: 33, baseType: !314, size: 32, align: 32, offset: 640)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !881, file: !872, line: 34, baseType: !314, size: 32, align: 32, offset: 672)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !881, file: !872, line: 37, baseType: !314, size: 32, align: 32, offset: 704)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !881, file: !872, line: 43, baseType: !276, size: 64, align: 64, offset: 768)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !873, file: !872, line: 76, baseType: !899, size: 64, align: 64, offset: 192)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64, align: 64)
!900 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !872, line: 50, flags: DIFlagFwdDecl)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !873, file: !872, line: 77, baseType: !314, size: 32, align: 32, offset: 256)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !873, file: !872, line: 78, baseType: !301, size: 8, align: 8, offset: 288)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !873, file: !872, line: 80, baseType: !301, size: 8, align: 8, offset: 296)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !873, file: !872, line: 85, baseType: !314, size: 32, align: 32, offset: 320)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !873, file: !872, line: 86, baseType: !314, size: 32, align: 32, offset: 352)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !873, file: !872, line: 88, baseType: !907, size: 64, align: 64, offset: 384)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !872, line: 54, baseType: !908)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64, align: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!314, !276, !899, !314, !276}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !873, file: !872, line: 89, baseType: !907, size: 64, align: 64, offset: 448)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !873, file: !872, line: 90, baseType: !276, size: 64, align: 64, offset: 512)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !873, file: !872, line: 91, baseType: !276, size: 64, align: 64, offset: 576)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !873, file: !872, line: 93, baseType: !276, size: 64, align: 64, offset: 640)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !873, file: !872, line: 94, baseType: !276, size: 64, align: 64, offset: 704)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !873, file: !872, line: 95, baseType: !276, size: 64, align: 64, offset: 768)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !873, file: !872, line: 97, baseType: !276, size: 64, align: 64, offset: 832)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !873, file: !872, line: 98, baseType: !276, size: 64, align: 64, offset: 896)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !873, file: !872, line: 99, baseType: !276, size: 64, align: 64, offset: 960)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !873, file: !872, line: 101, baseType: !276, size: 64, align: 64, offset: 1024)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !873, file: !872, line: 103, baseType: !314, size: 32, align: 32, offset: 1088)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !873, file: !872, line: 105, baseType: !276, size: 64, align: 64, offset: 1152)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !873, file: !872, line: 106, baseType: !287, size: 64, align: 64, offset: 1216)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !873, file: !872, line: 108, baseType: !314, size: 32, align: 32, offset: 1280)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !873, file: !872, line: 109, baseType: !276, size: 64, align: 64, offset: 1344)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !873, file: !872, line: 134, baseType: !600, size: 64, align: 64, offset: 1408)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !873, file: !872, line: 135, baseType: !275, size: 64, align: 64, offset: 1472)
!928 = !DISubprogram(name: "path_and_dir_fd_invalid", scope: !1, file: !1, line: 957, type: !929, isLocal: true, isDefinition: true, scopeLine: 957, flags: DIFlagPrototyped, isOptimized: true, variables: !931)
!929 = !DISubroutineType(types: !930)
!930 = !{!314, !322, !614, !314}
!931 = !{!932, !933, !934}
!932 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "function_name", arg: 1, scope: !928, file: !1, line: 957, type: !322)
!933 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 2, scope: !928, file: !1, line: 957, type: !614)
!934 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir_fd", arg: 3, scope: !928, file: !1, line: 957, type: !314)
!935 = !DISubprogram(name: "dir_fd_and_fd_invalid", scope: !1, file: !1, line: 968, type: !936, isLocal: true, isDefinition: true, scopeLine: 968, flags: DIFlagPrototyped, isOptimized: true, variables: !938)
!936 = !DISubroutineType(types: !937)
!937 = !{!314, !322, !314, !314}
!938 = !{!939, !940, !941}
!939 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "function_name", arg: 1, scope: !935, file: !1, line: 968, type: !322)
!940 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir_fd", arg: 2, scope: !935, file: !1, line: 968, type: !314)
!941 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 3, scope: !935, file: !1, line: 968, type: !314)
!942 = !DISubprogram(name: "fd_and_follow_symlinks_invalid", scope: !1, file: !1, line: 979, type: !936, isLocal: true, isDefinition: true, scopeLine: 980, flags: DIFlagPrototyped, isOptimized: true, variables: !943)
!943 = !{!944, !945, !946}
!944 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "function_name", arg: 1, scope: !942, file: !1, line: 979, type: !322)
!945 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 2, scope: !942, file: !1, line: 979, type: !314)
!946 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "follow_symlinks", arg: 3, scope: !942, file: !1, line: 980, type: !314)
!947 = !DISubprogram(name: "fstat64", scope: !948, file: !948, line: 517, type: !949, isLocal: false, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: true, variables: !971)
!948 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!949 = !DISubroutineType(types: !950)
!950 = !{!314, !314, !951}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !835, line: 119, size: 1152, align: 64, elements: !953)
!953 = !{!954, !955, !957, !958, !959, !960, !961, !962, !963, !964, !965, !967, !968, !969, !970}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !952, file: !835, line: 121, baseType: !838, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !952, file: !835, line: 123, baseType: !956, size: 64, align: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !271, line: 137, baseType: !366)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !952, file: !835, line: 124, baseType: !842, size: 64, align: 64, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !952, file: !835, line: 125, baseType: !844, size: 32, align: 32, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !952, file: !835, line: 132, baseType: !270, size: 32, align: 32, offset: 224)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !952, file: !835, line: 133, baseType: !274, size: 32, align: 32, offset: 256)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !952, file: !835, line: 135, baseType: !314, size: 32, align: 32, offset: 288)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !952, file: !835, line: 136, baseType: !838, size: 64, align: 64, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !952, file: !835, line: 137, baseType: !345, size: 64, align: 64, offset: 384)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !952, file: !835, line: 143, baseType: !851, size: 64, align: 64, offset: 448)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !952, file: !835, line: 144, baseType: !966, size: 64, align: 64, offset: 512)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !271, line: 168, baseType: !287)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !952, file: !835, line: 152, baseType: !855, size: 128, align: 64, offset: 576)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !952, file: !835, line: 153, baseType: !855, size: 128, align: 64, offset: 704)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !952, file: !835, line: 154, baseType: !855, size: 128, align: 64, offset: 832)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !952, file: !835, line: 164, baseType: !864, size: 192, align: 64, offset: 960)
!971 = !{!972, !973}
!972 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__fd", arg: 1, scope: !947, file: !948, line: 517, type: !314)
!973 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__statbuf", arg: 2, scope: !947, file: !948, line: 517, type: !951)
!974 = !DISubprogram(name: "lstat64", scope: !948, file: !948, line: 510, type: !975, isLocal: false, isDefinition: true, scopeLine: 511, flags: DIFlagPrototyped, isOptimized: true, variables: !977)
!975 = !DISubroutineType(types: !976)
!976 = !{!314, !299, !951}
!977 = !{!978, !979}
!978 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__path", arg: 1, scope: !974, file: !948, line: 510, type: !299)
!979 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__statbuf", arg: 2, scope: !974, file: !948, line: 510, type: !951)
!980 = !DISubprogram(name: "fstatat64", scope: !948, file: !948, line: 524, type: !981, isLocal: false, isDefinition: true, scopeLine: 526, flags: DIFlagPrototyped, isOptimized: true, variables: !983)
!981 = !DISubroutineType(types: !982)
!982 = !{!314, !314, !299, !951, !314}
!983 = !{!984, !985, !986, !987}
!984 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__fd", arg: 1, scope: !980, file: !948, line: 524, type: !314)
!985 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__filename", arg: 2, scope: !980, file: !948, line: 524, type: !299)
!986 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__statbuf", arg: 3, scope: !980, file: !948, line: 524, type: !951)
!987 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__flag", arg: 4, scope: !980, file: !948, line: 524, type: !314)
!988 = !DISubprogram(name: "stat64", scope: !948, file: !948, line: 503, type: !975, isLocal: false, isDefinition: true, scopeLine: 504, flags: DIFlagPrototyped, isOptimized: true, variables: !989)
!989 = !{!990, !991}
!990 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__path", arg: 1, scope: !988, file: !948, line: 503, type: !299)
!991 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__statbuf", arg: 2, scope: !988, file: !948, line: 503, type: !951)
!992 = !DISubprogram(name: "path_error", scope: !1, file: !1, line: 1305, type: !993, isLocal: true, isDefinition: true, scopeLine: 1306, flags: DIFlagPrototyped, isOptimized: true, variables: !995)
!993 = !DISubroutineType(types: !994)
!994 = !{!276, !614}
!995 = !{!996}
!996 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 1, scope: !992, file: !1, line: 1305, type: !614)
!997 = !DISubprogram(name: "_pystat_fromstructstat", scope: !1, file: !1, line: 2205, type: !998, isLocal: true, isDefinition: true, scopeLine: 2206, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.stat*)* @_pystat_fromstructstat, variables: !1001)
!998 = !DISubroutineType(types: !999)
!999 = !{!276, !1000}
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64, align: 64)
!1001 = !{!1002, !1003, !1004, !1005, !1006, !1007}
!1002 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "st", arg: 1, scope: !997, file: !1, line: 2205, type: !1000)
!1003 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ansec", scope: !997, file: !1, line: 2207, type: !366)
!1004 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mnsec", scope: !997, file: !1, line: 2207, type: !366)
!1005 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cnsec", scope: !997, file: !1, line: 2207, type: !366)
!1006 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !997, file: !1, line: 2208, type: !276)
!1007 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1008, file: !1, line: 2302, type: !276)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !1, line: 2302, column: 9)
!1009 = distinct !DILexicalBlock(scope: !1010, file: !1, line: 2301, column: 27)
!1010 = distinct !DILexicalBlock(scope: !997, file: !1, line: 2301, column: 9)
!1011 = !DISubprogram(name: "fill_time", scope: !1, file: !1, line: 2159, type: !1012, isLocal: true, isDefinition: true, scopeLine: 2160, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, i32, i64, i64)* @fill_time, variables: !1015)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{null, !276, !314, !1014, !366}
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !649, line: 75, baseType: !858)
!1015 = !{!1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1027, !1030, !1032, !1035, !1037, !1040, !1042, !1045, !1047}
!1016 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !1011, file: !1, line: 2159, type: !276)
!1017 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 2, scope: !1011, file: !1, line: 2159, type: !314)
!1018 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sec", arg: 3, scope: !1011, file: !1, line: 2159, type: !1014)
!1019 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nsec", arg: 4, scope: !1011, file: !1, line: 2159, type: !366)
!1020 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !1011, file: !1, line: 2161, type: !276)
!1021 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ns_fractional", scope: !1011, file: !1, line: 2162, type: !276)
!1022 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s_in_ns", scope: !1011, file: !1, line: 2163, type: !276)
!1023 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ns_total", scope: !1011, file: !1, line: 2164, type: !276)
!1024 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "float_s", scope: !1011, file: !1, line: 2165, type: !276)
!1025 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !1026, file: !1, line: 2195, type: !276)
!1026 = distinct !DILexicalBlock(scope: !1011, file: !1, line: 2195, column: 5)
!1027 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1028, file: !1, line: 2195, type: !276)
!1028 = distinct !DILexicalBlock(scope: !1029, file: !1, line: 2195, column: 5)
!1029 = distinct !DILexicalBlock(scope: !1026, file: !1, line: 2195, column: 5)
!1030 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !1031, file: !1, line: 2196, type: !276)
!1031 = distinct !DILexicalBlock(scope: !1011, file: !1, line: 2196, column: 5)
!1032 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1033, file: !1, line: 2196, type: !276)
!1033 = distinct !DILexicalBlock(scope: !1034, file: !1, line: 2196, column: 5)
!1034 = distinct !DILexicalBlock(scope: !1031, file: !1, line: 2196, column: 5)
!1035 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !1036, file: !1, line: 2197, type: !276)
!1036 = distinct !DILexicalBlock(scope: !1011, file: !1, line: 2197, column: 5)
!1037 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1038, file: !1, line: 2197, type: !276)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !1, line: 2197, column: 5)
!1039 = distinct !DILexicalBlock(scope: !1036, file: !1, line: 2197, column: 5)
!1040 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !1041, file: !1, line: 2198, type: !276)
!1041 = distinct !DILexicalBlock(scope: !1011, file: !1, line: 2198, column: 5)
!1042 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1043, file: !1, line: 2198, type: !276)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !1, line: 2198, column: 5)
!1044 = distinct !DILexicalBlock(scope: !1041, file: !1, line: 2198, column: 5)
!1045 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !1046, file: !1, line: 2199, type: !276)
!1046 = distinct !DILexicalBlock(scope: !1011, file: !1, line: 2199, column: 5)
!1047 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1048, file: !1, line: 2199, type: !276)
!1048 = distinct !DILexicalBlock(scope: !1049, file: !1, line: 2199, column: 5)
!1049 = distinct !DILexicalBlock(scope: !1046, file: !1, line: 2199, column: 5)
!1050 = !DISubprogram(name: "path_cleanup", scope: !1, file: !1, line: 781, type: !1051, isLocal: true, isDefinition: true, scopeLine: 781, flags: DIFlagPrototyped, isOptimized: true, variables: !1053)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{null, !614}
!1053 = !{!1054, !1055, !1059}
!1054 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 1, scope: !1050, file: !1, line: 781, type: !614)
!1055 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !1056, file: !1, line: 783, type: !276)
!1056 = distinct !DILexicalBlock(scope: !1057, file: !1, line: 783, column: 9)
!1057 = distinct !DILexicalBlock(scope: !1058, file: !1, line: 782, column: 24)
!1058 = distinct !DILexicalBlock(scope: !1050, file: !1, line: 782, column: 9)
!1059 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1060, file: !1, line: 783, type: !276)
!1060 = distinct !DILexicalBlock(scope: !1061, file: !1, line: 783, column: 9)
!1061 = distinct !DILexicalBlock(scope: !1062, file: !1, line: 783, column: 9)
!1062 = distinct !DILexicalBlock(scope: !1056, file: !1, line: 783, column: 9)
!1063 = !DISubprogram(name: "os_access", scope: !1, file: !1, line: 2622, type: !746, isLocal: true, isDefinition: true, scopeLine: 2623, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyModuleDef*, %struct._object*, %struct._object*)* @os_access, variables: !1064)
!1064 = !{!1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073}
!1065 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !1063, file: !1, line: 2622, type: !748)
!1066 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !1063, file: !1, line: 2622, type: !276)
!1067 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !1063, file: !1, line: 2622, type: !276)
!1068 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_value", scope: !1063, file: !1, line: 2624, type: !276)
!1069 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !1063, file: !1, line: 2626, type: !615)
!1070 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !1063, file: !1, line: 2627, type: !314)
!1071 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dir_fd", scope: !1063, file: !1, line: 2628, type: !314)
!1072 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "effective_ids", scope: !1063, file: !1, line: 2629, type: !314)
!1073 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "follow_symlinks", scope: !1063, file: !1, line: 2630, type: !314)
!1074 = !DISubprogram(name: "os_access_impl", scope: !1, file: !1, line: 2646, type: !1075, isLocal: true, isDefinition: true, scopeLine: 2648, flags: DIFlagPrototyped, isOptimized: true, variables: !1077)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!276, !748, !614, !314, !314, !314, !314}
!1077 = !{!1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1088}
!1078 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !1074, file: !1, line: 2646, type: !748)
!1079 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 2, scope: !1074, file: !1, line: 2646, type: !614)
!1080 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 3, scope: !1074, file: !1, line: 2646, type: !314)
!1081 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir_fd", arg: 4, scope: !1074, file: !1, line: 2646, type: !314)
!1082 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "effective_ids", arg: 5, scope: !1074, file: !1, line: 2646, type: !314)
!1083 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "follow_symlinks", arg: 6, scope: !1074, file: !1, line: 2646, type: !314)
!1084 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_value", scope: !1074, file: !1, line: 2649, type: !276)
!1085 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !1074, file: !1, line: 2654, type: !314)
!1086 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !1087, file: !1, line: 2690, type: !870)
!1087 = distinct !DILexicalBlock(scope: !1074, file: !1, line: 2690, column: 5)
!1088 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !1089, file: !1, line: 2695, type: !314)
!1089 = distinct !DILexicalBlock(scope: !1090, file: !1, line: 2694, column: 27)
!1090 = distinct !DILexicalBlock(scope: !1087, file: !1, line: 2692, column: 9)
!1091 = !DISubprogram(name: "os_ttyname", scope: !1, file: !1, line: 2758, type: !1092, isLocal: true, isDefinition: true, scopeLine: 2759, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyModuleDef*, %struct._object*)* @os_ttyname, variables: !1094)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!276, !748, !276}
!1094 = !{!1095, !1096, !1097, !1098, !1099}
!1095 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !1091, file: !1, line: 2758, type: !748)
!1096 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !1091, file: !1, line: 2758, type: !276)
!1097 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_value", scope: !1091, file: !1, line: 2760, type: !276)
!1098 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !1091, file: !1, line: 2761, type: !314)
!1099 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_return_value", scope: !1091, file: !1, line: 2762, type: !322)
!1100 = !DISubprogram(name: "os_ttyname_impl", scope: !1, file: !1, line: 2778, type: !1101, isLocal: true, isDefinition: true, scopeLine: 2780, flags: DIFlagPrototyped, isOptimized: true, variables: !1103)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!322, !748, !314}
!1103 = !{!1104, !1105, !1106}
!1104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !1100, file: !1, line: 2778, type: !748)
!1105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 2, scope: !1100, file: !1, line: 2778, type: !314)
!1106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !1100, file: !1, line: 2781, type: !322)
!1107 = !DISubprogram(name: "posix_error", scope: !1, file: !1, line: 1267, type: !726, isLocal: true, isDefinition: true, scopeLine: 1268, flags: DIFlagPrototyped, isOptimized: true, variables: !1108)
!1108 = !{}
!1109 = !DISubprogram(name: "posix_chdir", scope: !1, file: !1, line: 2823, type: !405, isLocal: true, isDefinition: true, scopeLine: 2824, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @posix_chdir, variables: !1110)
!1110 = !{!1111, !1112, !1113, !1114, !1115, !1116, !1117}
!1111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !1109, file: !1, line: 2823, type: !276)
!1112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !1109, file: !1, line: 2823, type: !276)
!1113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !1109, file: !1, line: 2823, type: !276)
!1114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !1109, file: !1, line: 2825, type: !615)
!1115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !1109, file: !1, line: 2826, type: !314)
!1116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_value", scope: !1109, file: !1, line: 2827, type: !276)
!1117 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !1118, file: !1, line: 2840, type: !870)
!1118 = distinct !DILexicalBlock(scope: !1109, file: !1, line: 2840, column: 5)
