; ModuleID = 'pystate.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Py_atomic_address = type { i8* }
%struct._frame = type opaque
%struct._ts = type { %struct._ts*, %struct._ts*, %struct._is*, %struct._frame*, i32, i8, i8, i32, i32, i32 (%struct._object*, %struct._frame*, i32, %struct._object*)*, i32 (%struct._object*, %struct._frame*, i32, %struct._object*)*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, i32, %struct._object*, i64, i32, %struct._object*, void (i8*)*, i8* }
%struct._is = type { %struct._is*, %struct._ts*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, i32, i32, i32, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !16, subprograms: !423, globals: !894)
!1 = !DIFile(filename: "Python/pystate.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3, !11}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !4, line: 23, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!7 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!8 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!9 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!10 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 190, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "Include/pystate.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!13 = !{!14, !15}
!14 = !DIEnumerator(name: "PyGILState_LOCKED", value: 0)
!15 = !DIEnumerator(name: "PyGILState_UNLOCKED", value: 1)
!16 = !{!17, !128, !45, !411, !413, !414}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !12, line: 44, baseType: !19)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !12, line: 19, size: 832, align: 64, elements: !20)
!20 = !{!21, !23, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !19, file: !12, line: 21, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !19, file: !12, line: 22, baseType: !24, size: 64, align: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !12, line: 69, size: 1536, align: 64, elements: !26)
!26 = !{!27, !28, !29, !30, !33, !35, !37, !38, !39, !40, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !25, file: !12, line: 72, baseType: !24, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !25, file: !12, line: 73, baseType: !24, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !25, file: !12, line: 74, baseType: !17, size: 64, align: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !25, file: !12, line: 76, baseType: !31, size: 64, align: 64, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !12, line: 50, flags: DIFlagFwdDecl)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !25, file: !12, line: 77, baseType: !34, size: 32, align: 32, offset: 256)
!34 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !25, file: !12, line: 78, baseType: !36, size: 8, align: 8, offset: 288)
!36 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !25, file: !12, line: 80, baseType: !36, size: 8, align: 8, offset: 296)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !25, file: !12, line: 85, baseType: !34, size: 32, align: 32, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !25, file: !12, line: 86, baseType: !34, size: 32, align: 32, offset: 352)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !25, file: !12, line: 88, baseType: !41, size: 64, align: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !12, line: 54, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!34, !45, !31, !34, !45}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !47, line: 109, baseType: !48)
!47 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !47, line: 105, size: 128, align: 64, elements: !49)
!49 = !{!50, !58}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !48, file: !47, line: 107, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !52, line: 177, baseType: !53)
!52 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !54, line: 102, baseType: !55)
!54 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !56, line: 181, baseType: !57)
!56 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!57 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !48, file: !47, line: 108, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !47, line: 334, size: 3200, align: 64, elements: !61)
!61 = !{!62, !68, !71, !72, !73, !78, !141, !146, !151, !152, !157, !209, !240, !252, !258, !259, !260, !262, !264, !295, !296, !297, !306, !307, !312, !313, !315, !317, !327, !330, !348, !349, !350, !352, !354, !355, !357, !362, !367, !372, !373, !374, !375, !376, !377, !378, !379, !381}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !60, file: !47, line: 335, baseType: !63, size: 192, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !47, line: 114, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, file: !47, line: 111, size: 192, align: 64, elements: !65)
!65 = !{!66, !67}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !64, file: !47, line: 112, baseType: !46, size: 128, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !64, file: !47, line: 113, baseType: !51, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !60, file: !47, line: 336, baseType: !69, size: 64, align: 64, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !60, file: !47, line: 337, baseType: !51, size: 64, align: 64, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !60, file: !47, line: 337, baseType: !51, size: 64, align: 64, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !60, file: !47, line: 341, baseType: !74, size: 64, align: 64, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !47, line: 308, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !45}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !60, file: !47, line: 342, baseType: !79, size: 64, align: 64, offset: 448)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !47, line: 314, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!34, !45, !83, !34}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !54, line: 48, baseType: !85)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !86, line: 246, size: 1728, align: 64, elements: !87)
!86 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!87 = !{!88, !89, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !109, !110, !111, !112, !114, !116, !118, !122, !125, !127, !129, !130, !131, !132, !136, !137}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !85, file: !86, line: 247, baseType: !34, size: 32, align: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !85, file: !86, line: 252, baseType: !90, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !85, file: !86, line: 253, baseType: !90, size: 64, align: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !85, file: !86, line: 254, baseType: !90, size: 64, align: 64, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !85, file: !86, line: 255, baseType: !90, size: 64, align: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !85, file: !86, line: 256, baseType: !90, size: 64, align: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !85, file: !86, line: 257, baseType: !90, size: 64, align: 64, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !85, file: !86, line: 258, baseType: !90, size: 64, align: 64, offset: 448)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !85, file: !86, line: 259, baseType: !90, size: 64, align: 64, offset: 512)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !85, file: !86, line: 261, baseType: !90, size: 64, align: 64, offset: 576)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !85, file: !86, line: 262, baseType: !90, size: 64, align: 64, offset: 640)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !85, file: !86, line: 263, baseType: !90, size: 64, align: 64, offset: 704)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !85, file: !86, line: 265, baseType: !102, size: 64, align: 64, offset: 768)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !86, line: 161, size: 192, align: 64, elements: !104)
!104 = !{!105, !106, !108}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !103, file: !86, line: 162, baseType: !102, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !103, file: !86, line: 163, baseType: !107, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !103, file: !86, line: 167, baseType: !34, size: 32, align: 32, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !85, file: !86, line: 267, baseType: !107, size: 64, align: 64, offset: 832)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !85, file: !86, line: 269, baseType: !34, size: 32, align: 32, offset: 896)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !85, file: !86, line: 273, baseType: !34, size: 32, align: 32, offset: 928)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !85, file: !86, line: 275, baseType: !113, size: 64, align: 64, offset: 960)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !56, line: 140, baseType: !57)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !85, file: !86, line: 279, baseType: !115, size: 16, align: 16, offset: 1024)
!115 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !85, file: !86, line: 280, baseType: !117, size: 8, align: 8, offset: 1040)
!117 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !85, file: !86, line: 281, baseType: !119, size: 8, align: 8, offset: 1048)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 8, align: 8, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 1)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !85, file: !86, line: 285, baseType: !123, size: 64, align: 64, offset: 1088)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !86, line: 155, baseType: null)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !85, file: !86, line: 294, baseType: !126, size: 64, align: 64, offset: 1152)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !56, line: 141, baseType: !57)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !85, file: !86, line: 303, baseType: !128, size: 64, align: 64, offset: 1216)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !85, file: !86, line: 304, baseType: !128, size: 64, align: 64, offset: 1280)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !85, file: !86, line: 305, baseType: !128, size: 64, align: 64, offset: 1344)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !85, file: !86, line: 306, baseType: !128, size: 64, align: 64, offset: 1408)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !85, file: !86, line: 307, baseType: !133, size: 64, align: 64, offset: 1472)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !134, line: 62, baseType: !135)
!134 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!135 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !85, file: !86, line: 309, baseType: !34, size: 32, align: 32, offset: 1536)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !85, file: !86, line: 311, baseType: !138, size: 160, align: 8, offset: 1568)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 160, align: 8, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 20)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !60, file: !47, line: 343, baseType: !142, size: 64, align: 64, offset: 512)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !47, line: 316, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!45, !45, !90}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !60, file: !47, line: 344, baseType: !147, size: 64, align: 64, offset: 576)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !47, line: 318, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!34, !45, !90, !45}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !60, file: !47, line: 345, baseType: !128, size: 64, align: 64, offset: 640)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !60, file: !47, line: 346, baseType: !153, size: 64, align: 64, offset: 704)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !47, line: 320, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!45, !45}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !60, file: !47, line: 350, baseType: !158, size: 64, align: 64, offset: 768)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !47, line: 278, baseType: !160)
!160 = !DICompositeType(tag: DW_TAG_structure_type, file: !47, line: 236, size: 2176, align: 64, elements: !161)
!161 = !{!162, !167, !168, !169, !170, !171, !176, !178, !179, !180, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !160, file: !47, line: 241, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !47, line: 166, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!45, !45, !45}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !160, file: !47, line: 242, baseType: !163, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !160, file: !47, line: 243, baseType: !163, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !160, file: !47, line: 244, baseType: !163, size: 64, align: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !160, file: !47, line: 245, baseType: !163, size: 64, align: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !160, file: !47, line: 246, baseType: !172, size: 64, align: 64, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !47, line: 167, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!45, !45, !45, !45}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !160, file: !47, line: 247, baseType: !177, size: 64, align: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !47, line: 165, baseType: !154)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !160, file: !47, line: 248, baseType: !177, size: 64, align: 64, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !160, file: !47, line: 249, baseType: !177, size: 64, align: 64, offset: 512)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !160, file: !47, line: 250, baseType: !181, size: 64, align: 64, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !47, line: 168, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!34, !45}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !160, file: !47, line: 251, baseType: !177, size: 64, align: 64, offset: 640)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !160, file: !47, line: 252, baseType: !163, size: 64, align: 64, offset: 704)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !160, file: !47, line: 253, baseType: !163, size: 64, align: 64, offset: 768)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !160, file: !47, line: 254, baseType: !163, size: 64, align: 64, offset: 832)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !160, file: !47, line: 255, baseType: !163, size: 64, align: 64, offset: 896)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !160, file: !47, line: 256, baseType: !163, size: 64, align: 64, offset: 960)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !160, file: !47, line: 257, baseType: !177, size: 64, align: 64, offset: 1024)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !160, file: !47, line: 258, baseType: !128, size: 64, align: 64, offset: 1088)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !160, file: !47, line: 259, baseType: !177, size: 64, align: 64, offset: 1152)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !160, file: !47, line: 261, baseType: !163, size: 64, align: 64, offset: 1216)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !160, file: !47, line: 262, baseType: !163, size: 64, align: 64, offset: 1280)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !160, file: !47, line: 263, baseType: !163, size: 64, align: 64, offset: 1344)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !160, file: !47, line: 264, baseType: !163, size: 64, align: 64, offset: 1408)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !160, file: !47, line: 265, baseType: !172, size: 64, align: 64, offset: 1472)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !160, file: !47, line: 266, baseType: !163, size: 64, align: 64, offset: 1536)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !160, file: !47, line: 267, baseType: !163, size: 64, align: 64, offset: 1600)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !160, file: !47, line: 268, baseType: !163, size: 64, align: 64, offset: 1664)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !160, file: !47, line: 269, baseType: !163, size: 64, align: 64, offset: 1728)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !160, file: !47, line: 270, baseType: !163, size: 64, align: 64, offset: 1792)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !160, file: !47, line: 272, baseType: !163, size: 64, align: 64, offset: 1856)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !160, file: !47, line: 273, baseType: !163, size: 64, align: 64, offset: 1920)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !160, file: !47, line: 274, baseType: !163, size: 64, align: 64, offset: 1984)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !160, file: !47, line: 275, baseType: !163, size: 64, align: 64, offset: 2048)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !160, file: !47, line: 277, baseType: !177, size: 64, align: 64, offset: 2112)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !60, file: !47, line: 351, baseType: !210, size: 64, align: 64, offset: 832)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !47, line: 292, baseType: !212)
!212 = !DICompositeType(tag: DW_TAG_structure_type, file: !47, line: 280, size: 640, align: 64, elements: !213)
!213 = !{!214, !219, !220, !225, !226, !227, !232, !233, !238, !239}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !212, file: !47, line: 281, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !47, line: 169, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!51, !45}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !212, file: !47, line: 282, baseType: !163, size: 64, align: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !212, file: !47, line: 283, baseType: !221, size: 64, align: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !47, line: 170, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!45, !45, !51}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !212, file: !47, line: 284, baseType: !221, size: 64, align: 64, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !212, file: !47, line: 285, baseType: !128, size: 64, align: 64, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !212, file: !47, line: 286, baseType: !228, size: 64, align: 64, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !47, line: 172, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!34, !45, !51, !45}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !212, file: !47, line: 287, baseType: !128, size: 64, align: 64, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !212, file: !47, line: 288, baseType: !234, size: 64, align: 64, offset: 448)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !47, line: 231, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!34, !45, !45}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !212, file: !47, line: 290, baseType: !163, size: 64, align: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !212, file: !47, line: 291, baseType: !221, size: 64, align: 64, offset: 576)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !60, file: !47, line: 352, baseType: !241, size: 64, align: 64, offset: 896)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !47, line: 298, baseType: !243)
!243 = !DICompositeType(tag: DW_TAG_structure_type, file: !47, line: 294, size: 192, align: 64, elements: !244)
!244 = !{!245, !246, !247}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !243, file: !47, line: 295, baseType: !215, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !243, file: !47, line: 296, baseType: !163, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !243, file: !47, line: 297, baseType: !248, size: 64, align: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !47, line: 174, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!34, !45, !45, !45}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !60, file: !47, line: 356, baseType: !253, size: 64, align: 64, offset: 960)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !47, line: 321, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!257, !45}
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !52, line: 186, baseType: !51)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !60, file: !47, line: 357, baseType: !172, size: 64, align: 64, offset: 1024)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !60, file: !47, line: 358, baseType: !153, size: 64, align: 64, offset: 1088)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !60, file: !47, line: 359, baseType: !261, size: 64, align: 64, offset: 1152)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !47, line: 317, baseType: !164)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !60, file: !47, line: 360, baseType: !263, size: 64, align: 64, offset: 1216)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !47, line: 319, baseType: !249)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !60, file: !47, line: 363, baseType: !265, size: 64, align: 64, offset: 1280)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !47, line: 304, baseType: !267)
!267 = !DICompositeType(tag: DW_TAG_structure_type, file: !47, line: 301, size: 128, align: 64, elements: !268)
!268 = !{!269, !290}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !267, file: !47, line: 302, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !47, line: 193, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!34, !45, !274, !34}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !47, line: 191, baseType: !276)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !47, line: 178, size: 640, align: 64, elements: !277)
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !287, !288, !289}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !276, file: !47, line: 179, baseType: !128, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !276, file: !47, line: 180, baseType: !45, size: 64, align: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !276, file: !47, line: 181, baseType: !51, size: 64, align: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !276, file: !47, line: 182, baseType: !51, size: 64, align: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !276, file: !47, line: 184, baseType: !34, size: 32, align: 32, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !276, file: !47, line: 185, baseType: !34, size: 32, align: 32, offset: 288)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !276, file: !47, line: 186, baseType: !90, size: 64, align: 64, offset: 320)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !276, file: !47, line: 187, baseType: !286, size: 64, align: 64, offset: 384)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !276, file: !47, line: 188, baseType: !286, size: 64, align: 64, offset: 448)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !276, file: !47, line: 189, baseType: !286, size: 64, align: 64, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !276, file: !47, line: 190, baseType: !128, size: 64, align: 64, offset: 576)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !267, file: !47, line: 303, baseType: !291, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !47, line: 194, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !45, !274}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !60, file: !47, line: 366, baseType: !135, size: 64, align: 64, offset: 1344)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !60, file: !47, line: 368, baseType: !69, size: 64, align: 64, offset: 1408)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !60, file: !47, line: 372, baseType: !298, size: 64, align: 64, offset: 1472)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !47, line: 233, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!34, !45, !302, !128}
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !47, line: 232, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{!34, !45, !128}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !60, file: !47, line: 375, baseType: !181, size: 64, align: 64, offset: 1536)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !60, file: !47, line: 379, baseType: !308, size: 64, align: 64, offset: 1600)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !47, line: 322, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!45, !45, !45, !34}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !60, file: !47, line: 382, baseType: !51, size: 64, align: 64, offset: 1664)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !60, file: !47, line: 385, baseType: !314, size: 64, align: 64, offset: 1728)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !47, line: 323, baseType: !154)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !60, file: !47, line: 386, baseType: !316, size: 64, align: 64, offset: 1792)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !47, line: 324, baseType: !154)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !60, file: !47, line: 389, baseType: !318, size: 64, align: 64, offset: 1856)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !320, line: 40, size: 256, align: 64, elements: !321)
!320 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!321 = !{!322, !323, !325, !326}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !319, file: !320, line: 41, baseType: !69, size: 64, align: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !319, file: !320, line: 42, baseType: !324, size: 64, align: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !320, line: 18, baseType: !164)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !319, file: !320, line: 43, baseType: !34, size: 32, align: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !319, file: !320, line: 45, baseType: !69, size: 64, align: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !60, file: !47, line: 390, baseType: !328, size: 64, align: 64, offset: 1920)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !47, line: 390, flags: DIFlagFwdDecl)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !60, file: !47, line: 391, baseType: !331, size: 64, align: 64, offset: 1984)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !333, line: 11, size: 320, align: 64, elements: !334)
!333 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!334 = !{!335, !336, !341, !346, !347}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !332, file: !333, line: 12, baseType: !90, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !332, file: !333, line: 13, baseType: !337, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !333, line: 8, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!45, !45, !128}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !332, file: !333, line: 14, baseType: !342, size: 64, align: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !333, line: 9, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!34, !45, !45, !128}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !332, file: !333, line: 15, baseType: !90, size: 64, align: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !332, file: !333, line: 16, baseType: !128, size: 64, align: 64, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !60, file: !47, line: 392, baseType: !59, size: 64, align: 64, offset: 2048)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !60, file: !47, line: 393, baseType: !45, size: 64, align: 64, offset: 2112)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !60, file: !47, line: 394, baseType: !351, size: 64, align: 64, offset: 2176)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !47, line: 325, baseType: !173)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !60, file: !47, line: 395, baseType: !353, size: 64, align: 64, offset: 2240)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !47, line: 326, baseType: !249)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !60, file: !47, line: 396, baseType: !51, size: 64, align: 64, offset: 2304)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !60, file: !47, line: 397, baseType: !356, size: 64, align: 64, offset: 2368)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !47, line: 327, baseType: !249)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !60, file: !47, line: 398, baseType: !358, size: 64, align: 64, offset: 2432)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !47, line: 329, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!45, !59, !51}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !60, file: !47, line: 399, baseType: !363, size: 64, align: 64, offset: 2496)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !47, line: 328, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!45, !59, !45, !45}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !60, file: !47, line: 400, baseType: !368, size: 64, align: 64, offset: 2560)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !47, line: 307, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !128}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !60, file: !47, line: 401, baseType: !181, size: 64, align: 64, offset: 2624)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !60, file: !47, line: 402, baseType: !45, size: 64, align: 64, offset: 2688)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !60, file: !47, line: 403, baseType: !45, size: 64, align: 64, offset: 2752)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !60, file: !47, line: 404, baseType: !45, size: 64, align: 64, offset: 2816)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !60, file: !47, line: 405, baseType: !45, size: 64, align: 64, offset: 2880)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !60, file: !47, line: 406, baseType: !45, size: 64, align: 64, offset: 2944)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !60, file: !47, line: 407, baseType: !74, size: 64, align: 64, offset: 3008)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !60, file: !47, line: 410, baseType: !380, size: 32, align: 32, offset: 3072)
!380 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !60, file: !47, line: 412, baseType: !74, size: 64, align: 64, offset: 3136)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !25, file: !12, line: 89, baseType: !41, size: 64, align: 64, offset: 448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !25, file: !12, line: 90, baseType: !45, size: 64, align: 64, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !25, file: !12, line: 91, baseType: !45, size: 64, align: 64, offset: 576)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !25, file: !12, line: 93, baseType: !45, size: 64, align: 64, offset: 640)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !25, file: !12, line: 94, baseType: !45, size: 64, align: 64, offset: 704)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !25, file: !12, line: 95, baseType: !45, size: 64, align: 64, offset: 768)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !25, file: !12, line: 97, baseType: !45, size: 64, align: 64, offset: 832)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !25, file: !12, line: 98, baseType: !45, size: 64, align: 64, offset: 896)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !25, file: !12, line: 99, baseType: !45, size: 64, align: 64, offset: 960)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !25, file: !12, line: 101, baseType: !45, size: 64, align: 64, offset: 1024)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !25, file: !12, line: 103, baseType: !34, size: 32, align: 32, offset: 1088)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !25, file: !12, line: 105, baseType: !45, size: 64, align: 64, offset: 1152)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !25, file: !12, line: 106, baseType: !57, size: 64, align: 64, offset: 1216)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !25, file: !12, line: 108, baseType: !34, size: 32, align: 32, offset: 1280)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !25, file: !12, line: 109, baseType: !45, size: 64, align: 64, offset: 1344)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !25, file: !12, line: 134, baseType: !369, size: 64, align: 64, offset: 1408)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !25, file: !12, line: 135, baseType: !128, size: 64, align: 64, offset: 1472)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !19, file: !12, line: 24, baseType: !45, size: 64, align: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !19, file: !12, line: 25, baseType: !45, size: 64, align: 64, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !19, file: !12, line: 26, baseType: !45, size: 64, align: 64, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !19, file: !12, line: 27, baseType: !45, size: 64, align: 64, offset: 320)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !19, file: !12, line: 28, baseType: !45, size: 64, align: 64, offset: 384)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !19, file: !12, line: 30, baseType: !45, size: 64, align: 64, offset: 448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !19, file: !12, line: 31, baseType: !45, size: 64, align: 64, offset: 512)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !19, file: !12, line: 32, baseType: !45, size: 64, align: 64, offset: 576)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !19, file: !12, line: 33, baseType: !34, size: 32, align: 32, offset: 640)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !19, file: !12, line: 34, baseType: !34, size: 32, align: 32, offset: 672)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !19, file: !12, line: 37, baseType: !34, size: 32, align: 32, offset: 704)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !19, file: !12, line: 43, baseType: !45, size: 64, align: 64, offset: 768)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !12, line: 139, baseType: !25)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !416, line: 40, baseType: !417)
!416 = !DIFile(filename: "Include/listobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!417 = !DICompositeType(tag: DW_TAG_structure_type, file: !416, line: 23, size: 320, align: 64, elements: !418)
!418 = !{!419, !420, !422}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !417, file: !416, line: 24, baseType: !63, size: 192, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !417, file: !416, line: 26, baseType: !421, size: 64, align: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !417, file: !416, line: 39, baseType: !51, size: 64, align: 64, offset: 256)
!423 = !{!424, !429, !489, !494, !499, !502, !507, !553, !565, !576, !588, !617, !686, !695, !708, !715, !725, !741, !752, !779, !781, !786, !789, !792, !810, !816, !817, !820, !821, !831, !838, !844, !848, !855, !860, !869, !874, !877, !881, !884}
!424 = !DISubprogram(name: "PyInterpreterState_New", scope: !1, file: !1, line: 60, type: !425, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, function: %struct._is* ()* @PyInterpreterState_New, variables: !427)
!425 = !DISubroutineType(types: !426)
!426 = !{!17}
!427 = !{!428}
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp", scope: !424, file: !1, line: 62, type: !17)
!429 = !DISubprogram(name: "PyInterpreterState_Clear", scope: !1, file: !1, line: 105, type: !430, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._is*)* @PyInterpreterState_Clear, variables: !432)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !17}
!432 = !{!433, !434, !435, !437, !441, !443, !447, !449, !453, !455, !459, !461, !465, !467, !471, !473, !477, !479, !483, !485}
!433 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "interp", arg: 1, scope: !429, file: !1, line: 105, type: !17)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !429, file: !1, line: 107, type: !411)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !436, file: !1, line: 112, type: !45)
!436 = distinct !DILexicalBlock(scope: !429, file: !1, line: 112, column: 5)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !438, file: !1, line: 112, type: !45)
!438 = distinct !DILexicalBlock(scope: !439, file: !1, line: 112, column: 5)
!439 = distinct !DILexicalBlock(scope: !440, file: !1, line: 112, column: 5)
!440 = distinct !DILexicalBlock(scope: !436, file: !1, line: 112, column: 5)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !442, file: !1, line: 113, type: !45)
!442 = distinct !DILexicalBlock(scope: !429, file: !1, line: 113, column: 5)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !444, file: !1, line: 113, type: !45)
!444 = distinct !DILexicalBlock(scope: !445, file: !1, line: 113, column: 5)
!445 = distinct !DILexicalBlock(scope: !446, file: !1, line: 113, column: 5)
!446 = distinct !DILexicalBlock(scope: !442, file: !1, line: 113, column: 5)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !448, file: !1, line: 114, type: !45)
!448 = distinct !DILexicalBlock(scope: !429, file: !1, line: 114, column: 5)
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !450, file: !1, line: 114, type: !45)
!450 = distinct !DILexicalBlock(scope: !451, file: !1, line: 114, column: 5)
!451 = distinct !DILexicalBlock(scope: !452, file: !1, line: 114, column: 5)
!452 = distinct !DILexicalBlock(scope: !448, file: !1, line: 114, column: 5)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !454, file: !1, line: 115, type: !45)
!454 = distinct !DILexicalBlock(scope: !429, file: !1, line: 115, column: 5)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !456, file: !1, line: 115, type: !45)
!456 = distinct !DILexicalBlock(scope: !457, file: !1, line: 115, column: 5)
!457 = distinct !DILexicalBlock(scope: !458, file: !1, line: 115, column: 5)
!458 = distinct !DILexicalBlock(scope: !454, file: !1, line: 115, column: 5)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !460, file: !1, line: 116, type: !45)
!460 = distinct !DILexicalBlock(scope: !429, file: !1, line: 116, column: 5)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !462, file: !1, line: 116, type: !45)
!462 = distinct !DILexicalBlock(scope: !463, file: !1, line: 116, column: 5)
!463 = distinct !DILexicalBlock(scope: !464, file: !1, line: 116, column: 5)
!464 = distinct !DILexicalBlock(scope: !460, file: !1, line: 116, column: 5)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !466, file: !1, line: 117, type: !45)
!466 = distinct !DILexicalBlock(scope: !429, file: !1, line: 117, column: 5)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !468, file: !1, line: 117, type: !45)
!468 = distinct !DILexicalBlock(scope: !469, file: !1, line: 117, column: 5)
!469 = distinct !DILexicalBlock(scope: !470, file: !1, line: 117, column: 5)
!470 = distinct !DILexicalBlock(scope: !466, file: !1, line: 117, column: 5)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !472, file: !1, line: 118, type: !45)
!472 = distinct !DILexicalBlock(scope: !429, file: !1, line: 118, column: 5)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !474, file: !1, line: 118, type: !45)
!474 = distinct !DILexicalBlock(scope: !475, file: !1, line: 118, column: 5)
!475 = distinct !DILexicalBlock(scope: !476, file: !1, line: 118, column: 5)
!476 = distinct !DILexicalBlock(scope: !472, file: !1, line: 118, column: 5)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !478, file: !1, line: 119, type: !45)
!478 = distinct !DILexicalBlock(scope: !429, file: !1, line: 119, column: 5)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !480, file: !1, line: 119, type: !45)
!480 = distinct !DILexicalBlock(scope: !481, file: !1, line: 119, column: 5)
!481 = distinct !DILexicalBlock(scope: !482, file: !1, line: 119, column: 5)
!482 = distinct !DILexicalBlock(scope: !478, file: !1, line: 119, column: 5)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !484, file: !1, line: 120, type: !45)
!484 = distinct !DILexicalBlock(scope: !429, file: !1, line: 120, column: 5)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !486, file: !1, line: 120, type: !45)
!486 = distinct !DILexicalBlock(scope: !487, file: !1, line: 120, column: 5)
!487 = distinct !DILexicalBlock(scope: !488, file: !1, line: 120, column: 5)
!488 = distinct !DILexicalBlock(scope: !484, file: !1, line: 120, column: 5)
!489 = !DISubprogram(name: "PyInterpreterState_Delete", scope: !1, file: !1, line: 137, type: !430, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._is*)* @PyInterpreterState_Delete, variables: !490)
!490 = !{!491, !492}
!491 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "interp", arg: 1, scope: !489, file: !1, line: 137, type: !17)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !489, file: !1, line: 139, type: !493)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!494 = !DISubprogram(name: "PyThreadState_New", scope: !1, file: !1, line: 231, type: !495, isLocal: false, isDefinition: true, scopeLine: 232, flags: DIFlagPrototyped, isOptimized: true, function: %struct._ts* (%struct._is*)* @PyThreadState_New, variables: !497)
!495 = !DISubroutineType(types: !496)
!496 = !{!411, !17}
!497 = !{!498}
!498 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "interp", arg: 1, scope: !494, file: !1, line: 231, type: !17)
!499 = !DISubprogram(name: "_PyThreadState_Prealloc", scope: !1, file: !1, line: 237, type: !495, isLocal: false, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: true, function: %struct._ts* (%struct._is*)* @_PyThreadState_Prealloc, variables: !500)
!500 = !{!501}
!501 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "interp", arg: 1, scope: !499, file: !1, line: 237, type: !17)
!502 = !DISubprogram(name: "_PyThreadState_Init", scope: !1, file: !1, line: 243, type: !503, isLocal: false, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._ts*)* @_PyThreadState_Init, variables: !505)
!503 = !DISubroutineType(types: !504)
!504 = !{null, !411}
!505 = !{!506}
!506 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tstate", arg: 1, scope: !502, file: !1, line: 243, type: !411)
!507 = !DISubprogram(name: "PyState_FindModule", scope: !1, file: !1, line: 251, type: !508, isLocal: false, isDefinition: true, scopeLine: 252, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyModuleDef*)* @PyState_FindModule, variables: !535)
!508 = !DISubroutineType(types: !509)
!509 = !{!45, !510}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64, align: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !512, line: 47, size: 832, align: 64, elements: !513)
!512 = !DIFile(filename: "Include/moduleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!513 = !{!514, !525, !526, !527, !528, !531, !532, !533, !534}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !511, file: !512, line: 48, baseType: !515, size: 320, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !512, line: 38, baseType: !516)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !512, line: 33, size: 320, align: 64, elements: !517)
!517 = !{!518, !519, !523, !524}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !516, file: !512, line: 34, baseType: !46, size: 128, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !516, file: !512, line: 35, baseType: !520, size: 64, align: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, align: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{!45}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !516, file: !512, line: 36, baseType: !51, size: 64, align: 64, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !516, file: !512, line: 37, baseType: !45, size: 64, align: 64, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !511, file: !512, line: 49, baseType: !69, size: 64, align: 64, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !511, file: !512, line: 50, baseType: !69, size: 64, align: 64, offset: 384)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !511, file: !512, line: 51, baseType: !51, size: 64, align: 64, offset: 448)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !511, file: !512, line: 52, baseType: !529, size: 64, align: 64, offset: 512)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !320, line: 47, baseType: !319)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !511, file: !512, line: 53, baseType: !181, size: 64, align: 64, offset: 576)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !511, file: !512, line: 54, baseType: !298, size: 64, align: 64, offset: 640)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !511, file: !512, line: 55, baseType: !181, size: 64, align: 64, offset: 704)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !511, file: !512, line: 56, baseType: !368, size: 64, align: 64, offset: 768)
!535 = !{!536, !537, !538, !539, !546, !547, !550, !552}
!536 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !507, file: !1, line: 251, type: !510)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !507, file: !1, line: 253, type: !51)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !507, file: !1, line: 254, type: !17)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !540, file: !1, line: 254, type: !541)
!540 = distinct !DILexicalBlock(scope: !507, file: !1, line: 254, column: 33)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !4, line: 33, baseType: !543)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !4, line: 31, size: 64, align: 64, elements: !544)
!544 = !{!545}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !543, file: !4, line: 32, baseType: !128, size: 64, align: 64)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !540, file: !1, line: 254, type: !128)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !540, file: !1, line: 254, type: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !128)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !540, file: !1, line: 254, type: !551)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !4, line: 29, baseType: !3)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !507, file: !1, line: 255, type: !45)
!553 = !DISubprogram(name: "_PyState_AddModule", scope: !1, file: !1, line: 267, type: !554, isLocal: false, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct.PyModuleDef*)* @_PyState_AddModule, variables: !556)
!554 = !DISubroutineType(types: !555)
!555 = !{!34, !45, !510}
!556 = !{!557, !558, !559, !560, !562, !563, !564}
!557 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !553, file: !1, line: 267, type: !45)
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "def", arg: 2, scope: !553, file: !1, line: 267, type: !510)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !553, file: !1, line: 269, type: !17)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !561, file: !1, line: 269, type: !541)
!561 = distinct !DILexicalBlock(scope: !553, file: !1, line: 269, column: 33)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !561, file: !1, line: 269, type: !128)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !561, file: !1, line: 269, type: !548)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !561, file: !1, line: 269, type: !551)
!565 = !DISubprogram(name: "PyState_AddModule", scope: !1, file: !1, line: 286, type: !554, isLocal: false, isDefinition: true, scopeLine: 287, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct.PyModuleDef*)* @PyState_AddModule, variables: !566)
!566 = !{!567, !568, !569, !570, !571, !573, !574, !575}
!567 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !565, file: !1, line: 286, type: !45)
!568 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "def", arg: 2, scope: !565, file: !1, line: 286, type: !510)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !565, file: !1, line: 288, type: !51)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !565, file: !1, line: 289, type: !17)
