; ModuleID = 'setobject.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !11, subprograms: !521, globals: !1472)
!1 = !DIFile(filename: "Objects/setobject.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !4, line: 23, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!7 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!8 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!9 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!10 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!11 = !{!12, !97, !358, !384, !442, !102, !18, !368, !461, !470, !484, !485, !493, !494, !511, !520}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !14, line: 109, baseType: !15)
!14 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !14, line: 105, size: 128, align: 64, elements: !16)
!16 = !{!17, !25}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !15, file: !14, line: 107, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !19, line: 177, baseType: !20)
!19 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !21, line: 102, baseType: !22)
!21 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !23, line: 181, baseType: !24)
!23 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!24 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !15, file: !14, line: 108, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !14, line: 334, size: 3200, align: 64, elements: !28)
!28 = !{!29, !35, !39, !40, !41, !46, !110, !115, !120, !121, !126, !178, !209, !221, !227, !228, !229, !231, !233, !264, !265, !266, !275, !276, !281, !282, !284, !286, !296, !306, !324, !325, !326, !328, !330, !331, !333, !338, !343, !348, !349, !350, !351, !352, !353, !354, !355, !357}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !27, file: !14, line: 335, baseType: !30, size: 192, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !14, line: 114, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 111, size: 192, align: 64, elements: !32)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !14, line: 112, baseType: !13, size: 128, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !31, file: !14, line: 113, baseType: !18, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !27, file: !14, line: 336, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !27, file: !14, line: 341, baseType: !42, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !14, line: 308, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !12}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !27, file: !14, line: 342, baseType: !47, size: 64, align: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !14, line: 314, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !12, !52, !51}
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !21, line: 48, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !55, line: 246, size: 1728, align: 64, elements: !56)
!55 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!56 = !{!57, !58, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !78, !79, !80, !81, !83, !85, !87, !91, !94, !96, !98, !99, !100, !101, !105, !106}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !54, file: !55, line: 247, baseType: !51, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !54, file: !55, line: 252, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !54, file: !55, line: 253, baseType: !59, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !54, file: !55, line: 254, baseType: !59, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !54, file: !55, line: 255, baseType: !59, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !54, file: !55, line: 256, baseType: !59, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !54, file: !55, line: 257, baseType: !59, size: 64, align: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !54, file: !55, line: 258, baseType: !59, size: 64, align: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !54, file: !55, line: 259, baseType: !59, size: 64, align: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !54, file: !55, line: 261, baseType: !59, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !54, file: !55, line: 262, baseType: !59, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !54, file: !55, line: 263, baseType: !59, size: 64, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !54, file: !55, line: 265, baseType: !71, size: 64, align: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !55, line: 161, size: 192, align: 64, elements: !73)
!73 = !{!74, !75, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !72, file: !55, line: 162, baseType: !71, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !72, file: !55, line: 163, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !72, file: !55, line: 167, baseType: !51, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !54, file: !55, line: 267, baseType: !76, size: 64, align: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !54, file: !55, line: 269, baseType: !51, size: 32, align: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !54, file: !55, line: 273, baseType: !51, size: 32, align: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !54, file: !55, line: 275, baseType: !82, size: 64, align: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !23, line: 140, baseType: !24)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !54, file: !55, line: 279, baseType: !84, size: 16, align: 16, offset: 1024)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !54, file: !55, line: 280, baseType: !86, size: 8, align: 8, offset: 1040)
!86 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !54, file: !55, line: 281, baseType: !88, size: 8, align: 8, offset: 1048)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !54, file: !55, line: 285, baseType: !92, size: 64, align: 64, offset: 1088)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !55, line: 155, baseType: null)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !54, file: !55, line: 294, baseType: !95, size: 64, align: 64, offset: 1152)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !23, line: 141, baseType: !24)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !54, file: !55, line: 303, baseType: !97, size: 64, align: 64, offset: 1216)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !54, file: !55, line: 304, baseType: !97, size: 64, align: 64, offset: 1280)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !54, file: !55, line: 305, baseType: !97, size: 64, align: 64, offset: 1344)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !54, file: !55, line: 306, baseType: !97, size: 64, align: 64, offset: 1408)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !54, file: !55, line: 307, baseType: !102, size: 64, align: 64, offset: 1472)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !103, line: 62, baseType: !104)
!103 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!104 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !54, file: !55, line: 309, baseType: !51, size: 32, align: 32, offset: 1536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !54, file: !55, line: 311, baseType: !107, size: 160, align: 8, offset: 1568)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, align: 8, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 20)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !27, file: !14, line: 343, baseType: !111, size: 64, align: 64, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !14, line: 316, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!12, !12, !59}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !27, file: !14, line: 344, baseType: !116, size: 64, align: 64, offset: 576)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !14, line: 318, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!51, !12, !59, !12}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !27, file: !14, line: 345, baseType: !97, size: 64, align: 64, offset: 640)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !27, file: !14, line: 346, baseType: !122, size: 64, align: 64, offset: 704)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !14, line: 320, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!12, !12}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !27, file: !14, line: 350, baseType: !127, size: 64, align: 64, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !14, line: 278, baseType: !129)
!129 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 236, size: 2176, align: 64, elements: !130)
!130 = !{!131, !136, !137, !138, !139, !140, !145, !147, !148, !149, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !129, file: !14, line: 241, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !14, line: 166, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!12, !12, !12}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !129, file: !14, line: 242, baseType: !132, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !129, file: !14, line: 243, baseType: !132, size: 64, align: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !129, file: !14, line: 244, baseType: !132, size: 64, align: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !129, file: !14, line: 245, baseType: !132, size: 64, align: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !129, file: !14, line: 246, baseType: !141, size: 64, align: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !14, line: 167, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!12, !12, !12, !12}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !129, file: !14, line: 247, baseType: !146, size: 64, align: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !14, line: 165, baseType: !123)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !129, file: !14, line: 248, baseType: !146, size: 64, align: 64, offset: 448)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !129, file: !14, line: 249, baseType: !146, size: 64, align: 64, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !129, file: !14, line: 250, baseType: !150, size: 64, align: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !14, line: 168, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!51, !12}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !129, file: !14, line: 251, baseType: !146, size: 64, align: 64, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !129, file: !14, line: 252, baseType: !132, size: 64, align: 64, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !129, file: !14, line: 253, baseType: !132, size: 64, align: 64, offset: 768)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !129, file: !14, line: 254, baseType: !132, size: 64, align: 64, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !129, file: !14, line: 255, baseType: !132, size: 64, align: 64, offset: 896)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !129, file: !14, line: 256, baseType: !132, size: 64, align: 64, offset: 960)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !129, file: !14, line: 257, baseType: !146, size: 64, align: 64, offset: 1024)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !129, file: !14, line: 258, baseType: !97, size: 64, align: 64, offset: 1088)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !129, file: !14, line: 259, baseType: !146, size: 64, align: 64, offset: 1152)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !129, file: !14, line: 261, baseType: !132, size: 64, align: 64, offset: 1216)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !129, file: !14, line: 262, baseType: !132, size: 64, align: 64, offset: 1280)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !129, file: !14, line: 263, baseType: !132, size: 64, align: 64, offset: 1344)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !129, file: !14, line: 264, baseType: !132, size: 64, align: 64, offset: 1408)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !129, file: !14, line: 265, baseType: !141, size: 64, align: 64, offset: 1472)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !129, file: !14, line: 266, baseType: !132, size: 64, align: 64, offset: 1536)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !129, file: !14, line: 267, baseType: !132, size: 64, align: 64, offset: 1600)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !129, file: !14, line: 268, baseType: !132, size: 64, align: 64, offset: 1664)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !129, file: !14, line: 269, baseType: !132, size: 64, align: 64, offset: 1728)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !129, file: !14, line: 270, baseType: !132, size: 64, align: 64, offset: 1792)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !129, file: !14, line: 272, baseType: !132, size: 64, align: 64, offset: 1856)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !129, file: !14, line: 273, baseType: !132, size: 64, align: 64, offset: 1920)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !129, file: !14, line: 274, baseType: !132, size: 64, align: 64, offset: 1984)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !129, file: !14, line: 275, baseType: !132, size: 64, align: 64, offset: 2048)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !129, file: !14, line: 277, baseType: !146, size: 64, align: 64, offset: 2112)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !27, file: !14, line: 351, baseType: !179, size: 64, align: 64, offset: 832)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !14, line: 292, baseType: !181)
!181 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 280, size: 640, align: 64, elements: !182)
!182 = !{!183, !188, !189, !194, !195, !196, !201, !202, !207, !208}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !181, file: !14, line: 281, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !14, line: 169, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!18, !12}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !181, file: !14, line: 282, baseType: !132, size: 64, align: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !181, file: !14, line: 283, baseType: !190, size: 64, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !14, line: 170, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!12, !12, !18}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !181, file: !14, line: 284, baseType: !190, size: 64, align: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !181, file: !14, line: 285, baseType: !97, size: 64, align: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !181, file: !14, line: 286, baseType: !197, size: 64, align: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !14, line: 172, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!51, !12, !18, !12}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !181, file: !14, line: 287, baseType: !97, size: 64, align: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !181, file: !14, line: 288, baseType: !203, size: 64, align: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !14, line: 231, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!51, !12, !12}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !181, file: !14, line: 290, baseType: !132, size: 64, align: 64, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !181, file: !14, line: 291, baseType: !190, size: 64, align: 64, offset: 576)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !27, file: !14, line: 352, baseType: !210, size: 64, align: 64, offset: 896)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !14, line: 298, baseType: !212)
!212 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 294, size: 192, align: 64, elements: !213)
!213 = !{!214, !215, !216}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !212, file: !14, line: 295, baseType: !184, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !212, file: !14, line: 296, baseType: !132, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !212, file: !14, line: 297, baseType: !217, size: 64, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !14, line: 174, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!51, !12, !12, !12}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !27, file: !14, line: 356, baseType: !222, size: 64, align: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !14, line: 321, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!226, !12}
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !19, line: 186, baseType: !18)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !27, file: !14, line: 357, baseType: !141, size: 64, align: 64, offset: 1024)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !27, file: !14, line: 358, baseType: !122, size: 64, align: 64, offset: 1088)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !27, file: !14, line: 359, baseType: !230, size: 64, align: 64, offset: 1152)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !14, line: 317, baseType: !133)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !27, file: !14, line: 360, baseType: !232, size: 64, align: 64, offset: 1216)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !14, line: 319, baseType: !218)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !27, file: !14, line: 363, baseType: !234, size: 64, align: 64, offset: 1280)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !14, line: 304, baseType: !236)
!236 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 301, size: 128, align: 64, elements: !237)
!237 = !{!238, !259}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !236, file: !14, line: 302, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !14, line: 193, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!51, !12, !243, !51}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !14, line: 191, baseType: !245)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !14, line: 178, size: 640, align: 64, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254, !256, !257, !258}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !245, file: !14, line: 179, baseType: !97, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !245, file: !14, line: 180, baseType: !12, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !245, file: !14, line: 181, baseType: !18, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !245, file: !14, line: 182, baseType: !18, size: 64, align: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !245, file: !14, line: 184, baseType: !51, size: 32, align: 32, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !245, file: !14, line: 185, baseType: !51, size: 32, align: 32, offset: 288)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !245, file: !14, line: 186, baseType: !59, size: 64, align: 64, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !245, file: !14, line: 187, baseType: !255, size: 64, align: 64, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !245, file: !14, line: 188, baseType: !255, size: 64, align: 64, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !245, file: !14, line: 189, baseType: !255, size: 64, align: 64, offset: 512)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !245, file: !14, line: 190, baseType: !97, size: 64, align: 64, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !236, file: !14, line: 303, baseType: !260, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !14, line: 194, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !12, !243}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !27, file: !14, line: 366, baseType: !104, size: 64, align: 64, offset: 1344)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !27, file: !14, line: 368, baseType: !36, size: 64, align: 64, offset: 1408)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !27, file: !14, line: 372, baseType: !267, size: 64, align: 64, offset: 1472)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !14, line: 233, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!51, !12, !271, !97}
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !14, line: 232, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!51, !12, !97}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !27, file: !14, line: 375, baseType: !150, size: 64, align: 64, offset: 1536)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !27, file: !14, line: 379, baseType: !277, size: 64, align: 64, offset: 1600)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !14, line: 322, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!12, !12, !12, !51}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !27, file: !14, line: 382, baseType: !18, size: 64, align: 64, offset: 1664)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !27, file: !14, line: 385, baseType: !283, size: 64, align: 64, offset: 1728)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !14, line: 323, baseType: !123)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !27, file: !14, line: 386, baseType: !285, size: 64, align: 64, offset: 1792)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !14, line: 324, baseType: !123)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !27, file: !14, line: 389, baseType: !287, size: 64, align: 64, offset: 1856)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !289, line: 40, size: 256, align: 64, elements: !290)
!289 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!290 = !{!291, !292, !294, !295}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !288, file: !289, line: 41, baseType: !36, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !288, file: !289, line: 42, baseType: !293, size: 64, align: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !289, line: 18, baseType: !133)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !288, file: !289, line: 43, baseType: !51, size: 32, align: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !288, file: !289, line: 45, baseType: !36, size: 64, align: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !27, file: !14, line: 390, baseType: !297, size: 64, align: 64, offset: 1920)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !299, line: 18, size: 320, align: 64, elements: !300)
!299 = !DIFile(filename: "Include/structmember.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!300 = !{!301, !302, !303, !304, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !298, file: !299, line: 19, baseType: !59, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !298, file: !299, line: 20, baseType: !51, size: 32, align: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !298, file: !299, line: 21, baseType: !18, size: 64, align: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !298, file: !299, line: 22, baseType: !51, size: 32, align: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !298, file: !299, line: 23, baseType: !59, size: 64, align: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !27, file: !14, line: 391, baseType: !307, size: 64, align: 64, offset: 1984)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !309, line: 11, size: 320, align: 64, elements: !310)
!309 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!310 = !{!311, !312, !317, !322, !323}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !308, file: !309, line: 12, baseType: !59, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !308, file: !309, line: 13, baseType: !313, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !309, line: 8, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!12, !12, !97}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !308, file: !309, line: 14, baseType: !318, size: 64, align: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !309, line: 9, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!51, !12, !12, !97}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !308, file: !309, line: 15, baseType: !59, size: 64, align: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !308, file: !309, line: 16, baseType: !97, size: 64, align: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !27, file: !14, line: 392, baseType: !26, size: 64, align: 64, offset: 2048)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !27, file: !14, line: 393, baseType: !12, size: 64, align: 64, offset: 2112)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !27, file: !14, line: 394, baseType: !327, size: 64, align: 64, offset: 2176)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !14, line: 325, baseType: !142)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !27, file: !14, line: 395, baseType: !329, size: 64, align: 64, offset: 2240)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !14, line: 326, baseType: !218)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !27, file: !14, line: 396, baseType: !18, size: 64, align: 64, offset: 2304)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !27, file: !14, line: 397, baseType: !332, size: 64, align: 64, offset: 2368)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !14, line: 327, baseType: !218)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !27, file: !14, line: 398, baseType: !334, size: 64, align: 64, offset: 2432)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !14, line: 329, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!12, !26, !18}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !27, file: !14, line: 399, baseType: !339, size: 64, align: 64, offset: 2496)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !14, line: 328, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!12, !26, !12, !12}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !27, file: !14, line: 400, baseType: !344, size: 64, align: 64, offset: 2560)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !14, line: 307, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !97}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !27, file: !14, line: 401, baseType: !150, size: 64, align: 64, offset: 2624)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !27, file: !14, line: 402, baseType: !12, size: 64, align: 64, offset: 2688)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !27, file: !14, line: 403, baseType: !12, size: 64, align: 64, offset: 2752)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !27, file: !14, line: 404, baseType: !12, size: 64, align: 64, offset: 2816)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !27, file: !14, line: 405, baseType: !12, size: 64, align: 64, offset: 2880)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !27, file: !14, line: 406, baseType: !12, size: 64, align: 64, offset: 2944)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !27, file: !14, line: 407, baseType: !42, size: 64, align: 64, offset: 3008)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !27, file: !14, line: 410, baseType: !356, size: 32, align: 32, offset: 3072)
!356 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !27, file: !14, line: 412, baseType: !42, size: 64, align: 64, offset: 3136)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySetObject", file: !360, line: 35, baseType: !361)
!360 = !DIFile(filename: "Include/setobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "_setobject", file: !360, line: 36, size: 1600, align: 64, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !374, !378, !379, !383}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !361, file: !360, line: 37, baseType: !13, size: 128, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !361, file: !360, line: 39, baseType: !18, size: 64, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !361, file: !360, line: 40, baseType: !18, size: 64, align: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !361, file: !360, line: 46, baseType: !18, size: 64, align: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !361, file: !360, line: 52, baseType: !368, size: 64, align: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "setentry", file: !360, line: 28, baseType: !370)
!370 = !DICompositeType(tag: DW_TAG_structure_type, file: !360, line: 24, size: 128, align: 64, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !370, file: !360, line: 26, baseType: !12, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !370, file: !360, line: 27, baseType: !226, size: 64, align: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !361, file: !360, line: 53, baseType: !375, size: 64, align: 64, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!368, !358, !12, !226}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !361, file: !360, line: 54, baseType: !226, size: 64, align: 64, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "smalltable", scope: !361, file: !360, line: 55, baseType: !380, size: 1024, align: 64, offset: 512)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 1024, align: 64, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 8)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !361, file: !360, line: 57, baseType: !12, size: 64, align: 64, offset: 1536)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !386, line: 139, baseType: !387)
!386 = !DIFile(filename: "Include/pystate.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !386, line: 69, size: 1536, align: 64, elements: !388)
!388 = !{!389, !391, !392, !412, !415, !416, !417, !418, !419, !420, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !387, file: !386, line: 72, baseType: !390, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !387, file: !386, line: 73, baseType: !390, size: 64, align: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !387, file: !386, line: 74, baseType: !393, size: 64, align: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !386, line: 44, baseType: !395)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !386, line: 19, size: 832, align: 64, elements: !396)
!396 = !{!397, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !395, file: !386, line: 21, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !395, file: !386, line: 22, baseType: !390, size: 64, align: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !395, file: !386, line: 24, baseType: !12, size: 64, align: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !395, file: !386, line: 25, baseType: !12, size: 64, align: 64, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !395, file: !386, line: 26, baseType: !12, size: 64, align: 64, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !395, file: !386, line: 27, baseType: !12, size: 64, align: 64, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !395, file: !386, line: 28, baseType: !12, size: 64, align: 64, offset: 384)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !395, file: !386, line: 30, baseType: !12, size: 64, align: 64, offset: 448)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !395, file: !386, line: 31, baseType: !12, size: 64, align: 64, offset: 512)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !395, file: !386, line: 32, baseType: !12, size: 64, align: 64, offset: 576)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !395, file: !386, line: 33, baseType: !51, size: 32, align: 32, offset: 640)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !395, file: !386, line: 34, baseType: !51, size: 32, align: 32, offset: 672)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !395, file: !386, line: 37, baseType: !51, size: 32, align: 32, offset: 704)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !395, file: !386, line: 43, baseType: !12, size: 64, align: 64, offset: 768)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !387, file: !386, line: 76, baseType: !413, size: 64, align: 64, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !386, line: 50, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !387, file: !386, line: 77, baseType: !51, size: 32, align: 32, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !387, file: !386, line: 78, baseType: !38, size: 8, align: 8, offset: 288)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !387, file: !386, line: 80, baseType: !38, size: 8, align: 8, offset: 296)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !387, file: !386, line: 85, baseType: !51, size: 32, align: 32, offset: 320)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !387, file: !386, line: 86, baseType: !51, size: 32, align: 32, offset: 352)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !387, file: !386, line: 88, baseType: !421, size: 64, align: 64, offset: 384)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !386, line: 54, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!51, !12, !413, !51, !12}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !387, file: !386, line: 89, baseType: !421, size: 64, align: 64, offset: 448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !387, file: !386, line: 90, baseType: !12, size: 64, align: 64, offset: 512)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !387, file: !386, line: 91, baseType: !12, size: 64, align: 64, offset: 576)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !387, file: !386, line: 93, baseType: !12, size: 64, align: 64, offset: 640)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !387, file: !386, line: 94, baseType: !12, size: 64, align: 64, offset: 704)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !387, file: !386, line: 95, baseType: !12, size: 64, align: 64, offset: 768)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !387, file: !386, line: 97, baseType: !12, size: 64, align: 64, offset: 832)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !387, file: !386, line: 98, baseType: !12, size: 64, align: 64, offset: 896)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !387, file: !386, line: 99, baseType: !12, size: 64, align: 64, offset: 960)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !387, file: !386, line: 101, baseType: !12, size: 64, align: 64, offset: 1024)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !387, file: !386, line: 103, baseType: !51, size: 32, align: 32, offset: 1088)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !387, file: !386, line: 105, baseType: !12, size: 64, align: 64, offset: 1152)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !387, file: !386, line: 106, baseType: !24, size: 64, align: 64, offset: 1216)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !387, file: !386, line: 108, baseType: !51, size: 32, align: 32, offset: 1280)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !387, file: !386, line: 109, baseType: !12, size: 64, align: 64, offset: 1344)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !387, file: !386, line: 134, baseType: !345, size: 64, align: 64, offset: 1408)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !387, file: !386, line: 135, baseType: !97, size: 64, align: 64, offset: 1472)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !444, line: 351, baseType: !445)
!444 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!445 = !DICompositeType(tag: DW_TAG_structure_type, file: !444, line: 217, size: 384, align: 64, elements: !446)
!446 = !{!447, !448, !449, !450, !458}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !445, file: !444, line: 291, baseType: !13, size: 128, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !445, file: !444, line: 292, baseType: !18, size: 64, align: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !445, file: !444, line: 293, baseType: !226, size: 64, align: 64, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !445, file: !444, line: 349, baseType: !451, size: 32, align: 32, offset: 256)
!451 = !DICompositeType(tag: DW_TAG_structure_type, scope: !445, file: !444, line: 294, size: 32, align: 32, elements: !452)
!452 = !{!453, !454, !455, !456, !457}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !451, file: !444, line: 303, baseType: !356, size: 2, align: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !451, file: !444, line: 331, baseType: !356, size: 3, align: 32, offset: 2)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !451, file: !444, line: 336, baseType: !356, size: 1, align: 32, offset: 5)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !451, file: !444, line: 340, baseType: !356, size: 1, align: 32, offset: 6)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !451, file: !444, line: 345, baseType: !356, size: 1, align: 32, offset: 7)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !445, file: !444, line: 350, baseType: !459, size: 64, align: 64, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !103, line: 90, baseType: !51)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "setiterobject", file: !1, line: 787, baseType: !463)
!463 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 781, size: 384, align: 64, elements: !464)
!464 = !{!465, !466, !467, !468, !469}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !463, file: !1, line: 782, baseType: !13, size: 128, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "si_set", scope: !463, file: !1, line: 783, baseType: !358, size: 64, align: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "si_used", scope: !463, file: !1, line: 784, baseType: !18, size: 64, align: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "si_pos", scope: !463, file: !1, line: 785, baseType: !18, size: 64, align: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !463, file: !1, line: 786, baseType: !18, size: 64, align: 64, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !472, line: 253, baseType: !473)
!472 = !DIFile(filename: "Include/objimpl.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!473 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !472, line: 246, size: 192, align: 64, elements: !474)
!474 = !{!475, !482}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !473, file: !472, line: 251, baseType: !476, size: 192, align: 64)
!476 = !DICompositeType(tag: DW_TAG_structure_type, scope: !473, file: !472, line: 247, size: 192, align: 64, elements: !477)
!477 = !{!478, !480, !481}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !476, file: !472, line: 248, baseType: !479, size: 64, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !476, file: !472, line: 249, baseType: !479, size: 64, align: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !476, file: !472, line: 250, baseType: !18, size: 64, align: 64, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !473, file: !472, line: 252, baseType: !483, size: 64, align: 64)
!483 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !487, line: 33, baseType: !488)
!487 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!488 = !DICompositeType(tag: DW_TAG_structure_type, file: !487, line: 25, size: 256, align: 64, elements: !489)
!489 = !{!490, !491}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !488, file: !487, line: 26, baseType: !30, size: 192, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !488, file: !487, line: 27, baseType: !492, size: 64, align: 64, offset: 192)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, align: 64, elements: !89)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_uhash_t", file: !19, line: 189, baseType: !102)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !444, line: 376, baseType: !496)
!496 = !DICompositeType(tag: DW_TAG_structure_type, file: !444, line: 368, size: 640, align: 64, elements: !497)
!497 = !{!498, !506}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !496, file: !444, line: 369, baseType: !499, size: 576, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !444, line: 363, baseType: !500)
!500 = !DICompositeType(tag: DW_TAG_structure_type, file: !444, line: 356, size: 576, align: 64, elements: !501)
!501 = !{!502, !503, !504, !505}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !500, file: !444, line: 357, baseType: !443, size: 384, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !500, file: !444, line: 358, baseType: !18, size: 64, align: 64, offset: 384)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !500, file: !444, line: 360, baseType: !59, size: 64, align: 64, offset: 448)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !500, file: !444, line: 361, baseType: !18, size: 64, align: 64, offset: 512)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !496, file: !444, line: 375, baseType: !507, size: 64, align: 64, offset: 576)
!507 = !DICompositeType(tag: DW_TAG_union_type, scope: !496, file: !444, line: 370, size: 64, align: 64, elements: !508)
!508 = !{!509, !510, !514, !517}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !507, file: !444, line: 371, baseType: !97, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !507, file: !444, line: 372, baseType: !511, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !444, line: 134, baseType: !513)
!513 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !507, file: !444, line: 373, baseType: !515, size: 64, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !444, line: 129, baseType: !84)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !507, file: !444, line: 374, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !444, line: 121, baseType: !356)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!521 = !{!522, !526, !536, !539, !542, !545, !548, !552, !556, !560, !571, !574, !578, !588, !599, !611, !615, !650, !682, !691, !696, !699, !715, !721, !750, !757, !760, !784, !794, !807, !820, !828, !839, !852, !858, !862, !928, !932, !940, !981, !984, !993, !997, !1004, !1011, !1025, !1032, !1036, !1039, !1049, !1062, !1080, !1083, !1095, !1109, !1119, !1125, !1129, !1134, !1144, !1158, !1167, !1184, !1191, !1226, !1248, !1258, !1262, !1276, !1285, !1293, !1300, !1308, !1311, !1324, !1335, !1347, !1374, !1381, !1387, !1396, !1406, !1417, !1423, !1448, !1466, !1469}
!522 = !DISubprogram(name: "PySet_ClearFreeList", scope: !1, file: !1, line: 1093, type: !523, isLocal: false, isDefinition: true, scopeLine: 1094, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @PySet_ClearFreeList, variables: !525)
!523 = !DISubroutineType(types: !524)
!524 = !{!51}
!525 = !{}
!526 = !DISubprogram(name: "PySet_Fini", scope: !1, file: !1, line: 1099, type: !527, isLocal: false, isDefinition: true, scopeLine: 1100, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PySet_Fini, variables: !529)
!527 = !DISubroutineType(types: !528)
!528 = !{null}
!529 = !{!530, !532}
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !531, file: !1, line: 1101, type: !12)
!531 = distinct !DILexicalBlock(scope: !526, file: !1, line: 1101, column: 5)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !533, file: !1, line: 1101, type: !12)
!533 = distinct !DILexicalBlock(scope: !534, file: !1, line: 1101, column: 5)
!534 = distinct !DILexicalBlock(scope: !535, file: !1, line: 1101, column: 5)
!535 = distinct !DILexicalBlock(scope: !531, file: !1, line: 1101, column: 5)
!536 = !DISubprogram(name: "PySet_New", scope: !1, file: !1, line: 2260, type: !124, isLocal: false, isDefinition: true, scopeLine: 2261, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PySet_New, variables: !537)
!537 = !{!538}
!538 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iterable", arg: 1, scope: !536, file: !1, line: 2260, type: !12)
!539 = !DISubprogram(name: "PyFrozenSet_New", scope: !1, file: !1, line: 2266, type: !124, isLocal: false, isDefinition: true, scopeLine: 2267, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyFrozenSet_New, variables: !540)
!540 = !{!541}
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iterable", arg: 1, scope: !539, file: !1, line: 2266, type: !12)
!542 = !DISubprogram(name: "PySet_Size", scope: !1, file: !1, line: 2272, type: !186, isLocal: false, isDefinition: true, scopeLine: 2273, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PySet_Size, variables: !543)
!543 = !{!544}
!544 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "anyset", arg: 1, scope: !542, file: !1, line: 2272, type: !12)
!545 = !DISubprogram(name: "PySet_Clear", scope: !1, file: !1, line: 2282, type: !152, isLocal: false, isDefinition: true, scopeLine: 2283, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @PySet_Clear, variables: !546)
!546 = !{!547}
!547 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "set", arg: 1, scope: !545, file: !1, line: 2282, type: !12)
!548 = !DISubprogram(name: "PySet_Contains", scope: !1, file: !1, line: 2292, type: !205, isLocal: false, isDefinition: true, scopeLine: 2293, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*)* @PySet_Contains, variables: !549)
!549 = !{!550, !551}
!550 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "anyset", arg: 1, scope: !548, file: !1, line: 2292, type: !12)
!551 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !548, file: !1, line: 2292, type: !12)
!552 = !DISubprogram(name: "PySet_Discard", scope: !1, file: !1, line: 2302, type: !205, isLocal: false, isDefinition: true, scopeLine: 2303, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*)* @PySet_Discard, variables: !553)
!553 = !{!554, !555}
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "set", arg: 1, scope: !552, file: !1, line: 2302, type: !12)
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !552, file: !1, line: 2302, type: !12)
!556 = !DISubprogram(name: "PySet_Add", scope: !1, file: !1, line: 2312, type: !205, isLocal: false, isDefinition: true, scopeLine: 2313, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*)* @PySet_Add, variables: !557)
!557 = !{!558, !559}
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "anyset", arg: 1, scope: !556, file: !1, line: 2312, type: !12)
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !556, file: !1, line: 2312, type: !12)
!560 = !DISubprogram(name: "_PySet_NextEntry", scope: !1, file: !1, line: 2323, type: !561, isLocal: false, isDefinition: true, scopeLine: 2324, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64*, %struct._object**, i64*)* @_PySet_NextEntry, variables: !565)
!561 = !DISubroutineType(types: !562)
!562 = !{!51, !12, !255, !563, !564}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!565 = !{!566, !567, !568, !569, !570}
!566 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "set", arg: 1, scope: !560, file: !1, line: 2323, type: !12)
!567 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pos", arg: 2, scope: !560, file: !1, line: 2323, type: !255)
!568 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 3, scope: !560, file: !1, line: 2323, type: !563)
!569 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hash", arg: 4, scope: !560, file: !1, line: 2323, type: !564)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !560, file: !1, line: 2325, type: !368)
!571 = !DISubprogram(name: "PySet_Pop", scope: !1, file: !1, line: 2339, type: !124, isLocal: false, isDefinition: true, scopeLine: 2340, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PySet_Pop, variables: !572)
!572 = !{!573}
!573 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "set", arg: 1, scope: !571, file: !1, line: 2339, type: !12)
!574 = !DISubprogram(name: "_PySet_Update", scope: !1, file: !1, line: 2349, type: !205, isLocal: false, isDefinition: true, scopeLine: 2350, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*)* @_PySet_Update, variables: !575)
!575 = !{!576, !577}
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "set", arg: 1, scope: !574, file: !1, line: 2349, type: !12)
!577 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iterable", arg: 2, scope: !574, file: !1, line: 2349, type: !12)
!578 = !DISubprogram(name: "setiter_dealloc", scope: !1, file: !1, line: 790, type: !579, isLocal: true, isDefinition: true, scopeLine: 791, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.setiterobject*)* @setiter_dealloc, variables: !581)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !461}
!581 = !{!582, !583, !585}
!582 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "si", arg: 1, scope: !578, file: !1, line: 790, type: !461)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !584, file: !1, line: 792, type: !12)
!584 = distinct !DILexicalBlock(scope: !578, file: !1, line: 792, column: 5)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !586, file: !1, line: 792, type: !12)
!586 = distinct !DILexicalBlock(scope: !587, file: !1, line: 792, column: 5)
!587 = distinct !DILexicalBlock(scope: !584, file: !1, line: 792, column: 5)
!588 = !DISubprogram(name: "setiter_traverse", scope: !1, file: !1, line: 797, type: !589, isLocal: true, isDefinition: true, scopeLine: 798, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.setiterobject*, i32 (%struct._object*, i8*)*, i8*)* @setiter_traverse, variables: !591)
!589 = !DISubroutineType(types: !590)
!590 = !{!51, !461, !271, !97}
!591 = !{!592, !593, !594, !595}
!592 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "si", arg: 1, scope: !588, file: !1, line: 797, type: !461)
!593 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !588, file: !1, line: 797, type: !271)
!594 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !588, file: !1, line: 797, type: !97)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !596, file: !1, line: 799, type: !51)
!596 = distinct !DILexicalBlock(scope: !597, file: !1, line: 799, column: 5)
!597 = distinct !DILexicalBlock(scope: !598, file: !1, line: 799, column: 5)
!598 = distinct !DILexicalBlock(scope: !588, file: !1, line: 799, column: 5)
!599 = !DISubprogram(name: "setiter_iternext", scope: !1, file: !1, line: 862, type: !600, isLocal: true, isDefinition: true, scopeLine: 863, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.setiterobject*)* @setiter_iternext, variables: !602)
!600 = !DISubroutineType(types: !601)
!601 = !{!12, !461}
!602 = !{!603, !604, !605, !606, !607, !608, !609}
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "si", arg: 1, scope: !599, file: !1, line: 862, type: !461)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !599, file: !1, line: 864, type: !12)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !599, file: !1, line: 865, type: !18)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mask", scope: !599, file: !1, line: 865, type: !18)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !599, file: !1, line: 866, type: !368)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "so", scope: !599, file: !1, line: 867, type: !358)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !610, file: !1, line: 895, type: !12)
!610 = distinct !DILexicalBlock(scope: !599, file: !1, line: 895, column: 5)
!611 = !DISubprogram(name: "setiter_len", scope: !1, file: !1, line: 804, type: !600, isLocal: true, isDefinition: true, scopeLine: 805, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.setiterobject*)* @setiter_len, variables: !612)
!612 = !{!613, !614}
!613 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "si", arg: 1, scope: !611, file: !1, line: 804, type: !461)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !611, file: !1, line: 806, type: !18)
!615 = !DISubprogram(name: "setiter_reduce", scope: !1, file: !1, line: 817, type: !600, isLocal: true, isDefinition: true, scopeLine: 818, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.setiterobject*)* @setiter_reduce, variables: !616)
!616 = !{!617, !618, !619, !620, !622, !626, !632, !634, !636, !639, !641, !643, !646}
!617 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "si", arg: 1, scope: !615, file: !1, line: 817, type: !461)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !615, file: !1, line: 819, type: !12)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !615, file: !1, line: 820, type: !462)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !621, file: !1, line: 828, type: !12)
!621 = distinct !DILexicalBlock(scope: !615, file: !1, line: 828, column: 5)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "element", scope: !623, file: !1, line: 832, type: !12)
!623 = distinct !DILexicalBlock(scope: !624, file: !1, line: 831, column: 13)
!624 = distinct !DILexicalBlock(scope: !625, file: !1, line: 831, column: 5)
!625 = distinct !DILexicalBlock(scope: !615, file: !1, line: 831, column: 5)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !627, file: !1, line: 835, type: !12)
!627 = distinct !DILexicalBlock(scope: !628, file: !1, line: 835, column: 17)
!628 = distinct !DILexicalBlock(scope: !629, file: !1, line: 834, column: 47)
!629 = distinct !DILexicalBlock(scope: !630, file: !1, line: 834, column: 17)
!630 = distinct !DILexicalBlock(scope: !631, file: !1, line: 833, column: 22)
!631 = distinct !DILexicalBlock(scope: !623, file: !1, line: 833, column: 13)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !633, file: !1, line: 836, type: !12)
!633 = distinct !DILexicalBlock(scope: !628, file: !1, line: 836, column: 17)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !635, file: !1, line: 837, type: !12)
!635 = distinct !DILexicalBlock(scope: !628, file: !1, line: 837, column: 17)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !637, file: !1, line: 837, type: !12)
!637 = distinct !DILexicalBlock(scope: !638, file: !1, line: 837, column: 17)
!638 = distinct !DILexicalBlock(scope: !635, file: !1, line: 837, column: 17)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !640, file: !1, line: 840, type: !12)
!640 = distinct !DILexicalBlock(scope: !630, file: !1, line: 840, column: 13)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !642, file: !1, line: 844, type: !12)
!642 = distinct !DILexicalBlock(scope: !615, file: !1, line: 844, column: 5)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !644, file: !1, line: 844, type: !12)
!644 = distinct !DILexicalBlock(scope: !645, file: !1, line: 844, column: 5)
!645 = distinct !DILexicalBlock(scope: !642, file: !1, line: 844, column: 5)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !647, file: !1, line: 848, type: !12)
!647 = distinct !DILexicalBlock(scope: !648, file: !1, line: 848, column: 9)
!648 = distinct !DILexicalBlock(scope: !649, file: !1, line: 846, column: 29)
!649 = distinct !DILexicalBlock(scope: !615, file: !1, line: 846, column: 9)
!650 = !DISubprogram(name: "set_dealloc", scope: !1, file: !1, line: 537, type: !651, isLocal: true, isDefinition: true, scopeLine: 538, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._setobject*)* @set_dealloc, variables: !653)
!651 = !DISubroutineType(types: !652)
!652 = !{null, !358}
!653 = !{!654, !655, !656, !657, !659, !666, !667, !670, !672}
!654 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "so", arg: 1, scope: !650, file: !1, line: 537, type: !358)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !650, file: !1, line: 539, type: !368)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fill", scope: !650, file: !1, line: 540, type: !18)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_tstate", scope: !658, file: !1, line: 542, type: !384)
!658 = distinct !DILexicalBlock(scope: !650, file: !1, line: 542, column: 5)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !660, file: !1, line: 542, type: !661)
!660 = distinct !DILexicalBlock(scope: !658, file: !1, line: 542, column: 5)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64, align: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !4, line: 33, baseType: !663)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !4, line: 31, size: 64, align: 64, elements: !664)
!664 = !{!665}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !663, file: !4, line: 32, baseType: !97, size: 64, align: 64)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !660, file: !1, line: 542, type: !97)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !660, file: !1, line: 542, type: !668)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64, align: 64)
!669 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !97)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !660, file: !1, line: 542, type: !671)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !4, line: 29, baseType: !3)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !673, file: !1, line: 550, type: !12)
!673 = distinct !DILexicalBlock(scope: !674, file: !1, line: 550, column: 17)
!674 = distinct !DILexicalBlock(scope: !675, file: !1, line: 549, column: 17)
!675 = distinct !DILexicalBlock(scope: !676, file: !1, line: 547, column: 25)
!676 = distinct !DILexicalBlock(scope: !677, file: !1, line: 547, column: 13)
!677 = distinct !DILexicalBlock(scope: !678, file: !1, line: 546, column: 48)
!678 = distinct !DILexicalBlock(scope: !679, file: !1, line: 546, column: 5)
!679 = distinct !DILexicalBlock(scope: !680, file: !1, line: 546, column: 5)
!680 = distinct !DILexicalBlock(scope: !681, file: !1, line: 542, column: 5)
!681 = distinct !DILexicalBlock(scope: !658, file: !1, line: 542, column: 5)
!682 = !DISubprogram(name: "_Py_ANNOTATE_MEMORY_ORDER", scope: !4, file: !4, line: 59, type: !683, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, variables: !688)
!683 = !DISubroutineType(types: !684)
!684 = !{null, !685, !671}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!688 = !{!689, !690}
!689 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "address", arg: 1, scope: !682, file: !4, line: 59, type: !685)
!690 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 2, scope: !682, file: !4, line: 59, type: !671)
!691 = !DISubprogram(name: "_Py_atomic_thread_fence", scope: !4, file: !4, line: 51, type: !692, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, variables: !694)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !671}
!694 = !{!695}
!695 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !691, file: !4, line: 51, type: !671)
!696 = !DISubprogram(name: "_Py_atomic_signal_fence", scope: !4, file: !4, line: 44, type: !692, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, variables: !697)
!697 = !{!698}
!698 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !696, file: !4, line: 44, type: !671)
!699 = !DISubprogram(name: "set_repr", scope: !1, file: !1, line: 560, type: !700, isLocal: true, isDefinition: true, scopeLine: 561, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._setobject*)* @set_repr, variables: !702)
!700 = !DISubroutineType(types: !701)
!701 = !{!12, !358}
!702 = !{!703, !704, !705, !706, !707, !708, !709, !711, !713}
!703 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "so", arg: 1, scope: !699, file: !1, line: 560, type: !358)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !699, file: !1, line: 562, type: !12)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "keys", scope: !699, file: !1, line: 562, type: !12)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "listrepr", scope: !699, file: !1, line: 562, type: !12)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !699, file: !1, line: 562, type: !12)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "status", scope: !699, file: !1, line: 563, type: !51)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !710, file: !1, line: 583, type: !12)
!710 = distinct !DILexicalBlock(scope: !699, file: !1, line: 583, column: 5)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !712, file: !1, line: 587, type: !12)
!712 = distinct !DILexicalBlock(scope: !699, file: !1, line: 587, column: 5)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !714, file: !1, line: 598, type: !12)
!714 = distinct !DILexicalBlock(scope: !699, file: !1, line: 598, column: 5)
!715 = !DISubprogram(name: "set_sub", scope: !1, file: !1, line: 1630, type: !716, isLocal: true, isDefinition: true, scopeLine: 1631, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._setobject*, %struct._object*)* @set_sub, variables: !718)
!716 = !DISubroutineType(types: !717)
!717 = !{!12, !358, !12}
!718 = !{!719, !720}
!719 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "so", arg: 1, scope: !715, file: !1, line: 1630, type: !358)
!720 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "other", arg: 2, scope: !715, file: !1, line: 1630, type: !12)
!721 = !DISubprogram(name: "set_difference", scope: !1, file: !1, line: 1549, type: !716, isLocal: true, isDefinition: true, scopeLine: 1550, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._setobject*, %struct._object*)* @set_difference, variables: !722)
!722 = !{!723, !724, !725, !726, !727, !728, !732, !738, !740, !744}
!723 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "so", arg: 1, scope: !721, file: !1, line: 1549, type: !358)
!724 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "other", arg: 2, scope: !721, file: !1, line: 1549, type: !12)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !721, file: !1, line: 1551, type: !12)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !721, file: !1, line: 1552, type: !368)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !721, file: !1, line: 1553, type: !18)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entrycopy", scope: !729, file: !1, line: 1571, type: !369)
!729 = distinct !DILexicalBlock(scope: !730, file: !1, line: 1570, column: 44)
!730 = distinct !DILexicalBlock(scope: !731, file: !1, line: 1569, column: 35)
!731 = distinct !DILexicalBlock(scope: !721, file: !1, line: 1569, column: 9)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !733, file: !1, line: 1576, type: !12)
!733 = distinct !DILexicalBlock(scope: !734, file: !1, line: 1576, column: 21)
!734 = distinct !DILexicalBlock(scope: !735, file: !1, line: 1575, column: 77)
!735 = distinct !DILexicalBlock(scope: !736, file: !1, line: 1575, column: 21)
!736 = distinct !DILexicalBlock(scope: !737, file: !1, line: 1574, column: 68)
!737 = distinct !DILexicalBlock(scope: !729, file: !1, line: 1574, column: 17)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !739, file: !1, line: 1586, type: !51)
!739 = distinct !DILexicalBlock(scope: !721, file: !1, line: 1585, column: 40)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !741, file: !1, line: 1588, type: !12)
!741 = distinct !DILexicalBlock(scope: !742, file: !1, line: 1588, column: 13)
!742 = distinct !DILexicalBlock(scope: !743, file: !1, line: 1587, column: 23)
!743 = distinct !DILexicalBlock(scope: !739, file: !1, line: 1587, column: 13)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !745, file: !1, line: 1593, type: !12)
!745 = distinct !DILexicalBlock(scope: !746, file: !1, line: 1593, column: 17)
!746 = distinct !DILexicalBlock(scope: !747, file: !1, line: 1592, column: 68)
!747 = distinct !DILexicalBlock(scope: !748, file: !1, line: 1592, column: 17)
!748 = distinct !DILexicalBlock(scope: !749, file: !1, line: 1591, column: 18)
!749 = distinct !DILexicalBlock(scope: !739, file: !1, line: 1591, column: 13)
!750 = !DISubprogram(name: "set_copy_and_difference", scope: !1, file: !1, line: 1535, type: !716, isLocal: true, isDefinition: true, scopeLine: 1536, flags: DIFlagPrototyped, isOptimized: true, variables: !751)
!751 = !{!752, !753, !754, !755}
!752 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "so", arg: 1, scope: !750, file: !1, line: 1535, type: !358)
!753 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "other", arg: 2, scope: !750, file: !1, line: 1535, type: !12)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !750, file: !1, line: 1537, type: !12)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !756, file: !1, line: 1544, type: !12)
!756 = distinct !DILexicalBlock(scope: !750, file: !1, line: 1544, column: 5)
!757 = !DISubprogram(name: "set_copy", scope: !1, file: !1, line: 1165, type: !700, isLocal: true, isDefinition: true, scopeLine: 1166, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._setobject*)* @set_copy, variables: !758)
!758 = !{!759}
!759 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "so", arg: 1, scope: !757, file: !1, line: 1165, type: !358)
!760 = !DISubprogram(name: "set_difference_update_internal", scope: !1, file: !1, line: 1482, type: !761, isLocal: true, isDefinition: true, scopeLine: 1483, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._setobject*, %struct._object*)* @set_difference_update_internal, variables: !763)
!761 = !DISubroutineType(types: !762)
!762 = !{!51, !358, !12}
!763 = !{!764, !765, !766, !769, !770, !772, !773, !778, !780, !782}
!764 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "so", arg: 1, scope: !760, file: !1, line: 1482, type: !358)
!765 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "other", arg: 2, scope: !760, file: !1, line: 1482, type: !12)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !767, file: !1, line: 1488, type: !368)
!767 = distinct !DILexicalBlock(scope: !768, file: !1, line: 1487, column: 32)
!768 = distinct !DILexicalBlock(scope: !760, file: !1, line: 1487, column: 9)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !767, file: !1, line: 1489, type: !18)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !771, file: !1, line: 1495, type: !12)
!771 = distinct !DILexicalBlock(scope: !768, file: !1, line: 1494, column: 12)
!772 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !771, file: !1, line: 1495, type: !12)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !774, file: !1, line: 1502, type: !12)
!774 = distinct !DILexicalBlock(scope: !775, file: !1, line: 1502, column: 17)
!775 = distinct !DILexicalBlock(scope: !776, file: !1, line: 1501, column: 49)
!776 = distinct !DILexicalBlock(scope: !777, file: !1, line: 1501, column: 17)
!777 = distinct !DILexicalBlock(scope: !771, file: !1, line: 1500, column: 49)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !779, file: !1, line: 1503, type: !12)
!779 = distinct !DILexicalBlock(scope: !775, file: !1, line: 1503, column: 17)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !781, file: !1, line: 1506, type: !12)
!781 = distinct !DILexicalBlock(scope: !777, file: !1, line: 1506, column: 13)
!782 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !783, file: !1, line: 1508, type: !12)
!783 = distinct !DILexicalBlock(scope: !771, file: !1, line: 1508, column: 9)
!784 = !DISubprogram(name: "set_discard_entry", scope: !1, file: !1, line: 383, type: !785, isLocal: true, isDefinition: true, scopeLine: 384, flags: DIFlagPrototyped, isOptimized: true, variables: !787)
!785 = !DISubroutineType(types: !786)
!786 = !{!51, !358, !368}
!787 = !{!788, !789, !790, !791, !792}
!788 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "so", arg: 1, scope: !784, file: !1, line: 383, type: !358)
!789 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "oldentry", arg: 2, scope: !784, file: !1, line: 383, type: !368)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !784, file: !1, line: 384, type: !368)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_key", scope: !784, file: !1, line: 385, type: !12)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !793, file: !1, line: 395, type: !12)
!793 = distinct !DILexicalBlock(scope: !784, file: !1, line: 395, column: 5)
!794 = !DISubprogram(name: "set_table_resize", scope: !1, file: !1, line: 259, type: !795, isLocal: true, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._setobject*, i64)* @set_table_resize, variables: !797)
!795 = !DISubroutineType(types: !796)
!796 = !{!51, !358, !18}
!797 = !{!798, !799, !800, !801, !802, !803, !804, !805, !806}
!798 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "so", arg: 1, scope: !794, file: !1, line: 259, type: !358)
!799 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "minused", arg: 2, scope: !794, file: !1, line: 259, type: !18)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newsize", scope: !794, file: !1, line: 261, type: !18)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldtable", scope: !794, file: !1, line: 262, type: !368)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newtable", scope: !794, file: !1, line: 262, type: !368)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !794, file: !1, line: 262, type: !368)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !794, file: !1, line: 263, type: !18)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "is_oldtable_malloced", scope: !794, file: !1, line: 264, type: !51)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "small_copy", scope: !794, file: !1, line: 265, type: !380)
!807 = !DISubprogram(name: "set_insert_clean", scope: !1, file: !1, line: 189, type: !808, isLocal: true, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: true, variables: !810)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !358, !12, !226}
!810 = !{!811, !812, !813, !814, !815, !816, !817, !818, !819}
!811 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "so", arg: 1, scope: !807, file: !1, line: 189, type: !358)
!812 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !807, file: !1, line: 189, type: !12)
!813 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hash", arg: 3, scope: !807, file: !1, line: 189, type: !226)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "table", scope: !807, file: !1, line: 191, type: !368)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !807, file: !1, line: 192, type: !368)
!816 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "perturb", scope: !807, file: !1, line: 193, type: !102)
!817 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mask", scope: !807, file: !1, line: 194, type: !102)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !807, file: !1, line: 195, type: !102)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !807, file: !1, line: 196, type: !102)
!820 = !DISubprogram(name: "make_new_set_basetype", scope: !1, file: !1, line: 1046, type: !821, isLocal: true, isDefinition: true, scopeLine: 1047, flags: DIFlagPrototyped, isOptimized: true, variables: !825)
!821 = !DISubroutineType(types: !822)
!822 = !{!12, !823, !12}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64, align: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !14, line: 422, baseType: !27)
!825 = !{!826, !827}
!826 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !820, file: !1, line: 1046, type: !823)
!827 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iterable", arg: 2, scope: !820, file: !1, line: 1046, type: !12)
!828 = !DISubprogram(name: "set_add_entry", scope: !1, file: !1, line: 337, type: !785, isLocal: true, isDefinition: true, scopeLine: 338, flags: DIFlagPrototyped, isOptimized: true, variables: !829)
!829 = !{!830, !831, !832, !833, !834, !835}
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "so", arg: 1, scope: !828, file: !1, line: 337, type: !358)
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "entry", arg: 2, scope: !828, file: !1, line: 337, type: !368)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_used", scope: !828, file: !1, line: 339, type: !18)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !828, file: !1, line: 340, type: !12)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hash", scope: !828, file: !1, line: 341, type: !226)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !836, file: !1, line: 347, type: !12)
!836 = distinct !DILexicalBlock(scope: !837, file: !1, line: 347, column: 9)
!837 = distinct !DILexicalBlock(scope: !838, file: !1, line: 346, column: 46)
!838 = distinct !DILexicalBlock(scope: !828, file: !1, line: 346, column: 9)
!839 = !DISubprogram(name: "set_insert_key", scope: !1, file: !1, line: 227, type: !840, isLocal: true, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, variables: !842)
!840 = !DISubroutineType(types: !841)
!841 = !{!51, !358, !12, !226}
!842 = !{!843, !844, !845, !846, !847}
!843 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "so", arg: 1, scope: !839, file: !1, line: 227, type: !358)
!844 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !839, file: !1, line: 227, type: !12)
!845 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hash", arg: 3, scope: !839, file: !1, line: 227, type: !226)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !839, file: !1, line: 229, type: !368)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !848, file: !1, line: 248, type: !12)
!848 = distinct !DILexicalBlock(scope: !849, file: !1, line: 248, column: 9)
!849 = distinct !DILexicalBlock(scope: !850, file: !1, line: 246, column: 12)
!850 = distinct !DILexicalBlock(scope: !851, file: !1, line: 241, column: 16)
!851 = distinct !DILexicalBlock(scope: !839, file: !1, line: 235, column: 9)
!852 = !DISubprogram(name: "set_contains_entry", scope: !1, file: !1, line: 670, type: !785, isLocal: true, isDefinition: true, scopeLine: 671, flags: DIFlagPrototyped, isOptimized: true, variables: !853)
!853 = !{!854, !855, !856, !857}
!854 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "so", arg: 1, scope: !852, file: !1, line: 670, type: !358)
!855 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "entry", arg: 2, scope: !852, file: !1, line: 670, type: !368)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !852, file: !1, line: 672, type: !12)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lu_entry", scope: !852, file: !1, line: 673, type: !368)
!858 = !DISubprogram(name: "set_and", scope: !1, file: !1, line: 1392, type: !716, isLocal: true, isDefinition: true, scopeLine: 1393, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._setobject*, %struct._object*)* @set_and, variables: !859)
!859 = !{!860, !861}
!860 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "so", arg: 1, scope: !858, file: !1, line: 1392, type: !358)
!861 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "other", arg: 2, scope: !858, file: !1, line: 1392, type: !12)
!862 = !DISubprogram(name: "set_intersection", scope: !1, file: !1, line: 1252, type: !716, isLocal: true, isDefinition: true, scopeLine: 1253, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._setobject*, %struct._object*)* @set_intersection, variables: !863)
!863 = !{!864, !865, !866, !867, !868, !869, !870, !873, !874, !876, !880, !886, !890, !892, !893, !894, !898, !900, !902, !906, !908, !910, !916, !918, !920, !922, !924}
!864 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "so", arg: 1, scope: !862, file: !1, line: 1252, type: !358)
!865 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "other", arg: 2, scope: !862, file: !1, line: 1252, type: !12)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !862, file: !1, line: 1254, type: !358)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !862, file: !1, line: 1255, type: !12)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !862, file: !1, line: 1255, type: !12)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !862, file: !1, line: 1255, type: !12)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !871, file: !1, line: 1265, type: !18)
!871 = distinct !DILexicalBlock(scope: !872, file: !1, line: 1264, column: 32)
!872 = distinct !DILexicalBlock(scope: !862, file: !1, line: 1264, column: 9)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !871, file: !1, line: 1266, type: !368)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !875, file: !1, line: 1275, type: !51)
!875 = distinct !DILexicalBlock(scope: !871, file: !1, line: 1274, column: 62)
!876 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !877, file: !1, line: 1277, type: !12)
!877 = distinct !DILexicalBlock(scope: !878, file: !1, line: 1277, column: 17)
!878 = distinct !DILexicalBlock(scope: !879, file: !1, line: 1276, column: 27)
!879 = distinct !DILexicalBlock(scope: !875, file: !1, line: 1276, column: 17)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !881, file: !1, line: 1282, type: !12)
!881 = distinct !DILexicalBlock(scope: !882, file: !1, line: 1282, column: 21)
!882 = distinct !DILexicalBlock(scope: !883, file: !1, line: 1281, column: 57)
!883 = distinct !DILexicalBlock(scope: !884, file: !1, line: 1281, column: 21)
!884 = distinct !DILexicalBlock(scope: !885, file: !1, line: 1280, column: 21)
!885 = distinct !DILexicalBlock(scope: !875, file: !1, line: 1280, column: 17)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !887, file: !1, line: 1292, type: !12)
!887 = distinct !DILexicalBlock(scope: !888, file: !1, line: 1292, column: 9)
!888 = distinct !DILexicalBlock(scope: !889, file: !1, line: 1291, column: 21)
!889 = distinct !DILexicalBlock(scope: !862, file: !1, line: 1291, column: 9)
!890 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !891, file: !1, line: 1297, type: !51)
!891 = distinct !DILexicalBlock(scope: !862, file: !1, line: 1296, column: 45)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !891, file: !1, line: 1298, type: !369)
!893 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hash", scope: !891, file: !1, line: 1299, type: !226)
!894 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !895, file: !1, line: 1302, type: !12)
!895 = distinct !DILexicalBlock(scope: !896, file: !1, line: 1302, column: 13)
!896 = distinct !DILexicalBlock(scope: !897, file: !1, line: 1301, column: 25)
!897 = distinct !DILexicalBlock(scope: !891, file: !1, line: 1301, column: 13)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !899, file: !1, line: 1303, type: !12)
!899 = distinct !DILexicalBlock(scope: !896, file: !1, line: 1303, column: 13)
!900 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !901, file: !1, line: 1304, type: !12)
!901 = distinct !DILexicalBlock(scope: !896, file: !1, line: 1304, column: 13)
!902 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !903, file: !1, line: 1311, type: !12)
!903 = distinct !DILexicalBlock(scope: !904, file: !1, line: 1311, column: 13)
!904 = distinct !DILexicalBlock(scope: !905, file: !1, line: 1310, column: 23)
!905 = distinct !DILexicalBlock(scope: !891, file: !1, line: 1310, column: 13)
!906 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !907, file: !1, line: 1312, type: !12)
!907 = distinct !DILexicalBlock(scope: !904, file: !1, line: 1312, column: 13)
!908 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !909, file: !1, line: 1313, type: !12)
!909 = distinct !DILexicalBlock(scope: !904, file: !1, line: 1313, column: 13)
!910 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !911, file: !1, line: 1318, type: !12)
!911 = distinct !DILexicalBlock(scope: !912, file: !1, line: 1318, column: 17)
!912 = distinct !DILexicalBlock(scope: !913, file: !1, line: 1317, column: 54)
!913 = distinct !DILexicalBlock(scope: !914, file: !1, line: 1317, column: 17)
!914 = distinct !DILexicalBlock(scope: !915, file: !1, line: 1316, column: 17)
!915 = distinct !DILexicalBlock(scope: !891, file: !1, line: 1316, column: 13)
!916 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !917, file: !1, line: 1319, type: !12)
!917 = distinct !DILexicalBlock(scope: !912, file: !1, line: 1319, column: 17)
!918 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !919, file: !1, line: 1320, type: !12)
!919 = distinct !DILexicalBlock(scope: !912, file: !1, line: 1320, column: 17)
!920 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !921, file: !1, line: 1324, type: !12)
!921 = distinct !DILexicalBlock(scope: !891, file: !1, line: 1324, column: 9)
!922 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !923, file: !1, line: 1326, type: !12)
!923 = distinct !DILexicalBlock(scope: !862, file: !1, line: 1326, column: 5)
!924 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !925, file: !1, line: 1328, type: !12)
!925 = distinct !DILexicalBlock(scope: !926, file: !1, line: 1328, column: 9)
!926 = distinct !DILexicalBlock(scope: !927, file: !1, line: 1327, column: 27)
!927 = distinct !DILexicalBlock(scope: !862, file: !1, line: 1327, column: 9)
