; ModuleID = 'signalmodule.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !14, subprograms: !375, globals: !1067)
!1 = !DIFile(filename: "./Modules/signalmodule.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__itimer_which", file: !4, line: 92, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/sys/time.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "ITIMER_REAL", value: 0)
!7 = !DIEnumerator(name: "ITIMER_VIRTUAL", value: 1)
!8 = !DIEnumerator(name: "ITIMER_PROF", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 57, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "Include/pytime.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!11 = !{!12, !13}
!12 = !DIEnumerator(name: "_PyTime_ROUND_DOWN", value: 0)
!13 = !DIEnumerator(name: "_PyTime_ROUND_UP", value: 1)
!14 = !{!15, !16, !354, !28, !359, !367, !368, !55, !370, !371}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !18, line: 109, baseType: !19)
!18 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !18, line: 105, size: 128, align: 64, elements: !20)
!20 = !{!21, !29}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !19, file: !18, line: 107, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !23, line: 177, baseType: !24)
!23 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !25, line: 102, baseType: !26)
!25 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !27, line: 181, baseType: !28)
!27 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!28 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !19, file: !18, line: 108, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !18, line: 334, size: 3200, align: 64, elements: !32)
!32 = !{!33, !39, !43, !44, !45, !50, !113, !118, !123, !124, !129, !181, !212, !224, !230, !231, !232, !234, !236, !267, !268, !269, !278, !279, !284, !285, !287, !289, !299, !302, !320, !321, !322, !324, !326, !327, !329, !334, !339, !344, !345, !346, !347, !348, !349, !350, !351, !353}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !18, line: 335, baseType: !34, size: 192, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !18, line: 114, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 111, size: 192, align: 64, elements: !36)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !35, file: !18, line: 112, baseType: !17, size: 128, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !35, file: !18, line: 113, baseType: !22, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !31, file: !18, line: 336, baseType: !40, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !31, file: !18, line: 337, baseType: !22, size: 64, align: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !31, file: !18, line: 337, baseType: !22, size: 64, align: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !31, file: !18, line: 341, baseType: !46, size: 64, align: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !18, line: 308, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !16}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !31, file: !18, line: 342, baseType: !51, size: 64, align: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !18, line: 314, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !16, !56, !55}
!55 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !25, line: 48, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 246, size: 1728, align: 64, elements: !60)
!59 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!60 = !{!61, !62, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !82, !83, !84, !85, !87, !89, !91, !95, !98, !100, !101, !102, !103, !104, !108, !109}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !58, file: !59, line: 247, baseType: !55, size: 32, align: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !58, file: !59, line: 252, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !58, file: !59, line: 253, baseType: !63, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !58, file: !59, line: 254, baseType: !63, size: 64, align: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !58, file: !59, line: 255, baseType: !63, size: 64, align: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !58, file: !59, line: 256, baseType: !63, size: 64, align: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !58, file: !59, line: 257, baseType: !63, size: 64, align: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !58, file: !59, line: 258, baseType: !63, size: 64, align: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !58, file: !59, line: 259, baseType: !63, size: 64, align: 64, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !58, file: !59, line: 261, baseType: !63, size: 64, align: 64, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !58, file: !59, line: 262, baseType: !63, size: 64, align: 64, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !58, file: !59, line: 263, baseType: !63, size: 64, align: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !58, file: !59, line: 265, baseType: !75, size: 64, align: 64, offset: 768)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !59, line: 161, size: 192, align: 64, elements: !77)
!77 = !{!78, !79, !81}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !76, file: !59, line: 162, baseType: !75, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !76, file: !59, line: 163, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !76, file: !59, line: 167, baseType: !55, size: 32, align: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !58, file: !59, line: 267, baseType: !80, size: 64, align: 64, offset: 832)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !58, file: !59, line: 269, baseType: !55, size: 32, align: 32, offset: 896)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !58, file: !59, line: 273, baseType: !55, size: 32, align: 32, offset: 928)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !58, file: !59, line: 275, baseType: !86, size: 64, align: 64, offset: 960)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !27, line: 140, baseType: !28)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !58, file: !59, line: 279, baseType: !88, size: 16, align: 16, offset: 1024)
!88 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !58, file: !59, line: 280, baseType: !90, size: 8, align: 8, offset: 1040)
!90 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !58, file: !59, line: 281, baseType: !92, size: 8, align: 8, offset: 1048)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 8, align: 8, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 1)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !58, file: !59, line: 285, baseType: !96, size: 64, align: 64, offset: 1088)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !59, line: 155, baseType: null)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !58, file: !59, line: 294, baseType: !99, size: 64, align: 64, offset: 1152)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !27, line: 141, baseType: !28)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !58, file: !59, line: 303, baseType: !15, size: 64, align: 64, offset: 1216)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !58, file: !59, line: 304, baseType: !15, size: 64, align: 64, offset: 1280)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !58, file: !59, line: 305, baseType: !15, size: 64, align: 64, offset: 1344)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !58, file: !59, line: 306, baseType: !15, size: 64, align: 64, offset: 1408)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !58, file: !59, line: 307, baseType: !105, size: 64, align: 64, offset: 1472)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !106, line: 62, baseType: !107)
!106 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!107 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !58, file: !59, line: 309, baseType: !55, size: 32, align: 32, offset: 1536)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !58, file: !59, line: 311, baseType: !110, size: 160, align: 8, offset: 1568)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 160, align: 8, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 20)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !31, file: !18, line: 343, baseType: !114, size: 64, align: 64, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !18, line: 316, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!16, !16, !63}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !31, file: !18, line: 344, baseType: !119, size: 64, align: 64, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !18, line: 318, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!55, !16, !63, !16}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !31, file: !18, line: 345, baseType: !15, size: 64, align: 64, offset: 640)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !31, file: !18, line: 346, baseType: !125, size: 64, align: 64, offset: 704)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !18, line: 320, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!16, !16}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !31, file: !18, line: 350, baseType: !130, size: 64, align: 64, offset: 768)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !18, line: 278, baseType: !132)
!132 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 236, size: 2176, align: 64, elements: !133)
!133 = !{!134, !139, !140, !141, !142, !143, !148, !150, !151, !152, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !132, file: !18, line: 241, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !18, line: 166, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!16, !16, !16}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !132, file: !18, line: 242, baseType: !135, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !132, file: !18, line: 243, baseType: !135, size: 64, align: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !132, file: !18, line: 244, baseType: !135, size: 64, align: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !132, file: !18, line: 245, baseType: !135, size: 64, align: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !132, file: !18, line: 246, baseType: !144, size: 64, align: 64, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !18, line: 167, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!16, !16, !16, !16}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !132, file: !18, line: 247, baseType: !149, size: 64, align: 64, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !18, line: 165, baseType: !126)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !132, file: !18, line: 248, baseType: !149, size: 64, align: 64, offset: 448)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !132, file: !18, line: 249, baseType: !149, size: 64, align: 64, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !132, file: !18, line: 250, baseType: !153, size: 64, align: 64, offset: 576)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !18, line: 168, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!55, !16}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !132, file: !18, line: 251, baseType: !149, size: 64, align: 64, offset: 640)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !132, file: !18, line: 252, baseType: !135, size: 64, align: 64, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !132, file: !18, line: 253, baseType: !135, size: 64, align: 64, offset: 768)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !132, file: !18, line: 254, baseType: !135, size: 64, align: 64, offset: 832)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !132, file: !18, line: 255, baseType: !135, size: 64, align: 64, offset: 896)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !132, file: !18, line: 256, baseType: !135, size: 64, align: 64, offset: 960)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !132, file: !18, line: 257, baseType: !149, size: 64, align: 64, offset: 1024)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !132, file: !18, line: 258, baseType: !15, size: 64, align: 64, offset: 1088)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !132, file: !18, line: 259, baseType: !149, size: 64, align: 64, offset: 1152)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !132, file: !18, line: 261, baseType: !135, size: 64, align: 64, offset: 1216)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !132, file: !18, line: 262, baseType: !135, size: 64, align: 64, offset: 1280)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !132, file: !18, line: 263, baseType: !135, size: 64, align: 64, offset: 1344)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !132, file: !18, line: 264, baseType: !135, size: 64, align: 64, offset: 1408)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !132, file: !18, line: 265, baseType: !144, size: 64, align: 64, offset: 1472)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !132, file: !18, line: 266, baseType: !135, size: 64, align: 64, offset: 1536)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !132, file: !18, line: 267, baseType: !135, size: 64, align: 64, offset: 1600)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !132, file: !18, line: 268, baseType: !135, size: 64, align: 64, offset: 1664)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !132, file: !18, line: 269, baseType: !135, size: 64, align: 64, offset: 1728)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !132, file: !18, line: 270, baseType: !135, size: 64, align: 64, offset: 1792)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !132, file: !18, line: 272, baseType: !135, size: 64, align: 64, offset: 1856)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !132, file: !18, line: 273, baseType: !135, size: 64, align: 64, offset: 1920)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !132, file: !18, line: 274, baseType: !135, size: 64, align: 64, offset: 1984)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !132, file: !18, line: 275, baseType: !135, size: 64, align: 64, offset: 2048)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !132, file: !18, line: 277, baseType: !149, size: 64, align: 64, offset: 2112)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !31, file: !18, line: 351, baseType: !182, size: 64, align: 64, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !18, line: 292, baseType: !184)
!184 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 280, size: 640, align: 64, elements: !185)
!185 = !{!186, !191, !192, !197, !198, !199, !204, !205, !210, !211}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !184, file: !18, line: 281, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !18, line: 169, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!22, !16}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !184, file: !18, line: 282, baseType: !135, size: 64, align: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !184, file: !18, line: 283, baseType: !193, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !18, line: 170, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!16, !16, !22}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !184, file: !18, line: 284, baseType: !193, size: 64, align: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !184, file: !18, line: 285, baseType: !15, size: 64, align: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !184, file: !18, line: 286, baseType: !200, size: 64, align: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !18, line: 172, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!55, !16, !22, !16}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !184, file: !18, line: 287, baseType: !15, size: 64, align: 64, offset: 384)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !184, file: !18, line: 288, baseType: !206, size: 64, align: 64, offset: 448)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !18, line: 231, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!55, !16, !16}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !184, file: !18, line: 290, baseType: !135, size: 64, align: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !184, file: !18, line: 291, baseType: !193, size: 64, align: 64, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !31, file: !18, line: 352, baseType: !213, size: 64, align: 64, offset: 896)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !18, line: 298, baseType: !215)
!215 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 294, size: 192, align: 64, elements: !216)
!216 = !{!217, !218, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !215, file: !18, line: 295, baseType: !187, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !215, file: !18, line: 296, baseType: !135, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !215, file: !18, line: 297, baseType: !220, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !18, line: 174, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!55, !16, !16, !16}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !31, file: !18, line: 356, baseType: !225, size: 64, align: 64, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !18, line: 321, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!229, !16}
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !23, line: 186, baseType: !22)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !31, file: !18, line: 357, baseType: !144, size: 64, align: 64, offset: 1024)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !31, file: !18, line: 358, baseType: !125, size: 64, align: 64, offset: 1088)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !31, file: !18, line: 359, baseType: !233, size: 64, align: 64, offset: 1152)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !18, line: 317, baseType: !136)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !31, file: !18, line: 360, baseType: !235, size: 64, align: 64, offset: 1216)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !18, line: 319, baseType: !221)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !31, file: !18, line: 363, baseType: !237, size: 64, align: 64, offset: 1280)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !18, line: 304, baseType: !239)
!239 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 301, size: 128, align: 64, elements: !240)
!240 = !{!241, !262}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !239, file: !18, line: 302, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !18, line: 193, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!55, !16, !246, !55}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !18, line: 191, baseType: !248)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !18, line: 178, size: 640, align: 64, elements: !249)
!249 = !{!250, !251, !252, !253, !254, !255, !256, !257, !259, !260, !261}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !248, file: !18, line: 179, baseType: !15, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !248, file: !18, line: 180, baseType: !16, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !248, file: !18, line: 181, baseType: !22, size: 64, align: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !248, file: !18, line: 182, baseType: !22, size: 64, align: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !248, file: !18, line: 184, baseType: !55, size: 32, align: 32, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !248, file: !18, line: 185, baseType: !55, size: 32, align: 32, offset: 288)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !248, file: !18, line: 186, baseType: !63, size: 64, align: 64, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !248, file: !18, line: 187, baseType: !258, size: 64, align: 64, offset: 384)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !248, file: !18, line: 188, baseType: !258, size: 64, align: 64, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !248, file: !18, line: 189, baseType: !258, size: 64, align: 64, offset: 512)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !248, file: !18, line: 190, baseType: !15, size: 64, align: 64, offset: 576)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !239, file: !18, line: 303, baseType: !263, size: 64, align: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !18, line: 194, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !16, !246}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !31, file: !18, line: 366, baseType: !107, size: 64, align: 64, offset: 1344)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !31, file: !18, line: 368, baseType: !40, size: 64, align: 64, offset: 1408)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !31, file: !18, line: 372, baseType: !270, size: 64, align: 64, offset: 1472)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !18, line: 233, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!55, !16, !274, !15}
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !18, line: 232, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!55, !16, !15}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !31, file: !18, line: 375, baseType: !153, size: 64, align: 64, offset: 1536)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !31, file: !18, line: 379, baseType: !280, size: 64, align: 64, offset: 1600)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !18, line: 322, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!16, !16, !16, !55}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !31, file: !18, line: 382, baseType: !22, size: 64, align: 64, offset: 1664)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !31, file: !18, line: 385, baseType: !286, size: 64, align: 64, offset: 1728)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !18, line: 323, baseType: !126)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !31, file: !18, line: 386, baseType: !288, size: 64, align: 64, offset: 1792)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !18, line: 324, baseType: !126)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !31, file: !18, line: 389, baseType: !290, size: 64, align: 64, offset: 1856)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !292, line: 40, size: 256, align: 64, elements: !293)
!292 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!293 = !{!294, !295, !297, !298}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !291, file: !292, line: 41, baseType: !40, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !291, file: !292, line: 42, baseType: !296, size: 64, align: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !292, line: 18, baseType: !136)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !291, file: !292, line: 43, baseType: !55, size: 32, align: 32, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !291, file: !292, line: 45, baseType: !40, size: 64, align: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !31, file: !18, line: 390, baseType: !300, size: 64, align: 64, offset: 1920)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !18, line: 390, flags: DIFlagFwdDecl)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !31, file: !18, line: 391, baseType: !303, size: 64, align: 64, offset: 1984)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !305, line: 11, size: 320, align: 64, elements: !306)
!305 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!306 = !{!307, !308, !313, !318, !319}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !304, file: !305, line: 12, baseType: !63, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !304, file: !305, line: 13, baseType: !309, size: 64, align: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !305, line: 8, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!16, !16, !15}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !304, file: !305, line: 14, baseType: !314, size: 64, align: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !305, line: 9, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!55, !16, !16, !15}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !304, file: !305, line: 15, baseType: !63, size: 64, align: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !304, file: !305, line: 16, baseType: !15, size: 64, align: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !31, file: !18, line: 392, baseType: !30, size: 64, align: 64, offset: 2048)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !31, file: !18, line: 393, baseType: !16, size: 64, align: 64, offset: 2112)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !31, file: !18, line: 394, baseType: !323, size: 64, align: 64, offset: 2176)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !18, line: 325, baseType: !145)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !31, file: !18, line: 395, baseType: !325, size: 64, align: 64, offset: 2240)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !18, line: 326, baseType: !221)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !31, file: !18, line: 396, baseType: !22, size: 64, align: 64, offset: 2304)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !31, file: !18, line: 397, baseType: !328, size: 64, align: 64, offset: 2368)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !18, line: 327, baseType: !221)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !31, file: !18, line: 398, baseType: !330, size: 64, align: 64, offset: 2432)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !18, line: 329, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!16, !30, !22}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !31, file: !18, line: 399, baseType: !335, size: 64, align: 64, offset: 2496)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !18, line: 328, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!16, !30, !16, !16}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !31, file: !18, line: 400, baseType: !340, size: 64, align: 64, offset: 2560)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !18, line: 307, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !15}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !31, file: !18, line: 401, baseType: !153, size: 64, align: 64, offset: 2624)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !31, file: !18, line: 402, baseType: !16, size: 64, align: 64, offset: 2688)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !31, file: !18, line: 403, baseType: !16, size: 64, align: 64, offset: 2752)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !31, file: !18, line: 404, baseType: !16, size: 64, align: 64, offset: 2816)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !31, file: !18, line: 405, baseType: !16, size: 64, align: 64, offset: 2880)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !31, file: !18, line: 406, baseType: !16, size: 64, align: 64, offset: 2944)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !31, file: !18, line: 407, baseType: !46, size: 64, align: 64, offset: 3008)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !31, file: !18, line: 410, baseType: !352, size: 32, align: 32, offset: 3072)
!352 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !31, file: !18, line: 412, baseType: !46, size: 64, align: 64, offset: 3136)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !355, line: 85, baseType: !356)
!355 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !55}
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !361, line: 33, baseType: !362)
!361 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!362 = !DICompositeType(tag: DW_TAG_structure_type, file: !361, line: 25, size: 256, align: 64, elements: !363)
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !362, file: !361, line: 26, baseType: !34, size: 192, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !362, file: !361, line: 27, baseType: !366, size: 64, align: 64, offset: 192)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 64, align: 64, elements: !93)
!367 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !369, line: 60, baseType: !107)
!369 = !DIFile(filename: "/usr/include/bits/pthreadtypes.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!370 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_intptr_t", file: !23, line: 154, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !373, line: 267, baseType: !374)
!373 = !DIFile(filename: "/usr/include/unistd.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !27, line: 195, baseType: !28)
!375 = !{!376, !382, !585, !604, !608, !615, !616, !617, !618, !619, !624, !644, !651, !667, !672, !678, !686, !692, !734, !761, !767, !830, !834, !841, !860, !880, !903, !908, !918, !990, !1001, !1016, !1020, !1025, !1031, !1034, !1064}
!376 = !DISubprogram(name: "PySignal_SetWakeupFd", scope: !1, file: !1, line: 460, type: !377, isLocal: false, isDefinition: true, scopeLine: 461, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @PySignal_SetWakeupFd, variables: !379)
!377 = !DISubroutineType(types: !378)
!378 = !{!55, !55}
!379 = !{!380, !381}
!380 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !376, file: !1, line: 460, type: !55)
!381 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_fd", scope: !376, file: !1, line: 462, type: !55)
!382 = !DISubprogram(name: "PyInit_signal", scope: !1, file: !1, line: 970, type: !383, isLocal: false, isDefinition: true, scopeLine: 971, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_signal, variables: !385)
!383 = !DISubroutineType(types: !384)
!384 = !{!16}
!385 = !{!386, !387, !388, !389, !390, !392, !396, !400, !402, !405, !407, !410, !412, !415, !417, !420, !422, !425, !427, !430, !432, !435, !437, !440, !442, !445, !447, !450, !452, !455, !457, !460, !462, !465, !467, !470, !472, !475, !477, !480, !482, !485, !487, !490, !492, !495, !497, !500, !502, !505, !507, !510, !512, !515, !517, !520, !522, !525, !527, !530, !532, !535, !537, !540, !542, !545, !547, !550, !552, !555, !557, !560, !562, !565, !567, !570, !572, !575, !577, !579, !581}
!386 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !382, file: !1, line: 972, type: !16)
!387 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !382, file: !1, line: 972, type: !16)
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !382, file: !1, line: 972, type: !16)
!389 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !382, file: !1, line: 973, type: !55)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !391, file: !1, line: 1009, type: !16)
!391 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1009, column: 5)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !393, file: !1, line: 1031, type: !356)
!393 = distinct !DILexicalBlock(scope: !394, file: !1, line: 1030, column: 32)
!394 = distinct !DILexicalBlock(scope: !395, file: !1, line: 1030, column: 5)
!395 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1030, column: 5)
!396 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !397, file: !1, line: 1045, type: !16)
!397 = distinct !DILexicalBlock(scope: !398, file: !1, line: 1045, column: 9)
!398 = distinct !DILexicalBlock(scope: !399, file: !1, line: 1042, column: 50)
!399 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1042, column: 9)
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !401, file: !1, line: 1053, type: !16)
!401 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1053, column: 5)
!402 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !403, file: !1, line: 1053, type: !16)
!403 = distinct !DILexicalBlock(scope: !404, file: !1, line: 1053, column: 5)
!404 = distinct !DILexicalBlock(scope: !401, file: !1, line: 1053, column: 5)
!405 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !406, file: !1, line: 1058, type: !16)
!406 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1058, column: 5)
!407 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !408, file: !1, line: 1058, type: !16)
!408 = distinct !DILexicalBlock(scope: !409, file: !1, line: 1058, column: 5)
!409 = distinct !DILexicalBlock(scope: !406, file: !1, line: 1058, column: 5)
!410 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !411, file: !1, line: 1068, type: !16)
!411 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1068, column: 5)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !413, file: !1, line: 1068, type: !16)
!413 = distinct !DILexicalBlock(scope: !414, file: !1, line: 1068, column: 5)
!414 = distinct !DILexicalBlock(scope: !411, file: !1, line: 1068, column: 5)
!415 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !416, file: !1, line: 1073, type: !16)
!416 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1073, column: 5)
!417 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !418, file: !1, line: 1073, type: !16)
!418 = distinct !DILexicalBlock(scope: !419, file: !1, line: 1073, column: 5)
!419 = distinct !DILexicalBlock(scope: !416, file: !1, line: 1073, column: 5)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !421, file: !1, line: 1078, type: !16)
!421 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1078, column: 5)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !423, file: !1, line: 1078, type: !16)
!423 = distinct !DILexicalBlock(scope: !424, file: !1, line: 1078, column: 5)
!424 = distinct !DILexicalBlock(scope: !421, file: !1, line: 1078, column: 5)
!425 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !426, file: !1, line: 1083, type: !16)
!426 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1083, column: 5)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !428, file: !1, line: 1083, type: !16)
!428 = distinct !DILexicalBlock(scope: !429, file: !1, line: 1083, column: 5)
!429 = distinct !DILexicalBlock(scope: !426, file: !1, line: 1083, column: 5)
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !431, file: !1, line: 1088, type: !16)
!431 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1088, column: 5)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !433, file: !1, line: 1088, type: !16)
!433 = distinct !DILexicalBlock(scope: !434, file: !1, line: 1088, column: 5)
!434 = distinct !DILexicalBlock(scope: !431, file: !1, line: 1088, column: 5)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !436, file: !1, line: 1098, type: !16)
!436 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1098, column: 5)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !438, file: !1, line: 1098, type: !16)
!438 = distinct !DILexicalBlock(scope: !439, file: !1, line: 1098, column: 5)
!439 = distinct !DILexicalBlock(scope: !436, file: !1, line: 1098, column: 5)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !441, file: !1, line: 1103, type: !16)
!441 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1103, column: 5)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !443, file: !1, line: 1103, type: !16)
!443 = distinct !DILexicalBlock(scope: !444, file: !1, line: 1103, column: 5)
!444 = distinct !DILexicalBlock(scope: !441, file: !1, line: 1103, column: 5)
!445 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !446, file: !1, line: 1108, type: !16)
!446 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1108, column: 5)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !448, file: !1, line: 1108, type: !16)
!448 = distinct !DILexicalBlock(scope: !449, file: !1, line: 1108, column: 5)
!449 = distinct !DILexicalBlock(scope: !446, file: !1, line: 1108, column: 5)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !451, file: !1, line: 1113, type: !16)
!451 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1113, column: 5)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !453, file: !1, line: 1113, type: !16)
!453 = distinct !DILexicalBlock(scope: !454, file: !1, line: 1113, column: 5)
!454 = distinct !DILexicalBlock(scope: !451, file: !1, line: 1113, column: 5)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !456, file: !1, line: 1118, type: !16)
!456 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1118, column: 5)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !458, file: !1, line: 1118, type: !16)
!458 = distinct !DILexicalBlock(scope: !459, file: !1, line: 1118, column: 5)
!459 = distinct !DILexicalBlock(scope: !456, file: !1, line: 1118, column: 5)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !461, file: !1, line: 1123, type: !16)
!461 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1123, column: 5)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !463, file: !1, line: 1123, type: !16)
!463 = distinct !DILexicalBlock(scope: !464, file: !1, line: 1123, column: 5)
!464 = distinct !DILexicalBlock(scope: !461, file: !1, line: 1123, column: 5)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !466, file: !1, line: 1128, type: !16)
!466 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1128, column: 5)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !468, file: !1, line: 1128, type: !16)
!468 = distinct !DILexicalBlock(scope: !469, file: !1, line: 1128, column: 5)
!469 = distinct !DILexicalBlock(scope: !466, file: !1, line: 1128, column: 5)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !471, file: !1, line: 1133, type: !16)
!471 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1133, column: 5)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !473, file: !1, line: 1133, type: !16)
!473 = distinct !DILexicalBlock(scope: !474, file: !1, line: 1133, column: 5)
!474 = distinct !DILexicalBlock(scope: !471, file: !1, line: 1133, column: 5)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !476, file: !1, line: 1138, type: !16)
!476 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1138, column: 5)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !478, file: !1, line: 1138, type: !16)
!478 = distinct !DILexicalBlock(scope: !479, file: !1, line: 1138, column: 5)
!479 = distinct !DILexicalBlock(scope: !476, file: !1, line: 1138, column: 5)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !481, file: !1, line: 1143, type: !16)
!481 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1143, column: 5)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !483, file: !1, line: 1143, type: !16)
!483 = distinct !DILexicalBlock(scope: !484, file: !1, line: 1143, column: 5)
!484 = distinct !DILexicalBlock(scope: !481, file: !1, line: 1143, column: 5)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !486, file: !1, line: 1148, type: !16)
!486 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1148, column: 5)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !488, file: !1, line: 1148, type: !16)
!488 = distinct !DILexicalBlock(scope: !489, file: !1, line: 1148, column: 5)
!489 = distinct !DILexicalBlock(scope: !486, file: !1, line: 1148, column: 5)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !491, file: !1, line: 1153, type: !16)
!491 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1153, column: 5)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !493, file: !1, line: 1153, type: !16)
!493 = distinct !DILexicalBlock(scope: !494, file: !1, line: 1153, column: 5)
!494 = distinct !DILexicalBlock(scope: !491, file: !1, line: 1153, column: 5)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !496, file: !1, line: 1158, type: !16)
!496 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1158, column: 5)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !498, file: !1, line: 1158, type: !16)
!498 = distinct !DILexicalBlock(scope: !499, file: !1, line: 1158, column: 5)
!499 = distinct !DILexicalBlock(scope: !496, file: !1, line: 1158, column: 5)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !501, file: !1, line: 1163, type: !16)
!501 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1163, column: 5)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !503, file: !1, line: 1163, type: !16)
!503 = distinct !DILexicalBlock(scope: !504, file: !1, line: 1163, column: 5)
!504 = distinct !DILexicalBlock(scope: !501, file: !1, line: 1163, column: 5)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !506, file: !1, line: 1168, type: !16)
!506 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1168, column: 5)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !508, file: !1, line: 1168, type: !16)
!508 = distinct !DILexicalBlock(scope: !509, file: !1, line: 1168, column: 5)
!509 = distinct !DILexicalBlock(scope: !506, file: !1, line: 1168, column: 5)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !511, file: !1, line: 1173, type: !16)
!511 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1173, column: 5)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !513, file: !1, line: 1173, type: !16)
!513 = distinct !DILexicalBlock(scope: !514, file: !1, line: 1173, column: 5)
!514 = distinct !DILexicalBlock(scope: !511, file: !1, line: 1173, column: 5)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !516, file: !1, line: 1178, type: !16)
!516 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1178, column: 5)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !518, file: !1, line: 1178, type: !16)
!518 = distinct !DILexicalBlock(scope: !519, file: !1, line: 1178, column: 5)
!519 = distinct !DILexicalBlock(scope: !516, file: !1, line: 1178, column: 5)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !521, file: !1, line: 1183, type: !16)
!521 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1183, column: 5)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !523, file: !1, line: 1183, type: !16)
!523 = distinct !DILexicalBlock(scope: !524, file: !1, line: 1183, column: 5)
!524 = distinct !DILexicalBlock(scope: !521, file: !1, line: 1183, column: 5)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !526, file: !1, line: 1188, type: !16)
!526 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1188, column: 5)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !528, file: !1, line: 1188, type: !16)
!528 = distinct !DILexicalBlock(scope: !529, file: !1, line: 1188, column: 5)
!529 = distinct !DILexicalBlock(scope: !526, file: !1, line: 1188, column: 5)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !531, file: !1, line: 1193, type: !16)
!531 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1193, column: 5)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !533, file: !1, line: 1193, type: !16)
!533 = distinct !DILexicalBlock(scope: !534, file: !1, line: 1193, column: 5)
!534 = distinct !DILexicalBlock(scope: !531, file: !1, line: 1193, column: 5)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !536, file: !1, line: 1198, type: !16)
!536 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1198, column: 5)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !538, file: !1, line: 1198, type: !16)
!538 = distinct !DILexicalBlock(scope: !539, file: !1, line: 1198, column: 5)
!539 = distinct !DILexicalBlock(scope: !536, file: !1, line: 1198, column: 5)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !541, file: !1, line: 1203, type: !16)
!541 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1203, column: 5)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !543, file: !1, line: 1203, type: !16)
!543 = distinct !DILexicalBlock(scope: !544, file: !1, line: 1203, column: 5)
!544 = distinct !DILexicalBlock(scope: !541, file: !1, line: 1203, column: 5)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !546, file: !1, line: 1208, type: !16)
!546 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1208, column: 5)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !548, file: !1, line: 1208, type: !16)
!548 = distinct !DILexicalBlock(scope: !549, file: !1, line: 1208, column: 5)
!549 = distinct !DILexicalBlock(scope: !546, file: !1, line: 1208, column: 5)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !551, file: !1, line: 1213, type: !16)
!551 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1213, column: 5)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !553, file: !1, line: 1213, type: !16)
!553 = distinct !DILexicalBlock(scope: !554, file: !1, line: 1213, column: 5)
!554 = distinct !DILexicalBlock(scope: !551, file: !1, line: 1213, column: 5)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !556, file: !1, line: 1218, type: !16)
!556 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1218, column: 5)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !558, file: !1, line: 1218, type: !16)
!558 = distinct !DILexicalBlock(scope: !559, file: !1, line: 1218, column: 5)
!559 = distinct !DILexicalBlock(scope: !556, file: !1, line: 1218, column: 5)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !561, file: !1, line: 1223, type: !16)
!561 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1223, column: 5)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !563, file: !1, line: 1223, type: !16)
!563 = distinct !DILexicalBlock(scope: !564, file: !1, line: 1223, column: 5)
!564 = distinct !DILexicalBlock(scope: !561, file: !1, line: 1223, column: 5)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !566, file: !1, line: 1228, type: !16)
!566 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1228, column: 5)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !568, file: !1, line: 1228, type: !16)
!568 = distinct !DILexicalBlock(scope: !569, file: !1, line: 1228, column: 5)
!569 = distinct !DILexicalBlock(scope: !566, file: !1, line: 1228, column: 5)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !571, file: !1, line: 1233, type: !16)
!571 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1233, column: 5)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !573, file: !1, line: 1233, type: !16)
!573 = distinct !DILexicalBlock(scope: !574, file: !1, line: 1233, column: 5)
!574 = distinct !DILexicalBlock(scope: !571, file: !1, line: 1233, column: 5)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !576, file: !1, line: 1244, type: !16)
!576 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1244, column: 5)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !578, file: !1, line: 1249, type: !16)
!578 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1249, column: 5)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !580, file: !1, line: 1254, type: !16)
!580 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1254, column: 5)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !582, file: !1, line: 1282, type: !16)
!582 = distinct !DILexicalBlock(scope: !583, file: !1, line: 1282, column: 9)
!583 = distinct !DILexicalBlock(scope: !584, file: !1, line: 1281, column: 27)
!584 = distinct !DILexicalBlock(scope: !382, file: !1, line: 1281, column: 9)
!585 = !DISubprogram(name: "PyErr_CheckSignals", scope: !1, file: !1, line: 1317, type: !586, isLocal: false, isDefinition: true, scopeLine: 1318, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @PyErr_CheckSignals, variables: !588)
!586 = !DISubroutineType(types: !587)
!587 = !{!55}
!588 = !{!589, !590, !591, !597, !598, !602}
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !585, file: !1, line: 1319, type: !55)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !585, file: !1, line: 1320, type: !16)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !592, file: !1, line: 1351, type: !16)
!592 = distinct !DILexicalBlock(scope: !593, file: !1, line: 1350, column: 34)
!593 = distinct !DILexicalBlock(scope: !594, file: !1, line: 1350, column: 13)
!594 = distinct !DILexicalBlock(scope: !595, file: !1, line: 1349, column: 32)
!595 = distinct !DILexicalBlock(scope: !596, file: !1, line: 1349, column: 5)
!596 = distinct !DILexicalBlock(scope: !585, file: !1, line: 1349, column: 5)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arglist", scope: !592, file: !1, line: 1352, type: !16)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !599, file: !1, line: 1358, type: !16)
!599 = distinct !DILexicalBlock(scope: !600, file: !1, line: 1358, column: 17)
!600 = distinct !DILexicalBlock(scope: !601, file: !1, line: 1355, column: 26)
!601 = distinct !DILexicalBlock(scope: !592, file: !1, line: 1355, column: 17)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !603, file: !1, line: 1363, type: !16)
!603 = distinct !DILexicalBlock(scope: !592, file: !1, line: 1363, column: 13)
!604 = !DISubprogram(name: "PyErr_SetInterrupt", scope: !1, file: !1, line: 1375, type: !605, isLocal: false, isDefinition: true, scopeLine: 1376, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyErr_SetInterrupt, variables: !607)
!605 = !DISubroutineType(types: !606)
!606 = !{null}
!607 = !{}
!608 = !DISubprogram(name: "PyOS_InitInterrupts", scope: !1, file: !1, line: 1381, type: !605, isLocal: false, isDefinition: true, scopeLine: 1382, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyOS_InitInterrupts, variables: !609)
!609 = !{!610, !611}
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !608, file: !1, line: 1383, type: !16)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !612, file: !1, line: 1385, type: !16)
!612 = distinct !DILexicalBlock(scope: !613, file: !1, line: 1385, column: 9)
!613 = distinct !DILexicalBlock(scope: !614, file: !1, line: 1384, column: 12)
!614 = distinct !DILexicalBlock(scope: !608, file: !1, line: 1384, column: 9)
!615 = !DISubprogram(name: "PyOS_FiniInterrupts", scope: !1, file: !1, line: 1390, type: !605, isLocal: false, isDefinition: true, scopeLine: 1391, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyOS_FiniInterrupts, variables: !607)
!616 = !DISubprogram(name: "PyOS_InterruptOccurred", scope: !1, file: !1, line: 1396, type: !586, isLocal: false, isDefinition: true, scopeLine: 1397, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @PyOS_InterruptOccurred, variables: !607)
!617 = !DISubprogram(name: "PyOS_AfterFork", scope: !1, file: !1, line: 1422, type: !605, isLocal: false, isDefinition: true, scopeLine: 1423, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyOS_AfterFork, variables: !607)
!618 = !DISubprogram(name: "_PyOS_IsMainThread", scope: !1, file: !1, line: 1441, type: !586, isLocal: false, isDefinition: true, scopeLine: 1442, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @_PyOS_IsMainThread, variables: !607)
!619 = !DISubprogram(name: "signal_alarm", scope: !1, file: !1, line: 248, type: !137, isLocal: true, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @signal_alarm, variables: !620)
!620 = !{!621, !622, !623}
!621 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !619, file: !1, line: 248, type: !16)
!622 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !619, file: !1, line: 248, type: !16)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !619, file: !1, line: 250, type: !55)
!624 = !DISubprogram(name: "signal_setitimer", scope: !1, file: !1, line: 472, type: !137, isLocal: true, isDefinition: true, scopeLine: 473, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @signal_setitimer, variables: !625)
!625 = !{!626, !627, !628, !629, !630, !631, !643}
!626 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !624, file: !1, line: 472, type: !16)
!627 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !624, file: !1, line: 472, type: !16)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "first", scope: !624, file: !1, line: 474, type: !367)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interval", scope: !624, file: !1, line: 475, type: !367)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "which", scope: !624, file: !1, line: 476, type: !55)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new", scope: !624, file: !1, line: 477, type: !632)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "itimerval", file: !4, line: 108, size: 256, align: 64, elements: !633)
!633 = !{!634, !642}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "it_interval", scope: !632, file: !4, line: 111, baseType: !635, size: 128, align: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !636, line: 30, size: 128, align: 64, elements: !637)
!636 = !DIFile(filename: "/usr/include/bits/time.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!637 = !{!638, !640}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !635, file: !636, line: 32, baseType: !639, size: 64, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !27, line: 148, baseType: !28)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !635, file: !636, line: 33, baseType: !641, size: 64, align: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !27, line: 150, baseType: !28)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "it_value", scope: !632, file: !4, line: 113, baseType: !635, size: 128, align: 64, offset: 128)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old", scope: !624, file: !1, line: 477, type: !632)
!644 = !DISubprogram(name: "timeval_from_double", scope: !1, file: !1, line: 115, type: !645, isLocal: true, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: true, variables: !648)
!645 = !DISubroutineType(types: !646)
!646 = !{null, !367, !647}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64, align: 64)
!648 = !{!649, !650}
!649 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 1, scope: !644, file: !1, line: 115, type: !367)
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tv", arg: 2, scope: !644, file: !1, line: 115, type: !647)
!651 = !DISubprogram(name: "itimer_retval", scope: !1, file: !1, line: 128, type: !652, isLocal: true, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: true, variables: !655)
!652 = !DISubroutineType(types: !653)
!653 = !{!16, !654}
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64, align: 64)
!655 = !{!656, !657, !658, !659, !663}
!656 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iv", arg: 1, scope: !651, file: !1, line: 128, type: !654)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !651, file: !1, line: 130, type: !16)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !651, file: !1, line: 130, type: !16)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !660, file: !1, line: 137, type: !16)
!660 = distinct !DILexicalBlock(scope: !661, file: !1, line: 137, column: 5)
!661 = distinct !DILexicalBlock(scope: !662, file: !1, line: 136, column: 71)
!662 = distinct !DILexicalBlock(scope: !651, file: !1, line: 136, column: 8)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !664, file: !1, line: 144, type: !16)
!664 = distinct !DILexicalBlock(scope: !665, file: !1, line: 144, column: 5)
!665 = distinct !DILexicalBlock(scope: !666, file: !1, line: 143, column: 74)
!666 = distinct !DILexicalBlock(scope: !651, file: !1, line: 143, column: 8)
!667 = !DISubprogram(name: "double_from_timeval", scope: !1, file: !1, line: 122, type: !668, isLocal: true, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true, variables: !670)
!668 = !DISubroutineType(types: !669)
!669 = !{!367, !647}
!670 = !{!671}
!671 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tv", arg: 1, scope: !667, file: !1, line: 122, type: !647)
!672 = !DISubprogram(name: "signal_getitimer", scope: !1, file: !1, line: 507, type: !137, isLocal: true, isDefinition: true, scopeLine: 508, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @signal_getitimer, variables: !673)
!673 = !{!674, !675, !676, !677}
!674 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !672, file: !1, line: 507, type: !16)
!675 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !672, file: !1, line: 507, type: !16)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "which", scope: !672, file: !1, line: 509, type: !55)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old", scope: !672, file: !1, line: 510, type: !632)
!678 = !DISubprogram(name: "signal_signal", scope: !1, file: !1, line: 288, type: !137, isLocal: true, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @signal_signal, variables: !679)
!679 = !{!680, !681, !682, !683, !684, !685}
!680 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !678, file: !1, line: 288, type: !16)
!681 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !678, file: !1, line: 288, type: !16)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !678, file: !1, line: 290, type: !16)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sig_num", scope: !678, file: !1, line: 291, type: !55)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_handler", scope: !678, file: !1, line: 292, type: !16)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !678, file: !1, line: 293, type: !356)
!686 = !DISubprogram(name: "signal_getsignal", scope: !1, file: !1, line: 365, type: !137, isLocal: true, isDefinition: true, scopeLine: 366, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @signal_getsignal, variables: !687)
!687 = !{!688, !689, !690, !691}
!688 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !686, file: !1, line: 365, type: !16)
!689 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !686, file: !1, line: 365, type: !16)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sig_num", scope: !686, file: !1, line: 367, type: !55)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_handler", scope: !686, file: !1, line: 368, type: !16)
!692 = !DISubprogram(name: "signal_set_wakeup_fd", scope: !1, file: !1, line: 427, type: !137, isLocal: true, isDefinition: true, scopeLine: 428, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @signal_set_wakeup_fd, variables: !693)
!693 = !{!694, !695, !696, !732, !733}
!694 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !692, file: !1, line: 427, type: !16)
!695 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !692, file: !1, line: 427, type: !16)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !692, file: !1, line: 429, type: !697)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !698, line: 46, size: 1152, align: 64, elements: !699)
!698 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!699 = !{!700, !702, !704, !706, !708, !710, !712, !713, !714, !715, !717, !719, !726, !727, !728}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !697, file: !698, line: 48, baseType: !701, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !27, line: 133, baseType: !107)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !697, file: !698, line: 53, baseType: !703, size: 64, align: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !27, line: 136, baseType: !107)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !697, file: !698, line: 61, baseType: !705, size: 64, align: 64, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !27, line: 139, baseType: !107)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !697, file: !698, line: 62, baseType: !707, size: 32, align: 32, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !27, line: 138, baseType: !352)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !697, file: !698, line: 64, baseType: !709, size: 32, align: 32, offset: 224)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !27, line: 134, baseType: !352)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !697, file: !698, line: 65, baseType: !711, size: 32, align: 32, offset: 256)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !27, line: 135, baseType: !352)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !697, file: !698, line: 67, baseType: !55, size: 32, align: 32, offset: 288)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !697, file: !698, line: 69, baseType: !701, size: 64, align: 64, offset: 320)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !697, file: !698, line: 74, baseType: !86, size: 64, align: 64, offset: 384)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !697, file: !698, line: 78, baseType: !716, size: 64, align: 64, offset: 448)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !27, line: 162, baseType: !28)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !697, file: !698, line: 80, baseType: !718, size: 64, align: 64, offset: 512)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !27, line: 167, baseType: !28)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !697, file: !698, line: 91, baseType: !720, size: 128, align: 64, offset: 576)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !721, line: 120, size: 128, align: 64, elements: !722)
!721 = !DIFile(filename: "/usr/include/time.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!722 = !{!723, !724}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !720, file: !721, line: 122, baseType: !639, size: 64, align: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !720, file: !721, line: 123, baseType: !725, size: 64, align: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !27, line: 184, baseType: !28)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !697, file: !698, line: 92, baseType: !720, size: 128, align: 64, offset: 704)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !697, file: !698, line: 93, baseType: !720, size: 128, align: 64, offset: 832)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !697, file: !698, line: 106, baseType: !729, size: 192, align: 64, offset: 960)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 192, align: 64, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 3)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !692, file: !1, line: 430, type: !55)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_fd", scope: !692, file: !1, line: 430, type: !55)
!734 = !DISubprogram(name: "fstat64", scope: !735, file: !735, line: 517, type: !736, isLocal: false, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: true, variables: !758)
!735 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!736 = !DISubroutineType(types: !737)
!737 = !{!55, !55, !738}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64, align: 64)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !698, line: 119, size: 1152, align: 64, elements: !740)
!740 = !{!741, !742, !744, !745, !746, !747, !748, !749, !750, !751, !752, !754, !755, !756, !757}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !739, file: !698, line: 121, baseType: !701, size: 64, align: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !739, file: !698, line: 123, baseType: !743, size: 64, align: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !27, line: 137, baseType: !107)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !739, file: !698, line: 124, baseType: !705, size: 64, align: 64, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !739, file: !698, line: 125, baseType: !707, size: 32, align: 32, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !739, file: !698, line: 132, baseType: !709, size: 32, align: 32, offset: 224)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !739, file: !698, line: 133, baseType: !711, size: 32, align: 32, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !739, file: !698, line: 135, baseType: !55, size: 32, align: 32, offset: 288)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !739, file: !698, line: 136, baseType: !701, size: 64, align: 64, offset: 320)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !739, file: !698, line: 137, baseType: !86, size: 64, align: 64, offset: 384)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !739, file: !698, line: 143, baseType: !716, size: 64, align: 64, offset: 448)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !739, file: !698, line: 144, baseType: !753, size: 64, align: 64, offset: 512)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !27, line: 168, baseType: !28)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !739, file: !698, line: 152, baseType: !720, size: 128, align: 64, offset: 576)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !739, file: !698, line: 153, baseType: !720, size: 128, align: 64, offset: 704)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !739, file: !698, line: 154, baseType: !720, size: 128, align: 64, offset: 832)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !739, file: !698, line: 164, baseType: !729, size: 192, align: 64, offset: 960)
!758 = !{!759, !760}
!759 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__fd", arg: 1, scope: !734, file: !735, line: 517, type: !55)
!760 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__statbuf", arg: 2, scope: !734, file: !735, line: 517, type: !738)
!761 = !DISubprogram(name: "signal_siginterrupt", scope: !1, file: !1, line: 403, type: !137, isLocal: true, isDefinition: true, scopeLine: 404, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @signal_siginterrupt, variables: !762)
!762 = !{!763, !764, !765, !766}
!763 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !761, file: !1, line: 403, type: !16)
!764 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !761, file: !1, line: 403, type: !16)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sig_num", scope: !761, file: !1, line: 405, type: !55)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flag", scope: !761, file: !1, line: 406, type: !55)
!767 = !DISubprogram(name: "signal_pause", scope: !1, file: !1, line: 265, type: !127, isLocal: true, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @signal_pause, variables: !768)
!768 = !{!769, !770}
!769 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !767, file: !1, line: 265, type: !16)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !771, file: !1, line: 267, type: !772)
!771 = distinct !DILexicalBlock(scope: !767, file: !1, line: 267, column: 5)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64, align: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !774, line: 139, baseType: !775)
!774 = !DIFile(filename: "Include/pystate.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!775 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !774, line: 69, size: 1536, align: 64, elements: !776)
!776 = !{!777, !779, !780, !800, !803, !804, !805, !806, !807, !808, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !775, file: !774, line: 72, baseType: !778, size: 64, align: 64)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64, align: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !775, file: !774, line: 73, baseType: !778, size: 64, align: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !775, file: !774, line: 74, baseType: !781, size: 64, align: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64, align: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !774, line: 44, baseType: !783)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !774, line: 19, size: 832, align: 64, elements: !784)
!784 = !{!785, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !783, file: !774, line: 21, baseType: !786, size: 64, align: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64, align: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !783, file: !774, line: 22, baseType: !778, size: 64, align: 64, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !783, file: !774, line: 24, baseType: !16, size: 64, align: 64, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !783, file: !774, line: 25, baseType: !16, size: 64, align: 64, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !783, file: !774, line: 26, baseType: !16, size: 64, align: 64, offset: 256)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !783, file: !774, line: 27, baseType: !16, size: 64, align: 64, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !783, file: !774, line: 28, baseType: !16, size: 64, align: 64, offset: 384)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !783, file: !774, line: 30, baseType: !16, size: 64, align: 64, offset: 448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !783, file: !774, line: 31, baseType: !16, size: 64, align: 64, offset: 512)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !783, file: !774, line: 32, baseType: !16, size: 64, align: 64, offset: 576)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !783, file: !774, line: 33, baseType: !55, size: 32, align: 32, offset: 640)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !783, file: !774, line: 34, baseType: !55, size: 32, align: 32, offset: 672)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !783, file: !774, line: 37, baseType: !55, size: 32, align: 32, offset: 704)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !783, file: !774, line: 43, baseType: !16, size: 64, align: 64, offset: 768)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !775, file: !774, line: 76, baseType: !801, size: 64, align: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64, align: 64)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !774, line: 50, flags: DIFlagFwdDecl)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !775, file: !774, line: 77, baseType: !55, size: 32, align: 32, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !775, file: !774, line: 78, baseType: !42, size: 8, align: 8, offset: 288)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !775, file: !774, line: 80, baseType: !42, size: 8, align: 8, offset: 296)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !775, file: !774, line: 85, baseType: !55, size: 32, align: 32, offset: 320)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !775, file: !774, line: 86, baseType: !55, size: 32, align: 32, offset: 352)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !775, file: !774, line: 88, baseType: !809, size: 64, align: 64, offset: 384)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !774, line: 54, baseType: !810)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64, align: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{!55, !16, !801, !55, !16}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !775, file: !774, line: 89, baseType: !809, size: 64, align: 64, offset: 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !775, file: !774, line: 90, baseType: !16, size: 64, align: 64, offset: 512)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !775, file: !774, line: 91, baseType: !16, size: 64, align: 64, offset: 576)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !775, file: !774, line: 93, baseType: !16, size: 64, align: 64, offset: 640)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !775, file: !774, line: 94, baseType: !16, size: 64, align: 64, offset: 704)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !775, file: !774, line: 95, baseType: !16, size: 64, align: 64, offset: 768)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !775, file: !774, line: 97, baseType: !16, size: 64, align: 64, offset: 832)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !775, file: !774, line: 98, baseType: !16, size: 64, align: 64, offset: 896)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !775, file: !774, line: 99, baseType: !16, size: 64, align: 64, offset: 960)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !775, file: !774, line: 101, baseType: !16, size: 64, align: 64, offset: 1024)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !775, file: !774, line: 103, baseType: !55, size: 32, align: 32, offset: 1088)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !775, file: !774, line: 105, baseType: !16, size: 64, align: 64, offset: 1152)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !775, file: !774, line: 106, baseType: !28, size: 64, align: 64, offset: 1216)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !775, file: !774, line: 108, baseType: !55, size: 32, align: 32, offset: 1280)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !775, file: !774, line: 109, baseType: !16, size: 64, align: 64, offset: 1344)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !775, file: !774, line: 134, baseType: !341, size: 64, align: 64, offset: 1408)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !775, file: !774, line: 135, baseType: !15, size: 64, align: 64, offset: 1472)
!830 = !DISubprogram(name: "signal_default_int_handler", scope: !1, file: !1, line: 155, type: !137, isLocal: true, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @signal_default_int_handler, variables: !831)
!831 = !{!832, !833}
!832 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !830, file: !1, line: 155, type: !16)
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !830, file: !1, line: 155, type: !16)
!834 = !DISubprogram(name: "signal_pthread_kill", scope: !1, file: !1, line: 839, type: !137, isLocal: true, isDefinition: true, scopeLine: 840, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @signal_pthread_kill, variables: !835)
!835 = !{!836, !837, !838, !839, !840}
!836 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !834, file: !1, line: 839, type: !16)
!837 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !834, file: !1, line: 839, type: !16)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tid", scope: !834, file: !1, line: 841, type: !28)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signum", scope: !834, file: !1, line: 842, type: !55)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !834, file: !1, line: 843, type: !55)
!841 = !DISubprogram(name: "signal_pthread_sigmask", scope: !1, file: !1, line: 618, type: !137, isLocal: true, isDefinition: true, scopeLine: 619, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @signal_pthread_sigmask, variables: !842)
!842 = !{!843, !844, !845, !846, !847, !858, !859}
!843 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !841, file: !1, line: 618, type: !16)
!844 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !841, file: !1, line: 618, type: !16)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "how", scope: !841, file: !1, line: 620, type: !55)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signals", scope: !841, file: !1, line: 621, type: !16)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mask", scope: !841, file: !1, line: 622, type: !848)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !849, line: 37, baseType: !850)
!849 = !DIFile(filename: "/usr/include/sys/select.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !851, line: 31, baseType: !852)
!851 = !DIFile(filename: "/usr/include/bits/sigset.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!852 = !DICompositeType(tag: DW_TAG_structure_type, file: !851, line: 28, size: 1024, align: 64, elements: !853)
!853 = !{!854}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !852, file: !851, line: 30, baseType: !855, size: 1024, align: 64)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 1024, align: 64, elements: !856)
!856 = !{!857}
!857 = !DISubrange(count: 16)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "previous", scope: !841, file: !1, line: 622, type: !848)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !841, file: !1, line: 623, type: !55)
!860 = !DISubprogram(name: "iterable_to_sigset", scope: !1, file: !1, line: 535, type: !861, isLocal: true, isDefinition: true, scopeLine: 536, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct.__sigset_t*)* @iterable_to_sigset, variables: !864)
!861 = !DISubroutineType(types: !862)
!862 = !{!55, !16, !863}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64, align: 64)
!864 = !{!865, !866, !867, !868, !869, !870, !871, !872, !875, !877}
!865 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iterable", arg: 1, scope: !860, file: !1, line: 535, type: !16)
!866 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mask", arg: 2, scope: !860, file: !1, line: 535, type: !863)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !860, file: !1, line: 537, type: !55)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iterator", scope: !860, file: !1, line: 538, type: !16)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !860, file: !1, line: 538, type: !16)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signum", scope: !860, file: !1, line: 539, type: !28)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !860, file: !1, line: 540, type: !55)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !873, file: !1, line: 559, type: !16)
!873 = distinct !DILexicalBlock(scope: !874, file: !1, line: 559, column: 9)
!874 = distinct !DILexicalBlock(scope: !860, file: !1, line: 549, column: 5)
!875 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !876, file: !1, line: 575, type: !16)
!876 = distinct !DILexicalBlock(scope: !860, file: !1, line: 575, column: 5)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !878, file: !1, line: 575, type: !16)
!878 = distinct !DILexicalBlock(scope: !879, file: !1, line: 575, column: 5)
!879 = distinct !DILexicalBlock(scope: !876, file: !1, line: 575, column: 5)
!880 = !DISubprogram(name: "sigset_to_set", scope: !1, file: !1, line: 582, type: !881, isLocal: true, isDefinition: true, scopeLine: 583, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.__sigset_t*)* @sigset_to_set, variables: !883)
!881 = !DISubroutineType(types: !882)
!882 = !{!16, !848}
!883 = !{!884, !885, !886, !887, !888, !895, !899, !901}
!884 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mask", arg: 1, scope: !880, file: !1, line: 582, type: !848)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signum", scope: !880, file: !1, line: 584, type: !16)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !880, file: !1, line: 584, type: !16)
!887 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sig", scope: !880, file: !1, line: 585, type: !55)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !889, file: !1, line: 602, type: !16)
!889 = distinct !DILexicalBlock(scope: !890, file: !1, line: 602, column: 13)
!890 = distinct !DILexicalBlock(scope: !891, file: !1, line: 601, column: 29)
!891 = distinct !DILexicalBlock(scope: !892, file: !1, line: 601, column: 13)
!892 = distinct !DILexicalBlock(scope: !893, file: !1, line: 591, column: 38)
!893 = distinct !DILexicalBlock(scope: !894, file: !1, line: 591, column: 5)
!894 = distinct !DILexicalBlock(scope: !880, file: !1, line: 591, column: 5)
!895 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !896, file: !1, line: 606, type: !16)
!896 = distinct !DILexicalBlock(scope: !897, file: !1, line: 606, column: 13)
!897 = distinct !DILexicalBlock(scope: !898, file: !1, line: 605, column: 46)
!898 = distinct !DILexicalBlock(scope: !892, file: !1, line: 605, column: 13)
!899 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !900, file: !1, line: 607, type: !16)
!900 = distinct !DILexicalBlock(scope: !897, file: !1, line: 607, column: 13)
!901 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !902, file: !1, line: 610, type: !16)
!902 = distinct !DILexicalBlock(scope: !892, file: !1, line: 610, column: 9)
!903 = !DISubprogram(name: "signal_sigpending", scope: !1, file: !1, line: 654, type: !127, isLocal: true, isDefinition: true, scopeLine: 655, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @signal_sigpending, variables: !904)
!904 = !{!905, !906, !907}
!905 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !903, file: !1, line: 654, type: !16)
!906 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !903, file: !1, line: 656, type: !55)
!907 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mask", scope: !903, file: !1, line: 657, type: !848)
!908 = !DISubprogram(name: "signal_sigwait", scope: !1, file: !1, line: 673, type: !137, isLocal: true, isDefinition: true, scopeLine: 674, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @signal_sigwait, variables: !909)
!909 = !{!910, !911, !912, !913, !914, !915, !916}
!910 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !908, file: !1, line: 673, type: !16)
!911 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !908, file: !1, line: 673, type: !16)
!912 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signals", scope: !908, file: !1, line: 675, type: !16)
!913 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "set", scope: !908, file: !1, line: 676, type: !848)
!914 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !908, file: !1, line: 677, type: !55)
!915 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signum", scope: !908, file: !1, line: 677, type: !55)
