; ModuleID = 'structseq.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Py_Identifier = type { %struct._Py_Identifier*, i8*, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !375, globals: !582)
!1 = !DIFile(filename: "Objects/structseq.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !96, !360, !44, !361, !101, !21, !362, !27, !364, !366}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStructSequence", file: !6, line: 35, baseType: !7)
!6 = !DIFile(filename: "Include/structseq.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !8, line: 33, baseType: !9)
!8 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!9 = !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 25, size: 256, align: 64, elements: !10)
!10 = !{!11, !358}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !9, file: !8, line: 26, baseType: !12, size: 192, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !13, line: 114, baseType: !14)
!13 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!14 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 111, size: 192, align: 64, elements: !15)
!15 = !{!16, !357}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !14, file: !13, line: 112, baseType: !17, size: 128, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !13, line: 109, baseType: !18)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !13, line: 105, size: 128, align: 64, elements: !19)
!19 = !{!20, !28}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !18, file: !13, line: 107, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !22, line: 177, baseType: !23)
!22 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !24, line: 102, baseType: !25)
!24 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !26, line: 181, baseType: !27)
!26 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!27 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !18, file: !13, line: 108, baseType: !29, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !13, line: 334, size: 3200, align: 64, elements: !31)
!31 = !{!32, !33, !37, !38, !39, !45, !109, !114, !119, !120, !125, !177, !208, !220, !226, !227, !228, !230, !232, !263, !264, !265, !274, !275, !280, !281, !283, !285, !295, !305, !323, !324, !325, !327, !329, !330, !332, !337, !342, !347, !348, !349, !350, !351, !352, !353, !354, !356}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !30, file: !13, line: 335, baseType: !12, size: 192, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !30, file: !13, line: 336, baseType: !34, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!36 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !30, file: !13, line: 337, baseType: !21, size: 64, align: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !30, file: !13, line: 337, baseType: !21, size: 64, align: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !30, file: !13, line: 341, baseType: !40, size: 64, align: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !13, line: 308, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{null, !44}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !30, file: !13, line: 342, baseType: !46, size: 64, align: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !13, line: 314, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !44, !51, !50}
!50 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !24, line: 48, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !54, line: 246, size: 1728, align: 64, elements: !55)
!54 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!55 = !{!56, !57, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !77, !78, !79, !80, !82, !84, !86, !90, !93, !95, !97, !98, !99, !100, !104, !105}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !53, file: !54, line: 247, baseType: !50, size: 32, align: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !53, file: !54, line: 252, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !53, file: !54, line: 253, baseType: !58, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !53, file: !54, line: 254, baseType: !58, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !53, file: !54, line: 255, baseType: !58, size: 64, align: 64, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !53, file: !54, line: 256, baseType: !58, size: 64, align: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !53, file: !54, line: 257, baseType: !58, size: 64, align: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !53, file: !54, line: 258, baseType: !58, size: 64, align: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !53, file: !54, line: 259, baseType: !58, size: 64, align: 64, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !53, file: !54, line: 261, baseType: !58, size: 64, align: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !53, file: !54, line: 262, baseType: !58, size: 64, align: 64, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !53, file: !54, line: 263, baseType: !58, size: 64, align: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !53, file: !54, line: 265, baseType: !70, size: 64, align: 64, offset: 768)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !54, line: 161, size: 192, align: 64, elements: !72)
!72 = !{!73, !74, !76}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !71, file: !54, line: 162, baseType: !70, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !71, file: !54, line: 163, baseType: !75, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !71, file: !54, line: 167, baseType: !50, size: 32, align: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !53, file: !54, line: 267, baseType: !75, size: 64, align: 64, offset: 832)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !53, file: !54, line: 269, baseType: !50, size: 32, align: 32, offset: 896)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !53, file: !54, line: 273, baseType: !50, size: 32, align: 32, offset: 928)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !53, file: !54, line: 275, baseType: !81, size: 64, align: 64, offset: 960)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !26, line: 140, baseType: !27)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !53, file: !54, line: 279, baseType: !83, size: 16, align: 16, offset: 1024)
!83 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !53, file: !54, line: 280, baseType: !85, size: 8, align: 8, offset: 1040)
!85 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !53, file: !54, line: 281, baseType: !87, size: 8, align: 8, offset: 1048)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 8, align: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 1)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !53, file: !54, line: 285, baseType: !91, size: 64, align: 64, offset: 1088)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !54, line: 155, baseType: null)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !53, file: !54, line: 294, baseType: !94, size: 64, align: 64, offset: 1152)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !26, line: 141, baseType: !27)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !53, file: !54, line: 303, baseType: !96, size: 64, align: 64, offset: 1216)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !53, file: !54, line: 304, baseType: !96, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !53, file: !54, line: 305, baseType: !96, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !53, file: !54, line: 306, baseType: !96, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !53, file: !54, line: 307, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !53, file: !54, line: 309, baseType: !50, size: 32, align: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !53, file: !54, line: 311, baseType: !106, size: 160, align: 8, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 160, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !30, file: !13, line: 343, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !13, line: 316, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!44, !44, !58}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !30, file: !13, line: 344, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !13, line: 318, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!50, !44, !58, !44}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !30, file: !13, line: 345, baseType: !96, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !30, file: !13, line: 346, baseType: !121, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !13, line: 320, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!44, !44}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !30, file: !13, line: 350, baseType: !126, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !13, line: 278, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 236, size: 2176, align: 64, elements: !129)
!129 = !{!130, !135, !136, !137, !138, !139, !144, !146, !147, !148, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !128, file: !13, line: 241, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !13, line: 166, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!44, !44, !44}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !128, file: !13, line: 242, baseType: !131, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !128, file: !13, line: 243, baseType: !131, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !128, file: !13, line: 244, baseType: !131, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !128, file: !13, line: 245, baseType: !131, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !128, file: !13, line: 246, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !13, line: 167, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!44, !44, !44, !44}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !128, file: !13, line: 247, baseType: !145, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !13, line: 165, baseType: !122)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !128, file: !13, line: 248, baseType: !145, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !128, file: !13, line: 249, baseType: !145, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !128, file: !13, line: 250, baseType: !149, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !13, line: 168, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!50, !44}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !128, file: !13, line: 251, baseType: !145, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !128, file: !13, line: 252, baseType: !131, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !128, file: !13, line: 253, baseType: !131, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !128, file: !13, line: 254, baseType: !131, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !128, file: !13, line: 255, baseType: !131, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !128, file: !13, line: 256, baseType: !131, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !128, file: !13, line: 257, baseType: !145, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !128, file: !13, line: 258, baseType: !96, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !128, file: !13, line: 259, baseType: !145, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !128, file: !13, line: 261, baseType: !131, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !128, file: !13, line: 262, baseType: !131, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !128, file: !13, line: 263, baseType: !131, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !128, file: !13, line: 264, baseType: !131, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !128, file: !13, line: 265, baseType: !140, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !128, file: !13, line: 266, baseType: !131, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !128, file: !13, line: 267, baseType: !131, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !128, file: !13, line: 268, baseType: !131, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !128, file: !13, line: 269, baseType: !131, size: 64, align: 64, offset: 1728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !128, file: !13, line: 270, baseType: !131, size: 64, align: 64, offset: 1792)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !128, file: !13, line: 272, baseType: !131, size: 64, align: 64, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !128, file: !13, line: 273, baseType: !131, size: 64, align: 64, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !128, file: !13, line: 274, baseType: !131, size: 64, align: 64, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !128, file: !13, line: 275, baseType: !131, size: 64, align: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !128, file: !13, line: 277, baseType: !145, size: 64, align: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !30, file: !13, line: 351, baseType: !178, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !13, line: 292, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 280, size: 640, align: 64, elements: !181)
!181 = !{!182, !187, !188, !193, !194, !195, !200, !201, !206, !207}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !180, file: !13, line: 281, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !13, line: 169, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!21, !44}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !180, file: !13, line: 282, baseType: !131, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !180, file: !13, line: 283, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !13, line: 170, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!44, !44, !21}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !180, file: !13, line: 284, baseType: !189, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !180, file: !13, line: 285, baseType: !96, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !180, file: !13, line: 286, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !13, line: 172, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!50, !44, !21, !44}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !180, file: !13, line: 287, baseType: !96, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !180, file: !13, line: 288, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !13, line: 231, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!50, !44, !44}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !180, file: !13, line: 290, baseType: !131, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !180, file: !13, line: 291, baseType: !189, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !30, file: !13, line: 352, baseType: !209, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !13, line: 298, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 294, size: 192, align: 64, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !211, file: !13, line: 295, baseType: !183, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !211, file: !13, line: 296, baseType: !131, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !211, file: !13, line: 297, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !13, line: 174, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!50, !44, !44, !44}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !30, file: !13, line: 356, baseType: !221, size: 64, align: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !13, line: 321, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !44}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !22, line: 186, baseType: !21)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !30, file: !13, line: 357, baseType: !140, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !30, file: !13, line: 358, baseType: !121, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !30, file: !13, line: 359, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !13, line: 317, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !30, file: !13, line: 360, baseType: !231, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !13, line: 319, baseType: !217)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !30, file: !13, line: 363, baseType: !233, size: 64, align: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !13, line: 304, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 301, size: 128, align: 64, elements: !236)
!236 = !{!237, !258}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !235, file: !13, line: 302, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !13, line: 193, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!50, !44, !242, !50}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !13, line: 191, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !13, line: 178, size: 640, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !255, !256, !257}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !244, file: !13, line: 179, baseType: !96, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !244, file: !13, line: 180, baseType: !44, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !13, line: 181, baseType: !21, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !244, file: !13, line: 182, baseType: !21, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !244, file: !13, line: 184, baseType: !50, size: 32, align: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !244, file: !13, line: 185, baseType: !50, size: 32, align: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !244, file: !13, line: 186, baseType: !58, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !244, file: !13, line: 187, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !244, file: !13, line: 188, baseType: !254, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !244, file: !13, line: 189, baseType: !254, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !244, file: !13, line: 190, baseType: !96, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !235, file: !13, line: 303, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !13, line: 194, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !44, !242}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !30, file: !13, line: 366, baseType: !103, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !30, file: !13, line: 368, baseType: !34, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !30, file: !13, line: 372, baseType: !266, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !13, line: 233, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!50, !44, !270, !96}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !13, line: 232, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!50, !44, !96}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !30, file: !13, line: 375, baseType: !149, size: 64, align: 64, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !30, file: !13, line: 379, baseType: !276, size: 64, align: 64, offset: 1600)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !13, line: 322, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!44, !44, !44, !50}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !30, file: !13, line: 382, baseType: !21, size: 64, align: 64, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !30, file: !13, line: 385, baseType: !282, size: 64, align: 64, offset: 1728)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !13, line: 323, baseType: !122)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !30, file: !13, line: 386, baseType: !284, size: 64, align: 64, offset: 1792)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !13, line: 324, baseType: !122)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !30, file: !13, line: 389, baseType: !286, size: 64, align: 64, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 40, size: 256, align: 64, elements: !289)
!288 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 41, baseType: !34, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 18, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 43, baseType: !50, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 45, baseType: !34, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !30, file: !13, line: 390, baseType: !296, size: 64, align: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !298, line: 18, size: 320, align: 64, elements: !299)
!298 = !DIFile(filename: "Include/structmember.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!299 = !{!300, !301, !302, !303, !304}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !297, file: !298, line: 19, baseType: !58, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !297, file: !298, line: 20, baseType: !50, size: 32, align: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !297, file: !298, line: 21, baseType: !21, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !297, file: !298, line: 22, baseType: !50, size: 32, align: 32, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !297, file: !298, line: 23, baseType: !58, size: 64, align: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !30, file: !13, line: 391, baseType: !306, size: 64, align: 64, offset: 1984)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !308, line: 11, size: 320, align: 64, elements: !309)
!308 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!309 = !{!310, !311, !316, !321, !322}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !307, file: !308, line: 12, baseType: !58, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !307, file: !308, line: 13, baseType: !312, size: 64, align: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !308, line: 8, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!44, !44, !96}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !307, file: !308, line: 14, baseType: !317, size: 64, align: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !308, line: 9, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!50, !44, !44, !96}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !307, file: !308, line: 15, baseType: !58, size: 64, align: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !307, file: !308, line: 16, baseType: !96, size: 64, align: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !30, file: !13, line: 392, baseType: !29, size: 64, align: 64, offset: 2048)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !30, file: !13, line: 393, baseType: !44, size: 64, align: 64, offset: 2112)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !30, file: !13, line: 394, baseType: !326, size: 64, align: 64, offset: 2176)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !13, line: 325, baseType: !141)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !30, file: !13, line: 395, baseType: !328, size: 64, align: 64, offset: 2240)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !13, line: 326, baseType: !217)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !30, file: !13, line: 396, baseType: !21, size: 64, align: 64, offset: 2304)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !30, file: !13, line: 397, baseType: !331, size: 64, align: 64, offset: 2368)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !13, line: 327, baseType: !217)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !30, file: !13, line: 398, baseType: !333, size: 64, align: 64, offset: 2432)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !13, line: 329, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!44, !29, !21}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !30, file: !13, line: 399, baseType: !338, size: 64, align: 64, offset: 2496)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !13, line: 328, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!44, !29, !44, !44}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !30, file: !13, line: 400, baseType: !343, size: 64, align: 64, offset: 2560)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !13, line: 307, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !96}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !30, file: !13, line: 401, baseType: !149, size: 64, align: 64, offset: 2624)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !30, file: !13, line: 402, baseType: !44, size: 64, align: 64, offset: 2688)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !30, file: !13, line: 403, baseType: !44, size: 64, align: 64, offset: 2752)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !30, file: !13, line: 404, baseType: !44, size: 64, align: 64, offset: 2816)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !30, file: !13, line: 405, baseType: !44, size: 64, align: 64, offset: 2880)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !30, file: !13, line: 406, baseType: !44, size: 64, align: 64, offset: 2944)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !30, file: !13, line: 407, baseType: !40, size: 64, align: 64, offset: 3008)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !30, file: !13, line: 410, baseType: !355, size: 32, align: 32, offset: 3072)
!355 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !30, file: !13, line: 412, baseType: !40, size: 64, align: 64, offset: 3136)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !14, file: !13, line: 113, baseType: !21, size: 64, align: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !9, file: !8, line: 27, baseType: !359, size: 64, align: 64, offset: 192)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 64, align: 64, elements: !88)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !298, line: 24, baseType: !297)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !13, line: 422, baseType: !30)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !368, line: 40, baseType: !369)
!368 = !DIFile(filename: "Include/listobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!369 = !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 23, size: 320, align: 64, elements: !370)
!370 = !{!371, !372, !374}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !369, file: !368, line: 24, baseType: !12, size: 192, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !369, file: !368, line: 26, baseType: !373, size: 64, align: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !369, file: !368, line: 39, baseType: !21, size: 64, align: 64, offset: 256)
!375 = !{!376, !384, !391, !395, !442, !448, !458, !461, !476, !509, !537}
!376 = !DISubprogram(name: "PyStructSequence_New", scope: !1, file: !1, line: 32, type: !377, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*)* @PyStructSequence_New, variables: !379)
!377 = !DISubroutineType(types: !378)
!378 = !{!44, !364}
!379 = !{!380, !381, !382, !383}
!380 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !376, file: !1, line: 32, type: !364)
!381 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !376, file: !1, line: 34, type: !4)
!382 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !376, file: !1, line: 35, type: !21)
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !376, file: !1, line: 35, type: !21)
!384 = !DISubprogram(name: "PyStructSequence_SetItem", scope: !1, file: !1, line: 50, type: !385, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, i64, %struct._object*)* @PyStructSequence_SetItem, variables: !387)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !44, !21, !44}
!387 = !{!388, !389, !390}
!388 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !384, file: !1, line: 50, type: !44)
!389 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !384, file: !1, line: 50, type: !21)
!390 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 3, scope: !384, file: !1, line: 50, type: !44)
!391 = !DISubprogram(name: "PyStructSequence_GetItem", scope: !1, file: !1, line: 56, type: !191, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i64)* @PyStructSequence_GetItem, variables: !392)
!392 = !{!393, !394}
!393 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !391, file: !1, line: 56, type: !44)
!394 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !391, file: !1, line: 56, type: !21)
!395 = !DISubprogram(name: "PyStructSequence_InitType2", scope: !1, file: !1, line: 324, type: !396, isLocal: false, isDefinition: true, scopeLine: 325, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._typeobject*, %struct.PyStructSequence_Desc*)* @PyStructSequence_InitType2, variables: !411)
!396 = !DISubroutineType(types: !397)
!397 = !{!50, !364, !398}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStructSequence_Desc", file: !6, line: 20, baseType: !400)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyStructSequence_Desc", file: !6, line: 15, size: 256, align: 64, elements: !401)
!401 = !{!402, !403, !404, !410}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !400, file: !6, line: 16, baseType: !58, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !400, file: !6, line: 17, baseType: !58, size: 64, align: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !400, file: !6, line: 18, baseType: !405, size: 64, align: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyStructSequence_Field", file: !6, line: 10, size: 128, align: 64, elements: !407)
!407 = !{!408, !409}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !406, file: !6, line: 11, baseType: !58, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !406, file: !6, line: 12, baseType: !58, size: 64, align: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "n_in_sequence", scope: !400, file: !6, line: 19, baseType: !50, size: 32, align: 32, offset: 192)
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !426, !428, !433, !435, !440}
!412 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !395, file: !1, line: 324, type: !364)
!413 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "desc", arg: 2, scope: !395, file: !1, line: 324, type: !398)
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !395, file: !1, line: 326, type: !44)
!415 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "members", scope: !395, file: !1, line: 327, type: !362)
!416 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_members", scope: !395, file: !1, line: 328, type: !50)
!417 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_unnamed_members", scope: !395, file: !1, line: 328, type: !50)
!418 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !395, file: !1, line: 328, type: !50)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !395, file: !1, line: 328, type: !50)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !395, file: !1, line: 329, type: !44)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !422, file: !1, line: 388, type: !44)
!422 = distinct !DILexicalBlock(scope: !423, file: !1, line: 388, column: 5)
!423 = distinct !DILexicalBlock(scope: !424, file: !1, line: 388, column: 5)
!424 = distinct !DILexicalBlock(scope: !425, file: !1, line: 388, column: 5)
!425 = distinct !DILexicalBlock(scope: !395, file: !1, line: 388, column: 5)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !427, file: !1, line: 388, type: !44)
!427 = distinct !DILexicalBlock(scope: !425, file: !1, line: 388, column: 5)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !429, file: !1, line: 389, type: !44)
!429 = distinct !DILexicalBlock(scope: !430, file: !1, line: 389, column: 5)
!430 = distinct !DILexicalBlock(scope: !431, file: !1, line: 389, column: 5)
!431 = distinct !DILexicalBlock(scope: !432, file: !1, line: 389, column: 5)
!432 = distinct !DILexicalBlock(scope: !395, file: !1, line: 389, column: 5)
!433 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !434, file: !1, line: 389, type: !44)
!434 = distinct !DILexicalBlock(scope: !432, file: !1, line: 389, column: 5)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !436, file: !1, line: 390, type: !44)
!436 = distinct !DILexicalBlock(scope: !437, file: !1, line: 390, column: 5)
!437 = distinct !DILexicalBlock(scope: !438, file: !1, line: 390, column: 5)
!438 = distinct !DILexicalBlock(scope: !439, file: !1, line: 390, column: 5)
!439 = distinct !DILexicalBlock(scope: !395, file: !1, line: 390, column: 5)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !441, file: !1, line: 390, type: !44)
!441 = distinct !DILexicalBlock(scope: !439, file: !1, line: 390, column: 5)
!442 = !DISubprogram(name: "PyStructSequence_InitType", scope: !1, file: !1, line: 396, type: !443, isLocal: false, isDefinition: true, scopeLine: 397, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._typeobject*, %struct.PyStructSequence_Desc*)* @PyStructSequence_InitType, variables: !445)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !364, !398}
!445 = !{!446, !447}
!446 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !442, file: !1, line: 396, type: !364)
!447 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "desc", arg: 2, scope: !442, file: !1, line: 396, type: !398)
!448 = !DISubprogram(name: "PyStructSequence_NewType", scope: !1, file: !1, line: 402, type: !449, isLocal: false, isDefinition: true, scopeLine: 403, flags: DIFlagPrototyped, isOptimized: true, function: %struct._typeobject* (%struct.PyStructSequence_Desc*)* @PyStructSequence_NewType, variables: !451)
!449 = !DISubroutineType(types: !450)
!450 = !{!364, !398}
!451 = !{!452, !453, !454}
!452 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "desc", arg: 1, scope: !448, file: !1, line: 402, type: !398)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !448, file: !1, line: 404, type: !364)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !455, file: !1, line: 410, type: !44)
!455 = distinct !DILexicalBlock(scope: !456, file: !1, line: 410, column: 9)
!456 = distinct !DILexicalBlock(scope: !457, file: !1, line: 409, column: 55)
!457 = distinct !DILexicalBlock(scope: !448, file: !1, line: 409, column: 9)
!458 = !DISubprogram(name: "_PyStructSequence_Init", scope: !1, file: !1, line: 416, type: !459, isLocal: false, isDefinition: true, scopeLine: 417, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @_PyStructSequence_Init, variables: !2)
!459 = !DISubroutineType(types: !460)
!460 = !{!50}
!461 = !DISubprogram(name: "structseq_dealloc", scope: !1, file: !1, line: 62, type: !462, isLocal: true, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyTupleObject*)* @structseq_dealloc, variables: !464)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !4}
!464 = !{!465, !466, !467, !468, !473}
!465 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !461, file: !1, line: 62, type: !4)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !461, file: !1, line: 64, type: !21)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !461, file: !1, line: 64, type: !21)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !469, file: !1, line: 68, type: !44)
!469 = distinct !DILexicalBlock(scope: !470, file: !1, line: 68, column: 9)
!470 = distinct !DILexicalBlock(scope: !471, file: !1, line: 67, column: 32)
!471 = distinct !DILexicalBlock(scope: !472, file: !1, line: 67, column: 5)
!472 = distinct !DILexicalBlock(scope: !461, file: !1, line: 67, column: 5)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !474, file: !1, line: 68, type: !44)
!474 = distinct !DILexicalBlock(scope: !475, file: !1, line: 68, column: 9)
!475 = distinct !DILexicalBlock(scope: !469, file: !1, line: 68, column: 9)
!476 = !DISubprogram(name: "structseq_repr", scope: !1, file: !1, line: 160, type: !477, isLocal: true, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyTupleObject*)* @structseq_repr, variables: !479)
!477 = !DISubroutineType(types: !478)
!478 = !{!44, !4}
!479 = !{!480, !481, !482, !483, !484, !485, !489, !490, !491, !495, !496, !497, !498, !502, !506}
!480 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !476, file: !1, line: 160, type: !4)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typ", scope: !476, file: !1, line: 166, type: !364)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !476, file: !1, line: 167, type: !50)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "removelast", scope: !476, file: !1, line: 167, type: !50)
!484 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !476, file: !1, line: 168, type: !21)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !476, file: !1, line: 169, type: !486)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 4096, align: 8, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 512)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "endofbuf", scope: !476, file: !1, line: 170, type: !58)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pbuf", scope: !476, file: !1, line: 170, type: !58)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !492, file: !1, line: 183, type: !44)
!492 = distinct !DILexicalBlock(scope: !493, file: !1, line: 182, column: 43)
!493 = distinct !DILexicalBlock(scope: !494, file: !1, line: 182, column: 5)
!494 = distinct !DILexicalBlock(scope: !476, file: !1, line: 182, column: 5)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "repr", scope: !492, file: !1, line: 183, type: !44)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cname", scope: !492, file: !1, line: 184, type: !58)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "crepr", scope: !492, file: !1, line: 184, type: !58)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !499, file: !1, line: 198, type: !44)
!499 = distinct !DILexicalBlock(scope: !500, file: !1, line: 198, column: 13)
!500 = distinct !DILexicalBlock(scope: !501, file: !1, line: 197, column: 28)
!501 = distinct !DILexicalBlock(scope: !492, file: !1, line: 197, column: 13)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !503, file: !1, line: 213, type: !44)
!503 = distinct !DILexicalBlock(scope: !504, file: !1, line: 213, column: 13)
!504 = distinct !DILexicalBlock(scope: !505, file: !1, line: 204, column: 37)
!505 = distinct !DILexicalBlock(scope: !492, file: !1, line: 204, column: 13)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !507, file: !1, line: 219, type: !44)
!507 = distinct !DILexicalBlock(scope: !508, file: !1, line: 219, column: 13)
!508 = distinct !DILexicalBlock(scope: !505, file: !1, line: 215, column: 14)
!509 = !DISubprogram(name: "structseq_reduce", scope: !1, file: !1, line: 234, type: !477, isLocal: true, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyTupleObject*)* @structseq_reduce, variables: !510)
!510 = !{!511, !512, !513, !514, !515, !516, !517, !518, !519, !523, !525, !527, !529, !532, !534}
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !509, file: !1, line: 234, type: !4)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tup", scope: !509, file: !1, line: 236, type: !44)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !509, file: !1, line: 237, type: !44)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !509, file: !1, line: 238, type: !44)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_fields", scope: !509, file: !1, line: 239, type: !21)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_visible_fields", scope: !509, file: !1, line: 239, type: !21)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_unnamed_fields", scope: !509, file: !1, line: 239, type: !21)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !509, file: !1, line: 240, type: !50)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !520, file: !1, line: 259, type: !58)
!520 = distinct !DILexicalBlock(scope: !521, file: !1, line: 258, column: 31)
!521 = distinct !DILexicalBlock(scope: !522, file: !1, line: 258, column: 5)
!522 = distinct !DILexicalBlock(scope: !509, file: !1, line: 258, column: 5)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !524, file: !1, line: 266, type: !44)
!524 = distinct !DILexicalBlock(scope: !509, file: !1, line: 266, column: 5)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !526, file: !1, line: 267, type: !44)
!526 = distinct !DILexicalBlock(scope: !509, file: !1, line: 267, column: 5)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !528, file: !1, line: 272, type: !44)
!528 = distinct !DILexicalBlock(scope: !509, file: !1, line: 272, column: 5)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !530, file: !1, line: 272, type: !44)
!530 = distinct !DILexicalBlock(scope: !531, file: !1, line: 272, column: 5)
!531 = distinct !DILexicalBlock(scope: !528, file: !1, line: 272, column: 5)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !533, file: !1, line: 273, type: !44)
!533 = distinct !DILexicalBlock(scope: !509, file: !1, line: 273, column: 5)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !535, file: !1, line: 273, type: !44)
!535 = distinct !DILexicalBlock(scope: !536, file: !1, line: 273, column: 5)
!536 = distinct !DILexicalBlock(scope: !533, file: !1, line: 273, column: 5)
!537 = !DISubprogram(name: "structseq_new", scope: !1, file: !1, line: 74, type: !538, isLocal: true, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @structseq_new, variables: !540)
!538 = !DISubroutineType(types: !539)
!539 = !{!44, !364, !44, !44}
!540 = !{!541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !557, !563, !567, !572, !576, !580}
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !537, file: !1, line: 74, type: !364)
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !537, file: !1, line: 74, type: !44)
!543 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !537, file: !1, line: 74, type: !44)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg", scope: !537, file: !1, line: 76, type: !44)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !537, file: !1, line: 77, type: !44)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ob", scope: !537, file: !1, line: 78, type: !44)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !537, file: !1, line: 79, type: !4)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !537, file: !1, line: 80, type: !21)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_len", scope: !537, file: !1, line: 80, type: !21)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_len", scope: !537, file: !1, line: 80, type: !21)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !537, file: !1, line: 80, type: !21)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_unnamed_fields", scope: !537, file: !1, line: 80, type: !21)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !554, file: !1, line: 97, type: !44)
!554 = distinct !DILexicalBlock(scope: !555, file: !1, line: 97, column: 9)
!555 = distinct !DILexicalBlock(scope: !556, file: !1, line: 93, column: 38)
!556 = distinct !DILexicalBlock(scope: !537, file: !1, line: 93, column: 9)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !558, file: !1, line: 111, type: !44)
!558 = distinct !DILexicalBlock(scope: !559, file: !1, line: 111, column: 13)
!559 = distinct !DILexicalBlock(scope: !560, file: !1, line: 107, column: 28)
!560 = distinct !DILexicalBlock(scope: !561, file: !1, line: 107, column: 13)
!561 = distinct !DILexicalBlock(scope: !562, file: !1, line: 106, column: 29)
!562 = distinct !DILexicalBlock(scope: !537, file: !1, line: 106, column: 9)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !564, file: !1, line: 119, type: !44)
!564 = distinct !DILexicalBlock(scope: !565, file: !1, line: 119, column: 13)
!565 = distinct !DILexicalBlock(scope: !566, file: !1, line: 115, column: 28)
!566 = distinct !DILexicalBlock(scope: !561, file: !1, line: 115, column: 13)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !568, file: !1, line: 128, type: !44)
!568 = distinct !DILexicalBlock(scope: !569, file: !1, line: 128, column: 13)
!569 = distinct !DILexicalBlock(scope: !570, file: !1, line: 124, column: 29)
!570 = distinct !DILexicalBlock(scope: !571, file: !1, line: 124, column: 13)
!571 = distinct !DILexicalBlock(scope: !562, file: !1, line: 123, column: 10)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !573, file: !1, line: 135, type: !44)
!573 = distinct !DILexicalBlock(scope: !574, file: !1, line: 135, column: 9)
!574 = distinct !DILexicalBlock(scope: !575, file: !1, line: 134, column: 22)
!575 = distinct !DILexicalBlock(scope: !537, file: !1, line: 134, column: 9)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !577, file: !1, line: 139, type: !44)
!577 = distinct !DILexicalBlock(scope: !578, file: !1, line: 138, column: 31)
!578 = distinct !DILexicalBlock(scope: !579, file: !1, line: 138, column: 5)
!579 = distinct !DILexicalBlock(scope: !537, file: !1, line: 138, column: 5)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !581, file: !1, line: 154, type: !44)
!581 = distinct !DILexicalBlock(scope: !537, file: !1, line: 154, column: 5)
!582 = !{!583, !584, !592, !593, !594, !599, !603, !607, !611, !615}
!583 = !DIGlobalVariable(name: "PyStructSequence_UnnamedField", scope: !0, file: !1, line: 13, type: !58, isLocal: false, isDefinition: true, variable: i8** @PyStructSequence_UnnamedField)
!584 = !DIGlobalVariable(name: "PyId_n_fields", scope: !0, file: !1, line: 15, type: !585, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @PyId_n_fields)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !13, line: 144, baseType: !586)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !13, line: 140, size: 192, align: 64, elements: !587)
!587 = !{!588, !590, !591}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !586, file: !13, line: 141, baseType: !589, size: 64, align: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64, align: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !586, file: !13, line: 142, baseType: !34, size: 64, align: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !586, file: !13, line: 143, baseType: !44, size: 64, align: 64, offset: 128)
!592 = !DIGlobalVariable(name: "PyId_n_sequence_fields", scope: !0, file: !1, line: 14, type: !585, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @PyId_n_sequence_fields)
!593 = !DIGlobalVariable(name: "_struct_sequence_template", scope: !0, file: !1, line: 282, type: !365, isLocal: true, isDefinition: true, variable: %struct._typeobject* @_struct_sequence_template)
!594 = !DIGlobalVariable(name: "structseq_methods", scope: !0, file: !1, line: 277, type: !595, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMethodDef]* @structseq_methods)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 512, align: 64, elements: !597)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !288, line: 47, baseType: !287)
!597 = !{!598}
!598 = !DISubrange(count: 2)
!599 = !DIGlobalVariable(name: "kwlist", scope: !537, file: !1, line: 81, type: !600, isLocal: true, isDefinition: true, variable: [3 x i8*]* @structseq_new.kwlist)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 192, align: 64, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 3)
!603 = !DIGlobalVariable(name: "visible_length_key", scope: !0, file: !1, line: 7, type: !604, isLocal: true, isDefinition: true, variable: [18 x i8]* @visible_length_key)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 144, align: 8, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 18)
!607 = !DIGlobalVariable(name: "real_length_key", scope: !0, file: !1, line: 8, type: !608, isLocal: true, isDefinition: true, variable: [9 x i8]* @real_length_key)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 72, align: 8, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 9)
!611 = !DIGlobalVariable(name: "unnamed_fields_key", scope: !0, file: !1, line: 9, type: !612, isLocal: true, isDefinition: true, variable: [17 x i8]* @unnamed_fields_key)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 136, align: 8, elements: !613)
!613 = !{!614}
!614 = !DISubrange(count: 17)
!615 = !DIGlobalVariable(name: "PyId_n_unnamed_fields", scope: !0, file: !1, line: 16, type: !585, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @PyId_n_unnamed_fields)
!616 = !{i32 2, !"Dwarf Version", i32 4}
!617 = !{i32 2, !"Debug Info Version", i32 3}
!618 = !{!"clang version 3.7.0 (tags/RELEASE_370/final)"}
!619 = !DIExpression()
!620 = !DILocation(line: 32, column: 36, scope: !376)
!621 = !DILocation(line: 35, column: 23, scope: !376)
!622 = !{!623, !629, i64 264}
!623 = !{!"_typeobject", !624, i64 0, !629, i64 24, !626, i64 32, !626, i64 40, !629, i64 48, !629, i64 56, !629, i64 64, !629, i64 72, !629, i64 80, !629, i64 88, !629, i64 96, !629, i64 104, !629, i64 112, !629, i64 120, !629, i64 128, !629, i64 136, !629, i64 144, !629, i64 152, !629, i64 160, !626, i64 168, !629, i64 176, !629, i64 184, !629, i64 192, !629, i64 200, !626, i64 208, !629, i64 216, !629, i64 224, !629, i64 232, !629, i64 240, !629, i64 248, !629, i64 256, !629, i64 264, !629, i64 272, !629, i64 280, !626, i64 288, !629, i64 296, !629, i64 304, !629, i64 312, !629, i64 320, !629, i64 328, !629, i64 336, !629, i64 344, !629, i64 352, !629, i64 360, !629, i64 368, !629, i64 376, !630, i64 384, !629, i64 392}
!624 = !{!"", !625, i64 0, !626, i64 16}
!625 = !{!"_object", !626, i64 0, !629, i64 8}
!626 = !{!"long", !627, i64 0}
!627 = !{!"omnipotent char", !628, i64 0}
!628 = !{!"Simple C/C++ TBAA"}
!629 = !{!"any pointer", !627, i64 0}
!630 = !{!"int", !627, i64 0}
!631 = !DILocation(line: 35, column: 16, scope: !376)
!632 = !DILocation(line: 37, column: 11, scope: !376)
!633 = !DILocation(line: 38, column: 13, scope: !634)
!634 = distinct !DILexicalBlock(scope: !376, file: !1, line: 38, column: 9)
!635 = !DILocation(line: 38, column: 9, scope: !376)
