; ModuleID = 'sysmodule.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Py_atomic_address = type { i8* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !11, subprograms: !473, globals: !1352)
!1 = !DIFile(filename: "./Python/sysmodule.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !4, line: 23, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!7 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!8 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!9 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!10 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!11 = !{!12, !114, !29, !465, !35, !119, !121, !466}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !14, line: 139, baseType: !15)
!14 = !DIFile(filename: "Include/pystate.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !14, line: 69, size: 1536, align: 64, elements: !16)
!16 = !{!17, !19, !20, !379, !438, !439, !440, !441, !442, !443, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !15, file: !14, line: 72, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !15, file: !14, line: 73, baseType: !18, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !15, file: !14, line: 74, baseType: !21, size: 64, align: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !14, line: 44, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !14, line: 19, size: 832, align: 64, elements: !24)
!24 = !{!25, !27, !28, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !23, file: !14, line: 21, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !23, file: !14, line: 22, baseType: !18, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !23, file: !14, line: 24, baseType: !29, size: 64, align: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !31, line: 109, baseType: !32)
!31 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !31, line: 105, size: 128, align: 64, elements: !33)
!33 = !{!34, !42}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !32, file: !31, line: 107, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !36, line: 177, baseType: !37)
!36 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !38, line: 102, baseType: !39)
!38 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !40, line: 181, baseType: !41)
!40 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!41 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !32, file: !31, line: 108, baseType: !43, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !31, line: 334, size: 3200, align: 64, elements: !45)
!45 = !{!46, !52, !56, !57, !58, !63, !127, !132, !137, !138, !143, !195, !226, !238, !244, !245, !246, !248, !250, !281, !282, !283, !292, !293, !298, !299, !301, !303, !313, !316, !334, !335, !336, !338, !340, !341, !343, !348, !353, !358, !359, !360, !361, !362, !363, !364, !365, !367}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !44, file: !31, line: 335, baseType: !47, size: 192, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !31, line: 114, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 111, size: 192, align: 64, elements: !49)
!49 = !{!50, !51}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !48, file: !31, line: 112, baseType: !30, size: 128, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !48, file: !31, line: 113, baseType: !35, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !44, file: !31, line: 336, baseType: !53, size: 64, align: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !44, file: !31, line: 337, baseType: !35, size: 64, align: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !44, file: !31, line: 337, baseType: !35, size: 64, align: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !44, file: !31, line: 341, baseType: !59, size: 64, align: 64, offset: 384)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !31, line: 308, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !29}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !44, file: !31, line: 342, baseType: !64, size: 64, align: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !31, line: 314, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !29, !69, !68}
!68 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !38, line: 48, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !72, line: 246, size: 1728, align: 64, elements: !73)
!72 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!73 = !{!74, !75, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !95, !96, !97, !98, !100, !102, !104, !108, !111, !113, !115, !116, !117, !118, !122, !123}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !71, file: !72, line: 247, baseType: !68, size: 32, align: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !71, file: !72, line: 252, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !71, file: !72, line: 253, baseType: !76, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !71, file: !72, line: 254, baseType: !76, size: 64, align: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !71, file: !72, line: 255, baseType: !76, size: 64, align: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !71, file: !72, line: 256, baseType: !76, size: 64, align: 64, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !71, file: !72, line: 257, baseType: !76, size: 64, align: 64, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !71, file: !72, line: 258, baseType: !76, size: 64, align: 64, offset: 448)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !71, file: !72, line: 259, baseType: !76, size: 64, align: 64, offset: 512)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !71, file: !72, line: 261, baseType: !76, size: 64, align: 64, offset: 576)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !71, file: !72, line: 262, baseType: !76, size: 64, align: 64, offset: 640)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !71, file: !72, line: 263, baseType: !76, size: 64, align: 64, offset: 704)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !71, file: !72, line: 265, baseType: !88, size: 64, align: 64, offset: 768)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !72, line: 161, size: 192, align: 64, elements: !90)
!90 = !{!91, !92, !94}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !89, file: !72, line: 162, baseType: !88, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !89, file: !72, line: 163, baseType: !93, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !89, file: !72, line: 167, baseType: !68, size: 32, align: 32, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !71, file: !72, line: 267, baseType: !93, size: 64, align: 64, offset: 832)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !71, file: !72, line: 269, baseType: !68, size: 32, align: 32, offset: 896)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !71, file: !72, line: 273, baseType: !68, size: 32, align: 32, offset: 928)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !71, file: !72, line: 275, baseType: !99, size: 64, align: 64, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !40, line: 140, baseType: !41)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !71, file: !72, line: 279, baseType: !101, size: 16, align: 16, offset: 1024)
!101 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !71, file: !72, line: 280, baseType: !103, size: 8, align: 8, offset: 1040)
!103 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !71, file: !72, line: 281, baseType: !105, size: 8, align: 8, offset: 1048)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 8, align: 8, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 1)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !71, file: !72, line: 285, baseType: !109, size: 64, align: 64, offset: 1088)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !72, line: 155, baseType: null)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !71, file: !72, line: 294, baseType: !112, size: 64, align: 64, offset: 1152)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !40, line: 141, baseType: !41)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !71, file: !72, line: 303, baseType: !114, size: 64, align: 64, offset: 1216)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !71, file: !72, line: 304, baseType: !114, size: 64, align: 64, offset: 1280)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !71, file: !72, line: 305, baseType: !114, size: 64, align: 64, offset: 1344)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !71, file: !72, line: 306, baseType: !114, size: 64, align: 64, offset: 1408)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !71, file: !72, line: 307, baseType: !119, size: 64, align: 64, offset: 1472)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !120, line: 62, baseType: !121)
!120 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!121 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !71, file: !72, line: 309, baseType: !68, size: 32, align: 32, offset: 1536)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !71, file: !72, line: 311, baseType: !124, size: 160, align: 8, offset: 1568)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 160, align: 8, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 20)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !44, file: !31, line: 343, baseType: !128, size: 64, align: 64, offset: 512)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !31, line: 316, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!29, !29, !76}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !44, file: !31, line: 344, baseType: !133, size: 64, align: 64, offset: 576)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !31, line: 318, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!68, !29, !76, !29}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !44, file: !31, line: 345, baseType: !114, size: 64, align: 64, offset: 640)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !44, file: !31, line: 346, baseType: !139, size: 64, align: 64, offset: 704)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !31, line: 320, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!29, !29}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !44, file: !31, line: 350, baseType: !144, size: 64, align: 64, offset: 768)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !31, line: 278, baseType: !146)
!146 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 236, size: 2176, align: 64, elements: !147)
!147 = !{!148, !153, !154, !155, !156, !157, !162, !164, !165, !166, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !146, file: !31, line: 241, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !31, line: 166, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!29, !29, !29}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !146, file: !31, line: 242, baseType: !149, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !146, file: !31, line: 243, baseType: !149, size: 64, align: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !146, file: !31, line: 244, baseType: !149, size: 64, align: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !146, file: !31, line: 245, baseType: !149, size: 64, align: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !146, file: !31, line: 246, baseType: !158, size: 64, align: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !31, line: 167, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!29, !29, !29, !29}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !146, file: !31, line: 247, baseType: !163, size: 64, align: 64, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !31, line: 165, baseType: !140)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !146, file: !31, line: 248, baseType: !163, size: 64, align: 64, offset: 448)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !146, file: !31, line: 249, baseType: !163, size: 64, align: 64, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !146, file: !31, line: 250, baseType: !167, size: 64, align: 64, offset: 576)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !31, line: 168, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!68, !29}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !146, file: !31, line: 251, baseType: !163, size: 64, align: 64, offset: 640)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !146, file: !31, line: 252, baseType: !149, size: 64, align: 64, offset: 704)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !146, file: !31, line: 253, baseType: !149, size: 64, align: 64, offset: 768)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !146, file: !31, line: 254, baseType: !149, size: 64, align: 64, offset: 832)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !146, file: !31, line: 255, baseType: !149, size: 64, align: 64, offset: 896)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !146, file: !31, line: 256, baseType: !149, size: 64, align: 64, offset: 960)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !146, file: !31, line: 257, baseType: !163, size: 64, align: 64, offset: 1024)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !146, file: !31, line: 258, baseType: !114, size: 64, align: 64, offset: 1088)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !146, file: !31, line: 259, baseType: !163, size: 64, align: 64, offset: 1152)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !146, file: !31, line: 261, baseType: !149, size: 64, align: 64, offset: 1216)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !146, file: !31, line: 262, baseType: !149, size: 64, align: 64, offset: 1280)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !146, file: !31, line: 263, baseType: !149, size: 64, align: 64, offset: 1344)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !146, file: !31, line: 264, baseType: !149, size: 64, align: 64, offset: 1408)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !146, file: !31, line: 265, baseType: !158, size: 64, align: 64, offset: 1472)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !146, file: !31, line: 266, baseType: !149, size: 64, align: 64, offset: 1536)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !146, file: !31, line: 267, baseType: !149, size: 64, align: 64, offset: 1600)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !146, file: !31, line: 268, baseType: !149, size: 64, align: 64, offset: 1664)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !146, file: !31, line: 269, baseType: !149, size: 64, align: 64, offset: 1728)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !146, file: !31, line: 270, baseType: !149, size: 64, align: 64, offset: 1792)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !146, file: !31, line: 272, baseType: !149, size: 64, align: 64, offset: 1856)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !146, file: !31, line: 273, baseType: !149, size: 64, align: 64, offset: 1920)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !146, file: !31, line: 274, baseType: !149, size: 64, align: 64, offset: 1984)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !146, file: !31, line: 275, baseType: !149, size: 64, align: 64, offset: 2048)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !146, file: !31, line: 277, baseType: !163, size: 64, align: 64, offset: 2112)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !44, file: !31, line: 351, baseType: !196, size: 64, align: 64, offset: 832)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !31, line: 292, baseType: !198)
!198 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 280, size: 640, align: 64, elements: !199)
!199 = !{!200, !205, !206, !211, !212, !213, !218, !219, !224, !225}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !198, file: !31, line: 281, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !31, line: 169, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!35, !29}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !198, file: !31, line: 282, baseType: !149, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !198, file: !31, line: 283, baseType: !207, size: 64, align: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !31, line: 170, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!29, !29, !35}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !198, file: !31, line: 284, baseType: !207, size: 64, align: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !198, file: !31, line: 285, baseType: !114, size: 64, align: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !198, file: !31, line: 286, baseType: !214, size: 64, align: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !31, line: 172, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!68, !29, !35, !29}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !198, file: !31, line: 287, baseType: !114, size: 64, align: 64, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !198, file: !31, line: 288, baseType: !220, size: 64, align: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !31, line: 231, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!68, !29, !29}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !198, file: !31, line: 290, baseType: !149, size: 64, align: 64, offset: 512)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !198, file: !31, line: 291, baseType: !207, size: 64, align: 64, offset: 576)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !44, file: !31, line: 352, baseType: !227, size: 64, align: 64, offset: 896)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !31, line: 298, baseType: !229)
!229 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 294, size: 192, align: 64, elements: !230)
!230 = !{!231, !232, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !229, file: !31, line: 295, baseType: !201, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !229, file: !31, line: 296, baseType: !149, size: 64, align: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !229, file: !31, line: 297, baseType: !234, size: 64, align: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !31, line: 174, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!68, !29, !29, !29}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !44, file: !31, line: 356, baseType: !239, size: 64, align: 64, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !31, line: 321, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!243, !29}
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !36, line: 186, baseType: !35)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !44, file: !31, line: 357, baseType: !158, size: 64, align: 64, offset: 1024)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !44, file: !31, line: 358, baseType: !139, size: 64, align: 64, offset: 1088)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !44, file: !31, line: 359, baseType: !247, size: 64, align: 64, offset: 1152)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !31, line: 317, baseType: !150)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !44, file: !31, line: 360, baseType: !249, size: 64, align: 64, offset: 1216)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !31, line: 319, baseType: !235)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !44, file: !31, line: 363, baseType: !251, size: 64, align: 64, offset: 1280)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !31, line: 304, baseType: !253)
!253 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 301, size: 128, align: 64, elements: !254)
!254 = !{!255, !276}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !253, file: !31, line: 302, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !31, line: 193, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!68, !29, !260, !68}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !31, line: 191, baseType: !262)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !31, line: 178, size: 640, align: 64, elements: !263)
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !273, !274, !275}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !262, file: !31, line: 179, baseType: !114, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !262, file: !31, line: 180, baseType: !29, size: 64, align: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !262, file: !31, line: 181, baseType: !35, size: 64, align: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !262, file: !31, line: 182, baseType: !35, size: 64, align: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !262, file: !31, line: 184, baseType: !68, size: 32, align: 32, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !262, file: !31, line: 185, baseType: !68, size: 32, align: 32, offset: 288)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !262, file: !31, line: 186, baseType: !76, size: 64, align: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !262, file: !31, line: 187, baseType: !272, size: 64, align: 64, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !262, file: !31, line: 188, baseType: !272, size: 64, align: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !262, file: !31, line: 189, baseType: !272, size: 64, align: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !262, file: !31, line: 190, baseType: !114, size: 64, align: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !253, file: !31, line: 303, baseType: !277, size: 64, align: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !31, line: 194, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !29, !260}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !44, file: !31, line: 366, baseType: !121, size: 64, align: 64, offset: 1344)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !44, file: !31, line: 368, baseType: !53, size: 64, align: 64, offset: 1408)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !44, file: !31, line: 372, baseType: !284, size: 64, align: 64, offset: 1472)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !31, line: 233, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!68, !29, !288, !114}
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !31, line: 232, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!68, !29, !114}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !44, file: !31, line: 375, baseType: !167, size: 64, align: 64, offset: 1536)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !44, file: !31, line: 379, baseType: !294, size: 64, align: 64, offset: 1600)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !31, line: 322, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!29, !29, !29, !68}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !44, file: !31, line: 382, baseType: !35, size: 64, align: 64, offset: 1664)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !44, file: !31, line: 385, baseType: !300, size: 64, align: 64, offset: 1728)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !31, line: 323, baseType: !140)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !44, file: !31, line: 386, baseType: !302, size: 64, align: 64, offset: 1792)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !31, line: 324, baseType: !140)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !44, file: !31, line: 389, baseType: !304, size: 64, align: 64, offset: 1856)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !306, line: 40, size: 256, align: 64, elements: !307)
!306 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!307 = !{!308, !309, !311, !312}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !305, file: !306, line: 41, baseType: !53, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !305, file: !306, line: 42, baseType: !310, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !306, line: 18, baseType: !150)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !305, file: !306, line: 43, baseType: !68, size: 32, align: 32, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !305, file: !306, line: 45, baseType: !53, size: 64, align: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !44, file: !31, line: 390, baseType: !314, size: 64, align: 64, offset: 1920)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !31, line: 390, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !44, file: !31, line: 391, baseType: !317, size: 64, align: 64, offset: 1984)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !319, line: 11, size: 320, align: 64, elements: !320)
!319 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!320 = !{!321, !322, !327, !332, !333}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !318, file: !319, line: 12, baseType: !76, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !318, file: !319, line: 13, baseType: !323, size: 64, align: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !319, line: 8, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!29, !29, !114}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !318, file: !319, line: 14, baseType: !328, size: 64, align: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !319, line: 9, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!68, !29, !29, !114}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !318, file: !319, line: 15, baseType: !76, size: 64, align: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !318, file: !319, line: 16, baseType: !114, size: 64, align: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !44, file: !31, line: 392, baseType: !43, size: 64, align: 64, offset: 2048)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !44, file: !31, line: 393, baseType: !29, size: 64, align: 64, offset: 2112)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !44, file: !31, line: 394, baseType: !337, size: 64, align: 64, offset: 2176)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !31, line: 325, baseType: !159)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !44, file: !31, line: 395, baseType: !339, size: 64, align: 64, offset: 2240)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !31, line: 326, baseType: !235)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !44, file: !31, line: 396, baseType: !35, size: 64, align: 64, offset: 2304)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !44, file: !31, line: 397, baseType: !342, size: 64, align: 64, offset: 2368)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !31, line: 327, baseType: !235)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !44, file: !31, line: 398, baseType: !344, size: 64, align: 64, offset: 2432)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !31, line: 329, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!29, !43, !35}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !44, file: !31, line: 399, baseType: !349, size: 64, align: 64, offset: 2496)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !31, line: 328, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!29, !43, !29, !29}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !44, file: !31, line: 400, baseType: !354, size: 64, align: 64, offset: 2560)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !31, line: 307, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !114}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !44, file: !31, line: 401, baseType: !167, size: 64, align: 64, offset: 2624)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !44, file: !31, line: 402, baseType: !29, size: 64, align: 64, offset: 2688)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !44, file: !31, line: 403, baseType: !29, size: 64, align: 64, offset: 2752)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !44, file: !31, line: 404, baseType: !29, size: 64, align: 64, offset: 2816)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !44, file: !31, line: 405, baseType: !29, size: 64, align: 64, offset: 2880)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !44, file: !31, line: 406, baseType: !29, size: 64, align: 64, offset: 2944)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !44, file: !31, line: 407, baseType: !59, size: 64, align: 64, offset: 3008)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !44, file: !31, line: 410, baseType: !366, size: 32, align: 32, offset: 3072)
!366 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !44, file: !31, line: 412, baseType: !59, size: 64, align: 64, offset: 3136)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !23, file: !14, line: 25, baseType: !29, size: 64, align: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !23, file: !14, line: 26, baseType: !29, size: 64, align: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !23, file: !14, line: 27, baseType: !29, size: 64, align: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !23, file: !14, line: 28, baseType: !29, size: 64, align: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !23, file: !14, line: 30, baseType: !29, size: 64, align: 64, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !23, file: !14, line: 31, baseType: !29, size: 64, align: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !23, file: !14, line: 32, baseType: !29, size: 64, align: 64, offset: 576)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !23, file: !14, line: 33, baseType: !68, size: 32, align: 32, offset: 640)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !23, file: !14, line: 34, baseType: !68, size: 32, align: 32, offset: 672)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !23, file: !14, line: 37, baseType: !68, size: 32, align: 32, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !23, file: !14, line: 43, baseType: !29, size: 64, align: 64, offset: 768)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !15, file: !14, line: 76, baseType: !380, size: 64, align: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !382, line: 17, size: 3072, align: 64, elements: !383)
!382 = !DIFile(filename: "Include/frameobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!383 = !{!384, !385, !386, !413, !414, !415, !416, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !436}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !381, file: !382, line: 18, baseType: !47, size: 192, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "f_back", scope: !381, file: !382, line: 19, baseType: !380, size: 64, align: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "f_code", scope: !381, file: !382, line: 20, baseType: !387, size: 64, align: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !389, line: 33, baseType: !390)
!389 = !DIFile(filename: "Include/code.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!390 = !DICompositeType(tag: DW_TAG_structure_type, file: !389, line: 11, size: 1152, align: 64, elements: !391)
!391 = !{!392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !407, !408, !409, !410, !411, !412}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !390, file: !389, line: 12, baseType: !30, size: 128, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !390, file: !389, line: 13, baseType: !68, size: 32, align: 32, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !390, file: !389, line: 14, baseType: !68, size: 32, align: 32, offset: 160)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !390, file: !389, line: 15, baseType: !68, size: 32, align: 32, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !390, file: !389, line: 16, baseType: !68, size: 32, align: 32, offset: 224)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !390, file: !389, line: 17, baseType: !68, size: 32, align: 32, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "co_code", scope: !390, file: !389, line: 18, baseType: !29, size: 64, align: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !390, file: !389, line: 19, baseType: !29, size: 64, align: 64, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !390, file: !389, line: 20, baseType: !29, size: 64, align: 64, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "co_varnames", scope: !390, file: !389, line: 21, baseType: !29, size: 64, align: 64, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "co_freevars", scope: !390, file: !389, line: 22, baseType: !29, size: 64, align: 64, offset: 576)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "co_cellvars", scope: !390, file: !389, line: 23, baseType: !29, size: 64, align: 64, offset: 640)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "co_cell2arg", scope: !390, file: !389, line: 25, baseType: !405, size: 64, align: 64, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !390, file: !389, line: 26, baseType: !29, size: 64, align: 64, offset: 768)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !390, file: !389, line: 27, baseType: !29, size: 64, align: 64, offset: 832)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !390, file: !389, line: 28, baseType: !68, size: 32, align: 32, offset: 896)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "co_lnotab", scope: !390, file: !389, line: 29, baseType: !29, size: 64, align: 64, offset: 960)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "co_zombieframe", scope: !390, file: !389, line: 31, baseType: !114, size: 64, align: 64, offset: 1024)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !390, file: !389, line: 32, baseType: !29, size: 64, align: 64, offset: 1088)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "f_builtins", scope: !381, file: !382, line: 21, baseType: !29, size: 64, align: 64, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "f_globals", scope: !381, file: !382, line: 22, baseType: !29, size: 64, align: 64, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "f_locals", scope: !381, file: !382, line: 23, baseType: !29, size: 64, align: 64, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "f_valuestack", scope: !381, file: !382, line: 24, baseType: !417, size: 64, align: 64, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "f_stacktop", scope: !381, file: !382, line: 28, baseType: !417, size: 64, align: 64, offset: 576)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "f_trace", scope: !381, file: !382, line: 29, baseType: !29, size: 64, align: 64, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_type", scope: !381, file: !382, line: 38, baseType: !29, size: 64, align: 64, offset: 704)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_value", scope: !381, file: !382, line: 38, baseType: !29, size: 64, align: 64, offset: 768)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_traceback", scope: !381, file: !382, line: 38, baseType: !29, size: 64, align: 64, offset: 832)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "f_gen", scope: !381, file: !382, line: 40, baseType: !29, size: 64, align: 64, offset: 896)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "f_lasti", scope: !381, file: !382, line: 42, baseType: !68, size: 32, align: 32, offset: 960)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "f_lineno", scope: !381, file: !382, line: 48, baseType: !68, size: 32, align: 32, offset: 992)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "f_iblock", scope: !381, file: !382, line: 49, baseType: !68, size: 32, align: 32, offset: 1024)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "f_executing", scope: !381, file: !382, line: 50, baseType: !55, size: 8, align: 8, offset: 1056)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "f_blockstack", scope: !381, file: !382, line: 51, baseType: !429, size: 1920, align: 32, offset: 1088)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 1920, align: 32, elements: !125)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTryBlock", file: !382, line: 15, baseType: !431)
!431 = !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 11, size: 96, align: 32, elements: !432)
!432 = !{!433, !434, !435}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "b_type", scope: !431, file: !382, line: 12, baseType: !68, size: 32, align: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "b_handler", scope: !431, file: !382, line: 13, baseType: !68, size: 32, align: 32, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "b_level", scope: !431, file: !382, line: 14, baseType: !68, size: 32, align: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "f_localsplus", scope: !381, file: !382, line: 52, baseType: !437, size: 64, align: 64, offset: 3008)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 64, align: 64, elements: !106)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !15, file: !14, line: 77, baseType: !68, size: 32, align: 32, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !15, file: !14, line: 78, baseType: !55, size: 8, align: 8, offset: 288)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !15, file: !14, line: 80, baseType: !55, size: 8, align: 8, offset: 296)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !15, file: !14, line: 85, baseType: !68, size: 32, align: 32, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !15, file: !14, line: 86, baseType: !68, size: 32, align: 32, offset: 352)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !15, file: !14, line: 88, baseType: !444, size: 64, align: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !14, line: 54, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!68, !29, !380, !68, !29}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !15, file: !14, line: 89, baseType: !444, size: 64, align: 64, offset: 448)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !15, file: !14, line: 90, baseType: !29, size: 64, align: 64, offset: 512)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !15, file: !14, line: 91, baseType: !29, size: 64, align: 64, offset: 576)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !15, file: !14, line: 93, baseType: !29, size: 64, align: 64, offset: 640)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !15, file: !14, line: 94, baseType: !29, size: 64, align: 64, offset: 704)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !15, file: !14, line: 95, baseType: !29, size: 64, align: 64, offset: 768)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !15, file: !14, line: 97, baseType: !29, size: 64, align: 64, offset: 832)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !15, file: !14, line: 98, baseType: !29, size: 64, align: 64, offset: 896)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !15, file: !14, line: 99, baseType: !29, size: 64, align: 64, offset: 960)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !15, file: !14, line: 101, baseType: !29, size: 64, align: 64, offset: 1024)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !15, file: !14, line: 103, baseType: !68, size: 32, align: 32, offset: 1088)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !15, file: !14, line: 105, baseType: !29, size: 64, align: 64, offset: 1152)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !15, file: !14, line: 106, baseType: !41, size: 64, align: 64, offset: 1216)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !15, file: !14, line: 108, baseType: !68, size: 32, align: 32, offset: 1280)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !15, file: !14, line: 109, baseType: !29, size: 64, align: 64, offset: 1344)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !15, file: !14, line: 134, baseType: !355, size: 64, align: 64, offset: 1408)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !15, file: !14, line: 135, baseType: !114, size: 64, align: 64, offset: 1472)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !468, line: 33, baseType: !469)
!468 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!469 = !DICompositeType(tag: DW_TAG_structure_type, file: !468, line: 25, size: 256, align: 64, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !469, file: !468, line: 26, baseType: !47, size: 192, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !469, file: !468, line: 27, baseType: !437, size: 64, align: 64, offset: 192)
!473 = !{!474, !502, !514, !527, !540, !544, !554, !565, !568, !595, !598, !750, !756, !768, !774, !792, !796, !800, !804, !813, !818, !821, !830, !834, !838, !852, !888, !898, !905, !910, !913, !923, !926, !929, !933, !936, !954, !967, !972, !976, !980, !986, !990, !1001, !1005, !1009, !1020, !1033, !1044, !1049, !1053, !1080, !1091, !1097, !1101, !1128, !1157, !1176, !1189, !1210, !1218, !1236, !1254, !1284, !1305, !1313, !1336}
!474 = !DISubprogram(name: "_PySys_GetObjectId", scope: !1, file: !1, line: 51, type: !475, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._Py_Identifier*)* @_PySys_GetObjectId, variables: !485)
!475 = !DISubroutineType(types: !476)
!476 = !{!29, !477}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !31, line: 144, baseType: !479)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !31, line: 140, size: 192, align: 64, elements: !480)
!480 = !{!481, !483, !484}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !479, file: !31, line: 141, baseType: !482, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !479, file: !31, line: 142, baseType: !53, size: 64, align: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !479, file: !31, line: 143, baseType: !29, size: 64, align: 64, offset: 128)
!485 = !{!486, !487, !488, !495, !496, !499, !501}
!486 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !474, file: !1, line: 51, type: !477)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !474, file: !1, line: 53, type: !12)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !489, file: !1, line: 53, type: !490)
!489 = distinct !DILexicalBlock(scope: !474, file: !1, line: 53, column: 29)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !4, line: 33, baseType: !492)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !4, line: 31, size: 64, align: 64, elements: !493)
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !492, file: !4, line: 32, baseType: !114, size: 64, align: 64)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !489, file: !1, line: 53, type: !114)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !489, file: !1, line: 53, type: !497)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !114)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !489, file: !1, line: 53, type: !500)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !4, line: 29, baseType: !3)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sd", scope: !474, file: !1, line: 54, type: !29)
!502 = !DISubprogram(name: "PySys_GetObject", scope: !1, file: !1, line: 61, type: !503, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @PySys_GetObject, variables: !505)
!503 = !DISubroutineType(types: !504)
!504 = !{!29, !53}
!505 = !{!506, !507, !508, !510, !511, !512, !513}
!506 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !502, file: !1, line: 61, type: !53)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !502, file: !1, line: 63, type: !12)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !509, file: !1, line: 63, type: !490)
!509 = distinct !DILexicalBlock(scope: !502, file: !1, line: 63, column: 29)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !509, file: !1, line: 63, type: !114)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !509, file: !1, line: 63, type: !497)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !509, file: !1, line: 63, type: !500)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sd", scope: !502, file: !1, line: 64, type: !29)
!514 = !DISubprogram(name: "_PySys_SetObjectId", scope: !1, file: !1, line: 71, type: !515, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Py_Identifier*, %struct._object*)* @_PySys_SetObjectId, variables: !517)
!515 = !DISubroutineType(types: !516)
!516 = !{!68, !477, !29}
!517 = !{!518, !519, !520, !521, !523, !524, !525, !526}
!518 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !514, file: !1, line: 71, type: !477)
!519 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !514, file: !1, line: 71, type: !29)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !514, file: !1, line: 73, type: !12)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !522, file: !1, line: 73, type: !490)
!522 = distinct !DILexicalBlock(scope: !514, file: !1, line: 73, column: 29)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !522, file: !1, line: 73, type: !114)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !522, file: !1, line: 73, type: !497)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !522, file: !1, line: 73, type: !500)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sd", scope: !514, file: !1, line: 74, type: !29)
!527 = !DISubprogram(name: "PySys_SetObject", scope: !1, file: !1, line: 86, type: !528, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._object*)* @PySys_SetObject, variables: !530)
!528 = !DISubroutineType(types: !529)
!529 = !{!68, !53, !29}
!530 = !{!531, !532, !533, !534, !536, !537, !538, !539}
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !527, file: !1, line: 86, type: !53)
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !527, file: !1, line: 86, type: !29)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !527, file: !1, line: 88, type: !12)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !535, file: !1, line: 88, type: !490)
!535 = distinct !DILexicalBlock(scope: !527, file: !1, line: 88, column: 29)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !535, file: !1, line: 88, type: !114)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !535, file: !1, line: 88, type: !497)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !535, file: !1, line: 88, type: !500)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sd", scope: !527, file: !1, line: 89, type: !29)
!540 = !DISubprogram(name: "PySys_ResetWarnOptions", scope: !1, file: !1, line: 1219, type: !541, isLocal: false, isDefinition: true, scopeLine: 1220, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PySys_ResetWarnOptions, variables: !543)
!541 = !DISubroutineType(types: !542)
!542 = !{null}
!543 = !{}
!544 = !DISubprogram(name: "PySys_AddWarnOptionUnicode", scope: !1, file: !1, line: 1227, type: !61, isLocal: false, isDefinition: true, scopeLine: 1228, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @PySys_AddWarnOptionUnicode, variables: !545)
!545 = !{!546, !547, !551}
!546 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unicode", arg: 1, scope: !544, file: !1, line: 1227, type: !29)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !548, file: !1, line: 1230, type: !29)
!548 = distinct !DILexicalBlock(scope: !549, file: !1, line: 1230, column: 9)
!549 = distinct !DILexicalBlock(scope: !550, file: !1, line: 1229, column: 60)
!550 = distinct !DILexicalBlock(scope: !544, file: !1, line: 1229, column: 9)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !552, file: !1, line: 1230, type: !29)
!552 = distinct !DILexicalBlock(scope: !553, file: !1, line: 1230, column: 9)
!553 = distinct !DILexicalBlock(scope: !548, file: !1, line: 1230, column: 9)
!554 = !DISubprogram(name: "PySys_AddWarnOption", scope: !1, file: !1, line: 1239, type: !555, isLocal: false, isDefinition: true, scopeLine: 1240, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*)* @PySys_AddWarnOption, variables: !560)
!555 = !DISubroutineType(types: !556)
!556 = !{null, !557}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !120, line: 90, baseType: !68)
!560 = !{!561, !562, !563}
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !554, file: !1, line: 1239, type: !557)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unicode", scope: !554, file: !1, line: 1241, type: !29)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !564, file: !1, line: 1246, type: !29)
!564 = distinct !DILexicalBlock(scope: !554, file: !1, line: 1246, column: 5)
!565 = !DISubprogram(name: "PySys_HasWarnOptions", scope: !1, file: !1, line: 1250, type: !566, isLocal: false, isDefinition: true, scopeLine: 1251, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @PySys_HasWarnOptions, variables: !543)
!566 = !DISubroutineType(types: !567)
!567 = !{!68}
!568 = !DISubprogram(name: "PySys_AddXOption", scope: !1, file: !1, line: 1268, type: !555, isLocal: false, isDefinition: true, scopeLine: 1269, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*)* @PySys_AddXOption, variables: !569)
!569 = !{!570, !571, !572, !573, !574, !575, !577, !579, !581, !584, !586, !589, !592, !593, !594}
!570 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !568, file: !1, line: 1268, type: !557)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "opts", scope: !568, file: !1, line: 1270, type: !29)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !568, file: !1, line: 1271, type: !29)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !568, file: !1, line: 1271, type: !29)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name_end", scope: !568, file: !1, line: 1272, type: !557)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !576, file: !1, line: 1291, type: !29)
!576 = distinct !DILexicalBlock(scope: !568, file: !1, line: 1291, column: 5)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !578, file: !1, line: 1292, type: !29)
!578 = distinct !DILexicalBlock(scope: !568, file: !1, line: 1292, column: 5)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !580, file: !1, line: 1296, type: !29)
!580 = distinct !DILexicalBlock(scope: !568, file: !1, line: 1296, column: 5)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !582, file: !1, line: 1296, type: !29)
!582 = distinct !DILexicalBlock(scope: !583, file: !1, line: 1296, column: 5)
!583 = distinct !DILexicalBlock(scope: !580, file: !1, line: 1296, column: 5)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !585, file: !1, line: 1297, type: !29)
!585 = distinct !DILexicalBlock(scope: !568, file: !1, line: 1297, column: 5)
!586 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !587, file: !1, line: 1297, type: !29)
!587 = distinct !DILexicalBlock(scope: !588, file: !1, line: 1297, column: 5)
!588 = distinct !DILexicalBlock(scope: !585, file: !1, line: 1297, column: 5)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !590, file: !1, line: 1299, type: !490)
!590 = distinct !DILexicalBlock(scope: !591, file: !1, line: 1299, column: 9)
!591 = distinct !DILexicalBlock(scope: !568, file: !1, line: 1299, column: 9)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !590, file: !1, line: 1299, type: !114)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !590, file: !1, line: 1299, type: !497)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !590, file: !1, line: 1299, type: !500)
!595 = !DISubprogram(name: "PySys_GetXOptions", scope: !1, file: !1, line: 1304, type: !596, isLocal: false, isDefinition: true, scopeLine: 1305, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PySys_GetXOptions, variables: !543)
!596 = !DISubroutineType(types: !597)
!597 = !{!29}
!598 = !DISubprogram(name: "_PySys_Init", scope: !1, file: !1, line: 1622, type: !596, isLocal: false, isDefinition: true, scopeLine: 1623, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @_PySys_Init, variables: !599)
!599 = !{!600, !601, !602, !603, !604, !642, !644, !646, !648, !650, !652, !654, !656, !658, !660, !662, !664, !666, !668, !670, !672, !674, !676, !678, !680, !682, !684, !686, !688, !690, !692, !694, !696, !698, !700, !702, !704, !706, !708, !710, !712, !714, !716, !718, !720, !722, !724, !726, !728, !730, !732, !734, !736, !738, !740, !742, !744, !746, !748}
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !598, file: !1, line: 1624, type: !29)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sysdict", scope: !598, file: !1, line: 1624, type: !29)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "version_info", scope: !598, file: !1, line: 1624, type: !29)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !598, file: !1, line: 1625, type: !68)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sb", scope: !605, file: !1, line: 1660, type: !606)
!605 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1659, column: 5)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !607, line: 46, size: 1152, align: 64, elements: !608)
!607 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!608 = !{!609, !611, !613, !615, !617, !619, !621, !622, !623, !624, !626, !628, !636, !637, !638}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !606, file: !607, line: 48, baseType: !610, size: 64, align: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !40, line: 133, baseType: !121)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !606, file: !607, line: 53, baseType: !612, size: 64, align: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !40, line: 136, baseType: !121)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !606, file: !607, line: 61, baseType: !614, size: 64, align: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !40, line: 139, baseType: !121)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !606, file: !607, line: 62, baseType: !616, size: 32, align: 32, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !40, line: 138, baseType: !366)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !606, file: !607, line: 64, baseType: !618, size: 32, align: 32, offset: 224)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !40, line: 134, baseType: !366)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !606, file: !607, line: 65, baseType: !620, size: 32, align: 32, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !40, line: 135, baseType: !366)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !606, file: !607, line: 67, baseType: !68, size: 32, align: 32, offset: 288)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !606, file: !607, line: 69, baseType: !610, size: 64, align: 64, offset: 320)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !606, file: !607, line: 74, baseType: !99, size: 64, align: 64, offset: 384)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !606, file: !607, line: 78, baseType: !625, size: 64, align: 64, offset: 448)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !40, line: 162, baseType: !41)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !606, file: !607, line: 80, baseType: !627, size: 64, align: 64, offset: 512)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !40, line: 167, baseType: !41)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !606, file: !607, line: 91, baseType: !629, size: 128, align: 64, offset: 576)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !630, line: 120, size: 128, align: 64, elements: !631)
!630 = !DIFile(filename: "/usr/include/time.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!631 = !{!632, !634}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !629, file: !630, line: 122, baseType: !633, size: 64, align: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !40, line: 148, baseType: !41)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !629, file: !630, line: 123, baseType: !635, size: 64, align: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !40, line: 184, baseType: !41)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !606, file: !607, line: 92, baseType: !629, size: 128, align: 64, offset: 704)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !606, file: !607, line: 93, baseType: !629, size: 128, align: 64, offset: 832)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !606, file: !607, line: 106, baseType: !639, size: 192, align: 64, offset: 960)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !635, size: 192, align: 64, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 3)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !643, file: !1, line: 1673, type: !29)
!643 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1673, column: 5)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !645, file: !1, line: 1675, type: !29)
!645 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1675, column: 5)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !647, file: !1, line: 1677, type: !29)
!647 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1677, column: 5)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !649, file: !1, line: 1677, type: !29)
!649 = distinct !DILexicalBlock(scope: !647, file: !1, line: 1677, column: 5)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !651, file: !1, line: 1679, type: !29)
!651 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1679, column: 5)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !653, file: !1, line: 1679, type: !29)
!653 = distinct !DILexicalBlock(scope: !651, file: !1, line: 1679, column: 5)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !655, file: !1, line: 1681, type: !29)
!655 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1681, column: 5)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !657, file: !1, line: 1681, type: !29)
!657 = distinct !DILexicalBlock(scope: !655, file: !1, line: 1681, column: 5)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !659, file: !1, line: 1684, type: !29)
!659 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1684, column: 5)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !661, file: !1, line: 1684, type: !29)
!661 = distinct !DILexicalBlock(scope: !659, file: !1, line: 1684, column: 5)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !663, file: !1, line: 1686, type: !29)
!663 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1686, column: 5)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !665, file: !1, line: 1686, type: !29)
!665 = distinct !DILexicalBlock(scope: !663, file: !1, line: 1686, column: 5)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !667, file: !1, line: 1688, type: !29)
!667 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1688, column: 5)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !669, file: !1, line: 1688, type: !29)
!669 = distinct !DILexicalBlock(scope: !667, file: !1, line: 1688, column: 5)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !671, file: !1, line: 1690, type: !29)
!671 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1690, column: 5)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !673, file: !1, line: 1690, type: !29)
!673 = distinct !DILexicalBlock(scope: !671, file: !1, line: 1690, column: 5)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !675, file: !1, line: 1692, type: !29)
!675 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1692, column: 5)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !677, file: !1, line: 1692, type: !29)
!677 = distinct !DILexicalBlock(scope: !675, file: !1, line: 1692, column: 5)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !679, file: !1, line: 1695, type: !29)
!679 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1695, column: 5)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !681, file: !1, line: 1695, type: !29)
!681 = distinct !DILexicalBlock(scope: !679, file: !1, line: 1695, column: 5)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !683, file: !1, line: 1697, type: !29)
!683 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1697, column: 5)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !685, file: !1, line: 1697, type: !29)
!685 = distinct !DILexicalBlock(scope: !683, file: !1, line: 1697, column: 5)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !687, file: !1, line: 1699, type: !29)
!687 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1699, column: 5)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !689, file: !1, line: 1699, type: !29)
!689 = distinct !DILexicalBlock(scope: !687, file: !1, line: 1699, column: 5)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !691, file: !1, line: 1701, type: !29)
!691 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1701, column: 5)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !693, file: !1, line: 1701, type: !29)
!693 = distinct !DILexicalBlock(scope: !691, file: !1, line: 1701, column: 5)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !695, file: !1, line: 1703, type: !29)
!695 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1703, column: 5)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !697, file: !1, line: 1703, type: !29)
!697 = distinct !DILexicalBlock(scope: !695, file: !1, line: 1703, column: 5)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !699, file: !1, line: 1705, type: !29)
!699 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1705, column: 5)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !701, file: !1, line: 1705, type: !29)
!701 = distinct !DILexicalBlock(scope: !699, file: !1, line: 1705, column: 5)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !703, file: !1, line: 1707, type: !29)
!703 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1707, column: 5)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !705, file: !1, line: 1707, type: !29)
!705 = distinct !DILexicalBlock(scope: !703, file: !1, line: 1707, column: 5)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !707, file: !1, line: 1714, type: !29)
!707 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1714, column: 5)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !709, file: !1, line: 1714, type: !29)
!709 = distinct !DILexicalBlock(scope: !707, file: !1, line: 1714, column: 5)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !711, file: !1, line: 1716, type: !29)
!711 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1716, column: 5)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !713, file: !1, line: 1716, type: !29)
!713 = distinct !DILexicalBlock(scope: !711, file: !1, line: 1716, column: 5)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !715, file: !1, line: 1718, type: !29)
!715 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1718, column: 5)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !717, file: !1, line: 1718, type: !29)
!717 = distinct !DILexicalBlock(scope: !715, file: !1, line: 1718, column: 5)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !719, file: !1, line: 1724, type: !29)
!719 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1724, column: 5)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !721, file: !1, line: 1724, type: !29)
!721 = distinct !DILexicalBlock(scope: !719, file: !1, line: 1724, column: 5)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !723, file: !1, line: 1735, type: !29)
!723 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1735, column: 5)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !725, file: !1, line: 1735, type: !29)
!725 = distinct !DILexicalBlock(scope: !723, file: !1, line: 1735, column: 5)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !727, file: !1, line: 1746, type: !29)
!727 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1746, column: 5)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !729, file: !1, line: 1748, type: !29)
!729 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1748, column: 5)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !731, file: !1, line: 1757, type: !29)
!731 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1757, column: 5)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !733, file: !1, line: 1757, type: !29)
!733 = distinct !DILexicalBlock(scope: !731, file: !1, line: 1757, column: 5)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !735, file: !1, line: 1766, type: !29)
!735 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1766, column: 5)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !737, file: !1, line: 1766, type: !29)
!737 = distinct !DILexicalBlock(scope: !735, file: !1, line: 1766, column: 5)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !739, file: !1, line: 1773, type: !29)
!739 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1773, column: 5)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !741, file: !1, line: 1773, type: !29)
!741 = distinct !DILexicalBlock(scope: !739, file: !1, line: 1773, column: 5)
!742 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !743, file: !1, line: 1797, type: !29)
!743 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1797, column: 5)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !745, file: !1, line: 1797, type: !29)
!745 = distinct !DILexicalBlock(scope: !743, file: !1, line: 1797, column: 5)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !747, file: !1, line: 1805, type: !29)
!747 = distinct !DILexicalBlock(scope: !598, file: !1, line: 1805, column: 5)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !749, file: !1, line: 1805, type: !29)
!749 = distinct !DILexicalBlock(scope: !747, file: !1, line: 1805, column: 5)
!750 = !DISubprogram(name: "PySys_SetPath", scope: !1, file: !1, line: 1849, type: !555, isLocal: false, isDefinition: true, scopeLine: 1850, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*)* @PySys_SetPath, variables: !751)
!751 = !{!752, !753, !754}
!752 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 1, scope: !750, file: !1, line: 1849, type: !557)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !750, file: !1, line: 1851, type: !29)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !755, file: !1, line: 1856, type: !29)
!755 = distinct !DILexicalBlock(scope: !750, file: !1, line: 1856, column: 5)
!756 = !DISubprogram(name: "PySys_SetArgvEx", scope: !1, file: !1, line: 1992, type: !757, isLocal: false, isDefinition: true, scopeLine: 1993, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32**, i32)* @PySys_SetArgvEx, variables: !761)
!757 = !DISubroutineType(types: !758)
!758 = !{null, !68, !759, !68}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64, align: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64, align: 64)
!761 = !{!762, !763, !764, !765, !766}
!762 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !756, file: !1, line: 1992, type: !68)
!763 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !756, file: !1, line: 1992, type: !759)
!764 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "updatepath", arg: 3, scope: !756, file: !1, line: 1992, type: !68)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "av", scope: !756, file: !1, line: 1994, type: !29)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !767, file: !1, line: 1999, type: !29)
!767 = distinct !DILexicalBlock(scope: !756, file: !1, line: 1999, column: 5)
!768 = !DISubprogram(name: "PySys_SetArgv", scope: !1, file: !1, line: 2005, type: !769, isLocal: false, isDefinition: true, scopeLine: 2006, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32**)* @PySys_SetArgv, variables: !771)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !68, !759}
!771 = !{!772, !773}
!772 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 1, scope: !768, file: !1, line: 2005, type: !68)
!773 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !768, file: !1, line: 2005, type: !759)
!774 = !DISubprogram(name: "PySys_WriteStdout", scope: !1, file: !1, line: 2117, type: !775, isLocal: false, isDefinition: true, scopeLine: 2118, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, ...)* @PySys_WriteStdout, variables: !777)
!775 = !DISubroutineType(types: !776)
!776 = !{null, !53, null}
!777 = !{!778, !779}
!778 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 1, scope: !774, file: !1, line: 2117, type: !53)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "va", scope: !774, file: !1, line: 2119, type: !780)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !38, line: 79, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !782, line: 50, baseType: !783)
!782 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stdarg.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 2119, baseType: !784)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 192, align: 64, elements: !106)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "__va_list_tag", file: !1, line: 2119, baseType: !786)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 2119, size: 192, align: 64, elements: !787)
!787 = !{!788, !789, !790, !791}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !786, file: !1, line: 2119, baseType: !366, size: 32, align: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !786, file: !1, line: 2119, baseType: !366, size: 32, align: 32, offset: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !786, file: !1, line: 2119, baseType: !114, size: 64, align: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !786, file: !1, line: 2119, baseType: !114, size: 64, align: 64, offset: 128)
!792 = !DISubprogram(name: "PySys_WriteStderr", scope: !1, file: !1, line: 2127, type: !775, isLocal: false, isDefinition: true, scopeLine: 2128, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, ...)* @PySys_WriteStderr, variables: !793)
!793 = !{!794, !795}
!794 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 1, scope: !792, file: !1, line: 2127, type: !53)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "va", scope: !792, file: !1, line: 2129, type: !780)
!796 = !DISubprogram(name: "PySys_FormatStdout", scope: !1, file: !1, line: 2159, type: !775, isLocal: false, isDefinition: true, scopeLine: 2160, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, ...)* @PySys_FormatStdout, variables: !797)
!797 = !{!798, !799}
!798 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 1, scope: !796, file: !1, line: 2159, type: !53)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "va", scope: !796, file: !1, line: 2161, type: !780)
!800 = !DISubprogram(name: "PySys_FormatStderr", scope: !1, file: !1, line: 2169, type: !775, isLocal: false, isDefinition: true, scopeLine: 2170, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, ...)* @PySys_FormatStderr, variables: !801)
!801 = !{!802, !803}
!802 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 1, scope: !800, file: !1, line: 2169, type: !53)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "va", scope: !800, file: !1, line: 2171, type: !780)
!804 = !DISubprogram(name: "_Py_ANNOTATE_MEMORY_ORDER", scope: !4, file: !4, line: 59, type: !805, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, variables: !810)
!805 = !DISubroutineType(types: !806)
!806 = !{null, !807, !500}
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64, align: 64)
!808 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!810 = !{!811, !812}
!811 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "address", arg: 1, scope: !804, file: !4, line: 59, type: !807)
!812 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 2, scope: !804, file: !4, line: 59, type: !500)
!813 = !DISubprogram(name: "_Py_atomic_thread_fence", scope: !4, file: !4, line: 51, type: !814, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, variables: !816)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !500}
!816 = !{!817}
!817 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !813, file: !4, line: 51, type: !500)
!818 = !DISubprogram(name: "_Py_atomic_signal_fence", scope: !4, file: !4, line: 44, type: !814, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, variables: !819)
!819 = !{!820}
!820 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !818, file: !4, line: 44, type: !500)
!821 = !DISubprogram(name: "get_xoptions", scope: !1, file: !1, line: 1258, type: !596, isLocal: true, isDefinition: true, scopeLine: 1259, flags: DIFlagPrototyped, isOptimized: true, variables: !822)
!822 = !{!823, !827}
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !824, file: !1, line: 1261, type: !29)
!824 = distinct !DILexicalBlock(scope: !825, file: !1, line: 1261, column: 9)
!825 = distinct !DILexicalBlock(scope: !826, file: !1, line: 1260, column: 54)
!826 = distinct !DILexicalBlock(scope: !821, file: !1, line: 1260, column: 9)
!827 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !828, file: !1, line: 1261, type: !29)
!828 = distinct !DILexicalBlock(scope: !829, file: !1, line: 1261, column: 9)
!829 = distinct !DILexicalBlock(scope: !824, file: !1, line: 1261, column: 9)
!830 = !DISubprogram(name: "sys_clear_type_cache", scope: !1, file: !1, line: 1101, type: !151, isLocal: true, isDefinition: true, scopeLine: 1102, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @sys_clear_type_cache, variables: !831)
!831 = !{!832, !833}
!832 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !830, file: !1, line: 1101, type: !29)
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !830, file: !1, line: 1101, type: !29)
!834 = !DISubprogram(name: "sys_current_frames", scope: !1, file: !1, line: 1016, type: !151, isLocal: true, isDefinition: true, scopeLine: 1017, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @sys_current_frames, variables: !835)
!835 = !{!836, !837}
!836 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !834, file: !1, line: 1016, type: !29)
!837 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noargs", arg: 2, scope: !834, file: !1, line: 1016, type: !29)
!838 = !DISubprogram(name: "sys_displayhook", scope: !1, file: !1, line: 163, type: !151, isLocal: true, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @sys_displayhook, variables: !839)
!839 = !{!840, !841, !842, !843, !844, !846, !847, !848, !849, !850, !851}
!840 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !838, file: !1, line: 163, type: !29)
!841 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 2, scope: !838, file: !1, line: 163, type: !29)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outf", scope: !838, file: !1, line: 165, type: !29)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp", scope: !838, file: !1, line: 166, type: !21)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !845, file: !1, line: 166, type: !490)
!845 = distinct !DILexicalBlock(scope: !838, file: !1, line: 166, column: 34)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !845, file: !1, line: 166, type: !114)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !845, file: !1, line: 166, type: !497)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !845, file: !1, line: 166, type: !500)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modules", scope: !838, file: !1, line: 167, type: !29)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "builtins", scope: !838, file: !1, line: 168, type: !29)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !838, file: !1, line: 170, type: !68)
!852 = !DISubprogram(name: "sys_displayhook_unencodable", scope: !1, file: !1, line: 107, type: !222, isLocal: true, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true, variables: !853)
!853 = !{!854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !866, !870, !872, !874, !877, !881, !883, !885}
!854 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outf", arg: 1, scope: !852, file: !1, line: 107, type: !29)
!855 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 2, scope: !852, file: !1, line: 107, type: !29)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stdout_encoding", scope: !852, file: !1, line: 109, type: !29)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "encoded", scope: !852, file: !1, line: 110, type: !29)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "escaped_str", scope: !852, file: !1, line: 110, type: !29)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "repr_str", scope: !852, file: !1, line: 110, type: !29)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !852, file: !1, line: 110, type: !29)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !852, file: !1, line: 110, type: !29)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stdout_encoding_str", scope: !852, file: !1, line: 111, type: !76)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !852, file: !1, line: 112, type: !68)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !865, file: !1, line: 127, type: !29)
!865 = distinct !DILexicalBlock(scope: !852, file: !1, line: 127, column: 5)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !867, file: !1, line: 134, type: !29)
!867 = distinct !DILexicalBlock(scope: !868, file: !1, line: 134, column: 9)
!868 = distinct !DILexicalBlock(scope: !869, file: !1, line: 132, column: 17)
!869 = distinct !DILexicalBlock(scope: !852, file: !1, line: 132, column: 9)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !871, file: !1, line: 135, type: !29)
!871 = distinct !DILexicalBlock(scope: !868, file: !1, line: 135, column: 9)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !873, file: !1, line: 138, type: !29)
!873 = distinct !DILexicalBlock(scope: !868, file: !1, line: 138, column: 9)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !875, file: !1, line: 145, type: !29)
!875 = distinct !DILexicalBlock(scope: !876, file: !1, line: 145, column: 9)
!876 = distinct !DILexicalBlock(scope: !869, file: !1, line: 140, column: 10)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !878, file: !1, line: 147, type: !29)
!878 = distinct !DILexicalBlock(scope: !879, file: !1, line: 147, column: 13)
!879 = distinct !DILexicalBlock(scope: !880, file: !1, line: 146, column: 71)
!880 = distinct !DILexicalBlock(scope: !876, file: !1, line: 146, column: 13)
!881 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !882, file: !1, line: 150, type: !29)
!882 = distinct !DILexicalBlock(scope: !876, file: !1, line: 150, column: 9)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !884, file: !1, line: 158, type: !29)
!884 = distinct !DILexicalBlock(scope: !852, file: !1, line: 158, column: 5)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !886, file: !1, line: 158, type: !29)
!886 = distinct !DILexicalBlock(scope: !887, file: !1, line: 158, column: 5)
!887 = distinct !DILexicalBlock(scope: !884, file: !1, line: 158, column: 5)
!888 = !DISubprogram(name: "sys_exc_info", scope: !1, file: !1, line: 242, type: !151, isLocal: true, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @sys_exc_info, variables: !889)
!889 = !{!890, !891, !892, !893, !895, !896, !897}
!890 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !888, file: !1, line: 242, type: !29)
!891 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noargs", arg: 2, scope: !888, file: !1, line: 242, type: !29)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !888, file: !1, line: 244, type: !12)
!893 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !894, file: !1, line: 245, type: !490)
!894 = distinct !DILexicalBlock(scope: !888, file: !1, line: 245, column: 14)
!895 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !894, file: !1, line: 245, type: !114)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !894, file: !1, line: 245, type: !497)
!897 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !894, file: !1, line: 245, type: !500)
!898 = !DISubprogram(name: "sys_excepthook", scope: !1, file: !1, line: 225, type: !151, isLocal: true, isDefinition: true, scopeLine: 226, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @sys_excepthook, variables: !899)
!899 = !{!900, !901, !902, !903, !904}
!900 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !898, file: !1, line: 225, type: !29)
!901 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !898, file: !1, line: 225, type: !29)
!902 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc", scope: !898, file: !1, line: 227, type: !29)
