; ModuleID = 'textio.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyMethodDef = type { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !457, globals: !1772)
!1 = !DIFile(filename: "./Modules/_io/textio.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !101, !49, !367, !385, !393, !404, !403, !408, !407, !411, !410, !412, !414, !416, !63, !55, !41, !418, !106, !21, !431, !432, !433, !445, !453, !455, !39}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "nldecoder_object", file: !1, line: 230, baseType: !13)
!13 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 223, size: 320, align: 64, elements: !14)
!14 = !{!15, !362, !363, !364, !365, !366}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !13, file: !1, line: 224, baseType: !16, size: 128, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !17, line: 109, baseType: !18)
!17 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !17, line: 105, size: 128, align: 64, elements: !19)
!19 = !{!20, !28}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !18, file: !17, line: 107, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !22, line: 177, baseType: !23)
!22 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !24, line: 102, baseType: !25)
!24 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !26, line: 181, baseType: !27)
!26 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!27 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !18, file: !17, line: 108, baseType: !29, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !17, line: 334, size: 3200, align: 64, elements: !31)
!31 = !{!32, !38, !42, !43, !44, !50, !114, !119, !124, !125, !130, !182, !213, !225, !231, !232, !233, !235, !237, !268, !269, !270, !279, !280, !285, !286, !288, !290, !300, !310, !328, !329, !330, !332, !334, !335, !337, !342, !347, !352, !353, !354, !355, !356, !357, !358, !359, !361}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !30, file: !17, line: 335, baseType: !33, size: 192, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !17, line: 114, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 111, size: 192, align: 64, elements: !35)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !34, file: !17, line: 112, baseType: !16, size: 128, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !34, file: !17, line: 113, baseType: !21, size: 64, align: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !30, file: !17, line: 336, baseType: !39, size: 64, align: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !30, file: !17, line: 337, baseType: !21, size: 64, align: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !30, file: !17, line: 337, baseType: !21, size: 64, align: 64, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !30, file: !17, line: 341, baseType: !45, size: 64, align: 64, offset: 384)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !17, line: 308, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !49}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !30, file: !17, line: 342, baseType: !51, size: 64, align: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !17, line: 314, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !49, !56, !55}
!55 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !24, line: 48, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 246, size: 1728, align: 64, elements: !60)
!59 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!60 = !{!61, !62, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !82, !83, !84, !85, !87, !89, !91, !95, !98, !100, !102, !103, !104, !105, !109, !110}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !58, file: !59, line: 247, baseType: !55, size: 32, align: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !58, file: !59, line: 252, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !58, file: !59, line: 253, baseType: !63, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !58, file: !59, line: 254, baseType: !63, size: 64, align: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !58, file: !59, line: 255, baseType: !63, size: 64, align: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !58, file: !59, line: 256, baseType: !63, size: 64, align: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !58, file: !59, line: 257, baseType: !63, size: 64, align: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !58, file: !59, line: 258, baseType: !63, size: 64, align: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !58, file: !59, line: 259, baseType: !63, size: 64, align: 64, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !58, file: !59, line: 261, baseType: !63, size: 64, align: 64, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !58, file: !59, line: 262, baseType: !63, size: 64, align: 64, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !58, file: !59, line: 263, baseType: !63, size: 64, align: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !58, file: !59, line: 265, baseType: !75, size: 64, align: 64, offset: 768)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !59, line: 161, size: 192, align: 64, elements: !77)
!77 = !{!78, !79, !81}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !76, file: !59, line: 162, baseType: !75, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !76, file: !59, line: 163, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !76, file: !59, line: 167, baseType: !55, size: 32, align: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !58, file: !59, line: 267, baseType: !80, size: 64, align: 64, offset: 832)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !58, file: !59, line: 269, baseType: !55, size: 32, align: 32, offset: 896)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !58, file: !59, line: 273, baseType: !55, size: 32, align: 32, offset: 928)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !58, file: !59, line: 275, baseType: !86, size: 64, align: 64, offset: 960)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !26, line: 140, baseType: !27)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !58, file: !59, line: 279, baseType: !88, size: 16, align: 16, offset: 1024)
!88 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !58, file: !59, line: 280, baseType: !90, size: 8, align: 8, offset: 1040)
!90 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !58, file: !59, line: 281, baseType: !92, size: 8, align: 8, offset: 1048)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8, align: 8, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 1)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !58, file: !59, line: 285, baseType: !96, size: 64, align: 64, offset: 1088)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !59, line: 155, baseType: null)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !58, file: !59, line: 294, baseType: !99, size: 64, align: 64, offset: 1152)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !26, line: 141, baseType: !27)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !58, file: !59, line: 303, baseType: !101, size: 64, align: 64, offset: 1216)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !58, file: !59, line: 304, baseType: !101, size: 64, align: 64, offset: 1280)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !58, file: !59, line: 305, baseType: !101, size: 64, align: 64, offset: 1344)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !58, file: !59, line: 306, baseType: !101, size: 64, align: 64, offset: 1408)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !58, file: !59, line: 307, baseType: !106, size: 64, align: 64, offset: 1472)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !107, line: 62, baseType: !108)
!107 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!108 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !58, file: !59, line: 309, baseType: !55, size: 32, align: 32, offset: 1536)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !58, file: !59, line: 311, baseType: !111, size: 160, align: 8, offset: 1568)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 160, align: 8, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 20)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !30, file: !17, line: 343, baseType: !115, size: 64, align: 64, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !17, line: 316, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!49, !49, !63}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !30, file: !17, line: 344, baseType: !120, size: 64, align: 64, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !17, line: 318, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!55, !49, !63, !49}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !30, file: !17, line: 345, baseType: !101, size: 64, align: 64, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !30, file: !17, line: 346, baseType: !126, size: 64, align: 64, offset: 704)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !17, line: 320, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!49, !49}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !30, file: !17, line: 350, baseType: !131, size: 64, align: 64, offset: 768)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !17, line: 278, baseType: !133)
!133 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 236, size: 2176, align: 64, elements: !134)
!134 = !{!135, !140, !141, !142, !143, !144, !149, !151, !152, !153, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !133, file: !17, line: 241, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !17, line: 166, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!49, !49, !49}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !133, file: !17, line: 242, baseType: !136, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !133, file: !17, line: 243, baseType: !136, size: 64, align: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !133, file: !17, line: 244, baseType: !136, size: 64, align: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !133, file: !17, line: 245, baseType: !136, size: 64, align: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !133, file: !17, line: 246, baseType: !145, size: 64, align: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !17, line: 167, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!49, !49, !49, !49}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !133, file: !17, line: 247, baseType: !150, size: 64, align: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !17, line: 165, baseType: !127)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !133, file: !17, line: 248, baseType: !150, size: 64, align: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !133, file: !17, line: 249, baseType: !150, size: 64, align: 64, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !133, file: !17, line: 250, baseType: !154, size: 64, align: 64, offset: 576)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !17, line: 168, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!55, !49}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !133, file: !17, line: 251, baseType: !150, size: 64, align: 64, offset: 640)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !133, file: !17, line: 252, baseType: !136, size: 64, align: 64, offset: 704)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !133, file: !17, line: 253, baseType: !136, size: 64, align: 64, offset: 768)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !133, file: !17, line: 254, baseType: !136, size: 64, align: 64, offset: 832)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !133, file: !17, line: 255, baseType: !136, size: 64, align: 64, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !133, file: !17, line: 256, baseType: !136, size: 64, align: 64, offset: 960)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !133, file: !17, line: 257, baseType: !150, size: 64, align: 64, offset: 1024)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !133, file: !17, line: 258, baseType: !101, size: 64, align: 64, offset: 1088)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !133, file: !17, line: 259, baseType: !150, size: 64, align: 64, offset: 1152)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !133, file: !17, line: 261, baseType: !136, size: 64, align: 64, offset: 1216)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !133, file: !17, line: 262, baseType: !136, size: 64, align: 64, offset: 1280)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !133, file: !17, line: 263, baseType: !136, size: 64, align: 64, offset: 1344)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !133, file: !17, line: 264, baseType: !136, size: 64, align: 64, offset: 1408)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !133, file: !17, line: 265, baseType: !145, size: 64, align: 64, offset: 1472)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !133, file: !17, line: 266, baseType: !136, size: 64, align: 64, offset: 1536)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !133, file: !17, line: 267, baseType: !136, size: 64, align: 64, offset: 1600)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !133, file: !17, line: 268, baseType: !136, size: 64, align: 64, offset: 1664)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !133, file: !17, line: 269, baseType: !136, size: 64, align: 64, offset: 1728)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !133, file: !17, line: 270, baseType: !136, size: 64, align: 64, offset: 1792)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !133, file: !17, line: 272, baseType: !136, size: 64, align: 64, offset: 1856)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !133, file: !17, line: 273, baseType: !136, size: 64, align: 64, offset: 1920)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !133, file: !17, line: 274, baseType: !136, size: 64, align: 64, offset: 1984)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !133, file: !17, line: 275, baseType: !136, size: 64, align: 64, offset: 2048)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !133, file: !17, line: 277, baseType: !150, size: 64, align: 64, offset: 2112)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !30, file: !17, line: 351, baseType: !183, size: 64, align: 64, offset: 832)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !17, line: 292, baseType: !185)
!185 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 280, size: 640, align: 64, elements: !186)
!186 = !{!187, !192, !193, !198, !199, !200, !205, !206, !211, !212}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !185, file: !17, line: 281, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !17, line: 169, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!21, !49}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !185, file: !17, line: 282, baseType: !136, size: 64, align: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !185, file: !17, line: 283, baseType: !194, size: 64, align: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !17, line: 170, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!49, !49, !21}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !185, file: !17, line: 284, baseType: !194, size: 64, align: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !185, file: !17, line: 285, baseType: !101, size: 64, align: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !185, file: !17, line: 286, baseType: !201, size: 64, align: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !17, line: 172, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!55, !49, !21, !49}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !185, file: !17, line: 287, baseType: !101, size: 64, align: 64, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !185, file: !17, line: 288, baseType: !207, size: 64, align: 64, offset: 448)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !17, line: 231, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!55, !49, !49}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !185, file: !17, line: 290, baseType: !136, size: 64, align: 64, offset: 512)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !185, file: !17, line: 291, baseType: !194, size: 64, align: 64, offset: 576)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !30, file: !17, line: 352, baseType: !214, size: 64, align: 64, offset: 896)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !17, line: 298, baseType: !216)
!216 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 294, size: 192, align: 64, elements: !217)
!217 = !{!218, !219, !220}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !216, file: !17, line: 295, baseType: !188, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !216, file: !17, line: 296, baseType: !136, size: 64, align: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !216, file: !17, line: 297, baseType: !221, size: 64, align: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !17, line: 174, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!55, !49, !49, !49}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !30, file: !17, line: 356, baseType: !226, size: 64, align: 64, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !17, line: 321, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!230, !49}
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !22, line: 186, baseType: !21)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !30, file: !17, line: 357, baseType: !145, size: 64, align: 64, offset: 1024)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !30, file: !17, line: 358, baseType: !126, size: 64, align: 64, offset: 1088)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !30, file: !17, line: 359, baseType: !234, size: 64, align: 64, offset: 1152)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !17, line: 317, baseType: !137)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !30, file: !17, line: 360, baseType: !236, size: 64, align: 64, offset: 1216)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !17, line: 319, baseType: !222)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !30, file: !17, line: 363, baseType: !238, size: 64, align: 64, offset: 1280)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !17, line: 304, baseType: !240)
!240 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 301, size: 128, align: 64, elements: !241)
!241 = !{!242, !263}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !240, file: !17, line: 302, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !17, line: 193, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!55, !49, !247, !55}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !17, line: 191, baseType: !249)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !17, line: 178, size: 640, align: 64, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258, !260, !261, !262}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !249, file: !17, line: 179, baseType: !101, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !249, file: !17, line: 180, baseType: !49, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !249, file: !17, line: 181, baseType: !21, size: 64, align: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !249, file: !17, line: 182, baseType: !21, size: 64, align: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !249, file: !17, line: 184, baseType: !55, size: 32, align: 32, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !249, file: !17, line: 185, baseType: !55, size: 32, align: 32, offset: 288)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !249, file: !17, line: 186, baseType: !63, size: 64, align: 64, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !249, file: !17, line: 187, baseType: !259, size: 64, align: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !249, file: !17, line: 188, baseType: !259, size: 64, align: 64, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !249, file: !17, line: 189, baseType: !259, size: 64, align: 64, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !249, file: !17, line: 190, baseType: !101, size: 64, align: 64, offset: 576)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !240, file: !17, line: 303, baseType: !264, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !17, line: 194, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !49, !247}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !30, file: !17, line: 366, baseType: !108, size: 64, align: 64, offset: 1344)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !30, file: !17, line: 368, baseType: !39, size: 64, align: 64, offset: 1408)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !30, file: !17, line: 372, baseType: !271, size: 64, align: 64, offset: 1472)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !17, line: 233, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!55, !49, !275, !101}
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !17, line: 232, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!55, !49, !101}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !30, file: !17, line: 375, baseType: !154, size: 64, align: 64, offset: 1536)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !30, file: !17, line: 379, baseType: !281, size: 64, align: 64, offset: 1600)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !17, line: 322, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!49, !49, !49, !55}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !30, file: !17, line: 382, baseType: !21, size: 64, align: 64, offset: 1664)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !30, file: !17, line: 385, baseType: !287, size: 64, align: 64, offset: 1728)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !17, line: 323, baseType: !127)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !30, file: !17, line: 386, baseType: !289, size: 64, align: 64, offset: 1792)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !17, line: 324, baseType: !127)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !30, file: !17, line: 389, baseType: !291, size: 64, align: 64, offset: 1856)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !293, line: 40, size: 256, align: 64, elements: !294)
!293 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!294 = !{!295, !296, !298, !299}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !292, file: !293, line: 41, baseType: !39, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !292, file: !293, line: 42, baseType: !297, size: 64, align: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !293, line: 18, baseType: !137)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !292, file: !293, line: 43, baseType: !55, size: 32, align: 32, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !292, file: !293, line: 45, baseType: !39, size: 64, align: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !30, file: !17, line: 390, baseType: !301, size: 64, align: 64, offset: 1920)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !303, line: 18, size: 320, align: 64, elements: !304)
!303 = !DIFile(filename: "Include/structmember.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!304 = !{!305, !306, !307, !308, !309}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !302, file: !303, line: 19, baseType: !63, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !302, file: !303, line: 20, baseType: !55, size: 32, align: 32, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !302, file: !303, line: 21, baseType: !21, size: 64, align: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !302, file: !303, line: 22, baseType: !55, size: 32, align: 32, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !302, file: !303, line: 23, baseType: !63, size: 64, align: 64, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !30, file: !17, line: 391, baseType: !311, size: 64, align: 64, offset: 1984)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !313, line: 11, size: 320, align: 64, elements: !314)
!313 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!314 = !{!315, !316, !321, !326, !327}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !312, file: !313, line: 12, baseType: !63, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !312, file: !313, line: 13, baseType: !317, size: 64, align: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !313, line: 8, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!49, !49, !101}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !312, file: !313, line: 14, baseType: !322, size: 64, align: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !313, line: 9, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!55, !49, !49, !101}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !312, file: !313, line: 15, baseType: !63, size: 64, align: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !312, file: !313, line: 16, baseType: !101, size: 64, align: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !30, file: !17, line: 392, baseType: !29, size: 64, align: 64, offset: 2048)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !30, file: !17, line: 393, baseType: !49, size: 64, align: 64, offset: 2112)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !30, file: !17, line: 394, baseType: !331, size: 64, align: 64, offset: 2176)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !17, line: 325, baseType: !146)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !30, file: !17, line: 395, baseType: !333, size: 64, align: 64, offset: 2240)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !17, line: 326, baseType: !222)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !30, file: !17, line: 396, baseType: !21, size: 64, align: 64, offset: 2304)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !30, file: !17, line: 397, baseType: !336, size: 64, align: 64, offset: 2368)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !17, line: 327, baseType: !222)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !30, file: !17, line: 398, baseType: !338, size: 64, align: 64, offset: 2432)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !17, line: 329, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!49, !29, !21}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !30, file: !17, line: 399, baseType: !343, size: 64, align: 64, offset: 2496)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !17, line: 328, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!49, !29, !49, !49}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !30, file: !17, line: 400, baseType: !348, size: 64, align: 64, offset: 2560)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !17, line: 307, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !101}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !30, file: !17, line: 401, baseType: !154, size: 64, align: 64, offset: 2624)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !30, file: !17, line: 402, baseType: !49, size: 64, align: 64, offset: 2688)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !30, file: !17, line: 403, baseType: !49, size: 64, align: 64, offset: 2752)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !30, file: !17, line: 404, baseType: !49, size: 64, align: 64, offset: 2816)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !30, file: !17, line: 405, baseType: !49, size: 64, align: 64, offset: 2880)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !30, file: !17, line: 406, baseType: !49, size: 64, align: 64, offset: 2944)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !30, file: !17, line: 407, baseType: !45, size: 64, align: 64, offset: 3008)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !30, file: !17, line: 410, baseType: !360, size: 32, align: 32, offset: 3072)
!360 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !30, file: !17, line: 412, baseType: !45, size: 64, align: 64, offset: 3136)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "decoder", scope: !13, file: !1, line: 225, baseType: !49, size: 64, align: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "errors", scope: !13, file: !1, line: 226, baseType: !49, size: 64, align: 64, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pendingcr", scope: !13, file: !1, line: 227, baseType: !55, size: 1, align: 32, offset: 256)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !13, file: !1, line: 228, baseType: !55, size: 1, align: 32, offset: 257)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "seennl", scope: !13, file: !1, line: 229, baseType: !360, size: 3, align: 32, offset: 258)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !369)
!369 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !370)
!370 = !{!371, !372, !373, !374, !382}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !369, file: !4, line: 291, baseType: !16, size: 128, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !369, file: !4, line: 292, baseType: !21, size: 64, align: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !369, file: !4, line: 293, baseType: !230, size: 64, align: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !369, file: !4, line: 349, baseType: !375, size: 32, align: 32, offset: 256)
!375 = !DICompositeType(tag: DW_TAG_structure_type, scope: !369, file: !4, line: 294, size: 32, align: 32, elements: !376)
!376 = !{!377, !378, !379, !380, !381}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !375, file: !4, line: 303, baseType: !360, size: 2, align: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !375, file: !4, line: 331, baseType: !360, size: 3, align: 32, offset: 2)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !375, file: !4, line: 336, baseType: !360, size: 1, align: 32, offset: 5)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !375, file: !4, line: 340, baseType: !360, size: 1, align: 32, offset: 6)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !375, file: !4, line: 345, baseType: !360, size: 1, align: 32, offset: 7)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !369, file: !4, line: 350, baseType: !383, size: 64, align: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !107, line: 90, baseType: !55)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !387)
!387 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !388)
!388 = !{!389, !390, !391, !392}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !387, file: !4, line: 357, baseType: !368, size: 384, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !387, file: !4, line: 358, baseType: !21, size: 64, align: 64, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !387, file: !4, line: 360, baseType: !63, size: 64, align: 64, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !387, file: !4, line: 361, baseType: !21, size: 64, align: 64, offset: 512)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !395)
!395 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !396)
!396 = !{!397, !398}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !395, file: !4, line: 369, baseType: !386, size: 576, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !395, file: !4, line: 375, baseType: !399, size: 64, align: 64, offset: 576)
!399 = !DICompositeType(tag: DW_TAG_union_type, scope: !395, file: !4, line: 370, size: 64, align: 64, elements: !400)
!400 = !{!401, !402, !406, !409}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !399, file: !4, line: 371, baseType: !101, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !399, file: !4, line: 372, baseType: !403, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !405)
!405 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !399, file: !4, line: 373, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !88)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !399, file: !4, line: 374, baseType: !410, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !360)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !404)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !411)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !420, line: 253, baseType: !421)
!420 = !DIFile(filename: "Include/objimpl.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!421 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !420, line: 246, size: 192, align: 64, elements: !422)
!422 = !{!423, !430}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !421, file: !420, line: 251, baseType: !424, size: 192, align: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, scope: !421, file: !420, line: 247, size: 192, align: 64, elements: !425)
!425 = !{!426, !428, !429}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !424, file: !420, line: 248, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !424, file: !420, line: 249, baseType: !427, size: 64, align: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !424, file: !420, line: 250, baseType: !21, size: 64, align: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !421, file: !420, line: 252, baseType: !431, size: 64, align: 64)
!431 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLongObject", file: !435, line: 10, baseType: !436)
!435 = !DIFile(filename: "Include/longobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "_longobject", file: !437, line: 89, size: 256, align: 64, elements: !438)
!437 = !DIFile(filename: "Include/longintrepr.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !436, file: !437, line: 90, baseType: !33, size: 192, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ob_digit", scope: !436, file: !437, line: 91, baseType: !441, size: 32, align: 32, offset: 192)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 32, align: 32, elements: !93)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit", file: !437, line: 49, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !444, line: 51, baseType: !360)
!444 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !447, line: 41, baseType: !448)
!447 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!448 = !DICompositeType(tag: DW_TAG_structure_type, file: !447, line: 31, size: 320, align: 64, elements: !449)
!449 = !{!450, !451, !452}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !448, file: !447, line: 32, baseType: !33, size: 192, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !448, file: !447, line: 33, baseType: !230, size: 64, align: 64, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !448, file: !447, line: 34, baseType: !92, size: 8, align: 8, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!457 = !{!458, !518, !553, !556, !570, !574, !578, !582, !586, !590, !594, !605, !622, !635, !653, !659, !663, !669, !683, !691, !740, !805, !829, !880, !889, !909, !1014, !1020, !1038, !1095, !1107, !1114, !1169, !1231, !1237, !1242, !1255, !1295, !1299, !1303, !1307, !1311, !1315, !1319, !1400, !1418, !1427, !1434, !1512, !1518, !1526, !1530, !1535, !1539, !1543, !1551, !1736, !1740, !1744, !1748, !1752, !1756, !1760, !1764, !1768}
!458 = !DISubprogram(name: "_PyIncrementalNewlineDecoder_decode", scope: !1, file: !1, line: 298, type: !283, isLocal: false, isDefinition: true, scopeLine: 300, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @_PyIncrementalNewlineDecoder_decode, variables: !459)
!459 = !{!460, !461, !462, !463, !464, !465, !466, !469, !470, !471, !473, !478, !480, !482, !483, !484, !485, !486, !493, !497, !500, !504, !506, !507, !508, !509, !510, !514, !516}
!460 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "myself", arg: 1, scope: !458, file: !1, line: 298, type: !49)
!461 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 2, scope: !458, file: !1, line: 299, type: !49)
!462 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "final", arg: 3, scope: !458, file: !1, line: 299, type: !55)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "output", scope: !458, file: !1, line: 301, type: !49)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "output_len", scope: !458, file: !1, line: 302, type: !21)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !458, file: !1, line: 303, type: !11)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !467, file: !1, line: 327, type: !55)
!467 = distinct !DILexicalBlock(scope: !468, file: !1, line: 325, column: 55)
!468 = distinct !DILexicalBlock(scope: !458, file: !1, line: 325, column: 9)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modified", scope: !467, file: !1, line: 328, type: !49)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !467, file: !1, line: 329, type: !63)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !472, file: !1, line: 339, type: !49)
!472 = distinct !DILexicalBlock(scope: !467, file: !1, line: 339, column: 9)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modified", scope: !474, file: !1, line: 352, type: !49)
!474 = distinct !DILexicalBlock(scope: !475, file: !1, line: 351, column: 9)
!475 = distinct !DILexicalBlock(scope: !476, file: !1, line: 349, column: 13)
!476 = distinct !DILexicalBlock(scope: !477, file: !1, line: 348, column: 17)
!477 = distinct !DILexicalBlock(scope: !458, file: !1, line: 348, column: 9)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !479, file: !1, line: 355, type: !49)
!479 = distinct !DILexicalBlock(scope: !474, file: !1, line: 355, column: 13)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in_str", scope: !481, file: !1, line: 364, type: !101)
!481 = distinct !DILexicalBlock(scope: !458, file: !1, line: 363, column: 5)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !481, file: !1, line: 365, type: !21)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seennl", scope: !481, file: !1, line: 366, type: !55)
!484 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "only_lf", scope: !481, file: !1, line: 367, type: !55)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !481, file: !1, line: 368, type: !55)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !487, file: !1, line: 393, type: !21)
!487 = distinct !DILexicalBlock(scope: !488, file: !1, line: 392, column: 22)
!488 = distinct !DILexicalBlock(scope: !489, file: !1, line: 390, column: 21)
!489 = distinct !DILexicalBlock(scope: !490, file: !1, line: 389, column: 59)
!490 = distinct !DILexicalBlock(scope: !491, file: !1, line: 388, column: 17)
!491 = distinct !DILexicalBlock(scope: !492, file: !1, line: 384, column: 22)
!492 = distinct !DILexicalBlock(scope: !481, file: !1, line: 384, column: 13)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !494, file: !1, line: 395, type: !411)
!494 = distinct !DILexicalBlock(scope: !495, file: !1, line: 394, column: 30)
!495 = distinct !DILexicalBlock(scope: !496, file: !1, line: 394, column: 21)
!496 = distinct !DILexicalBlock(scope: !487, file: !1, line: 394, column: 21)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !498, file: !1, line: 413, type: !21)
!498 = distinct !DILexicalBlock(scope: !499, file: !1, line: 412, column: 36)
!499 = distinct !DILexicalBlock(scope: !492, file: !1, line: 412, column: 18)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !501, file: !1, line: 418, type: !411)
!501 = distinct !DILexicalBlock(scope: !502, file: !1, line: 417, column: 22)
!502 = distinct !DILexicalBlock(scope: !503, file: !1, line: 417, column: 13)
!503 = distinct !DILexicalBlock(scope: !498, file: !1, line: 417, column: 13)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "translated", scope: !505, file: !1, line: 442, type: !101)
!505 = distinct !DILexicalBlock(scope: !499, file: !1, line: 441, column: 14)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !505, file: !1, line: 443, type: !55)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in_str", scope: !505, file: !1, line: 444, type: !101)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !505, file: !1, line: 445, type: !21)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !505, file: !1, line: 445, type: !21)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !511, file: !1, line: 459, type: !411)
!511 = distinct !DILexicalBlock(scope: !512, file: !1, line: 458, column: 22)
!512 = distinct !DILexicalBlock(scope: !513, file: !1, line: 458, column: 13)
!513 = distinct !DILexicalBlock(scope: !505, file: !1, line: 458, column: 13)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !515, file: !1, line: 482, type: !49)
!515 = distinct !DILexicalBlock(scope: !505, file: !1, line: 482, column: 13)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !517, file: !1, line: 494, type: !49)
!517 = distinct !DILexicalBlock(scope: !458, file: !1, line: 494, column: 5)
!518 = !DISubprogram(name: "_PyIO_find_line_ending", scope: !1, file: !1, line: 1681, type: !519, isLocal: false, isDefinition: true, scopeLine: 1684, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i32, i32, %struct._object*, i32, i8*, i8*, i64*)* @_PyIO_find_line_ending, variables: !521)
!519 = !DISubroutineType(types: !520)
!520 = !{!21, !55, !55, !49, !55, !63, !63, !259}
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530, !533, !536, !540, !542, !543, !546, !548, !549, !550, !552}
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "translated", arg: 1, scope: !518, file: !1, line: 1682, type: !55)
!523 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "universal", arg: 2, scope: !518, file: !1, line: 1682, type: !55)
!524 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "readnl", arg: 3, scope: !518, file: !1, line: 1682, type: !49)
!525 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kind", arg: 4, scope: !518, file: !1, line: 1683, type: !55)
!526 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 5, scope: !518, file: !1, line: 1683, type: !63)
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 6, scope: !518, file: !1, line: 1683, type: !63)
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "consumed", arg: 7, scope: !518, file: !1, line: 1683, type: !259)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !518, file: !1, line: 1685, type: !21)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !531, file: !1, line: 1689, type: !63)
!531 = distinct !DILexicalBlock(scope: !532, file: !1, line: 1687, column: 21)
!532 = distinct !DILexicalBlock(scope: !518, file: !1, line: 1687, column: 9)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !534, file: !1, line: 1701, type: !63)
!534 = distinct !DILexicalBlock(scope: !535, file: !1, line: 1697, column: 25)
!535 = distinct !DILexicalBlock(scope: !532, file: !1, line: 1697, column: 14)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch", scope: !537, file: !1, line: 1703, type: !411)
!537 = distinct !DILexicalBlock(scope: !538, file: !1, line: 1702, column: 18)
!538 = distinct !DILexicalBlock(scope: !539, file: !1, line: 1702, column: 9)
!539 = distinct !DILexicalBlock(scope: !534, file: !1, line: 1702, column: 9)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "readnl_len", scope: !541, file: !1, line: 1726, type: !21)
!541 = distinct !DILexicalBlock(scope: !535, file: !1, line: 1724, column: 10)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nl", scope: !541, file: !1, line: 1727, type: !63)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !544, file: !1, line: 1731, type: !63)
!544 = distinct !DILexicalBlock(scope: !545, file: !1, line: 1730, column: 30)
!545 = distinct !DILexicalBlock(scope: !541, file: !1, line: 1730, column: 13)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !547, file: !1, line: 1738, type: !63)
!547 = distinct !DILexicalBlock(scope: !545, file: !1, line: 1737, column: 14)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !547, file: !1, line: 1739, type: !63)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !547, file: !1, line: 1740, type: !63)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !551, file: !1, line: 1744, type: !21)
!551 = distinct !DILexicalBlock(scope: !547, file: !1, line: 1743, column: 27)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !551, file: !1, line: 1745, type: !63)
!553 = !DISubprogram(name: "textiobase_detach", scope: !1, file: !1, line: 62, type: !128, isLocal: true, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @textiobase_detach, variables: !554)
!554 = !{!555}
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !553, file: !1, line: 62, type: !49)
!556 = !DISubprogram(name: "_unsupported", scope: !1, file: !1, line: 46, type: !557, isLocal: true, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: true, variables: !559)
!557 = !DISubroutineType(types: !558)
!558 = !{!49, !39}
!559 = !{!560, !561}
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "message", arg: 1, scope: !556, file: !1, line: 46, type: !39)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !556, file: !1, line: 48, type: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyIO_State", file: !564, line: 135, baseType: !565)
!564 = !DIFile(filename: "./Modules/_io/_iomodule.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!565 = !DICompositeType(tag: DW_TAG_structure_type, file: !564, line: 130, size: 192, align: 64, elements: !566)
!566 = !{!567, !568, !569}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !565, file: !564, line: 131, baseType: !55, size: 32, align: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "locale_module", scope: !565, file: !564, line: 132, baseType: !49, size: 64, align: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "unsupported_operation", scope: !565, file: !564, line: 134, baseType: !49, size: 64, align: 64, offset: 128)
!570 = !DISubprogram(name: "textiobase_read", scope: !1, file: !1, line: 75, type: !138, isLocal: true, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @textiobase_read, variables: !571)
!571 = !{!572, !573}
!572 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !570, file: !1, line: 75, type: !49)
!573 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !570, file: !1, line: 75, type: !49)
!574 = !DISubprogram(name: "textiobase_readline", scope: !1, file: !1, line: 87, type: !138, isLocal: true, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @textiobase_readline, variables: !575)
!575 = !{!576, !577}
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !574, file: !1, line: 87, type: !49)
!577 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !574, file: !1, line: 87, type: !49)
!578 = !DISubprogram(name: "textiobase_write", scope: !1, file: !1, line: 99, type: !138, isLocal: true, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @textiobase_write, variables: !579)
!579 = !{!580, !581}
!580 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !578, file: !1, line: 99, type: !49)
!581 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !578, file: !1, line: 99, type: !49)
!582 = !DISubprogram(name: "textiobase_encoding_get", scope: !1, file: !1, line: 111, type: !319, isLocal: true, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*)* @textiobase_encoding_get, variables: !583)
!583 = !{!584, !585}
!584 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !582, file: !1, line: 111, type: !49)
!585 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "context", arg: 2, scope: !582, file: !1, line: 111, type: !101)
!586 = !DISubprogram(name: "textiobase_newlines_get", scope: !1, file: !1, line: 125, type: !319, isLocal: true, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*)* @textiobase_newlines_get, variables: !587)
!587 = !{!588, !589}
!588 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !586, file: !1, line: 125, type: !49)
!589 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "context", arg: 2, scope: !586, file: !1, line: 125, type: !101)
!590 = !DISubprogram(name: "textiobase_errors_get", scope: !1, file: !1, line: 137, type: !319, isLocal: true, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*)* @textiobase_errors_get, variables: !591)
!591 = !{!592, !593}
!592 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !590, file: !1, line: 137, type: !49)
!593 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "context", arg: 2, scope: !590, file: !1, line: 137, type: !101)
!594 = !DISubprogram(name: "check_decoded", scope: !1, file: !1, line: 274, type: !156, isLocal: true, isDefinition: true, scopeLine: 275, flags: DIFlagPrototyped, isOptimized: true, variables: !595)
!595 = !{!596, !597, !601}
!596 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "decoded", arg: 1, scope: !594, file: !1, line: 274, type: !49)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !598, file: !1, line: 282, type: !49)
!598 = distinct !DILexicalBlock(scope: !599, file: !1, line: 282, column: 9)
!599 = distinct !DILexicalBlock(scope: !600, file: !1, line: 278, column: 36)
!600 = distinct !DILexicalBlock(scope: !594, file: !1, line: 278, column: 9)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !602, file: !1, line: 286, type: !49)
!602 = distinct !DILexicalBlock(scope: !603, file: !1, line: 286, column: 9)
!603 = distinct !DILexicalBlock(scope: !604, file: !1, line: 285, column: 39)
!604 = distinct !DILexicalBlock(scope: !594, file: !1, line: 285, column: 9)
!605 = !DISubprogram(name: "incrementalnewlinedecoder_dealloc", scope: !1, file: !1, line: 266, type: !606, isLocal: true, isDefinition: true, scopeLine: 267, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.nldecoder_object*)* @incrementalnewlinedecoder_dealloc, variables: !608)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !11}
!608 = !{!609, !610, !612, !616, !618}
!609 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !605, file: !1, line: 266, type: !11)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !611, file: !1, line: 268, type: !49)
!611 = distinct !DILexicalBlock(scope: !605, file: !1, line: 268, column: 5)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !613, file: !1, line: 268, type: !49)
!613 = distinct !DILexicalBlock(scope: !614, file: !1, line: 268, column: 5)
!614 = distinct !DILexicalBlock(scope: !615, file: !1, line: 268, column: 5)
!615 = distinct !DILexicalBlock(scope: !611, file: !1, line: 268, column: 5)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !617, file: !1, line: 269, type: !49)
!617 = distinct !DILexicalBlock(scope: !605, file: !1, line: 269, column: 5)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !619, file: !1, line: 269, type: !49)
!619 = distinct !DILexicalBlock(scope: !620, file: !1, line: 269, column: 5)
!620 = distinct !DILexicalBlock(scope: !621, file: !1, line: 269, column: 5)
!621 = distinct !DILexicalBlock(scope: !617, file: !1, line: 269, column: 5)
!622 = !DISubprogram(name: "incrementalnewlinedecoder_decode", scope: !1, file: !1, line: 499, type: !623, isLocal: true, isDefinition: true, scopeLine: 501, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.nldecoder_object*, %struct._object*, %struct._object*)* @incrementalnewlinedecoder_decode, variables: !625)
!623 = !DISubroutineType(types: !624)
!624 = !{!49, !11, !49, !49}
!625 = !{!626, !627, !628, !629, !633, !634}
!626 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !622, file: !1, line: 499, type: !11)
!627 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !622, file: !1, line: 500, type: !49)
!628 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !622, file: !1, line: 500, type: !49)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kwlist", scope: !622, file: !1, line: 502, type: !630)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 192, align: 64, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 3)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "input", scope: !622, file: !1, line: 503, type: !49)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "final", scope: !622, file: !1, line: 504, type: !55)
!635 = !DISubprogram(name: "incrementalnewlinedecoder_getstate", scope: !1, file: !1, line: 513, type: !636, isLocal: true, isDefinition: true, scopeLine: 514, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.nldecoder_object*, %struct._object*)* @incrementalnewlinedecoder_getstate, variables: !638)
!636 = !DISubroutineType(types: !637)
!637 = !{!49, !11, !49}
!638 = !{!639, !640, !641, !642, !644, !647, !651}
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !635, file: !1, line: 513, type: !11)
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !635, file: !1, line: 513, type: !49)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !635, file: !1, line: 515, type: !49)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flag", scope: !635, file: !1, line: 516, type: !643)
!643 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !645, file: !1, line: 519, type: !49)
!645 = distinct !DILexicalBlock(scope: !646, file: !1, line: 518, column: 35)
!646 = distinct !DILexicalBlock(scope: !635, file: !1, line: 518, column: 9)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !648, file: !1, line: 524, type: !49)
!648 = distinct !DILexicalBlock(scope: !649, file: !1, line: 524, column: 13)
!649 = distinct !DILexicalBlock(scope: !650, file: !1, line: 523, column: 58)
!650 = distinct !DILexicalBlock(scope: !645, file: !1, line: 523, column: 13)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !652, file: !1, line: 528, type: !49)
!652 = distinct !DILexicalBlock(scope: !645, file: !1, line: 528, column: 9)
!653 = !DISubprogram(name: "incrementalnewlinedecoder_setstate", scope: !1, file: !1, line: 541, type: !636, isLocal: true, isDefinition: true, scopeLine: 542, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.nldecoder_object*, %struct._object*)* @incrementalnewlinedecoder_setstate, variables: !654)
!654 = !{!655, !656, !657, !658}
!655 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !653, file: !1, line: 541, type: !11)
!656 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 2, scope: !653, file: !1, line: 541, type: !49)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !653, file: !1, line: 543, type: !49)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flag", scope: !653, file: !1, line: 544, type: !643)
!659 = !DISubprogram(name: "incrementalnewlinedecoder_reset", scope: !1, file: !1, line: 560, type: !636, isLocal: true, isDefinition: true, scopeLine: 561, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.nldecoder_object*, %struct._object*)* @incrementalnewlinedecoder_reset, variables: !660)
!660 = !{!661, !662}
!661 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !659, file: !1, line: 560, type: !11)
!662 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !659, file: !1, line: 560, type: !49)
!663 = !DISubprogram(name: "incrementalnewlinedecoder_newlines_get", scope: !1, file: !1, line: 571, type: !664, isLocal: true, isDefinition: true, scopeLine: 572, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.nldecoder_object*, i8*)* @incrementalnewlinedecoder_newlines_get, variables: !666)
!664 = !DISubroutineType(types: !665)
!665 = !{!49, !11, !101}
!666 = !{!667, !668}
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !663, file: !1, line: 571, type: !11)
!668 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "context", arg: 2, scope: !663, file: !1, line: 571, type: !101)
!669 = !DISubprogram(name: "incrementalnewlinedecoder_init", scope: !1, file: !1, line: 233, type: !670, isLocal: true, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.nldecoder_object*, %struct._object*, %struct._object*)* @incrementalnewlinedecoder_init, variables: !672)
!670 = !DISubroutineType(types: !671)
!671 = !{!55, !11, !49, !49}
!672 = !{!673, !674, !675, !676, !677, !678, !679}
!673 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !669, file: !1, line: 233, type: !11)
!674 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !669, file: !1, line: 234, type: !49)
!675 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !669, file: !1, line: 234, type: !49)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoder", scope: !669, file: !1, line: 236, type: !49)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "translate", scope: !669, file: !1, line: 237, type: !55)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !669, file: !1, line: 238, type: !49)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kwlist", scope: !669, file: !1, line: 239, type: !680)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 256, align: 64, elements: !681)
!681 = !{!682}
!682 = !DISubrange(count: 4)
!683 = !DISubprogram(name: "find_control_char", scope: !1, file: !1, line: 1663, type: !684, isLocal: true, isDefinition: true, scopeLine: 1664, flags: DIFlagPrototyped, isOptimized: true, variables: !686)
!684 = !DISubroutineType(types: !685)
!685 = !{!63, !55, !63, !63, !411}
!686 = !{!687, !688, !689, !690}
!687 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kind", arg: 1, scope: !683, file: !1, line: 1663, type: !55)
!688 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 2, scope: !683, file: !1, line: 1663, type: !63)
!689 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 3, scope: !683, file: !1, line: 1663, type: !63)
!690 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ch", arg: 4, scope: !683, file: !1, line: 1663, type: !411)
!691 = !DISubprogram(name: "textiowrapper_dealloc", scope: !1, file: !1, line: 1150, type: !692, isLocal: true, isDefinition: true, scopeLine: 1151, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.textio*)* @textiowrapper_dealloc, variables: !730)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !694}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "textio", file: !1, line: 743, baseType: !696)
!696 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 686, size: 1536, align: 64, elements: !697)
!697 = !{!698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !696, file: !1, line: 688, baseType: !16, size: 128, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !696, file: !1, line: 689, baseType: !55, size: 32, align: 32, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !696, file: !1, line: 690, baseType: !55, size: 32, align: 32, offset: 160)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !696, file: !1, line: 691, baseType: !21, size: 64, align: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !696, file: !1, line: 692, baseType: !49, size: 64, align: 64, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !696, file: !1, line: 693, baseType: !49, size: 64, align: 64, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "encoder", scope: !696, file: !1, line: 694, baseType: !49, size: 64, align: 64, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "decoder", scope: !696, file: !1, line: 695, baseType: !49, size: 64, align: 64, offset: 448)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "readnl", scope: !696, file: !1, line: 696, baseType: !49, size: 64, align: 64, offset: 512)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "errors", scope: !696, file: !1, line: 697, baseType: !49, size: 64, align: 64, offset: 576)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "writenl", scope: !696, file: !1, line: 698, baseType: !39, size: 64, align: 64, offset: 640)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "line_buffering", scope: !696, file: !1, line: 699, baseType: !41, size: 8, align: 8, offset: 704)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "write_through", scope: !696, file: !1, line: 700, baseType: !41, size: 8, align: 8, offset: 712)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "readuniversal", scope: !696, file: !1, line: 701, baseType: !41, size: 8, align: 8, offset: 720)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "readtranslate", scope: !696, file: !1, line: 702, baseType: !41, size: 8, align: 8, offset: 728)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "writetranslate", scope: !696, file: !1, line: 703, baseType: !41, size: 8, align: 8, offset: 736)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !696, file: !1, line: 704, baseType: !41, size: 8, align: 8, offset: 744)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "has_read1", scope: !696, file: !1, line: 705, baseType: !41, size: 8, align: 8, offset: 752)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "telling", scope: !696, file: !1, line: 706, baseType: !41, size: 8, align: 8, offset: 760)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "finalizing", scope: !696, file: !1, line: 707, baseType: !41, size: 8, align: 8, offset: 768)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "encodefunc", scope: !696, file: !1, line: 709, baseType: !719, size: 64, align: 64, offset: 832)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "encodefunc_t", file: !1, line: 684, baseType: !137)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "encoding_start_of_stream", scope: !696, file: !1, line: 711, baseType: !41, size: 8, align: 8, offset: 896)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "decoded_chars", scope: !696, file: !1, line: 722, baseType: !49, size: 64, align: 64, offset: 960)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "decoded_chars_used", scope: !696, file: !1, line: 723, baseType: !21, size: 64, align: 64, offset: 1024)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "pending_bytes", scope: !696, file: !1, line: 724, baseType: !49, size: 64, align: 64, offset: 1088)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "pending_bytes_count", scope: !696, file: !1, line: 726, baseType: !21, size: 64, align: 64, offset: 1152)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "snapshot", scope: !696, file: !1, line: 733, baseType: !49, size: 64, align: 64, offset: 1216)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "b2cratio", scope: !696, file: !1, line: 736, baseType: !431, size: 64, align: 64, offset: 1280)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !696, file: !1, line: 739, baseType: !49, size: 64, align: 64, offset: 1344)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !696, file: !1, line: 741, baseType: !49, size: 64, align: 64, offset: 1408)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !696, file: !1, line: 742, baseType: !49, size: 64, align: 64, offset: 1472)
!730 = !{!731, !732, !734, !736}
!731 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !691, file: !1, line: 1150, type: !694)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !733, file: !1, line: 1156, type: !418)
!733 = distinct !DILexicalBlock(scope: !691, file: !1, line: 1156, column: 5)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !735, file: !1, line: 1159, type: !49)
!735 = distinct !DILexicalBlock(scope: !691, file: !1, line: 1159, column: 5)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !737, file: !1, line: 1159, type: !49)
!737 = distinct !DILexicalBlock(scope: !738, file: !1, line: 1159, column: 5)
!738 = distinct !DILexicalBlock(scope: !739, file: !1, line: 1159, column: 5)
!739 = distinct !DILexicalBlock(scope: !735, file: !1, line: 1159, column: 5)
!740 = !DISubprogram(name: "_textiowrapper_clear", scope: !1, file: !1, line: 1133, type: !741, isLocal: true, isDefinition: true, scopeLine: 1134, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.textio*)* @_textiowrapper_clear, variables: !743)
!741 = !DISubroutineType(types: !742)
!742 = !{!55, !694}
!743 = !{!744, !745, !747, !751, !753, !757, !759, !763, !765, !769, !771, !775, !777, !781, !783, !787, !789, !793, !795, !799, !801}
!744 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !740, file: !1, line: 1133, type: !694)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !746, file: !1, line: 1136, type: !49)
!746 = distinct !DILexicalBlock(scope: !740, file: !1, line: 1136, column: 5)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !748, file: !1, line: 1136, type: !49)
!748 = distinct !DILexicalBlock(scope: !749, file: !1, line: 1136, column: 5)
!749 = distinct !DILexicalBlock(scope: !750, file: !1, line: 1136, column: 5)
!750 = distinct !DILexicalBlock(scope: !746, file: !1, line: 1136, column: 5)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !752, file: !1, line: 1137, type: !49)
!752 = distinct !DILexicalBlock(scope: !740, file: !1, line: 1137, column: 5)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !754, file: !1, line: 1137, type: !49)
!754 = distinct !DILexicalBlock(scope: !755, file: !1, line: 1137, column: 5)
!755 = distinct !DILexicalBlock(scope: !756, file: !1, line: 1137, column: 5)
!756 = distinct !DILexicalBlock(scope: !752, file: !1, line: 1137, column: 5)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !758, file: !1, line: 1138, type: !49)
!758 = distinct !DILexicalBlock(scope: !740, file: !1, line: 1138, column: 5)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !760, file: !1, line: 1138, type: !49)
!760 = distinct !DILexicalBlock(scope: !761, file: !1, line: 1138, column: 5)
!761 = distinct !DILexicalBlock(scope: !762, file: !1, line: 1138, column: 5)
!762 = distinct !DILexicalBlock(scope: !758, file: !1, line: 1138, column: 5)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !764, file: !1, line: 1139, type: !49)
!764 = distinct !DILexicalBlock(scope: !740, file: !1, line: 1139, column: 5)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !766, file: !1, line: 1139, type: !49)
!766 = distinct !DILexicalBlock(scope: !767, file: !1, line: 1139, column: 5)
!767 = distinct !DILexicalBlock(scope: !768, file: !1, line: 1139, column: 5)
!768 = distinct !DILexicalBlock(scope: !764, file: !1, line: 1139, column: 5)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !770, file: !1, line: 1140, type: !49)
!770 = distinct !DILexicalBlock(scope: !740, file: !1, line: 1140, column: 5)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !772, file: !1, line: 1140, type: !49)
!772 = distinct !DILexicalBlock(scope: !773, file: !1, line: 1140, column: 5)
!773 = distinct !DILexicalBlock(scope: !774, file: !1, line: 1140, column: 5)
!774 = distinct !DILexicalBlock(scope: !770, file: !1, line: 1140, column: 5)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !776, file: !1, line: 1141, type: !49)
!776 = distinct !DILexicalBlock(scope: !740, file: !1, line: 1141, column: 5)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !778, file: !1, line: 1141, type: !49)
!778 = distinct !DILexicalBlock(scope: !779, file: !1, line: 1141, column: 5)
!779 = distinct !DILexicalBlock(scope: !780, file: !1, line: 1141, column: 5)
!780 = distinct !DILexicalBlock(scope: !776, file: !1, line: 1141, column: 5)
!781 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !782, file: !1, line: 1142, type: !49)
!782 = distinct !DILexicalBlock(scope: !740, file: !1, line: 1142, column: 5)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !784, file: !1, line: 1142, type: !49)
!784 = distinct !DILexicalBlock(scope: !785, file: !1, line: 1142, column: 5)
!785 = distinct !DILexicalBlock(scope: !786, file: !1, line: 1142, column: 5)
!786 = distinct !DILexicalBlock(scope: !782, file: !1, line: 1142, column: 5)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !788, file: !1, line: 1143, type: !49)
!788 = distinct !DILexicalBlock(scope: !740, file: !1, line: 1143, column: 5)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !790, file: !1, line: 1143, type: !49)
!790 = distinct !DILexicalBlock(scope: !791, file: !1, line: 1143, column: 5)
!791 = distinct !DILexicalBlock(scope: !792, file: !1, line: 1143, column: 5)
!792 = distinct !DILexicalBlock(scope: !788, file: !1, line: 1143, column: 5)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !794, file: !1, line: 1144, type: !49)
!794 = distinct !DILexicalBlock(scope: !740, file: !1, line: 1144, column: 5)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !796, file: !1, line: 1144, type: !49)
!796 = distinct !DILexicalBlock(scope: !797, file: !1, line: 1144, column: 5)
!797 = distinct !DILexicalBlock(scope: !798, file: !1, line: 1144, column: 5)
!798 = distinct !DILexicalBlock(scope: !794, file: !1, line: 1144, column: 5)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !800, file: !1, line: 1145, type: !49)
!800 = distinct !DILexicalBlock(scope: !740, file: !1, line: 1145, column: 5)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !802, file: !1, line: 1145, type: !49)
!802 = distinct !DILexicalBlock(scope: !803, file: !1, line: 1145, column: 5)
!803 = distinct !DILexicalBlock(scope: !804, file: !1, line: 1145, column: 5)
!804 = distinct !DILexicalBlock(scope: !800, file: !1, line: 1145, column: 5)
!805 = !DISubprogram(name: "textiowrapper_repr", scope: !1, file: !1, line: 2469, type: !806, isLocal: true, isDefinition: true, scopeLine: 2470, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.textio*)* @textiowrapper_repr, variables: !808)
!806 = !DISubroutineType(types: !807)
!807 = !{!49, !694}
!808 = !{!809, !810, !811, !812, !813, !814, !818, !822, !824, !826}
!809 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !805, file: !1, line: 2469, type: !694)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nameobj", scope: !805, file: !1, line: 2471, type: !49)
!811 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modeobj", scope: !805, file: !1, line: 2471, type: !49)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !805, file: !1, line: 2471, type: !49)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !805, file: !1, line: 2471, type: !49)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !815, file: !1, line: 2487, type: !49)
!815 = distinct !DILexicalBlock(scope: !816, file: !1, line: 2487, column: 9)
!816 = distinct !DILexicalBlock(scope: !817, file: !1, line: 2485, column: 10)
!817 = distinct !DILexicalBlock(scope: !805, file: !1, line: 2479, column: 9)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !819, file: !1, line: 2503, type: !49)
!819 = distinct !DILexicalBlock(scope: !820, file: !1, line: 2503, column: 9)
!820 = distinct !DILexicalBlock(scope: !821, file: !1, line: 2501, column: 10)
!821 = distinct !DILexicalBlock(scope: !805, file: !1, line: 2495, column: 9)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !823, file: !1, line: 2512, type: !49)
!823 = distinct !DILexicalBlock(scope: !805, file: !1, line: 2512, column: 5)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !825, file: !1, line: 2515, type: !49)
!825 = distinct !DILexicalBlock(scope: !805, file: !1, line: 2515, column: 5)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !827, file: !1, line: 2515, type: !49)
!827 = distinct !DILexicalBlock(scope: !828, file: !1, line: 2515, column: 5)
!828 = distinct !DILexicalBlock(scope: !825, file: !1, line: 2515, column: 5)
!829 = !DISubprogram(name: "textiowrapper_traverse", scope: !1, file: !1, line: 1164, type: !830, isLocal: true, isDefinition: true, scopeLine: 1165, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.textio*, i32 (%struct._object*, i8*)*, i8*)* @textiowrapper_traverse, variables: !832)
!830 = !DISubroutineType(types: !831)
!831 = !{!55, !694, !275, !101}
!832 = !{!833, !834, !835, !836, !840, !844, !848, !852, !856, !860, !864, !868, !872, !876}
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !829, file: !1, line: 1164, type: !694)
!834 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !829, file: !1, line: 1164, type: !275)
!835 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !829, file: !1, line: 1164, type: !101)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !837, file: !1, line: 1166, type: !55)
!837 = distinct !DILexicalBlock(scope: !838, file: !1, line: 1166, column: 5)
!838 = distinct !DILexicalBlock(scope: !839, file: !1, line: 1166, column: 5)
!839 = distinct !DILexicalBlock(scope: !829, file: !1, line: 1166, column: 5)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !841, file: !1, line: 1167, type: !55)
!841 = distinct !DILexicalBlock(scope: !842, file: !1, line: 1167, column: 5)
!842 = distinct !DILexicalBlock(scope: !843, file: !1, line: 1167, column: 5)
!843 = distinct !DILexicalBlock(scope: !829, file: !1, line: 1167, column: 5)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !845, file: !1, line: 1168, type: !55)
!845 = distinct !DILexicalBlock(scope: !846, file: !1, line: 1168, column: 5)
!846 = distinct !DILexicalBlock(scope: !847, file: !1, line: 1168, column: 5)
!847 = distinct !DILexicalBlock(scope: !829, file: !1, line: 1168, column: 5)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !849, file: !1, line: 1169, type: !55)
!849 = distinct !DILexicalBlock(scope: !850, file: !1, line: 1169, column: 5)
!850 = distinct !DILexicalBlock(scope: !851, file: !1, line: 1169, column: 5)
!851 = distinct !DILexicalBlock(scope: !829, file: !1, line: 1169, column: 5)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !853, file: !1, line: 1170, type: !55)
!853 = distinct !DILexicalBlock(scope: !854, file: !1, line: 1170, column: 5)
!854 = distinct !DILexicalBlock(scope: !855, file: !1, line: 1170, column: 5)
!855 = distinct !DILexicalBlock(scope: !829, file: !1, line: 1170, column: 5)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !857, file: !1, line: 1171, type: !55)
!857 = distinct !DILexicalBlock(scope: !858, file: !1, line: 1171, column: 5)
!858 = distinct !DILexicalBlock(scope: !859, file: !1, line: 1171, column: 5)
!859 = distinct !DILexicalBlock(scope: !829, file: !1, line: 1171, column: 5)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !861, file: !1, line: 1172, type: !55)
!861 = distinct !DILexicalBlock(scope: !862, file: !1, line: 1172, column: 5)
!862 = distinct !DILexicalBlock(scope: !863, file: !1, line: 1172, column: 5)
!863 = distinct !DILexicalBlock(scope: !829, file: !1, line: 1172, column: 5)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !865, file: !1, line: 1173, type: !55)
!865 = distinct !DILexicalBlock(scope: !866, file: !1, line: 1173, column: 5)
!866 = distinct !DILexicalBlock(scope: !867, file: !1, line: 1173, column: 5)
!867 = distinct !DILexicalBlock(scope: !829, file: !1, line: 1173, column: 5)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !869, file: !1, line: 1174, type: !55)
!869 = distinct !DILexicalBlock(scope: !870, file: !1, line: 1174, column: 5)
!870 = distinct !DILexicalBlock(scope: !871, file: !1, line: 1174, column: 5)
!871 = distinct !DILexicalBlock(scope: !829, file: !1, line: 1174, column: 5)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !873, file: !1, line: 1175, type: !55)
!873 = distinct !DILexicalBlock(scope: !874, file: !1, line: 1175, column: 5)
!874 = distinct !DILexicalBlock(scope: !875, file: !1, line: 1175, column: 5)
!875 = distinct !DILexicalBlock(scope: !829, file: !1, line: 1175, column: 5)
!876 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !877, file: !1, line: 1177, type: !55)
!877 = distinct !DILexicalBlock(scope: !878, file: !1, line: 1177, column: 5)
!878 = distinct !DILexicalBlock(scope: !879, file: !1, line: 1177, column: 5)
!879 = distinct !DILexicalBlock(scope: !829, file: !1, line: 1177, column: 5)
!880 = !DISubprogram(name: "textiowrapper_clear", scope: !1, file: !1, line: 1182, type: !741, isLocal: true, isDefinition: true, scopeLine: 1183, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.textio*)* @textiowrapper_clear, variables: !881)
!881 = !{!882, !883, !885}
!882 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !880, file: !1, line: 1182, type: !694)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !884, file: !1, line: 1186, type: !49)
!884 = distinct !DILexicalBlock(scope: !880, file: !1, line: 1186, column: 5)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !886, file: !1, line: 1186, type: !49)
!886 = distinct !DILexicalBlock(scope: !887, file: !1, line: 1186, column: 5)
!887 = distinct !DILexicalBlock(scope: !888, file: !1, line: 1186, column: 5)
!888 = distinct !DILexicalBlock(scope: !884, file: !1, line: 1186, column: 5)
!889 = !DISubprogram(name: "textiowrapper_iternext", scope: !1, file: !1, line: 2630, type: !806, isLocal: true, isDefinition: true, scopeLine: 2631, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.textio*)* @textiowrapper_iternext, variables: !890)
!890 = !{!891, !892, !893, !899, !903, !905}
!891 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !889, file: !1, line: 2630, type: !694)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !889, file: !1, line: 2632, type: !49)
!893 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !894, file: !1, line: 2648, type: !49)
!894 = distinct !DILexicalBlock(scope: !895, file: !1, line: 2648, column: 13)
!895 = distinct !DILexicalBlock(scope: !896, file: !1, line: 2644, column: 45)
!896 = distinct !DILexicalBlock(scope: !897, file: !1, line: 2644, column: 13)
!897 = distinct !DILexicalBlock(scope: !898, file: !1, line: 2641, column: 10)
!898 = distinct !DILexicalBlock(scope: !889, file: !1, line: 2637, column: 9)
!899 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !900, file: !1, line: 2658, type: !49)
!900 = distinct !DILexicalBlock(scope: !901, file: !1, line: 2658, column: 9)
!901 = distinct !DILexicalBlock(scope: !902, file: !1, line: 2656, column: 42)
!902 = distinct !DILexicalBlock(scope: !889, file: !1, line: 2656, column: 9)
!903 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !904, file: !1, line: 2659, type: !49)
!904 = distinct !DILexicalBlock(scope: !901, file: !1, line: 2659, column: 9)
!905 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !906, file: !1, line: 2659, type: !49)
!906 = distinct !DILexicalBlock(scope: !907, file: !1, line: 2659, column: 9)
!907 = distinct !DILexicalBlock(scope: !908, file: !1, line: 2659, column: 9)
!908 = distinct !DILexicalBlock(scope: !904, file: !1, line: 2659, column: 9)
!909 = !DISubprogram(name: "_textiowrapper_readline", scope: !1, file: !1, line: 1767, type: !910, isLocal: true, isDefinition: true, scopeLine: 1768, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.textio*, i64)* @_textiowrapper_readline, variables: !912)
!910 = !DISubroutineType(types: !911)
!911 = !{!49, !694, !21}
!912 = !{!913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !925, !926, !932, !934, !935, !936, !937, !941, !945, !949, !953, !956, !960, !962, !964, !968, !973, !975, !979, !983, !987, !993, !995, !999, !1001, !1004, !1006, !1009, !1011}
!913 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !909, file: !1, line: 1767, type: !694)
!914 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "limit", arg: 2, scope: !909, file: !1, line: 1767, type: !21)
!915 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !909, file: !1, line: 1769, type: !49)
!916 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chunks", scope: !909, file: !1, line: 1769, type: !49)
!917 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "remaining", scope: !909, file: !1, line: 1769, type: !49)
!918 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !909, file: !1, line: 1770, type: !21)
!919 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "endpos", scope: !909, file: !1, line: 1770, type: !21)
!920 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chunked", scope: !909, file: !1, line: 1770, type: !21)
!921 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset_to_buffer", scope: !909, file: !1, line: 1770, type: !21)
!922 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !909, file: !1, line: 1771, type: !55)
!923 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !924, file: !1, line: 1773, type: !55)
!924 = distinct !DILexicalBlock(scope: !909, file: !1, line: 1773, column: 5)
!925 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_res", scope: !924, file: !1, line: 1773, type: !49)
!926 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !927, file: !1, line: 1773, type: !49)
!927 = distinct !DILexicalBlock(scope: !928, file: !1, line: 1773, column: 5)
!928 = distinct !DILexicalBlock(scope: !929, file: !1, line: 1773, column: 5)
!929 = distinct !DILexicalBlock(scope: !930, file: !1, line: 1773, column: 5)
!930 = distinct !DILexicalBlock(scope: !931, file: !1, line: 1773, column: 5)
!931 = distinct !DILexicalBlock(scope: !924, file: !1, line: 1773, column: 5)
!932 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !933, file: !1, line: 1781, type: !63)
!933 = distinct !DILexicalBlock(scope: !909, file: !1, line: 1780, column: 15)
!934 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line_len", scope: !933, file: !1, line: 1782, type: !21)
