; ModuleID = 'thread.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!24 = !DIEnumerator(name: "_CS_LFS_LDFLAGS", value: 1001)
!25 = !DIEnumerator(name: "_CS_LFS_LIBS", value: 1002)
!26 = !DIEnumerator(name: "_CS_LFS_LINTFLAGS", value: 1003)
!27 = !DIEnumerator(name: "_CS_LFS64_CFLAGS", value: 1004)
!28 = !DIEnumerator(name: "_CS_LFS64_LDFLAGS", value: 1005)
!29 = !DIEnumerator(name: "_CS_LFS64_LIBS", value: 1006)
!30 = !DIEnumerator(name: "_CS_LFS64_LINTFLAGS", value: 1007)
!31 = !DIEnumerator(name: "_CS_XBS5_ILP32_OFF32_CFLAGS", value: 1100)
!32 = !DIEnumerator(name: "_CS_XBS5_ILP32_OFF32_LDFLAGS", value: 1101)
!33 = !DIEnumerator(name: "_CS_XBS5_ILP32_OFF32_LIBS", value: 1102)
!34 = !DIEnumerator(name: "_CS_XBS5_ILP32_OFF32_LINTFLAGS", value: 1103)
!35 = !DIEnumerator(name: "_CS_XBS5_ILP32_OFFBIG_CFLAGS", value: 1104)
!36 = !DIEnumerator(name: "_CS_XBS5_ILP32_OFFBIG_LDFLAGS", value: 1105)
!37 = !DIEnumerator(name: "_CS_XBS5_ILP32_OFFBIG_LIBS", value: 1106)
!38 = !DIEnumerator(name: "_CS_XBS5_ILP32_OFFBIG_LINTFLAGS", value: 1107)
!39 = !DIEnumerator(name: "_CS_XBS5_LP64_OFF64_CFLAGS", value: 1108)
!40 = !DIEnumerator(name: "_CS_XBS5_LP64_OFF64_LDFLAGS", value: 1109)
!41 = !DIEnumerator(name: "_CS_XBS5_LP64_OFF64_LIBS", value: 1110)
!42 = !DIEnumerator(name: "_CS_XBS5_LP64_OFF64_LINTFLAGS", value: 1111)
!43 = !DIEnumerator(name: "_CS_XBS5_LPBIG_OFFBIG_CFLAGS", value: 1112)
!44 = !DIEnumerator(name: "_CS_XBS5_LPBIG_OFFBIG_LDFLAGS", value: 1113)
!45 = !DIEnumerator(name: "_CS_XBS5_LPBIG_OFFBIG_LIBS", value: 1114)
!46 = !DIEnumerator(name: "_CS_XBS5_LPBIG_OFFBIG_LINTFLAGS", value: 1115)
!47 = !DIEnumerator(name: "_CS_POSIX_V6_ILP32_OFF32_CFLAGS", value: 1116)
!48 = !DIEnumerator(name: "_CS_POSIX_V6_ILP32_OFF32_LDFLAGS", value: 1117)
!49 = !DIEnumerator(name: "_CS_POSIX_V6_ILP32_OFF32_LIBS", value: 1118)
!50 = !DIEnumerator(name: "_CS_POSIX_V6_ILP32_OFF32_LINTFLAGS", value: 1119)
!51 = !DIEnumerator(name: "_CS_POSIX_V6_ILP32_OFFBIG_CFLAGS", value: 1120)
!52 = !DIEnumerator(name: "_CS_POSIX_V6_ILP32_OFFBIG_LDFLAGS", value: 1121)
!53 = !DIEnumerator(name: "_CS_POSIX_V6_ILP32_OFFBIG_LIBS", value: 1122)
!54 = !DIEnumerator(name: "_CS_POSIX_V6_ILP32_OFFBIG_LINTFLAGS", value: 1123)
!55 = !DIEnumerator(name: "_CS_POSIX_V6_LP64_OFF64_CFLAGS", value: 1124)
!56 = !DIEnumerator(name: "_CS_POSIX_V6_LP64_OFF64_LDFLAGS", value: 1125)
!57 = !DIEnumerator(name: "_CS_POSIX_V6_LP64_OFF64_LIBS", value: 1126)
!58 = !DIEnumerator(name: "_CS_POSIX_V6_LP64_OFF64_LINTFLAGS", value: 1127)
!59 = !DIEnumerator(name: "_CS_POSIX_V6_LPBIG_OFFBIG_CFLAGS", value: 1128)
!60 = !DIEnumerator(name: "_CS_POSIX_V6_LPBIG_OFFBIG_LDFLAGS", value: 1129)
!61 = !DIEnumerator(name: "_CS_POSIX_V6_LPBIG_OFFBIG_LIBS", value: 1130)
!62 = !DIEnumerator(name: "_CS_POSIX_V6_LPBIG_OFFBIG_LINTFLAGS", value: 1131)
!63 = !DIEnumerator(name: "_CS_POSIX_V7_ILP32_OFF32_CFLAGS", value: 1132)
!64 = !DIEnumerator(name: "_CS_POSIX_V7_ILP32_OFF32_LDFLAGS", value: 1133)
!65 = !DIEnumerator(name: "_CS_POSIX_V7_ILP32_OFF32_LIBS", value: 1134)
!66 = !DIEnumerator(name: "_CS_POSIX_V7_ILP32_OFF32_LINTFLAGS", value: 1135)
!67 = !DIEnumerator(name: "_CS_POSIX_V7_ILP32_OFFBIG_CFLAGS", value: 1136)
!68 = !DIEnumerator(name: "_CS_POSIX_V7_ILP32_OFFBIG_LDFLAGS", value: 1137)
!69 = !DIEnumerator(name: "_CS_POSIX_V7_ILP32_OFFBIG_LIBS", value: 1138)
!70 = !DIEnumerator(name: "_CS_POSIX_V7_ILP32_OFFBIG_LINTFLAGS", value: 1139)
!71 = !DIEnumerator(name: "_CS_POSIX_V7_LP64_OFF64_CFLAGS", value: 1140)
!72 = !DIEnumerator(name: "_CS_POSIX_V7_LP64_OFF64_LDFLAGS", value: 1141)
!73 = !DIEnumerator(name: "_CS_POSIX_V7_LP64_OFF64_LIBS", value: 1142)
!74 = !DIEnumerator(name: "_CS_POSIX_V7_LP64_OFF64_LINTFLAGS", value: 1143)
!75 = !DIEnumerator(name: "_CS_POSIX_V7_LPBIG_OFFBIG_CFLAGS", value: 1144)
!76 = !DIEnumerator(name: "_CS_POSIX_V7_LPBIG_OFFBIG_LDFLAGS", value: 1145)
!77 = !DIEnumerator(name: "_CS_POSIX_V7_LPBIG_OFFBIG_LIBS", value: 1146)
!78 = !DIEnumerator(name: "_CS_POSIX_V7_LPBIG_OFFBIG_LINTFLAGS", value: 1147)
!79 = !DIEnumerator(name: "_CS_V6_ENV", value: 1148)
!80 = !DIEnumerator(name: "_CS_V7_ENV", value: 1149)
!81 = !{!82, !85, !86, !87, !98, !99, !106, !441}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!86 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "sem_t", file: !89, line: 40, baseType: !90)
!89 = !DIFile(filename: "/usr/include/bits/semaphore.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!90 = !DICompositeType(tag: DW_TAG_union_type, file: !89, line: 36, size: 256, align: 64, elements: !91)
!91 = !{!92, !97}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !90, file: !89, line: 38, baseType: !93, size: 256, align: 8)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 256, align: 8, elements: !95)
!94 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!95 = !{!96}
!96 = !DISubrange(count: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !90, file: !89, line: 39, baseType: !86, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThread_type_lock", file: !9, line: 5, baseType: !85)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "timezone", file: !101, line: 56, size: 64, align: 32, elements: !102)
!101 = !DIFile(filename: "/usr/include/sys/time.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!102 = !{!103, !105}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tz_minuteswest", scope: !100, file: !101, line: 58, baseType: !104, size: 32, align: 32)
!104 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tz_dsttime", scope: !100, file: !101, line: 59, baseType: !104, size: 32, align: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !108, line: 109, baseType: !109)
!108 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !108, line: 105, size: 128, align: 64, elements: !110)
!110 = !{!111, !118}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !109, file: !108, line: 107, baseType: !112, size: 64, align: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !113, line: 177, baseType: !114)
!113 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !115, line: 102, baseType: !116)
!115 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !117, line: 181, baseType: !86)
!117 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !109, file: !108, line: 108, baseType: !119, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !108, line: 334, size: 3200, align: 64, elements: !121)
!121 = !{!122, !128, !131, !132, !133, !138, !200, !205, !210, !211, !216, !268, !299, !311, !317, !318, !319, !321, !323, !354, !355, !356, !365, !366, !371, !372, !374, !376, !386, !389, !407, !408, !409, !411, !413, !414, !416, !421, !426, !431, !432, !433, !434, !435, !436, !437, !438, !440}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !120, file: !108, line: 335, baseType: !123, size: 192, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !108, line: 114, baseType: !124)
!124 = !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 111, size: 192, align: 64, elements: !125)
!125 = !{!126, !127}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !124, file: !108, line: 112, baseType: !107, size: 128, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !124, file: !108, line: 113, baseType: !112, size: 64, align: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !120, file: !108, line: 336, baseType: !129, size: 64, align: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !120, file: !108, line: 337, baseType: !112, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !120, file: !108, line: 337, baseType: !112, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !120, file: !108, line: 341, baseType: !134, size: 64, align: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !108, line: 308, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !106}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !120, file: !108, line: 342, baseType: !139, size: 64, align: 64, offset: 448)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !108, line: 314, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!104, !106, !143, !104}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !115, line: 48, baseType: !145)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !146, line: 246, size: 1728, align: 64, elements: !147)
!146 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!147 = !{!148, !149, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !169, !170, !171, !172, !174, !176, !178, !182, !185, !187, !188, !189, !190, !191, !195, !196}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !145, file: !146, line: 247, baseType: !104, size: 32, align: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !145, file: !146, line: 252, baseType: !150, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !145, file: !146, line: 253, baseType: !150, size: 64, align: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !145, file: !146, line: 254, baseType: !150, size: 64, align: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !145, file: !146, line: 255, baseType: !150, size: 64, align: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !145, file: !146, line: 256, baseType: !150, size: 64, align: 64, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !145, file: !146, line: 257, baseType: !150, size: 64, align: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !145, file: !146, line: 258, baseType: !150, size: 64, align: 64, offset: 448)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !145, file: !146, line: 259, baseType: !150, size: 64, align: 64, offset: 512)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !145, file: !146, line: 261, baseType: !150, size: 64, align: 64, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !145, file: !146, line: 262, baseType: !150, size: 64, align: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !145, file: !146, line: 263, baseType: !150, size: 64, align: 64, offset: 704)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !145, file: !146, line: 265, baseType: !162, size: 64, align: 64, offset: 768)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !146, line: 161, size: 192, align: 64, elements: !164)
!164 = !{!165, !166, !168}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !163, file: !146, line: 162, baseType: !162, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !163, file: !146, line: 163, baseType: !167, size: 64, align: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !163, file: !146, line: 167, baseType: !104, size: 32, align: 32, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !145, file: !146, line: 267, baseType: !167, size: 64, align: 64, offset: 832)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !145, file: !146, line: 269, baseType: !104, size: 32, align: 32, offset: 896)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !145, file: !146, line: 273, baseType: !104, size: 32, align: 32, offset: 928)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !145, file: !146, line: 275, baseType: !173, size: 64, align: 64, offset: 960)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !117, line: 140, baseType: !86)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !145, file: !146, line: 279, baseType: !175, size: 16, align: 16, offset: 1024)
!175 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !145, file: !146, line: 280, baseType: !177, size: 8, align: 8, offset: 1040)
!177 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !145, file: !146, line: 281, baseType: !179, size: 8, align: 8, offset: 1048)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 8, align: 8, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 1)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !145, file: !146, line: 285, baseType: !183, size: 64, align: 64, offset: 1088)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !146, line: 155, baseType: null)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !145, file: !146, line: 294, baseType: !186, size: 64, align: 64, offset: 1152)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !117, line: 141, baseType: !86)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !145, file: !146, line: 303, baseType: !85, size: 64, align: 64, offset: 1216)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !145, file: !146, line: 304, baseType: !85, size: 64, align: 64, offset: 1280)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !145, file: !146, line: 305, baseType: !85, size: 64, align: 64, offset: 1344)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !145, file: !146, line: 306, baseType: !85, size: 64, align: 64, offset: 1408)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !145, file: !146, line: 307, baseType: !192, size: 64, align: 64, offset: 1472)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !193, line: 62, baseType: !194)
!193 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!194 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !145, file: !146, line: 309, baseType: !104, size: 32, align: 32, offset: 1536)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !145, file: !146, line: 311, baseType: !197, size: 160, align: 8, offset: 1568)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 160, align: 8, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 20)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !120, file: !108, line: 343, baseType: !201, size: 64, align: 64, offset: 512)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !108, line: 316, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!106, !106, !150}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !120, file: !108, line: 344, baseType: !206, size: 64, align: 64, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !108, line: 318, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!104, !106, !150, !106}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !120, file: !108, line: 345, baseType: !85, size: 64, align: 64, offset: 640)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !120, file: !108, line: 346, baseType: !212, size: 64, align: 64, offset: 704)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !108, line: 320, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!106, !106}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !120, file: !108, line: 350, baseType: !217, size: 64, align: 64, offset: 768)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !108, line: 278, baseType: !219)
!219 = !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 236, size: 2176, align: 64, elements: !220)
!220 = !{!221, !226, !227, !228, !229, !230, !235, !237, !238, !239, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !219, file: !108, line: 241, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !108, line: 166, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!106, !106, !106}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !219, file: !108, line: 242, baseType: !222, size: 64, align: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !219, file: !108, line: 243, baseType: !222, size: 64, align: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !219, file: !108, line: 244, baseType: !222, size: 64, align: 64, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !219, file: !108, line: 245, baseType: !222, size: 64, align: 64, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !219, file: !108, line: 246, baseType: !231, size: 64, align: 64, offset: 320)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !108, line: 167, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!106, !106, !106, !106}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !219, file: !108, line: 247, baseType: !236, size: 64, align: 64, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !108, line: 165, baseType: !213)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !219, file: !108, line: 248, baseType: !236, size: 64, align: 64, offset: 448)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !219, file: !108, line: 249, baseType: !236, size: 64, align: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !219, file: !108, line: 250, baseType: !240, size: 64, align: 64, offset: 576)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !108, line: 168, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!104, !106}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !219, file: !108, line: 251, baseType: !236, size: 64, align: 64, offset: 640)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !219, file: !108, line: 252, baseType: !222, size: 64, align: 64, offset: 704)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !219, file: !108, line: 253, baseType: !222, size: 64, align: 64, offset: 768)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !219, file: !108, line: 254, baseType: !222, size: 64, align: 64, offset: 832)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !219, file: !108, line: 255, baseType: !222, size: 64, align: 64, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !219, file: !108, line: 256, baseType: !222, size: 64, align: 64, offset: 960)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !219, file: !108, line: 257, baseType: !236, size: 64, align: 64, offset: 1024)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !219, file: !108, line: 258, baseType: !85, size: 64, align: 64, offset: 1088)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !219, file: !108, line: 259, baseType: !236, size: 64, align: 64, offset: 1152)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !219, file: !108, line: 261, baseType: !222, size: 64, align: 64, offset: 1216)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !219, file: !108, line: 262, baseType: !222, size: 64, align: 64, offset: 1280)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !219, file: !108, line: 263, baseType: !222, size: 64, align: 64, offset: 1344)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !219, file: !108, line: 264, baseType: !222, size: 64, align: 64, offset: 1408)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !219, file: !108, line: 265, baseType: !231, size: 64, align: 64, offset: 1472)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !219, file: !108, line: 266, baseType: !222, size: 64, align: 64, offset: 1536)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !219, file: !108, line: 267, baseType: !222, size: 64, align: 64, offset: 1600)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !219, file: !108, line: 268, baseType: !222, size: 64, align: 64, offset: 1664)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !219, file: !108, line: 269, baseType: !222, size: 64, align: 64, offset: 1728)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !219, file: !108, line: 270, baseType: !222, size: 64, align: 64, offset: 1792)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !219, file: !108, line: 272, baseType: !222, size: 64, align: 64, offset: 1856)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !219, file: !108, line: 273, baseType: !222, size: 64, align: 64, offset: 1920)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !219, file: !108, line: 274, baseType: !222, size: 64, align: 64, offset: 1984)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !219, file: !108, line: 275, baseType: !222, size: 64, align: 64, offset: 2048)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !219, file: !108, line: 277, baseType: !236, size: 64, align: 64, offset: 2112)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !120, file: !108, line: 351, baseType: !269, size: 64, align: 64, offset: 832)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !108, line: 292, baseType: !271)
!271 = !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 280, size: 640, align: 64, elements: !272)
!272 = !{!273, !278, !279, !284, !285, !286, !291, !292, !297, !298}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !271, file: !108, line: 281, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !108, line: 169, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!112, !106}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !271, file: !108, line: 282, baseType: !222, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !271, file: !108, line: 283, baseType: !280, size: 64, align: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !108, line: 170, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!106, !106, !112}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !271, file: !108, line: 284, baseType: !280, size: 64, align: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !271, file: !108, line: 285, baseType: !85, size: 64, align: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !271, file: !108, line: 286, baseType: !287, size: 64, align: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !108, line: 172, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!104, !106, !112, !106}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !271, file: !108, line: 287, baseType: !85, size: 64, align: 64, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !271, file: !108, line: 288, baseType: !293, size: 64, align: 64, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !108, line: 231, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!104, !106, !106}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !271, file: !108, line: 290, baseType: !222, size: 64, align: 64, offset: 512)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !271, file: !108, line: 291, baseType: !280, size: 64, align: 64, offset: 576)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !120, file: !108, line: 352, baseType: !300, size: 64, align: 64, offset: 896)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !108, line: 298, baseType: !302)
!302 = !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 294, size: 192, align: 64, elements: !303)
!303 = !{!304, !305, !306}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !302, file: !108, line: 295, baseType: !274, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !302, file: !108, line: 296, baseType: !222, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !302, file: !108, line: 297, baseType: !307, size: 64, align: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !108, line: 174, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!104, !106, !106, !106}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !120, file: !108, line: 356, baseType: !312, size: 64, align: 64, offset: 960)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !108, line: 321, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!316, !106}
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !113, line: 186, baseType: !112)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !120, file: !108, line: 357, baseType: !231, size: 64, align: 64, offset: 1024)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !120, file: !108, line: 358, baseType: !212, size: 64, align: 64, offset: 1088)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !120, file: !108, line: 359, baseType: !320, size: 64, align: 64, offset: 1152)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !108, line: 317, baseType: !223)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !120, file: !108, line: 360, baseType: !322, size: 64, align: 64, offset: 1216)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !108, line: 319, baseType: !308)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !120, file: !108, line: 363, baseType: !324, size: 64, align: 64, offset: 1280)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !108, line: 304, baseType: !326)
!326 = !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 301, size: 128, align: 64, elements: !327)
!327 = !{!328, !349}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !326, file: !108, line: 302, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !108, line: 193, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!104, !106, !333, !104}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !108, line: 191, baseType: !335)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !108, line: 178, size: 640, align: 64, elements: !336)
!336 = !{!337, !338, !339, !340, !341, !342, !343, !344, !346, !347, !348}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !335, file: !108, line: 179, baseType: !85, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !335, file: !108, line: 180, baseType: !106, size: 64, align: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !335, file: !108, line: 181, baseType: !112, size: 64, align: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !335, file: !108, line: 182, baseType: !112, size: 64, align: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !335, file: !108, line: 184, baseType: !104, size: 32, align: 32, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !335, file: !108, line: 185, baseType: !104, size: 32, align: 32, offset: 288)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !335, file: !108, line: 186, baseType: !150, size: 64, align: 64, offset: 320)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !335, file: !108, line: 187, baseType: !345, size: 64, align: 64, offset: 384)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !335, file: !108, line: 188, baseType: !345, size: 64, align: 64, offset: 448)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !335, file: !108, line: 189, baseType: !345, size: 64, align: 64, offset: 512)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !335, file: !108, line: 190, baseType: !85, size: 64, align: 64, offset: 576)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !326, file: !108, line: 303, baseType: !350, size: 64, align: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !108, line: 194, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !106, !333}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !120, file: !108, line: 366, baseType: !194, size: 64, align: 64, offset: 1344)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !120, file: !108, line: 368, baseType: !129, size: 64, align: 64, offset: 1408)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !120, file: !108, line: 372, baseType: !357, size: 64, align: 64, offset: 1472)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !108, line: 233, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!104, !106, !361, !85}
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !108, line: 232, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!104, !106, !85}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !120, file: !108, line: 375, baseType: !240, size: 64, align: 64, offset: 1536)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !120, file: !108, line: 379, baseType: !367, size: 64, align: 64, offset: 1600)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !108, line: 322, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!106, !106, !106, !104}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !120, file: !108, line: 382, baseType: !112, size: 64, align: 64, offset: 1664)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !120, file: !108, line: 385, baseType: !373, size: 64, align: 64, offset: 1728)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !108, line: 323, baseType: !213)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !120, file: !108, line: 386, baseType: !375, size: 64, align: 64, offset: 1792)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !108, line: 324, baseType: !213)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !120, file: !108, line: 389, baseType: !377, size: 64, align: 64, offset: 1856)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !379, line: 40, size: 256, align: 64, elements: !380)
!379 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!380 = !{!381, !382, !384, !385}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !378, file: !379, line: 41, baseType: !129, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !378, file: !379, line: 42, baseType: !383, size: 64, align: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !379, line: 18, baseType: !223)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !378, file: !379, line: 43, baseType: !104, size: 32, align: 32, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !378, file: !379, line: 45, baseType: !129, size: 64, align: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !120, file: !108, line: 390, baseType: !387, size: 64, align: 64, offset: 1920)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !108, line: 390, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !120, file: !108, line: 391, baseType: !390, size: 64, align: 64, offset: 1984)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !392, line: 11, size: 320, align: 64, elements: !393)
!392 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!393 = !{!394, !395, !400, !405, !406}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !391, file: !392, line: 12, baseType: !150, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !391, file: !392, line: 13, baseType: !396, size: 64, align: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !392, line: 8, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!106, !106, !85}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !391, file: !392, line: 14, baseType: !401, size: 64, align: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !392, line: 9, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!104, !106, !106, !85}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !391, file: !392, line: 15, baseType: !150, size: 64, align: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !391, file: !392, line: 16, baseType: !85, size: 64, align: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !120, file: !108, line: 392, baseType: !119, size: 64, align: 64, offset: 2048)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !120, file: !108, line: 393, baseType: !106, size: 64, align: 64, offset: 2112)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !120, file: !108, line: 394, baseType: !410, size: 64, align: 64, offset: 2176)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !108, line: 325, baseType: !232)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !120, file: !108, line: 395, baseType: !412, size: 64, align: 64, offset: 2240)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !108, line: 326, baseType: !308)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !120, file: !108, line: 396, baseType: !112, size: 64, align: 64, offset: 2304)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !120, file: !108, line: 397, baseType: !415, size: 64, align: 64, offset: 2368)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !108, line: 327, baseType: !308)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !120, file: !108, line: 398, baseType: !417, size: 64, align: 64, offset: 2432)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !108, line: 329, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!106, !119, !112}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !120, file: !108, line: 399, baseType: !422, size: 64, align: 64, offset: 2496)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !108, line: 328, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!106, !119, !106, !106}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !120, file: !108, line: 400, baseType: !427, size: 64, align: 64, offset: 2560)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !108, line: 307, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !85}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !120, file: !108, line: 401, baseType: !240, size: 64, align: 64, offset: 2624)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !120, file: !108, line: 402, baseType: !106, size: 64, align: 64, offset: 2688)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !120, file: !108, line: 403, baseType: !106, size: 64, align: 64, offset: 2752)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !120, file: !108, line: 404, baseType: !106, size: 64, align: 64, offset: 2816)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !120, file: !108, line: 405, baseType: !106, size: 64, align: 64, offset: 2880)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !120, file: !108, line: 406, baseType: !106, size: 64, align: 64, offset: 2944)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !120, file: !108, line: 407, baseType: !134, size: 64, align: 64, offset: 3008)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !120, file: !108, line: 410, baseType: !439, size: 32, align: 32, offset: 3072)
!439 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !120, file: !108, line: 412, baseType: !134, size: 64, align: 64, offset: 3136)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !443, line: 33, baseType: !444)
!443 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!444 = !DICompositeType(tag: DW_TAG_structure_type, file: !443, line: 25, size: 256, align: 64, elements: !445)
!445 = !{!446, !447}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !444, file: !443, line: 26, baseType: !123, size: 192, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !444, file: !443, line: 27, baseType: !448, size: 64, align: 64, offset: 192)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 64, align: 64, elements: !180)
!449 = !{!450, !454, !475, !481, !482, !489, !497, !527, !533, !539, !546, !551, !554, !561, !566, !567, !570, !575, !595, !596, !601}
!450 = !DISubprogram(name: "PyThread_init_thread", scope: !1, file: !1, line: 60, type: !451, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyThread_init_thread, variables: !453)
!451 = !DISubroutineType(types: !452)
!452 = !{null}
!453 = !{}
!454 = !DISubprogram(name: "PyThread_start_new_thread", scope: !455, file: !455, line: 186, type: !456, isLocal: false, isDefinition: true, scopeLine: 187, flags: DIFlagPrototyped, isOptimized: true, function: i64 (void (i8*)*, i8*)* @PyThread_start_new_thread, variables: !458)
!455 = !DIFile(filename: "Python/thread_pthread.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!456 = !DISubroutineType(types: !457)
!457 = !{!86, !428, !85}
!458 = !{!459, !460, !461, !464, !465, !474}
!459 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !454, file: !455, line: 186, type: !428)
!460 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !454, file: !455, line: 186, type: !85)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "th", scope: !454, file: !455, line: 188, type: !462)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !463, line: 60, baseType: !194)
!463 = !DIFile(filename: "/usr/include/bits/pthreadtypes.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "status", scope: !454, file: !455, line: 189, type: !104)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "attrs", scope: !454, file: !455, line: 191, type: !466)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_attr_t", file: !463, line: 69, baseType: !467)
!467 = !DICompositeType(tag: DW_TAG_union_type, name: "pthread_attr_t", file: !463, line: 63, size: 448, align: 64, elements: !468)
!468 = !{!469, !473}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !467, file: !463, line: 65, baseType: !470, size: 448, align: 8)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 448, align: 8, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 56)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !467, file: !463, line: 66, baseType: !86, size: 64, align: 64)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tss", scope: !454, file: !455, line: 194, type: !192)
!475 = !DISubprogram(name: "PyThread_get_thread_ident", scope: !455, file: !455, line: 251, type: !476, isLocal: false, isDefinition: true, scopeLine: 252, flags: DIFlagPrototyped, isOptimized: true, function: i64 ()* @PyThread_get_thread_ident, variables: !478)
!476 = !DISubroutineType(types: !477)
!477 = !{!86}
!478 = !{!479}
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "threadid", scope: !475, file: !455, line: 253, type: !480)
!480 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !462)
!481 = !DISubprogram(name: "PyThread_exit_thread", scope: !455, file: !455, line: 261, type: !451, isLocal: false, isDefinition: true, scopeLine: 262, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyThread_exit_thread, variables: !453)
!482 = !DISubprogram(name: "PyThread_allocate_lock", scope: !455, file: !455, line: 276, type: !483, isLocal: false, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @PyThread_allocate_lock, variables: !485)
!483 = !DISubroutineType(types: !484)
!484 = !{!98}
!485 = !{!486, !487, !488}
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lock", scope: !482, file: !455, line: 278, type: !87)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "status", scope: !482, file: !455, line: 279, type: !104)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error", scope: !482, file: !455, line: 279, type: !104)
!489 = !DISubprogram(name: "PyThread_free_lock", scope: !455, file: !455, line: 302, type: !490, isLocal: false, isDefinition: true, scopeLine: 303, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @PyThread_free_lock, variables: !492)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !98}
!492 = !{!493, !494, !495, !496}
!493 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lock", arg: 1, scope: !489, file: !455, line: 302, type: !98)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thelock", scope: !489, file: !455, line: 304, type: !87)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "status", scope: !489, file: !455, line: 305, type: !104)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error", scope: !489, file: !455, line: 305, type: !104)
!497 = !DISubprogram(name: "PyThread_acquire_lock_timed", scope: !455, file: !455, line: 332, type: !498, isLocal: false, isDefinition: true, scopeLine: 334, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i64, i32)* @PyThread_acquire_lock_timed, variables: !502)
!498 = !DISubroutineType(types: !499)
!499 = !{!500, !98, !501, !104}
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLockStatus", file: !9, line: 18, baseType: !8)
!501 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!502 = !{!503, !504, !505, !506, !507, !508, !509, !510, !518}
!503 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lock", arg: 1, scope: !497, file: !455, line: 332, type: !98)
!504 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "microseconds", arg: 2, scope: !497, file: !455, line: 332, type: !501)
!505 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "intr_flag", arg: 3, scope: !497, file: !455, line: 333, type: !104)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "success", scope: !497, file: !455, line: 335, type: !500)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thelock", scope: !497, file: !455, line: 336, type: !87)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "status", scope: !497, file: !455, line: 337, type: !104)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error", scope: !497, file: !455, line: 337, type: !104)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ts", scope: !497, file: !455, line: 338, type: !511)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !512, line: 120, size: 128, align: 64, elements: !513)
!512 = !DIFile(filename: "/usr/include/time.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!513 = !{!514, !516}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !511, file: !512, line: 122, baseType: !515, size: 64, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !117, line: 148, baseType: !86)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !511, file: !512, line: 123, baseType: !517, size: 64, align: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !117, line: 184, baseType: !86)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tv", scope: !519, file: !455, line: 345, type: !521)
!519 = distinct !DILexicalBlock(scope: !520, file: !455, line: 345, column: 9)
!520 = distinct !DILexicalBlock(scope: !497, file: !455, line: 344, column: 9)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !522, line: 30, size: 128, align: 64, elements: !523)
!522 = !DIFile(filename: "/usr/include/bits/time.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!523 = !{!524, !525}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !521, file: !522, line: 32, baseType: !515, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !521, file: !522, line: 33, baseType: !526, size: 64, align: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !117, line: 150, baseType: !86)
!527 = !DISubprogram(name: "PyThread_release_lock", scope: !455, file: !455, line: 386, type: !490, isLocal: false, isDefinition: true, scopeLine: 387, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @PyThread_release_lock, variables: !528)
!528 = !{!529, !530, !531, !532}
!529 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lock", arg: 1, scope: !527, file: !455, line: 386, type: !98)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thelock", scope: !527, file: !455, line: 388, type: !87)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "status", scope: !527, file: !455, line: 389, type: !104)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error", scope: !527, file: !455, line: 389, type: !104)
!533 = !DISubprogram(name: "PyThread_acquire_lock", scope: !455, file: !455, line: 554, type: !534, isLocal: false, isDefinition: true, scopeLine: 555, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32)* @PyThread_acquire_lock, variables: !536)
!534 = !DISubroutineType(types: !535)
!535 = !{!104, !98, !104}
!536 = !{!537, !538}
!537 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lock", arg: 1, scope: !533, file: !455, line: 554, type: !98)
!538 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "waitflag", arg: 2, scope: !533, file: !455, line: 554, type: !104)
!539 = !DISubprogram(name: "PyThread_create_key", scope: !455, file: !455, line: 607, type: !540, isLocal: false, isDefinition: true, scopeLine: 608, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @PyThread_create_key, variables: !542)
!540 = !DISubroutineType(types: !541)
!541 = !{!104}
!542 = !{!543, !545}
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !539, file: !455, line: 609, type: !544)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_key_t", file: !463, line: 154, baseType: !439)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fail", scope: !539, file: !455, line: 610, type: !104)
!546 = !DISubprogram(name: "PyThread_delete_key", scope: !455, file: !455, line: 615, type: !547, isLocal: false, isDefinition: true, scopeLine: 616, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @PyThread_delete_key, variables: !549)
!547 = !DISubroutineType(types: !548)
!548 = !{null, !104}
!549 = !{!550}
!550 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !546, file: !455, line: 615, type: !104)
!551 = !DISubprogram(name: "PyThread_delete_key_value", scope: !455, file: !455, line: 621, type: !547, isLocal: false, isDefinition: true, scopeLine: 622, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @PyThread_delete_key_value, variables: !552)
!552 = !{!553}
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !551, file: !455, line: 621, type: !104)
!554 = !DISubprogram(name: "PyThread_set_key_value", scope: !455, file: !455, line: 627, type: !555, isLocal: false, isDefinition: true, scopeLine: 628, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i8*)* @PyThread_set_key_value, variables: !557)
!555 = !DISubroutineType(types: !556)
!556 = !{!104, !104, !85}
!557 = !{!558, !559, !560}
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !554, file: !455, line: 627, type: !104)
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !554, file: !455, line: 627, type: !85)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fail", scope: !554, file: !455, line: 629, type: !104)
!561 = !DISubprogram(name: "PyThread_get_key_value", scope: !455, file: !455, line: 635, type: !562, isLocal: false, isDefinition: true, scopeLine: 636, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @PyThread_get_key_value, variables: !564)
!562 = !DISubroutineType(types: !563)
!563 = !{!85, !104}
!564 = !{!565}
!565 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !561, file: !455, line: 635, type: !104)
!566 = !DISubprogram(name: "PyThread_ReInitTLS", scope: !455, file: !455, line: 641, type: !451, isLocal: false, isDefinition: true, scopeLine: 642, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyThread_ReInitTLS, variables: !453)
!567 = !DISubprogram(name: "PyThread_get_stacksize", scope: !1, file: !1, line: 103, type: !568, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, function: i64 ()* @PyThread_get_stacksize, variables: !453)
!568 = !DISubroutineType(types: !569)
!569 = !{!192}
!570 = !DISubprogram(name: "PyThread_set_stacksize", scope: !1, file: !1, line: 114, type: !571, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i64)* @PyThread_set_stacksize, variables: !573)
!571 = !DISubroutineType(types: !572)
!572 = !{!104, !192}
!573 = !{!574}
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !570, file: !1, line: 114, type: !192)
!575 = !DISubprogram(name: "PyThread_GetInfo", scope: !1, file: !1, line: 388, type: !576, isLocal: false, isDefinition: true, scopeLine: 389, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyThread_GetInfo, variables: !578)
!576 = !DISubroutineType(types: !577)
!577 = !{!106}
!578 = !{!579, !580, !581, !582, !586, !587, !591}
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "threadinfo", scope: !575, file: !1, line: 390, type: !106)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !575, file: !1, line: 390, type: !106)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !575, file: !1, line: 391, type: !104)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !575, file: !1, line: 394, type: !583)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 2040, align: 8, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 255)
!586 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !575, file: !1, line: 395, type: !104)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !588, file: !1, line: 409, type: !106)
!588 = distinct !DILexicalBlock(scope: !589, file: !1, line: 409, column: 9)
!589 = distinct !DILexicalBlock(scope: !590, file: !1, line: 408, column: 24)
!590 = distinct !DILexicalBlock(scope: !575, file: !1, line: 408, column: 9)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !592, file: !1, line: 421, type: !106)
!592 = distinct !DILexicalBlock(scope: !593, file: !1, line: 421, column: 9)
!593 = distinct !DILexicalBlock(scope: !594, file: !1, line: 420, column: 24)
!594 = distinct !DILexicalBlock(scope: !575, file: !1, line: 420, column: 9)
!595 = !DISubprogram(name: "PyThread__init_thread", scope: !455, file: !455, line: 170, type: !451, isLocal: true, isDefinition: true, scopeLine: 171, flags: DIFlagPrototyped, isOptimized: true, variables: !453)
!596 = !DISubprogram(name: "fix_status", scope: !455, file: !455, line: 326, type: !597, isLocal: true, isDefinition: true, scopeLine: 327, flags: DIFlagPrototyped, isOptimized: true, variables: !599)
!597 = !DISubroutineType(types: !598)
!598 = !{!104, !104}
!599 = !{!600}
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 1, scope: !596, file: !455, line: 326, type: !104)
!601 = !DISubprogram(name: "_pythread_pthread_set_stacksize", scope: !455, file: !455, line: 564, type: !571, isLocal: true, isDefinition: true, scopeLine: 565, flags: DIFlagPrototyped, isOptimized: true, variables: !602)
!602 = !{!603, !604, !605, !606}
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !601, file: !455, line: 564, type: !192)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "attrs", scope: !601, file: !455, line: 567, type: !466)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tss_min", scope: !601, file: !455, line: 568, type: !192)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !601, file: !455, line: 569, type: !104)
!607 = !{!608, !609, !611, !612, !626, !630}
!608 = !DIGlobalVariable(name: "initialized", scope: !0, file: !1, line: 55, type: !104, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariable(name: "ThreadInfoType", scope: !0, file: !1, line: 385, type: !610, isLocal: true, isDefinition: true, variable: %struct._typeobject* @ThreadInfoType)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !108, line: 422, baseType: !120)
!611 = !DIGlobalVariable(name: "_pythread_stacksize", scope: !0, file: !1, line: 82, type: !192, isLocal: true, isDefinition: true, variable: i64* @_pythread_stacksize)
!612 = !DIGlobalVariable(name: "threadinfo_desc", scope: !0, file: !1, line: 378, type: !613, isLocal: true, isDefinition: true, variable: %struct.PyStructSequence_Desc* @threadinfo_desc)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStructSequence_Desc", file: !614, line: 20, baseType: !615)
!614 = !DIFile(filename: "Include/structseq.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyStructSequence_Desc", file: !614, line: 15, size: 256, align: 64, elements: !616)
!616 = !{!617, !618, !619, !625}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !615, file: !614, line: 16, baseType: !150, size: 64, align: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !615, file: !614, line: 17, baseType: !150, size: 64, align: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !615, file: !614, line: 18, baseType: !620, size: 64, align: 64, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64, align: 64)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyStructSequence_Field", file: !614, line: 10, size: 128, align: 64, elements: !622)
!622 = !{!623, !624}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !621, file: !614, line: 11, baseType: !150, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !621, file: !614, line: 12, baseType: !150, size: 64, align: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "n_in_sequence", scope: !615, file: !614, line: 19, baseType: !104, size: 32, align: 32, offset: 192)
!626 = !DIGlobalVariable(name: "threadinfo__doc__", scope: !0, file: !1, line: 366, type: !627, isLocal: true, isDefinition: true, variable: [88 x i8]* @threadinfo__doc__)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 704, align: 8, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 88)
!630 = !DIGlobalVariable(name: "threadinfo_fields", scope: !0, file: !1, line: 371, type: !631, isLocal: true, isDefinition: true, variable: [4 x %struct.PyStructSequence_Field]* @threadinfo_fields)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 512, align: 64, elements: !633)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStructSequence_Field", file: !614, line: 13, baseType: !621)
!633 = !{!634}
!634 = !DISubrange(count: 4)
!635 = !{i32 2, !"Dwarf Version", i32 4}
!636 = !{i32 2, !"Debug Info Version", i32 3}
!637 = !{!"clang version 3.7.0 (tags/RELEASE_370/final)"}
!638 = !DILocation(line: 72, column: 9, scope: !450)
!639 = !DILocation(line: 77, column: 1, scope: !450)
!640 = !DILocation(line: 77, column: 1, scope: !641)
!641 = !DILexicalBlockFile(scope: !450, file: !1, discriminator: 1)
!642 = !DIExpression()
!643 = !DILocation(line: 186, column: 34, scope: !454)
!644 = !DILocation(line: 186, column: 55, scope: !454)
!645 = !DILocation(line: 188, column: 5, scope: !454)
!646 = !DILocation(line: 191, column: 5, scope: !454)
!647 = !DILocation(line: 198, column: 9, scope: !454)
!648 = !DILocation(line: 199, column: 9, scope: !649)
!649 = distinct !DILexicalBlock(scope: !454, file: !455, line: 198, column: 9)
!650 = !DILocation(line: 191, column: 20, scope: !454)
!651 = !DILocation(line: 202, column: 9, scope: !652)
!652 = distinct !DILexicalBlock(scope: !454, file: !455, line: 202, column: 9)
!653 = !DILocation(line: 202, column: 35, scope: !652)
!654 = !DILocation(line: 202, column: 9, scope: !454)
!655 = !DILocation(line: 206, column: 12, scope: !454)
!656 = !{!657, !657, i64 0}
!657 = !{!"long", !658, i64 0}
!658 = !{!"omnipotent char", !659, i64 0}
!659 = !{!"Simple C/C++ TBAA"}
!660 = !DILocation(line: 206, column: 32, scope: !454)
!661 = !DILocation(line: 194, column: 17, scope: !454)
!662 = !DILocation(line: 208, column: 9, scope: !454)
!663 = !DILocation(line: 209, column: 13, scope: !664)
!664 = distinct !DILexicalBlock(scope: !665, file: !455, line: 209, column: 13)
!665 = distinct !DILexicalBlock(scope: !666, file: !455, line: 208, column: 19)
!666 = distinct !DILexicalBlock(scope: !454, file: !455, line: 208, column: 9)
!667 = !DILocation(line: 209, column: 52, scope: !664)
!668 = !DILocation(line: 209, column: 13, scope: !665)
!669 = !DILocation(line: 210, column: 13, scope: !670)
!670 = distinct !DILexicalBlock(scope: !664, file: !455, line: 209, column: 58)
!671 = !DILocation(line: 211, column: 13, scope: !670)
!672 = !DILocation(line: 216, column: 5, scope: !454)
!673 = !DILocation(line: 225, column: 30, scope: !454)
!674 = !DILocation(line: 188, column: 15, scope: !454)
!675 = !DILocation(line: 219, column: 14, scope: !454)
!676 = !DILocation(line: 189, column: 9, scope: !454)
!677 = !DILocation(line: 230, column: 5, scope: !454)
!678 = !DILocation(line: 232, column: 16, scope: !679)
!679 = distinct !DILexicalBlock(scope: !454, file: !455, line: 232, column: 9)
!680 = !DILocation(line: 232, column: 9, scope: !454)
!681 = !DILocation(line: 235, column: 20, scope: !454)
!682 = !DILocation(line: 235, column: 5, scope: !454)
!683 = !DILocation(line: 238, column: 19, scope: !454)
!684 = !DILocation(line: 238, column: 5, scope: !454)
!685 = !DILocation(line: 242, column: 1, scope: !454)
!686 = !DILocation(line: 253, column: 5, scope: !475)
!687 = !DILocation(line: 254, column: 9, scope: !475)
!688 = !DILocation(line: 255, column: 9, scope: !689)
!689 = distinct !DILexicalBlock(scope: !475, file: !455, line: 254, column: 9)
