; ModuleID = 'tokenizer.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !24, subprograms: !437, globals: !876)
!1 = !DIFile(filename: "Parser/tokenizer.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "decoding_state", file: !4, line: 15, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Parser/tokenizer.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "STATE_INIT", value: 0)
!7 = !DIEnumerator(name: "STATE_RAW", value: 1)
!8 = !DIEnumerator(name: "STATE_NORMAL", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 47, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "_ISupper", value: 256)
!13 = !DIEnumerator(name: "_ISlower", value: 512)
!14 = !DIEnumerator(name: "_ISalpha", value: 1024)
!15 = !DIEnumerator(name: "_ISdigit", value: 2048)
!16 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!17 = !DIEnumerator(name: "_ISspace", value: 8192)
!18 = !DIEnumerator(name: "_ISprint", value: 16384)
!19 = !DIEnumerator(name: "_ISgraph", value: 32768)
!20 = !DIEnumerator(name: "_ISblank", value: 1)
!21 = !DIEnumerator(name: "_IScntrl", value: 2)
!22 = !DIEnumerator(name: "_ISpunct", value: 4)
!23 = !DIEnumerator(name: "_ISalnum", value: 8)
!24 = !{!25, !26, !28, !364, !402, !410, !115, !411, !413, !52, !66, !98, !415, !416, !417, !418}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !30, line: 109, baseType: !31)
!30 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !30, line: 105, size: 128, align: 64, elements: !32)
!32 = !{!33, !41}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !31, file: !30, line: 107, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !35, line: 177, baseType: !36)
!35 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !37, line: 102, baseType: !38)
!37 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !39, line: 181, baseType: !40)
!39 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!40 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !31, file: !30, line: 108, baseType: !42, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !30, line: 334, size: 3200, align: 64, elements: !44)
!44 = !{!45, !51, !54, !55, !56, !61, !123, !128, !133, !134, !139, !191, !222, !234, !240, !241, !242, !244, !246, !277, !278, !279, !288, !289, !294, !295, !297, !299, !309, !312, !330, !331, !332, !334, !336, !337, !339, !344, !349, !354, !355, !356, !357, !358, !359, !360, !361, !363}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !43, file: !30, line: 335, baseType: !46, size: 192, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !30, line: 114, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, file: !30, line: 111, size: 192, align: 64, elements: !48)
!48 = !{!49, !50}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !47, file: !30, line: 112, baseType: !29, size: 128, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !47, file: !30, line: 113, baseType: !34, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !43, file: !30, line: 336, baseType: !52, size: 64, align: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !43, file: !30, line: 337, baseType: !34, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !43, file: !30, line: 337, baseType: !34, size: 64, align: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !43, file: !30, line: 341, baseType: !57, size: 64, align: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !30, line: 308, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !28}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !43, file: !30, line: 342, baseType: !62, size: 64, align: 64, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !30, line: 314, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!66, !28, !67, !66}
!66 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !37, line: 48, baseType: !69)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !70, line: 246, size: 1728, align: 64, elements: !71)
!70 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !92, !93, !94, !95, !97, !99, !101, !105, !108, !110, !111, !112, !113, !114, !118, !119}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !69, file: !70, line: 247, baseType: !66, size: 32, align: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !69, file: !70, line: 252, baseType: !26, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !69, file: !70, line: 253, baseType: !26, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !69, file: !70, line: 254, baseType: !26, size: 64, align: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !69, file: !70, line: 255, baseType: !26, size: 64, align: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !69, file: !70, line: 256, baseType: !26, size: 64, align: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !69, file: !70, line: 257, baseType: !26, size: 64, align: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !69, file: !70, line: 258, baseType: !26, size: 64, align: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !69, file: !70, line: 259, baseType: !26, size: 64, align: 64, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !69, file: !70, line: 261, baseType: !26, size: 64, align: 64, offset: 576)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !69, file: !70, line: 262, baseType: !26, size: 64, align: 64, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !69, file: !70, line: 263, baseType: !26, size: 64, align: 64, offset: 704)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !69, file: !70, line: 265, baseType: !85, size: 64, align: 64, offset: 768)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !70, line: 161, size: 192, align: 64, elements: !87)
!87 = !{!88, !89, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !86, file: !70, line: 162, baseType: !85, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !86, file: !70, line: 163, baseType: !90, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !86, file: !70, line: 167, baseType: !66, size: 32, align: 32, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !69, file: !70, line: 267, baseType: !90, size: 64, align: 64, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !69, file: !70, line: 269, baseType: !66, size: 32, align: 32, offset: 896)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !69, file: !70, line: 273, baseType: !66, size: 32, align: 32, offset: 928)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !69, file: !70, line: 275, baseType: !96, size: 64, align: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !39, line: 140, baseType: !40)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !69, file: !70, line: 279, baseType: !98, size: 16, align: 16, offset: 1024)
!98 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !69, file: !70, line: 280, baseType: !100, size: 8, align: 8, offset: 1040)
!100 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !69, file: !70, line: 281, baseType: !102, size: 8, align: 8, offset: 1048)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, align: 8, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 1)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !69, file: !70, line: 285, baseType: !106, size: 64, align: 64, offset: 1088)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !70, line: 155, baseType: null)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !69, file: !70, line: 294, baseType: !109, size: 64, align: 64, offset: 1152)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !39, line: 141, baseType: !40)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !69, file: !70, line: 303, baseType: !25, size: 64, align: 64, offset: 1216)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !69, file: !70, line: 304, baseType: !25, size: 64, align: 64, offset: 1280)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !69, file: !70, line: 305, baseType: !25, size: 64, align: 64, offset: 1344)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !69, file: !70, line: 306, baseType: !25, size: 64, align: 64, offset: 1408)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !69, file: !70, line: 307, baseType: !115, size: 64, align: 64, offset: 1472)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !116, line: 62, baseType: !117)
!116 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!117 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !69, file: !70, line: 309, baseType: !66, size: 32, align: 32, offset: 1536)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !69, file: !70, line: 311, baseType: !120, size: 160, align: 8, offset: 1568)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, align: 8, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 20)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !43, file: !30, line: 343, baseType: !124, size: 64, align: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !30, line: 316, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!28, !28, !26}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !43, file: !30, line: 344, baseType: !129, size: 64, align: 64, offset: 576)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !30, line: 318, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!66, !28, !26, !28}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !43, file: !30, line: 345, baseType: !25, size: 64, align: 64, offset: 640)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !43, file: !30, line: 346, baseType: !135, size: 64, align: 64, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !30, line: 320, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!28, !28}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !43, file: !30, line: 350, baseType: !140, size: 64, align: 64, offset: 768)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !30, line: 278, baseType: !142)
!142 = !DICompositeType(tag: DW_TAG_structure_type, file: !30, line: 236, size: 2176, align: 64, elements: !143)
!143 = !{!144, !149, !150, !151, !152, !153, !158, !160, !161, !162, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !142, file: !30, line: 241, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !30, line: 166, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!28, !28, !28}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !142, file: !30, line: 242, baseType: !145, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !142, file: !30, line: 243, baseType: !145, size: 64, align: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !142, file: !30, line: 244, baseType: !145, size: 64, align: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !142, file: !30, line: 245, baseType: !145, size: 64, align: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !142, file: !30, line: 246, baseType: !154, size: 64, align: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !30, line: 167, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!28, !28, !28, !28}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !142, file: !30, line: 247, baseType: !159, size: 64, align: 64, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !30, line: 165, baseType: !136)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !142, file: !30, line: 248, baseType: !159, size: 64, align: 64, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !142, file: !30, line: 249, baseType: !159, size: 64, align: 64, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !142, file: !30, line: 250, baseType: !163, size: 64, align: 64, offset: 576)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !30, line: 168, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!66, !28}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !142, file: !30, line: 251, baseType: !159, size: 64, align: 64, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !142, file: !30, line: 252, baseType: !145, size: 64, align: 64, offset: 704)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !142, file: !30, line: 253, baseType: !145, size: 64, align: 64, offset: 768)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !142, file: !30, line: 254, baseType: !145, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !142, file: !30, line: 255, baseType: !145, size: 64, align: 64, offset: 896)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !142, file: !30, line: 256, baseType: !145, size: 64, align: 64, offset: 960)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !142, file: !30, line: 257, baseType: !159, size: 64, align: 64, offset: 1024)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !142, file: !30, line: 258, baseType: !25, size: 64, align: 64, offset: 1088)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !142, file: !30, line: 259, baseType: !159, size: 64, align: 64, offset: 1152)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !142, file: !30, line: 261, baseType: !145, size: 64, align: 64, offset: 1216)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !142, file: !30, line: 262, baseType: !145, size: 64, align: 64, offset: 1280)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !142, file: !30, line: 263, baseType: !145, size: 64, align: 64, offset: 1344)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !142, file: !30, line: 264, baseType: !145, size: 64, align: 64, offset: 1408)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !142, file: !30, line: 265, baseType: !154, size: 64, align: 64, offset: 1472)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !142, file: !30, line: 266, baseType: !145, size: 64, align: 64, offset: 1536)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !142, file: !30, line: 267, baseType: !145, size: 64, align: 64, offset: 1600)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !142, file: !30, line: 268, baseType: !145, size: 64, align: 64, offset: 1664)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !142, file: !30, line: 269, baseType: !145, size: 64, align: 64, offset: 1728)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !142, file: !30, line: 270, baseType: !145, size: 64, align: 64, offset: 1792)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !142, file: !30, line: 272, baseType: !145, size: 64, align: 64, offset: 1856)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !142, file: !30, line: 273, baseType: !145, size: 64, align: 64, offset: 1920)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !142, file: !30, line: 274, baseType: !145, size: 64, align: 64, offset: 1984)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !142, file: !30, line: 275, baseType: !145, size: 64, align: 64, offset: 2048)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !142, file: !30, line: 277, baseType: !159, size: 64, align: 64, offset: 2112)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !43, file: !30, line: 351, baseType: !192, size: 64, align: 64, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !30, line: 292, baseType: !194)
!194 = !DICompositeType(tag: DW_TAG_structure_type, file: !30, line: 280, size: 640, align: 64, elements: !195)
!195 = !{!196, !201, !202, !207, !208, !209, !214, !215, !220, !221}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !194, file: !30, line: 281, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !30, line: 169, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!34, !28}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !194, file: !30, line: 282, baseType: !145, size: 64, align: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !194, file: !30, line: 283, baseType: !203, size: 64, align: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !30, line: 170, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!28, !28, !34}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !194, file: !30, line: 284, baseType: !203, size: 64, align: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !194, file: !30, line: 285, baseType: !25, size: 64, align: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !194, file: !30, line: 286, baseType: !210, size: 64, align: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !30, line: 172, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!66, !28, !34, !28}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !194, file: !30, line: 287, baseType: !25, size: 64, align: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !194, file: !30, line: 288, baseType: !216, size: 64, align: 64, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !30, line: 231, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!66, !28, !28}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !194, file: !30, line: 290, baseType: !145, size: 64, align: 64, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !194, file: !30, line: 291, baseType: !203, size: 64, align: 64, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !43, file: !30, line: 352, baseType: !223, size: 64, align: 64, offset: 896)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !30, line: 298, baseType: !225)
!225 = !DICompositeType(tag: DW_TAG_structure_type, file: !30, line: 294, size: 192, align: 64, elements: !226)
!226 = !{!227, !228, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !225, file: !30, line: 295, baseType: !197, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !225, file: !30, line: 296, baseType: !145, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !225, file: !30, line: 297, baseType: !230, size: 64, align: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !30, line: 174, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!66, !28, !28, !28}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !43, file: !30, line: 356, baseType: !235, size: 64, align: 64, offset: 960)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !30, line: 321, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!239, !28}
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !35, line: 186, baseType: !34)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !43, file: !30, line: 357, baseType: !154, size: 64, align: 64, offset: 1024)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !43, file: !30, line: 358, baseType: !135, size: 64, align: 64, offset: 1088)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !43, file: !30, line: 359, baseType: !243, size: 64, align: 64, offset: 1152)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !30, line: 317, baseType: !146)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !43, file: !30, line: 360, baseType: !245, size: 64, align: 64, offset: 1216)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !30, line: 319, baseType: !231)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !43, file: !30, line: 363, baseType: !247, size: 64, align: 64, offset: 1280)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !30, line: 304, baseType: !249)
!249 = !DICompositeType(tag: DW_TAG_structure_type, file: !30, line: 301, size: 128, align: 64, elements: !250)
!250 = !{!251, !272}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !249, file: !30, line: 302, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !30, line: 193, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!66, !28, !256, !66}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !30, line: 191, baseType: !258)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !30, line: 178, size: 640, align: 64, elements: !259)
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !269, !270, !271}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !258, file: !30, line: 179, baseType: !25, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !258, file: !30, line: 180, baseType: !28, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !258, file: !30, line: 181, baseType: !34, size: 64, align: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !258, file: !30, line: 182, baseType: !34, size: 64, align: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !258, file: !30, line: 184, baseType: !66, size: 32, align: 32, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !258, file: !30, line: 185, baseType: !66, size: 32, align: 32, offset: 288)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !258, file: !30, line: 186, baseType: !26, size: 64, align: 64, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !258, file: !30, line: 187, baseType: !268, size: 64, align: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !258, file: !30, line: 188, baseType: !268, size: 64, align: 64, offset: 448)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !258, file: !30, line: 189, baseType: !268, size: 64, align: 64, offset: 512)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !258, file: !30, line: 190, baseType: !25, size: 64, align: 64, offset: 576)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !249, file: !30, line: 303, baseType: !273, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !30, line: 194, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !28, !256}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !43, file: !30, line: 366, baseType: !117, size: 64, align: 64, offset: 1344)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !43, file: !30, line: 368, baseType: !52, size: 64, align: 64, offset: 1408)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !43, file: !30, line: 372, baseType: !280, size: 64, align: 64, offset: 1472)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !30, line: 233, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!66, !28, !284, !25}
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !30, line: 232, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!66, !28, !25}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !43, file: !30, line: 375, baseType: !163, size: 64, align: 64, offset: 1536)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !43, file: !30, line: 379, baseType: !290, size: 64, align: 64, offset: 1600)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !30, line: 322, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!28, !28, !28, !66}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !43, file: !30, line: 382, baseType: !34, size: 64, align: 64, offset: 1664)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !43, file: !30, line: 385, baseType: !296, size: 64, align: 64, offset: 1728)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !30, line: 323, baseType: !136)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !43, file: !30, line: 386, baseType: !298, size: 64, align: 64, offset: 1792)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !30, line: 324, baseType: !136)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !43, file: !30, line: 389, baseType: !300, size: 64, align: 64, offset: 1856)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !302, line: 40, size: 256, align: 64, elements: !303)
!302 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!303 = !{!304, !305, !307, !308}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !301, file: !302, line: 41, baseType: !52, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !301, file: !302, line: 42, baseType: !306, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !302, line: 18, baseType: !146)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !301, file: !302, line: 43, baseType: !66, size: 32, align: 32, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !301, file: !302, line: 45, baseType: !52, size: 64, align: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !43, file: !30, line: 390, baseType: !310, size: 64, align: 64, offset: 1920)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !30, line: 390, flags: DIFlagFwdDecl)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !43, file: !30, line: 391, baseType: !313, size: 64, align: 64, offset: 1984)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !315, line: 11, size: 320, align: 64, elements: !316)
!315 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!316 = !{!317, !318, !323, !328, !329}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !314, file: !315, line: 12, baseType: !26, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !314, file: !315, line: 13, baseType: !319, size: 64, align: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !315, line: 8, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!28, !28, !25}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !314, file: !315, line: 14, baseType: !324, size: 64, align: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !315, line: 9, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!66, !28, !28, !25}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !314, file: !315, line: 15, baseType: !26, size: 64, align: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !314, file: !315, line: 16, baseType: !25, size: 64, align: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !43, file: !30, line: 392, baseType: !42, size: 64, align: 64, offset: 2048)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !43, file: !30, line: 393, baseType: !28, size: 64, align: 64, offset: 2112)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !43, file: !30, line: 394, baseType: !333, size: 64, align: 64, offset: 2176)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !30, line: 325, baseType: !155)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !43, file: !30, line: 395, baseType: !335, size: 64, align: 64, offset: 2240)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !30, line: 326, baseType: !231)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !43, file: !30, line: 396, baseType: !34, size: 64, align: 64, offset: 2304)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !43, file: !30, line: 397, baseType: !338, size: 64, align: 64, offset: 2368)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !30, line: 327, baseType: !231)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !43, file: !30, line: 398, baseType: !340, size: 64, align: 64, offset: 2432)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !30, line: 329, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!28, !42, !34}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !43, file: !30, line: 399, baseType: !345, size: 64, align: 64, offset: 2496)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !30, line: 328, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!28, !42, !28, !28}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !43, file: !30, line: 400, baseType: !350, size: 64, align: 64, offset: 2560)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !30, line: 307, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !25}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !43, file: !30, line: 401, baseType: !163, size: 64, align: 64, offset: 2624)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !43, file: !30, line: 402, baseType: !28, size: 64, align: 64, offset: 2688)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !43, file: !30, line: 403, baseType: !28, size: 64, align: 64, offset: 2752)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !43, file: !30, line: 404, baseType: !28, size: 64, align: 64, offset: 2816)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !43, file: !30, line: 405, baseType: !28, size: 64, align: 64, offset: 2880)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !43, file: !30, line: 406, baseType: !28, size: 64, align: 64, offset: 2944)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !43, file: !30, line: 407, baseType: !57, size: 64, align: 64, offset: 3008)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !43, file: !30, line: 410, baseType: !362, size: 32, align: 32, offset: 3072)
!362 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !43, file: !30, line: 412, baseType: !57, size: 64, align: 64, offset: 3136)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "tok_state", file: !4, line: 22, size: 7936, align: 64, elements: !366)
!366 = !{!367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !365, file: !4, line: 25, baseType: !26, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !365, file: !4, line: 26, baseType: !26, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "inp", scope: !365, file: !4, line: 27, baseType: !26, size: 64, align: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !365, file: !4, line: 28, baseType: !26, size: 64, align: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !365, file: !4, line: 29, baseType: !26, size: 64, align: 64, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !365, file: !4, line: 30, baseType: !66, size: 32, align: 32, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !365, file: !4, line: 32, baseType: !67, size: 64, align: 64, offset: 384)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tabsize", scope: !365, file: !4, line: 33, baseType: !66, size: 32, align: 32, offset: 448)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "indent", scope: !365, file: !4, line: 34, baseType: !66, size: 32, align: 32, offset: 480)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "indstack", scope: !365, file: !4, line: 35, baseType: !377, size: 3200, align: 32, offset: 512)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 3200, align: 32, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 100)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "atbol", scope: !365, file: !4, line: 36, baseType: !66, size: 32, align: 32, offset: 3712)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pendin", scope: !365, file: !4, line: 37, baseType: !66, size: 32, align: 32, offset: 3744)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "prompt", scope: !365, file: !4, line: 38, baseType: !52, size: 64, align: 64, offset: 3776)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "nextprompt", scope: !365, file: !4, line: 38, baseType: !52, size: 64, align: 64, offset: 3840)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !365, file: !4, line: 39, baseType: !66, size: 32, align: 32, offset: 3904)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !365, file: !4, line: 40, baseType: !66, size: 32, align: 32, offset: 3936)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !365, file: !4, line: 48, baseType: !28, size: 64, align: 64, offset: 3968)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "altwarning", scope: !365, file: !4, line: 50, baseType: !66, size: 32, align: 32, offset: 4032)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "alterror", scope: !365, file: !4, line: 51, baseType: !66, size: 32, align: 32, offset: 4064)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "alttabsize", scope: !365, file: !4, line: 52, baseType: !66, size: 32, align: 32, offset: 4096)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "altindstack", scope: !365, file: !4, line: 53, baseType: !377, size: 3200, align: 32, offset: 4128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "decoding_state", scope: !365, file: !4, line: 55, baseType: !3, size: 32, align: 32, offset: 7328)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "decoding_erred", scope: !365, file: !4, line: 56, baseType: !66, size: 32, align: 32, offset: 7360)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "read_coding_spec", scope: !365, file: !4, line: 57, baseType: !66, size: 32, align: 32, offset: 7392)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !365, file: !4, line: 58, baseType: !26, size: 64, align: 64, offset: 7424)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "cont_line", scope: !365, file: !4, line: 59, baseType: !66, size: 32, align: 32, offset: 7488)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "line_start", scope: !365, file: !4, line: 60, baseType: !52, size: 64, align: 64, offset: 7552)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "decoding_readline", scope: !365, file: !4, line: 62, baseType: !28, size: 64, align: 64, offset: 7616)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "decoding_buffer", scope: !365, file: !4, line: 63, baseType: !28, size: 64, align: 64, offset: 7680)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "enc", scope: !365, file: !4, line: 65, baseType: !52, size: 64, align: 64, offset: 7744)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !365, file: !4, line: 66, baseType: !52, size: 64, align: 64, offset: 7808)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !365, file: !4, line: 67, baseType: !52, size: 64, align: 64, offset: 7872)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !404, line: 41, baseType: !405)
!404 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!405 = !DICompositeType(tag: DW_TAG_structure_type, file: !404, line: 31, size: 320, align: 64, elements: !406)
!406 = !{!407, !408, !409}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !405, file: !404, line: 32, baseType: !46, size: 192, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !405, file: !404, line: 33, baseType: !239, size: 64, align: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !405, file: !404, line: 34, baseType: !102, size: 8, align: 8, offset: 256)
!410 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !37, line: 92, baseType: !109)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !420, line: 351, baseType: !421)
!420 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!421 = !DICompositeType(tag: DW_TAG_structure_type, file: !420, line: 217, size: 384, align: 64, elements: !422)
!422 = !{!423, !424, !425, !426, !434}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !421, file: !420, line: 291, baseType: !29, size: 128, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !421, file: !420, line: 292, baseType: !34, size: 64, align: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !421, file: !420, line: 293, baseType: !239, size: 64, align: 64, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !421, file: !420, line: 349, baseType: !427, size: 32, align: 32, offset: 256)
!427 = !DICompositeType(tag: DW_TAG_structure_type, scope: !421, file: !420, line: 294, size: 32, align: 32, elements: !428)
!428 = !{!429, !430, !431, !432, !433}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !427, file: !420, line: 303, baseType: !362, size: 2, align: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !427, file: !420, line: 331, baseType: !362, size: 3, align: 32, offset: 2)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !427, file: !420, line: 336, baseType: !362, size: 1, align: 32, offset: 5)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !427, file: !420, line: 340, baseType: !362, size: 1, align: 32, offset: 6)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !427, file: !420, line: 345, baseType: !362, size: 1, align: 32, offset: 7)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !421, file: !420, line: 350, baseType: !435, size: 64, align: 64, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !116, line: 90, baseType: !66)
!437 = !{!438, !445, !450, !459, !479, !484, !490, !497, !506, !517, !522, !527, !542, !562, !570, !573, !577, !581, !586, !596, !622, !642, !686, !689, !702, !740, !783, !796, !816, !819, !823, !847, !854, !860, !866, !869}
!438 = !DISubprogram(name: "PyTokenizer_FromString", scope: !1, file: !1, line: 798, type: !439, isLocal: false, isDefinition: true, scopeLine: 799, flags: DIFlagPrototyped, isOptimized: true, function: %struct.tok_state* (i8*, i32)* @PyTokenizer_FromString, variables: !441)
!439 = !DISubroutineType(types: !440)
!440 = !{!364, !52, !66}
!441 = !{!442, !443, !444}
!442 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !438, file: !1, line: 798, type: !52)
!443 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exec_input", arg: 2, scope: !438, file: !1, line: 798, type: !66)
!444 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tok", scope: !438, file: !1, line: 800, type: !364)
!445 = !DISubprogram(name: "PyTokenizer_FromUTF8", scope: !1, file: !1, line: 815, type: !439, isLocal: false, isDefinition: true, scopeLine: 816, flags: DIFlagPrototyped, isOptimized: true, function: %struct.tok_state* (i8*, i32)* @PyTokenizer_FromUTF8, variables: !446)
!446 = !{!447, !448, !449}
!447 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !445, file: !1, line: 815, type: !52)
!448 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exec_input", arg: 2, scope: !445, file: !1, line: 815, type: !66)
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tok", scope: !445, file: !1, line: 817, type: !364)
!450 = !DISubprogram(name: "PyTokenizer_FromFile", scope: !1, file: !1, line: 846, type: !451, isLocal: false, isDefinition: true, scopeLine: 848, flags: DIFlagPrototyped, isOptimized: true, function: %struct.tok_state* (%struct._IO_FILE*, i8*, i8*, i8*)* @PyTokenizer_FromFile, variables: !453)
!451 = !DISubroutineType(types: !452)
!452 = !{!364, !67, !52, !52, !52}
!453 = !{!454, !455, !456, !457, !458}
!454 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !450, file: !1, line: 846, type: !67)
!455 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "enc", arg: 2, scope: !450, file: !1, line: 846, type: !52)
!456 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ps1", arg: 3, scope: !450, file: !1, line: 847, type: !52)
!457 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ps2", arg: 4, scope: !450, file: !1, line: 847, type: !52)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tok", scope: !450, file: !1, line: 849, type: !364)
!459 = !DISubprogram(name: "PyTokenizer_Free", scope: !1, file: !1, line: 879, type: !460, isLocal: false, isDefinition: true, scopeLine: 880, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.tok_state*)* @PyTokenizer_Free, variables: !462)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !364}
!462 = !{!463, !464, !466, !469, !471, !474, !476}
!463 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 1, scope: !459, file: !1, line: 879, type: !364)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !465, file: !1, line: 884, type: !28)
!465 = distinct !DILexicalBlock(scope: !459, file: !1, line: 884, column: 5)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !467, file: !1, line: 884, type: !28)
!467 = distinct !DILexicalBlock(scope: !468, file: !1, line: 884, column: 5)
!468 = distinct !DILexicalBlock(scope: !465, file: !1, line: 884, column: 5)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !470, file: !1, line: 885, type: !28)
!470 = distinct !DILexicalBlock(scope: !459, file: !1, line: 885, column: 5)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !472, file: !1, line: 885, type: !28)
!472 = distinct !DILexicalBlock(scope: !473, file: !1, line: 885, column: 5)
!473 = distinct !DILexicalBlock(scope: !470, file: !1, line: 885, column: 5)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !475, file: !1, line: 886, type: !28)
!475 = distinct !DILexicalBlock(scope: !459, file: !1, line: 886, column: 5)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !477, file: !1, line: 886, type: !28)
!477 = distinct !DILexicalBlock(scope: !478, file: !1, line: 886, column: 5)
!478 = distinct !DILexicalBlock(scope: !475, file: !1, line: 886, column: 5)
!479 = !DISubprogram(name: "PyToken_OneChar", scope: !1, file: !1, line: 1109, type: !480, isLocal: false, isDefinition: true, scopeLine: 1110, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @PyToken_OneChar, variables: !482)
!480 = !DISubroutineType(types: !481)
!481 = !{!66, !66}
!482 = !{!483}
!483 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !479, file: !1, line: 1109, type: !66)
!484 = !DISubprogram(name: "PyToken_TwoChars", scope: !1, file: !1, line: 1141, type: !485, isLocal: false, isDefinition: true, scopeLine: 1142, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32)* @PyToken_TwoChars, variables: !487)
!485 = !DISubroutineType(types: !486)
!486 = !{!66, !66, !66}
!487 = !{!488, !489}
!488 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c1", arg: 1, scope: !484, file: !1, line: 1141, type: !66)
!489 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c2", arg: 2, scope: !484, file: !1, line: 1141, type: !66)
!490 = !DISubprogram(name: "PyToken_ThreeChars", scope: !1, file: !1, line: 1215, type: !491, isLocal: false, isDefinition: true, scopeLine: 1216, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32)* @PyToken_ThreeChars, variables: !493)
!491 = !DISubroutineType(types: !492)
!492 = !{!66, !66, !66, !66}
!493 = !{!494, !495, !496}
!494 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c1", arg: 1, scope: !490, file: !1, line: 1215, type: !66)
!495 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c2", arg: 2, scope: !490, file: !1, line: 1215, type: !66)
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c3", arg: 3, scope: !490, file: !1, line: 1215, type: !66)
!497 = !DISubprogram(name: "PyTokenizer_Get", scope: !1, file: !1, line: 1727, type: !498, isLocal: false, isDefinition: true, scopeLine: 1728, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.tok_state*, i8**, i8**)* @PyTokenizer_Get, variables: !501)
!498 = !DISubroutineType(types: !499)
!499 = !{!66, !364, !500, !500}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!501 = !{!502, !503, !504, !505}
!502 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 1, scope: !497, file: !1, line: 1727, type: !364)
!503 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_start", arg: 2, scope: !497, file: !1, line: 1727, type: !500)
!504 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_end", arg: 3, scope: !497, file: !1, line: 1727, type: !500)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !497, file: !1, line: 1729, type: !66)
!506 = !DISubprogram(name: "PyTokenizer_FindEncodingFilename", scope: !1, file: !1, line: 1748, type: !507, isLocal: false, isDefinition: true, scopeLine: 1749, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32, %struct._object*)* @PyTokenizer_FindEncodingFilename, variables: !509)
!507 = !DISubroutineType(types: !508)
!508 = !{!26, !66, !28}
!509 = !{!510, !511, !512, !513, !514, !515, !516}
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !506, file: !1, line: 1748, type: !66)
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 2, scope: !506, file: !1, line: 1748, type: !28)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tok", scope: !506, file: !1, line: 1750, type: !364)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !506, file: !1, line: 1751, type: !67)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p_start", scope: !506, file: !1, line: 1752, type: !26)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p_end", scope: !506, file: !1, line: 1752, type: !26)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "encoding", scope: !506, file: !1, line: 1752, type: !26)
!517 = !DISubprogram(name: "PyTokenizer_FindEncoding", scope: !1, file: !1, line: 1800, type: !518, isLocal: false, isDefinition: true, scopeLine: 1801, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32)* @PyTokenizer_FindEncoding, variables: !520)
!518 = !DISubroutineType(types: !519)
!519 = !{!26, !66}
!520 = !{!521}
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !517, file: !1, line: 1800, type: !66)
!522 = !DISubprogram(name: "tok_new", scope: !1, file: !1, line: 113, type: !523, isLocal: true, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true, variables: !525)
!523 = !DISubroutineType(types: !524)
!524 = !{!364}
!525 = !{!526}
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tok", scope: !522, file: !1, line: 115, type: !364)
!527 = !DISubprogram(name: "decode_str", scope: !1, file: !1, line: 738, type: !528, isLocal: true, isDefinition: true, scopeLine: 739, flags: DIFlagPrototyped, isOptimized: true, variables: !530)
!528 = !DISubroutineType(types: !529)
!529 = !{!52, !52, !66, !364}
!530 = !{!531, !532, !533, !534, !535, !536, !537, !541}
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !527, file: !1, line: 738, type: !52)
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "single", arg: 2, scope: !527, file: !1, line: 738, type: !66)
!533 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 3, scope: !527, file: !1, line: 738, type: !364)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "utf8", scope: !527, file: !1, line: 740, type: !28)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !527, file: !1, line: 741, type: !52)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !527, file: !1, line: 742, type: !52)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newl", scope: !527, file: !1, line: 743, type: !538)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 128, align: 64, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 2)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lineno", scope: !527, file: !1, line: 744, type: !66)
!542 = !DISubprogram(name: "check_bom", scope: !1, file: !1, line: 339, type: !543, isLocal: true, isDefinition: true, scopeLine: 343, flags: DIFlagPrototyped, isOptimized: true, variables: !554)
!543 = !DISubroutineType(types: !544)
!544 = !{!66, !545, !548, !551, !364}
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, align: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!66, !364}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64, align: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{null, !66, !364}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!66, !364, !52}
!554 = !{!555, !556, !557, !558, !559, !560, !561}
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "get_char", arg: 1, scope: !542, file: !1, line: 339, type: !545)
!556 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unget_char", arg: 2, scope: !542, file: !1, line: 340, type: !548)
!557 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "set_readline", arg: 3, scope: !542, file: !1, line: 341, type: !551)
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 4, scope: !542, file: !1, line: 342, type: !364)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch1", scope: !542, file: !1, line: 344, type: !66)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch2", scope: !542, file: !1, line: 344, type: !66)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch3", scope: !542, file: !1, line: 344, type: !66)
!562 = !DISubprogram(name: "new_string", scope: !1, file: !1, line: 150, type: !563, isLocal: true, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: true, variables: !565)
!563 = !DISubroutineType(types: !564)
!564 = !{!26, !52, !34, !364}
!565 = !{!566, !567, !568, !569}
!566 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !562, file: !1, line: 150, type: !52)
!567 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !562, file: !1, line: 150, type: !34)
!568 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 3, scope: !562, file: !1, line: 150, type: !364)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !562, file: !1, line: 152, type: !26)
!570 = !DISubprogram(name: "buf_getc", scope: !1, file: !1, line: 656, type: !546, isLocal: true, isDefinition: true, scopeLine: 656, flags: DIFlagPrototyped, isOptimized: true, variables: !571)
!571 = !{!572}
!572 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 1, scope: !570, file: !1, line: 656, type: !364)
!573 = !DISubprogram(name: "buf_ungetc", scope: !1, file: !1, line: 663, type: !549, isLocal: true, isDefinition: true, scopeLine: 663, flags: DIFlagPrototyped, isOptimized: true, variables: !574)
!574 = !{!575, !576}
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !573, file: !1, line: 663, type: !66)
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 2, scope: !573, file: !1, line: 663, type: !364)
!577 = !DISubprogram(name: "buf_setreadl", scope: !1, file: !1, line: 672, type: !552, isLocal: true, isDefinition: true, scopeLine: 672, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.tok_state*, i8*)* @buf_setreadl, variables: !578)
!578 = !{!579, !580}
!579 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 1, scope: !577, file: !1, line: 672, type: !364)
!580 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "enc", arg: 2, scope: !577, file: !1, line: 672, type: !52)
!581 = !DISubprogram(name: "error_ret", scope: !1, file: !1, line: 185, type: !582, isLocal: true, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: true, variables: !584)
!582 = !DISubroutineType(types: !583)
!583 = !{!26, !364}
!584 = !{!585}
!585 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 1, scope: !581, file: !1, line: 185, type: !364)
!586 = !DISubprogram(name: "translate_into_utf8", scope: !1, file: !1, line: 681, type: !587, isLocal: true, isDefinition: true, scopeLine: 681, flags: DIFlagPrototyped, isOptimized: true, variables: !589)
!587 = !DISubroutineType(types: !588)
!588 = !{!28, !52, !52}
!589 = !{!590, !591, !592, !593, !594}
!590 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !586, file: !1, line: 681, type: !52)
!591 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "enc", arg: 2, scope: !586, file: !1, line: 681, type: !52)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "utf8", scope: !586, file: !1, line: 682, type: !28)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !586, file: !1, line: 683, type: !28)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !595, file: !1, line: 687, type: !28)
!595 = distinct !DILexicalBlock(scope: !586, file: !1, line: 687, column: 5)
!596 = !DISubprogram(name: "check_coding_spec", scope: !1, file: !1, line: 280, type: !597, isLocal: true, isDefinition: true, scopeLine: 282, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i64, %struct.tok_state*, i32 (%struct.tok_state*, i8*)*)* @check_coding_spec, variables: !599)
!597 = !DISubroutineType(types: !598)
!598 = !{!66, !52, !34, !364, !551}
!599 = !{!600, !601, !602, !603, !604, !605, !606, !609, !614, !615, !617, !618, !621}
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "line", arg: 1, scope: !596, file: !1, line: 280, type: !52)
!601 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !596, file: !1, line: 280, type: !34)
!602 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 3, scope: !596, file: !1, line: 280, type: !364)
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "set_readline", arg: 4, scope: !596, file: !1, line: 281, type: !551)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cs", scope: !596, file: !1, line: 283, type: !26)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !596, file: !1, line: 284, type: !66)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !607, file: !1, line: 294, type: !34)
!607 = distinct !DILexicalBlock(scope: !608, file: !1, line: 293, column: 14)
!608 = distinct !DILexicalBlock(scope: !596, file: !1, line: 293, column: 9)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !610, file: !1, line: 310, type: !115)
!610 = distinct !DILexicalBlock(scope: !611, file: !1, line: 310, column: 13)
!611 = distinct !DILexicalBlock(scope: !612, file: !1, line: 310, column: 13)
!612 = distinct !DILexicalBlock(scope: !613, file: !1, line: 308, column: 32)
!613 = distinct !DILexicalBlock(scope: !596, file: !1, line: 308, column: 9)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !610, file: !1, line: 310, type: !115)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !616, file: !1, line: 310, type: !413)
!616 = distinct !DILexicalBlock(scope: !610, file: !1, line: 310, column: 13)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !616, file: !1, line: 310, type: !66)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !619, file: !1, line: 325, type: !115)
!619 = distinct !DILexicalBlock(scope: !620, file: !1, line: 325, column: 14)
!620 = distinct !DILexicalBlock(scope: !613, file: !1, line: 324, column: 12)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !619, file: !1, line: 325, type: !115)
!622 = !DISubprogram(name: "get_coding_spec", scope: !1, file: !1, line: 227, type: !623, isLocal: true, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, variables: !625)
!623 = !DISubroutineType(types: !624)
!624 = !{!66, !52, !500, !34, !364}
!625 = !{!626, !627, !628, !629, !630, !631, !635, !638, !641}
!626 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !622, file: !1, line: 227, type: !52)
!627 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "spec", arg: 2, scope: !622, file: !1, line: 227, type: !500)
!628 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 3, scope: !622, file: !1, line: 227, type: !34)
!629 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 4, scope: !622, file: !1, line: 227, type: !364)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !622, file: !1, line: 229, type: !34)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !632, file: !1, line: 240, type: !52)
!632 = distinct !DILexicalBlock(scope: !633, file: !1, line: 239, column: 31)
!633 = distinct !DILexicalBlock(scope: !634, file: !1, line: 239, column: 5)
!634 = distinct !DILexicalBlock(scope: !622, file: !1, line: 239, column: 5)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "begin", scope: !636, file: !1, line: 242, type: !52)
!636 = distinct !DILexicalBlock(scope: !637, file: !1, line: 241, column: 43)
!637 = distinct !DILexicalBlock(scope: !632, file: !1, line: 241, column: 13)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !639, file: !1, line: 256, type: !26)
!639 = distinct !DILexicalBlock(scope: !640, file: !1, line: 255, column: 28)
!640 = distinct !DILexicalBlock(scope: !636, file: !1, line: 255, column: 17)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !639, file: !1, line: 257, type: !26)
!642 = !DISubprogram(name: "get_normal_name", scope: !1, file: !1, line: 196, type: !643, isLocal: true, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: true, variables: !645)
!643 = !DISubroutineType(types: !644)
!644 = !{!26, !26}
!645 = !{!646, !647, !651, !652, !656, !660, !663, !664, !666, !667, !670, !671, !673, !674, !676, !677, !679, !680, !682, !683, !685}
!646 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !642, file: !1, line: 196, type: !26)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !642, file: !1, line: 198, type: !648)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 104, align: 8, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 13)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !642, file: !1, line: 199, type: !66)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !653, file: !1, line: 201, type: !66)
!653 = distinct !DILexicalBlock(scope: !654, file: !1, line: 200, column: 30)
!654 = distinct !DILexicalBlock(scope: !655, file: !1, line: 200, column: 5)
!655 = distinct !DILexicalBlock(scope: !642, file: !1, line: 200, column: 5)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__res", scope: !657, file: !1, line: 207, type: !66)
!657 = distinct !DILexicalBlock(scope: !658, file: !1, line: 207, column: 22)
!658 = distinct !DILexicalBlock(scope: !659, file: !1, line: 204, column: 18)
!659 = distinct !DILexicalBlock(scope: !653, file: !1, line: 202, column: 13)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !661, file: !1, line: 210, type: !115)
!661 = distinct !DILexicalBlock(scope: !662, file: !1, line: 210, column: 9)
!662 = distinct !DILexicalBlock(scope: !642, file: !1, line: 210, column: 9)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !661, file: !1, line: 210, type: !115)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !665, file: !1, line: 210, type: !413)
!665 = distinct !DILexicalBlock(scope: !661, file: !1, line: 210, column: 9)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !665, file: !1, line: 210, type: !66)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !668, file: !1, line: 213, type: !115)
!668 = distinct !DILexicalBlock(scope: !669, file: !1, line: 213, column: 14)
!669 = distinct !DILexicalBlock(scope: !662, file: !1, line: 213, column: 14)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !668, file: !1, line: 213, type: !115)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !672, file: !1, line: 213, type: !413)
!672 = distinct !DILexicalBlock(scope: !668, file: !1, line: 213, column: 14)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !672, file: !1, line: 213, type: !66)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !675, file: !1, line: 214, type: !115)
!675 = distinct !DILexicalBlock(scope: !669, file: !1, line: 214, column: 14)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !675, file: !1, line: 214, type: !115)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !678, file: !1, line: 214, type: !413)
!678 = distinct !DILexicalBlock(scope: !675, file: !1, line: 214, column: 14)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !678, file: !1, line: 214, type: !66)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !681, file: !1, line: 215, type: !115)
!681 = distinct !DILexicalBlock(scope: !669, file: !1, line: 215, column: 14)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !681, file: !1, line: 215, type: !115)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !684, file: !1, line: 215, type: !413)
!684 = distinct !DILexicalBlock(scope: !681, file: !1, line: 215, column: 14)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !684, file: !1, line: 215, type: !66)
!686 = !DISubprogram(name: "tolower", scope: !10, file: !10, line: 216, type: !480, isLocal: false, isDefinition: true, scopeLine: 217, flags: DIFlagPrototyped, isOptimized: true, variables: !687)
!687 = !{!688}
!688 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__c", arg: 1, scope: !686, file: !10, line: 216, type: !66)
!689 = !DISubprogram(name: "translate_newlines", scope: !1, file: !1, line: 693, type: !690, isLocal: true, isDefinition: true, scopeLine: 693, flags: DIFlagPrototyped, isOptimized: true, variables: !692)
!690 = !DISubroutineType(types: !691)
!691 = !{!26, !52, !66, !364}
!692 = !{!693, !694, !695, !696, !697, !698, !699, !700, !701}
!693 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !689, file: !1, line: 693, type: !52)
!694 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exec_input", arg: 2, scope: !689, file: !1, line: 693, type: !66)
!695 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 3, scope: !689, file: !1, line: 693, type: !364)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "skip_next_lf", scope: !689, file: !1, line: 694, type: !66)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "needed_length", scope: !689, file: !1, line: 695, type: !115)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "final_length", scope: !689, file: !1, line: 695, type: !115)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !689, file: !1, line: 696, type: !26)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "current", scope: !689, file: !1, line: 696, type: !26)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !689, file: !1, line: 697, type: !27)
!702 = !DISubprogram(name: "tok_get", scope: !1, file: !1, line: 1325, type: !498, isLocal: true, isDefinition: true, scopeLine: 1326, flags: DIFlagPrototyped, isOptimized: true, variables: !703)
!703 = !{!704, !705, !706, !707, !708, !709, !710, !713, !714, !717, !718, !719, !728, !731, !732, !733, !735, !736, !739}
!704 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 1, scope: !702, file: !1, line: 1325, type: !364)
!705 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_start", arg: 2, scope: !702, file: !1, line: 1325, type: !500)
!706 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_end", arg: 3, scope: !702, file: !1, line: 1325, type: !500)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !702, file: !1, line: 1327, type: !66)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blankline", scope: !702, file: !1, line: 1328, type: !66)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nonascii", scope: !702, file: !1, line: 1328, type: !66)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "col", scope: !711, file: !1, line: 1337, type: !66)
!711 = distinct !DILexicalBlock(scope: !712, file: !1, line: 1336, column: 21)
!712 = distinct !DILexicalBlock(scope: !702, file: !1, line: 1336, column: 9)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "altcol", scope: !711, file: !1, line: 1338, type: !66)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "saw_b", scope: !715, file: !1, line: 1449, type: !66)
!715 = distinct !DILexicalBlock(scope: !716, file: !1, line: 1447, column: 43)
!716 = distinct !DILexicalBlock(scope: !702, file: !1, line: 1447, column: 9)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "saw_r", scope: !715, file: !1, line: 1449, type: !66)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "saw_u", scope: !715, file: !1, line: 1449, type: !66)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nonzero", scope: !720, file: !1, line: 1563, type: !66)
!720 = distinct !DILexicalBlock(scope: !721, file: !1, line: 1562, column: 18)
!721 = distinct !DILexicalBlock(scope: !722, file: !1, line: 1550, column: 22)
!722 = distinct !DILexicalBlock(scope: !723, file: !1, line: 1538, column: 22)
!723 = distinct !DILexicalBlock(scope: !724, file: !1, line: 1525, column: 17)
!724 = distinct !DILexicalBlock(scope: !725, file: !1, line: 1518, column: 23)
!725 = distinct !DILexicalBlock(scope: !726, file: !1, line: 1518, column: 13)
!726 = distinct !DILexicalBlock(scope: !727, file: !1, line: 1517, column: 21)
!727 = distinct !DILexicalBlock(scope: !702, file: !1, line: 1517, column: 9)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "quote", scope: !729, file: !1, line: 1629, type: !66)
!729 = distinct !DILexicalBlock(scope: !730, file: !1, line: 1628, column: 32)
!730 = distinct !DILexicalBlock(scope: !702, file: !1, line: 1628, column: 9)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "quote_size", scope: !729, file: !1, line: 1630, type: !66)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end_quote_size", scope: !729, file: !1, line: 1631, type: !66)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !734, file: !1, line: 1689, type: !66)
!734 = distinct !DILexicalBlock(scope: !702, file: !1, line: 1688, column: 5)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "token", scope: !734, file: !1, line: 1690, type: !66)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c3", scope: !737, file: !1, line: 1692, type: !66)
!737 = distinct !DILexicalBlock(scope: !738, file: !1, line: 1691, column: 26)
!738 = distinct !DILexicalBlock(scope: !734, file: !1, line: 1691, column: 13)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "token3", scope: !737, file: !1, line: 1693, type: !66)
!740 = !DISubprogram(name: "tok_nextc", scope: !1, file: !1, line: 898, type: !546, isLocal: true, isDefinition: true, scopeLine: 899, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.tok_state*)* @tok_nextc, variables: !741)
!741 = !{!742, !743, !749, !752, !755, !758, !759, !760, !764, !766, !771, !772, !773, !774, !776, !777, !778, !780, !781, !782}
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 1, scope: !740, file: !1, line: 898, type: !364)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !744, file: !1, line: 907, type: !26)
!744 = distinct !DILexicalBlock(scope: !745, file: !1, line: 906, column: 30)
!745 = distinct !DILexicalBlock(scope: !746, file: !1, line: 906, column: 13)
!746 = distinct !DILexicalBlock(scope: !747, file: !1, line: 900, column: 14)
!747 = distinct !DILexicalBlock(scope: !748, file: !1, line: 900, column: 5)
!748 = distinct !DILexicalBlock(scope: !740, file: !1, line: 900, column: 5)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newtok", scope: !750, file: !1, line: 925, type: !26)
!750 = distinct !DILexicalBlock(scope: !751, file: !1, line: 924, column: 34)
!751 = distinct !DILexicalBlock(scope: !746, file: !1, line: 924, column: 13)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "translated", scope: !753, file: !1, line: 928, type: !26)
!753 = distinct !DILexicalBlock(scope: !754, file: !1, line: 927, column: 33)
!754 = distinct !DILexicalBlock(scope: !750, file: !1, line: 927, column: 17)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buflen", scope: !756, file: !1, line: 936, type: !34)
!756 = distinct !DILexicalBlock(scope: !757, file: !1, line: 934, column: 53)
!757 = distinct !DILexicalBlock(scope: !750, file: !1, line: 934, column: 17)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !756, file: !1, line: 937, type: !52)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !756, file: !1, line: 938, type: !28)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !761, file: !1, line: 947, type: !28)
!761 = distinct !DILexicalBlock(scope: !762, file: !1, line: 947, column: 21)
!762 = distinct !DILexicalBlock(scope: !763, file: !1, line: 946, column: 27)
!763 = distinct !DILexicalBlock(scope: !756, file: !1, line: 946, column: 21)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !765, file: !1, line: 953, type: !28)
!765 = distinct !DILexicalBlock(scope: !756, file: !1, line: 953, column: 17)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !767, file: !1, line: 965, type: !115)
!767 = distinct !DILexicalBlock(scope: !768, file: !1, line: 964, column: 42)
!768 = distinct !DILexicalBlock(scope: !769, file: !1, line: 964, column: 22)
!769 = distinct !DILexicalBlock(scope: !770, file: !1, line: 960, column: 22)
!770 = distinct !DILexicalBlock(scope: !750, file: !1, line: 958, column: 17)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldlen", scope: !767, file: !1, line: 966, type: !115)
!772 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newlen", scope: !767, file: !1, line: 967, type: !115)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !767, file: !1, line: 968, type: !26)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "done", scope: !775, file: !1, line: 1000, type: !66)
!775 = distinct !DILexicalBlock(scope: !751, file: !1, line: 999, column: 14)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur", scope: !775, file: !1, line: 1001, type: !34)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pt", scope: !775, file: !1, line: 1002, type: !26)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curstart", scope: !779, file: !1, line: 1036, type: !34)
!779 = distinct !DILexicalBlock(scope: !775, file: !1, line: 1035, column: 27)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "curvalid", scope: !779, file: !1, line: 1038, type: !34)
!781 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newsize", scope: !779, file: !1, line: 1039, type: !34)
!782 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newbuf", scope: !779, file: !1, line: 1040, type: !26)
!783 = !DISubprogram(name: "decoding_fgets", scope: !1, file: !1, line: 577, type: !784, isLocal: true, isDefinition: true, scopeLine: 578, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i32, %struct.tok_state*)* @decoding_fgets, variables: !786)
!784 = !DISubroutineType(types: !785)
!785 = !{!26, !26, !66, !364}
!786 = !{!787, !788, !789, !790, !791, !792, !795}
!787 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !783, file: !1, line: 577, type: !26)
!788 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !783, file: !1, line: 577, type: !66)
!789 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 3, scope: !783, file: !1, line: 577, type: !364)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !783, file: !1, line: 579, type: !26)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "badchar", scope: !783, file: !1, line: 580, type: !66)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !793, file: !1, line: 610, type: !416)
!793 = distinct !DILexicalBlock(scope: !794, file: !1, line: 609, column: 33)
!794 = distinct !DILexicalBlock(scope: !783, file: !1, line: 609, column: 9)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !793, file: !1, line: 611, type: !66)
!796 = !DISubprogram(name: "fp_readl", scope: !1, file: !1, line: 416, type: !784, isLocal: true, isDefinition: true, scopeLine: 417, flags: DIFlagPrototyped, isOptimized: true, variables: !797)
!797 = !{!798, !799, !800, !801, !802, !803, !804, !806, !809, !811, !813}
!798 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !796, file: !1, line: 416, type: !26)
!799 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !796, file: !1, line: 416, type: !66)
!800 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 3, scope: !796, file: !1, line: 416, type: !364)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bufobj", scope: !796, file: !1, line: 418, type: !28)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !796, file: !1, line: 419, type: !52)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buflen", scope: !796, file: !1, line: 420, type: !34)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !805, file: !1, line: 452, type: !28)
!805 = distinct !DILexicalBlock(scope: !796, file: !1, line: 452, column: 5)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !807, file: !1, line: 452, type: !28)
!807 = distinct !DILexicalBlock(scope: !808, file: !1, line: 452, column: 5)
!808 = distinct !DILexicalBlock(scope: !805, file: !1, line: 452, column: 5)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !810, file: !1, line: 468, type: !28)
!810 = distinct !DILexicalBlock(scope: !796, file: !1, line: 468, column: 5)
!811 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !812, file: !1, line: 472, type: !28)
!812 = distinct !DILexicalBlock(scope: !796, file: !1, line: 472, column: 5)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !814, file: !1, line: 472, type: !28)
!814 = distinct !DILexicalBlock(scope: !815, file: !1, line: 472, column: 5)
!815 = distinct !DILexicalBlock(scope: !812, file: !1, line: 472, column: 5)
!816 = !DISubprogram(name: "fp_getc", scope: !1, file: !1, line: 535, type: !546, isLocal: true, isDefinition: true, scopeLine: 535, flags: DIFlagPrototyped, isOptimized: true, variables: !817)
!817 = !{!818}
!818 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 1, scope: !816, file: !1, line: 535, type: !364)
!819 = !DISubprogram(name: "fp_ungetc", scope: !1, file: !1, line: 541, type: !549, isLocal: true, isDefinition: true, scopeLine: 541, flags: DIFlagPrototyped, isOptimized: true, variables: !820)
!820 = !{!821, !822}
!821 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !819, file: !1, line: 541, type: !66)
!822 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 2, scope: !819, file: !1, line: 541, type: !364)
!823 = !DISubprogram(name: "fp_setreadl", scope: !1, file: !1, line: 487, type: !552, isLocal: true, isDefinition: true, scopeLine: 488, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.tok_state*, i8*)* @fp_setreadl, variables: !824)
!824 = !{!825, !826, !827, !828, !829, !830, !831, !832, !834, !837, !839, !842, !844}
!825 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 1, scope: !823, file: !1, line: 487, type: !364)
!826 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "enc", arg: 2, scope: !823, file: !1, line: 487, type: !52)
!827 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "readline", scope: !823, file: !1, line: 489, type: !28)
!828 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stream", scope: !823, file: !1, line: 489, type: !28)
!829 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "io", scope: !823, file: !1, line: 489, type: !28)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !823, file: !1, line: 492, type: !66)
!831 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !823, file: !1, line: 493, type: !40)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !833, file: !1, line: 517, type: !28)
!833 = distinct !DILexicalBlock(scope: !823, file: !1, line: 517, column: 5)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !835, file: !1, line: 517, type: !28)
!835 = distinct !DILexicalBlock(scope: !836, file: !1, line: 517, column: 5)
!836 = distinct !DILexicalBlock(scope: !833, file: !1, line: 517, column: 5)
!837 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !838, file: !1, line: 528, type: !28)
!838 = distinct !DILexicalBlock(scope: !823, file: !1, line: 528, column: 5)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !840, file: !1, line: 528, type: !28)
!840 = distinct !DILexicalBlock(scope: !841, file: !1, line: 528, column: 5)
!841 = distinct !DILexicalBlock(scope: !838, file: !1, line: 528, column: 5)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !843, file: !1, line: 529, type: !28)
!843 = distinct !DILexicalBlock(scope: !823, file: !1, line: 529, column: 5)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !845, file: !1, line: 529, type: !28)
!845 = distinct !DILexicalBlock(scope: !846, file: !1, line: 529, column: 5)
!846 = distinct !DILexicalBlock(scope: !843, file: !1, line: 529, column: 5)
!847 = !DISubprogram(name: "valid_utf8", scope: !1, file: !1, line: 548, type: !848, isLocal: true, isDefinition: true, scopeLine: 549, flags: DIFlagPrototyped, isOptimized: true, variables: !850)
!848 = !DISubroutineType(types: !849)
!849 = !{!66, !413}
!850 = !{!851, !852, !853}
!851 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !847, file: !1, line: 548, type: !413)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "expected", scope: !847, file: !1, line: 550, type: !66)
!853 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !847, file: !1, line: 551, type: !66)
!854 = !DISubprogram(name: "decoding_feof", scope: !1, file: !1, line: 634, type: !546, isLocal: true, isDefinition: true, scopeLine: 635, flags: DIFlagPrototyped, isOptimized: true, variables: !855)
!855 = !{!856, !857}
!856 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 1, scope: !854, file: !1, line: 634, type: !364)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !858, file: !1, line: 639, type: !28)
!858 = distinct !DILexicalBlock(scope: !859, file: !1, line: 638, column: 12)
!859 = distinct !DILexicalBlock(scope: !854, file: !1, line: 636, column: 9)
!860 = !DISubprogram(name: "tok_backup", scope: !1, file: !1, line: 1095, type: !861, isLocal: true, isDefinition: true, scopeLine: 1096, flags: DIFlagPrototyped, isOptimized: true, variables: !863)
!861 = !DISubroutineType(types: !862)
!862 = !{null, !364, !66}
!863 = !{!864, !865}
!864 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 1, scope: !860, file: !1, line: 1095, type: !364)
!865 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 2, scope: !860, file: !1, line: 1095, type: !66)
!866 = !DISubprogram(name: "indenterror", scope: !1, file: !1, line: 1273, type: !546, isLocal: true, isDefinition: true, scopeLine: 1274, flags: DIFlagPrototyped, isOptimized: true, variables: !867)
!867 = !{!868}
!868 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 1, scope: !866, file: !1, line: 1273, type: !364)
!869 = !DISubprogram(name: "verify_identifier", scope: !1, file: !1, line: 1300, type: !546, isLocal: true, isDefinition: true, scopeLine: 1301, flags: DIFlagPrototyped, isOptimized: true, variables: !870)
!870 = !{!871, !872, !873, !874}
!871 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tok", arg: 1, scope: !869, file: !1, line: 1300, type: !364)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !869, file: !1, line: 1302, type: !28)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !869, file: !1, line: 1303, type: !66)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !875, file: !1, line: 1315, type: !28)
!875 = distinct !DILexicalBlock(scope: !869, file: !1, line: 1315, column: 5)
!876 = !{!877, !881, !889}
!877 = !DIGlobalVariable(name: "_PyParser_TokenNames", scope: !0, file: !1, line: 50, type: !878, isLocal: false, isDefinition: true, variable: [55 x i8*]* @_PyParser_TokenNames)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 3520, align: 64, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 55)
!881 = !DIGlobalVariable(name: "PyId_open", scope: !823, file: !1, line: 490, type: !882, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @fp_setreadl.PyId_open)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !30, line: 144, baseType: !883)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !30, line: 140, size: 192, align: 64, elements: !884)
!884 = !{!885, !887, !888}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !883, file: !30, line: 141, baseType: !886, size: 64, align: 64)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64, align: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !883, file: !30, line: 142, baseType: !52, size: 64, align: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !883, file: !30, line: 143, baseType: !28, size: 64, align: 64, offset: 128)
!889 = !DIGlobalVariable(name: "PyId_readline", scope: !823, file: !1, line: 491, type: !882, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @fp_setreadl.PyId_readline)
!890 = !{i32 2, !"Dwarf Version", i32 4}
!891 = !{i32 2, !"Debug Info Version", i32 3}
!892 = !{!"clang version 3.7.0 (tags/RELEASE_370/final)"}
!893 = !DIExpression()
!894 = !DILocation(line: 798, column: 36, scope: !438)
!895 = !DILocation(line: 798, column: 45, scope: !438)
!896 = !DILocation(line: 115, column: 49, scope: !522, inlinedAt: !897)
!897 = distinct !DILocation(line: 800, column: 29, scope: !438)
!898 = !DILocation(line: 117, column: 13, scope: !899, inlinedAt: !897)
!899 = distinct !DILexicalBlock(scope: !522, file: !1, line: 117, column: 9)
!900 = !DILocation(line: 743, column: 17, scope: !527, inlinedAt: !901)
!901 = distinct !DILocation(line: 803, column: 11, scope: !438)
!902 = !DILocation(line: 117, column: 9, scope: !522, inlinedAt: !897)
!903 = !DILocation(line: 115, column: 29, scope: !522, inlinedAt: !897)
!904 = !DILocation(line: 120, column: 10, scope: !522, inlinedAt: !897)
!905 = !DILocation(line: 119, column: 47, scope: !522, inlinedAt: !897)
!906 = !DILocation(line: 120, column: 15, scope: !522, inlinedAt: !897)
!907 = !{!908, !912, i64 40}
!908 = !{!"tok_state", !909, i64 0, !909, i64 8, !909, i64 16, !909, i64 24, !909, i64 32, !912, i64 40, !909, i64 48, !912, i64 56, !912, i64 60, !910, i64 64, !912, i64 464, !912, i64 468, !909, i64 472, !909, i64 480, !912, i64 488, !912, i64 492, !909, i64 496, !912, i64 504, !912, i64 508, !912, i64 512, !910, i64 516, !910, i64 916, !912, i64 920, !912, i64 924, !909, i64 928, !912, i64 936, !909, i64 944, !909, i64 952, !909, i64 960, !909, i64 968, !909, i64 976, !909, i64 984}
!909 = !{!"any pointer", !910, i64 0}
!910 = !{!"omnipotent char", !911, i64 0}
!911 = !{!"Simple C/C++ TBAA"}
!912 = !{!"int", !910, i64 0}
!913 = !DILocation(line: 121, column: 10, scope: !522, inlinedAt: !897)
!914 = !DILocation(line: 121, column: 13, scope: !522, inlinedAt: !897)
!915 = !{!908, !909, i64 48}
!916 = !DILocation(line: 122, column: 10, scope: !522, inlinedAt: !897)
!917 = !DILocation(line: 122, column: 16, scope: !522, inlinedAt: !897)
!918 = !{!908, !909, i64 984}
!919 = !DILocation(line: 123, column: 10, scope: !522, inlinedAt: !897)
!920 = !DILocation(line: 123, column: 18, scope: !522, inlinedAt: !897)
!921 = !{!908, !912, i64 56}
!922 = !DILocation(line: 124, column: 10, scope: !522, inlinedAt: !897)
!923 = !DILocation(line: 124, column: 17, scope: !522, inlinedAt: !897)
!924 = !{!908, !912, i64 60}
!925 = !DILocation(line: 125, column: 10, scope: !522, inlinedAt: !897)
!926 = !DILocation(line: 125, column: 5, scope: !522, inlinedAt: !897)
!927 = !DILocation(line: 125, column: 22, scope: !522, inlinedAt: !897)
!928 = !{!912, !912, i64 0}
!929 = !DILocation(line: 126, column: 10, scope: !522, inlinedAt: !897)
!930 = !DILocation(line: 126, column: 16, scope: !522, inlinedAt: !897)
!931 = !{!908, !912, i64 464}
!932 = !DILocation(line: 127, column: 10, scope: !522, inlinedAt: !897)
!933 = !DILocation(line: 131, column: 10, scope: !522, inlinedAt: !897)
!934 = !DILocation(line: 128, column: 35, scope: !522, inlinedAt: !897)
!935 = !DILocation(line: 131, column: 21, scope: !522, inlinedAt: !897)
!936 = !DILocation(line: 135, column: 10, scope: !522, inlinedAt: !897)
!937 = !DILocation(line: 142, column: 10, scope: !522, inlinedAt: !897)
!938 = !DILocation(line: 142, column: 19, scope: !522, inlinedAt: !897)
!939 = !{!908, !909, i64 496}
!940 = !DILocation(line: 143, column: 10, scope: !522, inlinedAt: !897)
!941 = !DILocation(line: 135, column: 25, scope: !522, inlinedAt: !897)
!942 = !DILocation(line: 143, column: 28, scope: !522, inlinedAt: !897)
!943 = !DILocation(line: 800, column: 23, scope: !438)
