; ModuleID = 'typeobject.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !11, subprograms: !615, globals: !3549)
!1 = !DIFile(filename: "Objects/typeobject.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !4, line: 23, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!7 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!8 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!9 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!10 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!11 = !{!12, !97, !358, !369, !102, !371, !372, !386, !394, !59, !409, !18, !410, !356, !429, !431, !36, !434, !546, !499, !547, !146, !222, !141, !549, !132, !232, !277, !327, !329, !332, !42, !150, !24, !184, !217, !190, !197, !51, !203, !577, !580, !581, !293, !591, !599, !600, !608}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !14, line: 109, baseType: !15)
!14 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !14, line: 105, size: 128, align: 64, elements: !16)
!16 = !{!17, !25}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !15, file: !14, line: 107, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !19, line: 177, baseType: !20)
!19 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !21, line: 102, baseType: !22)
!21 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !23, line: 181, baseType: !24)
!23 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!24 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !15, file: !14, line: 108, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !14, line: 334, size: 3200, align: 64, elements: !28)
!28 = !{!29, !35, !39, !40, !41, !46, !110, !115, !120, !121, !126, !178, !209, !221, !227, !228, !229, !231, !233, !264, !265, !266, !275, !276, !281, !282, !284, !286, !296, !306, !324, !325, !326, !328, !330, !331, !333, !338, !343, !348, !349, !350, !351, !352, !353, !354, !355, !357}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !27, file: !14, line: 335, baseType: !30, size: 192, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !14, line: 114, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 111, size: 192, align: 64, elements: !32)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !14, line: 112, baseType: !13, size: 128, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !31, file: !14, line: 113, baseType: !18, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !27, file: !14, line: 336, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !27, file: !14, line: 341, baseType: !42, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !14, line: 308, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !12}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !27, file: !14, line: 342, baseType: !47, size: 64, align: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !14, line: 314, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !12, !52, !51}
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !21, line: 48, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !55, line: 246, size: 1728, align: 64, elements: !56)
!55 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!56 = !{!57, !58, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !78, !79, !80, !81, !83, !85, !87, !91, !94, !96, !98, !99, !100, !101, !105, !106}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !54, file: !55, line: 247, baseType: !51, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !54, file: !55, line: 252, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !54, file: !55, line: 253, baseType: !59, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !54, file: !55, line: 254, baseType: !59, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !54, file: !55, line: 255, baseType: !59, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !54, file: !55, line: 256, baseType: !59, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !54, file: !55, line: 257, baseType: !59, size: 64, align: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !54, file: !55, line: 258, baseType: !59, size: 64, align: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !54, file: !55, line: 259, baseType: !59, size: 64, align: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !54, file: !55, line: 261, baseType: !59, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !54, file: !55, line: 262, baseType: !59, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !54, file: !55, line: 263, baseType: !59, size: 64, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !54, file: !55, line: 265, baseType: !71, size: 64, align: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !55, line: 161, size: 192, align: 64, elements: !73)
!73 = !{!74, !75, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !72, file: !55, line: 162, baseType: !71, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !72, file: !55, line: 163, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !72, file: !55, line: 167, baseType: !51, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !54, file: !55, line: 267, baseType: !76, size: 64, align: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !54, file: !55, line: 269, baseType: !51, size: 32, align: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !54, file: !55, line: 273, baseType: !51, size: 32, align: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !54, file: !55, line: 275, baseType: !82, size: 64, align: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !23, line: 140, baseType: !24)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !54, file: !55, line: 279, baseType: !84, size: 16, align: 16, offset: 1024)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !54, file: !55, line: 280, baseType: !86, size: 8, align: 8, offset: 1040)
!86 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !54, file: !55, line: 281, baseType: !88, size: 8, align: 8, offset: 1048)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !54, file: !55, line: 285, baseType: !92, size: 64, align: 64, offset: 1088)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !55, line: 155, baseType: null)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !54, file: !55, line: 294, baseType: !95, size: 64, align: 64, offset: 1152)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !23, line: 141, baseType: !24)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !54, file: !55, line: 303, baseType: !97, size: 64, align: 64, offset: 1216)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !54, file: !55, line: 304, baseType: !97, size: 64, align: 64, offset: 1280)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !54, file: !55, line: 305, baseType: !97, size: 64, align: 64, offset: 1344)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !54, file: !55, line: 306, baseType: !97, size: 64, align: 64, offset: 1408)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !54, file: !55, line: 307, baseType: !102, size: 64, align: 64, offset: 1472)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !103, line: 62, baseType: !104)
!103 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!104 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !54, file: !55, line: 309, baseType: !51, size: 32, align: 32, offset: 1536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !54, file: !55, line: 311, baseType: !107, size: 160, align: 8, offset: 1568)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, align: 8, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 20)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !27, file: !14, line: 343, baseType: !111, size: 64, align: 64, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !14, line: 316, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!12, !12, !59}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !27, file: !14, line: 344, baseType: !116, size: 64, align: 64, offset: 576)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !14, line: 318, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!51, !12, !59, !12}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !27, file: !14, line: 345, baseType: !97, size: 64, align: 64, offset: 640)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !27, file: !14, line: 346, baseType: !122, size: 64, align: 64, offset: 704)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !14, line: 320, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!12, !12}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !27, file: !14, line: 350, baseType: !127, size: 64, align: 64, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !14, line: 278, baseType: !129)
!129 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 236, size: 2176, align: 64, elements: !130)
!130 = !{!131, !136, !137, !138, !139, !140, !145, !147, !148, !149, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !129, file: !14, line: 241, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !14, line: 166, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!12, !12, !12}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !129, file: !14, line: 242, baseType: !132, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !129, file: !14, line: 243, baseType: !132, size: 64, align: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !129, file: !14, line: 244, baseType: !132, size: 64, align: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !129, file: !14, line: 245, baseType: !132, size: 64, align: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !129, file: !14, line: 246, baseType: !141, size: 64, align: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !14, line: 167, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!12, !12, !12, !12}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !129, file: !14, line: 247, baseType: !146, size: 64, align: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !14, line: 165, baseType: !123)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !129, file: !14, line: 248, baseType: !146, size: 64, align: 64, offset: 448)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !129, file: !14, line: 249, baseType: !146, size: 64, align: 64, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !129, file: !14, line: 250, baseType: !150, size: 64, align: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !14, line: 168, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!51, !12}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !129, file: !14, line: 251, baseType: !146, size: 64, align: 64, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !129, file: !14, line: 252, baseType: !132, size: 64, align: 64, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !129, file: !14, line: 253, baseType: !132, size: 64, align: 64, offset: 768)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !129, file: !14, line: 254, baseType: !132, size: 64, align: 64, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !129, file: !14, line: 255, baseType: !132, size: 64, align: 64, offset: 896)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !129, file: !14, line: 256, baseType: !132, size: 64, align: 64, offset: 960)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !129, file: !14, line: 257, baseType: !146, size: 64, align: 64, offset: 1024)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !129, file: !14, line: 258, baseType: !97, size: 64, align: 64, offset: 1088)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !129, file: !14, line: 259, baseType: !146, size: 64, align: 64, offset: 1152)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !129, file: !14, line: 261, baseType: !132, size: 64, align: 64, offset: 1216)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !129, file: !14, line: 262, baseType: !132, size: 64, align: 64, offset: 1280)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !129, file: !14, line: 263, baseType: !132, size: 64, align: 64, offset: 1344)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !129, file: !14, line: 264, baseType: !132, size: 64, align: 64, offset: 1408)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !129, file: !14, line: 265, baseType: !141, size: 64, align: 64, offset: 1472)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !129, file: !14, line: 266, baseType: !132, size: 64, align: 64, offset: 1536)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !129, file: !14, line: 267, baseType: !132, size: 64, align: 64, offset: 1600)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !129, file: !14, line: 268, baseType: !132, size: 64, align: 64, offset: 1664)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !129, file: !14, line: 269, baseType: !132, size: 64, align: 64, offset: 1728)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !129, file: !14, line: 270, baseType: !132, size: 64, align: 64, offset: 1792)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !129, file: !14, line: 272, baseType: !132, size: 64, align: 64, offset: 1856)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !129, file: !14, line: 273, baseType: !132, size: 64, align: 64, offset: 1920)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !129, file: !14, line: 274, baseType: !132, size: 64, align: 64, offset: 1984)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !129, file: !14, line: 275, baseType: !132, size: 64, align: 64, offset: 2048)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !129, file: !14, line: 277, baseType: !146, size: 64, align: 64, offset: 2112)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !27, file: !14, line: 351, baseType: !179, size: 64, align: 64, offset: 832)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !14, line: 292, baseType: !181)
!181 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 280, size: 640, align: 64, elements: !182)
!182 = !{!183, !188, !189, !194, !195, !196, !201, !202, !207, !208}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !181, file: !14, line: 281, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !14, line: 169, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!18, !12}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !181, file: !14, line: 282, baseType: !132, size: 64, align: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !181, file: !14, line: 283, baseType: !190, size: 64, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !14, line: 170, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!12, !12, !18}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !181, file: !14, line: 284, baseType: !190, size: 64, align: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !181, file: !14, line: 285, baseType: !97, size: 64, align: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !181, file: !14, line: 286, baseType: !197, size: 64, align: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !14, line: 172, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!51, !12, !18, !12}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !181, file: !14, line: 287, baseType: !97, size: 64, align: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !181, file: !14, line: 288, baseType: !203, size: 64, align: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !14, line: 231, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!51, !12, !12}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !181, file: !14, line: 290, baseType: !132, size: 64, align: 64, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !181, file: !14, line: 291, baseType: !190, size: 64, align: 64, offset: 576)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !27, file: !14, line: 352, baseType: !210, size: 64, align: 64, offset: 896)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !14, line: 298, baseType: !212)
!212 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 294, size: 192, align: 64, elements: !213)
!213 = !{!214, !215, !216}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !212, file: !14, line: 295, baseType: !184, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !212, file: !14, line: 296, baseType: !132, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !212, file: !14, line: 297, baseType: !217, size: 64, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !14, line: 174, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!51, !12, !12, !12}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !27, file: !14, line: 356, baseType: !222, size: 64, align: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !14, line: 321, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!226, !12}
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !19, line: 186, baseType: !18)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !27, file: !14, line: 357, baseType: !141, size: 64, align: 64, offset: 1024)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !27, file: !14, line: 358, baseType: !122, size: 64, align: 64, offset: 1088)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !27, file: !14, line: 359, baseType: !230, size: 64, align: 64, offset: 1152)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !14, line: 317, baseType: !133)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !27, file: !14, line: 360, baseType: !232, size: 64, align: 64, offset: 1216)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !14, line: 319, baseType: !218)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !27, file: !14, line: 363, baseType: !234, size: 64, align: 64, offset: 1280)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !14, line: 304, baseType: !236)
!236 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 301, size: 128, align: 64, elements: !237)
!237 = !{!238, !259}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !236, file: !14, line: 302, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !14, line: 193, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!51, !12, !243, !51}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !14, line: 191, baseType: !245)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !14, line: 178, size: 640, align: 64, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254, !256, !257, !258}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !245, file: !14, line: 179, baseType: !97, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !245, file: !14, line: 180, baseType: !12, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !245, file: !14, line: 181, baseType: !18, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !245, file: !14, line: 182, baseType: !18, size: 64, align: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !245, file: !14, line: 184, baseType: !51, size: 32, align: 32, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !245, file: !14, line: 185, baseType: !51, size: 32, align: 32, offset: 288)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !245, file: !14, line: 186, baseType: !59, size: 64, align: 64, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !245, file: !14, line: 187, baseType: !255, size: 64, align: 64, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !245, file: !14, line: 188, baseType: !255, size: 64, align: 64, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !245, file: !14, line: 189, baseType: !255, size: 64, align: 64, offset: 512)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !245, file: !14, line: 190, baseType: !97, size: 64, align: 64, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !236, file: !14, line: 303, baseType: !260, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !14, line: 194, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !12, !243}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !27, file: !14, line: 366, baseType: !104, size: 64, align: 64, offset: 1344)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !27, file: !14, line: 368, baseType: !36, size: 64, align: 64, offset: 1408)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !27, file: !14, line: 372, baseType: !267, size: 64, align: 64, offset: 1472)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !14, line: 233, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!51, !12, !271, !97}
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !14, line: 232, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!51, !12, !97}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !27, file: !14, line: 375, baseType: !150, size: 64, align: 64, offset: 1536)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !27, file: !14, line: 379, baseType: !277, size: 64, align: 64, offset: 1600)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !14, line: 322, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!12, !12, !12, !51}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !27, file: !14, line: 382, baseType: !18, size: 64, align: 64, offset: 1664)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !27, file: !14, line: 385, baseType: !283, size: 64, align: 64, offset: 1728)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !14, line: 323, baseType: !123)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !27, file: !14, line: 386, baseType: !285, size: 64, align: 64, offset: 1792)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !14, line: 324, baseType: !123)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !27, file: !14, line: 389, baseType: !287, size: 64, align: 64, offset: 1856)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !289, line: 40, size: 256, align: 64, elements: !290)
!289 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!290 = !{!291, !292, !294, !295}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !288, file: !289, line: 41, baseType: !36, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !288, file: !289, line: 42, baseType: !293, size: 64, align: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !289, line: 18, baseType: !133)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !288, file: !289, line: 43, baseType: !51, size: 32, align: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !288, file: !289, line: 45, baseType: !36, size: 64, align: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !27, file: !14, line: 390, baseType: !297, size: 64, align: 64, offset: 1920)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !299, line: 18, size: 320, align: 64, elements: !300)
!299 = !DIFile(filename: "Include/structmember.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!300 = !{!301, !302, !303, !304, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !298, file: !299, line: 19, baseType: !59, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !298, file: !299, line: 20, baseType: !51, size: 32, align: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !298, file: !299, line: 21, baseType: !18, size: 64, align: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !298, file: !299, line: 22, baseType: !51, size: 32, align: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !298, file: !299, line: 23, baseType: !59, size: 64, align: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !27, file: !14, line: 391, baseType: !307, size: 64, align: 64, offset: 1984)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !309, line: 11, size: 320, align: 64, elements: !310)
!309 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!310 = !{!311, !312, !317, !322, !323}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !308, file: !309, line: 12, baseType: !59, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !308, file: !309, line: 13, baseType: !313, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !309, line: 8, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!12, !12, !97}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !308, file: !309, line: 14, baseType: !318, size: 64, align: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !309, line: 9, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!51, !12, !12, !97}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !308, file: !309, line: 15, baseType: !59, size: 64, align: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !308, file: !309, line: 16, baseType: !97, size: 64, align: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !27, file: !14, line: 392, baseType: !26, size: 64, align: 64, offset: 2048)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !27, file: !14, line: 393, baseType: !12, size: 64, align: 64, offset: 2112)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !27, file: !14, line: 394, baseType: !327, size: 64, align: 64, offset: 2176)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !14, line: 325, baseType: !142)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !27, file: !14, line: 395, baseType: !329, size: 64, align: 64, offset: 2240)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !14, line: 326, baseType: !218)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !27, file: !14, line: 396, baseType: !18, size: 64, align: 64, offset: 2304)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !27, file: !14, line: 397, baseType: !332, size: 64, align: 64, offset: 2368)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !14, line: 327, baseType: !218)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !27, file: !14, line: 398, baseType: !334, size: 64, align: 64, offset: 2432)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !14, line: 329, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!12, !26, !18}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !27, file: !14, line: 399, baseType: !339, size: 64, align: 64, offset: 2496)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !14, line: 328, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!12, !26, !12, !12}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !27, file: !14, line: 400, baseType: !344, size: 64, align: 64, offset: 2560)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !14, line: 307, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !97}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !27, file: !14, line: 401, baseType: !150, size: 64, align: 64, offset: 2624)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !27, file: !14, line: 402, baseType: !12, size: 64, align: 64, offset: 2688)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !27, file: !14, line: 403, baseType: !12, size: 64, align: 64, offset: 2752)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !27, file: !14, line: 404, baseType: !12, size: 64, align: 64, offset: 2816)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !27, file: !14, line: 405, baseType: !12, size: 64, align: 64, offset: 2880)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !27, file: !14, line: 406, baseType: !12, size: 64, align: 64, offset: 2944)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !27, file: !14, line: 407, baseType: !42, size: 64, align: 64, offset: 3008)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !27, file: !14, line: 410, baseType: !356, size: 32, align: 32, offset: 3072)
!356 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !27, file: !14, line: 412, baseType: !42, size: 64, align: 64, offset: 3136)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyWeakReference", file: !360, line: 10, baseType: !361)
!360 = !DIFile(filename: "Include/weakrefobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyWeakReference", file: !360, line: 16, size: 448, align: 64, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !361, file: !360, line: 17, baseType: !13, size: 128, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "wr_object", scope: !361, file: !360, line: 23, baseType: !12, size: 64, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "wr_callback", scope: !361, file: !360, line: 26, baseType: !12, size: 64, align: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !361, file: !360, line: 31, baseType: !226, size: 64, align: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "wr_prev", scope: !361, file: !360, line: 38, baseType: !358, size: 64, align: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "wr_next", scope: !361, file: !360, line: 39, baseType: !358, size: 64, align: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !14, line: 422, baseType: !27)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !374, line: 253, baseType: !375)
!374 = !DIFile(filename: "Include/objimpl.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!375 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !374, line: 246, size: 192, align: 64, elements: !376)
!376 = !{!377, !384}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !375, file: !374, line: 251, baseType: !378, size: 192, align: 64)
!378 = !DICompositeType(tag: DW_TAG_structure_type, scope: !375, file: !374, line: 247, size: 192, align: 64, elements: !379)
!379 = !{!380, !382, !383}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !378, file: !374, line: 248, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !378, file: !374, line: 249, baseType: !381, size: 64, align: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !378, file: !374, line: 250, baseType: !18, size: 64, align: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !375, file: !374, line: 252, baseType: !385, size: 64, align: 64)
!385 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !388, line: 33, baseType: !389)
!388 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!389 = !DICompositeType(tag: DW_TAG_structure_type, file: !388, line: 25, size: 256, align: 64, elements: !390)
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !389, file: !388, line: 26, baseType: !30, size: 192, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !389, file: !388, line: 27, baseType: !393, size: 64, align: 64, offset: 192)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, align: 64, elements: !89)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyHeapTypeObject", file: !14, line: 463, baseType: !396)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "_heaptypeobject", file: !14, line: 448, size: 6592, align: 64, elements: !397)
!397 = !{!398, !399, !400, !401, !402, !403, !404, !405, !406}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ht_type", scope: !396, file: !14, line: 451, baseType: !370, size: 3200, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "as_number", scope: !396, file: !14, line: 452, baseType: !128, size: 2176, align: 64, offset: 3200)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "as_mapping", scope: !396, file: !14, line: 453, baseType: !211, size: 192, align: 64, offset: 5376)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "as_sequence", scope: !396, file: !14, line: 454, baseType: !180, size: 640, align: 64, offset: 5568)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "as_buffer", scope: !396, file: !14, line: 459, baseType: !235, size: 128, align: 64, offset: 6208)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ht_name", scope: !396, file: !14, line: 460, baseType: !12, size: 64, align: 64, offset: 6336)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ht_slots", scope: !396, file: !14, line: 460, baseType: !12, size: 64, align: 64, offset: 6400)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ht_qualname", scope: !396, file: !14, line: 460, baseType: !12, size: 64, align: 64, offset: 6464)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ht_cached_keys", scope: !396, file: !14, line: 461, baseType: !407, size: 64, align: 64, offset: 6528)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "_dictkeysobject", file: !14, line: 461, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !412, line: 351, baseType: !413)
!412 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!413 = !DICompositeType(tag: DW_TAG_structure_type, file: !412, line: 217, size: 384, align: 64, elements: !414)
!414 = !{!415, !416, !417, !418, !426}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !413, file: !412, line: 291, baseType: !13, size: 128, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !413, file: !412, line: 292, baseType: !18, size: 64, align: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !413, file: !412, line: 293, baseType: !226, size: 64, align: 64, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !413, file: !412, line: 349, baseType: !419, size: 32, align: 32, offset: 256)
!419 = !DICompositeType(tag: DW_TAG_structure_type, scope: !413, file: !412, line: 294, size: 32, align: 32, elements: !420)
!420 = !{!421, !422, !423, !424, !425}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !419, file: !412, line: 303, baseType: !356, size: 2, align: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !419, file: !412, line: 331, baseType: !356, size: 3, align: 32, offset: 2)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !419, file: !412, line: 336, baseType: !356, size: 1, align: 32, offset: 5)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !419, file: !412, line: 340, baseType: !356, size: 1, align: 32, offset: 6)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !419, file: !412, line: 345, baseType: !356, size: 1, align: 32, offset: 7)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !413, file: !412, line: 350, baseType: !427, size: 64, align: 64, offset: 320)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !103, line: 90, baseType: !51)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!433 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !436, line: 139, baseType: !437)
!436 = !DIFile(filename: "Include/pystate.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !436, line: 69, size: 1536, align: 64, elements: !438)
!438 = !{!439, !441, !442, !462, !519, !520, !521, !522, !523, !524, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !437, file: !436, line: 72, baseType: !440, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !437, file: !436, line: 73, baseType: !440, size: 64, align: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !437, file: !436, line: 74, baseType: !443, size: 64, align: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !436, line: 44, baseType: !445)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !436, line: 19, size: 832, align: 64, elements: !446)
!446 = !{!447, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !445, file: !436, line: 21, baseType: !448, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !445, file: !436, line: 22, baseType: !440, size: 64, align: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !445, file: !436, line: 24, baseType: !12, size: 64, align: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !445, file: !436, line: 25, baseType: !12, size: 64, align: 64, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !445, file: !436, line: 26, baseType: !12, size: 64, align: 64, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !445, file: !436, line: 27, baseType: !12, size: 64, align: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !445, file: !436, line: 28, baseType: !12, size: 64, align: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !445, file: !436, line: 30, baseType: !12, size: 64, align: 64, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !445, file: !436, line: 31, baseType: !12, size: 64, align: 64, offset: 512)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !445, file: !436, line: 32, baseType: !12, size: 64, align: 64, offset: 576)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !445, file: !436, line: 33, baseType: !51, size: 32, align: 32, offset: 640)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !445, file: !436, line: 34, baseType: !51, size: 32, align: 32, offset: 672)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !445, file: !436, line: 37, baseType: !51, size: 32, align: 32, offset: 704)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !445, file: !436, line: 43, baseType: !12, size: 64, align: 64, offset: 768)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !437, file: !436, line: 76, baseType: !463, size: 64, align: 64, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !465, line: 17, size: 3072, align: 64, elements: !466)
!465 = !DIFile(filename: "Include/frameobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!466 = !{!467, !468, !469, !495, !496, !497, !498, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !518}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !464, file: !465, line: 18, baseType: !30, size: 192, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "f_back", scope: !464, file: !465, line: 19, baseType: !463, size: 64, align: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "f_code", scope: !464, file: !465, line: 20, baseType: !470, size: 64, align: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !472, line: 33, baseType: !473)
!472 = !DIFile(filename: "Include/code.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!473 = !DICompositeType(tag: DW_TAG_structure_type, file: !472, line: 11, size: 1152, align: 64, elements: !474)
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !489, !490, !491, !492, !493, !494}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !473, file: !472, line: 12, baseType: !13, size: 128, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !473, file: !472, line: 13, baseType: !51, size: 32, align: 32, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !473, file: !472, line: 14, baseType: !51, size: 32, align: 32, offset: 160)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !473, file: !472, line: 15, baseType: !51, size: 32, align: 32, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !473, file: !472, line: 16, baseType: !51, size: 32, align: 32, offset: 224)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !473, file: !472, line: 17, baseType: !51, size: 32, align: 32, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "co_code", scope: !473, file: !472, line: 18, baseType: !12, size: 64, align: 64, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !473, file: !472, line: 19, baseType: !12, size: 64, align: 64, offset: 384)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !473, file: !472, line: 20, baseType: !12, size: 64, align: 64, offset: 448)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "co_varnames", scope: !473, file: !472, line: 21, baseType: !12, size: 64, align: 64, offset: 512)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "co_freevars", scope: !473, file: !472, line: 22, baseType: !12, size: 64, align: 64, offset: 576)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "co_cellvars", scope: !473, file: !472, line: 23, baseType: !12, size: 64, align: 64, offset: 640)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "co_cell2arg", scope: !473, file: !472, line: 25, baseType: !488, size: 64, align: 64, offset: 704)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !473, file: !472, line: 26, baseType: !12, size: 64, align: 64, offset: 768)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !473, file: !472, line: 27, baseType: !12, size: 64, align: 64, offset: 832)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !473, file: !472, line: 28, baseType: !51, size: 32, align: 32, offset: 896)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "co_lnotab", scope: !473, file: !472, line: 29, baseType: !12, size: 64, align: 64, offset: 960)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "co_zombieframe", scope: !473, file: !472, line: 31, baseType: !97, size: 64, align: 64, offset: 1024)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !473, file: !472, line: 32, baseType: !12, size: 64, align: 64, offset: 1088)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "f_builtins", scope: !464, file: !465, line: 21, baseType: !12, size: 64, align: 64, offset: 320)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "f_globals", scope: !464, file: !465, line: 22, baseType: !12, size: 64, align: 64, offset: 384)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "f_locals", scope: !464, file: !465, line: 23, baseType: !12, size: 64, align: 64, offset: 448)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "f_valuestack", scope: !464, file: !465, line: 24, baseType: !499, size: 64, align: 64, offset: 512)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "f_stacktop", scope: !464, file: !465, line: 28, baseType: !499, size: 64, align: 64, offset: 576)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "f_trace", scope: !464, file: !465, line: 29, baseType: !12, size: 64, align: 64, offset: 640)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_type", scope: !464, file: !465, line: 38, baseType: !12, size: 64, align: 64, offset: 704)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_value", scope: !464, file: !465, line: 38, baseType: !12, size: 64, align: 64, offset: 768)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_traceback", scope: !464, file: !465, line: 38, baseType: !12, size: 64, align: 64, offset: 832)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "f_gen", scope: !464, file: !465, line: 40, baseType: !12, size: 64, align: 64, offset: 896)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "f_lasti", scope: !464, file: !465, line: 42, baseType: !51, size: 32, align: 32, offset: 960)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "f_lineno", scope: !464, file: !465, line: 48, baseType: !51, size: 32, align: 32, offset: 992)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "f_iblock", scope: !464, file: !465, line: 49, baseType: !51, size: 32, align: 32, offset: 1024)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "f_executing", scope: !464, file: !465, line: 50, baseType: !38, size: 8, align: 8, offset: 1056)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "f_blockstack", scope: !464, file: !465, line: 51, baseType: !511, size: 1920, align: 32, offset: 1088)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 1920, align: 32, elements: !108)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTryBlock", file: !465, line: 15, baseType: !513)
!513 = !DICompositeType(tag: DW_TAG_structure_type, file: !465, line: 11, size: 96, align: 32, elements: !514)
!514 = !{!515, !516, !517}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "b_type", scope: !513, file: !465, line: 12, baseType: !51, size: 32, align: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "b_handler", scope: !513, file: !465, line: 13, baseType: !51, size: 32, align: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "b_level", scope: !513, file: !465, line: 14, baseType: !51, size: 32, align: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "f_localsplus", scope: !464, file: !465, line: 52, baseType: !393, size: 64, align: 64, offset: 3008)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !437, file: !436, line: 77, baseType: !51, size: 32, align: 32, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !437, file: !436, line: 78, baseType: !38, size: 8, align: 8, offset: 288)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !437, file: !436, line: 80, baseType: !38, size: 8, align: 8, offset: 296)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !437, file: !436, line: 85, baseType: !51, size: 32, align: 32, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !437, file: !436, line: 86, baseType: !51, size: 32, align: 32, offset: 352)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !437, file: !436, line: 88, baseType: !525, size: 64, align: 64, offset: 384)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !436, line: 54, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!51, !12, !463, !51, !12}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !437, file: !436, line: 89, baseType: !525, size: 64, align: 64, offset: 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !437, file: !436, line: 90, baseType: !12, size: 64, align: 64, offset: 512)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !437, file: !436, line: 91, baseType: !12, size: 64, align: 64, offset: 576)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !437, file: !436, line: 93, baseType: !12, size: 64, align: 64, offset: 640)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !437, file: !436, line: 94, baseType: !12, size: 64, align: 64, offset: 704)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !437, file: !436, line: 95, baseType: !12, size: 64, align: 64, offset: 768)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !437, file: !436, line: 97, baseType: !12, size: 64, align: 64, offset: 832)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !437, file: !436, line: 98, baseType: !12, size: 64, align: 64, offset: 896)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !437, file: !436, line: 99, baseType: !12, size: 64, align: 64, offset: 960)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !437, file: !436, line: 101, baseType: !12, size: 64, align: 64, offset: 1024)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !437, file: !436, line: 103, baseType: !51, size: 32, align: 32, offset: 1088)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !437, file: !436, line: 105, baseType: !12, size: 64, align: 64, offset: 1152)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !437, file: !436, line: 106, baseType: !24, size: 64, align: 64, offset: 1216)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !437, file: !436, line: 108, baseType: !51, size: 32, align: 32, offset: 1280)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !437, file: !436, line: 109, baseType: !12, size: 64, align: 64, offset: 1344)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !437, file: !436, line: 134, baseType: !345, size: 64, align: 64, offset: 1408)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !437, file: !436, line: 135, baseType: !97, size: 64, align: 64, offset: 1472)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !299, line: 24, baseType: !298)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64, align: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyWrapperDescrObject", file: !309, line: 72, baseType: !551)
!551 = !DICompositeType(tag: DW_TAG_structure_type, file: !309, line: 68, size: 448, align: 64, elements: !552)
!552 = !{!553, !561, !576}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "d_common", scope: !551, file: !309, line: 69, baseType: !554, size: 320, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDescrObject", file: !309, line: 46, baseType: !555)
!555 = !DICompositeType(tag: DW_TAG_structure_type, file: !309, line: 41, size: 320, align: 64, elements: !556)
!556 = !{!557, !558, !559, !560}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !555, file: !309, line: 42, baseType: !13, size: 128, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !555, file: !309, line: 43, baseType: !369, size: 64, align: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !555, file: !309, line: 44, baseType: !12, size: 64, align: 64, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "d_qualname", scope: !555, file: !309, line: 45, baseType: !12, size: 64, align: 64, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "d_base", scope: !551, file: !309, line: 70, baseType: !562, size: 64, align: 64, offset: 320)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "wrapperbase", file: !309, line: 26, size: 448, align: 64, elements: !564)
!564 = !{!565, !566, !567, !568, !573, !574, !575}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !563, file: !309, line: 27, baseType: !59, size: 64, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !563, file: !309, line: 28, baseType: !51, size: 32, align: 32, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !563, file: !309, line: 29, baseType: !97, size: 64, align: 64, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper", scope: !563, file: !309, line: 30, baseType: !569, size: 64, align: 64, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "wrapperfunc", file: !309, line: 20, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64, align: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!12, !12, !12, !97}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !563, file: !309, line: 31, baseType: !59, size: 64, align: 64, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !563, file: !309, line: 32, baseType: !51, size: 32, align: 32, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "name_strobj", scope: !563, file: !309, line: 33, baseType: !12, size: 64, align: 64, offset: 384)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "d_wrapped", scope: !551, file: !309, line: 71, baseType: !97, size: 64, align: 64, offset: 384)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64, align: 64)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "slotdef", file: !1, line: 6103, baseType: !563)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64, align: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionObject", file: !289, line: 80, baseType: !583)
!583 = !DICompositeType(tag: DW_TAG_structure_type, file: !289, line: 75, size: 320, align: 64, elements: !584)
!584 = !{!585, !586, !589, !590}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !583, file: !289, line: 76, baseType: !13, size: 128, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "m_ml", scope: !583, file: !289, line: 77, baseType: !587, size: 64, align: 64, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !289, line: 47, baseType: !288)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "m_self", scope: !583, file: !289, line: 78, baseType: !12, size: 64, align: 64, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "m_module", scope: !583, file: !289, line: 79, baseType: !12, size: 64, align: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !593, line: 40, baseType: !594)
!593 = !DIFile(filename: "Include/listobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!594 = !DICompositeType(tag: DW_TAG_structure_type, file: !593, line: 23, size: 320, align: 64, elements: !595)
!595 = !{!596, !597, !598}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !594, file: !593, line: 24, baseType: !30, size: 192, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !594, file: !593, line: 26, baseType: !499, size: 64, align: 64, offset: 192)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !594, file: !593, line: 39, baseType: !18, size: 64, align: 64, offset: 256)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64, align: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "superobject", file: !1, line: 6705, baseType: !602)
!602 = !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 6700, size: 320, align: 64, elements: !603)
!603 = !{!604, !605, !606, !607}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !602, file: !1, line: 6701, baseType: !13, size: 128, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !602, file: !1, line: 6702, baseType: !369, size: 64, align: 64, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !602, file: !1, line: 6703, baseType: !12, size: 64, align: 64, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "obj_type", scope: !602, file: !1, line: 6704, baseType: !369, size: 64, align: 64, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCellObject", file: !610, line: 12, baseType: !611)
!610 = !DIFile(filename: "Include/cellobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!611 = !DICompositeType(tag: DW_TAG_structure_type, file: !610, line: 9, size: 192, align: 64, elements: !612)
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !611, file: !610, line: 10, baseType: !13, size: 128, align: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ob_ref", scope: !611, file: !610, line: 11, baseType: !12, size: 64, align: 64, offset: 128)
!615 = !{!616, !623, !629, !644, !648, !656, !668, !675, !686, !700, !705, !716, !753, !758, !764, !783, !790, !820, !827, !837, !850, !858, !870, !876, !882, !941, !950, !955, !958, !978, !998, !1052, !1063, !1076, !1103, !1119, !1126, !1134, !1149, !1170, !1177, !1190, !1193, !1202, !1207, !1213, !1219, !1233, !1240, !1249, !1258, !1265, !1279, !1283, !1310, !1323, !1330, !1338, !1347, !1355, !1363, !1377, !1382, !1392, !1397, !1402, !1407, !1412, !1417, !1433, !1436, !1443, !1450, !1458, !1466, !1475, !1483, !1498, !1505, !1519, !1534, !1540, !1554, !1572, !1585, !1592, !1599, !1613, !1627, !1641, !1655, !1660, !1674, !1682, !1690, !1693, !1696, !1699, !1717, !1724, !1727, !1741, !1755, !1769, !1783, !1797, !1800, !1803, !1807, !1811, !1815, !1819, !1824, !1828, !1832, !1836, !1840, !1844, !1858, !1872, !1876, !1880, !1883, !1890, !1897, !1901, !1909, !1918, !1926, !1934, !1976, !1984, !1997, !2005, !2015, !2024, !2044, !2052, !2064, !2075, !2080, !2097, !2105, !2115, !2127, !2160, !2173, !2177, !2216, !2235, !2250, !2273, !2282, !2320, !2335, !2340, !2344, !2348, !2359, !2393, !2402, !2420, !2427, !2435, !2439, !2479, !2488, !2492, !2500, !2517, !2521, !2526, !2536, !2548, !2552, !2557, !2562, !2566, !2574, !2671, !2674, !2683, !2686, !2690, !2693, !2712, !2718, !2743, !2764, !2780, !2784, !2787, !2790, !2816, !2820, !2832, !2856, !2866, !2924, !2988, !3049, !3060, !3086, !3155, !3167, !3172, !3176, !3188, !3194, !3220, !3224, !3235, !3242, !3246, !3274, !3294, !3307, !3322, !3353, !3365, !3369, !3374, !3378, !3392, !3406, !3416, !3437, !3441, !3470, !3488, !3498, !3511}
!616 = !DISubprogram(name: "_PyType_GetDocFromInternalDoc", scope: !1, file: !1, line: 124, type: !617, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i8*)* @_PyType_GetDocFromInternalDoc, variables: !619)
!617 = !DISubroutineType(types: !618)
!618 = !{!12, !36, !36}
!619 = !{!620, !621, !622}
!620 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !616, file: !1, line: 124, type: !36)
!621 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "internal_doc", arg: 2, scope: !616, file: !1, line: 124, type: !36)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "doc", scope: !616, file: !1, line: 126, type: !36)
!623 = !DISubprogram(name: "_PyType_GetTextSignatureFromInternalDoc", scope: !1, file: !1, line: 137, type: !617, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i8*)* @_PyType_GetTextSignatureFromInternalDoc, variables: !624)
!624 = !{!625, !626, !627, !628}
!625 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !623, file: !1, line: 137, type: !36)
!626 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "internal_doc", arg: 2, scope: !623, file: !1, line: 137, type: !36)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !623, file: !1, line: 139, type: !36)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !623, file: !1, line: 140, type: !36)
!629 = !DISubprogram(name: "PyType_ClearCache", scope: !1, file: !1, line: 160, type: !630, isLocal: false, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @PyType_ClearCache, variables: !632)
!630 = !DISubroutineType(types: !631)
!631 = !{!356}
!632 = !{!633, !634, !635, !640}
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !629, file: !1, line: 162, type: !18)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur_version_tag", scope: !629, file: !1, line: 163, type: !356)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !636, file: !1, line: 167, type: !12)
!636 = distinct !DILexicalBlock(scope: !637, file: !1, line: 167, column: 9)
!637 = distinct !DILexicalBlock(scope: !638, file: !1, line: 165, column: 50)
!638 = distinct !DILexicalBlock(scope: !639, file: !1, line: 165, column: 5)
!639 = distinct !DILexicalBlock(scope: !629, file: !1, line: 165, column: 5)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !641, file: !1, line: 167, type: !12)
!641 = distinct !DILexicalBlock(scope: !642, file: !1, line: 167, column: 9)
!642 = distinct !DILexicalBlock(scope: !643, file: !1, line: 167, column: 9)
!643 = distinct !DILexicalBlock(scope: !636, file: !1, line: 167, column: 9)
!644 = !DISubprogram(name: "_PyType_Fini", scope: !1, file: !1, line: 177, type: !645, isLocal: false, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_PyType_Fini, variables: !647)
!645 = !DISubroutineType(types: !646)
!646 = !{null}
!647 = !{}
!648 = !DISubprogram(name: "PyType_Modified", scope: !1, file: !1, line: 183, type: !649, isLocal: false, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._typeobject*)* @PyType_Modified, variables: !651)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !369}
!651 = !{!652, !653, !654, !655}
!652 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !648, file: !1, line: 183, type: !369)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "raw", scope: !648, file: !1, line: 204, type: !12)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref", scope: !648, file: !1, line: 204, type: !12)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !648, file: !1, line: 205, type: !18)
!656 = !DISubprogram(name: "PyType_GenericAlloc", scope: !1, file: !1, line: 880, type: !657, isLocal: false, isDefinition: true, scopeLine: 881, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, i64)* @PyType_GenericAlloc, variables: !659)
!657 = !DISubroutineType(types: !658)
!658 = !{!12, !369, !18}
!659 = !{!660, !661, !662, !663, !665}
!660 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !656, file: !1, line: 880, type: !369)
!661 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nitems", arg: 2, scope: !656, file: !1, line: 880, type: !18)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !656, file: !1, line: 882, type: !12)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !656, file: !1, line: 883, type: !664)
!664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !666, file: !1, line: 905, type: !372)
!666 = distinct !DILexicalBlock(scope: !667, file: !1, line: 905, column: 9)
!667 = distinct !DILexicalBlock(scope: !656, file: !1, line: 904, column: 9)
!668 = !DISubprogram(name: "PyType_GenericNew", scope: !1, file: !1, line: 910, type: !669, isLocal: false, isDefinition: true, scopeLine: 911, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @PyType_GenericNew, variables: !671)
!669 = !DISubroutineType(types: !670)
!670 = !{!12, !369, !12, !12}
!671 = !{!672, !673, !674}
!672 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !668, file: !1, line: 910, type: !369)
!673 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !668, file: !1, line: 910, type: !12)
!674 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !668, file: !1, line: 910, type: !12)
!675 = !DISubprogram(name: "PyType_IsSubtype", scope: !1, file: !1, line: 1288, type: !676, isLocal: false, isDefinition: true, scopeLine: 1289, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._typeobject*, %struct._typeobject*)* @PyType_IsSubtype, variables: !678)
!676 = !DISubroutineType(types: !677)
!677 = !{!51, !369, !369}
!678 = !{!679, !680, !681, !682, !685}
!679 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !675, file: !1, line: 1288, type: !369)
!680 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !675, file: !1, line: 1288, type: !369)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mro", scope: !675, file: !1, line: 1290, type: !12)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !683, file: !1, line: 1296, type: !18)
!683 = distinct !DILexicalBlock(scope: !684, file: !1, line: 1293, column: 22)
!684 = distinct !DILexicalBlock(scope: !675, file: !1, line: 1293, column: 9)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !683, file: !1, line: 1296, type: !18)
!686 = !DISubprogram(name: "_PyObject_LookupSpecial", scope: !1, file: !1, line: 1359, type: !687, isLocal: false, isDefinition: true, scopeLine: 1360, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._Py_Identifier*)* @_PyObject_LookupSpecial, variables: !697)
!687 = !DISubroutineType(types: !688)
!688 = !{!12, !12, !689}
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64, align: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !14, line: 144, baseType: !691)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !14, line: 140, size: 192, align: 64, elements: !692)
!692 = !{!693, !695, !696}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !691, file: !14, line: 141, baseType: !694, size: 64, align: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !691, file: !14, line: 142, baseType: !36, size: 64, align: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !691, file: !14, line: 143, baseType: !12, size: 64, align: 64, offset: 128)
!697 = !{!698, !699}
!698 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !686, file: !1, line: 1359, type: !12)
!699 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attrid", arg: 2, scope: !686, file: !1, line: 1359, type: !689)
!700 = !DISubprogram(name: "PyType_GetFlags", scope: !1, file: !1, line: 2088, type: !701, isLocal: false, isDefinition: true, scopeLine: 2089, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._typeobject*)* @PyType_GetFlags, variables: !703)
!701 = !DISubroutineType(types: !702)
!702 = !{!104, !369}
!703 = !{!704}
!704 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !700, file: !1, line: 2088, type: !369)
!705 = !DISubprogram(name: "_PyType_CalculateMetaclass", scope: !1, file: !1, line: 2095, type: !706, isLocal: false, isDefinition: true, scopeLine: 2096, flags: DIFlagPrototyped, isOptimized: true, function: %struct._typeobject* (%struct._typeobject*, %struct._object*)* @_PyType_CalculateMetaclass, variables: !708)
!706 = !DISubroutineType(types: !707)
!707 = !{!369, !369, !12}
!708 = !{!709, !710, !711, !712, !713, !714, !715}
!709 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "metatype", arg: 1, scope: !705, file: !1, line: 2095, type: !369)
!710 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bases", arg: 2, scope: !705, file: !1, line: 2095, type: !12)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !705, file: !1, line: 2097, type: !18)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbases", scope: !705, file: !1, line: 2097, type: !18)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "winner", scope: !705, file: !1, line: 2098, type: !369)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !705, file: !1, line: 2099, type: !12)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmptype", scope: !705, file: !1, line: 2100, type: !369)
!716 = !DISubprogram(name: "PyType_FromSpecWithBases", scope: !1, file: !1, line: 2545, type: !717, isLocal: false, isDefinition: true, scopeLine: 2546, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyType_Spec*, %struct._object*)* @PyType_FromSpecWithBases, variables: !734)
!717 = !DISubroutineType(types: !718)
!718 = !{!12, !719, !12}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyType_Spec", file: !14, line: 436, baseType: !721)
!721 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 430, size: 256, align: 64, elements: !722)
!722 = !{!723, !724, !725, !726, !727}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !721, file: !14, line: 431, baseType: !36, size: 64, align: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "basicsize", scope: !721, file: !14, line: 432, baseType: !51, size: 32, align: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !721, file: !14, line: 433, baseType: !51, size: 32, align: 32, offset: 96)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !721, file: !14, line: 434, baseType: !356, size: 32, align: 32, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !721, file: !14, line: 435, baseType: !728, size: 64, align: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyType_Slot", file: !14, line: 428, baseType: !730)
!730 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 425, size: 128, align: 64, elements: !731)
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !730, file: !14, line: 426, baseType: !51, size: 32, align: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "pfunc", scope: !730, file: !14, line: 427, baseType: !97, size: 64, align: 64, offset: 64)
!734 = !{!735, !736, !737, !738, !739, !740, !741, !742, !743, !749, !750, !751}
!735 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "spec", arg: 1, scope: !716, file: !1, line: 2545, type: !719)
!736 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bases", arg: 2, scope: !716, file: !1, line: 2545, type: !12)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !716, file: !1, line: 2547, type: !394)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !716, file: !1, line: 2548, type: !369)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !716, file: !1, line: 2548, type: !369)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !716, file: !1, line: 2549, type: !59)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res_start", scope: !716, file: !1, line: 2550, type: !59)
!742 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slot", scope: !716, file: !1, line: 2551, type: !728)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_doc", scope: !744, file: !1, line: 2633, type: !36)
!744 = distinct !DILexicalBlock(scope: !745, file: !1, line: 2632, column: 38)
!745 = distinct !DILexicalBlock(scope: !746, file: !1, line: 2632, column: 13)
!746 = distinct !DILexicalBlock(scope: !747, file: !1, line: 2620, column: 50)
!747 = distinct !DILexicalBlock(scope: !748, file: !1, line: 2620, column: 5)
!748 = distinct !DILexicalBlock(scope: !716, file: !1, line: 2620, column: 5)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !744, file: !1, line: 2634, type: !102)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tp_doc", scope: !744, file: !1, line: 2635, type: !59)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !752, file: !1, line: 2668, type: !12)
!752 = distinct !DILexicalBlock(scope: !716, file: !1, line: 2668, column: 5)
!753 = !DISubprogram(name: "PyType_FromSpec", scope: !1, file: !1, line: 2673, type: !754, isLocal: false, isDefinition: true, scopeLine: 2674, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyType_Spec*)* @PyType_FromSpec, variables: !756)
!754 = !DISubroutineType(types: !755)
!755 = !{!12, !719}
!756 = !{!757}
!757 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "spec", arg: 1, scope: !753, file: !1, line: 2673, type: !719)
!758 = !DISubprogram(name: "PyType_GetSlot", scope: !1, file: !1, line: 2679, type: !759, isLocal: false, isDefinition: true, scopeLine: 2680, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct._typeobject*, i32)* @PyType_GetSlot, variables: !761)
!759 = !DISubroutineType(types: !760)
!760 = !{!97, !369, !51}
!761 = !{!762, !763}
!762 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !758, file: !1, line: 2679, type: !369)
!763 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "slot", arg: 2, scope: !758, file: !1, line: 2679, type: !51)
!764 = !DISubprogram(name: "_PyType_Lookup", scope: !1, file: !1, line: 2695, type: !765, isLocal: false, isDefinition: true, scopeLine: 2696, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*)* @_PyType_Lookup, variables: !767)
!765 = !DISubroutineType(types: !766)
!766 = !{!12, !369, !12}
!767 = !{!768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !779}
!768 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !764, file: !1, line: 2695, type: !369)
!769 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !764, file: !1, line: 2695, type: !12)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !764, file: !1, line: 2697, type: !18)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !764, file: !1, line: 2697, type: !18)
!772 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mro", scope: !764, file: !1, line: 2698, type: !12)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !764, file: !1, line: 2698, type: !12)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !764, file: !1, line: 2698, type: !12)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !764, file: !1, line: 2698, type: !12)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "h", scope: !764, file: !1, line: 2699, type: !356)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !778, file: !1, line: 2734, type: !12)
!778 = distinct !DILexicalBlock(scope: !764, file: !1, line: 2734, column: 5)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !780, file: !1, line: 2741, type: !12)
!780 = distinct !DILexicalBlock(scope: !781, file: !1, line: 2741, column: 9)
!781 = distinct !DILexicalBlock(scope: !782, file: !1, line: 2736, column: 66)
!782 = distinct !DILexicalBlock(scope: !764, file: !1, line: 2736, column: 9)
!783 = !DISubprogram(name: "_PyType_LookupId", scope: !1, file: !1, line: 2748, type: !784, isLocal: false, isDefinition: true, scopeLine: 2749, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._Py_Identifier*)* @_PyType_LookupId, variables: !786)
!784 = !DISubroutineType(types: !785)
!785 = !{!12, !369, !694}
!786 = !{!787, !788, !789}
!787 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !783, file: !1, line: 2748, type: !369)
!788 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !783, file: !1, line: 2748, type: !694)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oname", scope: !783, file: !1, line: 2750, type: !12)
!790 = !DISubprogram(name: "PyType_Ready", scope: !1, file: !1, line: 4571, type: !791, isLocal: false, isDefinition: true, scopeLine: 4572, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._typeobject*)* @PyType_Ready, variables: !793)
!791 = !DISubroutineType(types: !792)
!792 = !{!51, !369}
!793 = !{!794, !795, !796, !797, !798, !799, !800, !804, !809, !810, !814, !816}
!794 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !790, file: !1, line: 4571, type: !369)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !790, file: !1, line: 4573, type: !12)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bases", scope: !790, file: !1, line: 4573, type: !12)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !790, file: !1, line: 4574, type: !369)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !790, file: !1, line: 4575, type: !18)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !790, file: !1, line: 4575, type: !18)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !801, file: !1, line: 4673, type: !12)
!801 = distinct !DILexicalBlock(scope: !802, file: !1, line: 4672, column: 29)
!802 = distinct !DILexicalBlock(scope: !803, file: !1, line: 4672, column: 5)
!803 = distinct !DILexicalBlock(scope: !790, file: !1, line: 4672, column: 5)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_doc", scope: !805, file: !1, line: 4696, type: !36)
!805 = distinct !DILexicalBlock(scope: !806, file: !1, line: 4695, column: 35)
!806 = distinct !DILexicalBlock(scope: !807, file: !1, line: 4695, column: 13)
!807 = distinct !DILexicalBlock(scope: !808, file: !1, line: 4694, column: 66)
!808 = distinct !DILexicalBlock(scope: !790, file: !1, line: 4694, column: 9)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "doc", scope: !805, file: !1, line: 4698, type: !12)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !811, file: !1, line: 4702, type: !12)
!811 = distinct !DILexicalBlock(scope: !812, file: !1, line: 4702, column: 17)
!812 = distinct !DILexicalBlock(scope: !813, file: !1, line: 4701, column: 75)
!813 = distinct !DILexicalBlock(scope: !805, file: !1, line: 4701, column: 17)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !815, file: !1, line: 4705, type: !12)
!815 = distinct !DILexicalBlock(scope: !805, file: !1, line: 4705, column: 13)
!816 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !817, file: !1, line: 4744, type: !12)
!817 = distinct !DILexicalBlock(scope: !818, file: !1, line: 4743, column: 29)
!818 = distinct !DILexicalBlock(scope: !819, file: !1, line: 4743, column: 5)
!819 = distinct !DILexicalBlock(scope: !790, file: !1, line: 4743, column: 5)
!820 = !DISubprogram(name: "_PyType_DocWithoutSignature", scope: !1, file: !1, line: 111, type: !821, isLocal: true, isDefinition: true, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true, variables: !823)
!821 = !DISubroutineType(types: !822)
!822 = !{!36, !36, !36}
!823 = !{!824, !825, !826}
!824 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !820, file: !1, line: 111, type: !36)
!825 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "internal_doc", arg: 2, scope: !820, file: !1, line: 111, type: !36)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "doc", scope: !820, file: !1, line: 113, type: !36)
!827 = !DISubprogram(name: "find_signature", scope: !1, file: !1, line: 66, type: !821, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, variables: !828)
!828 = !{!829, !830, !831, !832, !833, !836}
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !827, file: !1, line: 66, type: !36)
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "doc", arg: 2, scope: !827, file: !1, line: 66, type: !36)
!831 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dot", scope: !827, file: !1, line: 68, type: !36)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !827, file: !1, line: 69, type: !102)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !834, file: !1, line: 82, type: !102)
!834 = distinct !DILexicalBlock(scope: !835, file: !1, line: 82, column: 9)
!835 = distinct !DILexicalBlock(scope: !827, file: !1, line: 82, column: 9)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !834, file: !1, line: 82, type: !102)
!837 = !DISubprogram(name: "skip_signature", scope: !1, file: !1, line: 97, type: !838, isLocal: true, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true, variables: !840)
!838 = !DISubroutineType(types: !839)
!839 = !{!36, !36}
!840 = !{!841, !842, !846, !847, !849}
!841 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "doc", arg: 1, scope: !837, file: !1, line: 97, type: !36)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !843, file: !1, line: 101, type: !102)
!843 = distinct !DILexicalBlock(scope: !844, file: !1, line: 101, column: 14)
!844 = distinct !DILexicalBlock(scope: !845, file: !1, line: 100, column: 13)
!845 = distinct !DILexicalBlock(scope: !837, file: !1, line: 99, column: 18)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !843, file: !1, line: 101, type: !102)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !848, file: !1, line: 101, type: !431)
!848 = distinct !DILexicalBlock(scope: !843, file: !1, line: 101, column: 14)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !848, file: !1, line: 101, type: !51)
!850 = !DISubprogram(name: "lookup_maybe", scope: !1, file: !1, line: 1334, type: !687, isLocal: true, isDefinition: true, scopeLine: 1335, flags: DIFlagPrototyped, isOptimized: true, variables: !851)
!851 = !{!852, !853, !854, !855}
!852 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !850, file: !1, line: 1334, type: !12)
!853 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attrid", arg: 2, scope: !850, file: !1, line: 1334, type: !689)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !850, file: !1, line: 1336, type: !12)
!855 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !856, file: !1, line: 1340, type: !327)
!856 = distinct !DILexicalBlock(scope: !857, file: !1, line: 1339, column: 22)
!857 = distinct !DILexicalBlock(scope: !850, file: !1, line: 1339, column: 9)
!858 = !DISubprogram(name: "best_base", scope: !1, file: !1, line: 1798, type: !859, isLocal: true, isDefinition: true, scopeLine: 1799, flags: DIFlagPrototyped, isOptimized: true, function: %struct._typeobject* (%struct._object*)* @best_base, variables: !861)
!859 = !DISubroutineType(types: !860)
!860 = !{!369, !12}
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869}
!862 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bases", arg: 1, scope: !858, file: !1, line: 1798, type: !12)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !858, file: !1, line: 1800, type: !18)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !858, file: !1, line: 1800, type: !18)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !858, file: !1, line: 1801, type: !369)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "winner", scope: !858, file: !1, line: 1801, type: !369)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "candidate", scope: !858, file: !1, line: 1801, type: !369)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base_i", scope: !858, file: !1, line: 1801, type: !369)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base_proto", scope: !858, file: !1, line: 1802, type: !12)
!870 = !DISubprogram(name: "solid_base", scope: !1, file: !1, line: 1871, type: !871, isLocal: true, isDefinition: true, scopeLine: 1872, flags: DIFlagPrototyped, isOptimized: true, function: %struct._typeobject* (%struct._typeobject*)* @solid_base, variables: !873)
!871 = !DISubroutineType(types: !872)
!872 = !{!369, !369}
!873 = !{!874, !875}
!874 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !870, file: !1, line: 1871, type: !369)
!875 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !870, file: !1, line: 1873, type: !369)
!876 = !DISubprogram(name: "extra_ivars", scope: !1, file: !1, line: 1847, type: !676, isLocal: true, isDefinition: true, scopeLine: 1848, flags: DIFlagPrototyped, isOptimized: true, variables: !877)
!877 = !{!878, !879, !880, !881}
!878 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !876, file: !1, line: 1847, type: !369)
!879 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 2, scope: !876, file: !1, line: 1847, type: !369)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t_size", scope: !876, file: !1, line: 1849, type: !102)
!881 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b_size", scope: !876, file: !1, line: 1850, type: !102)
!882 = !DISubprogram(name: "subtype_dealloc", scope: !1, file: !1, line: 1027, type: !44, isLocal: true, isDefinition: true, scopeLine: 1028, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @subtype_dealloc, variables: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !896, !897, !900, !902, !903, !907, !909, !911, !912, !913, !914, !919, !923, !926, !929, !932, !936, !939}
!884 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !882, file: !1, line: 1027, type: !12)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !882, file: !1, line: 1029, type: !369)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !882, file: !1, line: 1029, type: !369)
!887 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "basedealloc", scope: !882, file: !1, line: 1030, type: !42)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !882, file: !1, line: 1031, type: !434)
!889 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !890, file: !1, line: 1031, type: !891)
