; ModuleID = 'weakrefobject.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !371, globals: !802)
!1 = !DIFile(filename: "Objects/weakrefobject.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !350, !362, !52, !351, !363}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !7, line: 109, baseType: !8)
!7 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !7, line: 105, size: 128, align: 64, elements: !9)
!9 = !{!10, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !8, file: !7, line: 107, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !12, line: 177, baseType: !13)
!12 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !14, line: 102, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !16, line: 181, baseType: !17)
!16 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !8, file: !7, line: 108, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !7, line: 334, size: 3200, align: 64, elements: !21)
!21 = !{!22, !28, !32, !33, !34, !39, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !20, file: !7, line: 335, baseType: !23, size: 192, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !7, line: 114, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 111, size: 192, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !24, file: !7, line: 112, baseType: !6, size: 128, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !24, file: !7, line: 113, baseType: !11, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !20, file: !7, line: 336, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !20, file: !7, line: 341, baseType: !35, size: 64, align: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !7, line: 308, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !5}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !20, file: !7, line: 342, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !7, line: 314, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !5, !45, !44}
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !14, line: 48, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 246, size: 1728, align: 64, elements: !49)
!48 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!49 = !{!50, !51, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !71, !72, !73, !74, !76, !78, !80, !84, !87, !89, !90, !91, !92, !93, !97, !98}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !48, line: 247, baseType: !44, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !47, file: !48, line: 252, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !47, file: !48, line: 253, baseType: !52, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !47, file: !48, line: 254, baseType: !52, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !47, file: !48, line: 255, baseType: !52, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !47, file: !48, line: 256, baseType: !52, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !47, file: !48, line: 257, baseType: !52, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !47, file: !48, line: 258, baseType: !52, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !47, file: !48, line: 259, baseType: !52, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !47, file: !48, line: 261, baseType: !52, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !47, file: !48, line: 262, baseType: !52, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !47, file: !48, line: 263, baseType: !52, size: 64, align: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !47, file: !48, line: 265, baseType: !64, size: 64, align: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !48, line: 161, size: 192, align: 64, elements: !66)
!66 = !{!67, !68, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !65, file: !48, line: 162, baseType: !64, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !65, file: !48, line: 163, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !65, file: !48, line: 167, baseType: !44, size: 32, align: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !47, file: !48, line: 267, baseType: !69, size: 64, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !47, file: !48, line: 269, baseType: !44, size: 32, align: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !47, file: !48, line: 273, baseType: !44, size: 32, align: 32, offset: 928)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !47, file: !48, line: 275, baseType: !75, size: 64, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !16, line: 140, baseType: !17)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !47, file: !48, line: 279, baseType: !77, size: 16, align: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !47, file: !48, line: 280, baseType: !79, size: 8, align: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !47, file: !48, line: 281, baseType: !81, size: 8, align: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !47, file: !48, line: 285, baseType: !85, size: 64, align: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !48, line: 155, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !47, file: !48, line: 294, baseType: !88, size: 64, align: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !16, line: 141, baseType: !17)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !47, file: !48, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !47, file: !48, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !47, file: !48, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !47, file: !48, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !47, file: !48, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !47, file: !48, line: 309, baseType: !44, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !47, file: !48, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !20, file: !7, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !7, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!5, !5, !52}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !20, file: !7, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !7, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!44, !5, !52, !5}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !20, file: !7, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !20, file: !7, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !7, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!5, !5}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !20, file: !7, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !7, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !7, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !7, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!5, !5, !5}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !7, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !7, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !7, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !7, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !7, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !7, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!5, !5, !5, !5}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !7, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !7, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !7, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !7, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !7, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !7, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!44, !5}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !7, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !7, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !7, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !7, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !7, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !7, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !7, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !7, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !7, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !7, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !7, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !7, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !7, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !7, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !7, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !7, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !7, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !7, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !7, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !7, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !7, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !7, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !7, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !7, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !20, file: !7, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !7, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !7, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !7, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!11, !5}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !7, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !7, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !7, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!5, !5, !11}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !7, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !7, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !7, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !7, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!44, !5, !11, !5}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !7, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !7, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !7, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!44, !5, !5}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !7, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !7, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !20, file: !7, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !7, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !7, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !7, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !7, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !7, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!44, !5, !5, !5}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !20, file: !7, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !7, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !5}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !12, line: 186, baseType: !11)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !20, file: !7, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !20, file: !7, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !20, file: !7, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !7, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !20, file: !7, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !7, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !20, file: !7, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !7, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !7, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !7, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!44, !5, !235, !44}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !7, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !7, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !7, line: 179, baseType: !4, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !7, line: 180, baseType: !5, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !7, line: 181, baseType: !11, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !7, line: 182, baseType: !11, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !7, line: 184, baseType: !44, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !7, line: 185, baseType: !44, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !7, line: 186, baseType: !52, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !7, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !7, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !7, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !7, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !7, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !7, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !5, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !20, file: !7, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !20, file: !7, line: 368, baseType: !29, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !20, file: !7, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !7, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!44, !5, !263, !4}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !7, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!44, !5, !4}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !20, file: !7, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !20, file: !7, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !7, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!5, !5, !5, !44}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !20, file: !7, line: 382, baseType: !11, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !20, file: !7, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !7, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !20, file: !7, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !7, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !20, file: !7, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !29, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !44, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !29, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !20, file: !7, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !291, line: 18, size: 320, align: 64, elements: !292)
!291 = !DIFile(filename: "Include/structmember.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!292 = !{!293, !294, !295, !296, !297}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !291, line: 19, baseType: !52, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !290, file: !291, line: 20, baseType: !44, size: 32, align: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !290, file: !291, line: 21, baseType: !11, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !290, file: !291, line: 22, baseType: !44, size: 32, align: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !290, file: !291, line: 23, baseType: !52, size: 64, align: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !20, file: !7, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !52, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!5, !5, !4}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!44, !5, !5, !4}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !52, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !20, file: !7, line: 392, baseType: !19, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !20, file: !7, line: 393, baseType: !5, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !20, file: !7, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !7, line: 325, baseType: !134)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !20, file: !7, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !7, line: 326, baseType: !210)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !20, file: !7, line: 396, baseType: !11, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !20, file: !7, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !7, line: 327, baseType: !210)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !20, file: !7, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !7, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!5, !19, !11}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !20, file: !7, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !7, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!5, !19, !5, !5}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !20, file: !7, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !7, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !4}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !20, file: !7, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !20, file: !7, line: 402, baseType: !5, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !20, file: !7, line: 403, baseType: !5, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !20, file: !7, line: 404, baseType: !5, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !20, file: !7, line: 405, baseType: !5, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !20, file: !7, line: 406, baseType: !5, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !20, file: !7, line: 407, baseType: !35, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !20, file: !7, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !20, file: !7, line: 412, baseType: !35, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyWeakReference", file: !353, line: 10, baseType: !354)
!353 = !DIFile(filename: "Include/weakrefobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyWeakReference", file: !353, line: 16, size: 448, align: 64, elements: !355)
!355 = !{!356, !357, !358, !359, !360, !361}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !354, file: !353, line: 17, baseType: !6, size: 128, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "wr_object", scope: !354, file: !353, line: 23, baseType: !5, size: 64, align: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "wr_callback", scope: !354, file: !353, line: 26, baseType: !5, size: 64, align: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !354, file: !353, line: 31, baseType: !218, size: 64, align: 64, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "wr_prev", scope: !354, file: !353, line: 38, baseType: !351, size: 64, align: 64, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "wr_next", scope: !354, file: !353, line: 39, baseType: !351, size: 64, align: 64, offset: 384)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !365, line: 33, baseType: !366)
!365 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!366 = !DICompositeType(tag: DW_TAG_structure_type, file: !365, line: 25, size: 256, align: 64, elements: !367)
!367 = !{!368, !369}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !366, file: !365, line: 26, baseType: !23, size: 192, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !366, file: !365, line: 27, baseType: !370, size: 64, align: 64, offset: 192)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, align: 64, elements: !82)
!371 = !{!372, !378, !384, !404, !423, !426, !465, !476, !479, !491, !496, !506, !517, !522, !532, !538, !547, !569, !578, !581, !584, !588, !591, !595, !599, !603, !607, !612, !615, !618, !621, !625, !628, !632, !636, !640, !644, !648, !651, !654, !658, !662, !666, !670, !675, !679, !683, !687, !691, !695, !699, !703, !707, !711, !714, !717, !723, !727, !734, !737, !741, !746, !751, !754, !757, !760, !765, !772, !779, !786, !792}
!372 = !DISubprogram(name: "_PyWeakref_GetWeakrefCount", scope: !1, file: !1, line: 10, type: !373, isLocal: false, isDefinition: true, scopeLine: 11, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._PyWeakReference*)* @_PyWeakref_GetWeakrefCount, variables: !375)
!373 = !DISubroutineType(types: !374)
!374 = !{!11, !351}
!375 = !{!376, !377}
!376 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "head", arg: 1, scope: !372, file: !1, line: 10, type: !351)
!377 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !372, file: !1, line: 12, type: !11)
!378 = !DISubprogram(name: "_PyWeakref_ClearRef", scope: !1, file: !1, line: 89, type: !379, isLocal: false, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._PyWeakReference*)* @_PyWeakref_ClearRef, variables: !381)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !351}
!381 = !{!382, !383}
!382 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !378, file: !1, line: 89, type: !351)
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "callback", scope: !378, file: !1, line: 91, type: !5)
!384 = !DISubprogram(name: "PyWeakref_NewRef", scope: !1, file: !1, line: 730, type: !126, isLocal: false, isDefinition: true, scopeLine: 731, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyWeakref_NewRef, variables: !385)
!385 = !{!386, !387, !388, !389, !390, !391, !392, !402}
!386 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ob", arg: 1, scope: !384, file: !1, line: 730, type: !5)
!387 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "callback", arg: 2, scope: !384, file: !1, line: 730, type: !5)
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !384, file: !1, line: 732, type: !351)
!389 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !384, file: !1, line: 733, type: !350)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref", scope: !384, file: !1, line: 734, type: !351)
!391 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "proxy", scope: !384, file: !1, line: 734, type: !351)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !393, file: !1, line: 768, type: !5)
!393 = distinct !DILexicalBlock(scope: !394, file: !1, line: 768, column: 21)
!394 = distinct !DILexicalBlock(scope: !395, file: !1, line: 763, column: 22)
!395 = distinct !DILexicalBlock(scope: !396, file: !1, line: 761, column: 21)
!396 = distinct !DILexicalBlock(scope: !397, file: !1, line: 760, column: 35)
!397 = distinct !DILexicalBlock(scope: !398, file: !1, line: 760, column: 17)
!398 = distinct !DILexicalBlock(scope: !399, file: !1, line: 758, column: 29)
!399 = distinct !DILexicalBlock(scope: !400, file: !1, line: 758, column: 13)
!400 = distinct !DILexicalBlock(scope: !401, file: !1, line: 751, column: 10)
!401 = distinct !DILexicalBlock(scope: !384, file: !1, line: 749, column: 9)
!402 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !403, file: !1, line: 774, type: !351)
!403 = distinct !DILexicalBlock(scope: !397, file: !1, line: 773, column: 18)
!404 = !DISubprogram(name: "PyWeakref_NewProxy", scope: !1, file: !1, line: 789, type: !126, isLocal: false, isDefinition: true, scopeLine: 790, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyWeakref_NewProxy, variables: !405)
!405 = !{!406, !407, !408, !409, !410, !411, !412, !417}
!406 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ob", arg: 1, scope: !404, file: !1, line: 789, type: !5)
!407 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "callback", arg: 2, scope: !404, file: !1, line: 789, type: !5)
!408 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !404, file: !1, line: 791, type: !351)
!409 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !404, file: !1, line: 792, type: !350)
!410 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref", scope: !404, file: !1, line: 793, type: !351)
!411 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "proxy", scope: !404, file: !1, line: 793, type: !351)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !413, file: !1, line: 818, type: !351)
!413 = distinct !DILexicalBlock(scope: !414, file: !1, line: 817, column: 29)
!414 = distinct !DILexicalBlock(scope: !415, file: !1, line: 817, column: 13)
!415 = distinct !DILexicalBlock(scope: !416, file: !1, line: 810, column: 10)
!416 = distinct !DILexicalBlock(scope: !404, file: !1, line: 808, column: 9)
!417 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !418, file: !1, line: 831, type: !5)
!418 = distinct !DILexicalBlock(scope: !419, file: !1, line: 831, column: 21)
!419 = distinct !DILexicalBlock(scope: !420, file: !1, line: 826, column: 36)
!420 = distinct !DILexicalBlock(scope: !421, file: !1, line: 826, column: 21)
!421 = distinct !DILexicalBlock(scope: !422, file: !1, line: 825, column: 35)
!422 = distinct !DILexicalBlock(scope: !413, file: !1, line: 825, column: 17)
!423 = !DISubprogram(name: "PyWeakref_GetObject", scope: !1, file: !1, line: 853, type: !116, isLocal: false, isDefinition: true, scopeLine: 854, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyWeakref_GetObject, variables: !424)
!424 = !{!425}
!425 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref", arg: 1, scope: !423, file: !1, line: 853, type: !5)
!426 = !DISubprogram(name: "PyObject_ClearWeakRefs", scope: !1, file: !1, line: 883, type: !37, isLocal: false, isDefinition: true, scopeLine: 884, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @PyObject_ClearWeakRefs, variables: !427)
!427 = !{!428, !429, !430, !433, !434, !435, !436, !437, !438, !441, !445, !447, !448, !452, !456, !460, !463}
!428 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !426, file: !1, line: 883, type: !5)
!429 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !426, file: !1, line: 885, type: !350)
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "current", scope: !431, file: !1, line: 901, type: !351)
!431 = distinct !DILexicalBlock(scope: !432, file: !1, line: 900, column: 24)
!432 = distinct !DILexicalBlock(scope: !426, file: !1, line: 900, column: 9)
!433 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !431, file: !1, line: 902, type: !11)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "restore_error", scope: !431, file: !1, line: 903, type: !44)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err_type", scope: !431, file: !1, line: 904, type: !5)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err_value", scope: !431, file: !1, line: 904, type: !5)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err_tb", scope: !431, file: !1, line: 904, type: !5)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "callback", scope: !439, file: !1, line: 909, type: !5)
!439 = distinct !DILexicalBlock(scope: !440, file: !1, line: 908, column: 25)
!440 = distinct !DILexicalBlock(scope: !431, file: !1, line: 908, column: 13)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !442, file: !1, line: 916, type: !5)
!442 = distinct !DILexicalBlock(scope: !443, file: !1, line: 916, column: 17)
!443 = distinct !DILexicalBlock(scope: !444, file: !1, line: 913, column: 35)
!444 = distinct !DILexicalBlock(scope: !439, file: !1, line: 913, column: 17)
!445 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tuple", scope: !446, file: !1, line: 920, type: !5)
!446 = distinct !DILexicalBlock(scope: !440, file: !1, line: 919, column: 14)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !446, file: !1, line: 921, type: !11)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next", scope: !449, file: !1, line: 931, type: !351)
!449 = distinct !DILexicalBlock(scope: !450, file: !1, line: 930, column: 41)
!450 = distinct !DILexicalBlock(scope: !451, file: !1, line: 930, column: 13)
!451 = distinct !DILexicalBlock(scope: !446, file: !1, line: 930, column: 13)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !453, file: !1, line: 940, type: !5)
!453 = distinct !DILexicalBlock(scope: !454, file: !1, line: 940, column: 21)
!454 = distinct !DILexicalBlock(scope: !455, file: !1, line: 939, column: 22)
!455 = distinct !DILexicalBlock(scope: !449, file: !1, line: 933, column: 21)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "callback", scope: !457, file: !1, line: 947, type: !5)
!457 = distinct !DILexicalBlock(scope: !458, file: !1, line: 946, column: 41)
!458 = distinct !DILexicalBlock(scope: !459, file: !1, line: 946, column: 13)
!459 = distinct !DILexicalBlock(scope: !446, file: !1, line: 946, column: 13)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !461, file: !1, line: 951, type: !5)
!461 = distinct !DILexicalBlock(scope: !462, file: !1, line: 950, column: 39)
!462 = distinct !DILexicalBlock(scope: !457, file: !1, line: 950, column: 21)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !464, file: !1, line: 955, type: !5)
!464 = distinct !DILexicalBlock(scope: !446, file: !1, line: 955, column: 13)
!465 = !DISubprogram(name: "clear_weakref", scope: !1, file: !1, line: 51, type: !379, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, variables: !466)
!466 = !{!467, !468, !469, !472}
!467 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !465, file: !1, line: 51, type: !351)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "callback", scope: !465, file: !1, line: 53, type: !5)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !470, file: !1, line: 56, type: !350)
!470 = distinct !DILexicalBlock(scope: !471, file: !1, line: 55, column: 37)
!471 = distinct !DILexicalBlock(scope: !465, file: !1, line: 55, column: 9)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !473, file: !1, line: 72, type: !5)
!473 = distinct !DILexicalBlock(scope: !474, file: !1, line: 72, column: 9)
!474 = distinct !DILexicalBlock(scope: !475, file: !1, line: 71, column: 27)
!475 = distinct !DILexicalBlock(scope: !465, file: !1, line: 71, column: 9)
!476 = !DISubprogram(name: "weakref_dealloc", scope: !1, file: !1, line: 103, type: !37, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @weakref_dealloc, variables: !477)
!477 = !{!478}
!478 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !476, file: !1, line: 103, type: !5)
!479 = !DISubprogram(name: "weakref_repr", scope: !1, file: !1, line: 156, type: !480, isLocal: true, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._PyWeakReference*)* @weakref_repr, variables: !482)
!480 = !DISubroutineType(types: !481)
!481 = !{!5, !351}
!482 = !{!483, !484, !485, !486, !488}
!483 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !479, file: !1, line: 156, type: !351)
!484 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !479, file: !1, line: 158, type: !5)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "repr", scope: !479, file: !1, line: 158, type: !5)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !487, file: !1, line: 182, type: !5)
!487 = distinct !DILexicalBlock(scope: !479, file: !1, line: 182, column: 5)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !489, file: !1, line: 182, type: !5)
!489 = distinct !DILexicalBlock(scope: !490, file: !1, line: 182, column: 5)
!490 = distinct !DILexicalBlock(scope: !487, file: !1, line: 182, column: 5)
!491 = !DISubprogram(name: "weakref_hash", scope: !1, file: !1, line: 142, type: !492, isLocal: true, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._PyWeakReference*)* @weakref_hash, variables: !494)
!492 = !DISubroutineType(types: !493)
!493 = !{!218, !351}
!494 = !{!495}
!495 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !491, file: !1, line: 142, type: !351)
!496 = !DISubprogram(name: "weakref_call", scope: !1, file: !1, line: 128, type: !497, isLocal: true, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._PyWeakReference*, %struct._object*, %struct._object*)* @weakref_call, variables: !499)
!497 = !DISubroutineType(types: !498)
!498 = !{!5, !351, !5, !5}
!499 = !{!500, !501, !502, !503}
!500 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !496, file: !1, line: 128, type: !351)
!501 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !496, file: !1, line: 128, type: !5)
!502 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !496, file: !1, line: 128, type: !5)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "object", scope: !504, file: !1, line: 133, type: !5)
!504 = distinct !DILexicalBlock(scope: !505, file: !1, line: 132, column: 69)
!505 = distinct !DILexicalBlock(scope: !496, file: !1, line: 132, column: 9)
!506 = !DISubprogram(name: "gc_traverse", scope: !1, file: !1, line: 112, type: !507, isLocal: true, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyWeakReference*, i32 (%struct._object*, i8*)*, i8*)* @gc_traverse, variables: !509)
!507 = !DISubroutineType(types: !508)
!508 = !{!44, !351, !263, !4}
!509 = !{!510, !511, !512, !513}
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !506, file: !1, line: 112, type: !351)
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !506, file: !1, line: 112, type: !263)
!512 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !506, file: !1, line: 112, type: !4)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !514, file: !1, line: 114, type: !44)
!514 = distinct !DILexicalBlock(scope: !515, file: !1, line: 114, column: 5)
!515 = distinct !DILexicalBlock(scope: !516, file: !1, line: 114, column: 5)
!516 = distinct !DILexicalBlock(scope: !506, file: !1, line: 114, column: 5)
!517 = !DISubprogram(name: "gc_clear", scope: !1, file: !1, line: 120, type: !518, isLocal: true, isDefinition: true, scopeLine: 121, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyWeakReference*)* @gc_clear, variables: !520)
!518 = !DISubroutineType(types: !519)
!519 = !{!44, !351}
!520 = !{!521}
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !517, file: !1, line: 120, type: !351)
!522 = !DISubprogram(name: "weakref_richcompare", scope: !1, file: !1, line: 191, type: !523, isLocal: true, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._PyWeakReference*, %struct._PyWeakReference*, i32)* @weakref_richcompare, variables: !525)
!523 = !DISubroutineType(types: !524)
!524 = !{!5, !351, !351, !44}
!525 = !{!526, !527, !528, !529}
!526 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !522, file: !1, line: 191, type: !351)
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "other", arg: 2, scope: !522, file: !1, line: 191, type: !351)
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !522, file: !1, line: 191, type: !44)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !530, file: !1, line: 200, type: !44)
!530 = distinct !DILexicalBlock(scope: !531, file: !1, line: 199, column: 52)
!531 = distinct !DILexicalBlock(scope: !522, file: !1, line: 198, column: 9)
!532 = !DISubprogram(name: "weakref___init__", scope: !1, file: !1, line: 330, type: !211, isLocal: true, isDefinition: true, scopeLine: 331, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, %struct._object*)* @weakref___init__, variables: !533)
!533 = !{!534, !535, !536, !537}
!534 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !532, file: !1, line: 330, type: !5)
!535 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !532, file: !1, line: 330, type: !5)
!536 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !532, file: !1, line: 330, type: !5)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !532, file: !1, line: 332, type: !5)
!538 = !DISubprogram(name: "parse_weakref_init_args", scope: !1, file: !1, line: 268, type: !539, isLocal: true, isDefinition: true, scopeLine: 270, flags: DIFlagPrototyped, isOptimized: true, variables: !541)
!539 = !DISubroutineType(types: !540)
!540 = !{!44, !52, !5, !5, !362, !362}
!541 = !{!542, !543, !544, !545, !546}
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "funcname", arg: 1, scope: !538, file: !1, line: 268, type: !52)
!543 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !538, file: !1, line: 268, type: !5)
!544 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !538, file: !1, line: 268, type: !5)
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obp", arg: 4, scope: !538, file: !1, line: 269, type: !362)
!546 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "callbackp", arg: 5, scope: !538, file: !1, line: 269, type: !362)
!547 = !DISubprogram(name: "weakref___new__", scope: !1, file: !1, line: 276, type: !548, isLocal: true, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @weakref___new__, variables: !552)
!548 = !DISubroutineType(types: !549)
!549 = !{!5, !550, !5, !5}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !7, line: 422, baseType: !20)
!552 = !{!553, !554, !555, !556, !557, !558, !559, !562, !563, !564}
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !547, file: !1, line: 276, type: !550)
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !547, file: !1, line: 276, type: !5)
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !547, file: !1, line: 276, type: !5)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !547, file: !1, line: 278, type: !351)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ob", scope: !547, file: !1, line: 279, type: !5)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "callback", scope: !547, file: !1, line: 279, type: !5)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ref", scope: !560, file: !1, line: 282, type: !351)
!560 = distinct !DILexicalBlock(scope: !561, file: !1, line: 281, column: 75)
!561 = distinct !DILexicalBlock(scope: !547, file: !1, line: 281, column: 9)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "proxy", scope: !560, file: !1, line: 282, type: !351)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !560, file: !1, line: 283, type: !350)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !565, file: !1, line: 315, type: !351)
!565 = distinct !DILexicalBlock(scope: !566, file: !1, line: 314, column: 18)
!566 = distinct !DILexicalBlock(scope: !567, file: !1, line: 311, column: 17)
!567 = distinct !DILexicalBlock(scope: !568, file: !1, line: 309, column: 27)
!568 = distinct !DILexicalBlock(scope: !560, file: !1, line: 309, column: 13)
!569 = !DISubprogram(name: "init_weakref", scope: !1, file: !1, line: 23, type: !570, isLocal: true, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: true, variables: !572)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !351, !5, !5}
!572 = !{!573, !574, !575, !576}
!573 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !569, file: !1, line: 23, type: !351)
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ob", arg: 2, scope: !569, file: !1, line: 23, type: !5)
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "callback", arg: 3, scope: !569, file: !1, line: 23, type: !5)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !577, file: !1, line: 27, type: !5)
!577 = distinct !DILexicalBlock(scope: !569, file: !1, line: 27, column: 5)
!578 = !DISubprogram(name: "proxy_dealloc", scope: !1, file: !1, line: 535, type: !379, isLocal: true, isDefinition: true, scopeLine: 536, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._PyWeakReference*)* @proxy_dealloc, variables: !579)
!579 = !{!580}
!580 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !578, file: !1, line: 535, type: !351)
!581 = !DISubprogram(name: "proxy_repr", scope: !1, file: !1, line: 465, type: !480, isLocal: true, isDefinition: true, scopeLine: 466, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._PyWeakReference*)* @proxy_repr, variables: !582)
!582 = !{!583}
!583 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !581, file: !1, line: 465, type: !351)
!584 = !DISubprogram(name: "proxy_add", scope: !1, file: !1, line: 492, type: !126, isLocal: true, isDefinition: true, scopeLine: 492, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_add, variables: !585)
!585 = !{!586, !587}
!586 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !584, file: !1, line: 492, type: !5)
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !584, file: !1, line: 492, type: !5)
!588 = !DISubprogram(name: "proxy_checkref", scope: !1, file: !1, line: 392, type: !518, isLocal: true, isDefinition: true, scopeLine: 393, flags: DIFlagPrototyped, isOptimized: true, variables: !589)
!589 = !{!590}
!590 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !588, file: !1, line: 392, type: !351)
!591 = !DISubprogram(name: "proxy_sub", scope: !1, file: !1, line: 493, type: !126, isLocal: true, isDefinition: true, scopeLine: 493, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_sub, variables: !592)
!592 = !{!593, !594}
!593 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !591, file: !1, line: 493, type: !5)
!594 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !591, file: !1, line: 493, type: !5)
!595 = !DISubprogram(name: "proxy_mul", scope: !1, file: !1, line: 494, type: !126, isLocal: true, isDefinition: true, scopeLine: 494, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_mul, variables: !596)
!596 = !{!597, !598}
!597 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !595, file: !1, line: 494, type: !5)
!598 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !595, file: !1, line: 494, type: !5)
!599 = !DISubprogram(name: "proxy_mod", scope: !1, file: !1, line: 497, type: !126, isLocal: true, isDefinition: true, scopeLine: 497, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_mod, variables: !600)
!600 = !{!601, !602}
!601 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !599, file: !1, line: 497, type: !5)
!602 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !599, file: !1, line: 497, type: !5)
!603 = !DISubprogram(name: "proxy_divmod", scope: !1, file: !1, line: 498, type: !126, isLocal: true, isDefinition: true, scopeLine: 498, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_divmod, variables: !604)
!604 = !{!605, !606}
!605 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !603, file: !1, line: 498, type: !5)
!606 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !603, file: !1, line: 498, type: !5)
!607 = !DISubprogram(name: "proxy_pow", scope: !1, file: !1, line: 499, type: !135, isLocal: true, isDefinition: true, scopeLine: 499, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @proxy_pow, variables: !608)
!608 = !{!609, !610, !611}
!609 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !607, file: !1, line: 499, type: !5)
!610 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !607, file: !1, line: 499, type: !5)
!611 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 3, scope: !607, file: !1, line: 499, type: !5)
!612 = !DISubprogram(name: "proxy_neg", scope: !1, file: !1, line: 500, type: !116, isLocal: true, isDefinition: true, scopeLine: 500, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @proxy_neg, variables: !613)
!613 = !{!614}
!614 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !612, file: !1, line: 500, type: !5)
!615 = !DISubprogram(name: "proxy_pos", scope: !1, file: !1, line: 501, type: !116, isLocal: true, isDefinition: true, scopeLine: 501, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @proxy_pos, variables: !616)
!616 = !{!617}
!617 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !615, file: !1, line: 501, type: !5)
!618 = !DISubprogram(name: "proxy_abs", scope: !1, file: !1, line: 502, type: !116, isLocal: true, isDefinition: true, scopeLine: 502, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @proxy_abs, variables: !619)
!619 = !{!620}
!620 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !618, file: !1, line: 502, type: !5)
!621 = !DISubprogram(name: "proxy_bool", scope: !1, file: !1, line: 526, type: !518, isLocal: true, isDefinition: true, scopeLine: 527, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyWeakReference*)* @proxy_bool, variables: !622)
!622 = !{!623, !624}
!623 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !621, file: !1, line: 526, type: !351)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !621, file: !1, line: 528, type: !5)
!625 = !DISubprogram(name: "proxy_invert", scope: !1, file: !1, line: 503, type: !116, isLocal: true, isDefinition: true, scopeLine: 503, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @proxy_invert, variables: !626)
!626 = !{!627}
!627 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !625, file: !1, line: 503, type: !5)
!628 = !DISubprogram(name: "proxy_lshift", scope: !1, file: !1, line: 504, type: !126, isLocal: true, isDefinition: true, scopeLine: 504, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_lshift, variables: !629)
!629 = !{!630, !631}
!630 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !628, file: !1, line: 504, type: !5)
!631 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !628, file: !1, line: 504, type: !5)
!632 = !DISubprogram(name: "proxy_rshift", scope: !1, file: !1, line: 505, type: !126, isLocal: true, isDefinition: true, scopeLine: 505, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_rshift, variables: !633)
!633 = !{!634, !635}
!634 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !632, file: !1, line: 505, type: !5)
!635 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !632, file: !1, line: 505, type: !5)
!636 = !DISubprogram(name: "proxy_and", scope: !1, file: !1, line: 506, type: !126, isLocal: true, isDefinition: true, scopeLine: 506, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_and, variables: !637)
!637 = !{!638, !639}
!638 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !636, file: !1, line: 506, type: !5)
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !636, file: !1, line: 506, type: !5)
!640 = !DISubprogram(name: "proxy_xor", scope: !1, file: !1, line: 507, type: !126, isLocal: true, isDefinition: true, scopeLine: 507, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_xor, variables: !641)
!641 = !{!642, !643}
!642 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !640, file: !1, line: 507, type: !5)
!643 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !640, file: !1, line: 507, type: !5)
!644 = !DISubprogram(name: "proxy_or", scope: !1, file: !1, line: 508, type: !126, isLocal: true, isDefinition: true, scopeLine: 508, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_or, variables: !645)
!645 = !{!646, !647}
!646 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !644, file: !1, line: 508, type: !5)
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !644, file: !1, line: 508, type: !5)
!648 = !DISubprogram(name: "proxy_int", scope: !1, file: !1, line: 509, type: !116, isLocal: true, isDefinition: true, scopeLine: 509, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @proxy_int, variables: !649)
!649 = !{!650}
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !648, file: !1, line: 509, type: !5)
!651 = !DISubprogram(name: "proxy_float", scope: !1, file: !1, line: 510, type: !116, isLocal: true, isDefinition: true, scopeLine: 510, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @proxy_float, variables: !652)
!652 = !{!653}
!653 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !651, file: !1, line: 510, type: !5)
!654 = !DISubprogram(name: "proxy_iadd", scope: !1, file: !1, line: 511, type: !126, isLocal: true, isDefinition: true, scopeLine: 511, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_iadd, variables: !655)
!655 = !{!656, !657}
!656 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !654, file: !1, line: 511, type: !5)
!657 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !654, file: !1, line: 511, type: !5)
!658 = !DISubprogram(name: "proxy_isub", scope: !1, file: !1, line: 512, type: !126, isLocal: true, isDefinition: true, scopeLine: 512, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_isub, variables: !659)
!659 = !{!660, !661}
!660 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !658, file: !1, line: 512, type: !5)
!661 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !658, file: !1, line: 512, type: !5)
!662 = !DISubprogram(name: "proxy_imul", scope: !1, file: !1, line: 513, type: !126, isLocal: true, isDefinition: true, scopeLine: 513, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_imul, variables: !663)
!663 = !{!664, !665}
!664 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !662, file: !1, line: 513, type: !5)
!665 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !662, file: !1, line: 513, type: !5)
!666 = !DISubprogram(name: "proxy_imod", scope: !1, file: !1, line: 516, type: !126, isLocal: true, isDefinition: true, scopeLine: 516, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_imod, variables: !667)
!667 = !{!668, !669}
!668 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !666, file: !1, line: 516, type: !5)
!669 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !666, file: !1, line: 516, type: !5)
!670 = !DISubprogram(name: "proxy_ipow", scope: !1, file: !1, line: 517, type: !135, isLocal: true, isDefinition: true, scopeLine: 517, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @proxy_ipow, variables: !671)
!671 = !{!672, !673, !674}
!672 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !670, file: !1, line: 517, type: !5)
!673 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !670, file: !1, line: 517, type: !5)
!674 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 3, scope: !670, file: !1, line: 517, type: !5)
!675 = !DISubprogram(name: "proxy_ilshift", scope: !1, file: !1, line: 518, type: !126, isLocal: true, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_ilshift, variables: !676)
!676 = !{!677, !678}
!677 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !675, file: !1, line: 518, type: !5)
!678 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !675, file: !1, line: 518, type: !5)
!679 = !DISubprogram(name: "proxy_irshift", scope: !1, file: !1, line: 519, type: !126, isLocal: true, isDefinition: true, scopeLine: 519, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_irshift, variables: !680)
!680 = !{!681, !682}
!681 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !679, file: !1, line: 519, type: !5)
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !679, file: !1, line: 519, type: !5)
!683 = !DISubprogram(name: "proxy_iand", scope: !1, file: !1, line: 520, type: !126, isLocal: true, isDefinition: true, scopeLine: 520, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_iand, variables: !684)
!684 = !{!685, !686}
!685 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !683, file: !1, line: 520, type: !5)
!686 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !683, file: !1, line: 520, type: !5)
!687 = !DISubprogram(name: "proxy_ixor", scope: !1, file: !1, line: 521, type: !126, isLocal: true, isDefinition: true, scopeLine: 521, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_ixor, variables: !688)
!688 = !{!689, !690}
!689 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !687, file: !1, line: 521, type: !5)
!690 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !687, file: !1, line: 521, type: !5)
!691 = !DISubprogram(name: "proxy_ior", scope: !1, file: !1, line: 522, type: !126, isLocal: true, isDefinition: true, scopeLine: 522, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_ior, variables: !692)
!692 = !{!693, !694}
!693 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !691, file: !1, line: 522, type: !5)
!694 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !691, file: !1, line: 522, type: !5)
!695 = !DISubprogram(name: "proxy_floor_div", scope: !1, file: !1, line: 495, type: !126, isLocal: true, isDefinition: true, scopeLine: 495, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_floor_div, variables: !696)
!696 = !{!697, !698}
!697 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !695, file: !1, line: 495, type: !5)
!698 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !695, file: !1, line: 495, type: !5)
!699 = !DISubprogram(name: "proxy_true_div", scope: !1, file: !1, line: 496, type: !126, isLocal: true, isDefinition: true, scopeLine: 496, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_true_div, variables: !700)
!700 = !{!701, !702}
!701 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !699, file: !1, line: 496, type: !5)
!702 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !699, file: !1, line: 496, type: !5)
!703 = !DISubprogram(name: "proxy_ifloor_div", scope: !1, file: !1, line: 514, type: !126, isLocal: true, isDefinition: true, scopeLine: 514, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_ifloor_div, variables: !704)
!704 = !{!705, !706}
!705 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !703, file: !1, line: 514, type: !5)
!706 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !703, file: !1, line: 514, type: !5)
!707 = !DISubprogram(name: "proxy_itrue_div", scope: !1, file: !1, line: 515, type: !126, isLocal: true, isDefinition: true, scopeLine: 515, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_itrue_div, variables: !708)
!708 = !{!709, !710}
!709 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !707, file: !1, line: 515, type: !5)
!710 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !707, file: !1, line: 515, type: !5)
!711 = !DISubprogram(name: "proxy_index", scope: !1, file: !1, line: 523, type: !116, isLocal: true, isDefinition: true, scopeLine: 523, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @proxy_index, variables: !712)
!712 = !{!713}
!713 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !711, file: !1, line: 523, type: !5)
!714 = !DISubprogram(name: "proxy_length", scope: !1, file: !1, line: 557, type: !373, isLocal: true, isDefinition: true, scopeLine: 558, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._PyWeakReference*)* @proxy_length, variables: !715)
!715 = !{!716}
!716 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !714, file: !1, line: 557, type: !351)
!717 = !DISubprogram(name: "proxy_contains", scope: !1, file: !1, line: 546, type: !718, isLocal: true, isDefinition: true, scopeLine: 547, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyWeakReference*, %struct._object*)* @proxy_contains, variables: !720)
!718 = !DISubroutineType(types: !719)
!719 = !{!44, !351, !5}
!720 = !{!721, !722}
!721 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !717, file: !1, line: 546, type: !351)
!722 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !717, file: !1, line: 546, type: !5)
!723 = !DISubprogram(name: "proxy_getitem", scope: !1, file: !1, line: 564, type: !126, isLocal: true, isDefinition: true, scopeLine: 564, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_getitem, variables: !724)
!724 = !{!725, !726}
!725 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !723, file: !1, line: 564, type: !5)
!726 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !723, file: !1, line: 564, type: !5)
!727 = !DISubprogram(name: "proxy_setitem", scope: !1, file: !1, line: 567, type: !728, isLocal: true, isDefinition: true, scopeLine: 568, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyWeakReference*, %struct._object*, %struct._object*)* @proxy_setitem, variables: !730)
!728 = !DISubroutineType(types: !729)
!729 = !{!44, !351, !5, !5}
!730 = !{!731, !732, !733}
!731 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !727, file: !1, line: 567, type: !351)
!732 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !727, file: !1, line: 567, type: !5)
!733 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !727, file: !1, line: 567, type: !5)
!734 = !DISubprogram(name: "proxy_str", scope: !1, file: !1, line: 461, type: !116, isLocal: true, isDefinition: true, scopeLine: 461, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @proxy_str, variables: !735)
!735 = !{!736}
!736 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !734, file: !1, line: 461, type: !5)
!737 = !DISubprogram(name: "proxy_getattr", scope: !1, file: !1, line: 460, type: !126, isLocal: true, isDefinition: true, scopeLine: 460, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @proxy_getattr, variables: !738)
!738 = !{!739, !740}
!739 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !737, file: !1, line: 460, type: !5)
!740 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !737, file: !1, line: 460, type: !5)
!741 = !DISubprogram(name: "proxy_setattr", scope: !1, file: !1, line: 476, type: !728, isLocal: true, isDefinition: true, scopeLine: 477, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyWeakReference*, %struct._object*, %struct._object*)* @proxy_setattr, variables: !742)
!742 = !{!743, !744, !745}
!743 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !741, file: !1, line: 476, type: !351)
!744 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !741, file: !1, line: 476, type: !5)
!745 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !741, file: !1, line: 476, type: !5)
!746 = !DISubprogram(name: "proxy_richcompare", scope: !1, file: !1, line: 484, type: !271, isLocal: true, isDefinition: true, scopeLine: 485, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @proxy_richcompare, variables: !747)
!747 = !{!748, !749, !750}
!748 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !746, file: !1, line: 484, type: !5)
!749 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !746, file: !1, line: 484, type: !5)
!750 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !746, file: !1, line: 484, type: !44)
!751 = !DISubprogram(name: "proxy_iter", scope: !1, file: !1, line: 581, type: !480, isLocal: true, isDefinition: true, scopeLine: 582, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._PyWeakReference*)* @proxy_iter, variables: !752)
!752 = !{!753}
!753 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !751, file: !1, line: 581, type: !351)
!754 = !DISubprogram(name: "proxy_iternext", scope: !1, file: !1, line: 589, type: !480, isLocal: true, isDefinition: true, scopeLine: 590, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._PyWeakReference*)* @proxy_iternext, variables: !755)
!755 = !{!756}
!756 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !754, file: !1, line: 589, type: !351)
!757 = !DISubprogram(name: "proxy_bytes", scope: !1, file: !1, line: 597, type: !116, isLocal: true, isDefinition: true, scopeLine: 597, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @proxy_bytes, variables: !758)
!758 = !{!759}
!759 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !757, file: !1, line: 597, type: !5)
!760 = !DISubprogram(name: "proxy_call", scope: !1, file: !1, line: 462, type: !135, isLocal: true, isDefinition: true, scopeLine: 462, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @proxy_call, variables: !761)
!761 = !{!762, !763, !764}
!762 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxy", arg: 1, scope: !760, file: !1, line: 462, type: !5)
!763 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !760, file: !1, line: 462, type: !5)
!764 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 3, scope: !760, file: !1, line: 462, type: !5)
!765 = !DISubprogram(name: "get_basic_refs", scope: !1, file: !1, line: 218, type: !766, isLocal: true, isDefinition: true, scopeLine: 220, flags: DIFlagPrototyped, isOptimized: true, variables: !768)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !351, !350, !350}
!768 = !{!769, !770, !771}
!769 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "head", arg: 1, scope: !765, file: !1, line: 218, type: !351)
!770 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "refp", arg: 2, scope: !765, file: !1, line: 219, type: !350)
!771 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "proxyp", arg: 3, scope: !765, file: !1, line: 219, type: !350)
!772 = !DISubprogram(name: "new_weakref", scope: !1, file: !1, line: 32, type: !773, isLocal: true, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, variables: !775)
!773 = !DISubroutineType(types: !774)
!774 = !{!351, !5, !5}
!775 = !{!776, !777, !778}
!776 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ob", arg: 1, scope: !772, file: !1, line: 32, type: !5)
!777 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "callback", arg: 2, scope: !772, file: !1, line: 32, type: !5)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !772, file: !1, line: 34, type: !351)
!779 = !DISubprogram(name: "insert_head", scope: !1, file: !1, line: 256, type: !780, isLocal: true, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, variables: !782)
!780 = !DISubroutineType(types: !781)
!781 = !{null, !351, !350}
!782 = !{!783, !784, !785}
!783 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newref", arg: 1, scope: !779, file: !1, line: 256, type: !351)
!784 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 2, scope: !779, file: !1, line: 256, type: !350)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next", scope: !779, file: !1, line: 258, type: !351)
!786 = !DISubprogram(name: "insert_after", scope: !1, file: !1, line: 243, type: !787, isLocal: true, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: true, variables: !789)
!787 = !DISubroutineType(types: !788)
!788 = !{null, !351, !351}
!789 = !{!790, !791}
!790 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newref", arg: 1, scope: !786, file: !1, line: 243, type: !351)
!791 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prev", arg: 2, scope: !786, file: !1, line: 243, type: !351)
!792 = !DISubprogram(name: "handle_callback", scope: !1, file: !1, line: 866, type: !793, isLocal: true, isDefinition: true, scopeLine: 867, flags: DIFlagPrototyped, isOptimized: true, variables: !795)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !351, !5}
!795 = !{!796, !797, !798, !799}
!796 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ref", arg: 1, scope: !792, file: !1, line: 866, type: !351)
!797 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "callback", arg: 2, scope: !792, file: !1, line: 866, type: !5)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cbresult", scope: !792, file: !1, line: 868, type: !5)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !800, file: !1, line: 873, type: !5)
!800 = distinct !DILexicalBlock(scope: !801, file: !1, line: 873, column: 9)
!801 = distinct !DILexicalBlock(scope: !792, file: !1, line: 870, column: 9)
!802 = !{!803, !804, !805, !806, !814, !816, !821, !822, !823, !824, !827}
!803 = !DIGlobalVariable(name: "_PyWeakref_RefType", scope: !0, file: !1, line: 347, type: !551, isLocal: false, isDefinition: true, variable: %struct._typeobject* @_PyWeakref_RefType)
!804 = !DIGlobalVariable(name: "_PyWeakref_ProxyType", scope: !0, file: !1, line: 662, type: !551, isLocal: false, isDefinition: true, variable: %struct._typeobject* @_PyWeakref_ProxyType)
!805 = !DIGlobalVariable(name: "_PyWeakref_CallableProxyType", scope: !0, file: !1, line: 696, type: !551, isLocal: false, isDefinition: true, variable: %struct._typeobject* @_PyWeakref_CallableProxyType)
!806 = !DIGlobalVariable(name: "PyId___name__", scope: !479, file: !1, line: 159, type: !807, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @weakref_repr.PyId___name__)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !7, line: 144, baseType: !808)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !7, line: 140, size: 192, align: 64, elements: !809)
!809 = !{!810, !812, !813}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !808, file: !7, line: 141, baseType: !811, size: 64, align: 64)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64, align: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !808, file: !7, line: 142, baseType: !29, size: 64, align: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !808, file: !7, line: 143, baseType: !5, size: 64, align: 64, offset: 128)
!814 = !DIGlobalVariable(name: "kwlist", scope: !496, file: !1, line: 130, type: !815, isLocal: true, isDefinition: true, variable: [1 x i8*]* @weakref_call.kwlist)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 64, align: 64, elements: !82)
!816 = !DIGlobalVariable(name: "weakref_members", scope: !0, file: !1, line: 341, type: !817, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMemberDef]* @weakref_members)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 640, align: 64, elements: !819)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !291, line: 24, baseType: !290)
!819 = !{!820}
!820 = !DISubrange(count: 2)
!821 = !DIGlobalVariable(name: "proxy_as_number", scope: !0, file: !1, line: 606, type: !120, isLocal: true, isDefinition: true, variable: %struct.PyNumberMethods* @proxy_as_number)
!822 = !DIGlobalVariable(name: "proxy_as_sequence", scope: !0, file: !1, line: 643, type: !172, isLocal: true, isDefinition: true, variable: %struct.PySequenceMethods* @proxy_as_sequence)
!823 = !DIGlobalVariable(name: "proxy_as_mapping", scope: !0, file: !1, line: 654, type: !203, isLocal: true, isDefinition: true, variable: %struct.PyMappingMethods* @proxy_as_mapping)
!824 = !DIGlobalVariable(name: "proxy_methods", scope: !0, file: !1, line: 600, type: !825, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMethodDef]* @proxy_methods)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !826, size: 512, align: 64, elements: !819)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !281, line: 47, baseType: !280)
!827 = !DIGlobalVariable(name: "PyId___bytes__", scope: !757, file: !1, line: 597, type: !807, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @proxy_bytes.PyId___bytes__)
!828 = !{i32 2, !"Dwarf Version", i32 4}
!829 = !{i32 2, !"Debug Info Version", i32 3}
!830 = !{!"clang version 3.7.0 (tags/RELEASE_370/final)"}
!831 = !DIExpression()
!832 = !DILocation(line: 10, column: 45, scope: !372)
!833 = !DILocation(line: 12, column: 16, scope: !372)
!834 = !DILocation(line: 14, column: 17, scope: !372)
!835 = !DILocation(line: 14, column: 5, scope: !372)
!836 = !DILocation(line: 15, column: 9, scope: !837)
!837 = distinct !DILexicalBlock(scope: !372, file: !1, line: 14, column: 26)
!838 = !DILocation(line: 16, column: 22, scope: !837)
!839 = !{!840, !845, i64 48}
!840 = !{!"_PyWeakReference", !841, i64 0, !845, i64 16, !845, i64 24, !842, i64 32, !845, i64 40, !845, i64 48}
!841 = !{!"_object", !842, i64 0, !845, i64 8}
!842 = !{!"long", !843, i64 0}
!843 = !{!"omnipotent char", !844, i64 0}
!844 = !{!"Simple C/C++ TBAA"}
!845 = !{!"any pointer", !843, i64 0}
!846 = !DILocation(line: 18, column: 5, scope: !372)
!847 = !DILocation(line: 89, column: 38, scope: !378)
!848 = !DILocation(line: 96, column: 22, scope: !378)
!849 = !{!840, !845, i64 24}
!850 = !DILocation(line: 97, column: 23, scope: !378)
!851 = !DILocation(line: 51, column: 32, scope: !465, inlinedAt: !852)
!852 = distinct !DILocation(line: 98, column: 5, scope: !378)
!853 = !DILocation(line: 53, column: 15, scope: !465, inlinedAt: !852)
!854 = !DILocation(line: 55, column: 15, scope: !471, inlinedAt: !852)
!855 = !{!840, !845, i64 16}
!856 = !DILocation(line: 55, column: 25, scope: !471, inlinedAt: !852)
!857 = !DILocation(line: 55, column: 9, scope: !465, inlinedAt: !852)
!858 = !DILocation(line: 56, column: 34, scope: !470, inlinedAt: !852)
!859 = !{!841, !845, i64 8}
!860 = !{!861, !842, i64 208}
