; ModuleID = 'zipimport.o.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (tags/RELEASE_370/final)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !30, subprograms: !507, globals: !1127)
!1 = !DIFile(filename: "./Modules/zipimport.c", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!2 = !{!3, !9, !15, !22}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 329, size: 32, align: 32, elements: !4)
!4 = !{!5, !6, !7, !8}
!5 = !DIEnumerator(name: "FL_ERROR", value: 0)
!6 = !DIEnumerator(name: "FL_NOT_FOUND", value: 1)
!7 = !DIEnumerator(name: "FL_MODULE_FOUND", value: 2)
!8 = !DIEnumerator(name: "FL_NS_FOUND", value: 3)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "zi_module_info", file: !1, line: 262, size: 32, align: 32, elements: !10)
!10 = !{!11, !12, !13, !14}
!11 = !DIEnumerator(name: "MI_ERROR", value: 0)
!12 = !DIEnumerator(name: "MI_NOT_FOUND", value: 1)
!13 = !DIEnumerator(name: "MI_MODULE", value: 2)
!14 = !DIEnumerator(name: "MI_PACKAGE", value: 3)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !16, line: 451, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!17 = !{!18, !19, !20, !21}
!18 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!19 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!20 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!21 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !23, line: 23, size: 32, align: 32, elements: !24)
!23 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!24 = !{!25, !26, !27, !28, !29}
!25 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!26 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!27 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!28 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!29 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!30 = !{!31, !32, !377, !395, !71, !403, !406, !414, !79, !433, !44, !432, !434, !436, !438, !440, !448, !104, !38, !58, !449}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !34, line: 109, baseType: !35)
!34 = !DIFile(filename: "Include/object.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !34, line: 105, size: 128, align: 64, elements: !36)
!36 = !{!37, !45}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !35, file: !34, line: 107, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !39, line: 177, baseType: !40)
!39 = !DIFile(filename: "Include/pyport.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !41, line: 102, baseType: !42)
!41 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !43, line: 181, baseType: !44)
!43 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!44 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !35, file: !34, line: 108, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !34, line: 334, size: 3200, align: 64, elements: !48)
!48 = !{!49, !55, !59, !60, !61, !66, !129, !134, !139, !140, !145, !197, !228, !240, !246, !247, !248, !250, !252, !283, !284, !285, !294, !295, !300, !301, !303, !305, !315, !325, !343, !344, !345, !347, !349, !350, !352, !357, !362, !367, !368, !369, !370, !371, !372, !373, !374, !376}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !47, file: !34, line: 335, baseType: !50, size: 192, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !34, line: 114, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 111, size: 192, align: 64, elements: !52)
!52 = !{!53, !54}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !51, file: !34, line: 112, baseType: !33, size: 128, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !51, file: !34, line: 113, baseType: !38, size: 64, align: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !47, file: !34, line: 336, baseType: !56, size: 64, align: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!58 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !47, file: !34, line: 337, baseType: !38, size: 64, align: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !47, file: !34, line: 337, baseType: !38, size: 64, align: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !47, file: !34, line: 341, baseType: !62, size: 64, align: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !34, line: 308, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !32}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !47, file: !34, line: 342, baseType: !67, size: 64, align: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !34, line: 314, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!71, !32, !72, !71}
!71 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !41, line: 48, baseType: !74)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 246, size: 1728, align: 64, elements: !76)
!75 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!76 = !{!77, !78, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !98, !99, !100, !101, !103, !105, !107, !111, !114, !116, !117, !118, !119, !120, !124, !125}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !74, file: !75, line: 247, baseType: !71, size: 32, align: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !74, file: !75, line: 252, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !74, file: !75, line: 253, baseType: !79, size: 64, align: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !74, file: !75, line: 254, baseType: !79, size: 64, align: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !74, file: !75, line: 255, baseType: !79, size: 64, align: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !74, file: !75, line: 256, baseType: !79, size: 64, align: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !74, file: !75, line: 257, baseType: !79, size: 64, align: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !74, file: !75, line: 258, baseType: !79, size: 64, align: 64, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !74, file: !75, line: 259, baseType: !79, size: 64, align: 64, offset: 512)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !74, file: !75, line: 261, baseType: !79, size: 64, align: 64, offset: 576)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !74, file: !75, line: 262, baseType: !79, size: 64, align: 64, offset: 640)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !74, file: !75, line: 263, baseType: !79, size: 64, align: 64, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !74, file: !75, line: 265, baseType: !91, size: 64, align: 64, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !75, line: 161, size: 192, align: 64, elements: !93)
!93 = !{!94, !95, !97}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !92, file: !75, line: 162, baseType: !91, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !92, file: !75, line: 163, baseType: !96, size: 64, align: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !92, file: !75, line: 167, baseType: !71, size: 32, align: 32, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !74, file: !75, line: 267, baseType: !96, size: 64, align: 64, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !74, file: !75, line: 269, baseType: !71, size: 32, align: 32, offset: 896)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !74, file: !75, line: 273, baseType: !71, size: 32, align: 32, offset: 928)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !74, file: !75, line: 275, baseType: !102, size: 64, align: 64, offset: 960)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !43, line: 140, baseType: !44)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !74, file: !75, line: 279, baseType: !104, size: 16, align: 16, offset: 1024)
!104 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !74, file: !75, line: 280, baseType: !106, size: 8, align: 8, offset: 1040)
!106 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !74, file: !75, line: 281, baseType: !108, size: 8, align: 8, offset: 1048)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 8, align: 8, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 1)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !74, file: !75, line: 285, baseType: !112, size: 64, align: 64, offset: 1088)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !75, line: 155, baseType: null)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !74, file: !75, line: 294, baseType: !115, size: 64, align: 64, offset: 1152)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !43, line: 141, baseType: !44)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !74, file: !75, line: 303, baseType: !31, size: 64, align: 64, offset: 1216)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !74, file: !75, line: 304, baseType: !31, size: 64, align: 64, offset: 1280)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !74, file: !75, line: 305, baseType: !31, size: 64, align: 64, offset: 1344)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !74, file: !75, line: 306, baseType: !31, size: 64, align: 64, offset: 1408)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !74, file: !75, line: 307, baseType: !121, size: 64, align: 64, offset: 1472)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !122, line: 62, baseType: !123)
!122 = !DIFile(filename: "/home/juneyoung.lee/llvm-install-3.7.0/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!123 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !74, file: !75, line: 309, baseType: !71, size: 32, align: 32, offset: 1536)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !74, file: !75, line: 311, baseType: !126, size: 160, align: 8, offset: 1568)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 160, align: 8, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 20)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !47, file: !34, line: 343, baseType: !130, size: 64, align: 64, offset: 512)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !34, line: 316, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!32, !32, !79}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !47, file: !34, line: 344, baseType: !135, size: 64, align: 64, offset: 576)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !34, line: 318, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!71, !32, !79, !32}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !47, file: !34, line: 345, baseType: !31, size: 64, align: 64, offset: 640)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !47, file: !34, line: 346, baseType: !141, size: 64, align: 64, offset: 704)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !34, line: 320, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!32, !32}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !47, file: !34, line: 350, baseType: !146, size: 64, align: 64, offset: 768)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !34, line: 278, baseType: !148)
!148 = !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 236, size: 2176, align: 64, elements: !149)
!149 = !{!150, !155, !156, !157, !158, !159, !164, !166, !167, !168, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !148, file: !34, line: 241, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !34, line: 166, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!32, !32, !32}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !148, file: !34, line: 242, baseType: !151, size: 64, align: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !148, file: !34, line: 243, baseType: !151, size: 64, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !148, file: !34, line: 244, baseType: !151, size: 64, align: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !148, file: !34, line: 245, baseType: !151, size: 64, align: 64, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !148, file: !34, line: 246, baseType: !160, size: 64, align: 64, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !34, line: 167, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!32, !32, !32, !32}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !148, file: !34, line: 247, baseType: !165, size: 64, align: 64, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !34, line: 165, baseType: !142)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !148, file: !34, line: 248, baseType: !165, size: 64, align: 64, offset: 448)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !148, file: !34, line: 249, baseType: !165, size: 64, align: 64, offset: 512)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !148, file: !34, line: 250, baseType: !169, size: 64, align: 64, offset: 576)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !34, line: 168, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!71, !32}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !148, file: !34, line: 251, baseType: !165, size: 64, align: 64, offset: 640)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !148, file: !34, line: 252, baseType: !151, size: 64, align: 64, offset: 704)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !148, file: !34, line: 253, baseType: !151, size: 64, align: 64, offset: 768)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !148, file: !34, line: 254, baseType: !151, size: 64, align: 64, offset: 832)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !148, file: !34, line: 255, baseType: !151, size: 64, align: 64, offset: 896)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !148, file: !34, line: 256, baseType: !151, size: 64, align: 64, offset: 960)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !148, file: !34, line: 257, baseType: !165, size: 64, align: 64, offset: 1024)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !148, file: !34, line: 258, baseType: !31, size: 64, align: 64, offset: 1088)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !148, file: !34, line: 259, baseType: !165, size: 64, align: 64, offset: 1152)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !148, file: !34, line: 261, baseType: !151, size: 64, align: 64, offset: 1216)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !148, file: !34, line: 262, baseType: !151, size: 64, align: 64, offset: 1280)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !148, file: !34, line: 263, baseType: !151, size: 64, align: 64, offset: 1344)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !148, file: !34, line: 264, baseType: !151, size: 64, align: 64, offset: 1408)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !148, file: !34, line: 265, baseType: !160, size: 64, align: 64, offset: 1472)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !148, file: !34, line: 266, baseType: !151, size: 64, align: 64, offset: 1536)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !148, file: !34, line: 267, baseType: !151, size: 64, align: 64, offset: 1600)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !148, file: !34, line: 268, baseType: !151, size: 64, align: 64, offset: 1664)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !148, file: !34, line: 269, baseType: !151, size: 64, align: 64, offset: 1728)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !148, file: !34, line: 270, baseType: !151, size: 64, align: 64, offset: 1792)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !148, file: !34, line: 272, baseType: !151, size: 64, align: 64, offset: 1856)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !148, file: !34, line: 273, baseType: !151, size: 64, align: 64, offset: 1920)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !148, file: !34, line: 274, baseType: !151, size: 64, align: 64, offset: 1984)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !148, file: !34, line: 275, baseType: !151, size: 64, align: 64, offset: 2048)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !148, file: !34, line: 277, baseType: !165, size: 64, align: 64, offset: 2112)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !47, file: !34, line: 351, baseType: !198, size: 64, align: 64, offset: 832)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !34, line: 292, baseType: !200)
!200 = !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 280, size: 640, align: 64, elements: !201)
!201 = !{!202, !207, !208, !213, !214, !215, !220, !221, !226, !227}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !200, file: !34, line: 281, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !34, line: 169, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!38, !32}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !200, file: !34, line: 282, baseType: !151, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !200, file: !34, line: 283, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !34, line: 170, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!32, !32, !38}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !200, file: !34, line: 284, baseType: !209, size: 64, align: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !200, file: !34, line: 285, baseType: !31, size: 64, align: 64, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !200, file: !34, line: 286, baseType: !216, size: 64, align: 64, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !34, line: 172, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!71, !32, !38, !32}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !200, file: !34, line: 287, baseType: !31, size: 64, align: 64, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !200, file: !34, line: 288, baseType: !222, size: 64, align: 64, offset: 448)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !34, line: 231, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!71, !32, !32}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !200, file: !34, line: 290, baseType: !151, size: 64, align: 64, offset: 512)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !200, file: !34, line: 291, baseType: !209, size: 64, align: 64, offset: 576)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !47, file: !34, line: 352, baseType: !229, size: 64, align: 64, offset: 896)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !34, line: 298, baseType: !231)
!231 = !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 294, size: 192, align: 64, elements: !232)
!232 = !{!233, !234, !235}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !231, file: !34, line: 295, baseType: !203, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !231, file: !34, line: 296, baseType: !151, size: 64, align: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !231, file: !34, line: 297, baseType: !236, size: 64, align: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !34, line: 174, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!71, !32, !32, !32}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !47, file: !34, line: 356, baseType: !241, size: 64, align: 64, offset: 960)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !34, line: 321, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!245, !32}
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !39, line: 186, baseType: !38)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !47, file: !34, line: 357, baseType: !160, size: 64, align: 64, offset: 1024)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !47, file: !34, line: 358, baseType: !141, size: 64, align: 64, offset: 1088)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !47, file: !34, line: 359, baseType: !249, size: 64, align: 64, offset: 1152)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !34, line: 317, baseType: !152)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !47, file: !34, line: 360, baseType: !251, size: 64, align: 64, offset: 1216)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !34, line: 319, baseType: !237)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !47, file: !34, line: 363, baseType: !253, size: 64, align: 64, offset: 1280)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !34, line: 304, baseType: !255)
!255 = !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 301, size: 128, align: 64, elements: !256)
!256 = !{!257, !278}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !255, file: !34, line: 302, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !34, line: 193, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!71, !32, !262, !71}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !34, line: 191, baseType: !264)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !34, line: 178, size: 640, align: 64, elements: !265)
!265 = !{!266, !267, !268, !269, !270, !271, !272, !273, !275, !276, !277}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !264, file: !34, line: 179, baseType: !31, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !264, file: !34, line: 180, baseType: !32, size: 64, align: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !264, file: !34, line: 181, baseType: !38, size: 64, align: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !264, file: !34, line: 182, baseType: !38, size: 64, align: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !264, file: !34, line: 184, baseType: !71, size: 32, align: 32, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !264, file: !34, line: 185, baseType: !71, size: 32, align: 32, offset: 288)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !264, file: !34, line: 186, baseType: !79, size: 64, align: 64, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !264, file: !34, line: 187, baseType: !274, size: 64, align: 64, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !264, file: !34, line: 188, baseType: !274, size: 64, align: 64, offset: 448)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !264, file: !34, line: 189, baseType: !274, size: 64, align: 64, offset: 512)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !264, file: !34, line: 190, baseType: !31, size: 64, align: 64, offset: 576)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !255, file: !34, line: 303, baseType: !279, size: 64, align: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !34, line: 194, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !32, !262}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !47, file: !34, line: 366, baseType: !123, size: 64, align: 64, offset: 1344)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !47, file: !34, line: 368, baseType: !56, size: 64, align: 64, offset: 1408)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !47, file: !34, line: 372, baseType: !286, size: 64, align: 64, offset: 1472)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !34, line: 233, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!71, !32, !290, !31}
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !34, line: 232, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!71, !32, !31}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !47, file: !34, line: 375, baseType: !169, size: 64, align: 64, offset: 1536)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !47, file: !34, line: 379, baseType: !296, size: 64, align: 64, offset: 1600)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !34, line: 322, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!32, !32, !32, !71}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !47, file: !34, line: 382, baseType: !38, size: 64, align: 64, offset: 1664)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !47, file: !34, line: 385, baseType: !302, size: 64, align: 64, offset: 1728)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !34, line: 323, baseType: !142)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !47, file: !34, line: 386, baseType: !304, size: 64, align: 64, offset: 1792)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !34, line: 324, baseType: !142)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !47, file: !34, line: 389, baseType: !306, size: 64, align: 64, offset: 1856)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !308, line: 40, size: 256, align: 64, elements: !309)
!308 = !DIFile(filename: "Include/methodobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!309 = !{!310, !311, !313, !314}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !307, file: !308, line: 41, baseType: !56, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !307, file: !308, line: 42, baseType: !312, size: 64, align: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !308, line: 18, baseType: !152)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !307, file: !308, line: 43, baseType: !71, size: 32, align: 32, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !307, file: !308, line: 45, baseType: !56, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !47, file: !34, line: 390, baseType: !316, size: 64, align: 64, offset: 1920)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !318, line: 18, size: 320, align: 64, elements: !319)
!318 = !DIFile(filename: "Include/structmember.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!319 = !{!320, !321, !322, !323, !324}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !317, file: !318, line: 19, baseType: !79, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !317, file: !318, line: 20, baseType: !71, size: 32, align: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !317, file: !318, line: 21, baseType: !38, size: 64, align: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !317, file: !318, line: 22, baseType: !71, size: 32, align: 32, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !317, file: !318, line: 23, baseType: !79, size: 64, align: 64, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !47, file: !34, line: 391, baseType: !326, size: 64, align: 64, offset: 1984)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !328, line: 11, size: 320, align: 64, elements: !329)
!328 = !DIFile(filename: "Include/descrobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!329 = !{!330, !331, !336, !341, !342}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !327, file: !328, line: 12, baseType: !79, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !327, file: !328, line: 13, baseType: !332, size: 64, align: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !328, line: 8, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!32, !32, !31}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !327, file: !328, line: 14, baseType: !337, size: 64, align: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !328, line: 9, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!71, !32, !32, !31}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !327, file: !328, line: 15, baseType: !79, size: 64, align: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !327, file: !328, line: 16, baseType: !31, size: 64, align: 64, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !47, file: !34, line: 392, baseType: !46, size: 64, align: 64, offset: 2048)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !47, file: !34, line: 393, baseType: !32, size: 64, align: 64, offset: 2112)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !47, file: !34, line: 394, baseType: !346, size: 64, align: 64, offset: 2176)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !34, line: 325, baseType: !161)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !47, file: !34, line: 395, baseType: !348, size: 64, align: 64, offset: 2240)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !34, line: 326, baseType: !237)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !47, file: !34, line: 396, baseType: !38, size: 64, align: 64, offset: 2304)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !47, file: !34, line: 397, baseType: !351, size: 64, align: 64, offset: 2368)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !34, line: 327, baseType: !237)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !47, file: !34, line: 398, baseType: !353, size: 64, align: 64, offset: 2432)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !34, line: 329, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!32, !46, !38}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !47, file: !34, line: 399, baseType: !358, size: 64, align: 64, offset: 2496)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !34, line: 328, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!32, !46, !32, !32}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !47, file: !34, line: 400, baseType: !363, size: 64, align: 64, offset: 2560)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !34, line: 307, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !31}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !47, file: !34, line: 401, baseType: !169, size: 64, align: 64, offset: 2624)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !47, file: !34, line: 402, baseType: !32, size: 64, align: 64, offset: 2688)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !47, file: !34, line: 403, baseType: !32, size: 64, align: 64, offset: 2752)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !47, file: !34, line: 404, baseType: !32, size: 64, align: 64, offset: 2816)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !47, file: !34, line: 405, baseType: !32, size: 64, align: 64, offset: 2880)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !47, file: !34, line: 406, baseType: !32, size: 64, align: 64, offset: 2944)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !47, file: !34, line: 407, baseType: !62, size: 64, align: 64, offset: 3008)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !47, file: !34, line: 410, baseType: !375, size: 32, align: 32, offset: 3072)
!375 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !47, file: !34, line: 412, baseType: !62, size: 64, align: 64, offset: 3136)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !16, line: 351, baseType: !379)
!379 = !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 217, size: 384, align: 64, elements: !380)
!380 = !{!381, !382, !383, !384, !392}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !379, file: !16, line: 291, baseType: !33, size: 128, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !379, file: !16, line: 292, baseType: !38, size: 64, align: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !379, file: !16, line: 293, baseType: !245, size: 64, align: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !379, file: !16, line: 349, baseType: !385, size: 32, align: 32, offset: 256)
!385 = !DICompositeType(tag: DW_TAG_structure_type, scope: !379, file: !16, line: 294, size: 32, align: 32, elements: !386)
!386 = !{!387, !388, !389, !390, !391}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !385, file: !16, line: 303, baseType: !375, size: 2, align: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !385, file: !16, line: 331, baseType: !375, size: 3, align: 32, offset: 2)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !385, file: !16, line: 336, baseType: !375, size: 1, align: 32, offset: 5)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !385, file: !16, line: 340, baseType: !375, size: 1, align: 32, offset: 6)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !385, file: !16, line: 345, baseType: !375, size: 1, align: 32, offset: 7)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !379, file: !16, line: 350, baseType: !393, size: 64, align: 64, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !122, line: 90, baseType: !71)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZipImporter", file: !1, line: 38, baseType: !397)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "_zipimporter", file: !1, line: 40, size: 320, align: 64, elements: !398)
!398 = !{!399, !400, !401, !402}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !397, file: !1, line: 41, baseType: !33, size: 128, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "archive", scope: !397, file: !1, line: 42, baseType: !32, size: 64, align: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !397, file: !1, line: 44, baseType: !32, size: 64, align: 64, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !397, file: !1, line: 46, baseType: !32, size: 64, align: 64, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !404, line: 75, baseType: !405)
!404 = !DIFile(filename: "/usr/include/time.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !43, line: 148, baseType: !44)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !16, line: 363, baseType: !408)
!408 = !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 356, size: 576, align: 64, elements: !409)
!409 = !{!410, !411, !412, !413}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !408, file: !16, line: 357, baseType: !378, size: 384, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !408, file: !16, line: 358, baseType: !38, size: 64, align: 64, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !408, file: !16, line: 360, baseType: !79, size: 64, align: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !408, file: !16, line: 361, baseType: !38, size: 64, align: 64, offset: 512)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !16, line: 376, baseType: !416)
!416 = !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 368, size: 640, align: 64, elements: !417)
!417 = !{!418, !419}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !416, file: !16, line: 369, baseType: !407, size: 576, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !416, file: !16, line: 375, baseType: !420, size: 64, align: 64, offset: 576)
!420 = !DICompositeType(tag: DW_TAG_union_type, scope: !416, file: !16, line: 370, size: 64, align: 64, elements: !421)
!421 = !{!422, !423, !427, !430}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !420, file: !16, line: 371, baseType: !31, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !420, file: !16, line: 372, baseType: !424, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !16, line: 134, baseType: !426)
!426 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !420, file: !16, line: 373, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !16, line: 129, baseType: !104)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !420, file: !16, line: 374, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !16, line: 121, baseType: !375)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !442, line: 41, baseType: !443)
!442 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!443 = !DICompositeType(tag: DW_TAG_structure_type, file: !442, line: 31, size: 320, align: 64, elements: !444)
!444 = !{!445, !446, !447}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !443, file: !442, line: 32, baseType: !50, size: 192, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !443, file: !442, line: 33, baseType: !245, size: 64, align: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !443, file: !442, line: 34, baseType: !108, size: 8, align: 8, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !451, line: 139, baseType: !452)
!451 = !DIFile(filename: "Include/pystate.h", directory: "/home/juneyoung.lee/simplberry/simplberry/simplberry-tests/programs/Python-3.4.1")
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !451, line: 69, size: 1536, align: 64, elements: !453)
!453 = !{!454, !456, !457, !477, !480, !481, !482, !483, !484, !485, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !452, file: !451, line: 72, baseType: !455, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !452, file: !451, line: 73, baseType: !455, size: 64, align: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !452, file: !451, line: 74, baseType: !458, size: 64, align: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !451, line: 44, baseType: !460)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !451, line: 19, size: 832, align: 64, elements: !461)
!461 = !{!462, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !460, file: !451, line: 21, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !460, file: !451, line: 22, baseType: !455, size: 64, align: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !460, file: !451, line: 24, baseType: !32, size: 64, align: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !460, file: !451, line: 25, baseType: !32, size: 64, align: 64, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !460, file: !451, line: 26, baseType: !32, size: 64, align: 64, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !460, file: !451, line: 27, baseType: !32, size: 64, align: 64, offset: 320)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !460, file: !451, line: 28, baseType: !32, size: 64, align: 64, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !460, file: !451, line: 30, baseType: !32, size: 64, align: 64, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !460, file: !451, line: 31, baseType: !32, size: 64, align: 64, offset: 512)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !460, file: !451, line: 32, baseType: !32, size: 64, align: 64, offset: 576)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !460, file: !451, line: 33, baseType: !71, size: 32, align: 32, offset: 640)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !460, file: !451, line: 34, baseType: !71, size: 32, align: 32, offset: 672)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !460, file: !451, line: 37, baseType: !71, size: 32, align: 32, offset: 704)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !460, file: !451, line: 43, baseType: !32, size: 64, align: 64, offset: 768)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !452, file: !451, line: 76, baseType: !478, size: 64, align: 64, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !451, line: 50, flags: DIFlagFwdDecl)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !452, file: !451, line: 77, baseType: !71, size: 32, align: 32, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !452, file: !451, line: 78, baseType: !58, size: 8, align: 8, offset: 288)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !452, file: !451, line: 80, baseType: !58, size: 8, align: 8, offset: 296)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !452, file: !451, line: 85, baseType: !71, size: 32, align: 32, offset: 320)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !452, file: !451, line: 86, baseType: !71, size: 32, align: 32, offset: 352)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !452, file: !451, line: 88, baseType: !486, size: 64, align: 64, offset: 384)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !451, line: 54, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!71, !32, !478, !71, !32}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !452, file: !451, line: 89, baseType: !486, size: 64, align: 64, offset: 448)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !452, file: !451, line: 90, baseType: !32, size: 64, align: 64, offset: 512)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !452, file: !451, line: 91, baseType: !32, size: 64, align: 64, offset: 576)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !452, file: !451, line: 93, baseType: !32, size: 64, align: 64, offset: 640)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !452, file: !451, line: 94, baseType: !32, size: 64, align: 64, offset: 704)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !452, file: !451, line: 95, baseType: !32, size: 64, align: 64, offset: 768)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !452, file: !451, line: 97, baseType: !32, size: 64, align: 64, offset: 832)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !452, file: !451, line: 98, baseType: !32, size: 64, align: 64, offset: 896)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !452, file: !451, line: 99, baseType: !32, size: 64, align: 64, offset: 960)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !452, file: !451, line: 101, baseType: !32, size: 64, align: 64, offset: 1024)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !452, file: !451, line: 103, baseType: !71, size: 32, align: 32, offset: 1088)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !452, file: !451, line: 105, baseType: !32, size: 64, align: 64, offset: 1152)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !452, file: !451, line: 106, baseType: !44, size: 64, align: 64, offset: 1216)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !452, file: !451, line: 108, baseType: !71, size: 32, align: 32, offset: 1280)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !452, file: !451, line: 109, baseType: !32, size: 64, align: 64, offset: 1344)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !452, file: !451, line: 134, baseType: !364, size: 64, align: 64, offset: 1408)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !452, file: !451, line: 135, baseType: !31, size: 64, align: 64, offset: 1472)
!507 = !{!508, !523, !543, !548, !558, !570, !583, !612, !617, !625, !636, !648, !687, !735, !750, !770, !784, !817, !825, !839, !845, !852, !867, !875, !896, !902, !925, !936, !943, !1023, !1110, !1119, !1124}
!508 = !DISubprogram(name: "PyInit_zipimport", scope: !1, file: !1, line: 1471, type: !509, isLocal: false, isDefinition: true, scopeLine: 1472, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_zipimport, variables: !511)
!509 = !DISubroutineType(types: !510)
!510 = !{!32}
!511 = !{!512, !513}
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !508, file: !1, line: 1473, type: !32)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !514, file: !1, line: 1484, type: !516)
!514 = distinct !DILexicalBlock(scope: !515, file: !1, line: 1482, column: 26)
!515 = distinct !DILexicalBlock(scope: !508, file: !1, line: 1482, column: 9)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "st_zip_searchorder", file: !1, line: 12, size: 160, align: 32, elements: !517)
!517 = !{!518, !522}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "suffix", scope: !516, file: !1, line: 13, baseType: !519, size: 112, align: 8)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 112, align: 8, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 14)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !516, file: !1, line: 14, baseType: !71, size: 32, align: 32, offset: 128)
!523 = !DISubprogram(name: "zipimporter_dealloc", scope: !1, file: !1, line: 185, type: !524, isLocal: true, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._zipimporter*)* @zipimporter_dealloc, variables: !526)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !395}
!526 = !{!527, !528, !530, !533, !535, !538, !540}
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !523, file: !1, line: 185, type: !395)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !529, file: !1, line: 188, type: !32)
!529 = distinct !DILexicalBlock(scope: !523, file: !1, line: 188, column: 5)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !531, file: !1, line: 188, type: !32)
!531 = distinct !DILexicalBlock(scope: !532, file: !1, line: 188, column: 5)
!532 = distinct !DILexicalBlock(scope: !529, file: !1, line: 188, column: 5)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !534, file: !1, line: 189, type: !32)
!534 = distinct !DILexicalBlock(scope: !523, file: !1, line: 189, column: 5)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !536, file: !1, line: 189, type: !32)
!536 = distinct !DILexicalBlock(scope: !537, file: !1, line: 189, column: 5)
!537 = distinct !DILexicalBlock(scope: !534, file: !1, line: 189, column: 5)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !539, file: !1, line: 190, type: !32)
!539 = distinct !DILexicalBlock(scope: !523, file: !1, line: 190, column: 5)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !541, file: !1, line: 190, type: !32)
!541 = distinct !DILexicalBlock(scope: !542, file: !1, line: 190, column: 5)
!542 = distinct !DILexicalBlock(scope: !539, file: !1, line: 190, column: 5)
!543 = !DISubprogram(name: "zipimporter_repr", scope: !1, file: !1, line: 195, type: !544, isLocal: true, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._zipimporter*)* @zipimporter_repr, variables: !546)
!544 = !DISubroutineType(types: !545)
!545 = !{!32, !395}
!546 = !{!547}
!547 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !543, file: !1, line: 195, type: !395)
!548 = !DISubprogram(name: "zipimporter_traverse", scope: !1, file: !1, line: 177, type: !288, isLocal: true, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)* @zipimporter_traverse, variables: !549)
!549 = !{!550, !551, !552, !553, !554}
!550 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !548, file: !1, line: 177, type: !32)
!551 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !548, file: !1, line: 177, type: !290)
!552 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !548, file: !1, line: 177, type: !31)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !548, file: !1, line: 179, type: !395)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !555, file: !1, line: 180, type: !71)
!555 = distinct !DILexicalBlock(scope: !556, file: !1, line: 180, column: 5)
!556 = distinct !DILexicalBlock(scope: !557, file: !1, line: 180, column: 5)
!557 = distinct !DILexicalBlock(scope: !548, file: !1, line: 180, column: 5)
!558 = !DISubprogram(name: "zipimporter_find_module", scope: !1, file: !1, line: 379, type: !153, isLocal: true, isDefinition: true, scopeLine: 380, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @zipimporter_find_module, variables: !559)
!559 = !{!560, !561, !562, !563, !564, !565, !566, !567}
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !558, file: !1, line: 379, type: !32)
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !558, file: !1, line: 379, type: !32)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !558, file: !1, line: 381, type: !395)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !558, file: !1, line: 382, type: !32)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullname", scope: !558, file: !1, line: 383, type: !32)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "namespace_portion", scope: !558, file: !1, line: 384, type: !32)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !558, file: !1, line: 385, type: !32)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !568, file: !1, line: 395, type: !32)
!568 = distinct !DILexicalBlock(scope: !569, file: !1, line: 395, column: 9)
!569 = distinct !DILexicalBlock(scope: !558, file: !1, line: 390, column: 62)
!570 = !DISubprogram(name: "find_loader", scope: !1, file: !1, line: 343, type: !571, isLocal: true, isDefinition: true, scopeLine: 344, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._zipimporter*, %struct._object*, %struct._object**)* @find_loader, variables: !575)
!571 = !DISubroutineType(types: !572)
!572 = !{!573, !395, !32, !574}
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "find_loader_result", file: !1, line: 334, baseType: !3)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!575 = !{!576, !577, !578, !579, !580}
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !570, file: !1, line: 343, type: !395)
!577 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fullname", arg: 2, scope: !570, file: !1, line: 343, type: !32)
!578 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "namespace_portion", arg: 3, scope: !570, file: !1, line: 343, type: !574)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mi", scope: !570, file: !1, line: 345, type: !9)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "is_dir", scope: !581, file: !1, line: 355, type: !71)
!581 = distinct !DILexicalBlock(scope: !582, file: !1, line: 352, column: 29)
!582 = distinct !DILexicalBlock(scope: !570, file: !1, line: 352, column: 9)
!583 = !DISubprogram(name: "get_module_info", scope: !1, file: !1, line: 294, type: !584, isLocal: true, isDefinition: true, scopeLine: 295, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._zipimporter*, %struct._object*)* @get_module_info, variables: !586)
!584 = !DISubroutineType(types: !585)
!585 = !{!9, !395, !32}
!586 = !{!587, !588, !589, !590, !591, !592, !593, !595, !597, !604, !606, !610}
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !583, file: !1, line: 294, type: !395)
!588 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fullname", arg: 2, scope: !583, file: !1, line: 294, type: !32)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "subname", scope: !583, file: !1, line: 296, type: !32)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !583, file: !1, line: 297, type: !32)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullpath", scope: !583, file: !1, line: 297, type: !32)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !583, file: !1, line: 297, type: !32)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zso", scope: !583, file: !1, line: 298, type: !594)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64, align: 64)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !596, file: !1, line: 305, type: !32)
!596 = distinct !DILexicalBlock(scope: !583, file: !1, line: 305, column: 5)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !598, file: !1, line: 312, type: !32)
!598 = distinct !DILexicalBlock(scope: !599, file: !1, line: 312, column: 13)
!599 = distinct !DILexicalBlock(scope: !600, file: !1, line: 311, column: 31)
!600 = distinct !DILexicalBlock(scope: !601, file: !1, line: 311, column: 13)
!601 = distinct !DILexicalBlock(scope: !602, file: !1, line: 309, column: 54)
!602 = distinct !DILexicalBlock(scope: !603, file: !1, line: 309, column: 5)
!603 = distinct !DILexicalBlock(scope: !583, file: !1, line: 309, column: 5)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !605, file: !1, line: 316, type: !32)
!605 = distinct !DILexicalBlock(scope: !601, file: !1, line: 316, column: 9)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !607, file: !1, line: 318, type: !32)
!607 = distinct !DILexicalBlock(scope: !608, file: !1, line: 318, column: 13)
!608 = distinct !DILexicalBlock(scope: !609, file: !1, line: 317, column: 27)
!609 = distinct !DILexicalBlock(scope: !601, file: !1, line: 317, column: 13)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !611, file: !1, line: 325, type: !32)
!611 = distinct !DILexicalBlock(scope: !583, file: !1, line: 325, column: 5)
!612 = !DISubprogram(name: "get_subname", scope: !1, file: !1, line: 209, type: !143, isLocal: true, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, variables: !613)
!613 = !{!614, !615, !616}
!614 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fullname", arg: 1, scope: !612, file: !1, line: 209, type: !32)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !612, file: !1, line: 211, type: !38)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dot", scope: !612, file: !1, line: 211, type: !38)
!617 = !DISubprogram(name: "make_filename", scope: !1, file: !1, line: 229, type: !153, isLocal: true, isDefinition: true, scopeLine: 230, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @make_filename, variables: !618)
!618 = !{!619, !620, !621, !622, !623, !624}
!619 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prefix", arg: 1, scope: !617, file: !1, line: 229, type: !32)
!620 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !617, file: !1, line: 229, type: !32)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pathobj", scope: !617, file: !1, line: 231, type: !32)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !617, file: !1, line: 232, type: !431)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !617, file: !1, line: 232, type: !431)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !617, file: !1, line: 233, type: !38)
!625 = !DISubprogram(name: "check_is_directory", scope: !1, file: !1, line: 275, type: !626, isLocal: true, isDefinition: true, scopeLine: 276, flags: DIFlagPrototyped, isOptimized: true, variables: !628)
!626 = !DISubroutineType(types: !627)
!627 = !{!71, !395, !32, !32}
!628 = !{!629, !630, !631, !632, !633, !634}
!629 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !625, file: !1, line: 275, type: !395)
!630 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prefix", arg: 2, scope: !625, file: !1, line: 275, type: !32)
!631 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 3, scope: !625, file: !1, line: 275, type: !32)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dirpath", scope: !625, file: !1, line: 277, type: !32)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !625, file: !1, line: 278, type: !71)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !635, file: !1, line: 288, type: !32)
!635 = distinct !DILexicalBlock(scope: !625, file: !1, line: 288, column: 5)
!636 = !DISubprogram(name: "zipimporter_find_loader", scope: !1, file: !1, line: 415, type: !153, isLocal: true, isDefinition: true, scopeLine: 416, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @zipimporter_find_loader, variables: !637)
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645}
!638 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !636, file: !1, line: 415, type: !32)
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !636, file: !1, line: 415, type: !32)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !636, file: !1, line: 417, type: !395)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !636, file: !1, line: 418, type: !32)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullname", scope: !636, file: !1, line: 419, type: !32)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !636, file: !1, line: 420, type: !32)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "namespace_portion", scope: !636, file: !1, line: 421, type: !32)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !646, file: !1, line: 437, type: !32)
!646 = distinct !DILexicalBlock(scope: !647, file: !1, line: 437, column: 9)
!647 = distinct !DILexicalBlock(scope: !636, file: !1, line: 426, column: 62)
!648 = !DISubprogram(name: "zipimporter_load_module", scope: !1, file: !1, line: 445, type: !153, isLocal: true, isDefinition: true, scopeLine: 446, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @zipimporter_load_module, variables: !649)
!649 = !{!650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !662, !663, !664, !665, !667, !669, !671, !675, !677, !679, !682, !684}
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !648, file: !1, line: 445, type: !32)
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !648, file: !1, line: 445, type: !32)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !648, file: !1, line: 447, type: !395)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !648, file: !1, line: 448, type: !32)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !648, file: !1, line: 448, type: !32)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !648, file: !1, line: 448, type: !32)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullname", scope: !648, file: !1, line: 449, type: !32)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modpath", scope: !648, file: !1, line: 450, type: !32)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ispackage", scope: !648, file: !1, line: 451, type: !71)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pkgpath", scope: !660, file: !1, line: 475, type: !32)
!660 = distinct !DILexicalBlock(scope: !661, file: !1, line: 472, column: 20)
!661 = distinct !DILexicalBlock(scope: !648, file: !1, line: 472, column: 9)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullpath", scope: !660, file: !1, line: 475, type: !32)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "subname", scope: !660, file: !1, line: 475, type: !32)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !660, file: !1, line: 476, type: !71)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !666, file: !1, line: 485, type: !32)
!666 = distinct !DILexicalBlock(scope: !660, file: !1, line: 485, column: 9)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !668, file: !1, line: 493, type: !32)
!668 = distinct !DILexicalBlock(scope: !660, file: !1, line: 493, column: 9)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !670, file: !1, line: 498, type: !32)
!670 = distinct !DILexicalBlock(scope: !648, file: !1, line: 498, column: 5)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !672, file: !1, line: 498, type: !32)
!672 = distinct !DILexicalBlock(scope: !673, file: !1, line: 498, column: 5)
!673 = distinct !DILexicalBlock(scope: !674, file: !1, line: 498, column: 5)
!674 = distinct !DILexicalBlock(scope: !670, file: !1, line: 498, column: 5)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !676, file: !1, line: 505, type: !32)
!676 = distinct !DILexicalBlock(scope: !648, file: !1, line: 505, column: 5)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !678, file: !1, line: 508, type: !32)
!678 = distinct !DILexicalBlock(scope: !648, file: !1, line: 508, column: 5)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !680, file: !1, line: 508, type: !32)
!680 = distinct !DILexicalBlock(scope: !681, file: !1, line: 508, column: 5)
!681 = distinct !DILexicalBlock(scope: !678, file: !1, line: 508, column: 5)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !683, file: !1, line: 509, type: !32)
!683 = distinct !DILexicalBlock(scope: !648, file: !1, line: 509, column: 5)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !685, file: !1, line: 509, type: !32)
!685 = distinct !DILexicalBlock(scope: !686, file: !1, line: 509, column: 5)
!686 = distinct !DILexicalBlock(scope: !683, file: !1, line: 509, column: 5)
!687 = !DISubprogram(name: "get_module_code", scope: !1, file: !1, line: 1375, type: !688, isLocal: true, isDefinition: true, scopeLine: 1377, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._zipimporter*, %struct._object*, i32*, %struct._object**)* @get_module_code, variables: !691)
!688 = !DISubroutineType(types: !689)
!689 = !{!32, !395, !32, !690, !574}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!691 = !{!692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !704, !710, !711, !712, !714, !718, !722, !724, !728, !730, !732}
!692 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !687, file: !1, line: 1375, type: !395)
!693 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fullname", arg: 2, scope: !687, file: !1, line: 1375, type: !32)
!694 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_ispackage", arg: 3, scope: !687, file: !1, line: 1376, type: !690)
!695 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_modpath", arg: 4, scope: !687, file: !1, line: 1376, type: !574)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !687, file: !1, line: 1378, type: !32)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "toc_entry", scope: !687, file: !1, line: 1378, type: !32)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "subname", scope: !687, file: !1, line: 1378, type: !32)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !687, file: !1, line: 1379, type: !32)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullpath", scope: !687, file: !1, line: 1379, type: !32)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zso", scope: !687, file: !1, line: 1380, type: !594)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !703, file: !1, line: 1387, type: !32)
!703 = distinct !DILexicalBlock(scope: !687, file: !1, line: 1387, column: 5)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mtime", scope: !705, file: !1, line: 1403, type: !403)
!705 = distinct !DILexicalBlock(scope: !706, file: !1, line: 1402, column: 32)
!706 = distinct !DILexicalBlock(scope: !707, file: !1, line: 1402, column: 13)
!707 = distinct !DILexicalBlock(scope: !708, file: !1, line: 1391, column: 54)
!708 = distinct !DILexicalBlock(scope: !709, file: !1, line: 1391, column: 5)
!709 = distinct !DILexicalBlock(scope: !687, file: !1, line: 1391, column: 5)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ispackage", scope: !705, file: !1, line: 1404, type: !71)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "isbytecode", scope: !705, file: !1, line: 1405, type: !71)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !713, file: !1, line: 1413, type: !32)
!713 = distinct !DILexicalBlock(scope: !705, file: !1, line: 1413, column: 13)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !715, file: !1, line: 1413, type: !32)
!715 = distinct !DILexicalBlock(scope: !716, file: !1, line: 1413, column: 13)
!716 = distinct !DILexicalBlock(scope: !717, file: !1, line: 1413, column: 13)
!717 = distinct !DILexicalBlock(scope: !713, file: !1, line: 1413, column: 13)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !719, file: !1, line: 1422, type: !32)
!719 = distinct !DILexicalBlock(scope: !720, file: !1, line: 1422, column: 17)
!720 = distinct !DILexicalBlock(scope: !721, file: !1, line: 1419, column: 34)
!721 = distinct !DILexicalBlock(scope: !705, file: !1, line: 1419, column: 17)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !723, file: !1, line: 1432, type: !32)
!723 = distinct !DILexicalBlock(scope: !706, file: !1, line: 1432, column: 13)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !725, file: !1, line: 1432, type: !32)
!725 = distinct !DILexicalBlock(scope: !726, file: !1, line: 1432, column: 13)
!726 = distinct !DILexicalBlock(scope: !727, file: !1, line: 1432, column: 13)
!727 = distinct !DILexicalBlock(scope: !723, file: !1, line: 1432, column: 13)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !729, file: !1, line: 1436, type: !32)
!729 = distinct !DILexicalBlock(scope: !687, file: !1, line: 1436, column: 5)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !731, file: !1, line: 1437, type: !32)
!731 = distinct !DILexicalBlock(scope: !687, file: !1, line: 1437, column: 5)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !733, file: !1, line: 1437, type: !32)
!733 = distinct !DILexicalBlock(scope: !734, file: !1, line: 1437, column: 5)
!734 = distinct !DILexicalBlock(scope: !731, file: !1, line: 1437, column: 5)
!735 = !DISubprogram(name: "get_mtime_of_source", scope: !1, file: !1, line: 1322, type: !736, isLocal: true, isDefinition: true, scopeLine: 1323, flags: DIFlagPrototyped, isOptimized: true, variables: !738)
!736 = !DISubroutineType(types: !737)
!737 = !{!403, !395, !32}
!738 = !{!739, !740, !741, !742, !743, !744, !746, !749}
!739 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !735, file: !1, line: 1322, type: !395)
!740 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 2, scope: !735, file: !1, line: 1322, type: !32)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "toc_entry", scope: !735, file: !1, line: 1324, type: !32)
!742 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stripped", scope: !735, file: !1, line: 1324, type: !32)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mtime", scope: !735, file: !1, line: 1325, type: !403)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !745, file: !1, line: 1337, type: !32)
!745 = distinct !DILexicalBlock(scope: !735, file: !1, line: 1337, column: 5)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "time", scope: !747, file: !1, line: 1342, type: !71)
!747 = distinct !DILexicalBlock(scope: !748, file: !1, line: 1339, column: 39)
!748 = distinct !DILexicalBlock(scope: !735, file: !1, line: 1338, column: 9)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "date", scope: !747, file: !1, line: 1342, type: !71)
!750 = !DISubprogram(name: "parse_dostime", scope: !1, file: !1, line: 1301, type: !751, isLocal: true, isDefinition: true, scopeLine: 1302, flags: DIFlagPrototyped, isOptimized: true, variables: !753)
!751 = !DISubroutineType(types: !752)
!752 = !{!403, !71, !71}
!753 = !{!754, !755, !756}
!754 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dostime", arg: 1, scope: !750, file: !1, line: 1301, type: !71)
!755 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dosdate", arg: 2, scope: !750, file: !1, line: 1301, type: !71)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stm", scope: !750, file: !1, line: 1303, type: !757)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !404, line: 133, size: 448, align: 64, elements: !758)
!758 = !{!759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !757, file: !404, line: 135, baseType: !71, size: 32, align: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !757, file: !404, line: 136, baseType: !71, size: 32, align: 32, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !757, file: !404, line: 137, baseType: !71, size: 32, align: 32, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !757, file: !404, line: 138, baseType: !71, size: 32, align: 32, offset: 96)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !757, file: !404, line: 139, baseType: !71, size: 32, align: 32, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !757, file: !404, line: 140, baseType: !71, size: 32, align: 32, offset: 160)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !757, file: !404, line: 141, baseType: !71, size: 32, align: 32, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !757, file: !404, line: 142, baseType: !71, size: 32, align: 32, offset: 224)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !757, file: !404, line: 143, baseType: !71, size: 32, align: 32, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !757, file: !404, line: 146, baseType: !44, size: 64, align: 64, offset: 320)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !757, file: !404, line: 147, baseType: !56, size: 64, align: 64, offset: 384)
!770 = !DISubprogram(name: "get_code_from_data", scope: !1, file: !1, line: 1354, type: !771, isLocal: true, isDefinition: true, scopeLine: 1356, flags: DIFlagPrototyped, isOptimized: true, variables: !773)
!771 = !DISubroutineType(types: !772)
!772 = !{!32, !395, !71, !71, !403, !32}
!773 = !{!774, !775, !776, !777, !778, !779, !780, !781, !782}
!774 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !770, file: !1, line: 1354, type: !395)
!775 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ispackage", arg: 2, scope: !770, file: !1, line: 1354, type: !71)
!776 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "isbytecode", arg: 3, scope: !770, file: !1, line: 1354, type: !71)
!777 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtime", arg: 4, scope: !770, file: !1, line: 1355, type: !403)
!778 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "toc_entry", arg: 5, scope: !770, file: !1, line: 1355, type: !32)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !770, file: !1, line: 1357, type: !32)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modpath", scope: !770, file: !1, line: 1357, type: !32)
!781 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !770, file: !1, line: 1357, type: !32)
!782 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !783, file: !1, line: 1368, type: !32)
!783 = distinct !DILexicalBlock(scope: !770, file: !1, line: 1368, column: 5)
!784 = !DISubprogram(name: "get_data", scope: !1, file: !1, line: 1057, type: !153, isLocal: true, isDefinition: true, scopeLine: 1058, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @get_data, variables: !785)
!785 = !{!786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !809, !813, !815}
!786 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "archive", arg: 1, scope: !784, file: !1, line: 1057, type: !32)
!787 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "toc_entry", arg: 2, scope: !784, file: !1, line: 1057, type: !32)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "raw_data", scope: !784, file: !1, line: 1059, type: !32)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !784, file: !1, line: 1059, type: !32)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decompress", scope: !784, file: !1, line: 1059, type: !32)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !784, file: !1, line: 1060, type: !79)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !784, file: !1, line: 1061, type: !72)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !784, file: !1, line: 1062, type: !71)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes_read", scope: !784, file: !1, line: 1063, type: !38)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !784, file: !1, line: 1064, type: !44)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "datapath", scope: !784, file: !1, line: 1065, type: !32)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "compress", scope: !784, file: !1, line: 1066, type: !44)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data_size", scope: !784, file: !1, line: 1066, type: !44)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file_size", scope: !784, file: !1, line: 1066, type: !44)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file_offset", scope: !784, file: !1, line: 1066, type: !44)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes_size", scope: !784, file: !1, line: 1066, type: !44)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "time", scope: !784, file: !1, line: 1067, type: !44)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "date", scope: !784, file: !1, line: 1067, type: !44)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "crc", scope: !784, file: !1, line: 1067, type: !44)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !806, file: !1, line: 1137, type: !32)
!806 = distinct !DILexicalBlock(scope: !807, file: !1, line: 1137, column: 9)
!807 = distinct !DILexicalBlock(scope: !808, file: !1, line: 1134, column: 41)
!808 = distinct !DILexicalBlock(scope: !784, file: !1, line: 1134, column: 9)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !810, file: !1, line: 1149, type: !32)
!810 = distinct !DILexicalBlock(scope: !811, file: !1, line: 1149, column: 9)
!811 = distinct !DILexicalBlock(scope: !812, file: !1, line: 1147, column: 24)
!812 = distinct !DILexicalBlock(scope: !784, file: !1, line: 1147, column: 9)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !814, file: !1, line: 1162, type: !32)
!814 = distinct !DILexicalBlock(scope: !784, file: !1, line: 1162, column: 5)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !816, file: !1, line: 1164, type: !32)
!816 = distinct !DILexicalBlock(scope: !784, file: !1, line: 1164, column: 5)
!817 = !DISubprogram(name: "get_decompress_func", scope: !1, file: !1, line: 1025, type: !509, isLocal: true, isDefinition: true, scopeLine: 1026, flags: DIFlagPrototyped, isOptimized: true, variables: !818)
!818 = !{!819, !820, !821}
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zlib", scope: !817, file: !1, line: 1028, type: !32)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decompress", scope: !817, file: !1, line: 1029, type: !32)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !822, file: !1, line: 1042, type: !32)
!822 = distinct !DILexicalBlock(scope: !823, file: !1, line: 1042, column: 9)
!823 = distinct !DILexicalBlock(scope: !824, file: !1, line: 1039, column: 23)
!824 = distinct !DILexicalBlock(scope: !817, file: !1, line: 1039, column: 9)
!825 = !DISubprogram(name: "unmarshal_code", scope: !1, file: !1, line: 1187, type: !826, isLocal: true, isDefinition: true, scopeLine: 1188, flags: DIFlagPrototyped, isOptimized: true, variables: !828)
!826 = !DISubroutineType(types: !827)
!827 = !{!32, !32, !32, !403}
!828 = !{!829, !830, !831, !832, !833, !834, !835}
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pathname", arg: 1, scope: !825, file: !1, line: 1187, type: !32)
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 2, scope: !825, file: !1, line: 1187, type: !32)
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mtime", arg: 3, scope: !825, file: !1, line: 1187, type: !403)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !825, file: !1, line: 1189, type: !32)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !825, file: !1, line: 1190, type: !79)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !825, file: !1, line: 1191, type: !38)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !836, file: !1, line: 1222, type: !32)
!836 = distinct !DILexicalBlock(scope: !837, file: !1, line: 1222, column: 9)
!837 = distinct !DILexicalBlock(scope: !838, file: !1, line: 1221, column: 30)
!838 = distinct !DILexicalBlock(scope: !825, file: !1, line: 1221, column: 9)
!839 = !DISubprogram(name: "get_long", scope: !1, file: !1, line: 821, type: !840, isLocal: true, isDefinition: true, scopeLine: 821, flags: DIFlagPrototyped, isOptimized: true, variables: !842)
!840 = !DISubroutineType(types: !841)
!841 = !{!44, !433}
!842 = !{!843, !844}
!843 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 1, scope: !839, file: !1, line: 821, type: !433)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !839, file: !1, line: 822, type: !44)
!845 = !DISubprogram(name: "eq_mtime", scope: !1, file: !1, line: 1172, type: !846, isLocal: true, isDefinition: true, scopeLine: 1173, flags: DIFlagPrototyped, isOptimized: true, variables: !848)
!846 = !DISubroutineType(types: !847)
!847 = !{!71, !403, !403}
!848 = !{!849, !850, !851}
!849 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t1", arg: 1, scope: !845, file: !1, line: 1172, type: !403)
!850 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "t2", arg: 2, scope: !845, file: !1, line: 1172, type: !403)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !845, file: !1, line: 1174, type: !403)
!852 = !DISubprogram(name: "compile_source", scope: !1, file: !1, line: 1276, type: !153, isLocal: true, isDefinition: true, scopeLine: 1277, flags: DIFlagPrototyped, isOptimized: true, variables: !853)
!853 = !{!854, !855, !856, !857, !858, !859, !863, !865}
!854 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pathname", arg: 1, scope: !852, file: !1, line: 1276, type: !32)
!855 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "source", arg: 2, scope: !852, file: !1, line: 1276, type: !32)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !852, file: !1, line: 1278, type: !32)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fixed_source", scope: !852, file: !1, line: 1278, type: !32)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pathbytes", scope: !852, file: !1, line: 1278, type: !32)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !860, file: !1, line: 1286, type: !32)
!860 = distinct !DILexicalBlock(scope: !861, file: !1, line: 1286, column: 9)
!861 = distinct !DILexicalBlock(scope: !862, file: !1, line: 1285, column: 31)
!862 = distinct !DILexicalBlock(scope: !852, file: !1, line: 1285, column: 9)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !864, file: !1, line: 1293, type: !32)
!864 = distinct !DILexicalBlock(scope: !852, file: !1, line: 1293, column: 5)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !866, file: !1, line: 1294, type: !32)
!866 = distinct !DILexicalBlock(scope: !852, file: !1, line: 1294, column: 5)
!867 = !DISubprogram(name: "normalize_line_endings", scope: !1, file: !1, line: 1236, type: !143, isLocal: true, isDefinition: true, scopeLine: 1237, flags: DIFlagPrototyped, isOptimized: true, variables: !868)
!868 = !{!869, !870, !871, !872, !873, !874}
!869 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "source", arg: 1, scope: !867, file: !1, line: 1236, type: !32)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !867, file: !1, line: 1238, type: !79)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !867, file: !1, line: 1238, type: !79)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !867, file: !1, line: 1238, type: !79)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fixed_source", scope: !867, file: !1, line: 1239, type: !32)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !867, file: !1, line: 1240, type: !71)
!875 = !DISubprogram(name: "zipimporter_get_data", scope: !1, file: !1, line: 559, type: !153, isLocal: true, isDefinition: true, scopeLine: 560, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @zipimporter_get_data, variables: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !890, !892, !894}
!877 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !875, file: !1, line: 559, type: !32)
!878 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !875, file: !1, line: 559, type: !32)
!879 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !875, file: !1, line: 561, type: !395)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !875, file: !1, line: 562, type: !32)
!881 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !875, file: !1, line: 562, type: !32)
!882 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "toc_entry", scope: !875, file: !1, line: 563, type: !32)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path_start", scope: !875, file: !1, line: 564, type: !38)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path_len", scope: !875, file: !1, line: 564, type: !38)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !875, file: !1, line: 564, type: !38)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !887, file: !1, line: 594, type: !32)
!887 = distinct !DILexicalBlock(scope: !888, file: !1, line: 594, column: 9)
!888 = distinct !DILexicalBlock(scope: !889, file: !1, line: 592, column: 28)
!889 = distinct !DILexicalBlock(scope: !875, file: !1, line: 592, column: 9)
!890 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !891, file: !1, line: 597, type: !32)
!891 = distinct !DILexicalBlock(scope: !875, file: !1, line: 597, column: 5)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !893, file: !1, line: 598, type: !32)
!893 = distinct !DILexicalBlock(scope: !875, file: !1, line: 598, column: 5)
!894 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !895, file: !1, line: 601, type: !32)
!895 = distinct !DILexicalBlock(scope: !875, file: !1, line: 601, column: 5)
!896 = !DISubprogram(name: "zipimporter_get_code", scope: !1, file: !1, line: 606, type: !153, isLocal: true, isDefinition: true, scopeLine: 607, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @zipimporter_get_code, variables: !897)
!897 = !{!898, !899, !900, !901}
!898 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !896, file: !1, line: 606, type: !32)
!899 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !896, file: !1, line: 606, type: !32)
!900 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !896, file: !1, line: 608, type: !395)
!901 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullname", scope: !896, file: !1, line: 609, type: !32)
!902 = !DISubprogram(name: "zipimporter_get_source", scope: !1, file: !1, line: 618, type: !153, isLocal: true, isDefinition: true, scopeLine: 619, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @zipimporter_get_source, variables: !903)
!903 = !{!904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !915, !917, !919, !922, !923}
!904 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !902, file: !1, line: 618, type: !32)
!905 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !902, file: !1, line: 618, type: !32)
!906 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !902, file: !1, line: 620, type: !395)
!907 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "toc_entry", scope: !902, file: !1, line: 621, type: !32)
!908 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullname", scope: !902, file: !1, line: 622, type: !32)
!909 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "subname", scope: !902, file: !1, line: 622, type: !32)
!910 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !902, file: !1, line: 622, type: !32)
!911 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fullpath", scope: !902, file: !1, line: 622, type: !32)
!912 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mi", scope: !902, file: !1, line: 623, type: !9)
!913 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !914, file: !1, line: 641, type: !32)
!914 = distinct !DILexicalBlock(scope: !902, file: !1, line: 641, column: 5)
!915 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !916, file: !1, line: 649, type: !32)
!916 = distinct !DILexicalBlock(scope: !902, file: !1, line: 649, column: 5)
!917 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !918, file: !1, line: 654, type: !32)
!918 = distinct !DILexicalBlock(scope: !902, file: !1, line: 654, column: 5)
!919 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !920, file: !1, line: 656, type: !32)
!920 = distinct !DILexicalBlock(scope: !921, file: !1, line: 655, column: 28)
!921 = distinct !DILexicalBlock(scope: !902, file: !1, line: 655, column: 9)
!922 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !920, file: !1, line: 656, type: !32)
!923 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !924, file: !1, line: 662, type: !32)
