; ModuleID = 'programs_new/Python-new/_codecs_kr.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !360, globals: !609)
!1 = !DIFile(filename: "_codecs_kr.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !12, !350, !351, !355, !358, !354}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !14, line: 109, baseType: !15)
!14 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !14, line: 105, size: 128, align: 64, elements: !16)
!16 = !{!17, !25}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !15, file: !14, line: 107, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !19, line: 177, baseType: !20)
!19 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !21, line: 102, baseType: !22)
!21 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !23, line: 181, baseType: !24)
!23 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!24 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !15, file: !14, line: 108, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !14, line: 334, size: 3200, align: 64, elements: !28)
!28 = !{!29, !35, !39, !40, !41, !46, !109, !114, !119, !120, !125, !177, !208, !220, !226, !227, !228, !230, !232, !263, !264, !265, !274, !275, !280, !281, !283, !285, !295, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !27, file: !14, line: 335, baseType: !30, size: 192, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !14, line: 114, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 111, size: 192, align: 64, elements: !32)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !14, line: 112, baseType: !13, size: 128, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !31, file: !14, line: 113, baseType: !18, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !27, file: !14, line: 336, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !27, file: !14, line: 341, baseType: !42, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !14, line: 308, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !12}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !27, file: !14, line: 342, baseType: !47, size: 64, align: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !14, line: 314, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !12, !52, !51}
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !21, line: 48, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !55, line: 246, size: 1728, align: 64, elements: !56)
!55 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!56 = !{!57, !58, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !78, !79, !80, !81, !83, !85, !87, !91, !94, !96, !97, !98, !99, !100, !104, !105}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !54, file: !55, line: 247, baseType: !51, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !54, file: !55, line: 252, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !54, file: !55, line: 253, baseType: !59, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !54, file: !55, line: 254, baseType: !59, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !54, file: !55, line: 255, baseType: !59, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !54, file: !55, line: 256, baseType: !59, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !54, file: !55, line: 257, baseType: !59, size: 64, align: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !54, file: !55, line: 258, baseType: !59, size: 64, align: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !54, file: !55, line: 259, baseType: !59, size: 64, align: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !54, file: !55, line: 261, baseType: !59, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !54, file: !55, line: 262, baseType: !59, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !54, file: !55, line: 263, baseType: !59, size: 64, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !54, file: !55, line: 265, baseType: !71, size: 64, align: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !55, line: 161, size: 192, align: 64, elements: !73)
!73 = !{!74, !75, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !72, file: !55, line: 162, baseType: !71, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !72, file: !55, line: 163, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !72, file: !55, line: 167, baseType: !51, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !54, file: !55, line: 267, baseType: !76, size: 64, align: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !54, file: !55, line: 269, baseType: !51, size: 32, align: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !54, file: !55, line: 273, baseType: !51, size: 32, align: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !54, file: !55, line: 275, baseType: !82, size: 64, align: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !23, line: 140, baseType: !24)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !54, file: !55, line: 279, baseType: !84, size: 16, align: 16, offset: 1024)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !54, file: !55, line: 280, baseType: !86, size: 8, align: 8, offset: 1040)
!86 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !54, file: !55, line: 281, baseType: !88, size: 8, align: 8, offset: 1048)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !54, file: !55, line: 285, baseType: !92, size: 64, align: 64, offset: 1088)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !55, line: 155, baseType: null)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !54, file: !55, line: 294, baseType: !95, size: 64, align: 64, offset: 1152)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !23, line: 141, baseType: !24)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !54, file: !55, line: 303, baseType: !11, size: 64, align: 64, offset: 1216)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !54, file: !55, line: 304, baseType: !11, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !54, file: !55, line: 305, baseType: !11, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !54, file: !55, line: 306, baseType: !11, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !54, file: !55, line: 307, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !54, file: !55, line: 309, baseType: !51, size: 32, align: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !54, file: !55, line: 311, baseType: !106, size: 160, align: 8, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !27, file: !14, line: 343, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !14, line: 316, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!12, !12, !59}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !27, file: !14, line: 344, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !14, line: 318, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!51, !12, !59, !12}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !27, file: !14, line: 345, baseType: !11, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !27, file: !14, line: 346, baseType: !121, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !14, line: 320, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!12, !12}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !27, file: !14, line: 350, baseType: !126, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !14, line: 278, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 236, size: 2176, align: 64, elements: !129)
!129 = !{!130, !135, !136, !137, !138, !139, !144, !146, !147, !148, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !128, file: !14, line: 241, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !14, line: 166, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!12, !12, !12}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !128, file: !14, line: 242, baseType: !131, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !128, file: !14, line: 243, baseType: !131, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !128, file: !14, line: 244, baseType: !131, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !128, file: !14, line: 245, baseType: !131, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !128, file: !14, line: 246, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !14, line: 167, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!12, !12, !12, !12}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !128, file: !14, line: 247, baseType: !145, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !14, line: 165, baseType: !122)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !128, file: !14, line: 248, baseType: !145, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !128, file: !14, line: 249, baseType: !145, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !128, file: !14, line: 250, baseType: !149, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !14, line: 168, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!51, !12}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !128, file: !14, line: 251, baseType: !145, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !128, file: !14, line: 252, baseType: !131, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !128, file: !14, line: 253, baseType: !131, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !128, file: !14, line: 254, baseType: !131, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !128, file: !14, line: 255, baseType: !131, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !128, file: !14, line: 256, baseType: !131, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !128, file: !14, line: 257, baseType: !145, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !128, file: !14, line: 258, baseType: !11, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !128, file: !14, line: 259, baseType: !145, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !128, file: !14, line: 261, baseType: !131, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !128, file: !14, line: 262, baseType: !131, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !128, file: !14, line: 263, baseType: !131, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !128, file: !14, line: 264, baseType: !131, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !128, file: !14, line: 265, baseType: !140, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !128, file: !14, line: 266, baseType: !131, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !128, file: !14, line: 267, baseType: !131, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !128, file: !14, line: 268, baseType: !131, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !128, file: !14, line: 269, baseType: !131, size: 64, align: 64, offset: 1728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !128, file: !14, line: 270, baseType: !131, size: 64, align: 64, offset: 1792)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !128, file: !14, line: 272, baseType: !131, size: 64, align: 64, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !128, file: !14, line: 273, baseType: !131, size: 64, align: 64, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !128, file: !14, line: 274, baseType: !131, size: 64, align: 64, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !128, file: !14, line: 275, baseType: !131, size: 64, align: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !128, file: !14, line: 277, baseType: !145, size: 64, align: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !27, file: !14, line: 351, baseType: !178, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !14, line: 292, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 280, size: 640, align: 64, elements: !181)
!181 = !{!182, !187, !188, !193, !194, !195, !200, !201, !206, !207}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !180, file: !14, line: 281, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !14, line: 169, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!18, !12}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !180, file: !14, line: 282, baseType: !131, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !180, file: !14, line: 283, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !14, line: 170, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!12, !12, !18}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !180, file: !14, line: 284, baseType: !189, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !180, file: !14, line: 285, baseType: !11, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !180, file: !14, line: 286, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !14, line: 172, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!51, !12, !18, !12}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !180, file: !14, line: 287, baseType: !11, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !180, file: !14, line: 288, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !14, line: 231, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!51, !12, !12}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !180, file: !14, line: 290, baseType: !131, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !180, file: !14, line: 291, baseType: !189, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !27, file: !14, line: 352, baseType: !209, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !14, line: 298, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 294, size: 192, align: 64, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !211, file: !14, line: 295, baseType: !183, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !211, file: !14, line: 296, baseType: !131, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !211, file: !14, line: 297, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !14, line: 174, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!51, !12, !12, !12}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !27, file: !14, line: 356, baseType: !221, size: 64, align: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !14, line: 321, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !12}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !19, line: 186, baseType: !18)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !27, file: !14, line: 357, baseType: !140, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !27, file: !14, line: 358, baseType: !121, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !27, file: !14, line: 359, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !14, line: 317, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !27, file: !14, line: 360, baseType: !231, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !14, line: 319, baseType: !217)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !27, file: !14, line: 363, baseType: !233, size: 64, align: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !14, line: 304, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 301, size: 128, align: 64, elements: !236)
!236 = !{!237, !258}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !235, file: !14, line: 302, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !14, line: 193, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!51, !12, !242, !51}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !14, line: 191, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !14, line: 178, size: 640, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !255, !256, !257}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !244, file: !14, line: 179, baseType: !11, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !244, file: !14, line: 180, baseType: !12, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !14, line: 181, baseType: !18, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !244, file: !14, line: 182, baseType: !18, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !244, file: !14, line: 184, baseType: !51, size: 32, align: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !244, file: !14, line: 185, baseType: !51, size: 32, align: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !244, file: !14, line: 186, baseType: !59, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !244, file: !14, line: 187, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !244, file: !14, line: 188, baseType: !254, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !244, file: !14, line: 189, baseType: !254, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !244, file: !14, line: 190, baseType: !11, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !235, file: !14, line: 303, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !14, line: 194, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !12, !242}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !27, file: !14, line: 366, baseType: !103, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !27, file: !14, line: 368, baseType: !36, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !27, file: !14, line: 372, baseType: !266, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !14, line: 233, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!51, !12, !270, !11}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !14, line: 232, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!51, !12, !11}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !27, file: !14, line: 375, baseType: !149, size: 64, align: 64, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !27, file: !14, line: 379, baseType: !276, size: 64, align: 64, offset: 1600)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !14, line: 322, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!12, !12, !12, !51}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !27, file: !14, line: 382, baseType: !18, size: 64, align: 64, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !27, file: !14, line: 385, baseType: !282, size: 64, align: 64, offset: 1728)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !14, line: 323, baseType: !122)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !27, file: !14, line: 386, baseType: !284, size: 64, align: 64, offset: 1792)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !14, line: 324, baseType: !122)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !27, file: !14, line: 389, baseType: !286, size: 64, align: 64, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 40, size: 256, align: 64, elements: !289)
!288 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 41, baseType: !36, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 18, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 43, baseType: !51, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 45, baseType: !36, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !27, file: !14, line: 390, baseType: !296, size: 64, align: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !14, line: 390, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !27, file: !14, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !59, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!12, !12, !11}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!51, !12, !12, !11}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !59, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !11, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !27, file: !14, line: 392, baseType: !26, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !27, file: !14, line: 393, baseType: !12, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !27, file: !14, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !14, line: 325, baseType: !141)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !27, file: !14, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !14, line: 326, baseType: !217)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !27, file: !14, line: 396, baseType: !18, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !27, file: !14, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !14, line: 327, baseType: !217)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !27, file: !14, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !14, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!12, !26, !18}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !27, file: !14, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !14, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!12, !26, !12, !12}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !27, file: !14, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !14, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !11}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !27, file: !14, line: 401, baseType: !149, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !27, file: !14, line: 402, baseType: !12, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !27, file: !14, line: 403, baseType: !12, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !27, file: !14, line: 404, baseType: !12, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !27, file: !14, line: 405, baseType: !12, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !27, file: !14, line: 406, baseType: !12, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !27, file: !14, line: 407, baseType: !42, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !27, file: !14, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !27, file: !14, line: 412, baseType: !42, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !348)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !354)
!354 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !84)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!360 = !{!361, !367, !465, !472, !487, !502, !516, !526, !548, !572}
!361 = !DISubprogram(name: "PyInit__codecs_kr", scope: !362, file: !362, line: 468, type: !363, isLocal: false, isDefinition: true, scopeLine: 468, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__codecs_kr, variables: !365)
!362 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/cjkcodecs/_codecs_kr.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!363 = !DISubroutineType(types: !364)
!364 = !{!12}
!365 = !{!366}
!366 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !361, file: !362, line: 468, type: !12)
!367 = !DISubprogram(name: "getcodec", scope: !368, file: !368, line: 259, type: !133, isLocal: true, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @getcodec, variables: !369)
!368 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/cjkcodecs/cjkcodecs.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!369 = !{!370, !371, !372, !373, !374, !375, !456, !457, !462, !463}
!370 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !367, file: !368, line: 259, type: !12)
!371 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 2, scope: !367, file: !368, line: 259, type: !12)
!372 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codecobj", scope: !367, file: !368, line: 261, type: !12)
!373 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !367, file: !368, line: 261, type: !12)
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cofunc", scope: !367, file: !368, line: 261, type: !12)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codec", scope: !367, file: !368, line: 262, type: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "MultibyteCodec", file: !379, line: 58, baseType: !380)
!379 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/cjkcodecs/multibytecodec.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!380 = !DICompositeType(tag: DW_TAG_structure_type, file: !379, line: 48, size: 576, align: 64, elements: !381)
!381 = !{!382, !383, !386, !391, !417, !422, !427, !449, !451}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !380, file: !379, line: 49, baseType: !36, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !380, file: !379, line: 50, baseType: !384, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "codecinit", scope: !380, file: !379, line: 51, baseType: !387, size: 64, align: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbcodec_init", file: !379, line: 27, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!51, !384}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "encode", scope: !380, file: !379, line: 52, baseType: !392, size: 64, align: 64, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbencode_func", file: !379, line: 28, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!18, !396, !384, !51, !11, !254, !18, !415, !18, !51}
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "MultibyteCodec_State", file: !379, line: 25, baseType: !398)
!398 = !DICompositeType(tag: DW_TAG_union_type, file: !379, line: 19, size: 64, align: 64, elements: !399)
!399 = !{!400, !401, !402, !406, !411}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !398, file: !379, line: 20, baseType: !11, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !398, file: !379, line: 21, baseType: !51, size: 32, align: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !398, file: !379, line: 22, baseType: !403, size: 64, align: 8)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 64, align: 8, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 8)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "u2", scope: !398, file: !379, line: 23, baseType: !407, size: 64, align: 16)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 64, align: 16, elements: !409)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs2_t", file: !379, line: 16, baseType: !84)
!409 = !{!410}
!410 = !DISubrange(count: 4)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "u4", scope: !398, file: !379, line: 24, baseType: !412, size: 64, align: 32)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 64, align: 32, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 2)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "encinit", scope: !380, file: !379, line: 53, baseType: !418, size: 64, align: 64, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbencodeinit_func", file: !379, line: 34, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!51, !396, !384}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "encreset", scope: !380, file: !379, line: 54, baseType: !423, size: 64, align: 64, offset: 320)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbencodereset_func", file: !379, line: 36, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!18, !396, !384, !415, !18}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !380, file: !379, line: 55, baseType: !428, size: 64, align: 64, offset: 384)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbdecode_func", file: !379, line: 39, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!18, !396, !384, !432, !18, !435}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !354)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyUnicodeWriter", file: !4, line: 917, baseType: !437)
!437 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 897, size: 448, align: 64, elements: !438)
!438 = !{!439, !440, !441, !442, !443, !444, !445, !446, !447, !448}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !437, file: !4, line: 898, baseType: !12, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !437, file: !4, line: 899, baseType: !11, size: 64, align: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !437, file: !4, line: 900, baseType: !3, size: 32, align: 32, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "maxchar", scope: !437, file: !4, line: 901, baseType: !350, size: 32, align: 32, offset: 160)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !437, file: !4, line: 902, baseType: !18, size: 64, align: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !437, file: !4, line: 903, baseType: !18, size: 64, align: 64, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "min_length", scope: !437, file: !4, line: 906, baseType: !18, size: 64, align: 64, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "min_char", scope: !437, file: !4, line: 909, baseType: !350, size: 32, align: 32, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "overallocate", scope: !437, file: !4, line: 912, baseType: !354, size: 8, align: 8, offset: 416)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !437, file: !4, line: 916, baseType: !354, size: 8, align: 8, offset: 424)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "decinit", scope: !380, file: !379, line: 56, baseType: !450, size: 64, align: 64, offset: 448)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbdecodeinit_func", file: !379, line: 43, baseType: !419)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "decreset", scope: !380, file: !379, line: 57, baseType: !452, size: 64, align: 64, offset: 512)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbdecodereset_func", file: !379, line: 45, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!18, !396, !384}
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "enc", scope: !367, file: !368, line: 263, type: !36)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !458, file: !368, line: 279, type: !101)
!458 = distinct !DILexicalBlock(scope: !459, file: !368, line: 279, column: 28)
!459 = distinct !DILexicalBlock(scope: !460, file: !368, line: 279, column: 13)
!460 = distinct !DILexicalBlock(scope: !461, file: !368, line: 278, column: 5)
!461 = distinct !DILexicalBlock(scope: !367, file: !368, line: 278, column: 5)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !458, file: !368, line: 279, type: !101)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !464, file: !368, line: 293, type: !12)
!464 = distinct !DILexicalBlock(scope: !367, file: !368, line: 293, column: 8)
!465 = !DISubprogram(name: "getmultibytecodec", scope: !368, file: !368, line: 244, type: !363, isLocal: true, isDefinition: true, scopeLine: 245, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @getmultibytecodec, variables: !466)
!466 = !{!467, !470}
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !468, file: !368, line: 249, type: !12)
!468 = distinct !DILexicalBlock(scope: !469, file: !368, line: 248, column: 31)
!469 = distinct !DILexicalBlock(scope: !465, file: !368, line: 248, column: 9)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !471, file: !368, line: 253, type: !12)
!471 = distinct !DILexicalBlock(scope: !468, file: !368, line: 253, column: 12)
!472 = !DISubprogram(name: "euc_kr_encode", scope: !362, file: !362, line: 34, type: !394, isLocal: true, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%union.MultibyteCodec_State*, i8*, i32, i8*, i64*, i64, i8**, i64, i32)* @euc_kr_encode, variables: !473)
!473 = !{!474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !485}
!474 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !472, file: !362, line: 34, type: !396)
!475 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !472, file: !362, line: 34, type: !384)
!476 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kind", arg: 3, scope: !472, file: !362, line: 34, type: !51)
!477 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 4, scope: !472, file: !362, line: 34, type: !11)
!478 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpos", arg: 5, scope: !472, file: !362, line: 34, type: !254)
!479 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inlen", arg: 6, scope: !472, file: !362, line: 34, type: !18)
!480 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outbuf", arg: 7, scope: !472, file: !362, line: 34, type: !415)
!481 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outleft", arg: 8, scope: !472, file: !362, line: 34, type: !18)
!482 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 9, scope: !472, file: !362, line: 34, type: !51)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !484, file: !362, line: 37, type: !350)
!484 = distinct !DILexicalBlock(scope: !472, file: !362, line: 36, column: 28)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !484, file: !362, line: 38, type: !486)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "DBCHAR", file: !379, line: 16, baseType: !84)
!487 = !DISubprogram(name: "euc_kr_decode", scope: !362, file: !362, line: 107, type: !430, isLocal: true, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%union.MultibyteCodec_State*, i8*, i8**, i64, %struct._PyUnicodeWriter*)* @euc_kr_decode, variables: !488)
!488 = !{!489, !490, !491, !492, !493, !494, !496, !497, !500, !501}
!489 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !487, file: !362, line: 107, type: !396)
!490 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !487, file: !362, line: 107, type: !384)
!491 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inbuf", arg: 3, scope: !487, file: !362, line: 107, type: !432)
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inleft", arg: 4, scope: !487, file: !362, line: 107, type: !18)
!493 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "writer", arg: 5, scope: !487, file: !362, line: 107, type: !435)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !495, file: !362, line: 110, type: !354)
!495 = distinct !DILexicalBlock(scope: !487, file: !362, line: 109, column: 24)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoded", scope: !495, file: !362, line: 111, type: !350)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cho", scope: !498, file: !362, line: 124, type: !486)
!498 = distinct !DILexicalBlock(scope: !499, file: !362, line: 122, column: 36)
!499 = distinct !DILexicalBlock(scope: !495, file: !362, line: 121, column: 13)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jung", scope: !498, file: !362, line: 124, type: !486)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "jong", scope: !498, file: !362, line: 124, type: !486)
!502 = !DISubprogram(name: "cp949_encode", scope: !362, file: !362, line: 172, type: !394, isLocal: true, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%union.MultibyteCodec_State*, i8*, i32, i8*, i64*, i64, i8**, i64, i32)* @cp949_encode, variables: !503)
!503 = !{!504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !515}
!504 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !502, file: !362, line: 172, type: !396)
!505 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !502, file: !362, line: 172, type: !384)
!506 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kind", arg: 3, scope: !502, file: !362, line: 172, type: !51)
!507 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 4, scope: !502, file: !362, line: 172, type: !11)
!508 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpos", arg: 5, scope: !502, file: !362, line: 172, type: !254)
!509 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inlen", arg: 6, scope: !502, file: !362, line: 172, type: !18)
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outbuf", arg: 7, scope: !502, file: !362, line: 172, type: !415)
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outleft", arg: 8, scope: !502, file: !362, line: 172, type: !18)
!512 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 9, scope: !502, file: !362, line: 172, type: !51)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !514, file: !362, line: 175, type: !350)
!514 = distinct !DILexicalBlock(scope: !502, file: !362, line: 174, column: 28)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !514, file: !362, line: 176, type: !486)
!516 = !DISubprogram(name: "cp949_decode", scope: !362, file: !362, line: 204, type: !430, isLocal: true, isDefinition: true, scopeLine: 205, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%union.MultibyteCodec_State*, i8*, i8**, i64, %struct._PyUnicodeWriter*)* @cp949_decode, variables: !517)
!517 = !{!518, !519, !520, !521, !522, !523, !525}
!518 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !516, file: !362, line: 204, type: !396)
!519 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !516, file: !362, line: 204, type: !384)
!520 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inbuf", arg: 3, scope: !516, file: !362, line: 204, type: !432)
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inleft", arg: 4, scope: !516, file: !362, line: 204, type: !18)
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "writer", arg: 5, scope: !516, file: !362, line: 204, type: !435)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !524, file: !362, line: 207, type: !354)
!524 = distinct !DILexicalBlock(scope: !516, file: !362, line: 206, column: 24)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoded", scope: !524, file: !362, line: 208, type: !350)
!526 = !DISubprogram(name: "johab_encode", scope: !362, file: !362, line: 262, type: !394, isLocal: true, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%union.MultibyteCodec_State*, i8*, i32, i8*, i64*, i64, i8**, i64, i32)* @johab_encode, variables: !527)
!527 = !{!528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !539, !540, !545, !546, !547}
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !526, file: !362, line: 262, type: !396)
!529 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !526, file: !362, line: 262, type: !384)
!530 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kind", arg: 3, scope: !526, file: !362, line: 262, type: !51)
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 4, scope: !526, file: !362, line: 262, type: !11)
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpos", arg: 5, scope: !526, file: !362, line: 262, type: !254)
!533 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inlen", arg: 6, scope: !526, file: !362, line: 262, type: !18)
!534 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outbuf", arg: 7, scope: !526, file: !362, line: 262, type: !415)
!535 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outleft", arg: 8, scope: !526, file: !362, line: 262, type: !18)
!536 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 9, scope: !526, file: !362, line: 262, type: !51)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !538, file: !362, line: 265, type: !350)
!538 = distinct !DILexicalBlock(scope: !526, file: !362, line: 264, column: 28)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !538, file: !362, line: 266, type: !486)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c1", scope: !541, file: !362, line: 289, type: !354)
!541 = distinct !DILexicalBlock(scope: !542, file: !362, line: 288, column: 273)
!542 = distinct !DILexicalBlock(scope: !543, file: !362, line: 288, column: 18)
!543 = distinct !DILexicalBlock(scope: !544, file: !362, line: 286, column: 18)
!544 = distinct !DILexicalBlock(scope: !538, file: !362, line: 279, column: 13)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !541, file: !362, line: 289, type: !354)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t2", scope: !541, file: !362, line: 289, type: !354)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t1", scope: !541, file: !362, line: 290, type: !84)
!548 = !DISubprogram(name: "johab_decode", scope: !362, file: !362, line: 361, type: !430, isLocal: true, isDefinition: true, scopeLine: 362, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%union.MultibyteCodec_State*, i8*, i8**, i64, %struct._PyUnicodeWriter*)* @johab_decode, variables: !549)
!549 = !{!550, !551, !552, !553, !554, !555, !557, !558, !559, !562, !563, !564, !565, !566, !567, !571}
!550 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !548, file: !362, line: 361, type: !396)
!551 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !548, file: !362, line: 361, type: !384)
!552 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inbuf", arg: 3, scope: !548, file: !362, line: 361, type: !432)
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inleft", arg: 4, scope: !548, file: !362, line: 361, type: !18)
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "writer", arg: 5, scope: !548, file: !362, line: 361, type: !435)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !556, file: !362, line: 364, type: !354)
!556 = distinct !DILexicalBlock(scope: !548, file: !362, line: 363, column: 24)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !556, file: !362, line: 364, type: !354)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoded", scope: !556, file: !362, line: 365, type: !350)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c_cho", scope: !560, file: !362, line: 378, type: !354)
!560 = distinct !DILexicalBlock(scope: !561, file: !362, line: 376, column: 23)
!561 = distinct !DILexicalBlock(scope: !556, file: !362, line: 376, column: 13)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c_jung", scope: !560, file: !362, line: 378, type: !354)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c_jong", scope: !560, file: !362, line: 378, type: !354)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i_cho", scope: !560, file: !362, line: 379, type: !354)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i_jung", scope: !560, file: !362, line: 379, type: !354)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i_jong", scope: !560, file: !362, line: 379, type: !354)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t1", scope: !568, file: !362, line: 431, type: !354)
!568 = distinct !DILexicalBlock(scope: !569, file: !362, line: 430, column: 18)
!569 = distinct !DILexicalBlock(scope: !570, file: !362, line: 425, column: 17)
!570 = distinct !DILexicalBlock(scope: !561, file: !362, line: 423, column: 16)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t2", scope: !568, file: !362, line: 431, type: !354)
!572 = !DISubprogram(name: "register_maps", scope: !368, file: !368, line: 304, type: !151, isLocal: true, isDefinition: true, scopeLine: 305, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @register_maps, variables: !573)
!573 = !{!574, !575, !601, !608}
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !572, file: !368, line: 304, type: !12)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "h", scope: !572, file: !368, line: 306, type: !576)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !578)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "dbcs_map", file: !368, line: 52, size: 192, align: 64, elements: !579)
!579 = !{!580, !581, !591}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !578, file: !368, line: 53, baseType: !36, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "encmap", scope: !578, file: !368, line: 54, baseType: !582, size: 64, align: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !584)
!584 = !DICompositeType(tag: DW_TAG_structure_type, name: "unim_index", file: !368, line: 41, size: 128, align: 64, elements: !585)
!585 = !{!586, !589, !590}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !584, file: !368, line: 42, baseType: !587, size: 64, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !584, file: !368, line: 43, baseType: !354, size: 8, align: 8, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !584, file: !368, line: 43, baseType: !354, size: 8, align: 8, offset: 72)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "decmap", scope: !578, file: !368, line: 55, baseType: !592, size: 64, align: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !594)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "dbcs_index", file: !368, line: 29, size: 128, align: 64, elements: !595)
!595 = !{!596, !599, !600}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !594, file: !368, line: 30, baseType: !597, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !594, file: !368, line: 31, baseType: !354, size: 8, align: 8, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !594, file: !368, line: 31, baseType: !354, size: 8, align: 8, offset: 72)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mhname", scope: !602, file: !368, line: 309, type: !605)
!602 = distinct !DILexicalBlock(scope: !603, file: !368, line: 308, column: 56)
!603 = distinct !DILexicalBlock(scope: !604, file: !368, line: 308, column: 5)
!604 = distinct !DILexicalBlock(scope: !572, file: !368, line: 308, column: 5)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 2048, align: 8, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 256)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !602, file: !368, line: 310, type: !51)
!609 = !{!610, !633, !635, !636, !637, !639, !642, !646, !650, !654, !658, !662, !663, !665, !669, !670, !674, !678, !679, !680, !684, !685, !686, !687, !688, !689, !690, !691}
!610 = !DIGlobalVariable(name: "__module", scope: !0, file: !362, line: 468, type: !611, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @__module)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !612, line: 47, size: 832, align: 64, elements: !613)
!612 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!613 = !{!614, !623, !624, !625, !626, !629, !630, !631, !632}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !611, file: !612, line: 48, baseType: !615, size: 320, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !612, line: 38, baseType: !616)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !612, line: 33, size: 320, align: 64, elements: !617)
!617 = !{!618, !619, !621, !622}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !616, file: !612, line: 34, baseType: !13, size: 128, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !616, file: !612, line: 35, baseType: !620, size: 64, align: 64, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !616, file: !612, line: 36, baseType: !18, size: 64, align: 64, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !616, file: !612, line: 37, baseType: !12, size: 64, align: 64, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !611, file: !612, line: 49, baseType: !36, size: 64, align: 64, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !611, file: !612, line: 50, baseType: !36, size: 64, align: 64, offset: 384)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !611, file: !612, line: 51, baseType: !18, size: 64, align: 64, offset: 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !611, file: !612, line: 52, baseType: !627, size: 64, align: 64, offset: 512)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !288, line: 47, baseType: !287)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !611, file: !612, line: 53, baseType: !149, size: 64, align: 64, offset: 576)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !611, file: !612, line: 54, baseType: !266, size: 64, align: 64, offset: 640)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !611, file: !612, line: 55, baseType: !149, size: 64, align: 64, offset: 704)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !611, file: !612, line: 56, baseType: !336, size: 64, align: 64, offset: 768)
!633 = !DIGlobalVariable(name: "__methods", scope: !0, file: !368, line: 298, type: !634, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMethodDef]* @__methods)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 512, align: 64, elements: !413)
!635 = !DIGlobalVariable(name: "cofunc", scope: !465, file: !368, line: 246, type: !12, isLocal: true, isDefinition: true, variable: %struct._object** @getmultibytecodec.cofunc)
!636 = !DIGlobalVariable(name: "codec_list", scope: !0, file: !362, line: 466, type: !376, isLocal: true, isDefinition: true, variable: %struct.MultibyteCodec** @codec_list)
!637 = !DIGlobalVariable(name: "_codec_list", scope: !0, file: !362, line: 462, type: !638, isLocal: true, isDefinition: true, variable: [4 x %struct.MultibyteCodec]* @_codec_list)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 2304, align: 64, elements: !409)
!639 = !DIGlobalVariable(name: "cp949_encmap", scope: !0, file: !640, line: 3181, type: !641, isLocal: true, isDefinition: true, variable: [256 x %struct.unim_index]* @cp949_encmap)
!640 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/cjkcodecs/mappings_kr.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 32768, align: 64, elements: !606)
!642 = !DIGlobalVariable(name: "__cp949_encmap", scope: !0, file: !640, line: 1449, type: !643, isLocal: true, isDefinition: true, variable: [33133 x i16]* @__cp949_encmap)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 530128, align: 16, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 33133)
!646 = !DIGlobalVariable(name: "u2cgk_choseong", scope: !0, file: !362, line: 17, type: !647, isLocal: true, isDefinition: true, variable: [19 x i8]* @u2cgk_choseong)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 152, align: 8, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 19)
!650 = !DIGlobalVariable(name: "u2cgk_jungseong", scope: !0, file: !362, line: 22, type: !651, isLocal: true, isDefinition: true, variable: [21 x i8]* @u2cgk_jungseong)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 168, align: 8, elements: !652)
!652 = !{!653}
!653 = !DISubrange(count: 21)
!654 = !DIGlobalVariable(name: "u2cgk_jongseong", scope: !0, file: !362, line: 27, type: !655, isLocal: true, isDefinition: true, variable: [28 x i8]* @u2cgk_jongseong)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 224, align: 8, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 28)
!658 = !DIGlobalVariable(name: "cgk2u_choseong", scope: !0, file: !362, line: 94, type: !659, isLocal: true, isDefinition: true, variable: [30 x i8]* @cgk2u_choseong)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 240, align: 8, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 30)
!662 = !DIGlobalVariable(name: "cgk2u_jongseong", scope: !0, file: !362, line: 100, type: !659, isLocal: true, isDefinition: true, variable: [30 x i8]* @cgk2u_jongseong)
!663 = !DIGlobalVariable(name: "ksx1001_decmap", scope: !0, file: !640, line: 632, type: !664, isLocal: true, isDefinition: true, variable: [256 x %struct.dbcs_index]* @ksx1001_decmap)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 32768, align: 64, elements: !606)
!665 = !DIGlobalVariable(name: "__ksx1001_decmap", scope: !0, file: !640, line: 1, type: !666, isLocal: true, isDefinition: true, variable: [8264 x i16]* @__ksx1001_decmap)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 132224, align: 16, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 8264)
