; ModuleID = 'irs-onlybc/_codecs_iso2022.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !400, globals: !794)
!1 = !DIFile(filename: "_codecs_iso2022.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !12, !350, !59, !353, !378, !390, !393, !388, !365, !392, !396, !395, !397, !398, !399}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !14, line: 109, baseType: !15)
!14 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !14, line: 105, size: 128, align: 64, elements: !16)
!16 = !{!17, !25}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !15, file: !14, line: 107, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !19, line: 177, baseType: !20)
!19 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !21, line: 102, baseType: !22)
!21 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !23, line: 181, baseType: !24)
!23 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!24 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !15, file: !14, line: 108, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !14, line: 334, size: 3200, align: 64, elements: !28)
!28 = !{!29, !35, !39, !40, !41, !46, !109, !114, !119, !120, !125, !177, !208, !220, !226, !227, !228, !230, !232, !263, !264, !265, !274, !275, !280, !281, !283, !285, !295, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !27, file: !14, line: 335, baseType: !30, size: 192, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !14, line: 114, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 111, size: 192, align: 64, elements: !32)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !14, line: 112, baseType: !13, size: 128, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !31, file: !14, line: 113, baseType: !18, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !27, file: !14, line: 336, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !27, file: !14, line: 341, baseType: !42, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !14, line: 308, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !12}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !27, file: !14, line: 342, baseType: !47, size: 64, align: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !14, line: 314, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !12, !52, !51}
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !21, line: 48, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !55, line: 246, size: 1728, align: 64, elements: !56)
!55 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!56 = !{!57, !58, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !78, !79, !80, !81, !83, !85, !87, !91, !94, !96, !97, !98, !99, !100, !104, !105}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !54, file: !55, line: 247, baseType: !51, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !54, file: !55, line: 252, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !54, file: !55, line: 253, baseType: !59, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !54, file: !55, line: 254, baseType: !59, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !54, file: !55, line: 255, baseType: !59, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !54, file: !55, line: 256, baseType: !59, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !54, file: !55, line: 257, baseType: !59, size: 64, align: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !54, file: !55, line: 258, baseType: !59, size: 64, align: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !54, file: !55, line: 259, baseType: !59, size: 64, align: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !54, file: !55, line: 261, baseType: !59, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !54, file: !55, line: 262, baseType: !59, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !54, file: !55, line: 263, baseType: !59, size: 64, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !54, file: !55, line: 265, baseType: !71, size: 64, align: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !55, line: 161, size: 192, align: 64, elements: !73)
!73 = !{!74, !75, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !72, file: !55, line: 162, baseType: !71, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !72, file: !55, line: 163, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !72, file: !55, line: 167, baseType: !51, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !54, file: !55, line: 267, baseType: !76, size: 64, align: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !54, file: !55, line: 269, baseType: !51, size: 32, align: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !54, file: !55, line: 273, baseType: !51, size: 32, align: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !54, file: !55, line: 275, baseType: !82, size: 64, align: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !23, line: 140, baseType: !24)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !54, file: !55, line: 279, baseType: !84, size: 16, align: 16, offset: 1024)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !54, file: !55, line: 280, baseType: !86, size: 8, align: 8, offset: 1040)
!86 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !54, file: !55, line: 281, baseType: !88, size: 8, align: 8, offset: 1048)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !54, file: !55, line: 285, baseType: !92, size: 64, align: 64, offset: 1088)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !55, line: 155, baseType: null)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !54, file: !55, line: 294, baseType: !95, size: 64, align: 64, offset: 1152)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !23, line: 141, baseType: !24)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !54, file: !55, line: 303, baseType: !11, size: 64, align: 64, offset: 1216)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !54, file: !55, line: 304, baseType: !11, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !54, file: !55, line: 305, baseType: !11, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !54, file: !55, line: 306, baseType: !11, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !54, file: !55, line: 307, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !54, file: !55, line: 309, baseType: !51, size: 32, align: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !54, file: !55, line: 311, baseType: !106, size: 160, align: 8, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !27, file: !14, line: 343, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !14, line: 316, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!12, !12, !59}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !27, file: !14, line: 344, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !14, line: 318, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!51, !12, !59, !12}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !27, file: !14, line: 345, baseType: !11, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !27, file: !14, line: 346, baseType: !121, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !14, line: 320, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!12, !12}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !27, file: !14, line: 350, baseType: !126, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !14, line: 278, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 236, size: 2176, align: 64, elements: !129)
!129 = !{!130, !135, !136, !137, !138, !139, !144, !146, !147, !148, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !128, file: !14, line: 241, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !14, line: 166, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!12, !12, !12}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !128, file: !14, line: 242, baseType: !131, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !128, file: !14, line: 243, baseType: !131, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !128, file: !14, line: 244, baseType: !131, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !128, file: !14, line: 245, baseType: !131, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !128, file: !14, line: 246, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !14, line: 167, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!12, !12, !12, !12}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !128, file: !14, line: 247, baseType: !145, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !14, line: 165, baseType: !122)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !128, file: !14, line: 248, baseType: !145, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !128, file: !14, line: 249, baseType: !145, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !128, file: !14, line: 250, baseType: !149, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !14, line: 168, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!51, !12}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !128, file: !14, line: 251, baseType: !145, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !128, file: !14, line: 252, baseType: !131, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !128, file: !14, line: 253, baseType: !131, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !128, file: !14, line: 254, baseType: !131, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !128, file: !14, line: 255, baseType: !131, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !128, file: !14, line: 256, baseType: !131, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !128, file: !14, line: 257, baseType: !145, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !128, file: !14, line: 258, baseType: !11, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !128, file: !14, line: 259, baseType: !145, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !128, file: !14, line: 261, baseType: !131, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !128, file: !14, line: 262, baseType: !131, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !128, file: !14, line: 263, baseType: !131, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !128, file: !14, line: 264, baseType: !131, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !128, file: !14, line: 265, baseType: !140, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !128, file: !14, line: 266, baseType: !131, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !128, file: !14, line: 267, baseType: !131, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !128, file: !14, line: 268, baseType: !131, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !128, file: !14, line: 269, baseType: !131, size: 64, align: 64, offset: 1728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !128, file: !14, line: 270, baseType: !131, size: 64, align: 64, offset: 1792)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !128, file: !14, line: 272, baseType: !131, size: 64, align: 64, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !128, file: !14, line: 273, baseType: !131, size: 64, align: 64, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !128, file: !14, line: 274, baseType: !131, size: 64, align: 64, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !128, file: !14, line: 275, baseType: !131, size: 64, align: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !128, file: !14, line: 277, baseType: !145, size: 64, align: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !27, file: !14, line: 351, baseType: !178, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !14, line: 292, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 280, size: 640, align: 64, elements: !181)
!181 = !{!182, !187, !188, !193, !194, !195, !200, !201, !206, !207}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !180, file: !14, line: 281, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !14, line: 169, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!18, !12}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !180, file: !14, line: 282, baseType: !131, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !180, file: !14, line: 283, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !14, line: 170, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!12, !12, !18}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !180, file: !14, line: 284, baseType: !189, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !180, file: !14, line: 285, baseType: !11, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !180, file: !14, line: 286, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !14, line: 172, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!51, !12, !18, !12}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !180, file: !14, line: 287, baseType: !11, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !180, file: !14, line: 288, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !14, line: 231, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!51, !12, !12}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !180, file: !14, line: 290, baseType: !131, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !180, file: !14, line: 291, baseType: !189, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !27, file: !14, line: 352, baseType: !209, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !14, line: 298, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 294, size: 192, align: 64, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !211, file: !14, line: 295, baseType: !183, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !211, file: !14, line: 296, baseType: !131, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !211, file: !14, line: 297, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !14, line: 174, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!51, !12, !12, !12}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !27, file: !14, line: 356, baseType: !221, size: 64, align: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !14, line: 321, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !12}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !19, line: 186, baseType: !18)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !27, file: !14, line: 357, baseType: !140, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !27, file: !14, line: 358, baseType: !121, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !27, file: !14, line: 359, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !14, line: 317, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !27, file: !14, line: 360, baseType: !231, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !14, line: 319, baseType: !217)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !27, file: !14, line: 363, baseType: !233, size: 64, align: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !14, line: 304, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 301, size: 128, align: 64, elements: !236)
!236 = !{!237, !258}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !235, file: !14, line: 302, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !14, line: 193, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!51, !12, !242, !51}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !14, line: 191, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !14, line: 178, size: 640, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !255, !256, !257}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !244, file: !14, line: 179, baseType: !11, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !244, file: !14, line: 180, baseType: !12, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !14, line: 181, baseType: !18, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !244, file: !14, line: 182, baseType: !18, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !244, file: !14, line: 184, baseType: !51, size: 32, align: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !244, file: !14, line: 185, baseType: !51, size: 32, align: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !244, file: !14, line: 186, baseType: !59, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !244, file: !14, line: 187, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !244, file: !14, line: 188, baseType: !254, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !244, file: !14, line: 189, baseType: !254, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !244, file: !14, line: 190, baseType: !11, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !235, file: !14, line: 303, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !14, line: 194, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !12, !242}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !27, file: !14, line: 366, baseType: !103, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !27, file: !14, line: 368, baseType: !36, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !27, file: !14, line: 372, baseType: !266, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !14, line: 233, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!51, !12, !270, !11}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !14, line: 232, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!51, !12, !11}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !27, file: !14, line: 375, baseType: !149, size: 64, align: 64, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !27, file: !14, line: 379, baseType: !276, size: 64, align: 64, offset: 1600)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !14, line: 322, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!12, !12, !12, !51}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !27, file: !14, line: 382, baseType: !18, size: 64, align: 64, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !27, file: !14, line: 385, baseType: !282, size: 64, align: 64, offset: 1728)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !14, line: 323, baseType: !122)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !27, file: !14, line: 386, baseType: !284, size: 64, align: 64, offset: 1792)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !14, line: 324, baseType: !122)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !27, file: !14, line: 389, baseType: !286, size: 64, align: 64, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 40, size: 256, align: 64, elements: !289)
!288 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 41, baseType: !36, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 18, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 43, baseType: !51, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 45, baseType: !36, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !27, file: !14, line: 390, baseType: !296, size: 64, align: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !14, line: 390, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !27, file: !14, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !59, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!12, !12, !11}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!51, !12, !12, !11}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !59, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !11, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !27, file: !14, line: 392, baseType: !26, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !27, file: !14, line: 393, baseType: !12, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !27, file: !14, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !14, line: 325, baseType: !141)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !27, file: !14, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !14, line: 326, baseType: !217)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !27, file: !14, line: 396, baseType: !18, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !27, file: !14, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !14, line: 327, baseType: !217)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !27, file: !14, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !14, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!12, !26, !18}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !27, file: !14, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !14, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!12, !26, !12, !12}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !27, file: !14, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !14, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !11}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !27, file: !14, line: 401, baseType: !149, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !27, file: !14, line: 402, baseType: !12, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !27, file: !14, line: 403, baseType: !12, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !27, file: !14, line: 404, baseType: !12, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !27, file: !14, line: 405, baseType: !12, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !27, file: !14, line: 406, baseType: !12, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !27, file: !14, line: 407, baseType: !42, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !27, file: !14, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !27, file: !14, line: 412, baseType: !42, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !355)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "iso2022_config", file: !356, line: 117, size: 128, align: 64, elements: !357)
!356 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/cjkcodecs/_codecs_iso2022.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !355, file: !356, line: 118, baseType: !51, size: 32, align: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "designations", scope: !355, file: !356, line: 119, baseType: !360, size: 64, align: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !362)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "iso2022_designation", file: !356, line: 108, size: 256, align: 64, elements: !363)
!363 = !{!364, !366, !367, !368, !373, !381}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !362, file: !356, line: 109, baseType: !365, size: 8, align: 8)
!365 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !362, file: !356, line: 110, baseType: !365, size: 8, align: 8, offset: 8)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !362, file: !356, line: 111, baseType: !365, size: 8, align: 8, offset: 16)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "initializer", scope: !362, file: !356, line: 112, baseType: !369, size: 64, align: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "iso2022_init_func", file: !356, line: 104, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DISubroutineType(types: !372)
!372 = !{!51}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "decoder", scope: !362, file: !356, line: 113, baseType: !374, size: 64, align: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "iso2022_decode_func", file: !356, line: 105, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !348)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "encoder", scope: !362, file: !356, line: 114, baseType: !382, size: 64, align: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "iso2022_encode_func", file: !356, line: 106, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!386, !388, !254}
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "DBCHAR", file: !387, line: 16, baseType: !84)
!387 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/cjkcodecs/multibytecodec.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !378)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !365)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !84)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs2_t", file: !387, line: 16, baseType: !84)
!400 = !{!401, !406, !498, !505, !507, !551, !555, !560, !564, !584, !588, !594, !618, !633, !642, !646, !650, !651, !655, !660, !664, !669, !670, !674, !679, !680, !684, !689, !692, !696, !697, !701, !707, !715, !733, !738, !742, !747, !751, !757, !762, !766, !771, !775, !780}
!401 = !DISubprogram(name: "PyInit__codecs_iso2022", scope: !356, file: !356, line: 1150, type: !402, isLocal: false, isDefinition: true, scopeLine: 1150, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__codecs_iso2022, variables: !404)
!402 = !DISubroutineType(types: !403)
!403 = !{!12}
!404 = !{!405}
!405 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !401, file: !356, line: 1150, type: !12)
!406 = !DISubprogram(name: "getcodec", scope: !407, file: !407, line: 259, type: !133, isLocal: true, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @getcodec, variables: !408)
!407 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/cjkcodecs/cjkcodecs.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!408 = !{!409, !410, !411, !412, !413, !414, !489, !490, !495, !496}
!409 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !406, file: !407, line: 259, type: !12)
!410 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 2, scope: !406, file: !407, line: 259, type: !12)
!411 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codecobj", scope: !406, file: !407, line: 261, type: !12)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !406, file: !407, line: 261, type: !12)
!413 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cofunc", scope: !406, file: !407, line: 261, type: !12)
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codec", scope: !406, file: !407, line: 262, type: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "MultibyteCodec", file: !387, line: 58, baseType: !418)
!418 = !DICompositeType(tag: DW_TAG_structure_type, file: !387, line: 48, size: 576, align: 64, elements: !419)
!419 = !{!420, !421, !422, !427, !452, !457, !462, !482, !484}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !418, file: !387, line: 49, baseType: !36, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !418, file: !387, line: 50, baseType: !351, size: 64, align: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "codecinit", scope: !418, file: !387, line: 51, baseType: !423, size: 64, align: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbcodec_init", file: !387, line: 27, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!51, !351}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "encode", scope: !418, file: !387, line: 52, baseType: !428, size: 64, align: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbencode_func", file: !387, line: 28, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!18, !432, !351, !51, !11, !254, !18, !450, !18, !51}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "MultibyteCodec_State", file: !387, line: 25, baseType: !434)
!434 = !DICompositeType(tag: DW_TAG_union_type, file: !387, line: 19, size: 64, align: 64, elements: !435)
!435 = !{!436, !437, !438, !442, !446}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !434, file: !387, line: 20, baseType: !11, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !434, file: !387, line: 21, baseType: !51, size: 32, align: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !434, file: !387, line: 22, baseType: !439, size: 64, align: 8)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 64, align: 8, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 8)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "u2", scope: !434, file: !387, line: 23, baseType: !443, size: 64, align: 16)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 64, align: 16, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 4)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "u4", scope: !434, file: !387, line: 24, baseType: !447, size: 64, align: 32)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 64, align: 32, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 2)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "encinit", scope: !418, file: !387, line: 53, baseType: !453, size: 64, align: 64, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbencodeinit_func", file: !387, line: 34, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!51, !432, !351}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "encreset", scope: !418, file: !387, line: 54, baseType: !458, size: 64, align: 64, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbencodereset_func", file: !387, line: 36, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!18, !432, !351, !450, !18}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !418, file: !387, line: 55, baseType: !463, size: 64, align: 64, offset: 384)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbdecode_func", file: !387, line: 39, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!18, !432, !351, !467, !18, !468}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyUnicodeWriter", file: !4, line: 917, baseType: !470)
!470 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 897, size: 448, align: 64, elements: !471)
!471 = !{!472, !473, !474, !475, !476, !477, !478, !479, !480, !481}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !470, file: !4, line: 898, baseType: !12, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !470, file: !4, line: 899, baseType: !11, size: 64, align: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !470, file: !4, line: 900, baseType: !3, size: 32, align: 32, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "maxchar", scope: !470, file: !4, line: 901, baseType: !378, size: 32, align: 32, offset: 160)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !470, file: !4, line: 902, baseType: !18, size: 64, align: 64, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !470, file: !4, line: 903, baseType: !18, size: 64, align: 64, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "min_length", scope: !470, file: !4, line: 906, baseType: !18, size: 64, align: 64, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "min_char", scope: !470, file: !4, line: 909, baseType: !378, size: 32, align: 32, offset: 384)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "overallocate", scope: !470, file: !4, line: 912, baseType: !365, size: 8, align: 8, offset: 416)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !470, file: !4, line: 916, baseType: !365, size: 8, align: 8, offset: 424)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "decinit", scope: !418, file: !387, line: 56, baseType: !483, size: 64, align: 64, offset: 448)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbdecodeinit_func", file: !387, line: 43, baseType: !454)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "decreset", scope: !418, file: !387, line: 57, baseType: !485, size: 64, align: 64, offset: 512)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbdecodereset_func", file: !387, line: 45, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!18, !432, !351}
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "enc", scope: !406, file: !407, line: 263, type: !36)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !491, file: !407, line: 279, type: !101)
!491 = distinct !DILexicalBlock(scope: !492, file: !407, line: 279, column: 28)
!492 = distinct !DILexicalBlock(scope: !493, file: !407, line: 279, column: 13)
!493 = distinct !DILexicalBlock(scope: !494, file: !407, line: 278, column: 5)
!494 = distinct !DILexicalBlock(scope: !406, file: !407, line: 278, column: 5)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !491, file: !407, line: 279, type: !101)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !497, file: !407, line: 293, type: !12)
!497 = distinct !DILexicalBlock(scope: !406, file: !407, line: 293, column: 8)
!498 = !DISubprogram(name: "getmultibytecodec", scope: !407, file: !407, line: 244, type: !402, isLocal: true, isDefinition: true, scopeLine: 245, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @getmultibytecodec, variables: !499)
!499 = !{!500, !503}
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !501, file: !407, line: 249, type: !12)
!501 = distinct !DILexicalBlock(scope: !502, file: !407, line: 248, column: 31)
!502 = distinct !DILexicalBlock(scope: !498, file: !407, line: 248, column: 9)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !504, file: !407, line: 253, type: !12)
!504 = distinct !DILexicalBlock(scope: !501, file: !407, line: 253, column: 12)
!505 = !DISubprogram(name: "ksx1001_init", scope: !356, file: !356, line: 571, type: !371, isLocal: true, isDefinition: true, scopeLine: 572, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @ksx1001_init, variables: !506)
!506 = !{}
!507 = !DISubprogram(name: "importmap", scope: !407, file: !407, line: 356, type: !508, isLocal: true, isDefinition: true, scopeLine: 358, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*, i8**, i8**)* @importmap, variables: !510)
!508 = !DISubroutineType(types: !509)
!509 = !{!51, !36, !36, !350, !350}
!510 = !{!511, !512, !513, !514, !515, !516, !517, !545, !547, !549}
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "modname", arg: 1, scope: !507, file: !407, line: 356, type: !36)
!512 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symbol", arg: 2, scope: !507, file: !407, line: 356, type: !36)
!513 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encmap", arg: 3, scope: !507, file: !407, line: 357, type: !350)
!514 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "decmap", arg: 4, scope: !507, file: !407, line: 357, type: !350)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !507, file: !407, line: 359, type: !12)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !507, file: !407, line: 359, type: !12)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map", scope: !518, file: !407, line: 374, type: !521)
!518 = distinct !DILexicalBlock(scope: !519, file: !407, line: 373, column: 10)
!519 = distinct !DILexicalBlock(scope: !520, file: !407, line: 368, column: 14)
!520 = distinct !DILexicalBlock(scope: !507, file: !407, line: 366, column: 9)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "dbcs_map", file: !407, line: 52, size: 192, align: 64, elements: !523)
!523 = !{!524, !525, !535}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !522, file: !407, line: 53, baseType: !36, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "encmap", scope: !522, file: !407, line: 54, baseType: !526, size: 64, align: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !528)
!528 = !DICompositeType(tag: DW_TAG_structure_type, name: "unim_index", file: !407, line: 41, size: 128, align: 64, elements: !529)
!529 = !{!530, !533, !534}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !528, file: !407, line: 42, baseType: !531, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !386)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !528, file: !407, line: 43, baseType: !365, size: 8, align: 8, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !528, file: !407, line: 43, baseType: !365, size: 8, align: 8, offset: 72)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "decmap", scope: !522, file: !407, line: 55, baseType: !536, size: 64, align: 64, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !538)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "dbcs_index", file: !407, line: 29, size: 128, align: 64, elements: !539)
!539 = !{!540, !543, !544}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !538, file: !407, line: 30, baseType: !541, size: 64, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !538, file: !407, line: 31, baseType: !365, size: 8, align: 8, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !538, file: !407, line: 31, baseType: !365, size: 8, align: 8, offset: 72)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !546, file: !407, line: 380, type: !12)
!546 = distinct !DILexicalBlock(scope: !518, file: !407, line: 380, column: 12)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !548, file: !407, line: 383, type: !12)
!548 = distinct !DILexicalBlock(scope: !507, file: !407, line: 383, column: 8)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !550, file: !407, line: 387, type: !12)
!550 = distinct !DILexicalBlock(scope: !507, file: !407, line: 387, column: 8)
!551 = !DISubprogram(name: "ksx1001_decoder", scope: !356, file: !356, line: 584, type: !376, isLocal: true, isDefinition: true, scopeLine: 585, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @ksx1001_decoder, variables: !552)
!552 = !{!553, !554}
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !551, file: !356, line: 584, type: !379)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !551, file: !356, line: 586, type: !378)
!555 = !DISubprogram(name: "ksx1001_encoder", scope: !356, file: !356, line: 594, type: !384, isLocal: true, isDefinition: true, scopeLine: 595, flags: DIFlagPrototyped, isOptimized: true, function: i16 (i32*, i64*)* @ksx1001_encoder, variables: !556)
!556 = !{!557, !558, !559}
!557 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !555, file: !356, line: 594, type: !388)
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 2, scope: !555, file: !356, line: 594, type: !254)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coded", scope: !555, file: !356, line: 596, type: !386)
!560 = !DISubprogram(name: "iso2022_codec_init", scope: !356, file: !356, line: 124, type: !425, isLocal: true, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @iso2022_codec_init, variables: !561)
!561 = !{!562, !563}
!562 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 1, scope: !560, file: !356, line: 124, type: !351)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "desig", scope: !560, file: !356, line: 126, type: !360)
!564 = !DISubprogram(name: "iso2022_encode", scope: !356, file: !356, line: 156, type: !430, isLocal: true, isDefinition: true, scopeLine: 157, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%union.MultibyteCodec_State*, i8*, i32, i8*, i64*, i64, i8**, i64, i32)* @iso2022_encode, variables: !565)
!565 = !{!566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !577, !578, !579, !580}
!566 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !564, file: !356, line: 156, type: !432)
!567 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !564, file: !356, line: 156, type: !351)
!568 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kind", arg: 3, scope: !564, file: !356, line: 156, type: !51)
!569 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 4, scope: !564, file: !356, line: 156, type: !11)
!570 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpos", arg: 5, scope: !564, file: !356, line: 156, type: !254)
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inlen", arg: 6, scope: !564, file: !356, line: 156, type: !18)
!572 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outbuf", arg: 7, scope: !564, file: !356, line: 156, type: !450)
!573 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outleft", arg: 8, scope: !564, file: !356, line: 156, type: !18)
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 9, scope: !564, file: !356, line: 156, type: !51)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dsg", scope: !576, file: !356, line: 159, type: !360)
!576 = distinct !DILexicalBlock(scope: !564, file: !356, line: 158, column: 28)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "encoded", scope: !576, file: !356, line: 160, type: !386)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !576, file: !356, line: 161, type: !378)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "insize", scope: !576, file: !356, line: 162, type: !18)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !581, file: !356, line: 184, type: !18)
!581 = distinct !DILexicalBlock(scope: !582, file: !356, line: 183, column: 95)
!582 = distinct !DILexicalBlock(scope: !583, file: !356, line: 183, column: 9)
!583 = distinct !DILexicalBlock(scope: !576, file: !356, line: 183, column: 9)
!584 = !DISubprogram(name: "iso2022_encode_init", scope: !356, file: !356, line: 133, type: !455, isLocal: true, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%union.MultibyteCodec_State*, i8*)* @iso2022_encode_init, variables: !585)
!585 = !{!586, !587}
!586 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !584, file: !356, line: 133, type: !432)
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !584, file: !356, line: 133, type: !351)
!588 = !DISubprogram(name: "iso2022_encode_reset", scope: !356, file: !356, line: 141, type: !460, isLocal: true, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%union.MultibyteCodec_State*, i8*, i8**, i64)* @iso2022_encode_reset, variables: !589)
!589 = !{!590, !591, !592, !593}
!590 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !588, file: !356, line: 141, type: !432)
!591 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !588, file: !356, line: 141, type: !351)
!592 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outbuf", arg: 3, scope: !588, file: !356, line: 141, type: !450)
!593 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outleft", arg: 4, scope: !588, file: !356, line: 141, type: !18)
!594 = !DISubprogram(name: "iso2022_decode", scope: !356, file: !356, line: 423, type: !465, isLocal: true, isDefinition: true, scopeLine: 424, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%union.MultibyteCodec_State*, i8*, i8**, i64, %struct._PyUnicodeWriter*)* @iso2022_decode, variables: !595)
!595 = !{!596, !597, !598, !599, !600, !601, !602, !604, !605, !610, !611, !612, !617}
!596 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !594, file: !356, line: 423, type: !432)
!597 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !594, file: !356, line: 423, type: !351)
!598 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inbuf", arg: 3, scope: !594, file: !356, line: 423, type: !467)
!599 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inleft", arg: 4, scope: !594, file: !356, line: 423, type: !18)
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "writer", arg: 5, scope: !594, file: !356, line: 423, type: !468)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dsgcache", scope: !594, file: !356, line: 425, type: !360)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !603, file: !356, line: 428, type: !365)
!603 = distinct !DILexicalBlock(scope: !594, file: !356, line: 427, column: 24)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !603, file: !356, line: 429, type: !18)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dsg", scope: !606, file: !356, line: 487, type: !360)
!606 = distinct !DILexicalBlock(scope: !607, file: !356, line: 486, column: 18)
!607 = distinct !DILexicalBlock(scope: !608, file: !356, line: 484, column: 22)
!608 = distinct !DILexicalBlock(scope: !609, file: !356, line: 482, column: 17)
!609 = distinct !DILexicalBlock(scope: !603, file: !356, line: 442, column: 20)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "charset", scope: !606, file: !356, line: 488, type: !365)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoded", scope: !606, file: !356, line: 489, type: !378)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_c1", scope: !613, file: !356, line: 532, type: !378)
!613 = distinct !DILexicalBlock(scope: !614, file: !356, line: 532, column: 24)
!614 = distinct !DILexicalBlock(scope: !615, file: !356, line: 531, column: 22)
!615 = distinct !DILexicalBlock(scope: !616, file: !356, line: 528, column: 26)
!616 = distinct !DILexicalBlock(scope: !606, file: !356, line: 525, column: 21)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_c2", scope: !613, file: !356, line: 532, type: !378)
!618 = !DISubprogram(name: "iso2022processesc", scope: !356, file: !356, line: 291, type: !619, isLocal: true, isDefinition: true, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8*, %union.MultibyteCodec_State*, i8**, i64*)* @iso2022processesc, variables: !621)
!619 = !DISubroutineType(types: !620)
!620 = !{!18, !351, !432, !467, !254}
!621 = !{!622, !623, !624, !625, !626, !627, !628, !629, !630}
!622 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 1, scope: !618, file: !356, line: 291, type: !351)
!623 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 2, scope: !618, file: !356, line: 291, type: !432)
!624 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inbuf", arg: 3, scope: !618, file: !356, line: 292, type: !467)
!625 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inleft", arg: 4, scope: !618, file: !356, line: 292, type: !254)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "charset", scope: !618, file: !356, line: 294, type: !365)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "designation", scope: !618, file: !356, line: 294, type: !365)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !618, file: !356, line: 295, type: !18)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "esclen", scope: !618, file: !356, line: 295, type: !18)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dsg", scope: !631, file: !356, line: 359, type: !360)
!631 = distinct !DILexicalBlock(scope: !632, file: !356, line: 358, column: 25)
!632 = distinct !DILexicalBlock(scope: !618, file: !356, line: 358, column: 9)
!633 = !DISubprogram(name: "iso2022processg2", scope: !356, file: !356, line: 392, type: !634, isLocal: true, isDefinition: true, scopeLine: 395, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8*, %union.MultibyteCodec_State*, i8**, i64*, %struct._PyUnicodeWriter*)* @iso2022processg2, variables: !636)
!634 = !DISubroutineType(types: !635)
!635 = !{!18, !351, !432, !467, !254, !468}
!636 = !{!637, !638, !639, !640, !641}
!637 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 1, scope: !633, file: !356, line: 392, type: !351)
!638 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 2, scope: !633, file: !356, line: 392, type: !432)
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inbuf", arg: 3, scope: !633, file: !356, line: 393, type: !467)
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inleft", arg: 4, scope: !633, file: !356, line: 393, type: !254)
!641 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "writer", arg: 5, scope: !633, file: !356, line: 394, type: !468)
!642 = !DISubprogram(name: "iso2022_decode_init", scope: !356, file: !356, line: 274, type: !455, isLocal: true, isDefinition: true, scopeLine: 275, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%union.MultibyteCodec_State*, i8*)* @iso2022_decode_init, variables: !643)
!643 = !{!644, !645}
!644 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !642, file: !356, line: 274, type: !432)
!645 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !642, file: !356, line: 274, type: !351)
!646 = !DISubprogram(name: "iso2022_decode_reset", scope: !356, file: !356, line: 283, type: !487, isLocal: true, isDefinition: true, scopeLine: 284, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%union.MultibyteCodec_State*, i8*)* @iso2022_decode_reset, variables: !647)
!647 = !{!648, !649}
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !646, file: !356, line: 283, type: !432)
!649 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !646, file: !356, line: 283, type: !351)
!650 = !DISubprogram(name: "jisx0208_init", scope: !356, file: !356, line: 608, type: !371, isLocal: true, isDefinition: true, scopeLine: 609, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @jisx0208_init, variables: !506)
!651 = !DISubprogram(name: "jisx0208_decoder", scope: !356, file: !356, line: 621, type: !376, isLocal: true, isDefinition: true, scopeLine: 622, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @jisx0208_decoder, variables: !652)
!652 = !{!653, !654}
!653 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !651, file: !356, line: 621, type: !379)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !651, file: !356, line: 623, type: !378)
!655 = !DISubprogram(name: "jisx0208_encoder", scope: !356, file: !356, line: 633, type: !384, isLocal: true, isDefinition: true, scopeLine: 634, flags: DIFlagPrototyped, isOptimized: true, function: i16 (i32*, i64*)* @jisx0208_encoder, variables: !656)
!656 = !{!657, !658, !659}
!657 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !655, file: !356, line: 633, type: !388)
!658 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 2, scope: !655, file: !356, line: 633, type: !254)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coded", scope: !655, file: !356, line: 635, type: !386)
!660 = !DISubprogram(name: "jisx0201_r_decoder", scope: !356, file: !356, line: 931, type: !376, isLocal: true, isDefinition: true, scopeLine: 932, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @jisx0201_r_decoder, variables: !661)
!661 = !{!662, !663}
!662 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !660, file: !356, line: 931, type: !379)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !660, file: !356, line: 933, type: !378)
!664 = !DISubprogram(name: "jisx0201_r_encoder", scope: !356, file: !356, line: 941, type: !384, isLocal: true, isDefinition: true, scopeLine: 942, flags: DIFlagPrototyped, isOptimized: true, function: i16 (i32*, i64*)* @jisx0201_r_encoder, variables: !665)
!665 = !{!666, !667, !668}
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !664, file: !356, line: 941, type: !388)
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 2, scope: !664, file: !356, line: 941, type: !254)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coded", scope: !664, file: !356, line: 943, type: !386)
!669 = !DISubprogram(name: "jisx0212_init", scope: !356, file: !356, line: 649, type: !371, isLocal: true, isDefinition: true, scopeLine: 650, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @jisx0212_init, variables: !506)
!670 = !DISubprogram(name: "jisx0212_decoder", scope: !356, file: !356, line: 662, type: !376, isLocal: true, isDefinition: true, scopeLine: 663, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @jisx0212_decoder, variables: !671)
!671 = !{!672, !673}
!672 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !670, file: !356, line: 662, type: !379)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !670, file: !356, line: 664, type: !378)
!674 = !DISubprogram(name: "jisx0212_encoder", scope: !356, file: !356, line: 672, type: !384, isLocal: true, isDefinition: true, scopeLine: 673, flags: DIFlagPrototyped, isOptimized: true, function: i16 (i32*, i64*)* @jisx0212_encoder, variables: !675)
!675 = !{!676, !677, !678}
!676 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !674, file: !356, line: 672, type: !388)
!677 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 2, scope: !674, file: !356, line: 672, type: !254)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coded", scope: !674, file: !356, line: 674, type: !386)
!679 = !DISubprogram(name: "gb2312_init", scope: !356, file: !356, line: 971, type: !371, isLocal: true, isDefinition: true, scopeLine: 972, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @gb2312_init, variables: !506)
!680 = !DISubprogram(name: "gb2312_decoder", scope: !356, file: !356, line: 984, type: !376, isLocal: true, isDefinition: true, scopeLine: 985, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @gb2312_decoder, variables: !681)
!681 = !{!682, !683}
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !680, file: !356, line: 984, type: !379)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !680, file: !356, line: 986, type: !378)
!684 = !DISubprogram(name: "gb2312_encoder", scope: !356, file: !356, line: 994, type: !384, isLocal: true, isDefinition: true, scopeLine: 995, flags: DIFlagPrototyped, isOptimized: true, function: i16 (i32*, i64*)* @gb2312_encoder, variables: !685)
!685 = !{!686, !687, !688}
!686 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !684, file: !356, line: 994, type: !388)
!687 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 2, scope: !684, file: !356, line: 994, type: !254)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coded", scope: !684, file: !356, line: 996, type: !386)
!689 = !DISubprogram(name: "dummy_decoder", scope: !356, file: !356, line: 1009, type: !376, isLocal: true, isDefinition: true, scopeLine: 1010, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @dummy_decoder, variables: !690)
!690 = !{!691}
!691 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !689, file: !356, line: 1009, type: !379)
!692 = !DISubprogram(name: "dummy_encoder", scope: !356, file: !356, line: 1015, type: !384, isLocal: true, isDefinition: true, scopeLine: 1016, flags: DIFlagPrototyped, isOptimized: true, function: i16 (i32*, i64*)* @dummy_encoder, variables: !693)
!693 = !{!694, !695}
!694 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !692, file: !356, line: 1015, type: !388)
!695 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 2, scope: !692, file: !356, line: 1015, type: !254)
!696 = !DISubprogram(name: "jisx0213_init", scope: !356, file: !356, line: 686, type: !371, isLocal: true, isDefinition: true, scopeLine: 687, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @jisx0213_init, variables: !506)
!697 = !DISubprogram(name: "jisx0213_2004_1_decoder", scope: !356, file: !356, line: 748, type: !376, isLocal: true, isDefinition: true, scopeLine: 749, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @jisx0213_2004_1_decoder, variables: !698)
!698 = !{!699, !700}
!699 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !697, file: !356, line: 748, type: !379)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !697, file: !356, line: 750, type: !378)
!701 = !DISubprogram(name: "jisx0213_2004_1_encoder_paironly", scope: !356, file: !356, line: 896, type: !384, isLocal: true, isDefinition: true, scopeLine: 897, flags: DIFlagPrototyped, isOptimized: true, function: i16 (i32*, i64*)* @jisx0213_2004_1_encoder_paironly, variables: !702)
!702 = !{!703, !704, !705, !706}
!703 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !701, file: !356, line: 896, type: !388)
!704 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 2, scope: !701, file: !356, line: 896, type: !254)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coded", scope: !701, file: !356, line: 898, type: !386)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ilength", scope: !701, file: !356, line: 899, type: !18)
!707 = !DISubprogram(name: "jisx0213_encoder", scope: !356, file: !356, line: 780, type: !708, isLocal: true, isDefinition: true, scopeLine: 781, flags: DIFlagPrototyped, isOptimized: true, function: i16 (i32*, i64*, i8*)* @jisx0213_encoder, variables: !710)
!708 = !DISubroutineType(types: !709)
!709 = !{!386, !388, !254, !11}
!710 = !{!711, !712, !713, !714}
!711 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !707, file: !356, line: 780, type: !388)
!712 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 2, scope: !707, file: !356, line: 780, type: !254)
!713 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 3, scope: !707, file: !356, line: 780, type: !11)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coded", scope: !707, file: !356, line: 782, type: !386)
!715 = !DISubprogram(name: "find_pairencmap", scope: !407, file: !407, line: 322, type: !716, isLocal: true, isDefinition: true, scopeLine: 324, flags: DIFlagPrototyped, isOptimized: true, function: i16 (i16, i16, %struct.pair_encodemap*, i32)* @find_pairencmap, variables: !724)
!716 = !DISubroutineType(types: !717)
!717 = !{!386, !399, !399, !718, !51}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64, align: 64)
!719 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !720)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "pair_encodemap", file: !407, line: 58, size: 64, align: 32, elements: !721)
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "uniseq", scope: !720, file: !407, line: 59, baseType: !378, size: 32, align: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !720, file: !407, line: 60, baseType: !386, size: 16, align: 16, offset: 32)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732}
!725 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "body", arg: 1, scope: !715, file: !407, line: 322, type: !399)
!726 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "modifier", arg: 2, scope: !715, file: !407, line: 322, type: !399)
!727 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "haystack", arg: 3, scope: !715, file: !407, line: 323, type: !718)
!728 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "haystacksize", arg: 4, scope: !715, file: !407, line: 323, type: !51)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !715, file: !407, line: 325, type: !51)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min", scope: !715, file: !407, line: 325, type: !51)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max", scope: !715, file: !407, line: 325, type: !51)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !715, file: !407, line: 326, type: !378)
!733 = !DISubprogram(name: "jisx0213_2004_1_encoder", scope: !356, file: !356, line: 884, type: !384, isLocal: true, isDefinition: true, scopeLine: 885, flags: DIFlagPrototyped, isOptimized: true, function: i16 (i32*, i64*)* @jisx0213_2004_1_encoder, variables: !734)
!734 = !{!735, !736, !737}
!735 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !733, file: !356, line: 884, type: !388)
!736 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 2, scope: !733, file: !356, line: 884, type: !254)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coded", scope: !733, file: !356, line: 886, type: !386)
!738 = !DISubprogram(name: "jisx0213_2004_2_decoder", scope: !356, file: !356, line: 767, type: !376, isLocal: true, isDefinition: true, scopeLine: 768, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @jisx0213_2004_2_decoder, variables: !739)
!739 = !{!740, !741}
!740 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !738, file: !356, line: 767, type: !379)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !738, file: !356, line: 769, type: !378)
!742 = !DISubprogram(name: "jisx0213_2004_2_encoder", scope: !356, file: !356, line: 919, type: !384, isLocal: true, isDefinition: true, scopeLine: 920, flags: DIFlagPrototyped, isOptimized: true, function: i16 (i32*, i64*)* @jisx0213_2004_2_encoder, variables: !743)
!743 = !{!744, !745, !746}
!744 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !742, file: !356, line: 919, type: !388)
!745 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 2, scope: !742, file: !356, line: 919, type: !254)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coded", scope: !742, file: !356, line: 921, type: !386)
!747 = !DISubprogram(name: "jisx0213_2000_1_decoder", scope: !356, file: !356, line: 713, type: !376, isLocal: true, isDefinition: true, scopeLine: 714, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @jisx0213_2000_1_decoder, variables: !748)
!748 = !{!749, !750}
!749 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !747, file: !356, line: 713, type: !379)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !747, file: !356, line: 715, type: !378)
!751 = !DISubprogram(name: "jisx0213_2000_1_encoder_paironly", scope: !356, file: !356, line: 849, type: !384, isLocal: true, isDefinition: true, scopeLine: 850, flags: DIFlagPrototyped, isOptimized: true, function: i16 (i32*, i64*)* @jisx0213_2000_1_encoder_paironly, variables: !752)
!752 = !{!753, !754, !755, !756}
!753 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !751, file: !356, line: 849, type: !388)
!754 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 2, scope: !751, file: !356, line: 849, type: !254)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coded", scope: !751, file: !356, line: 851, type: !386)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ilength", scope: !751, file: !356, line: 852, type: !18)
!757 = !DISubprogram(name: "jisx0213_2000_1_encoder", scope: !356, file: !356, line: 837, type: !384, isLocal: true, isDefinition: true, scopeLine: 838, flags: DIFlagPrototyped, isOptimized: true, function: i16 (i32*, i64*)* @jisx0213_2000_1_encoder, variables: !758)
!758 = !{!759, !760, !761}
!759 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !757, file: !356, line: 837, type: !388)
!760 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 2, scope: !757, file: !356, line: 837, type: !254)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coded", scope: !757, file: !356, line: 839, type: !386)
!762 = !DISubprogram(name: "jisx0213_2000_2_decoder", scope: !356, file: !356, line: 733, type: !376, isLocal: true, isDefinition: true, scopeLine: 734, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @jisx0213_2000_2_decoder, variables: !763)
!763 = !{!764, !765}
!764 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !762, file: !356, line: 733, type: !379)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !762, file: !356, line: 735, type: !378)
!766 = !DISubprogram(name: "jisx0213_2000_2_encoder", scope: !356, file: !356, line: 872, type: !384, isLocal: true, isDefinition: true, scopeLine: 873, flags: DIFlagPrototyped, isOptimized: true, function: i16 (i32*, i64*)* @jisx0213_2000_2_encoder, variables: !767)
!767 = !{!768, !769, !770}
!768 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !766, file: !356, line: 872, type: !388)
!769 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 2, scope: !766, file: !356, line: 872, type: !254)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coded", scope: !766, file: !356, line: 874, type: !386)
!771 = !DISubprogram(name: "jisx0201_k_decoder", scope: !356, file: !356, line: 951, type: !376, isLocal: true, isDefinition: true, scopeLine: 952, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @jisx0201_k_decoder, variables: !772)
!772 = !{!773, !774}
!773 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !771, file: !356, line: 951, type: !379)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !771, file: !356, line: 953, type: !378)
!775 = !DISubprogram(name: "jisx0201_k_encoder", scope: !356, file: !356, line: 961, type: !384, isLocal: true, isDefinition: true, scopeLine: 962, flags: DIFlagPrototyped, isOptimized: true, function: i16 (i32*, i64*)* @jisx0201_k_encoder, variables: !776)
!776 = !{!777, !778, !779}
!777 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !775, file: !356, line: 961, type: !388)
!778 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 2, scope: !775, file: !356, line: 961, type: !254)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coded", scope: !775, file: !356, line: 963, type: !386)
!780 = !DISubprogram(name: "register_maps", scope: !407, file: !407, line: 304, type: !151, isLocal: true, isDefinition: true, scopeLine: 305, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @register_maps, variables: !781)
!781 = !{!782, !783, !786, !793}
!782 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !780, file: !407, line: 304, type: !12)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "h", scope: !780, file: !407, line: 306, type: !784)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64, align: 64)
!785 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !522)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mhname", scope: !787, file: !407, line: 309, type: !790)
!787 = distinct !DILexicalBlock(scope: !788, file: !407, line: 308, column: 56)
!788 = distinct !DILexicalBlock(scope: !789, file: !407, line: 308, column: 5)
!789 = distinct !DILexicalBlock(scope: !780, file: !407, line: 308, column: 5)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 2048, align: 8, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 256)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !787, file: !407, line: 310, type: !51)
!794 = !{!795, !818, !820, !821, !822, !824, !825, !827, !828, !832, !836, !837, !839, !840, !841, !842, !843, !847, !848, !849, !850, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !868, !876, !877, !878, !879, !883, !884}
!795 = !DIGlobalVariable(name: "__module", scope: !0, file: !356, line: 1150, type: !796, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @__module)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !797, line: 47, size: 832, align: 64, elements: !798)
!797 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!798 = !{!799, !808, !809, !810, !811, !814, !815, !816, !817}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !796, file: !797, line: 48, baseType: !800, size: 320, align: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !797, line: 38, baseType: !801)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !797, line: 33, size: 320, align: 64, elements: !802)
!802 = !{!803, !804, !806, !807}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !801, file: !797, line: 34, baseType: !13, size: 128, align: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !801, file: !797, line: 35, baseType: !805, size: 64, align: 64, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !801, file: !797, line: 36, baseType: !18, size: 64, align: 64, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !801, file: !797, line: 37, baseType: !12, size: 64, align: 64, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !796, file: !797, line: 49, baseType: !36, size: 64, align: 64, offset: 320)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !796, file: !797, line: 50, baseType: !36, size: 64, align: 64, offset: 384)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !796, file: !797, line: 51, baseType: !18, size: 64, align: 64, offset: 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !796, file: !797, line: 52, baseType: !812, size: 64, align: 64, offset: 512)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64, align: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !288, line: 47, baseType: !287)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !796, file: !797, line: 53, baseType: !149, size: 64, align: 64, offset: 576)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !796, file: !797, line: 54, baseType: !266, size: 64, align: 64, offset: 640)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !796, file: !797, line: 55, baseType: !149, size: 64, align: 64, offset: 704)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !796, file: !797, line: 56, baseType: !336, size: 64, align: 64, offset: 768)
!818 = !DIGlobalVariable(name: "__methods", scope: !0, file: !407, line: 298, type: !819, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMethodDef]* @__methods)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 512, align: 64, elements: !448)
!820 = !DIGlobalVariable(name: "cofunc", scope: !498, file: !407, line: 246, type: !12, isLocal: true, isDefinition: true, variable: %struct._object** @getmultibytecodec.cofunc)
!821 = !DIGlobalVariable(name: "codec_list", scope: !0, file: !356, line: 1148, type: !415, isLocal: true, isDefinition: true, variable: %struct.MultibyteCodec** @codec_list)
!822 = !DIGlobalVariable(name: "_codec_list", scope: !0, file: !356, line: 1140, type: !823, isLocal: true, isDefinition: true, variable: [8 x %struct.MultibyteCodec]* @_codec_list)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 4608, align: 64, elements: !440)
!824 = !DIGlobalVariable(name: "iso2022_kr_config", scope: !0, file: !356, line: 1089, type: !354, isLocal: true, isDefinition: true, variable: %struct.iso2022_config* @iso2022_kr_config)
!825 = !DIGlobalVariable(name: "iso2022_kr_designations", scope: !0, file: !356, line: 1086, type: !826, isLocal: true, isDefinition: true, variable: [2 x %struct.iso2022_designation]* @iso2022_kr_designations)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 512, align: 64, elements: !448)
!827 = !DIGlobalVariable(name: "initialized", scope: !505, file: !356, line: 573, type: !51, isLocal: true, isDefinition: true, variable: i32* @ksx1001_init.initialized)
!828 = !DIGlobalVariable(name: "cp949_encmap", scope: !0, file: !356, line: 548, type: !829, isLocal: true, isDefinition: true, variable: %struct.unim_index** @cp949_encmap)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64, align: 64)
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "encode_map", file: !407, line: 45, baseType: !528)
!832 = !DIGlobalVariable(name: "ksx1001_decmap", scope: !0, file: !356, line: 549, type: !833, isLocal: true, isDefinition: true, variable: %struct.dbcs_index** @ksx1001_decmap)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64, align: 64)
!834 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "decode_map", file: !407, line: 33, baseType: !538)
!836 = !DIGlobalVariable(name: "iso2022_jp_config", scope: !0, file: !356, line: 1095, type: !354, isLocal: true, isDefinition: true, variable: %struct.iso2022_config* @iso2022_jp_config)
!837 = !DIGlobalVariable(name: "iso2022_jp_designations", scope: !0, file: !356, line: 1091, type: !838, isLocal: true, isDefinition: true, variable: [4 x %struct.iso2022_designation]* @iso2022_jp_designations)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 1024, align: 64, elements: !444)
!839 = !DIGlobalVariable(name: "initialized", scope: !650, file: !356, line: 610, type: !51, isLocal: true, isDefinition: true, variable: i32* @jisx0208_init.initialized)
!840 = !DIGlobalVariable(name: "jisxcommon_encmap", scope: !0, file: !356, line: 552, type: !829, isLocal: true, isDefinition: true, variable: %struct.unim_index** @jisxcommon_encmap)
!841 = !DIGlobalVariable(name: "jisx0208_decmap", scope: !0, file: !356, line: 553, type: !833, isLocal: true, isDefinition: true, variable: %struct.dbcs_index** @jisx0208_decmap)
!842 = !DIGlobalVariable(name: "iso2022_jp_1_config", scope: !0, file: !356, line: 1101, type: !354, isLocal: true, isDefinition: true, variable: %struct.iso2022_config* @iso2022_jp_1_config)
!843 = !DIGlobalVariable(name: "iso2022_jp_1_designations", scope: !0, file: !356, line: 1097, type: !844, isLocal: true, isDefinition: true, variable: [5 x %struct.iso2022_designation]* @iso2022_jp_1_designations)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 1280, align: 64, elements: !845)
!845 = !{!846}
!846 = !DISubrange(count: 5)
!847 = !DIGlobalVariable(name: "initialized", scope: !669, file: !356, line: 651, type: !51, isLocal: true, isDefinition: true, variable: i32* @jisx0212_init.initialized)
!848 = !DIGlobalVariable(name: "jisx0212_decmap", scope: !0, file: !356, line: 554, type: !833, isLocal: true, isDefinition: true, variable: %struct.dbcs_index** @jisx0212_decmap)
!849 = !DIGlobalVariable(name: "iso2022_jp_2_config", scope: !0, file: !356, line: 1108, type: !354, isLocal: true, isDefinition: true, variable: %struct.iso2022_config* @iso2022_jp_2_config)
!850 = !DIGlobalVariable(name: "iso2022_jp_2_designations", scope: !0, file: !356, line: 1103, type: !851, isLocal: true, isDefinition: true, variable: [9 x %struct.iso2022_designation]* @iso2022_jp_2_designations)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 2304, align: 64, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 9)
!854 = !DIGlobalVariable(name: "initialized", scope: !679, file: !356, line: 973, type: !51, isLocal: true, isDefinition: true, variable: i32* @gb2312_init.initialized)
!855 = !DIGlobalVariable(name: "gbcommon_encmap", scope: !0, file: !356, line: 563, type: !829, isLocal: true, isDefinition: true, variable: %struct.unim_index** @gbcommon_encmap)
!856 = !DIGlobalVariable(name: "gb2312_decmap", scope: !0, file: !356, line: 564, type: !833, isLocal: true, isDefinition: true, variable: %struct.dbcs_index** @gb2312_decmap)
!857 = !DIGlobalVariable(name: "iso2022_jp_2004_config", scope: !0, file: !356, line: 1114, type: !354, isLocal: true, isDefinition: true, variable: %struct.iso2022_config* @iso2022_jp_2004_config)
!858 = !DIGlobalVariable(name: "iso2022_jp_2004_designations", scope: !0, file: !356, line: 1110, type: !844, isLocal: true, isDefinition: true, variable: [5 x %struct.iso2022_designation]* @iso2022_jp_2004_designations)
!859 = !DIGlobalVariable(name: "initialized", scope: !696, file: !356, line: 688, type: !51, isLocal: true, isDefinition: true, variable: i32* @jisx0213_init.initialized)
!860 = !DIGlobalVariable(name: "jisx0213_bmp_encmap", scope: !0, file: !356, line: 555, type: !829, isLocal: true, isDefinition: true, variable: %struct.unim_index** @jisx0213_bmp_encmap)
!861 = !DIGlobalVariable(name: "jisx0213_1_bmp_decmap", scope: !0, file: !356, line: 556, type: !833, isLocal: true, isDefinition: true, variable: %struct.dbcs_index** @jisx0213_1_bmp_decmap)
!862 = !DIGlobalVariable(name: "jisx0213_2_bmp_decmap", scope: !0, file: !356, line: 557, type: !833, isLocal: true, isDefinition: true, variable: %struct.dbcs_index** @jisx0213_2_bmp_decmap)
!863 = !DIGlobalVariable(name: "jisx0213_emp_encmap", scope: !0, file: !356, line: 558, type: !829, isLocal: true, isDefinition: true, variable: %struct.unim_index** @jisx0213_emp_encmap)
!864 = !DIGlobalVariable(name: "jisx0213_1_emp_decmap", scope: !0, file: !356, line: 559, type: !833, isLocal: true, isDefinition: true, variable: %struct.dbcs_index** @jisx0213_1_emp_decmap)
!865 = !DIGlobalVariable(name: "jisx0213_2_emp_decmap", scope: !0, file: !356, line: 560, type: !833, isLocal: true, isDefinition: true, variable: %struct.dbcs_index** @jisx0213_2_emp_decmap)
!866 = !DIGlobalVariable(name: "jisx0213_pair_encmap", scope: !0, file: !867, line: 4, type: !718, isLocal: true, isDefinition: true, variable: %struct.pair_encodemap** @jisx0213_pair_encmap)
!867 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/cjkcodecs/mappings_jisx0213_pair.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!868 = !DIGlobalVariable(name: "jisx0213_pair_decmap", scope: !0, file: !867, line: 3, type: !869, isLocal: true, isDefinition: true, variable: %struct.widedbcs_index** @jisx0213_pair_decmap)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64, align: 64)
!870 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !871)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "widedbcs_index", file: !407, line: 35, size: 128, align: 64, elements: !872)
!872 = !{!873, !874, !875}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !871, file: !407, line: 36, baseType: !388, size: 64, align: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !871, file: !407, line: 37, baseType: !365, size: 8, align: 8, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !871, file: !407, line: 37, baseType: !365, size: 8, align: 8, offset: 72)
!876 = !DIGlobalVariable(name: "iso2022_jp_3_config", scope: !0, file: !356, line: 1120, type: !354, isLocal: true, isDefinition: true, variable: %struct.iso2022_config* @iso2022_jp_3_config)
!877 = !DIGlobalVariable(name: "iso2022_jp_3_designations", scope: !0, file: !356, line: 1116, type: !844, isLocal: true, isDefinition: true, variable: [5 x %struct.iso2022_designation]* @iso2022_jp_3_designations)
!878 = !DIGlobalVariable(name: "iso2022_jp_ext_config", scope: !0, file: !356, line: 1126, type: !354, isLocal: true, isDefinition: true, variable: %struct.iso2022_config* @iso2022_jp_ext_config)
!879 = !DIGlobalVariable(name: "iso2022_jp_ext_designations", scope: !0, file: !356, line: 1122, type: !880, isLocal: true, isDefinition: true, variable: [6 x %struct.iso2022_designation]* @iso2022_jp_ext_designations)
