; ModuleID = 'irs-onlybc/_codecsmodule.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !374, globals: !828)
!1 = !DIFile(filename: "_codecsmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !89, !343, !10, !94, !344, !352, !28, !371}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !6, line: 109, baseType: !7)
!6 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 105, size: 128, align: 64, elements: !8)
!8 = !{!9, !17}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !7, file: !6, line: 107, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !11, line: 177, baseType: !12)
!11 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !13, line: 102, baseType: !14)
!13 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !15, line: 181, baseType: !16)
!15 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!16 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !7, file: !6, line: 108, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !6, line: 334, size: 3200, align: 64, elements: !20)
!20 = !{!21, !27, !31, !32, !33, !38, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !291, !309, !310, !311, !313, !315, !316, !318, !323, !328, !333, !334, !335, !336, !337, !338, !339, !340, !342}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !19, file: !6, line: 335, baseType: !22, size: 192, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 114, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 111, size: 192, align: 64, elements: !24)
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !23, file: !6, line: 112, baseType: !5, size: 128, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !23, file: !6, line: 113, baseType: !10, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !19, file: !6, line: 336, baseType: !28, size: 64, align: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !19, file: !6, line: 337, baseType: !10, size: 64, align: 64, offset: 256)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !19, file: !6, line: 337, baseType: !10, size: 64, align: 64, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !19, file: !6, line: 341, baseType: !34, size: 64, align: 64, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 308, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !4}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !19, file: !6, line: 342, baseType: !39, size: 64, align: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !6, line: 314, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !4, !44, !43}
!43 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !13, line: 48, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 246, size: 1728, align: 64, elements: !48)
!47 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!48 = !{!49, !50, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !70, !71, !72, !73, !75, !77, !79, !83, !86, !88, !90, !91, !92, !93, !97, !98}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !46, file: !47, line: 247, baseType: !43, size: 32, align: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !46, file: !47, line: 252, baseType: !51, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !46, file: !47, line: 253, baseType: !51, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !46, file: !47, line: 254, baseType: !51, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !46, file: !47, line: 255, baseType: !51, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !46, file: !47, line: 256, baseType: !51, size: 64, align: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !46, file: !47, line: 257, baseType: !51, size: 64, align: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !46, file: !47, line: 258, baseType: !51, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !46, file: !47, line: 259, baseType: !51, size: 64, align: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !46, file: !47, line: 261, baseType: !51, size: 64, align: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !46, file: !47, line: 262, baseType: !51, size: 64, align: 64, offset: 640)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !46, file: !47, line: 263, baseType: !51, size: 64, align: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !46, file: !47, line: 265, baseType: !63, size: 64, align: 64, offset: 768)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !47, line: 161, size: 192, align: 64, elements: !65)
!65 = !{!66, !67, !69}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !64, file: !47, line: 162, baseType: !63, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !64, file: !47, line: 163, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !64, file: !47, line: 167, baseType: !43, size: 32, align: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !46, file: !47, line: 267, baseType: !68, size: 64, align: 64, offset: 832)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !46, file: !47, line: 269, baseType: !43, size: 32, align: 32, offset: 896)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !46, file: !47, line: 273, baseType: !43, size: 32, align: 32, offset: 928)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !46, file: !47, line: 275, baseType: !74, size: 64, align: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !15, line: 140, baseType: !16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !46, file: !47, line: 279, baseType: !76, size: 16, align: 16, offset: 1024)
!76 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !46, file: !47, line: 280, baseType: !78, size: 8, align: 8, offset: 1040)
!78 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !46, file: !47, line: 281, baseType: !80, size: 8, align: 8, offset: 1048)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 8, align: 8, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 1)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !46, file: !47, line: 285, baseType: !84, size: 64, align: 64, offset: 1088)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !47, line: 155, baseType: null)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !46, file: !47, line: 294, baseType: !87, size: 64, align: 64, offset: 1152)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !15, line: 141, baseType: !16)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !46, file: !47, line: 303, baseType: !89, size: 64, align: 64, offset: 1216)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !46, file: !47, line: 304, baseType: !89, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !46, file: !47, line: 305, baseType: !89, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !46, file: !47, line: 306, baseType: !89, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !46, file: !47, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !46, file: !47, line: 309, baseType: !43, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !46, file: !47, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !19, file: !6, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!4, !4, !51}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !19, file: !6, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!43, !4, !51, !4}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !19, file: !6, line: 345, baseType: !89, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !19, file: !6, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!4, !4}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !19, file: !6, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !6, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !6, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!4, !4, !4}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !6, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !6, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !6, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !6, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !6, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!4, !4, !4, !4}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !6, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !6, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !6, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !6, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!43, !4}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !6, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !6, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !6, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !6, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !6, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !6, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !6, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !6, line: 258, baseType: !89, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !6, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !6, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !6, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !6, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !6, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !6, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !6, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !6, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !6, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !6, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !6, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !6, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !6, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !6, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !6, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !6, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !19, file: !6, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !6, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !6, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!10, !4}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !6, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !6, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!4, !4, !10}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !6, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !6, line: 285, baseType: !89, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !6, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!43, !4, !10, !4}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !6, line: 287, baseType: !89, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !6, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!43, !4, !4}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !6, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !6, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !19, file: !6, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !6, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !6, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !6, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !6, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!43, !4, !4, !4}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !19, file: !6, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !4}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !11, line: 186, baseType: !10)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !19, file: !6, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !19, file: !6, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !19, file: !6, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !19, file: !6, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !19, file: !6, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !6, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !6, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !6, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!43, !4, !235, !43}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !6, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !6, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !6, line: 179, baseType: !89, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !6, line: 180, baseType: !4, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !6, line: 181, baseType: !10, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !6, line: 182, baseType: !10, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !6, line: 184, baseType: !43, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !6, line: 185, baseType: !43, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !6, line: 186, baseType: !51, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !6, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !6, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !6, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !6, line: 190, baseType: !89, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !6, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !6, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !4, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !19, file: !6, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !19, file: !6, line: 368, baseType: !28, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !19, file: !6, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!43, !4, !263, !89}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!43, !4, !89}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !19, file: !6, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !19, file: !6, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!4, !4, !4, !43}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !19, file: !6, line: 382, baseType: !10, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !19, file: !6, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !19, file: !6, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !19, file: !6, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !28, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !43, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !28, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !19, file: !6, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !6, line: 390, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !19, file: !6, line: 391, baseType: !292, size: 64, align: 64, offset: 1984)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !294, line: 11, size: 320, align: 64, elements: !295)
!294 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!295 = !{!296, !297, !302, !307, !308}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !293, file: !294, line: 12, baseType: !51, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !293, file: !294, line: 13, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !294, line: 8, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!4, !4, !89}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !293, file: !294, line: 14, baseType: !303, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !294, line: 9, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!43, !4, !4, !89}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !293, file: !294, line: 15, baseType: !51, size: 64, align: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !293, file: !294, line: 16, baseType: !89, size: 64, align: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !19, file: !6, line: 392, baseType: !18, size: 64, align: 64, offset: 2048)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !19, file: !6, line: 393, baseType: !4, size: 64, align: 64, offset: 2112)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !19, file: !6, line: 394, baseType: !312, size: 64, align: 64, offset: 2176)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 325, baseType: !134)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !19, file: !6, line: 395, baseType: !314, size: 64, align: 64, offset: 2240)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 326, baseType: !210)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !19, file: !6, line: 396, baseType: !10, size: 64, align: 64, offset: 2304)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !19, file: !6, line: 397, baseType: !317, size: 64, align: 64, offset: 2368)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 327, baseType: !210)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !19, file: !6, line: 398, baseType: !319, size: 64, align: 64, offset: 2432)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 329, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!4, !18, !10}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !19, file: !6, line: 399, baseType: !324, size: 64, align: 64, offset: 2496)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 328, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!4, !18, !4, !4}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !19, file: !6, line: 400, baseType: !329, size: 64, align: 64, offset: 2560)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 307, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !89}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !19, file: !6, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !19, file: !6, line: 402, baseType: !4, size: 64, align: 64, offset: 2688)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !19, file: !6, line: 403, baseType: !4, size: 64, align: 64, offset: 2752)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !19, file: !6, line: 404, baseType: !4, size: 64, align: 64, offset: 2816)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !19, file: !6, line: 405, baseType: !4, size: 64, align: 64, offset: 2880)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !19, file: !6, line: 406, baseType: !4, size: 64, align: 64, offset: 2944)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !19, file: !6, line: 407, baseType: !34, size: 64, align: 64, offset: 3008)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !19, file: !6, line: 410, baseType: !341, size: 32, align: 32, offset: 3072)
!341 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !19, file: !6, line: 412, baseType: !34, size: 64, align: 64, offset: 3136)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !346, line: 41, baseType: !347)
!346 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!347 = !DICompositeType(tag: DW_TAG_structure_type, file: !346, line: 31, size: 320, align: 64, elements: !348)
!348 = !{!349, !350, !351}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !347, file: !346, line: 32, baseType: !22, size: 192, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !347, file: !346, line: 33, baseType: !218, size: 64, align: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !347, file: !346, line: 34, baseType: !80, size: 8, align: 8, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !354, line: 351, baseType: !355)
!354 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!355 = !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 217, size: 384, align: 64, elements: !356)
!356 = !{!357, !358, !359, !360, !368}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !355, file: !354, line: 291, baseType: !5, size: 128, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !355, file: !354, line: 292, baseType: !10, size: 64, align: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !355, file: !354, line: 293, baseType: !218, size: 64, align: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !355, file: !354, line: 349, baseType: !361, size: 32, align: 32, offset: 256)
!361 = !DICompositeType(tag: DW_TAG_structure_type, scope: !355, file: !354, line: 294, size: 32, align: 32, elements: !362)
!362 = !{!363, !364, !365, !366, !367}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !361, file: !354, line: 303, baseType: !341, size: 2, align: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !361, file: !354, line: 331, baseType: !341, size: 3, align: 32, offset: 2)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !361, file: !354, line: 336, baseType: !341, size: 1, align: 32, offset: 5)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !361, file: !354, line: 340, baseType: !341, size: 1, align: 32, offset: 6)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !361, file: !354, line: 345, baseType: !341, size: 1, align: 32, offset: 7)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !355, file: !354, line: 350, baseType: !369, size: 64, align: 64, offset: 320)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !95, line: 90, baseType: !43)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!374 = !{!375, !379, !383, !388, !395, !402, !416, !423, !430, !446, !455, !471, !480, !497, !513, !529, !539, !549, !559, !572, !589, !605, !621, !631, !641, !651, !664, !680, !687, !701, !709, !725, !732, !748, !755, !771, !778, !795, !803, !808, !817, !823}
!375 = !DISubprogram(name: "PyInit__codecs", scope: !376, file: !376, line: 1187, type: !377, isLocal: false, isDefinition: true, scopeLine: 1188, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__codecs, variables: !2)
!376 = !DIFile(filename: "./Modules/_codecsmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!377 = !DISubroutineType(types: !378)
!378 = !{!4}
!379 = !DISubprogram(name: "codec_register", scope: !376, file: !376, line: 56, type: !126, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @codec_register, variables: !380)
!380 = !{!381, !382}
!381 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !379, file: !376, line: 56, type: !4)
!382 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "search_function", arg: 2, scope: !379, file: !376, line: 56, type: !4)
!383 = !DISubprogram(name: "codec_lookup", scope: !376, file: !376, line: 71, type: !126, isLocal: true, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @codec_lookup, variables: !384)
!384 = !{!385, !386, !387}
!385 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !383, file: !376, line: 71, type: !4)
!386 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !383, file: !376, line: 71, type: !4)
!387 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "encoding", scope: !383, file: !376, line: 73, type: !51)
!388 = !DISubprogram(name: "codec_encode", scope: !376, file: !376, line: 92, type: !126, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @codec_encode, variables: !389)
!389 = !{!390, !391, !392, !393, !394}
!390 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !388, file: !376, line: 92, type: !4)
!391 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !388, file: !376, line: 92, type: !4)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "encoding", scope: !388, file: !376, line: 94, type: !28)
!393 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !388, file: !376, line: 95, type: !28)
!394 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !388, file: !376, line: 96, type: !4)
!395 = !DISubprogram(name: "codec_decode", scope: !376, file: !376, line: 119, type: !126, isLocal: true, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @codec_decode, variables: !396)
!396 = !{!397, !398, !399, !400, !401}
!397 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !395, file: !376, line: 119, type: !4)
!398 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !395, file: !376, line: 119, type: !4)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "encoding", scope: !395, file: !376, line: 121, type: !28)
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !395, file: !376, line: 122, type: !28)
!401 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !395, file: !376, line: 123, type: !4)
!402 = !DISubprogram(name: "escape_encode", scope: !376, file: !376, line: 166, type: !126, isLocal: true, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @escape_encode, variables: !403)
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411, !414, !415}
!404 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !402, file: !376, line: 166, type: !4)
!405 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !402, file: !376, line: 167, type: !4)
!406 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !402, file: !376, line: 169, type: !4)
!407 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !402, file: !376, line: 170, type: !10)
!408 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newsize", scope: !402, file: !376, line: 171, type: !10)
!409 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !402, file: !376, line: 172, type: !28)
!410 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !402, file: !376, line: 173, type: !4)
!411 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !412, file: !376, line: 192, type: !10)
!412 = distinct !DILexicalBlock(scope: !413, file: !376, line: 191, column: 10)
!413 = distinct !DILexicalBlock(scope: !402, file: !376, line: 188, column: 9)
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !412, file: !376, line: 193, type: !30)
!415 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !412, file: !376, line: 194, type: !51)
!416 = !DISubprogram(name: "codec_tuple", scope: !376, file: !376, line: 138, type: !184, isLocal: true, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i64)* @codec_tuple, variables: !417)
!417 = !{!418, !419, !420, !421}
!418 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unicode", arg: 1, scope: !416, file: !376, line: 138, type: !4)
!419 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !416, file: !376, line: 139, type: !10)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !416, file: !376, line: 141, type: !4)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !422, file: !376, line: 145, type: !4)
!422 = distinct !DILexicalBlock(scope: !416, file: !376, line: 145, column: 8)
!423 = !DISubprogram(name: "escape_decode", scope: !376, file: !376, line: 151, type: !126, isLocal: true, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @escape_decode, variables: !424)
!424 = !{!425, !426, !427, !428, !429}
!425 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !423, file: !376, line: 151, type: !4)
!426 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !423, file: !376, line: 152, type: !4)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !423, file: !376, line: 154, type: !28)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !423, file: !376, line: 155, type: !28)
!429 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !423, file: !376, line: 156, type: !10)
!430 = !DISubprogram(name: "utf_8_encode", scope: !376, file: !376, line: 734, type: !126, isLocal: true, isDefinition: true, scopeLine: 736, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @utf_8_encode, variables: !431)
!431 = !{!432, !433, !434, !435, !436, !437, !441, !444}
!432 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !430, file: !376, line: 734, type: !4)
!433 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !430, file: !376, line: 735, type: !4)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !430, file: !376, line: 737, type: !4)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !430, file: !376, line: 737, type: !4)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !430, file: !376, line: 738, type: !28)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !438, file: !376, line: 746, type: !4)
!438 = distinct !DILexicalBlock(scope: !439, file: !376, line: 746, column: 12)
!439 = distinct !DILexicalBlock(scope: !440, file: !376, line: 745, column: 132)
!440 = distinct !DILexicalBlock(scope: !430, file: !376, line: 745, column: 9)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !442, file: !376, line: 746, type: !4)
!442 = distinct !DILexicalBlock(scope: !443, file: !376, line: 746, column: 99)
!443 = distinct !DILexicalBlock(scope: !438, file: !376, line: 746, column: 65)
!444 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !445, file: !376, line: 751, type: !4)
!445 = distinct !DILexicalBlock(scope: !430, file: !376, line: 751, column: 8)
!446 = !DISubprogram(name: "utf_8_decode", scope: !376, file: !376, line: 280, type: !126, isLocal: true, isDefinition: true, scopeLine: 282, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @utf_8_decode, variables: !447)
!447 = !{!448, !449, !450, !451, !452, !453, !454}
!448 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !446, file: !376, line: 280, type: !4)
!449 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !446, file: !376, line: 281, type: !4)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pbuf", scope: !446, file: !376, line: 283, type: !236)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !446, file: !376, line: 284, type: !28)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "final", scope: !446, file: !376, line: 285, type: !43)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "consumed", scope: !446, file: !376, line: 286, type: !10)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoded", scope: !446, file: !376, line: 287, type: !4)
!455 = !DISubprogram(name: "utf_7_encode", scope: !376, file: !376, line: 712, type: !126, isLocal: true, isDefinition: true, scopeLine: 714, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @utf_7_encode, variables: !456)
!456 = !{!457, !458, !459, !460, !461, !462, !466, !469}
!457 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !455, file: !376, line: 712, type: !4)
!458 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !455, file: !376, line: 713, type: !4)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !455, file: !376, line: 715, type: !4)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !455, file: !376, line: 715, type: !4)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !455, file: !376, line: 716, type: !28)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !463, file: !376, line: 724, type: !4)
!463 = distinct !DILexicalBlock(scope: !464, file: !376, line: 724, column: 12)
!464 = distinct !DILexicalBlock(scope: !465, file: !376, line: 723, column: 132)
!465 = distinct !DILexicalBlock(scope: !455, file: !376, line: 723, column: 9)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !467, file: !376, line: 724, type: !4)
!467 = distinct !DILexicalBlock(scope: !468, file: !376, line: 724, column: 99)
!468 = distinct !DILexicalBlock(scope: !463, file: !376, line: 724, column: 65)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !470, file: !376, line: 729, type: !4)
!470 = distinct !DILexicalBlock(scope: !455, file: !376, line: 729, column: 8)
!471 = !DISubprogram(name: "utf_7_decode", scope: !376, file: !376, line: 257, type: !126, isLocal: true, isDefinition: true, scopeLine: 259, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @utf_7_decode, variables: !472)
!472 = !{!473, !474, !475, !476, !477, !478, !479}
!473 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !471, file: !376, line: 257, type: !4)
!474 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !471, file: !376, line: 258, type: !4)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pbuf", scope: !471, file: !376, line: 260, type: !236)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !471, file: !376, line: 261, type: !28)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "final", scope: !471, file: !376, line: 262, type: !43)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "consumed", scope: !471, file: !376, line: 263, type: !10)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoded", scope: !471, file: !376, line: 264, type: !4)
!480 = !DISubprogram(name: "utf_16_encode", scope: !376, file: !376, line: 763, type: !126, isLocal: true, isDefinition: true, scopeLine: 765, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @utf_16_encode, variables: !481)
!481 = !{!482, !483, !484, !485, !486, !487, !488, !492, !495}
!482 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !480, file: !376, line: 763, type: !4)
!483 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !480, file: !376, line: 764, type: !4)
!484 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !480, file: !376, line: 766, type: !4)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !480, file: !376, line: 766, type: !4)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !480, file: !376, line: 767, type: !28)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "byteorder", scope: !480, file: !376, line: 768, type: !43)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !489, file: !376, line: 776, type: !4)
!489 = distinct !DILexicalBlock(scope: !490, file: !376, line: 776, column: 12)
!490 = distinct !DILexicalBlock(scope: !491, file: !376, line: 775, column: 132)
!491 = distinct !DILexicalBlock(scope: !480, file: !376, line: 775, column: 9)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !493, file: !376, line: 776, type: !4)
!493 = distinct !DILexicalBlock(scope: !494, file: !376, line: 776, column: 99)
!494 = distinct !DILexicalBlock(scope: !489, file: !376, line: 776, column: 65)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !496, file: !376, line: 781, type: !4)
!496 = distinct !DILexicalBlock(scope: !480, file: !376, line: 781, column: 8)
!497 = !DISubprogram(name: "utf_16_le_encode", scope: !376, file: !376, line: 786, type: !126, isLocal: true, isDefinition: true, scopeLine: 788, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @utf_16_le_encode, variables: !498)
!498 = !{!499, !500, !501, !502, !503, !504, !508, !511}
!499 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !497, file: !376, line: 786, type: !4)
!500 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !497, file: !376, line: 787, type: !4)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !497, file: !376, line: 789, type: !4)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !497, file: !376, line: 789, type: !4)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !497, file: !376, line: 790, type: !28)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !505, file: !376, line: 798, type: !4)
!505 = distinct !DILexicalBlock(scope: !506, file: !376, line: 798, column: 12)
!506 = distinct !DILexicalBlock(scope: !507, file: !376, line: 797, column: 132)
!507 = distinct !DILexicalBlock(scope: !497, file: !376, line: 797, column: 9)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !509, file: !376, line: 798, type: !4)
!509 = distinct !DILexicalBlock(scope: !510, file: !376, line: 798, column: 99)
!510 = distinct !DILexicalBlock(scope: !505, file: !376, line: 798, column: 65)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !512, file: !376, line: 803, type: !4)
!512 = distinct !DILexicalBlock(scope: !497, file: !376, line: 803, column: 8)
!513 = !DISubprogram(name: "utf_16_be_encode", scope: !376, file: !376, line: 808, type: !126, isLocal: true, isDefinition: true, scopeLine: 810, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @utf_16_be_encode, variables: !514)
!514 = !{!515, !516, !517, !518, !519, !520, !524, !527}
!515 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !513, file: !376, line: 808, type: !4)
!516 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !513, file: !376, line: 809, type: !4)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !513, file: !376, line: 811, type: !4)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !513, file: !376, line: 811, type: !4)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !513, file: !376, line: 812, type: !28)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !521, file: !376, line: 820, type: !4)
!521 = distinct !DILexicalBlock(scope: !522, file: !376, line: 820, column: 12)
!522 = distinct !DILexicalBlock(scope: !523, file: !376, line: 819, column: 132)
!523 = distinct !DILexicalBlock(scope: !513, file: !376, line: 819, column: 9)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !525, file: !376, line: 820, type: !4)
!525 = distinct !DILexicalBlock(scope: !526, file: !376, line: 820, column: 99)
!526 = distinct !DILexicalBlock(scope: !521, file: !376, line: 820, column: 65)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !528, file: !376, line: 825, type: !4)
!528 = distinct !DILexicalBlock(scope: !513, file: !376, line: 825, column: 8)
!529 = !DISubprogram(name: "utf_16_decode", scope: !376, file: !376, line: 303, type: !126, isLocal: true, isDefinition: true, scopeLine: 305, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @utf_16_decode, variables: !530)
!530 = !{!531, !532, !533, !534, !535, !536, !537, !538}
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !529, file: !376, line: 303, type: !4)
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !529, file: !376, line: 304, type: !4)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pbuf", scope: !529, file: !376, line: 306, type: !236)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !529, file: !376, line: 307, type: !28)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "byteorder", scope: !529, file: !376, line: 308, type: !43)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "final", scope: !529, file: !376, line: 309, type: !43)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "consumed", scope: !529, file: !376, line: 310, type: !10)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoded", scope: !529, file: !376, line: 311, type: !4)
!539 = !DISubprogram(name: "utf_16_le_decode", scope: !376, file: !376, line: 326, type: !126, isLocal: true, isDefinition: true, scopeLine: 328, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @utf_16_le_decode, variables: !540)
!540 = !{!541, !542, !543, !544, !545, !546, !547, !548}
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !539, file: !376, line: 326, type: !4)
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !539, file: !376, line: 327, type: !4)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pbuf", scope: !539, file: !376, line: 329, type: !236)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !539, file: !376, line: 330, type: !28)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "byteorder", scope: !539, file: !376, line: 331, type: !43)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "final", scope: !539, file: !376, line: 332, type: !43)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "consumed", scope: !539, file: !376, line: 333, type: !10)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoded", scope: !539, file: !376, line: 334, type: !4)
!549 = !DISubprogram(name: "utf_16_be_decode", scope: !376, file: !376, line: 350, type: !126, isLocal: true, isDefinition: true, scopeLine: 352, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @utf_16_be_decode, variables: !550)
!550 = !{!551, !552, !553, !554, !555, !556, !557, !558}
!551 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !549, file: !376, line: 350, type: !4)
!552 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !549, file: !376, line: 351, type: !4)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pbuf", scope: !549, file: !376, line: 353, type: !236)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !549, file: !376, line: 354, type: !28)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "byteorder", scope: !549, file: !376, line: 355, type: !43)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "final", scope: !549, file: !376, line: 356, type: !43)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "consumed", scope: !549, file: !376, line: 357, type: !10)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoded", scope: !549, file: !376, line: 358, type: !4)
!559 = !DISubprogram(name: "utf_16_ex_decode", scope: !376, file: !376, line: 382, type: !126, isLocal: true, isDefinition: true, scopeLine: 384, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @utf_16_ex_decode, variables: !560)
!560 = !{!561, !562, !563, !564, !565, !566, !567, !568, !569, !570}
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !559, file: !376, line: 382, type: !4)
!562 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !559, file: !376, line: 383, type: !4)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pbuf", scope: !559, file: !376, line: 385, type: !236)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !559, file: !376, line: 386, type: !28)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "byteorder", scope: !559, file: !376, line: 387, type: !43)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unicode", scope: !559, file: !376, line: 388, type: !4)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tuple", scope: !559, file: !376, line: 388, type: !4)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "final", scope: !559, file: !376, line: 389, type: !43)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "consumed", scope: !559, file: !376, line: 390, type: !10)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !571, file: !376, line: 402, type: !4)
!571 = distinct !DILexicalBlock(scope: !559, file: !376, line: 402, column: 8)
!572 = !DISubprogram(name: "utf_32_encode", scope: !376, file: !376, line: 837, type: !126, isLocal: true, isDefinition: true, scopeLine: 839, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @utf_32_encode, variables: !573)
!573 = !{!574, !575, !576, !577, !578, !579, !580, !584, !587}
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !572, file: !376, line: 837, type: !4)
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !572, file: !376, line: 838, type: !4)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !572, file: !376, line: 840, type: !4)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !572, file: !376, line: 840, type: !4)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !572, file: !376, line: 841, type: !28)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "byteorder", scope: !572, file: !376, line: 842, type: !43)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !581, file: !376, line: 850, type: !4)
!581 = distinct !DILexicalBlock(scope: !582, file: !376, line: 850, column: 12)
!582 = distinct !DILexicalBlock(scope: !583, file: !376, line: 849, column: 132)
!583 = distinct !DILexicalBlock(scope: !572, file: !376, line: 849, column: 9)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !585, file: !376, line: 850, type: !4)
!585 = distinct !DILexicalBlock(scope: !586, file: !376, line: 850, column: 99)
!586 = distinct !DILexicalBlock(scope: !581, file: !376, line: 850, column: 65)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !588, file: !376, line: 855, type: !4)
!588 = distinct !DILexicalBlock(scope: !572, file: !376, line: 855, column: 8)
!589 = !DISubprogram(name: "utf_32_le_encode", scope: !376, file: !376, line: 860, type: !126, isLocal: true, isDefinition: true, scopeLine: 862, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @utf_32_le_encode, variables: !590)
!590 = !{!591, !592, !593, !594, !595, !596, !600, !603}
!591 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !589, file: !376, line: 860, type: !4)
!592 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !589, file: !376, line: 861, type: !4)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !589, file: !376, line: 863, type: !4)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !589, file: !376, line: 863, type: !4)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !589, file: !376, line: 864, type: !28)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !597, file: !376, line: 872, type: !4)
!597 = distinct !DILexicalBlock(scope: !598, file: !376, line: 872, column: 12)
!598 = distinct !DILexicalBlock(scope: !599, file: !376, line: 871, column: 132)
!599 = distinct !DILexicalBlock(scope: !589, file: !376, line: 871, column: 9)
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !601, file: !376, line: 872, type: !4)
!601 = distinct !DILexicalBlock(scope: !602, file: !376, line: 872, column: 99)
!602 = distinct !DILexicalBlock(scope: !597, file: !376, line: 872, column: 65)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !604, file: !376, line: 877, type: !4)
!604 = distinct !DILexicalBlock(scope: !589, file: !376, line: 877, column: 8)
!605 = !DISubprogram(name: "utf_32_be_encode", scope: !376, file: !376, line: 882, type: !126, isLocal: true, isDefinition: true, scopeLine: 884, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @utf_32_be_encode, variables: !606)
!606 = !{!607, !608, !609, !610, !611, !612, !616, !619}
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !605, file: !376, line: 882, type: !4)
!608 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !605, file: !376, line: 883, type: !4)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !605, file: !376, line: 885, type: !4)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !605, file: !376, line: 885, type: !4)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !605, file: !376, line: 886, type: !28)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !613, file: !376, line: 894, type: !4)
!613 = distinct !DILexicalBlock(scope: !614, file: !376, line: 894, column: 12)
!614 = distinct !DILexicalBlock(scope: !615, file: !376, line: 893, column: 132)
!615 = distinct !DILexicalBlock(scope: !605, file: !376, line: 893, column: 9)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !617, file: !376, line: 894, type: !4)
!617 = distinct !DILexicalBlock(scope: !618, file: !376, line: 894, column: 99)
!618 = distinct !DILexicalBlock(scope: !613, file: !376, line: 894, column: 65)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !620, file: !376, line: 899, type: !4)
!620 = distinct !DILexicalBlock(scope: !605, file: !376, line: 899, column: 8)
!621 = !DISubprogram(name: "utf_32_decode", scope: !376, file: !376, line: 407, type: !126, isLocal: true, isDefinition: true, scopeLine: 409, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @utf_32_decode, variables: !622)
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630}
!623 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !621, file: !376, line: 407, type: !4)
!624 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !621, file: !376, line: 408, type: !4)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pbuf", scope: !621, file: !376, line: 410, type: !236)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !621, file: !376, line: 411, type: !28)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "byteorder", scope: !621, file: !376, line: 412, type: !43)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "final", scope: !621, file: !376, line: 413, type: !43)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "consumed", scope: !621, file: !376, line: 414, type: !10)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoded", scope: !621, file: !376, line: 415, type: !4)
!631 = !DISubprogram(name: "utf_32_le_decode", scope: !376, file: !376, line: 430, type: !126, isLocal: true, isDefinition: true, scopeLine: 432, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @utf_32_le_decode, variables: !632)
!632 = !{!633, !634, !635, !636, !637, !638, !639, !640}
!633 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !631, file: !376, line: 430, type: !4)
!634 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !631, file: !376, line: 431, type: !4)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pbuf", scope: !631, file: !376, line: 433, type: !236)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !631, file: !376, line: 434, type: !28)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "byteorder", scope: !631, file: !376, line: 435, type: !43)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "final", scope: !631, file: !376, line: 436, type: !43)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "consumed", scope: !631, file: !376, line: 437, type: !10)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoded", scope: !631, file: !376, line: 438, type: !4)
!641 = !DISubprogram(name: "utf_32_be_decode", scope: !376, file: !376, line: 453, type: !126, isLocal: true, isDefinition: true, scopeLine: 455, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @utf_32_be_decode, variables: !642)
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650}
!643 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !641, file: !376, line: 453, type: !4)
!644 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !641, file: !376, line: 454, type: !4)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pbuf", scope: !641, file: !376, line: 456, type: !236)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !641, file: !376, line: 457, type: !28)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "byteorder", scope: !641, file: !376, line: 458, type: !43)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "final", scope: !641, file: !376, line: 459, type: !43)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "consumed", scope: !641, file: !376, line: 460, type: !10)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoded", scope: !641, file: !376, line: 461, type: !4)
!651 = !DISubprogram(name: "utf_32_ex_decode", scope: !376, file: !376, line: 484, type: !126, isLocal: true, isDefinition: true, scopeLine: 486, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @utf_32_ex_decode, variables: !652)
!652 = !{!653, !654, !655, !656, !657, !658, !659, !660, !661, !662}
!653 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !651, file: !376, line: 484, type: !4)
!654 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !651, file: !376, line: 485, type: !4)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pbuf", scope: !651, file: !376, line: 487, type: !236)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !651, file: !376, line: 488, type: !28)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "byteorder", scope: !651, file: !376, line: 489, type: !43)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unicode", scope: !651, file: !376, line: 490, type: !4)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tuple", scope: !651, file: !376, line: 490, type: !4)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "final", scope: !651, file: !376, line: 491, type: !43)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "consumed", scope: !651, file: !376, line: 492, type: !10)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !663, file: !376, line: 504, type: !4)
!663 = distinct !DILexicalBlock(scope: !651, file: !376, line: 504, column: 8)
!664 = !DISubprogram(name: "unicode_escape_encode", scope: !376, file: !376, line: 904, type: !126, isLocal: true, isDefinition: true, scopeLine: 906, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @unicode_escape_encode, variables: !665)
!665 = !{!666, !667, !668, !669, !670, !671, !675, !678}
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !664, file: !376, line: 904, type: !4)
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !664, file: !376, line: 905, type: !4)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !664, file: !376, line: 907, type: !4)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !664, file: !376, line: 907, type: !4)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !664, file: !376, line: 908, type: !28)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !672, file: !376, line: 916, type: !4)
!672 = distinct !DILexicalBlock(scope: !673, file: !376, line: 916, column: 12)
!673 = distinct !DILexicalBlock(scope: !674, file: !376, line: 915, column: 132)
!674 = distinct !DILexicalBlock(scope: !664, file: !376, line: 915, column: 9)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !676, file: !376, line: 916, type: !4)
!676 = distinct !DILexicalBlock(scope: !677, file: !376, line: 916, column: 99)
!677 = distinct !DILexicalBlock(scope: !672, file: !376, line: 916, column: 65)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !679, file: !376, line: 921, type: !4)
!679 = distinct !DILexicalBlock(scope: !664, file: !376, line: 921, column: 8)
!680 = !DISubprogram(name: "unicode_escape_decode", scope: !376, file: !376, line: 509, type: !126, isLocal: true, isDefinition: true, scopeLine: 511, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @unicode_escape_decode, variables: !681)
!681 = !{!682, !683, !684, !685, !686}
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !680, file: !376, line: 509, type: !4)
!683 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !680, file: !376, line: 510, type: !4)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pbuf", scope: !680, file: !376, line: 512, type: !236)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !680, file: !376, line: 513, type: !28)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unicode", scope: !680, file: !376, line: 514, type: !4)
!687 = !DISubprogram(name: "unicode_internal_encode", scope: !376, file: !376, line: 672, type: !126, isLocal: true, isDefinition: true, scopeLine: 674, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @unicode_internal_encode, variables: !688)
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696}
!689 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !687, file: !376, line: 672, type: !4)
!690 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !687, file: !376, line: 673, type: !4)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !687, file: !376, line: 675, type: !4)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !687, file: !376, line: 676, type: !28)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !687, file: !376, line: 677, type: !28)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !687, file: !376, line: 678, type: !10)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !687, file: !376, line: 678, type: !10)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !697, file: !376, line: 690, type: !699)
!697 = distinct !DILexicalBlock(scope: !698, file: !376, line: 689, column: 77)
!698 = distinct !DILexicalBlock(scope: !687, file: !376, line: 689, column: 9)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UNICODE", file: !354, line: 93, baseType: !370)
!701 = !DISubprogram(name: "unicode_internal_decode", scope: !376, file: !376, line: 229, type: !126, isLocal: true, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @unicode_internal_decode, variables: !702)
!702 = !{!703, !704, !705, !706, !707, !708}
!703 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !701, file: !376, line: 229, type: !4)
!704 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !701, file: !376, line: 230, type: !4)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !701, file: !376, line: 232, type: !4)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !701, file: !376, line: 233, type: !28)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !701, file: !376, line: 234, type: !28)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !701, file: !376, line: 235, type: !10)
!709 = !DISubprogram(name: "raw_unicode_escape_encode", scope: !376, file: !376, line: 926, type: !126, isLocal: true, isDefinition: true, scopeLine: 928, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @raw_unicode_escape_encode, variables: !710)
!710 = !{!711, !712, !713, !714, !715, !716, !720, !723}
!711 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !709, file: !376, line: 926, type: !4)
!712 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !709, file: !376, line: 927, type: !4)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !709, file: !376, line: 929, type: !4)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !709, file: !376, line: 929, type: !4)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !709, file: !376, line: 930, type: !28)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !717, file: !376, line: 938, type: !4)
!717 = distinct !DILexicalBlock(scope: !718, file: !376, line: 938, column: 12)
!718 = distinct !DILexicalBlock(scope: !719, file: !376, line: 937, column: 132)
!719 = distinct !DILexicalBlock(scope: !709, file: !376, line: 937, column: 9)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !721, file: !376, line: 938, type: !4)
!721 = distinct !DILexicalBlock(scope: !722, file: !376, line: 938, column: 99)
!722 = distinct !DILexicalBlock(scope: !717, file: !376, line: 938, column: 65)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !724, file: !376, line: 943, type: !4)
!724 = distinct !DILexicalBlock(scope: !709, file: !376, line: 943, column: 8)
!725 = !DISubprogram(name: "raw_unicode_escape_decode", scope: !376, file: !376, line: 526, type: !126, isLocal: true, isDefinition: true, scopeLine: 528, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @raw_unicode_escape_decode, variables: !726)
!726 = !{!727, !728, !729, !730, !731}
!727 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !725, file: !376, line: 526, type: !4)
!728 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !725, file: !376, line: 527, type: !4)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pbuf", scope: !725, file: !376, line: 529, type: !236)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !725, file: !376, line: 530, type: !28)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unicode", scope: !725, file: !376, line: 531, type: !4)
!732 = !DISubprogram(name: "latin_1_encode", scope: !376, file: !376, line: 948, type: !126, isLocal: true, isDefinition: true, scopeLine: 950, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @latin_1_encode, variables: !733)
!733 = !{!734, !735, !736, !737, !738, !739, !743, !746}
!734 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !732, file: !376, line: 948, type: !4)
!735 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !732, file: !376, line: 949, type: !4)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !732, file: !376, line: 951, type: !4)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !732, file: !376, line: 951, type: !4)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !732, file: !376, line: 952, type: !28)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !740, file: !376, line: 960, type: !4)
!740 = distinct !DILexicalBlock(scope: !741, file: !376, line: 960, column: 12)
!741 = distinct !DILexicalBlock(scope: !742, file: !376, line: 959, column: 132)
!742 = distinct !DILexicalBlock(scope: !732, file: !376, line: 959, column: 9)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !744, file: !376, line: 960, type: !4)
!744 = distinct !DILexicalBlock(scope: !745, file: !376, line: 960, column: 99)
!745 = distinct !DILexicalBlock(scope: !740, file: !376, line: 960, column: 65)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !747, file: !376, line: 965, type: !4)
!747 = distinct !DILexicalBlock(scope: !732, file: !376, line: 965, column: 8)
!748 = !DISubprogram(name: "latin_1_decode", scope: !376, file: !376, line: 543, type: !126, isLocal: true, isDefinition: true, scopeLine: 545, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @latin_1_decode, variables: !749)
!749 = !{!750, !751, !752, !753, !754}
!750 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !748, file: !376, line: 543, type: !4)
!751 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !748, file: !376, line: 544, type: !4)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pbuf", scope: !748, file: !376, line: 546, type: !236)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unicode", scope: !748, file: !376, line: 547, type: !4)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !748, file: !376, line: 548, type: !28)
!755 = !DISubprogram(name: "ascii_encode", scope: !376, file: !376, line: 970, type: !126, isLocal: true, isDefinition: true, scopeLine: 972, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @ascii_encode, variables: !756)
!756 = !{!757, !758, !759, !760, !761, !762, !766, !769}
!757 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !755, file: !376, line: 970, type: !4)
!758 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !755, file: !376, line: 971, type: !4)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !755, file: !376, line: 973, type: !4)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !755, file: !376, line: 973, type: !4)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !755, file: !376, line: 974, type: !28)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !763, file: !376, line: 982, type: !4)
!763 = distinct !DILexicalBlock(scope: !764, file: !376, line: 982, column: 12)
!764 = distinct !DILexicalBlock(scope: !765, file: !376, line: 981, column: 132)
!765 = distinct !DILexicalBlock(scope: !755, file: !376, line: 981, column: 9)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !767, file: !376, line: 982, type: !4)
!767 = distinct !DILexicalBlock(scope: !768, file: !376, line: 982, column: 99)
!768 = distinct !DILexicalBlock(scope: !763, file: !376, line: 982, column: 65)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !770, file: !376, line: 987, type: !4)
!770 = distinct !DILexicalBlock(scope: !755, file: !376, line: 987, column: 8)
!771 = !DISubprogram(name: "ascii_decode", scope: !376, file: !376, line: 560, type: !126, isLocal: true, isDefinition: true, scopeLine: 562, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @ascii_decode, variables: !772)
!772 = !{!773, !774, !775, !776, !777}
!773 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !771, file: !376, line: 560, type: !4)
!774 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !771, file: !376, line: 561, type: !4)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pbuf", scope: !771, file: !376, line: 563, type: !236)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unicode", scope: !771, file: !376, line: 564, type: !4)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !771, file: !376, line: 565, type: !28)
!778 = !DISubprogram(name: "charmap_encode", scope: !376, file: !376, line: 992, type: !126, isLocal: true, isDefinition: true, scopeLine: 994, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @charmap_encode, variables: !779)
!779 = !{!780, !781, !782, !783, !784, !785, !786, !790, !793}
!780 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !778, file: !376, line: 992, type: !4)
!781 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !778, file: !376, line: 993, type: !4)
!782 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !778, file: !376, line: 995, type: !4)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !778, file: !376, line: 995, type: !4)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !778, file: !376, line: 996, type: !28)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapping", scope: !778, file: !376, line: 997, type: !4)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !787, file: !376, line: 1007, type: !4)
!787 = distinct !DILexicalBlock(scope: !788, file: !376, line: 1007, column: 12)
!788 = distinct !DILexicalBlock(scope: !789, file: !376, line: 1006, column: 132)
!789 = distinct !DILexicalBlock(scope: !778, file: !376, line: 1006, column: 9)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !791, file: !376, line: 1007, type: !4)
!791 = distinct !DILexicalBlock(scope: !792, file: !376, line: 1007, column: 99)
!792 = distinct !DILexicalBlock(scope: !787, file: !376, line: 1007, column: 65)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !794, file: !376, line: 1012, type: !4)
!794 = distinct !DILexicalBlock(scope: !778, file: !376, line: 1012, column: 8)
!795 = !DISubprogram(name: "charmap_decode", scope: !376, file: !376, line: 577, type: !126, isLocal: true, isDefinition: true, scopeLine: 579, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @charmap_decode, variables: !796)
!796 = !{!797, !798, !799, !800, !801, !802}
!797 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !795, file: !376, line: 577, type: !4)
!798 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !795, file: !376, line: 578, type: !4)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pbuf", scope: !795, file: !376, line: 580, type: !236)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unicode", scope: !795, file: !376, line: 581, type: !4)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !795, file: !376, line: 582, type: !28)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapping", scope: !795, file: !376, line: 583, type: !4)
!803 = !DISubprogram(name: "charmap_build", scope: !376, file: !376, line: 1017, type: !126, isLocal: true, isDefinition: true, scopeLine: 1018, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @charmap_build, variables: !804)
!804 = !{!805, !806, !807}
!805 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !803, file: !376, line: 1017, type: !4)
!806 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !803, file: !376, line: 1017, type: !4)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map", scope: !803, file: !376, line: 1019, type: !4)
!808 = !DISubprogram(name: "readbuffer_encode", scope: !376, file: !376, line: 651, type: !126, isLocal: true, isDefinition: true, scopeLine: 653, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @readbuffer_encode, variables: !809)
!809 = !{!810, !811, !812, !813, !814, !815, !816}
!810 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !808, file: !376, line: 651, type: !4)
!811 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !808, file: !376, line: 652, type: !4)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pdata", scope: !808, file: !376, line: 654, type: !236)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !808, file: !376, line: 655, type: !28)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !808, file: !376, line: 656, type: !10)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !808, file: !376, line: 657, type: !28)
!816 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !808, file: !376, line: 658, type: !4)
!817 = !DISubprogram(name: "register_error", scope: !376, file: !376, line: 1087, type: !126, isLocal: true, isDefinition: true, scopeLine: 1088, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @register_error, variables: !818)
!818 = !{!819, !820, !821, !822}
!819 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !817, file: !376, line: 1087, type: !4)
!820 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !817, file: !376, line: 1087, type: !4)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !817, file: !376, line: 1089, type: !28)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handler", scope: !817, file: !376, line: 1090, type: !4)
!823 = !DISubprogram(name: "lookup_error", scope: !376, file: !376, line: 1106, type: !126, isLocal: true, isDefinition: true, scopeLine: 1107, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @lookup_error, variables: !824)
!824 = !{!825, !826, !827}
!825 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !823, file: !376, line: 1106, type: !4)
!826 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !823, file: !376, line: 1106, type: !4)
!827 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !823, file: !376, line: 1108, type: !28)
!828 = !{!829, !852, !856, !860, !864, !868, !872, !876}
!829 = !DIGlobalVariable(name: "codecsmodule", scope: !0, file: !376, line: 1174, type: !830, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @codecsmodule)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !831, line: 47, size: 832, align: 64, elements: !832)
!831 = !DIFile(filename: "Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!832 = !{!833, !842, !843, !844, !845, !848, !849, !850, !851}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !830, file: !831, line: 48, baseType: !834, size: 320, align: 64)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !831, line: 38, baseType: !835)
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !831, line: 33, size: 320, align: 64, elements: !836)
!836 = !{!837, !838, !840, !841}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !835, file: !831, line: 34, baseType: !5, size: 128, align: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !835, file: !831, line: 35, baseType: !839, size: 64, align: 64, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !835, file: !831, line: 36, baseType: !10, size: 64, align: 64, offset: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !835, file: !831, line: 37, baseType: !4, size: 64, align: 64, offset: 256)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !830, file: !831, line: 49, baseType: !28, size: 64, align: 64, offset: 320)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !830, file: !831, line: 50, baseType: !28, size: 64, align: 64, offset: 384)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !830, file: !831, line: 51, baseType: !10, size: 64, align: 64, offset: 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !830, file: !831, line: 52, baseType: !846, size: 64, align: 64, offset: 512)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64, align: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !281, line: 47, baseType: !280)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !830, file: !831, line: 53, baseType: !142, size: 64, align: 64, offset: 576)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !830, file: !831, line: 54, baseType: !259, size: 64, align: 64, offset: 640)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !830, file: !831, line: 55, baseType: !142, size: 64, align: 64, offset: 704)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !830, file: !831, line: 56, baseType: !329, size: 64, align: 64, offset: 768)
!852 = !DIGlobalVariable(name: "_codecs_functions", scope: !0, file: !376, line: 1118, type: !853, isLocal: true, isDefinition: true, variable: [41 x %struct.PyMethodDef]* @_codecs_functions)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !847, size: 10496, align: 64, elements: !854)
!854 = !{!855}
!855 = !DISubrange(count: 41)
!856 = !DIGlobalVariable(name: "register__doc__", scope: !0, file: !376, line: 47, type: !857, isLocal: true, isDefinition: true, variable: [264 x i8]* @register__doc__)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 2112, align: 8, elements: !858)
!858 = !{!859}
!859 = !DISubrange(count: 264)
!860 = !DIGlobalVariable(name: "lookup__doc__", scope: !0, file: !376, line: 64, type: !861, isLocal: true, isDefinition: true, variable: [115 x i8]* @lookup__doc__)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 920, align: 8, elements: !862)
!862 = !{!863}
!863 = !DISubrange(count: 115)
!864 = !DIGlobalVariable(name: "encode__doc__", scope: !0, file: !376, line: 81, type: !865, isLocal: true, isDefinition: true, variable: [434 x i8]* @encode__doc__)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 3472, align: 8, elements: !866)
!866 = !{!867}
!867 = !DISubrange(count: 434)
!868 = !DIGlobalVariable(name: "decode__doc__", scope: !0, file: !376, line: 108, type: !869, isLocal: true, isDefinition: true, variable: [420 x i8]* @decode__doc__)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 3360, align: 8, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 420)
!872 = !DIGlobalVariable(name: "register_error__doc__", scope: !0, file: !376, line: 1078, type: !873, isLocal: true, isDefinition: true, variable: [301 x i8]* @register_error__doc__)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 2408, align: 8, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 301)
!876 = !DIGlobalVariable(name: "lookup_error__doc__", scope: !0, file: !376, line: 1100, type: !877, isLocal: true, isDefinition: true, variable: [158 x i8]* @lookup_error__doc__)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 1264, align: 8, elements: !878)
!878 = !{!879}
