; ModuleID = 'irs-onlybc/_codecs_hk.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !366, globals: !587)
!1 = !DIFile(filename: "_codecs_hk.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !12, !350, !59, !353, !354, !358, !361, !357, !356, !363, !360, !364, !365}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !14, line: 109, baseType: !15)
!14 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !14, line: 105, size: 128, align: 64, elements: !16)
!16 = !{!17, !25}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !15, file: !14, line: 107, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !19, line: 177, baseType: !20)
!19 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !21, line: 102, baseType: !22)
!21 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !23, line: 181, baseType: !24)
!23 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!24 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !15, file: !14, line: 108, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !14, line: 334, size: 3200, align: 64, elements: !28)
!28 = !{!29, !35, !39, !40, !41, !46, !109, !114, !119, !120, !125, !177, !208, !220, !226, !227, !228, !230, !232, !263, !264, !265, !274, !275, !280, !281, !283, !285, !295, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !27, file: !14, line: 335, baseType: !30, size: 192, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !14, line: 114, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 111, size: 192, align: 64, elements: !32)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !14, line: 112, baseType: !13, size: 128, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !31, file: !14, line: 113, baseType: !18, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !27, file: !14, line: 336, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !27, file: !14, line: 341, baseType: !42, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !14, line: 308, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !12}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !27, file: !14, line: 342, baseType: !47, size: 64, align: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !14, line: 314, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !12, !52, !51}
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !21, line: 48, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !55, line: 246, size: 1728, align: 64, elements: !56)
!55 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!56 = !{!57, !58, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !78, !79, !80, !81, !83, !85, !87, !91, !94, !96, !97, !98, !99, !100, !104, !105}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !54, file: !55, line: 247, baseType: !51, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !54, file: !55, line: 252, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !54, file: !55, line: 253, baseType: !59, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !54, file: !55, line: 254, baseType: !59, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !54, file: !55, line: 255, baseType: !59, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !54, file: !55, line: 256, baseType: !59, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !54, file: !55, line: 257, baseType: !59, size: 64, align: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !54, file: !55, line: 258, baseType: !59, size: 64, align: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !54, file: !55, line: 259, baseType: !59, size: 64, align: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !54, file: !55, line: 261, baseType: !59, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !54, file: !55, line: 262, baseType: !59, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !54, file: !55, line: 263, baseType: !59, size: 64, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !54, file: !55, line: 265, baseType: !71, size: 64, align: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !55, line: 161, size: 192, align: 64, elements: !73)
!73 = !{!74, !75, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !72, file: !55, line: 162, baseType: !71, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !72, file: !55, line: 163, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !72, file: !55, line: 167, baseType: !51, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !54, file: !55, line: 267, baseType: !76, size: 64, align: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !54, file: !55, line: 269, baseType: !51, size: 32, align: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !54, file: !55, line: 273, baseType: !51, size: 32, align: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !54, file: !55, line: 275, baseType: !82, size: 64, align: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !23, line: 140, baseType: !24)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !54, file: !55, line: 279, baseType: !84, size: 16, align: 16, offset: 1024)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !54, file: !55, line: 280, baseType: !86, size: 8, align: 8, offset: 1040)
!86 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !54, file: !55, line: 281, baseType: !88, size: 8, align: 8, offset: 1048)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !54, file: !55, line: 285, baseType: !92, size: 64, align: 64, offset: 1088)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !55, line: 155, baseType: null)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !54, file: !55, line: 294, baseType: !95, size: 64, align: 64, offset: 1152)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !23, line: 141, baseType: !24)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !54, file: !55, line: 303, baseType: !11, size: 64, align: 64, offset: 1216)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !54, file: !55, line: 304, baseType: !11, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !54, file: !55, line: 305, baseType: !11, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !54, file: !55, line: 306, baseType: !11, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !54, file: !55, line: 307, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !54, file: !55, line: 309, baseType: !51, size: 32, align: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !54, file: !55, line: 311, baseType: !106, size: 160, align: 8, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !27, file: !14, line: 343, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !14, line: 316, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!12, !12, !59}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !27, file: !14, line: 344, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !14, line: 318, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!51, !12, !59, !12}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !27, file: !14, line: 345, baseType: !11, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !27, file: !14, line: 346, baseType: !121, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !14, line: 320, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!12, !12}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !27, file: !14, line: 350, baseType: !126, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !14, line: 278, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 236, size: 2176, align: 64, elements: !129)
!129 = !{!130, !135, !136, !137, !138, !139, !144, !146, !147, !148, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !128, file: !14, line: 241, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !14, line: 166, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!12, !12, !12}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !128, file: !14, line: 242, baseType: !131, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !128, file: !14, line: 243, baseType: !131, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !128, file: !14, line: 244, baseType: !131, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !128, file: !14, line: 245, baseType: !131, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !128, file: !14, line: 246, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !14, line: 167, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!12, !12, !12, !12}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !128, file: !14, line: 247, baseType: !145, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !14, line: 165, baseType: !122)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !128, file: !14, line: 248, baseType: !145, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !128, file: !14, line: 249, baseType: !145, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !128, file: !14, line: 250, baseType: !149, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !14, line: 168, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!51, !12}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !128, file: !14, line: 251, baseType: !145, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !128, file: !14, line: 252, baseType: !131, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !128, file: !14, line: 253, baseType: !131, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !128, file: !14, line: 254, baseType: !131, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !128, file: !14, line: 255, baseType: !131, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !128, file: !14, line: 256, baseType: !131, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !128, file: !14, line: 257, baseType: !145, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !128, file: !14, line: 258, baseType: !11, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !128, file: !14, line: 259, baseType: !145, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !128, file: !14, line: 261, baseType: !131, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !128, file: !14, line: 262, baseType: !131, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !128, file: !14, line: 263, baseType: !131, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !128, file: !14, line: 264, baseType: !131, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !128, file: !14, line: 265, baseType: !140, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !128, file: !14, line: 266, baseType: !131, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !128, file: !14, line: 267, baseType: !131, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !128, file: !14, line: 268, baseType: !131, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !128, file: !14, line: 269, baseType: !131, size: 64, align: 64, offset: 1728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !128, file: !14, line: 270, baseType: !131, size: 64, align: 64, offset: 1792)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !128, file: !14, line: 272, baseType: !131, size: 64, align: 64, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !128, file: !14, line: 273, baseType: !131, size: 64, align: 64, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !128, file: !14, line: 274, baseType: !131, size: 64, align: 64, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !128, file: !14, line: 275, baseType: !131, size: 64, align: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !128, file: !14, line: 277, baseType: !145, size: 64, align: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !27, file: !14, line: 351, baseType: !178, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !14, line: 292, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 280, size: 640, align: 64, elements: !181)
!181 = !{!182, !187, !188, !193, !194, !195, !200, !201, !206, !207}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !180, file: !14, line: 281, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !14, line: 169, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!18, !12}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !180, file: !14, line: 282, baseType: !131, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !180, file: !14, line: 283, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !14, line: 170, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!12, !12, !18}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !180, file: !14, line: 284, baseType: !189, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !180, file: !14, line: 285, baseType: !11, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !180, file: !14, line: 286, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !14, line: 172, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!51, !12, !18, !12}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !180, file: !14, line: 287, baseType: !11, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !180, file: !14, line: 288, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !14, line: 231, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!51, !12, !12}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !180, file: !14, line: 290, baseType: !131, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !180, file: !14, line: 291, baseType: !189, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !27, file: !14, line: 352, baseType: !209, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !14, line: 298, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 294, size: 192, align: 64, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !211, file: !14, line: 295, baseType: !183, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !211, file: !14, line: 296, baseType: !131, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !211, file: !14, line: 297, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !14, line: 174, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!51, !12, !12, !12}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !27, file: !14, line: 356, baseType: !221, size: 64, align: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !14, line: 321, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !12}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !19, line: 186, baseType: !18)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !27, file: !14, line: 357, baseType: !140, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !27, file: !14, line: 358, baseType: !121, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !27, file: !14, line: 359, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !14, line: 317, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !27, file: !14, line: 360, baseType: !231, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !14, line: 319, baseType: !217)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !27, file: !14, line: 363, baseType: !233, size: 64, align: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !14, line: 304, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 301, size: 128, align: 64, elements: !236)
!236 = !{!237, !258}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !235, file: !14, line: 302, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !14, line: 193, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!51, !12, !242, !51}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !14, line: 191, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !14, line: 178, size: 640, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !255, !256, !257}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !244, file: !14, line: 179, baseType: !11, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !244, file: !14, line: 180, baseType: !12, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !14, line: 181, baseType: !18, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !244, file: !14, line: 182, baseType: !18, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !244, file: !14, line: 184, baseType: !51, size: 32, align: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !244, file: !14, line: 185, baseType: !51, size: 32, align: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !244, file: !14, line: 186, baseType: !59, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !244, file: !14, line: 187, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !244, file: !14, line: 188, baseType: !254, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !244, file: !14, line: 189, baseType: !254, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !244, file: !14, line: 190, baseType: !11, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !235, file: !14, line: 303, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !14, line: 194, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !12, !242}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !27, file: !14, line: 366, baseType: !103, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !27, file: !14, line: 368, baseType: !36, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !27, file: !14, line: 372, baseType: !266, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !14, line: 233, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!51, !12, !270, !11}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !14, line: 232, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!51, !12, !11}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !27, file: !14, line: 375, baseType: !149, size: 64, align: 64, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !27, file: !14, line: 379, baseType: !276, size: 64, align: 64, offset: 1600)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !14, line: 322, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!12, !12, !12, !51}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !27, file: !14, line: 382, baseType: !18, size: 64, align: 64, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !27, file: !14, line: 385, baseType: !282, size: 64, align: 64, offset: 1728)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !14, line: 323, baseType: !122)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !27, file: !14, line: 386, baseType: !284, size: 64, align: 64, offset: 1792)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !14, line: 324, baseType: !122)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !27, file: !14, line: 389, baseType: !286, size: 64, align: 64, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 40, size: 256, align: 64, elements: !289)
!288 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 41, baseType: !36, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 18, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 43, baseType: !51, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 45, baseType: !36, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !27, file: !14, line: 390, baseType: !296, size: 64, align: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !14, line: 390, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !27, file: !14, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !59, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!12, !12, !11}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!51, !12, !12, !11}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !59, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !11, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !27, file: !14, line: 392, baseType: !26, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !27, file: !14, line: 393, baseType: !12, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !27, file: !14, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !14, line: 325, baseType: !141)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !27, file: !14, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !14, line: 326, baseType: !217)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !27, file: !14, line: 396, baseType: !18, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !27, file: !14, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !14, line: 327, baseType: !217)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !27, file: !14, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !14, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!12, !26, !18}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !27, file: !14, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !14, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!12, !26, !12, !12}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !27, file: !14, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !14, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !11}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !27, file: !14, line: 401, baseType: !149, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !27, file: !14, line: 402, baseType: !12, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !27, file: !14, line: 403, baseType: !12, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !27, file: !14, line: 404, baseType: !12, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !27, file: !14, line: 405, baseType: !12, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !27, file: !14, line: 406, baseType: !12, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !27, file: !14, line: 407, baseType: !42, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !27, file: !14, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !27, file: !14, line: 412, baseType: !42, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !348)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !357)
!357 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !84)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!366 = !{!367, !373, !469, !476, !479, !524, !546, !573}
!367 = !DISubprogram(name: "PyInit__codecs_hk", scope: !368, file: !368, line: 191, type: !369, isLocal: false, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__codecs_hk, variables: !371)
!368 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/cjkcodecs/_codecs_hk.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!369 = !DISubroutineType(types: !370)
!370 = !{!12}
!371 = !{!372}
!372 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !367, file: !368, line: 191, type: !12)
!373 = !DISubprogram(name: "getcodec", scope: !374, file: !374, line: 259, type: !133, isLocal: true, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @getcodec, variables: !375)
!374 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/cjkcodecs/cjkcodecs.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!375 = !{!376, !377, !378, !379, !380, !381, !460, !461, !466, !467}
!376 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !373, file: !374, line: 259, type: !12)
!377 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 2, scope: !373, file: !374, line: 259, type: !12)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codecobj", scope: !373, file: !374, line: 261, type: !12)
!379 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !373, file: !374, line: 261, type: !12)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cofunc", scope: !373, file: !374, line: 261, type: !12)
!381 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codec", scope: !373, file: !374, line: 262, type: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "MultibyteCodec", file: !385, line: 58, baseType: !386)
!385 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/cjkcodecs/multibytecodec.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!386 = !DICompositeType(tag: DW_TAG_structure_type, file: !385, line: 48, size: 576, align: 64, elements: !387)
!387 = !{!388, !389, !390, !395, !421, !426, !431, !453, !455}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !386, file: !385, line: 49, baseType: !36, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !386, file: !385, line: 50, baseType: !351, size: 64, align: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "codecinit", scope: !386, file: !385, line: 51, baseType: !391, size: 64, align: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbcodec_init", file: !385, line: 27, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!51, !351}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "encode", scope: !386, file: !385, line: 52, baseType: !396, size: 64, align: 64, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbencode_func", file: !385, line: 28, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!18, !400, !351, !51, !11, !254, !18, !419, !18, !51}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "MultibyteCodec_State", file: !385, line: 25, baseType: !402)
!402 = !DICompositeType(tag: DW_TAG_union_type, file: !385, line: 19, size: 64, align: 64, elements: !403)
!403 = !{!404, !405, !406, !410, !415}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !402, file: !385, line: 20, baseType: !11, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !402, file: !385, line: 21, baseType: !51, size: 32, align: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !402, file: !385, line: 22, baseType: !407, size: 64, align: 8)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 64, align: 8, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 8)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "u2", scope: !402, file: !385, line: 23, baseType: !411, size: 64, align: 16)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 64, align: 16, elements: !413)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs2_t", file: !385, line: 16, baseType: !84)
!413 = !{!414}
!414 = !DISubrange(count: 4)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "u4", scope: !402, file: !385, line: 24, baseType: !416, size: 64, align: 32)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 64, align: 32, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 2)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "encinit", scope: !386, file: !385, line: 53, baseType: !422, size: 64, align: 64, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbencodeinit_func", file: !385, line: 34, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!51, !400, !351}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "encreset", scope: !386, file: !385, line: 54, baseType: !427, size: 64, align: 64, offset: 320)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbencodereset_func", file: !385, line: 36, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!18, !400, !351, !419, !18}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !386, file: !385, line: 55, baseType: !432, size: 64, align: 64, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbdecode_func", file: !385, line: 39, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!18, !400, !351, !436, !18, !439}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !357)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyUnicodeWriter", file: !4, line: 917, baseType: !441)
!441 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 897, size: 448, align: 64, elements: !442)
!442 = !{!443, !444, !445, !446, !447, !448, !449, !450, !451, !452}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !441, file: !4, line: 898, baseType: !12, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !441, file: !4, line: 899, baseType: !11, size: 64, align: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !441, file: !4, line: 900, baseType: !3, size: 32, align: 32, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "maxchar", scope: !441, file: !4, line: 901, baseType: !353, size: 32, align: 32, offset: 160)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !441, file: !4, line: 902, baseType: !18, size: 64, align: 64, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !441, file: !4, line: 903, baseType: !18, size: 64, align: 64, offset: 256)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "min_length", scope: !441, file: !4, line: 906, baseType: !18, size: 64, align: 64, offset: 320)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "min_char", scope: !441, file: !4, line: 909, baseType: !353, size: 32, align: 32, offset: 384)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "overallocate", scope: !441, file: !4, line: 912, baseType: !357, size: 8, align: 8, offset: 416)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !441, file: !4, line: 916, baseType: !357, size: 8, align: 8, offset: 424)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "decinit", scope: !386, file: !385, line: 56, baseType: !454, size: 64, align: 64, offset: 448)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbdecodeinit_func", file: !385, line: 43, baseType: !423)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "decreset", scope: !386, file: !385, line: 57, baseType: !456, size: 64, align: 64, offset: 512)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbdecodereset_func", file: !385, line: 45, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!18, !400, !351}
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "enc", scope: !373, file: !374, line: 263, type: !36)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !462, file: !374, line: 279, type: !101)
!462 = distinct !DILexicalBlock(scope: !463, file: !374, line: 279, column: 28)
!463 = distinct !DILexicalBlock(scope: !464, file: !374, line: 279, column: 13)
!464 = distinct !DILexicalBlock(scope: !465, file: !374, line: 278, column: 5)
!465 = distinct !DILexicalBlock(scope: !373, file: !374, line: 278, column: 5)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !462, file: !374, line: 279, type: !101)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !468, file: !374, line: 293, type: !12)
!468 = distinct !DILexicalBlock(scope: !373, file: !374, line: 293, column: 8)
!469 = !DISubprogram(name: "getmultibytecodec", scope: !374, file: !374, line: 244, type: !369, isLocal: true, isDefinition: true, scopeLine: 245, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @getmultibytecodec, variables: !470)
!470 = !{!471, !474}
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !472, file: !374, line: 249, type: !12)
!472 = distinct !DILexicalBlock(scope: !473, file: !374, line: 248, column: 31)
!473 = distinct !DILexicalBlock(scope: !469, file: !374, line: 248, column: 9)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !475, file: !374, line: 253, type: !12)
!475 = distinct !DILexicalBlock(scope: !472, file: !374, line: 253, column: 12)
!476 = !DISubprogram(name: "big5hkscs_codec_init", scope: !368, file: !368, line: 19, type: !393, isLocal: true, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @big5hkscs_codec_init, variables: !477)
!477 = !{!478}
!478 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 1, scope: !476, file: !368, line: 19, type: !351)
!479 = !DISubprogram(name: "importmap", scope: !374, file: !374, line: 356, type: !480, isLocal: true, isDefinition: true, scopeLine: 358, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*, i8**, i8**)* @importmap, variables: !482)
!480 = !DISubroutineType(types: !481)
!481 = !{!51, !36, !36, !350, !350}
!482 = !{!483, !484, !485, !486, !487, !488, !489, !518, !520, !522}
!483 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "modname", arg: 1, scope: !479, file: !374, line: 356, type: !36)
!484 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "symbol", arg: 2, scope: !479, file: !374, line: 356, type: !36)
!485 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encmap", arg: 3, scope: !479, file: !374, line: 357, type: !350)
!486 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "decmap", arg: 4, scope: !479, file: !374, line: 357, type: !350)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !479, file: !374, line: 359, type: !12)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !479, file: !374, line: 359, type: !12)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map", scope: !490, file: !374, line: 374, type: !493)
!490 = distinct !DILexicalBlock(scope: !491, file: !374, line: 373, column: 10)
!491 = distinct !DILexicalBlock(scope: !492, file: !374, line: 368, column: 14)
!492 = distinct !DILexicalBlock(scope: !479, file: !374, line: 366, column: 9)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "dbcs_map", file: !374, line: 52, size: 192, align: 64, elements: !495)
!495 = !{!496, !497, !508}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !494, file: !374, line: 53, baseType: !36, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "encmap", scope: !494, file: !374, line: 54, baseType: !498, size: 64, align: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !500)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "unim_index", file: !374, line: 41, size: 128, align: 64, elements: !501)
!501 = !{!502, !506, !507}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !500, file: !374, line: 42, baseType: !503, size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "DBCHAR", file: !385, line: 16, baseType: !84)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !500, file: !374, line: 43, baseType: !357, size: 8, align: 8, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !500, file: !374, line: 43, baseType: !357, size: 8, align: 8, offset: 72)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "decmap", scope: !494, file: !374, line: 55, baseType: !509, size: 64, align: 64, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !511)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "dbcs_index", file: !374, line: 29, size: 128, align: 64, elements: !512)
!512 = !{!513, !516, !517}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !511, file: !374, line: 30, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !412)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !511, file: !374, line: 31, baseType: !357, size: 8, align: 8, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !511, file: !374, line: 31, baseType: !357, size: 8, align: 8, offset: 72)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !519, file: !374, line: 380, type: !12)
!519 = distinct !DILexicalBlock(scope: !490, file: !374, line: 380, column: 12)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !521, file: !374, line: 383, type: !12)
!521 = distinct !DILexicalBlock(scope: !479, file: !374, line: 383, column: 8)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !523, file: !374, line: 387, type: !12)
!523 = distinct !DILexicalBlock(scope: !479, file: !374, line: 387, column: 8)
!524 = !DISubprogram(name: "big5hkscs_encode", scope: !368, file: !368, line: 39, type: !398, isLocal: true, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%union.MultibyteCodec_State*, i8*, i32, i8*, i64*, i64, i8**, i64, i32)* @big5hkscs_encode, variables: !525)
!525 = !{!526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !537, !538, !539}
!526 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !524, file: !368, line: 39, type: !400)
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !524, file: !368, line: 39, type: !351)
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kind", arg: 3, scope: !524, file: !368, line: 39, type: !51)
!529 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 4, scope: !524, file: !368, line: 39, type: !11)
!530 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpos", arg: 5, scope: !524, file: !368, line: 39, type: !254)
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inlen", arg: 6, scope: !524, file: !368, line: 39, type: !18)
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outbuf", arg: 7, scope: !524, file: !368, line: 39, type: !419)
!533 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outleft", arg: 8, scope: !524, file: !368, line: 39, type: !18)
!534 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 9, scope: !524, file: !368, line: 39, type: !51)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !536, file: !368, line: 42, type: !353)
!536 = distinct !DILexicalBlock(scope: !524, file: !368, line: 41, column: 28)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !536, file: !368, line: 43, type: !505)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "insize", scope: !536, file: !368, line: 44, type: !18)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !540, file: !368, line: 59, type: !353)
!540 = distinct !DILexicalBlock(scope: !541, file: !368, line: 58, column: 37)
!541 = distinct !DILexicalBlock(scope: !542, file: !368, line: 58, column: 21)
!542 = distinct !DILexicalBlock(scope: !543, file: !368, line: 57, column: 312)
!543 = distinct !DILexicalBlock(scope: !544, file: !368, line: 57, column: 17)
!544 = distinct !DILexicalBlock(scope: !545, file: !368, line: 56, column: 26)
!545 = distinct !DILexicalBlock(scope: !536, file: !368, line: 56, column: 13)
!546 = !DISubprogram(name: "big5hkscs_decode", scope: !368, file: !368, line: 110, type: !434, isLocal: true, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%union.MultibyteCodec_State*, i8*, i8**, i64, %struct._PyUnicodeWriter*)* @big5hkscs_decode, variables: !547)
!547 = !{!548, !549, !550, !551, !552, !553, !555, !556, !559, !560, !563, !564, !566, !567, !569, !570, !572}
!548 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !546, file: !368, line: 110, type: !400)
!549 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !546, file: !368, line: 110, type: !351)
!550 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inbuf", arg: 3, scope: !546, file: !368, line: 110, type: !436)
!551 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inleft", arg: 4, scope: !546, file: !368, line: 110, type: !18)
!552 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "writer", arg: 5, scope: !546, file: !368, line: 110, type: !439)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !554, file: !368, line: 113, type: !357)
!554 = distinct !DILexicalBlock(scope: !546, file: !368, line: 112, column: 24)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoded", scope: !554, file: !368, line: 114, type: !353)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !557, file: !368, line: 134, type: !51)
!557 = distinct !DILexicalBlock(scope: !558, file: !368, line: 133, column: 9)
!558 = distinct !DILexicalBlock(scope: !554, file: !368, line: 132, column: 13)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hintbase", scope: !557, file: !368, line: 135, type: !437)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_c1", scope: !561, file: !368, line: 167, type: !353)
!561 = distinct !DILexicalBlock(scope: !562, file: !368, line: 167, column: 25)
!562 = distinct !DILexicalBlock(scope: !554, file: !368, line: 166, column: 43)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_c2", scope: !561, file: !368, line: 167, type: !353)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_c1", scope: !565, file: !368, line: 168, type: !353)
!565 = distinct !DILexicalBlock(scope: !562, file: !368, line: 168, column: 25)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_c2", scope: !565, file: !368, line: 168, type: !353)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_c1", scope: !568, file: !368, line: 169, type: !353)
!568 = distinct !DILexicalBlock(scope: !562, file: !368, line: 169, column: 25)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_c2", scope: !568, file: !368, line: 169, type: !353)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_c1", scope: !571, file: !368, line: 170, type: !353)
!571 = distinct !DILexicalBlock(scope: !562, file: !368, line: 170, column: 25)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_c2", scope: !571, file: !368, line: 170, type: !353)
!573 = !DISubprogram(name: "register_maps", scope: !374, file: !374, line: 304, type: !151, isLocal: true, isDefinition: true, scopeLine: 305, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @register_maps, variables: !574)
!574 = !{!575, !576, !579, !586}
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !573, file: !374, line: 304, type: !12)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "h", scope: !573, file: !374, line: 306, type: !577)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64, align: 64)
!578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mhname", scope: !580, file: !374, line: 309, type: !583)
!580 = distinct !DILexicalBlock(scope: !581, file: !374, line: 308, column: 56)
!581 = distinct !DILexicalBlock(scope: !582, file: !374, line: 308, column: 5)
!582 = distinct !DILexicalBlock(scope: !573, file: !374, line: 308, column: 5)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 2048, align: 8, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 256)
!586 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !580, file: !374, line: 310, type: !51)
!587 = !{!588, !611, !613, !614, !615, !617, !618, !622, !626, !629, !633, !635, !636, !640, !642, !646, !650, !654, !658, !659}
!588 = !DIGlobalVariable(name: "__module", scope: !0, file: !368, line: 191, type: !589, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @__module)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !590, line: 47, size: 832, align: 64, elements: !591)
!590 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!591 = !{!592, !601, !602, !603, !604, !607, !608, !609, !610}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !589, file: !590, line: 48, baseType: !593, size: 320, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !590, line: 38, baseType: !594)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !590, line: 33, size: 320, align: 64, elements: !595)
!595 = !{!596, !597, !599, !600}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !594, file: !590, line: 34, baseType: !13, size: 128, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !594, file: !590, line: 35, baseType: !598, size: 64, align: 64, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !594, file: !590, line: 36, baseType: !18, size: 64, align: 64, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !594, file: !590, line: 37, baseType: !12, size: 64, align: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !589, file: !590, line: 49, baseType: !36, size: 64, align: 64, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !589, file: !590, line: 50, baseType: !36, size: 64, align: 64, offset: 384)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !589, file: !590, line: 51, baseType: !18, size: 64, align: 64, offset: 448)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !589, file: !590, line: 52, baseType: !605, size: 64, align: 64, offset: 512)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !288, line: 47, baseType: !287)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !589, file: !590, line: 53, baseType: !149, size: 64, align: 64, offset: 576)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !589, file: !590, line: 54, baseType: !266, size: 64, align: 64, offset: 640)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !589, file: !590, line: 55, baseType: !149, size: 64, align: 64, offset: 704)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !589, file: !590, line: 56, baseType: !336, size: 64, align: 64, offset: 768)
!611 = !DIGlobalVariable(name: "__methods", scope: !0, file: !374, line: 298, type: !612, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMethodDef]* @__methods)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 512, align: 64, elements: !417)
!613 = !DIGlobalVariable(name: "cofunc", scope: !469, file: !374, line: 246, type: !12, isLocal: true, isDefinition: true, variable: %struct._object** @getmultibytecodec.cofunc)
!614 = !DIGlobalVariable(name: "codec_list", scope: !0, file: !368, line: 189, type: !382, isLocal: true, isDefinition: true, variable: %struct.MultibyteCodec** @codec_list)
!615 = !DIGlobalVariable(name: "_codec_list", scope: !0, file: !368, line: 187, type: !616, isLocal: true, isDefinition: true, variable: [2 x %struct.MultibyteCodec]* @_codec_list)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 1152, align: 64, elements: !417)
!617 = !DIGlobalVariable(name: "initialized", scope: !476, file: !368, line: 21, type: !51, isLocal: true, isDefinition: true, variable: i32* @big5hkscs_codec_init.initialized)
!618 = !DIGlobalVariable(name: "big5_encmap", scope: !0, file: !368, line: 16, type: !619, isLocal: true, isDefinition: true, variable: %struct.unim_index** @big5_encmap)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64, align: 64)
!620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "encode_map", file: !374, line: 45, baseType: !500)
!622 = !DIGlobalVariable(name: "big5_decmap", scope: !0, file: !368, line: 17, type: !623, isLocal: true, isDefinition: true, variable: %struct.dbcs_index** @big5_decmap)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !625)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "decode_map", file: !374, line: 33, baseType: !511)
!626 = !DIGlobalVariable(name: "big5hkscs_bmp_encmap", scope: !0, file: !627, line: 1350, type: !628, isLocal: true, isDefinition: true, variable: [256 x %struct.unim_index]* @big5hkscs_bmp_encmap)
!627 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/cjkcodecs/mappings_hk.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 32768, align: 64, elements: !584)
!629 = !DIGlobalVariable(name: "__big5hkscs_bmp_encmap", scope: !0, file: !627, line: 498, type: !630, isLocal: true, isDefinition: true, variable: [26401 x i16]* @__big5hkscs_bmp_encmap)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 422416, align: 16, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 26401)
!633 = !DIGlobalVariable(name: "big5hkscs_pairenc_table", scope: !0, file: !368, line: 37, type: !634, isLocal: true, isDefinition: true, variable: [4 x i16]* @big5hkscs_pairenc_table)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 64, align: 16, elements: !413)
!635 = !DIGlobalVariable(name: "big5hkscs_nonbmp_encmap", scope: !0, file: !627, line: 2274, type: !628, isLocal: true, isDefinition: true, variable: [256 x %struct.unim_index]* @big5hkscs_nonbmp_encmap)
!636 = !DIGlobalVariable(name: "__big5hkscs_nonbmp_encmap", scope: !0, file: !627, line: 1429, type: !637, isLocal: true, isDefinition: true, variable: [29306 x i16]* @__big5hkscs_nonbmp_encmap)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 468896, align: 16, elements: !638)
!638 = !{!639}
!639 = !DISubrange(count: 29306)
!640 = !DIGlobalVariable(name: "big5hkscs_decmap", scope: !0, file: !627, line: 415, type: !641, isLocal: true, isDefinition: true, variable: [256 x %struct.dbcs_index]* @big5hkscs_decmap)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 32768, align: 64, elements: !584)
