; ModuleID = 'irs-onlybc/_codecs_jp.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !365, globals: !741)
!1 = !DIFile(filename: "_codecs_jp.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !12, !350, !351, !355, !358, !354, !360, !353, !362, !357, !363, !364}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !14, line: 109, baseType: !15)
!14 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !14, line: 105, size: 128, align: 64, elements: !16)
!16 = !{!17, !25}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !15, file: !14, line: 107, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !19, line: 177, baseType: !20)
!19 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !21, line: 102, baseType: !22)
!21 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !23, line: 181, baseType: !24)
!23 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!24 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !15, file: !14, line: 108, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !14, line: 334, size: 3200, align: 64, elements: !28)
!28 = !{!29, !35, !39, !40, !41, !46, !109, !114, !119, !120, !125, !177, !208, !220, !226, !227, !228, !230, !232, !263, !264, !265, !274, !275, !280, !281, !283, !285, !295, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !27, file: !14, line: 335, baseType: !30, size: 192, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !14, line: 114, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 111, size: 192, align: 64, elements: !32)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !14, line: 112, baseType: !13, size: 128, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !31, file: !14, line: 113, baseType: !18, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !27, file: !14, line: 336, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !27, file: !14, line: 341, baseType: !42, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !14, line: 308, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !12}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !27, file: !14, line: 342, baseType: !47, size: 64, align: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !14, line: 314, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !12, !52, !51}
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !21, line: 48, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !55, line: 246, size: 1728, align: 64, elements: !56)
!55 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!56 = !{!57, !58, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !78, !79, !80, !81, !83, !85, !87, !91, !94, !96, !97, !98, !99, !100, !104, !105}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !54, file: !55, line: 247, baseType: !51, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !54, file: !55, line: 252, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !54, file: !55, line: 253, baseType: !59, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !54, file: !55, line: 254, baseType: !59, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !54, file: !55, line: 255, baseType: !59, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !54, file: !55, line: 256, baseType: !59, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !54, file: !55, line: 257, baseType: !59, size: 64, align: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !54, file: !55, line: 258, baseType: !59, size: 64, align: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !54, file: !55, line: 259, baseType: !59, size: 64, align: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !54, file: !55, line: 261, baseType: !59, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !54, file: !55, line: 262, baseType: !59, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !54, file: !55, line: 263, baseType: !59, size: 64, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !54, file: !55, line: 265, baseType: !71, size: 64, align: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !55, line: 161, size: 192, align: 64, elements: !73)
!73 = !{!74, !75, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !72, file: !55, line: 162, baseType: !71, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !72, file: !55, line: 163, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !72, file: !55, line: 167, baseType: !51, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !54, file: !55, line: 267, baseType: !76, size: 64, align: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !54, file: !55, line: 269, baseType: !51, size: 32, align: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !54, file: !55, line: 273, baseType: !51, size: 32, align: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !54, file: !55, line: 275, baseType: !82, size: 64, align: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !23, line: 140, baseType: !24)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !54, file: !55, line: 279, baseType: !84, size: 16, align: 16, offset: 1024)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !54, file: !55, line: 280, baseType: !86, size: 8, align: 8, offset: 1040)
!86 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !54, file: !55, line: 281, baseType: !88, size: 8, align: 8, offset: 1048)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !54, file: !55, line: 285, baseType: !92, size: 64, align: 64, offset: 1088)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !55, line: 155, baseType: null)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !54, file: !55, line: 294, baseType: !95, size: 64, align: 64, offset: 1152)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !23, line: 141, baseType: !24)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !54, file: !55, line: 303, baseType: !11, size: 64, align: 64, offset: 1216)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !54, file: !55, line: 304, baseType: !11, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !54, file: !55, line: 305, baseType: !11, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !54, file: !55, line: 306, baseType: !11, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !54, file: !55, line: 307, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !54, file: !55, line: 309, baseType: !51, size: 32, align: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !54, file: !55, line: 311, baseType: !106, size: 160, align: 8, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !27, file: !14, line: 343, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !14, line: 316, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!12, !12, !59}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !27, file: !14, line: 344, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !14, line: 318, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!51, !12, !59, !12}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !27, file: !14, line: 345, baseType: !11, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !27, file: !14, line: 346, baseType: !121, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !14, line: 320, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!12, !12}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !27, file: !14, line: 350, baseType: !126, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !14, line: 278, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 236, size: 2176, align: 64, elements: !129)
!129 = !{!130, !135, !136, !137, !138, !139, !144, !146, !147, !148, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !128, file: !14, line: 241, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !14, line: 166, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!12, !12, !12}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !128, file: !14, line: 242, baseType: !131, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !128, file: !14, line: 243, baseType: !131, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !128, file: !14, line: 244, baseType: !131, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !128, file: !14, line: 245, baseType: !131, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !128, file: !14, line: 246, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !14, line: 167, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!12, !12, !12, !12}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !128, file: !14, line: 247, baseType: !145, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !14, line: 165, baseType: !122)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !128, file: !14, line: 248, baseType: !145, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !128, file: !14, line: 249, baseType: !145, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !128, file: !14, line: 250, baseType: !149, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !14, line: 168, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!51, !12}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !128, file: !14, line: 251, baseType: !145, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !128, file: !14, line: 252, baseType: !131, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !128, file: !14, line: 253, baseType: !131, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !128, file: !14, line: 254, baseType: !131, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !128, file: !14, line: 255, baseType: !131, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !128, file: !14, line: 256, baseType: !131, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !128, file: !14, line: 257, baseType: !145, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !128, file: !14, line: 258, baseType: !11, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !128, file: !14, line: 259, baseType: !145, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !128, file: !14, line: 261, baseType: !131, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !128, file: !14, line: 262, baseType: !131, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !128, file: !14, line: 263, baseType: !131, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !128, file: !14, line: 264, baseType: !131, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !128, file: !14, line: 265, baseType: !140, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !128, file: !14, line: 266, baseType: !131, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !128, file: !14, line: 267, baseType: !131, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !128, file: !14, line: 268, baseType: !131, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !128, file: !14, line: 269, baseType: !131, size: 64, align: 64, offset: 1728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !128, file: !14, line: 270, baseType: !131, size: 64, align: 64, offset: 1792)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !128, file: !14, line: 272, baseType: !131, size: 64, align: 64, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !128, file: !14, line: 273, baseType: !131, size: 64, align: 64, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !128, file: !14, line: 274, baseType: !131, size: 64, align: 64, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !128, file: !14, line: 275, baseType: !131, size: 64, align: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !128, file: !14, line: 277, baseType: !145, size: 64, align: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !27, file: !14, line: 351, baseType: !178, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !14, line: 292, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 280, size: 640, align: 64, elements: !181)
!181 = !{!182, !187, !188, !193, !194, !195, !200, !201, !206, !207}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !180, file: !14, line: 281, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !14, line: 169, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!18, !12}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !180, file: !14, line: 282, baseType: !131, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !180, file: !14, line: 283, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !14, line: 170, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!12, !12, !18}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !180, file: !14, line: 284, baseType: !189, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !180, file: !14, line: 285, baseType: !11, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !180, file: !14, line: 286, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !14, line: 172, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!51, !12, !18, !12}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !180, file: !14, line: 287, baseType: !11, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !180, file: !14, line: 288, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !14, line: 231, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!51, !12, !12}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !180, file: !14, line: 290, baseType: !131, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !180, file: !14, line: 291, baseType: !189, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !27, file: !14, line: 352, baseType: !209, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !14, line: 298, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 294, size: 192, align: 64, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !211, file: !14, line: 295, baseType: !183, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !211, file: !14, line: 296, baseType: !131, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !211, file: !14, line: 297, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !14, line: 174, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!51, !12, !12, !12}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !27, file: !14, line: 356, baseType: !221, size: 64, align: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !14, line: 321, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !12}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !19, line: 186, baseType: !18)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !27, file: !14, line: 357, baseType: !140, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !27, file: !14, line: 358, baseType: !121, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !27, file: !14, line: 359, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !14, line: 317, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !27, file: !14, line: 360, baseType: !231, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !14, line: 319, baseType: !217)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !27, file: !14, line: 363, baseType: !233, size: 64, align: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !14, line: 304, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 301, size: 128, align: 64, elements: !236)
!236 = !{!237, !258}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !235, file: !14, line: 302, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !14, line: 193, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!51, !12, !242, !51}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !14, line: 191, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !14, line: 178, size: 640, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !255, !256, !257}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !244, file: !14, line: 179, baseType: !11, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !244, file: !14, line: 180, baseType: !12, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !14, line: 181, baseType: !18, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !244, file: !14, line: 182, baseType: !18, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !244, file: !14, line: 184, baseType: !51, size: 32, align: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !244, file: !14, line: 185, baseType: !51, size: 32, align: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !244, file: !14, line: 186, baseType: !59, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !244, file: !14, line: 187, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !244, file: !14, line: 188, baseType: !254, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !244, file: !14, line: 189, baseType: !254, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !244, file: !14, line: 190, baseType: !11, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !235, file: !14, line: 303, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !14, line: 194, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !12, !242}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !27, file: !14, line: 366, baseType: !103, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !27, file: !14, line: 368, baseType: !36, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !27, file: !14, line: 372, baseType: !266, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !14, line: 233, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!51, !12, !270, !11}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !14, line: 232, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!51, !12, !11}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !27, file: !14, line: 375, baseType: !149, size: 64, align: 64, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !27, file: !14, line: 379, baseType: !276, size: 64, align: 64, offset: 1600)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !14, line: 322, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!12, !12, !12, !51}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !27, file: !14, line: 382, baseType: !18, size: 64, align: 64, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !27, file: !14, line: 385, baseType: !282, size: 64, align: 64, offset: 1728)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !14, line: 323, baseType: !122)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !27, file: !14, line: 386, baseType: !284, size: 64, align: 64, offset: 1792)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !14, line: 324, baseType: !122)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !27, file: !14, line: 389, baseType: !286, size: 64, align: 64, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 40, size: 256, align: 64, elements: !289)
!288 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 41, baseType: !36, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 18, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 43, baseType: !51, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 45, baseType: !36, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !27, file: !14, line: 390, baseType: !296, size: 64, align: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !14, line: 390, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !27, file: !14, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !59, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!12, !12, !11}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!51, !12, !12, !11}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !59, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !11, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !27, file: !14, line: 392, baseType: !26, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !27, file: !14, line: 393, baseType: !12, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !27, file: !14, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !14, line: 325, baseType: !141)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !27, file: !14, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !14, line: 326, baseType: !217)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !27, file: !14, line: 396, baseType: !18, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !27, file: !14, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !14, line: 327, baseType: !217)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !27, file: !14, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !14, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!12, !26, !18}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !27, file: !14, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !14, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!12, !26, !12, !12}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !27, file: !14, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !14, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !11}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !27, file: !14, line: 401, baseType: !149, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !27, file: !14, line: 402, baseType: !12, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !27, file: !14, line: 403, baseType: !12, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !27, file: !14, line: 404, baseType: !12, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !27, file: !14, line: 405, baseType: !12, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !27, file: !14, line: 406, baseType: !12, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !27, file: !14, line: 407, baseType: !42, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !27, file: !14, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !27, file: !14, line: 412, baseType: !42, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !348)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !354)
!354 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !84)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "ucs2_t", file: !361, line: 16, baseType: !84)
!361 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/cjkcodecs/multibytecodec.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!365 = !{!366, !372, !468, !475, !492, !508, !524, !535, !549, !568, !598, !616, !647, !673, !704}
!366 = !DISubprogram(name: "PyInit__codecs_jp", scope: !367, file: !367, line: 760, type: !368, isLocal: false, isDefinition: true, scopeLine: 760, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__codecs_jp, variables: !370)
!367 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/cjkcodecs/_codecs_jp.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!368 = !DISubroutineType(types: !369)
!369 = !{!12}
!370 = !{!371}
!371 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !366, file: !367, line: 760, type: !12)
!372 = !DISubprogram(name: "getcodec", scope: !373, file: !373, line: 259, type: !133, isLocal: true, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @getcodec, variables: !374)
!373 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/cjkcodecs/cjkcodecs.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!374 = !{!375, !376, !377, !378, !379, !380, !459, !460, !465, !466}
!375 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !372, file: !373, line: 259, type: !12)
!376 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 2, scope: !372, file: !373, line: 259, type: !12)
!377 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codecobj", scope: !372, file: !373, line: 261, type: !12)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !372, file: !373, line: 261, type: !12)
!379 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cofunc", scope: !372, file: !373, line: 261, type: !12)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codec", scope: !372, file: !373, line: 262, type: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "MultibyteCodec", file: !361, line: 58, baseType: !384)
!384 = !DICompositeType(tag: DW_TAG_structure_type, file: !361, line: 48, size: 576, align: 64, elements: !385)
!385 = !{!386, !387, !390, !395, !420, !425, !430, !452, !454}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !384, file: !361, line: 49, baseType: !36, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !384, file: !361, line: 50, baseType: !388, size: 64, align: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "codecinit", scope: !384, file: !361, line: 51, baseType: !391, size: 64, align: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbcodec_init", file: !361, line: 27, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!51, !388}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "encode", scope: !384, file: !361, line: 52, baseType: !396, size: 64, align: 64, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbencode_func", file: !361, line: 28, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!18, !400, !388, !51, !11, !254, !18, !418, !18, !51}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "MultibyteCodec_State", file: !361, line: 25, baseType: !402)
!402 = !DICompositeType(tag: DW_TAG_union_type, file: !361, line: 19, size: 64, align: 64, elements: !403)
!403 = !{!404, !405, !406, !410, !414}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !402, file: !361, line: 20, baseType: !11, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !402, file: !361, line: 21, baseType: !51, size: 32, align: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !402, file: !361, line: 22, baseType: !407, size: 64, align: 8)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 64, align: 8, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 8)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "u2", scope: !402, file: !361, line: 23, baseType: !411, size: 64, align: 16)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 64, align: 16, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 4)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "u4", scope: !402, file: !361, line: 24, baseType: !415, size: 64, align: 32)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 64, align: 32, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 2)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "encinit", scope: !384, file: !361, line: 53, baseType: !421, size: 64, align: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbencodeinit_func", file: !361, line: 34, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!51, !400, !388}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "encreset", scope: !384, file: !361, line: 54, baseType: !426, size: 64, align: 64, offset: 320)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbencodereset_func", file: !361, line: 36, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!18, !400, !388, !418, !18}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !384, file: !361, line: 55, baseType: !431, size: 64, align: 64, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbdecode_func", file: !361, line: 39, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!18, !400, !388, !435, !18, !438}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !354)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyUnicodeWriter", file: !4, line: 917, baseType: !440)
!440 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 897, size: 448, align: 64, elements: !441)
!441 = !{!442, !443, !444, !445, !446, !447, !448, !449, !450, !451}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !440, file: !4, line: 898, baseType: !12, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !440, file: !4, line: 899, baseType: !11, size: 64, align: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !440, file: !4, line: 900, baseType: !3, size: 32, align: 32, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "maxchar", scope: !440, file: !4, line: 901, baseType: !350, size: 32, align: 32, offset: 160)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !440, file: !4, line: 902, baseType: !18, size: 64, align: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !440, file: !4, line: 903, baseType: !18, size: 64, align: 64, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "min_length", scope: !440, file: !4, line: 906, baseType: !18, size: 64, align: 64, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "min_char", scope: !440, file: !4, line: 909, baseType: !350, size: 32, align: 32, offset: 384)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "overallocate", scope: !440, file: !4, line: 912, baseType: !354, size: 8, align: 8, offset: 416)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !440, file: !4, line: 916, baseType: !354, size: 8, align: 8, offset: 424)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "decinit", scope: !384, file: !361, line: 56, baseType: !453, size: 64, align: 64, offset: 448)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbdecodeinit_func", file: !361, line: 43, baseType: !422)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "decreset", scope: !384, file: !361, line: 57, baseType: !455, size: 64, align: 64, offset: 512)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbdecodereset_func", file: !361, line: 45, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!18, !400, !388}
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "enc", scope: !372, file: !373, line: 263, type: !36)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !461, file: !373, line: 279, type: !101)
!461 = distinct !DILexicalBlock(scope: !462, file: !373, line: 279, column: 28)
!462 = distinct !DILexicalBlock(scope: !463, file: !373, line: 279, column: 13)
!463 = distinct !DILexicalBlock(scope: !464, file: !373, line: 278, column: 5)
!464 = distinct !DILexicalBlock(scope: !372, file: !373, line: 278, column: 5)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !461, file: !373, line: 279, type: !101)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !467, file: !373, line: 293, type: !12)
!467 = distinct !DILexicalBlock(scope: !372, file: !373, line: 293, column: 8)
!468 = !DISubprogram(name: "getmultibytecodec", scope: !373, file: !373, line: 244, type: !368, isLocal: true, isDefinition: true, scopeLine: 245, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @getmultibytecodec, variables: !469)
!469 = !{!470, !473}
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !471, file: !373, line: 249, type: !12)
!471 = distinct !DILexicalBlock(scope: !472, file: !373, line: 248, column: 31)
!472 = distinct !DILexicalBlock(scope: !468, file: !373, line: 248, column: 9)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !474, file: !373, line: 253, type: !12)
!474 = distinct !DILexicalBlock(scope: !471, file: !373, line: 253, column: 12)
!475 = !DISubprogram(name: "shift_jis_encode", scope: !367, file: !367, line: 449, type: !398, isLocal: true, isDefinition: true, scopeLine: 450, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%union.MultibyteCodec_State*, i8*, i32, i8*, i64*, i64, i8**, i64, i32)* @shift_jis_encode, variables: !476)
!476 = !{!477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !488, !490, !491}
!477 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !475, file: !367, line: 449, type: !400)
!478 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !475, file: !367, line: 449, type: !388)
!479 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kind", arg: 3, scope: !475, file: !367, line: 449, type: !51)
!480 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 4, scope: !475, file: !367, line: 449, type: !11)
!481 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpos", arg: 5, scope: !475, file: !367, line: 449, type: !254)
!482 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inlen", arg: 6, scope: !475, file: !367, line: 449, type: !18)
!483 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outbuf", arg: 7, scope: !475, file: !367, line: 449, type: !418)
!484 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outleft", arg: 8, scope: !475, file: !367, line: 449, type: !18)
!485 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 9, scope: !475, file: !367, line: 449, type: !51)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !487, file: !367, line: 452, type: !350)
!487 = distinct !DILexicalBlock(scope: !475, file: !367, line: 451, column: 28)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !487, file: !367, line: 453, type: !489)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "DBCHAR", file: !361, line: 16, baseType: !84)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c1", scope: !487, file: !367, line: 454, type: !354)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !487, file: !367, line: 454, type: !354)
!492 = !DISubprogram(name: "shift_jis_decode", scope: !367, file: !367, line: 508, type: !433, isLocal: true, isDefinition: true, scopeLine: 509, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%union.MultibyteCodec_State*, i8*, i8**, i64, %struct._PyUnicodeWriter*)* @shift_jis_decode, variables: !493)
!493 = !{!494, !495, !496, !497, !498, !499, !501, !502, !507}
!494 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !492, file: !367, line: 508, type: !400)
!495 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !492, file: !367, line: 508, type: !388)
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inbuf", arg: 3, scope: !492, file: !367, line: 508, type: !435)
!497 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inleft", arg: 4, scope: !492, file: !367, line: 508, type: !18)
!498 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "writer", arg: 5, scope: !492, file: !367, line: 508, type: !438)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !500, file: !367, line: 511, type: !354)
!500 = distinct !DILexicalBlock(scope: !492, file: !367, line: 510, column: 24)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoded", scope: !500, file: !367, line: 512, type: !350)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c1", scope: !503, file: !367, line: 522, type: !354)
!503 = distinct !DILexicalBlock(scope: !504, file: !367, line: 521, column: 71)
!504 = distinct !DILexicalBlock(scope: !505, file: !367, line: 521, column: 18)
!505 = distinct !DILexicalBlock(scope: !506, file: !367, line: 520, column: 18)
!506 = distinct !DILexicalBlock(scope: !500, file: !367, line: 517, column: 13)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !503, file: !367, line: 522, type: !354)
!508 = !DISubprogram(name: "cp932_encode", scope: !367, file: !367, line: 20, type: !398, isLocal: true, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%union.MultibyteCodec_State*, i8*, i32, i8*, i64*, i64, i8**, i64, i32)* @cp932_encode, variables: !509)
!509 = !{!510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !521, !522, !523}
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !508, file: !367, line: 20, type: !400)
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !508, file: !367, line: 20, type: !388)
!512 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kind", arg: 3, scope: !508, file: !367, line: 20, type: !51)
!513 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 4, scope: !508, file: !367, line: 20, type: !11)
!514 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpos", arg: 5, scope: !508, file: !367, line: 20, type: !254)
!515 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inlen", arg: 6, scope: !508, file: !367, line: 20, type: !18)
!516 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outbuf", arg: 7, scope: !508, file: !367, line: 20, type: !418)
!517 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outleft", arg: 8, scope: !508, file: !367, line: 20, type: !18)
!518 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 9, scope: !508, file: !367, line: 20, type: !51)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !520, file: !367, line: 23, type: !350)
!520 = distinct !DILexicalBlock(scope: !508, file: !367, line: 22, column: 28)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !520, file: !367, line: 24, type: !489)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c1", scope: !520, file: !367, line: 25, type: !354)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !520, file: !367, line: 25, type: !354)
!524 = !DISubprogram(name: "cp932_decode", scope: !367, file: !367, line: 84, type: !433, isLocal: true, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%union.MultibyteCodec_State*, i8*, i8**, i64, %struct._PyUnicodeWriter*)* @cp932_decode, variables: !525)
!525 = !{!526, !527, !528, !529, !530, !531, !533, !534}
!526 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !524, file: !367, line: 84, type: !400)
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !524, file: !367, line: 84, type: !388)
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inbuf", arg: 3, scope: !524, file: !367, line: 84, type: !435)
!529 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inleft", arg: 4, scope: !524, file: !367, line: 84, type: !18)
!530 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "writer", arg: 5, scope: !524, file: !367, line: 84, type: !438)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !532, file: !367, line: 87, type: !354)
!532 = distinct !DILexicalBlock(scope: !524, file: !367, line: 86, column: 24)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !532, file: !367, line: 87, type: !354)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoded", scope: !532, file: !367, line: 88, type: !350)
!535 = !DISubprogram(name: "euc_jp_encode", scope: !367, file: !367, line: 329, type: !398, isLocal: true, isDefinition: true, scopeLine: 330, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%union.MultibyteCodec_State*, i8*, i32, i8*, i64*, i64, i8**, i64, i32)* @euc_jp_encode, variables: !536)
!536 = !{!537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !548}
!537 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !535, file: !367, line: 329, type: !400)
!538 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !535, file: !367, line: 329, type: !388)
!539 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kind", arg: 3, scope: !535, file: !367, line: 329, type: !51)
!540 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 4, scope: !535, file: !367, line: 329, type: !11)
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpos", arg: 5, scope: !535, file: !367, line: 329, type: !254)
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inlen", arg: 6, scope: !535, file: !367, line: 329, type: !18)
!543 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outbuf", arg: 7, scope: !535, file: !367, line: 329, type: !418)
!544 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outleft", arg: 8, scope: !535, file: !367, line: 329, type: !18)
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 9, scope: !535, file: !367, line: 329, type: !51)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !547, file: !367, line: 332, type: !350)
!547 = distinct !DILexicalBlock(scope: !535, file: !367, line: 331, column: 28)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !547, file: !367, line: 333, type: !489)
!549 = !DISubprogram(name: "euc_jp_decode", scope: !367, file: !367, line: 382, type: !433, isLocal: true, isDefinition: true, scopeLine: 383, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%union.MultibyteCodec_State*, i8*, i8**, i64, %struct._PyUnicodeWriter*)* @euc_jp_decode, variables: !550)
!550 = !{!551, !552, !553, !554, !555, !556, !558, !559, !562, !565, !566}
!551 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !549, file: !367, line: 382, type: !400)
!552 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !549, file: !367, line: 382, type: !388)
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inbuf", arg: 3, scope: !549, file: !367, line: 382, type: !435)
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inleft", arg: 4, scope: !549, file: !367, line: 382, type: !18)
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "writer", arg: 5, scope: !549, file: !367, line: 382, type: !438)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !557, file: !367, line: 385, type: !354)
!557 = distinct !DILexicalBlock(scope: !549, file: !367, line: 384, column: 24)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoded", scope: !557, file: !367, line: 386, type: !350)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !560, file: !367, line: 396, type: !354)
!560 = distinct !DILexicalBlock(scope: !561, file: !367, line: 394, column: 24)
!561 = distinct !DILexicalBlock(scope: !557, file: !367, line: 394, column: 13)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !563, file: !367, line: 408, type: !354)
!563 = distinct !DILexicalBlock(scope: !564, file: !367, line: 407, column: 29)
!564 = distinct !DILexicalBlock(scope: !561, file: !367, line: 407, column: 18)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c3", scope: !563, file: !367, line: 408, type: !354)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !567, file: !367, line: 422, type: !354)
!567 = distinct !DILexicalBlock(scope: !564, file: !367, line: 421, column: 14)
!568 = !DISubprogram(name: "shift_jis_2004_encode", scope: !367, file: !367, line: 564, type: !398, isLocal: true, isDefinition: true, scopeLine: 565, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%union.MultibyteCodec_State*, i8*, i32, i8*, i64*, i64, i8**, i64, i32)* @shift_jis_2004_encode, variables: !569)
!569 = !{!570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !581, !582, !583, !584, !585}
!570 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !568, file: !367, line: 564, type: !400)
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !568, file: !367, line: 564, type: !388)
!572 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kind", arg: 3, scope: !568, file: !367, line: 564, type: !51)
!573 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 4, scope: !568, file: !367, line: 564, type: !11)
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpos", arg: 5, scope: !568, file: !367, line: 564, type: !254)
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inlen", arg: 6, scope: !568, file: !367, line: 564, type: !18)
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outbuf", arg: 7, scope: !568, file: !367, line: 564, type: !418)
!577 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outleft", arg: 8, scope: !568, file: !367, line: 564, type: !18)
!578 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 9, scope: !568, file: !367, line: 564, type: !51)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !580, file: !367, line: 567, type: !350)
!580 = distinct !DILexicalBlock(scope: !568, file: !367, line: 566, column: 28)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !580, file: !367, line: 568, type: !489)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c1", scope: !580, file: !367, line: 569, type: !51)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !580, file: !367, line: 569, type: !51)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "insize", scope: !580, file: !367, line: 570, type: !18)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch2", scope: !586, file: !367, line: 601, type: !350)
!586 = distinct !DILexicalBlock(scope: !587, file: !367, line: 600, column: 30)
!587 = distinct !DILexicalBlock(scope: !588, file: !367, line: 588, column: 29)
!588 = distinct !DILexicalBlock(scope: !589, file: !367, line: 587, column: 41)
!589 = distinct !DILexicalBlock(scope: !590, file: !367, line: 587, column: 25)
!590 = distinct !DILexicalBlock(scope: !591, file: !367, line: 586, column: 316)
!591 = distinct !DILexicalBlock(scope: !592, file: !367, line: 586, column: 26)
!592 = distinct !DILexicalBlock(scope: !593, file: !367, line: 585, column: 241)
!593 = distinct !DILexicalBlock(scope: !594, file: !367, line: 585, column: 21)
!594 = distinct !DILexicalBlock(scope: !595, file: !367, line: 584, column: 30)
!595 = distinct !DILexicalBlock(scope: !596, file: !367, line: 584, column: 17)
!596 = distinct !DILexicalBlock(scope: !597, file: !367, line: 583, column: 29)
!597 = distinct !DILexicalBlock(scope: !580, file: !367, line: 583, column: 13)
!598 = !DISubprogram(name: "find_pairencmap", scope: !373, file: !373, line: 322, type: !599, isLocal: true, isDefinition: true, scopeLine: 324, flags: DIFlagPrototyped, isOptimized: true, function: i16 (i16, i16, %struct.pair_encodemap*, i32)* @find_pairencmap, variables: !607)
!599 = !DISubroutineType(types: !600)
!600 = !{!489, !360, !360, !601, !51}
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !603)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "pair_encodemap", file: !373, line: 58, size: 64, align: 32, elements: !604)
!604 = !{!605, !606}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "uniseq", scope: !603, file: !373, line: 59, baseType: !350, size: 32, align: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !603, file: !373, line: 60, baseType: !489, size: 16, align: 16, offset: 32)
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615}
!608 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "body", arg: 1, scope: !598, file: !373, line: 322, type: !360)
!609 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "modifier", arg: 2, scope: !598, file: !373, line: 322, type: !360)
!610 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "haystack", arg: 3, scope: !598, file: !373, line: 323, type: !601)
!611 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "haystacksize", arg: 4, scope: !598, file: !373, line: 323, type: !51)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !598, file: !373, line: 325, type: !51)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min", scope: !598, file: !373, line: 325, type: !51)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max", scope: !598, file: !373, line: 325, type: !51)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !598, file: !373, line: 326, type: !350)
!616 = !DISubprogram(name: "shift_jis_2004_decode", scope: !367, file: !367, line: 667, type: !433, isLocal: true, isDefinition: true, scopeLine: 668, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%union.MultibyteCodec_State*, i8*, i8**, i64, %struct._PyUnicodeWriter*)* @shift_jis_2004_decode, variables: !617)
!617 = !{!618, !619, !620, !621, !622, !623, !625, !634, !635, !636, !637, !646}
!618 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !616, file: !367, line: 667, type: !400)
!619 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !616, file: !367, line: 667, type: !388)
!620 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inbuf", arg: 3, scope: !616, file: !367, line: 667, type: !435)
!621 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inleft", arg: 4, scope: !616, file: !367, line: 667, type: !18)
!622 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "writer", arg: 5, scope: !616, file: !367, line: 667, type: !438)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !624, file: !367, line: 670, type: !354)
!624 = distinct !DILexicalBlock(scope: !616, file: !367, line: 669, column: 24)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c1", scope: !626, file: !367, line: 674, type: !354)
!626 = distinct !DILexicalBlock(scope: !627, file: !367, line: 673, column: 71)
!627 = distinct !DILexicalBlock(scope: !628, file: !367, line: 673, column: 18)
!628 = distinct !DILexicalBlock(scope: !629, file: !367, line: 672, column: 554)
!629 = distinct !DILexicalBlock(scope: !630, file: !367, line: 672, column: 445)
!630 = distinct !DILexicalBlock(scope: !631, file: !367, line: 672, column: 334)
!631 = distinct !DILexicalBlock(scope: !632, file: !367, line: 672, column: 229)
!632 = distinct !DILexicalBlock(scope: !633, file: !367, line: 672, column: 118)
!633 = distinct !DILexicalBlock(scope: !624, file: !367, line: 672, column: 13)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !626, file: !367, line: 674, type: !354)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !626, file: !367, line: 675, type: !350)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoded", scope: !626, file: !367, line: 675, type: !350)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_c1", scope: !638, file: !367, line: 698, type: !350)
!638 = distinct !DILexicalBlock(scope: !639, file: !367, line: 698, column: 24)
!639 = distinct !DILexicalBlock(scope: !640, file: !367, line: 697, column: 26)
!640 = distinct !DILexicalBlock(scope: !641, file: !367, line: 695, column: 26)
!641 = distinct !DILexicalBlock(scope: !642, file: !367, line: 693, column: 26)
!642 = distinct !DILexicalBlock(scope: !643, file: !367, line: 691, column: 26)
!643 = distinct !DILexicalBlock(scope: !644, file: !367, line: 689, column: 21)
!644 = distinct !DILexicalBlock(scope: !645, file: !367, line: 687, column: 28)
!645 = distinct !DILexicalBlock(scope: !626, file: !367, line: 687, column: 17)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_c2", scope: !638, file: !367, line: 698, type: !350)
!647 = !DISubprogram(name: "euc_jis_2004_encode", scope: !367, file: !367, line: 151, type: !398, isLocal: true, isDefinition: true, scopeLine: 152, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%union.MultibyteCodec_State*, i8*, i32, i8*, i64*, i64, i8**, i64, i32)* @euc_jis_2004_encode, variables: !648)
!648 = !{!649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !660, !661, !662}
!649 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !647, file: !367, line: 151, type: !400)
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !647, file: !367, line: 151, type: !388)
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kind", arg: 3, scope: !647, file: !367, line: 151, type: !51)
!652 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 4, scope: !647, file: !367, line: 151, type: !11)
!653 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inpos", arg: 5, scope: !647, file: !367, line: 151, type: !254)
!654 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inlen", arg: 6, scope: !647, file: !367, line: 151, type: !18)
!655 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outbuf", arg: 7, scope: !647, file: !367, line: 151, type: !418)
!656 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "outleft", arg: 8, scope: !647, file: !367, line: 151, type: !18)
!657 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 9, scope: !647, file: !367, line: 151, type: !51)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !659, file: !367, line: 154, type: !350)
!659 = distinct !DILexicalBlock(scope: !647, file: !367, line: 153, column: 28)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !659, file: !367, line: 155, type: !489)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "insize", scope: !659, file: !367, line: 156, type: !18)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !663, file: !367, line: 183, type: !350)
!663 = distinct !DILexicalBlock(scope: !664, file: !367, line: 182, column: 26)
!664 = distinct !DILexicalBlock(scope: !665, file: !367, line: 170, column: 25)
!665 = distinct !DILexicalBlock(scope: !666, file: !367, line: 169, column: 37)
!666 = distinct !DILexicalBlock(scope: !667, file: !367, line: 169, column: 21)
!667 = distinct !DILexicalBlock(scope: !668, file: !367, line: 168, column: 312)
!668 = distinct !DILexicalBlock(scope: !669, file: !367, line: 168, column: 22)
!669 = distinct !DILexicalBlock(scope: !670, file: !367, line: 167, column: 237)
!670 = distinct !DILexicalBlock(scope: !671, file: !367, line: 167, column: 17)
!671 = distinct !DILexicalBlock(scope: !672, file: !367, line: 166, column: 26)
!672 = distinct !DILexicalBlock(scope: !659, file: !367, line: 166, column: 13)
!673 = !DISubprogram(name: "euc_jis_2004_decode", scope: !367, file: !367, line: 241, type: !433, isLocal: true, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%union.MultibyteCodec_State*, i8*, i8**, i64, %struct._PyUnicodeWriter*)* @euc_jis_2004_decode, variables: !674)
!674 = !{!675, !676, !677, !678, !679, !680, !682, !683, !684, !687, !690, !691, !693, !703}
!675 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !673, file: !367, line: 241, type: !400)
!676 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "config", arg: 2, scope: !673, file: !367, line: 241, type: !388)
!677 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inbuf", arg: 3, scope: !673, file: !367, line: 241, type: !435)
!678 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inleft", arg: 4, scope: !673, file: !367, line: 241, type: !18)
!679 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "writer", arg: 5, scope: !673, file: !367, line: 241, type: !438)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !681, file: !367, line: 244, type: !354)
!681 = distinct !DILexicalBlock(scope: !673, file: !367, line: 243, column: 24)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !681, file: !367, line: 245, type: !350)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoded", scope: !681, file: !367, line: 245, type: !350)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !685, file: !367, line: 255, type: !354)
!685 = distinct !DILexicalBlock(scope: !686, file: !367, line: 253, column: 24)
!686 = distinct !DILexicalBlock(scope: !681, file: !367, line: 253, column: 13)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !688, file: !367, line: 267, type: !354)
!688 = distinct !DILexicalBlock(scope: !689, file: !367, line: 266, column: 29)
!689 = distinct !DILexicalBlock(scope: !686, file: !367, line: 266, column: 18)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c3", scope: !688, file: !367, line: 267, type: !354)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !692, file: !367, line: 289, type: !354)
!692 = distinct !DILexicalBlock(scope: !689, file: !367, line: 288, column: 14)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_c1", scope: !694, file: !367, line: 311, type: !350)
!694 = distinct !DILexicalBlock(scope: !695, file: !367, line: 311, column: 20)
!695 = distinct !DILexicalBlock(scope: !696, file: !367, line: 310, column: 258)
!696 = distinct !DILexicalBlock(scope: !697, file: !367, line: 310, column: 22)
!697 = distinct !DILexicalBlock(scope: !698, file: !367, line: 305, column: 22)
!698 = distinct !DILexicalBlock(scope: !699, file: !367, line: 303, column: 22)
!699 = distinct !DILexicalBlock(scope: !700, file: !367, line: 301, column: 22)
!700 = distinct !DILexicalBlock(scope: !701, file: !367, line: 299, column: 22)
!701 = distinct !DILexicalBlock(scope: !702, file: !367, line: 297, column: 22)
!702 = distinct !DILexicalBlock(scope: !692, file: !367, line: 296, column: 17)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_c2", scope: !694, file: !367, line: 311, type: !350)
!704 = !DISubprogram(name: "register_maps", scope: !373, file: !373, line: 304, type: !151, isLocal: true, isDefinition: true, scopeLine: 305, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @register_maps, variables: !705)
!705 = !{!706, !707, !733, !740}
!706 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !704, file: !373, line: 304, type: !12)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "h", scope: !704, file: !373, line: 306, type: !708)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64, align: 64)
!709 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !710)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "dbcs_map", file: !373, line: 52, size: 192, align: 64, elements: !711)
!711 = !{!712, !713, !723}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "charset", scope: !710, file: !373, line: 53, baseType: !36, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "encmap", scope: !710, file: !373, line: 54, baseType: !714, size: 64, align: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64, align: 64)
!715 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "unim_index", file: !373, line: 41, size: 128, align: 64, elements: !717)
!717 = !{!718, !721, !722}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !716, file: !373, line: 42, baseType: !719, size: 64, align: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !489)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !716, file: !373, line: 43, baseType: !354, size: 8, align: 8, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !716, file: !373, line: 43, baseType: !354, size: 8, align: 8, offset: 72)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "decmap", scope: !710, file: !373, line: 55, baseType: !724, size: 64, align: 64, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !726)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "dbcs_index", file: !373, line: 29, size: 128, align: 64, elements: !727)
!727 = !{!728, !731, !732}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !726, file: !373, line: 30, baseType: !729, size: 64, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64, align: 64)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !360)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !726, file: !373, line: 31, baseType: !354, size: 8, align: 8, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !726, file: !373, line: 31, baseType: !354, size: 8, align: 8, offset: 72)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mhname", scope: !734, file: !373, line: 309, type: !737)
!734 = distinct !DILexicalBlock(scope: !735, file: !373, line: 308, column: 56)
!735 = distinct !DILexicalBlock(scope: !736, file: !373, line: 308, column: 5)
!736 = distinct !DILexicalBlock(scope: !704, file: !373, line: 308, column: 5)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 2048, align: 8, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 256)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !734, file: !373, line: 310, type: !51)
!741 = !{!742, !765, !767, !768, !769, !771, !774, !778, !780, !784, !785, !789, !790, !794, !795, !799, !800, !804, !809, !810, !814, !815, !819, !820, !824, !832, !836, !837, !841, !842, !846, !847}
!742 = !DIGlobalVariable(name: "__module", scope: !0, file: !367, line: 760, type: !743, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @__module)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !744, line: 47, size: 832, align: 64, elements: !745)
!744 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!745 = !{!746, !755, !756, !757, !758, !761, !762, !763, !764}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !743, file: !744, line: 48, baseType: !747, size: 320, align: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !744, line: 38, baseType: !748)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !744, line: 33, size: 320, align: 64, elements: !749)
!749 = !{!750, !751, !753, !754}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !748, file: !744, line: 34, baseType: !13, size: 128, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !748, file: !744, line: 35, baseType: !752, size: 64, align: 64, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !748, file: !744, line: 36, baseType: !18, size: 64, align: 64, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !748, file: !744, line: 37, baseType: !12, size: 64, align: 64, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !743, file: !744, line: 49, baseType: !36, size: 64, align: 64, offset: 320)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !743, file: !744, line: 50, baseType: !36, size: 64, align: 64, offset: 384)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !743, file: !744, line: 51, baseType: !18, size: 64, align: 64, offset: 448)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !743, file: !744, line: 52, baseType: !759, size: 64, align: 64, offset: 512)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64, align: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !288, line: 47, baseType: !287)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !743, file: !744, line: 53, baseType: !149, size: 64, align: 64, offset: 576)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !743, file: !744, line: 54, baseType: !266, size: 64, align: 64, offset: 640)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !743, file: !744, line: 55, baseType: !149, size: 64, align: 64, offset: 704)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !743, file: !744, line: 56, baseType: !336, size: 64, align: 64, offset: 768)
!765 = !DIGlobalVariable(name: "__methods", scope: !0, file: !373, line: 298, type: !766, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMethodDef]* @__methods)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 512, align: 64, elements: !416)
!767 = !DIGlobalVariable(name: "cofunc", scope: !468, file: !373, line: 246, type: !12, isLocal: true, isDefinition: true, variable: %struct._object** @getmultibytecodec.cofunc)
!768 = !DIGlobalVariable(name: "codec_list", scope: !0, file: !367, line: 758, type: !381, isLocal: true, isDefinition: true, variable: %struct.MultibyteCodec** @codec_list)
!769 = !DIGlobalVariable(name: "_codec_list", scope: !0, file: !367, line: 750, type: !770, isLocal: true, isDefinition: true, variable: [8 x %struct.MultibyteCodec]* @_codec_list)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 4608, align: 64, elements: !408)
!771 = !DIGlobalVariable(name: "jisxcommon_encmap", scope: !0, file: !772, line: 2369, type: !773, isLocal: true, isDefinition: true, variable: [256 x %struct.unim_index]* @jisxcommon_encmap)
!772 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/cjkcodecs/mappings_jp.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !715, size: 32768, align: 64, elements: !738)
!774 = !DIGlobalVariable(name: "__jisxcommon_encmap", scope: !0, file: !772, line: 1115, type: !775, isLocal: true, isDefinition: true, variable: [22016 x i16]* @__jisxcommon_encmap)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !720, size: 352256, align: 16, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 22016)
!778 = !DIGlobalVariable(name: "jisx0208_decmap", scope: !0, file: !772, line: 533, type: !779, isLocal: true, isDefinition: true, variable: [256 x %struct.dbcs_index]* @jisx0208_decmap)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 32768, align: 64, elements: !738)
!780 = !DIGlobalVariable(name: "__jisx0208_decmap", scope: !0, file: !772, line: 1, type: !781, isLocal: true, isDefinition: true, variable: [6956 x i16]* @__jisx0208_decmap)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 111296, align: 16, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: 6956)
!784 = !DIGlobalVariable(name: "cp932ext_encmap", scope: !0, file: !772, line: 2819, type: !773, isLocal: true, isDefinition: true, variable: [256 x %struct.unim_index]* @cp932ext_encmap)
!785 = !DIGlobalVariable(name: "__cp932ext_encmap", scope: !0, file: !772, line: 2543, type: !786, isLocal: true, isDefinition: true, variable: [9686 x i16]* @__cp932ext_encmap)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !720, size: 154976, align: 16, elements: !787)
!787 = !{!788}
!788 = !DISubrange(count: 9686)
!789 = !DIGlobalVariable(name: "cp932ext_decmap", scope: !0, file: !772, line: 2511, type: !779, isLocal: true, isDefinition: true, variable: [256 x %struct.dbcs_index]* @cp932ext_decmap)
!790 = !DIGlobalVariable(name: "__cp932ext_decmap", scope: !0, file: !772, line: 2436, type: !791, isLocal: true, isDefinition: true, variable: [969 x i16]* @__cp932ext_decmap)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 15504, align: 16, elements: !792)
!792 = !{!793}
!793 = !DISubrange(count: 969)
!794 = !DIGlobalVariable(name: "jisx0212_decmap", scope: !0, file: !772, line: 1059, type: !779, isLocal: true, isDefinition: true, variable: [256 x %struct.dbcs_index]* @jisx0212_decmap)
!795 = !DIGlobalVariable(name: "__jisx0212_decmap", scope: !0, file: !772, line: 592, type: !796, isLocal: true, isDefinition: true, variable: [6179 x i16]* @__jisx0212_decmap)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 98864, align: 16, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 6179)
!799 = !DIGlobalVariable(name: "jisx0213_bmp_encmap", scope: !0, file: !772, line: 4204, type: !773, isLocal: true, isDefinition: true, variable: [256 x %struct.unim_index]* @jisx0213_bmp_encmap)
!800 = !DIGlobalVariable(name: "__jisx0213_bmp_encmap", scope: !0, file: !772, line: 3288, type: !801, isLocal: true, isDefinition: true, variable: [27287 x i16]* @__jisx0213_bmp_encmap)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !720, size: 436592, align: 16, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 27287)
!804 = !DIGlobalVariable(name: "jisx0213_pair_encmap", scope: !0, file: !805, line: 44, type: !806, isLocal: true, isDefinition: true, variable: [46 x %struct.pair_encodemap]* @jisx0213_pair_encmap)
!805 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/cjkcodecs/mappings_jisx0213_pair.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 2944, align: 32, elements: !807)
!807 = !{!808}
!808 = !DISubrange(count: 46)
!809 = !DIGlobalVariable(name: "jisx0213_emp_encmap", scope: !0, file: !772, line: 4688, type: !773, isLocal: true, isDefinition: true, variable: [256 x %struct.unim_index]* @jisx0213_emp_encmap)
!810 = !DIGlobalVariable(name: "__jisx0213_emp_encmap", scope: !0, file: !772, line: 4443, type: !811, isLocal: true, isDefinition: true, variable: [8787 x i16]* @__jisx0213_emp_encmap)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !720, size: 140592, align: 16, elements: !812)
!812 = !{!813}
!813 = !DISubrange(count: 8787)
!814 = !DIGlobalVariable(name: "jisx0213_1_bmp_decmap", scope: !0, file: !772, line: 3028, type: !779, isLocal: true, isDefinition: true, variable: [256 x %struct.dbcs_index]* @jisx0213_1_bmp_decmap)
!815 = !DIGlobalVariable(name: "__jisx0213_1_bmp_decmap", scope: !0, file: !772, line: 2879, type: !816, isLocal: true, isDefinition: true, variable: [2197 x i16]* @__jisx0213_1_bmp_decmap)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 35152, align: 16, elements: !817)
!817 = !{!818}
!818 = !DISubrange(count: 2197)
!819 = !DIGlobalVariable(name: "jisx0213_1_emp_decmap", scope: !0, file: !772, line: 4298, type: !779, isLocal: true, isDefinition: true, variable: [256 x %struct.dbcs_index]* @jisx0213_1_emp_decmap)
!820 = !DIGlobalVariable(name: "__jisx0213_1_emp_decmap", scope: !0, file: !772, line: 4285, type: !821, isLocal: true, isDefinition: true, variable: [340 x i16]* @__jisx0213_1_emp_decmap)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 5440, align: 16, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 340)
!824 = !DIGlobalVariable(name: "jisx0213_pair_decmap", scope: !0, file: !805, line: 13, type: !825, isLocal: true, isDefinition: true, variable: [256 x %struct.widedbcs_index]* @jisx0213_pair_decmap)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !826, size: 32768, align: 64, elements: !738)
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !827)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "widedbcs_index", file: !373, line: 35, size: 128, align: 64, elements: !828)
!828 = !{!829, !830, !831}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !827, file: !373, line: 36, baseType: !358, size: 64, align: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !827, file: !373, line: 37, baseType: !354, size: 8, align: 8, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !827, file: !373, line: 37, baseType: !354, size: 8, align: 8, offset: 72)
!832 = !DIGlobalVariable(name: "__jisx0213_pair_decmap", scope: !0, file: !805, line: 6, type: !833, isLocal: true, isDefinition: true, variable: [49 x i32]* @__jisx0213_pair_decmap)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 1568, align: 32, elements: !834)
!834 = !{!835}
!835 = !DISubrange(count: 49)
!836 = !DIGlobalVariable(name: "jisx0213_2_bmp_decmap", scope: !0, file: !772, line: 3248, type: !779, isLocal: true, isDefinition: true, variable: [256 x %struct.dbcs_index]* @jisx0213_2_bmp_decmap)
!837 = !DIGlobalVariable(name: "__jisx0213_2_bmp_decmap", scope: !0, file: !772, line: 3068, type: !838, isLocal: true, isDefinition: true, variable: [2425 x i16]* @__jisx0213_2_bmp_decmap)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 38800, align: 16, elements: !839)
!839 = !{!840}
!840 = !DISubrange(count: 2425)
!841 = !DIGlobalVariable(name: "jisx0213_2_emp_decmap", scope: !0, file: !772, line: 4403, type: !779, isLocal: true, isDefinition: true, variable: [256 x %struct.dbcs_index]* @jisx0213_2_emp_decmap)
!842 = !DIGlobalVariable(name: "__jisx0213_2_emp_decmap", scope: !0, file: !772, line: 4333, type: !843, isLocal: true, isDefinition: true, variable: [2053 x i16]* @__jisx0213_2_emp_decmap)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 32848, align: 16, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 2053)
!846 = !DIGlobalVariable(name: "mapping_list", scope: !0, file: !367, line: 748, type: !708, isLocal: true, isDefinition: true, variable: %struct.dbcs_map** @mapping_list)
!847 = !DIGlobalVariable(name: "_mapping_list", scope: !0, file: !367, line: 736, type: !848, isLocal: true, isDefinition: true, variable: [12 x %struct.dbcs_map]* @_mapping_list)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 2304, align: 64, elements: !849)
!849 = !{!850}
!850 = !DISubrange(count: 12)
!851 = !{i32 2, !"Dwarf Version", i32 4}
!852 = !{i32 2, !"Debug Info Version", i32 3}
!853 = !{i32 1, !"PIC Level", i32 2}
!854 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!855 = !DILocation(line: 760, column: 219, scope: !366)
!856 = !DIExpression()
!857 = !DILocation(line: 760, column: 229, scope: !366)
!858 = !DILocation(line: 760, column: 233, scope: !366)
!859 = !{!860, !860, i64 0}
!860 = !{!"any pointer", !861, i64 0}
!861 = !{!"omnipotent char", !862, i64 0}
!862 = !{!"Simple C/C++ TBAA"}
!863 = !DILocation(line: 760, column: 272, scope: !864)
!864 = distinct !DILexicalBlock(scope: !366, file: !367, line: 760, column: 272)
!865 = !DILocation(line: 760, column: 274, scope: !864)
!866 = !DILocation(line: 760, column: 272, scope: !366)
!867 = !DILocation(line: 760, column: 309, scope: !868)
!868 = !DILexicalBlockFile(scope: !864, file: !367, discriminator: 1)
!869 = !DILocation(line: 760, column: 295, scope: !864)
!870 = !DILocation(line: 760, column: 289, scope: !864)
!871 = !DILocation(line: 760, column: 320, scope: !872)
!872 = !DILexicalBlockFile(scope: !873, file: !367, discriminator: 3)
!873 = !DILexicalBlockFile(scope: !366, file: !367, discriminator: 2)
!874 = !DILocation(line: 760, column: 323, scope: !366)
!875 = !DILocation(line: 760, column: 313, scope: !366)
!876 = !DILocation(line: 304, column: 25, scope: !704)
!877 = !DILocation(line: 306, column: 5, scope: !704)
!878 = !DILocation(line: 306, column: 28, scope: !704)
!879 = !DILocation(line: 308, column: 14, scope: !736)
!880 = !DILocation(line: 308, column: 12, scope: !736)
!881 = !DILocation(line: 308, column: 10, scope: !736)
!882 = !DILocation(line: 308, column: 28, scope: !883)
!883 = !DILexicalBlockFile(scope: !884, file: !373, discriminator: 2)
!884 = !DILexicalBlockFile(scope: !735, file: !373, discriminator: 1)
