; ModuleID = 'programs_new/Python-new/_collectionsmodule.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !411, globals: !1091)
!1 = !DIFile(filename: "_collectionsmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !350, !374, !11, !94, !375, !385, !403}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !7, line: 109, baseType: !8)
!7 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !7, line: 105, size: 128, align: 64, elements: !9)
!9 = !{!10, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !8, file: !7, line: 107, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !12, line: 177, baseType: !13)
!12 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !14, line: 102, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !16, line: 181, baseType: !17)
!16 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !8, file: !7, line: 108, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !7, line: 334, size: 3200, align: 64, elements: !21)
!21 = !{!22, !28, !32, !33, !34, !39, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !20, file: !7, line: 335, baseType: !23, size: 192, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !7, line: 114, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 111, size: 192, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !24, file: !7, line: 112, baseType: !6, size: 128, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !24, file: !7, line: 113, baseType: !11, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !20, file: !7, line: 336, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !20, file: !7, line: 341, baseType: !35, size: 64, align: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !7, line: 308, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !5}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !20, file: !7, line: 342, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !7, line: 314, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !5, !45, !44}
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !14, line: 48, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 246, size: 1728, align: 64, elements: !49)
!48 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!49 = !{!50, !51, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !71, !72, !73, !74, !76, !78, !80, !84, !87, !89, !90, !91, !92, !93, !97, !98}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !48, line: 247, baseType: !44, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !47, file: !48, line: 252, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !47, file: !48, line: 253, baseType: !52, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !47, file: !48, line: 254, baseType: !52, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !47, file: !48, line: 255, baseType: !52, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !47, file: !48, line: 256, baseType: !52, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !47, file: !48, line: 257, baseType: !52, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !47, file: !48, line: 258, baseType: !52, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !47, file: !48, line: 259, baseType: !52, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !47, file: !48, line: 261, baseType: !52, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !47, file: !48, line: 262, baseType: !52, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !47, file: !48, line: 263, baseType: !52, size: 64, align: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !47, file: !48, line: 265, baseType: !64, size: 64, align: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !48, line: 161, size: 192, align: 64, elements: !66)
!66 = !{!67, !68, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !65, file: !48, line: 162, baseType: !64, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !65, file: !48, line: 163, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !65, file: !48, line: 167, baseType: !44, size: 32, align: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !47, file: !48, line: 267, baseType: !69, size: 64, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !47, file: !48, line: 269, baseType: !44, size: 32, align: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !47, file: !48, line: 273, baseType: !44, size: 32, align: 32, offset: 928)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !47, file: !48, line: 275, baseType: !75, size: 64, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !16, line: 140, baseType: !17)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !47, file: !48, line: 279, baseType: !77, size: 16, align: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !47, file: !48, line: 280, baseType: !79, size: 8, align: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !47, file: !48, line: 281, baseType: !81, size: 8, align: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !47, file: !48, line: 285, baseType: !85, size: 64, align: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !48, line: 155, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !47, file: !48, line: 294, baseType: !88, size: 64, align: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !16, line: 141, baseType: !17)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !47, file: !48, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !47, file: !48, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !47, file: !48, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !47, file: !48, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !47, file: !48, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !47, file: !48, line: 309, baseType: !44, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !47, file: !48, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !20, file: !7, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !7, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!5, !5, !52}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !20, file: !7, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !7, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!44, !5, !52, !5}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !20, file: !7, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !20, file: !7, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !7, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!5, !5}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !20, file: !7, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !7, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !7, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !7, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!5, !5, !5}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !7, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !7, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !7, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !7, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !7, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !7, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!5, !5, !5, !5}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !7, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !7, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !7, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !7, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !7, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !7, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!44, !5}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !7, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !7, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !7, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !7, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !7, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !7, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !7, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !7, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !7, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !7, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !7, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !7, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !7, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !7, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !7, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !7, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !7, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !7, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !7, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !7, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !7, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !7, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !7, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !7, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !20, file: !7, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !7, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !7, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !7, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!11, !5}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !7, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !7, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !7, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!5, !5, !11}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !7, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !7, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !7, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !7, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!44, !5, !11, !5}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !7, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !7, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !7, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!44, !5, !5}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !7, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !7, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !20, file: !7, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !7, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !7, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !7, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !7, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !7, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!44, !5, !5, !5}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !20, file: !7, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !7, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !5}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !12, line: 186, baseType: !11)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !20, file: !7, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !20, file: !7, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !20, file: !7, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !7, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !20, file: !7, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !7, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !20, file: !7, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !7, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !7, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !7, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!44, !5, !235, !44}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !7, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !7, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !7, line: 179, baseType: !4, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !7, line: 180, baseType: !5, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !7, line: 181, baseType: !11, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !7, line: 182, baseType: !11, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !7, line: 184, baseType: !44, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !7, line: 185, baseType: !44, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !7, line: 186, baseType: !52, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !7, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !7, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !7, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !7, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !7, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !7, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !5, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !20, file: !7, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !20, file: !7, line: 368, baseType: !29, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !20, file: !7, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !7, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!44, !5, !263, !4}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !7, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!44, !5, !4}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !20, file: !7, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !20, file: !7, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !7, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!5, !5, !5, !44}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !20, file: !7, line: 382, baseType: !11, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !20, file: !7, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !7, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !20, file: !7, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !7, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !20, file: !7, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !29, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !44, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !29, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !20, file: !7, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !291, line: 18, size: 320, align: 64, elements: !292)
!291 = !DIFile(filename: "Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!292 = !{!293, !294, !295, !296, !297}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !291, line: 19, baseType: !52, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !290, file: !291, line: 20, baseType: !44, size: 32, align: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !290, file: !291, line: 21, baseType: !11, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !290, file: !291, line: 22, baseType: !44, size: 32, align: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !290, file: !291, line: 23, baseType: !52, size: 64, align: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !20, file: !7, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !52, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!5, !5, !4}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!44, !5, !5, !4}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !52, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !20, file: !7, line: 392, baseType: !19, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !20, file: !7, line: 393, baseType: !5, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !20, file: !7, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !7, line: 325, baseType: !134)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !20, file: !7, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !7, line: 326, baseType: !210)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !20, file: !7, line: 396, baseType: !11, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !20, file: !7, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !7, line: 327, baseType: !210)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !20, file: !7, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !7, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!5, !19, !11}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !20, file: !7, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !7, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!5, !19, !5, !5}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !20, file: !7, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !7, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !4}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !20, file: !7, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !20, file: !7, line: 402, baseType: !5, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !20, file: !7, line: 403, baseType: !5, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !20, file: !7, line: 404, baseType: !5, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !20, file: !7, line: 405, baseType: !5, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !20, file: !7, line: 406, baseType: !5, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !20, file: !7, line: 407, baseType: !35, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !20, file: !7, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !20, file: !7, line: 412, baseType: !35, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "dequeobject", file: !352, line: 128, baseType: !353)
!352 = !DIFile(filename: "./Modules/_collectionsmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!353 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 119, size: 640, align: 64, elements: !354)
!354 = !{!355, !356, !368, !369, !370, !371, !372, !373}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !353, file: !352, line: 120, baseType: !23, size: 192, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "leftblock", scope: !353, file: !352, line: 121, baseType: !357, size: 64, align: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "block", file: !352, line: 54, baseType: !359)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLOCK", file: !352, line: 50, size: 4096, align: 64, elements: !360)
!360 = !{!361, !363, !367}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "leftlink", scope: !359, file: !352, line: 51, baseType: !362, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !359, file: !352, line: 52, baseType: !364, size: 3968, align: 64, offset: 64)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 3968, align: 64, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 62)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "rightlink", scope: !359, file: !352, line: 53, baseType: !362, size: 64, align: 64, offset: 4032)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "rightblock", scope: !353, file: !352, line: 122, baseType: !357, size: 64, align: 64, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "leftindex", scope: !353, file: !352, line: 123, baseType: !11, size: 64, align: 64, offset: 320)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "rightindex", scope: !353, file: !352, line: 124, baseType: !11, size: 64, align: 64, offset: 384)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !353, file: !352, line: 125, baseType: !17, size: 64, align: 64, offset: 448)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !353, file: !352, line: 126, baseType: !11, size: 64, align: 64, offset: 512)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !353, file: !352, line: 127, baseType: !5, size: 64, align: 64, offset: 576)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "dequeiterobject", file: !352, line: 1203, baseType: !377)
!377 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 1196, size: 448, align: 64, elements: !378)
!378 = !{!379, !380, !381, !382, !383, !384}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !377, file: !352, line: 1197, baseType: !6, size: 128, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !377, file: !352, line: 1198, baseType: !11, size: 64, align: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !377, file: !352, line: 1199, baseType: !357, size: 64, align: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "deque", scope: !377, file: !352, line: 1200, baseType: !350, size: 64, align: 64, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !377, file: !352, line: 1201, baseType: !17, size: 64, align: 64, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !377, file: !352, line: 1202, baseType: !11, size: 64, align: 64, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "defdictobject", file: !352, line: 1486, baseType: !387)
!387 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 1483, size: 384, align: 64, elements: !388)
!388 = !{!389, !402}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !387, file: !352, line: 1484, baseType: !390, size: 320, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictObject", file: !391, line: 28, baseType: !392)
!391 = !DIFile(filename: "Include/dictobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!392 = !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 23, size: 320, align: 64, elements: !393)
!393 = !{!394, !395, !396, !400}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !392, file: !391, line: 24, baseType: !6, size: 128, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ma_used", scope: !392, file: !391, line: 25, baseType: !11, size: 64, align: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ma_keys", scope: !392, file: !391, line: 26, baseType: !397, size: 64, align: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictKeysObject", file: !391, line: 18, baseType: !399)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "_dictkeysobject", file: !7, line: 461, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ma_values", scope: !392, file: !391, line: 27, baseType: !401, size: 64, align: 64, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "default_factory", scope: !387, file: !352, line: 1485, baseType: !5, size: 64, align: 64, offset: 320)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !405, line: 33, baseType: !406)
!405 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!406 = !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 25, size: 256, align: 64, elements: !407)
!407 = !{!408, !409}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !406, file: !405, line: 26, baseType: !23, size: 192, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !406, file: !405, line: 27, baseType: !410, size: 64, align: 64, offset: 192)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, align: 64, elements: !82)
!411 = !{!412, !417, !486, !491, !496, !504, !509, !519, !534, !543, !565, !571, !579, !586, !615, !624, !652, !659, !665, !711, !717, !729, !741, !744, !747, !759, !788, !808, !824, !828, !839, !844, !852, !855, !874, !889, !900, !925, !934, !945, !962, !965, !988, !1010, !1020, !1031, !1037, !1040, !1043, !1065, !1069}
!412 = !DISubprogram(name: "PyInit__collections", scope: !352, file: !352, line: 1885, type: !413, isLocal: false, isDefinition: true, scopeLine: 1886, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__collections, variables: !415)
!413 = !DISubroutineType(types: !414)
!414 = !{!5}
!415 = !{!416}
!416 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !412, file: !352, line: 1887, type: !5)
!417 = !DISubprogram(name: "_count_elements", scope: !352, file: !352, line: 1766, type: !126, isLocal: true, isDefinition: true, scopeLine: 1767, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @_count_elements, variables: !418)
!418 = !{!419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !441, !445, !447, !451, !453, !457, !459, !461, !463, !466, !468, !471, !473, !476, !478, !481, !483}
!419 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !417, file: !352, line: 1766, type: !5)
!420 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !417, file: !352, line: 1766, type: !5)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !417, file: !352, line: 1770, type: !5)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iterable", scope: !417, file: !352, line: 1770, type: !5)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapping", scope: !417, file: !352, line: 1770, type: !5)
!424 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldval", scope: !417, file: !352, line: 1770, type: !5)
!425 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newval", scope: !417, file: !352, line: 1771, type: !5)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !417, file: !352, line: 1772, type: !5)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zero", scope: !417, file: !352, line: 1773, type: !5)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "one", scope: !417, file: !352, line: 1774, type: !5)
!429 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bound_get", scope: !417, file: !352, line: 1775, type: !5)
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapping_get", scope: !417, file: !352, line: 1776, type: !5)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict_get", scope: !417, file: !352, line: 1777, type: !5)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mapping_setitem", scope: !417, file: !352, line: 1778, type: !5)
!433 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict_setitem", scope: !417, file: !352, line: 1779, type: !5)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !435, file: !352, line: 1816, type: !5)
!435 = distinct !DILexicalBlock(scope: !436, file: !352, line: 1816, column: 20)
!436 = distinct !DILexicalBlock(scope: !437, file: !352, line: 1810, column: 20)
!437 = distinct !DILexicalBlock(scope: !438, file: !352, line: 1807, column: 17)
!438 = distinct !DILexicalBlock(scope: !439, file: !352, line: 1802, column: 19)
!439 = distinct !DILexicalBlock(scope: !440, file: !352, line: 1801, column: 75)
!440 = distinct !DILexicalBlock(scope: !417, file: !352, line: 1800, column: 9)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !442, file: !352, line: 1816, type: !5)
!442 = distinct !DILexicalBlock(scope: !443, file: !352, line: 1816, column: 119)
!443 = distinct !DILexicalBlock(scope: !444, file: !352, line: 1816, column: 91)
!444 = distinct !DILexicalBlock(scope: !435, file: !352, line: 1816, column: 68)
!445 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !446, file: !352, line: 1818, type: !5)
!446 = distinct !DILexicalBlock(scope: !438, file: !352, line: 1818, column: 16)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !448, file: !352, line: 1837, type: !5)
!448 = distinct !DILexicalBlock(scope: !449, file: !352, line: 1837, column: 16)
!449 = distinct !DILexicalBlock(scope: !450, file: !352, line: 1829, column: 19)
!450 = distinct !DILexicalBlock(scope: !440, file: !352, line: 1820, column: 12)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !452, file: !352, line: 1842, type: !5)
!452 = distinct !DILexicalBlock(scope: !449, file: !352, line: 1842, column: 16)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !454, file: !352, line: 1842, type: !5)
!454 = distinct !DILexicalBlock(scope: !455, file: !352, line: 1842, column: 115)
!455 = distinct !DILexicalBlock(scope: !456, file: !352, line: 1842, column: 87)
!456 = distinct !DILexicalBlock(scope: !452, file: !352, line: 1842, column: 64)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !458, file: !352, line: 1843, type: !5)
!458 = distinct !DILexicalBlock(scope: !449, file: !352, line: 1843, column: 16)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !460, file: !352, line: 1848, type: !5)
!460 = distinct !DILexicalBlock(scope: !417, file: !352, line: 1848, column: 8)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !462, file: !352, line: 1849, type: !5)
!462 = distinct !DILexicalBlock(scope: !417, file: !352, line: 1849, column: 8)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !464, file: !352, line: 1849, type: !5)
!464 = distinct !DILexicalBlock(scope: !465, file: !352, line: 1849, column: 95)
!465 = distinct !DILexicalBlock(scope: !462, file: !352, line: 1849, column: 61)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !467, file: !352, line: 1850, type: !5)
!467 = distinct !DILexicalBlock(scope: !417, file: !352, line: 1850, column: 8)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !469, file: !352, line: 1850, type: !5)
!469 = distinct !DILexicalBlock(scope: !470, file: !352, line: 1850, column: 98)
!470 = distinct !DILexicalBlock(scope: !467, file: !352, line: 1850, column: 64)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !472, file: !352, line: 1851, type: !5)
!472 = distinct !DILexicalBlock(scope: !417, file: !352, line: 1851, column: 8)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !474, file: !352, line: 1851, type: !5)
!474 = distinct !DILexicalBlock(scope: !475, file: !352, line: 1851, column: 101)
!475 = distinct !DILexicalBlock(scope: !472, file: !352, line: 1851, column: 67)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !477, file: !352, line: 1852, type: !5)
!477 = distinct !DILexicalBlock(scope: !417, file: !352, line: 1852, column: 8)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !479, file: !352, line: 1852, type: !5)
!479 = distinct !DILexicalBlock(scope: !480, file: !352, line: 1852, column: 96)
!480 = distinct !DILexicalBlock(scope: !477, file: !352, line: 1852, column: 62)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !482, file: !352, line: 1853, type: !5)
!482 = distinct !DILexicalBlock(scope: !417, file: !352, line: 1853, column: 8)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !484, file: !352, line: 1853, type: !5)
!484 = distinct !DILexicalBlock(scope: !485, file: !352, line: 1853, column: 95)
!485 = distinct !DILexicalBlock(scope: !482, file: !352, line: 1853, column: 61)
!486 = !DISubprogram(name: "deque_dealloc", scope: !352, file: !352, line: 841, type: !487, isLocal: true, isDefinition: true, scopeLine: 842, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.dequeobject*)* @deque_dealloc, variables: !489)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !350}
!489 = !{!490}
!490 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !486, file: !352, line: 841, type: !350)
!491 = !DISubprogram(name: "freeblock", scope: !352, file: !352, line: 109, type: !492, isLocal: true, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.BLOCK*)* @freeblock, variables: !494)
!492 = !DISubroutineType(types: !493)
!493 = !{null, !357}
!494 = !{!495}
!495 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 1, scope: !491, file: !352, line: 109, type: !357)
!496 = !DISubprogram(name: "deque_repr", scope: !352, file: !352, line: 923, type: !116, isLocal: true, isDefinition: true, scopeLine: 924, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @deque_repr, variables: !497)
!497 = !{!498, !499, !500, !501, !502}
!498 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !496, file: !352, line: 923, type: !5)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aslist", scope: !496, file: !352, line: 925, type: !5)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !496, file: !352, line: 925, type: !5)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !496, file: !352, line: 926, type: !44)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !503, file: !352, line: 946, type: !5)
!503 = distinct !DILexicalBlock(scope: !496, file: !352, line: 946, column: 8)
!504 = !DISubprogram(name: "deque_len", scope: !352, file: !352, line: 679, type: !505, isLocal: true, isDefinition: true, scopeLine: 680, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.dequeobject*)* @deque_len, variables: !507)
!505 = !DISubroutineType(types: !506)
!506 = !{!11, !350}
!507 = !{!508}
!508 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !504, file: !352, line: 679, type: !350)
!509 = !DISubprogram(name: "deque_item", scope: !352, file: !352, line: 735, type: !510, isLocal: true, isDefinition: true, scopeLine: 736, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, i64)* @deque_item, variables: !512)
!510 = !DISubroutineType(types: !511)
!511 = !{!5, !350, !11}
!512 = !{!513, !514, !515, !516, !517, !518}
!513 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !509, file: !352, line: 735, type: !350)
!514 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !509, file: !352, line: 735, type: !11)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !509, file: !352, line: 737, type: !357)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !509, file: !352, line: 738, type: !5)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !509, file: !352, line: 739, type: !11)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !509, file: !352, line: 739, type: !11)
!519 = !DISubprogram(name: "deque_ass_item", scope: !352, file: !352, line: 797, type: !520, isLocal: true, isDefinition: true, scopeLine: 798, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.dequeobject*, i64, %struct._object*)* @deque_ass_item, variables: !522)
!520 = !DISubroutineType(types: !521)
!521 = !{!44, !350, !11, !5}
!522 = !{!523, !524, !525, !526, !527, !528, !529, !530, !531, !532}
!523 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !519, file: !352, line: 797, type: !350)
!524 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !519, file: !352, line: 797, type: !11)
!525 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 3, scope: !519, file: !352, line: 797, type: !5)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_value", scope: !519, file: !352, line: 799, type: !5)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !519, file: !352, line: 800, type: !357)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !519, file: !352, line: 801, type: !11)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !519, file: !352, line: 801, type: !11)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halflen", scope: !519, file: !352, line: 801, type: !11)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !519, file: !352, line: 801, type: !11)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !533, file: !352, line: 827, type: !5)
!533 = distinct !DILexicalBlock(scope: !519, file: !352, line: 827, column: 8)
!534 = !DISubprogram(name: "deque_del_item", scope: !352, file: !352, line: 781, type: !535, isLocal: true, isDefinition: true, scopeLine: 782, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.dequeobject*, i64)* @deque_del_item, variables: !537)
!535 = !DISubroutineType(types: !536)
!536 = !{!44, !350, !11}
!537 = !{!538, !539, !540, !541}
!538 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !534, file: !352, line: 781, type: !350)
!539 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !534, file: !352, line: 781, type: !11)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !534, file: !352, line: 783, type: !5)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !542, file: !352, line: 791, type: !5)
!542 = distinct !DILexicalBlock(scope: !534, file: !352, line: 791, column: 8)
!543 = !DISubprogram(name: "_deque_rotate", scope: !352, file: !352, line: 458, type: !535, isLocal: true, isDefinition: true, scopeLine: 459, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.dequeobject*, i64)* @_deque_rotate, variables: !544)
!544 = !{!545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !558, !559, !560, !563, !564}
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !543, file: !352, line: 458, type: !350)
!546 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !543, file: !352, line: 458, type: !11)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !543, file: !352, line: 460, type: !357)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "leftblock", scope: !543, file: !352, line: 461, type: !357)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rightblock", scope: !543, file: !352, line: 462, type: !357)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "leftindex", scope: !543, file: !352, line: 463, type: !11)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rightindex", scope: !543, file: !352, line: 464, type: !11)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !543, file: !352, line: 465, type: !11)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "halflen", scope: !543, file: !352, line: 465, type: !11)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !543, file: !352, line: 466, type: !44)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "src", scope: !556, file: !352, line: 498, type: !401)
!556 = distinct !DILexicalBlock(scope: !557, file: !352, line: 497, column: 9)
!557 = distinct !DILexicalBlock(scope: !543, file: !352, line: 481, column: 19)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !556, file: !352, line: 498, type: !401)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !556, file: !352, line: 499, type: !11)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "src", scope: !561, file: !352, line: 542, type: !401)
!561 = distinct !DILexicalBlock(scope: !562, file: !352, line: 541, column: 9)
!562 = distinct !DILexicalBlock(scope: !543, file: !352, line: 525, column: 19)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !561, file: !352, line: 542, type: !401)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !561, file: !352, line: 543, type: !11)
!565 = !DISubprogram(name: "newblock", scope: !352, file: !352, line: 87, type: !566, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, function: %struct.BLOCK* (i64)* @newblock, variables: !568)
!566 = !DISubroutineType(types: !567)
!567 = !{!357, !11}
!568 = !{!569, !570}
!569 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 1, scope: !565, file: !352, line: 87, type: !11)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !565, file: !352, line: 88, type: !357)
!571 = !DISubprogram(name: "deque_popleft", scope: !352, file: !352, line: 218, type: !572, isLocal: true, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, %struct._object*)* @deque_popleft, variables: !574)
!572 = !DISubroutineType(types: !573)
!573 = !{!5, !350, !5}
!574 = !{!575, !576, !577, !578}
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !571, file: !352, line: 218, type: !350)
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !571, file: !352, line: 218, type: !5)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !571, file: !352, line: 220, type: !5)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prevblock", scope: !571, file: !352, line: 221, type: !357)
!579 = !DISubprogram(name: "deque_inplace_concat", scope: !352, file: !352, line: 445, type: !572, isLocal: true, isDefinition: true, scopeLine: 446, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, %struct._object*)* @deque_inplace_concat, variables: !580)
!580 = !{!581, !582, !583, !584}
!581 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !579, file: !352, line: 445, type: !350)
!582 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "other", arg: 2, scope: !579, file: !352, line: 445, type: !5)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !579, file: !352, line: 447, type: !5)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !585, file: !352, line: 452, type: !5)
!585 = distinct !DILexicalBlock(scope: !579, file: !352, line: 452, column: 8)
!586 = !DISubprogram(name: "deque_extend", scope: !352, file: !352, line: 323, type: !572, isLocal: true, isDefinition: true, scopeLine: 324, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, %struct._object*)* @deque_extend, variables: !587)
!587 = !{!588, !589, !590, !591, !592, !595, !596, !598, !602, !606, !608, !611, !613}
!588 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !586, file: !352, line: 323, type: !350)
!589 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iterable", arg: 2, scope: !586, file: !352, line: 323, type: !5)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !586, file: !352, line: 325, type: !5)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !586, file: !352, line: 325, type: !5)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !593, file: !352, line: 329, type: !5)
!593 = distinct !DILexicalBlock(scope: !594, file: !352, line: 328, column: 40)
!594 = distinct !DILexicalBlock(scope: !586, file: !352, line: 328, column: 9)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !593, file: !352, line: 330, type: !5)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !597, file: !352, line: 334, type: !5)
!597 = distinct !DILexicalBlock(scope: !593, file: !352, line: 334, column: 12)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !599, file: !352, line: 356, type: !357)
!599 = distinct !DILexicalBlock(scope: !600, file: !352, line: 355, column: 41)
!600 = distinct !DILexicalBlock(scope: !601, file: !352, line: 355, column: 13)
!601 = distinct !DILexicalBlock(scope: !586, file: !352, line: 353, column: 52)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !603, file: !352, line: 358, type: !5)
!603 = distinct !DILexicalBlock(scope: !604, file: !352, line: 358, column: 20)
!604 = distinct !DILexicalBlock(scope: !605, file: !352, line: 357, column: 34)
!605 = distinct !DILexicalBlock(scope: !599, file: !352, line: 357, column: 17)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !607, file: !352, line: 359, type: !5)
!607 = distinct !DILexicalBlock(scope: !604, file: !352, line: 359, column: 20)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !609, file: !352, line: 372, type: !5)
!609 = distinct !DILexicalBlock(scope: !610, file: !352, line: 372, column: 88)
!610 = distinct !DILexicalBlock(scope: !601, file: !352, line: 372, column: 13)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !612, file: !352, line: 372, type: !5)
!612 = distinct !DILexicalBlock(scope: !609, file: !352, line: 372, column: 156)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !614, file: !352, line: 374, type: !5)
!614 = distinct !DILexicalBlock(scope: !586, file: !352, line: 374, column: 8)
!615 = !DISubprogram(name: "consume_iterator", scope: !352, file: !352, line: 309, type: !116, isLocal: true, isDefinition: true, scopeLine: 310, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @consume_iterator, variables: !616)
!616 = !{!617, !618, !619, !622}
!617 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "it", arg: 1, scope: !615, file: !352, line: 309, type: !5)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !615, file: !352, line: 311, type: !5)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !620, file: !352, line: 314, type: !5)
!620 = distinct !DILexicalBlock(scope: !621, file: !352, line: 314, column: 12)
!621 = distinct !DILexicalBlock(scope: !615, file: !352, line: 313, column: 52)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !623, file: !352, line: 316, type: !5)
!623 = distinct !DILexicalBlock(scope: !615, file: !352, line: 316, column: 8)
!624 = !DISubprogram(name: "deque_traverse", scope: !352, file: !352, line: 857, type: !625, isLocal: true, isDefinition: true, scopeLine: 858, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.dequeobject*, i32 (%struct._object*, i8*)*, i8*)* @deque_traverse, variables: !627)
!625 = !DISubroutineType(types: !626)
!626 = !{!44, !350, !263, !4}
!627 = !{!628, !629, !630, !631, !632, !633, !634, !635, !645}
!628 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !624, file: !352, line: 857, type: !350)
!629 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !624, file: !352, line: 857, type: !263)
!630 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !624, file: !352, line: 857, type: !4)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !624, file: !352, line: 859, type: !357)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !624, file: !352, line: 860, type: !5)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !624, file: !352, line: 861, type: !11)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indexlo", scope: !624, file: !352, line: 862, type: !11)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !636, file: !352, line: 867, type: !44)
!636 = distinct !DILexicalBlock(scope: !637, file: !352, line: 867, column: 28)
!637 = distinct !DILexicalBlock(scope: !638, file: !352, line: 867, column: 22)
!638 = distinct !DILexicalBlock(scope: !639, file: !352, line: 867, column: 16)
!639 = distinct !DILexicalBlock(scope: !640, file: !352, line: 865, column: 53)
!640 = distinct !DILexicalBlock(scope: !641, file: !352, line: 865, column: 9)
!641 = distinct !DILexicalBlock(scope: !642, file: !352, line: 865, column: 9)
!642 = distinct !DILexicalBlock(scope: !643, file: !352, line: 864, column: 74)
!643 = distinct !DILexicalBlock(scope: !644, file: !352, line: 864, column: 5)
!644 = distinct !DILexicalBlock(scope: !624, file: !352, line: 864, column: 5)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !646, file: !352, line: 873, type: !44)
!646 = distinct !DILexicalBlock(scope: !647, file: !352, line: 873, column: 24)
!647 = distinct !DILexicalBlock(scope: !648, file: !352, line: 873, column: 18)
!648 = distinct !DILexicalBlock(scope: !649, file: !352, line: 873, column: 12)
!649 = distinct !DILexicalBlock(scope: !650, file: !352, line: 871, column: 64)
!650 = distinct !DILexicalBlock(scope: !651, file: !352, line: 871, column: 5)
!651 = distinct !DILexicalBlock(scope: !624, file: !352, line: 871, column: 5)
!652 = !DISubprogram(name: "deque_clear", scope: !352, file: !352, line: 720, type: !487, isLocal: true, isDefinition: true, scopeLine: 721, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.dequeobject*)* @deque_clear, variables: !653)
!653 = !{!654, !655, !656}
!654 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !652, file: !352, line: 720, type: !350)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !652, file: !352, line: 722, type: !5)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !657, file: !352, line: 727, type: !5)
!657 = distinct !DILexicalBlock(scope: !658, file: !352, line: 727, column: 12)
!658 = distinct !DILexicalBlock(scope: !652, file: !352, line: 724, column: 48)
!659 = !DISubprogram(name: "deque_pop", scope: !352, file: !352, line: 181, type: !572, isLocal: true, isDefinition: true, scopeLine: 182, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, %struct._object*)* @deque_pop, variables: !660)
!660 = !{!661, !662, !663, !664}
!661 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !659, file: !352, line: 181, type: !350)
!662 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !659, file: !352, line: 181, type: !5)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !659, file: !352, line: 183, type: !5)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prevblock", scope: !659, file: !352, line: 184, type: !357)
!665 = !DISubprogram(name: "deque_richcompare", scope: !352, file: !352, line: 952, type: !271, isLocal: true, isDefinition: true, scopeLine: 953, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @deque_richcompare, variables: !666)
!666 = !{!667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !685, !687, !689, !691, !693, !696, !698, !701, !703, !706, !708}
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !665, file: !352, line: 952, type: !5)
!668 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !665, file: !352, line: 952, type: !5)
!669 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !665, file: !352, line: 952, type: !44)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it1", scope: !665, file: !352, line: 954, type: !5)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it2", scope: !665, file: !352, line: 954, type: !5)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !665, file: !352, line: 954, type: !5)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !665, file: !352, line: 954, type: !5)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vs", scope: !665, file: !352, line: 955, type: !11)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ws", scope: !665, file: !352, line: 955, type: !11)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !665, file: !352, line: 956, type: !44)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmp", scope: !665, file: !352, line: 956, type: !44)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !679, file: !352, line: 996, type: !5)
!679 = distinct !DILexicalBlock(scope: !680, file: !352, line: 996, column: 16)
!680 = distinct !DILexicalBlock(scope: !681, file: !352, line: 994, column: 21)
!681 = distinct !DILexicalBlock(scope: !682, file: !352, line: 994, column: 13)
!682 = distinct !DILexicalBlock(scope: !683, file: !352, line: 986, column: 14)
!683 = distinct !DILexicalBlock(scope: !684, file: !352, line: 986, column: 5)
!684 = distinct !DILexicalBlock(scope: !665, file: !352, line: 986, column: 5)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !686, file: !352, line: 997, type: !5)
!686 = distinct !DILexicalBlock(scope: !680, file: !352, line: 997, column: 16)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !688, file: !352, line: 1000, type: !5)
!688 = distinct !DILexicalBlock(scope: !682, file: !352, line: 1000, column: 12)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !690, file: !352, line: 1001, type: !5)
!690 = distinct !DILexicalBlock(scope: !682, file: !352, line: 1001, column: 12)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !692, file: !352, line: 1006, type: !5)
!692 = distinct !DILexicalBlock(scope: !665, file: !352, line: 1006, column: 8)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !694, file: !352, line: 1006, type: !5)
!694 = distinct !DILexicalBlock(scope: !695, file: !352, line: 1006, column: 93)
!695 = distinct !DILexicalBlock(scope: !692, file: !352, line: 1006, column: 59)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !697, file: !352, line: 1007, type: !5)
!697 = distinct !DILexicalBlock(scope: !665, file: !352, line: 1007, column: 8)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !699, file: !352, line: 1007, type: !5)
!699 = distinct !DILexicalBlock(scope: !700, file: !352, line: 1007, column: 93)
!700 = distinct !DILexicalBlock(scope: !697, file: !352, line: 1007, column: 59)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !702, file: !352, line: 1020, type: !5)
!702 = distinct !DILexicalBlock(scope: !665, file: !352, line: 1020, column: 8)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !704, file: !352, line: 1020, type: !5)
!704 = distinct !DILexicalBlock(scope: !705, file: !352, line: 1020, column: 95)
!705 = distinct !DILexicalBlock(scope: !702, file: !352, line: 1020, column: 61)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !707, file: !352, line: 1021, type: !5)
!707 = distinct !DILexicalBlock(scope: !665, file: !352, line: 1021, column: 8)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !709, file: !352, line: 1021, type: !5)
!709 = distinct !DILexicalBlock(scope: !710, file: !352, line: 1021, column: 95)
!710 = distinct !DILexicalBlock(scope: !707, file: !352, line: 1021, column: 61)
!711 = !DISubprogram(name: "deque_iter", scope: !352, file: !352, line: 1208, type: !712, isLocal: true, isDefinition: true, scopeLine: 1209, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*)* @deque_iter, variables: !714)
!712 = !DISubroutineType(types: !713)
!713 = !{!5, !350}
!714 = !{!715, !716}
!715 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !711, file: !352, line: 1208, type: !350)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !711, file: !352, line: 1210, type: !375)
!717 = !DISubprogram(name: "deque_append", scope: !352, file: !352, line: 256, type: !572, isLocal: true, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, %struct._object*)* @deque_append, variables: !718)
!718 = !{!719, !720, !721, !724, !727}
!719 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !717, file: !352, line: 256, type: !350)
!720 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 2, scope: !717, file: !352, line: 256, type: !5)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !722, file: !352, line: 260, type: !357)
!722 = distinct !DILexicalBlock(scope: !723, file: !352, line: 259, column: 37)
!723 = distinct !DILexicalBlock(scope: !717, file: !352, line: 259, column: 9)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !725, file: !352, line: 274, type: !5)
!725 = distinct !DILexicalBlock(scope: !726, file: !352, line: 274, column: 84)
!726 = distinct !DILexicalBlock(scope: !717, file: !352, line: 274, column: 9)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !728, file: !352, line: 274, type: !5)
!728 = distinct !DILexicalBlock(scope: !725, file: !352, line: 274, column: 152)
!729 = !DISubprogram(name: "deque_appendleft", scope: !352, file: !352, line: 281, type: !572, isLocal: true, isDefinition: true, scopeLine: 282, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, %struct._object*)* @deque_appendleft, variables: !730)
!730 = !{!731, !732, !733, !736, !739}
!731 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !729, file: !352, line: 281, type: !350)
!732 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 2, scope: !729, file: !352, line: 281, type: !5)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !734, file: !352, line: 285, type: !357)
!734 = distinct !DILexicalBlock(scope: !735, file: !352, line: 284, column: 32)
!735 = distinct !DILexicalBlock(scope: !729, file: !352, line: 284, column: 9)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !737, file: !352, line: 299, type: !5)
!737 = distinct !DILexicalBlock(scope: !738, file: !352, line: 299, column: 84)
!738 = distinct !DILexicalBlock(scope: !729, file: !352, line: 299, column: 9)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !740, file: !352, line: 299, type: !5)
!740 = distinct !DILexicalBlock(scope: !737, file: !352, line: 299, column: 148)
!741 = !DISubprogram(name: "deque_clearmethod", scope: !352, file: !352, line: 832, type: !712, isLocal: true, isDefinition: true, scopeLine: 833, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*)* @deque_clearmethod, variables: !742)
!742 = !{!743}
!743 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !741, file: !352, line: 832, type: !350)
!744 = !DISubprogram(name: "deque_copy", scope: !352, file: !352, line: 879, type: !116, isLocal: true, isDefinition: true, scopeLine: 880, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @deque_copy, variables: !745)
!745 = !{!746}
!746 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !744, file: !352, line: 879, type: !5)
!747 = !DISubprogram(name: "deque_count", scope: !352, file: !352, line: 639, type: !572, isLocal: true, isDefinition: true, scopeLine: 640, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, %struct._object*)* @deque_count, variables: !748)
!748 = !{!749, !750, !751, !752, !753, !754, !755, !756, !757, !758}
!749 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !747, file: !352, line: 639, type: !350)
!750 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !747, file: !352, line: 639, type: !5)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !747, file: !352, line: 641, type: !357)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !747, file: !352, line: 642, type: !11)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !747, file: !352, line: 643, type: !11)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !747, file: !352, line: 644, type: !11)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !747, file: !352, line: 645, type: !11)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !747, file: !352, line: 646, type: !5)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start_state", scope: !747, file: !352, line: 647, type: !17)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmp", scope: !747, file: !352, line: 648, type: !44)
!759 = !DISubprogram(name: "deque_extendleft", scope: !352, file: !352, line: 384, type: !572, isLocal: true, isDefinition: true, scopeLine: 385, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, %struct._object*)* @deque_extendleft, variables: !760)
!760 = !{!761, !762, !763, !764, !765, !768, !769, !771, !775, !779, !781, !784, !786}
!761 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !759, file: !352, line: 384, type: !350)
!762 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iterable", arg: 2, scope: !759, file: !352, line: 384, type: !5)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !759, file: !352, line: 386, type: !5)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !759, file: !352, line: 386, type: !5)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !766, file: !352, line: 390, type: !5)
!766 = distinct !DILexicalBlock(scope: !767, file: !352, line: 389, column: 40)
!767 = distinct !DILexicalBlock(scope: !759, file: !352, line: 389, column: 9)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !766, file: !352, line: 391, type: !5)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !770, file: !352, line: 395, type: !5)
!770 = distinct !DILexicalBlock(scope: !766, file: !352, line: 395, column: 12)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !772, file: !352, line: 417, type: !357)
!772 = distinct !DILexicalBlock(scope: !773, file: !352, line: 416, column: 36)
!773 = distinct !DILexicalBlock(scope: !774, file: !352, line: 416, column: 13)
!774 = distinct !DILexicalBlock(scope: !759, file: !352, line: 414, column: 52)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !776, file: !352, line: 419, type: !5)
!776 = distinct !DILexicalBlock(scope: !777, file: !352, line: 419, column: 20)
!777 = distinct !DILexicalBlock(scope: !778, file: !352, line: 418, column: 34)
!778 = distinct !DILexicalBlock(scope: !772, file: !352, line: 418, column: 17)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !780, file: !352, line: 420, type: !5)
!780 = distinct !DILexicalBlock(scope: !777, file: !352, line: 420, column: 20)
!781 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !782, file: !352, line: 433, type: !5)
!782 = distinct !DILexicalBlock(scope: !783, file: !352, line: 433, column: 88)
!783 = distinct !DILexicalBlock(scope: !774, file: !352, line: 433, column: 13)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !785, file: !352, line: 433, type: !5)
!785 = distinct !DILexicalBlock(scope: !782, file: !352, line: 433, column: 152)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !787, file: !352, line: 435, type: !5)
!787 = distinct !DILexicalBlock(scope: !759, file: !352, line: 435, column: 8)
!788 = !DISubprogram(name: "deque_reduce", scope: !352, file: !352, line: 891, type: !712, isLocal: true, isDefinition: true, scopeLine: 892, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*)* @deque_reduce, variables: !789)
!789 = !{!790, !791, !792, !793, !794, !798, !801, !803, !806}
!790 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !788, file: !352, line: 891, type: !350)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !788, file: !352, line: 893, type: !5)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !788, file: !352, line: 893, type: !5)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aslist", scope: !788, file: !352, line: 893, type: !5)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !795, file: !352, line: 901, type: !5)
!795 = distinct !DILexicalBlock(scope: !796, file: !352, line: 901, column: 12)
!796 = distinct !DILexicalBlock(scope: !797, file: !352, line: 900, column: 31)
!797 = distinct !DILexicalBlock(scope: !788, file: !352, line: 900, column: 9)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !799, file: !352, line: 901, type: !5)
!799 = distinct !DILexicalBlock(scope: !800, file: !352, line: 901, column: 100)
!800 = distinct !DILexicalBlock(scope: !795, file: !352, line: 901, column: 66)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !802, file: !352, line: 915, type: !5)
!802 = distinct !DILexicalBlock(scope: !788, file: !352, line: 915, column: 8)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !804, file: !352, line: 915, type: !5)
!804 = distinct !DILexicalBlock(scope: !805, file: !352, line: 915, column: 96)
!805 = distinct !DILexicalBlock(scope: !802, file: !352, line: 915, column: 62)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !807, file: !352, line: 916, type: !5)
!807 = distinct !DILexicalBlock(scope: !788, file: !352, line: 916, column: 8)
!808 = !DISubprogram(name: "deque_remove", scope: !352, file: !352, line: 685, type: !572, isLocal: true, isDefinition: true, scopeLine: 686, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, %struct._object*)* @deque_remove, variables: !809)
!809 = !{!810, !811, !812, !813, !814, !818, !819, !822}
!810 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !808, file: !352, line: 685, type: !350)
!811 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !808, file: !352, line: 685, type: !5)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !808, file: !352, line: 687, type: !11)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !808, file: !352, line: 687, type: !11)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !815, file: !352, line: 690, type: !5)
!815 = distinct !DILexicalBlock(scope: !816, file: !352, line: 689, column: 27)
!816 = distinct !DILexicalBlock(scope: !817, file: !352, line: 689, column: 5)
!817 = distinct !DILexicalBlock(scope: !808, file: !352, line: 689, column: 5)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmp", scope: !815, file: !352, line: 691, type: !44)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tgt", scope: !820, file: !352, line: 699, type: !5)
!820 = distinct !DILexicalBlock(scope: !821, file: !352, line: 698, column: 22)
!821 = distinct !DILexicalBlock(scope: !815, file: !352, line: 698, column: 13)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !823, file: !352, line: 701, type: !5)
!823 = distinct !DILexicalBlock(scope: !820, file: !352, line: 701, column: 16)
!824 = !DISubprogram(name: "deque_reviter", scope: !352, file: !352, line: 1364, type: !712, isLocal: true, isDefinition: true, scopeLine: 1365, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*)* @deque_reviter, variables: !825)
!825 = !{!826, !827}
!826 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !824, file: !352, line: 1364, type: !350)
!827 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !824, file: !352, line: 1366, type: !375)
!828 = !DISubprogram(name: "deque_reverse", scope: !352, file: !352, line: 597, type: !572, isLocal: true, isDefinition: true, scopeLine: 598, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, %struct._object*)* @deque_reverse, variables: !829)
!829 = !{!830, !831, !832, !833, !834, !835, !836, !837, !838}
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !828, file: !352, line: 597, type: !350)
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !828, file: !352, line: 597, type: !5)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "leftblock", scope: !828, file: !352, line: 599, type: !357)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rightblock", scope: !828, file: !352, line: 600, type: !357)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "leftindex", scope: !828, file: !352, line: 601, type: !11)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rightindex", scope: !828, file: !352, line: 602, type: !11)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !828, file: !352, line: 603, type: !11)
!837 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !828, file: !352, line: 604, type: !11)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !828, file: !352, line: 605, type: !5)
!839 = !DISubprogram(name: "deque_rotate", scope: !352, file: !352, line: 582, type: !572, isLocal: true, isDefinition: true, scopeLine: 583, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, %struct._object*)* @deque_rotate, variables: !840)
!840 = !{!841, !842, !843}
!841 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !839, file: !352, line: 582, type: !350)
!842 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !839, file: !352, line: 582, type: !5)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !839, file: !352, line: 584, type: !11)
!844 = !DISubprogram(name: "deque_sizeof", scope: !352, file: !352, line: 1060, type: !845, isLocal: true, isDefinition: true, scopeLine: 1061, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*, i8*)* @deque_sizeof, variables: !847)
!845 = !DISubroutineType(types: !846)
!846 = !{!5, !350, !4}
!847 = !{!848, !849, !850, !851}
!848 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !844, file: !352, line: 1060, type: !350)
!849 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !844, file: !352, line: 1060, type: !4)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !844, file: !352, line: 1062, type: !11)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blocks", scope: !844, file: !352, line: 1063, type: !11)
!852 = !DISubprogram(name: "deque_get_maxlen", scope: !352, file: !352, line: 1077, type: !712, isLocal: true, isDefinition: true, scopeLine: 1078, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.dequeobject*)* @deque_get_maxlen, variables: !853)
!853 = !{!854}
!854 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !852, file: !352, line: 1077, type: !350)
!855 = !DISubprogram(name: "deque_init", scope: !352, file: !352, line: 1030, type: !856, isLocal: true, isDefinition: true, scopeLine: 1031, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.dequeobject*, %struct._object*, %struct._object*)* @deque_init, variables: !858)
!856 = !DISubroutineType(types: !857)
!857 = !{!44, !350, !5, !5}
!858 = !{!859, !860, !861, !862, !863, !864, !865, !869, !872}
!859 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "deque", arg: 1, scope: !855, file: !352, line: 1030, type: !350)
!860 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !855, file: !352, line: 1030, type: !5)
!861 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwdargs", arg: 3, scope: !855, file: !352, line: 1030, type: !5)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iterable", scope: !855, file: !352, line: 1032, type: !5)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxlenobj", scope: !855, file: !352, line: 1033, type: !5)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxlen", scope: !855, file: !352, line: 1034, type: !11)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kwlist", scope: !855, file: !352, line: 1035, type: !866)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 192, align: 64, elements: !867)
!867 = !{!868}
!868 = !DISubrange(count: 3)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !870, file: !352, line: 1051, type: !5)
!870 = distinct !DILexicalBlock(scope: !871, file: !352, line: 1050, column: 33)
!871 = distinct !DILexicalBlock(scope: !855, file: !352, line: 1050, column: 9)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !873, file: !352, line: 1054, type: !5)
!873 = distinct !DILexicalBlock(scope: !870, file: !352, line: 1054, column: 12)
!874 = !DISubprogram(name: "deque_new", scope: !352, file: !352, line: 149, type: !875, isLocal: true, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @deque_new, variables: !879)
!875 = !DISubroutineType(types: !876)
!876 = !{!5, !877, !5, !5}
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64, align: 64)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !7, line: 422, baseType: !20)
!879 = !{!880, !881, !882, !883, !884, !885}
!880 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !874, file: !352, line: 149, type: !877)
!881 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !874, file: !352, line: 149, type: !5)
!882 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !874, file: !352, line: 149, type: !5)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "deque", scope: !874, file: !352, line: 151, type: !350)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !874, file: !352, line: 152, type: !357)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !886, file: !352, line: 161, type: !5)
!886 = distinct !DILexicalBlock(scope: !887, file: !352, line: 161, column: 12)
!887 = distinct !DILexicalBlock(scope: !888, file: !352, line: 160, column: 26)
!888 = distinct !DILexicalBlock(scope: !874, file: !352, line: 160, column: 9)
!889 = !DISubprogram(name: "defdict_dealloc", scope: !352, file: !352, line: 1613, type: !890, isLocal: true, isDefinition: true, scopeLine: 1614, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.defdictobject*)* @defdict_dealloc, variables: !892)
!890 = !DISubroutineType(types: !891)
!891 = !{null, !385}
!892 = !{!893, !894, !896}
!893 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dd", arg: 1, scope: !889, file: !352, line: 1613, type: !385)
!894 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !895, file: !352, line: 1615, type: !5)
!895 = distinct !DILexicalBlock(scope: !889, file: !352, line: 1615, column: 8)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !897, file: !352, line: 1615, type: !5)
!897 = distinct !DILexicalBlock(scope: !898, file: !352, line: 1615, column: 133)
!898 = distinct !DILexicalBlock(scope: !899, file: !352, line: 1615, column: 92)
!899 = distinct !DILexicalBlock(scope: !895, file: !352, line: 1615, column: 69)
!900 = !DISubprogram(name: "defdict_repr", scope: !352, file: !352, line: 1620, type: !901, isLocal: true, isDefinition: true, scopeLine: 1621, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.defdictobject*)* @defdict_repr, variables: !903)
!901 = !DISubroutineType(types: !902)
!902 = !{!5, !385}
!903 = !{!904, !905, !906, !907, !908, !911, !917, !921, !923}
!904 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dd", arg: 1, scope: !900, file: !352, line: 1620, type: !385)
!905 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "baserepr", scope: !900, file: !352, line: 1622, type: !5)
!906 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "defrepr", scope: !900, file: !352, line: 1623, type: !5)
!907 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !900, file: !352, line: 1624, type: !5)
!908 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "status", scope: !909, file: !352, line: 1632, type: !44)
!909 = distinct !DILexicalBlock(scope: !910, file: !352, line: 1631, column: 5)
!910 = distinct !DILexicalBlock(scope: !900, file: !352, line: 1628, column: 9)
!911 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !912, file: !352, line: 1635, type: !5)
!912 = distinct !DILexicalBlock(scope: !913, file: !352, line: 1635, column: 20)
!913 = distinct !DILexicalBlock(scope: !914, file: !352, line: 1634, column: 29)
!914 = distinct !DILexicalBlock(scope: !915, file: !352, line: 1634, column: 17)
!915 = distinct !DILexicalBlock(scope: !916, file: !352, line: 1633, column: 26)
!916 = distinct !DILexicalBlock(scope: !909, file: !352, line: 1633, column: 13)
!917 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !918, file: !352, line: 1645, type: !5)
!918 = distinct !DILexicalBlock(scope: !919, file: !352, line: 1645, column: 12)
!919 = distinct !DILexicalBlock(scope: !920, file: !352, line: 1644, column: 32)
!920 = distinct !DILexicalBlock(scope: !900, file: !352, line: 1644, column: 9)
!921 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !922, file: !352, line: 1650, type: !5)
!922 = distinct !DILexicalBlock(scope: !900, file: !352, line: 1650, column: 8)
!923 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !924, file: !352, line: 1651, type: !5)
!924 = distinct !DILexicalBlock(scope: !900, file: !352, line: 1651, column: 8)
