; ModuleID = 'programs_new/Python-new/_csv.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !28, subprograms: !472, globals: !1078)
!1 = !DIFile(filename: "_csv.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !10, !17}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_csv.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "QUOTE_MINIMAL", value: 0)
!7 = !DIEnumerator(name: "QUOTE_ALL", value: 1)
!8 = !DIEnumerator(name: "QUOTE_NONNUMERIC", value: 2)
!9 = !DIEnumerator(name: "QUOTE_NONE", value: 3)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !11, line: 451, size: 32, align: 32, elements: !12)
!11 = !DIFile(filename: "./Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!12 = !{!13, !14, !15, !16}
!13 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!14 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!15 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!16 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 51, size: 32, align: 32, elements: !18)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27}
!19 = !DIEnumerator(name: "START_RECORD", value: 0)
!20 = !DIEnumerator(name: "START_FIELD", value: 1)
!21 = !DIEnumerator(name: "ESCAPED_CHAR", value: 2)
!22 = !DIEnumerator(name: "IN_FIELD", value: 3)
!23 = !DIEnumerator(name: "IN_QUOTED_FIELD", value: 4)
!24 = !DIEnumerator(name: "ESCAPE_IN_QUOTED_FIELD", value: 5)
!25 = !DIEnumerator(name: "QUOTE_IN_QUOTED_FIELD", value: 6)
!26 = !DIEnumerator(name: "EAT_CRNL", value: 7)
!27 = !DIEnumerator(name: "AFTER_ESCAPED_CRNL", value: 8)
!28 = !{!29, !30, !35, !382, !389, !396, !414, !418, !426, !442, !444, !74, !124, !41, !441, !446, !461}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "_csvstate", file: !4, line: 21, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 17, size: 192, align: 64, elements: !33)
!33 = !{!34, !380, !381}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "error_obj", scope: !32, file: !4, line: 18, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !37, line: 109, baseType: !38)
!37 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !37, line: 105, size: 128, align: 64, elements: !39)
!39 = !{!40, !48}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !38, file: !37, line: 107, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !42, line: 177, baseType: !43)
!42 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !44, line: 102, baseType: !45)
!44 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !46, line: 181, baseType: !47)
!46 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!47 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !38, file: !37, line: 108, baseType: !49, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !37, line: 334, size: 3200, align: 64, elements: !51)
!51 = !{!52, !58, !62, !63, !64, !69, !132, !137, !142, !143, !148, !200, !231, !243, !249, !250, !251, !253, !255, !286, !287, !288, !297, !298, !303, !304, !306, !308, !318, !328, !346, !347, !348, !350, !352, !353, !355, !360, !365, !370, !371, !372, !373, !374, !375, !376, !377, !379}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !50, file: !37, line: 335, baseType: !53, size: 192, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !37, line: 114, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, file: !37, line: 111, size: 192, align: 64, elements: !55)
!55 = !{!56, !57}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !54, file: !37, line: 112, baseType: !36, size: 128, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !54, file: !37, line: 113, baseType: !41, size: 64, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !50, file: !37, line: 336, baseType: !59, size: 64, align: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!61 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !50, file: !37, line: 337, baseType: !41, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !50, file: !37, line: 337, baseType: !41, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !50, file: !37, line: 341, baseType: !65, size: 64, align: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !37, line: 308, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !35}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !50, file: !37, line: 342, baseType: !70, size: 64, align: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !37, line: 314, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !35, !75, !74}
!74 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !44, line: 48, baseType: !77)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !78, line: 246, size: 1728, align: 64, elements: !79)
!78 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!79 = !{!80, !81, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !101, !102, !103, !104, !106, !108, !110, !114, !117, !119, !120, !121, !122, !123, !127, !128}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !77, file: !78, line: 247, baseType: !74, size: 32, align: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !77, file: !78, line: 252, baseType: !82, size: 64, align: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !77, file: !78, line: 253, baseType: !82, size: 64, align: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !77, file: !78, line: 254, baseType: !82, size: 64, align: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !77, file: !78, line: 255, baseType: !82, size: 64, align: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !77, file: !78, line: 256, baseType: !82, size: 64, align: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !77, file: !78, line: 257, baseType: !82, size: 64, align: 64, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !77, file: !78, line: 258, baseType: !82, size: 64, align: 64, offset: 448)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !77, file: !78, line: 259, baseType: !82, size: 64, align: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !77, file: !78, line: 261, baseType: !82, size: 64, align: 64, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !77, file: !78, line: 262, baseType: !82, size: 64, align: 64, offset: 640)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !77, file: !78, line: 263, baseType: !82, size: 64, align: 64, offset: 704)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !77, file: !78, line: 265, baseType: !94, size: 64, align: 64, offset: 768)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !78, line: 161, size: 192, align: 64, elements: !96)
!96 = !{!97, !98, !100}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !95, file: !78, line: 162, baseType: !94, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !95, file: !78, line: 163, baseType: !99, size: 64, align: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !95, file: !78, line: 167, baseType: !74, size: 32, align: 32, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !77, file: !78, line: 267, baseType: !99, size: 64, align: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !77, file: !78, line: 269, baseType: !74, size: 32, align: 32, offset: 896)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !77, file: !78, line: 273, baseType: !74, size: 32, align: 32, offset: 928)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !77, file: !78, line: 275, baseType: !105, size: 64, align: 64, offset: 960)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !46, line: 140, baseType: !47)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !77, file: !78, line: 279, baseType: !107, size: 16, align: 16, offset: 1024)
!107 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !77, file: !78, line: 280, baseType: !109, size: 8, align: 8, offset: 1040)
!109 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !77, file: !78, line: 281, baseType: !111, size: 8, align: 8, offset: 1048)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 8, align: 8, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 1)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !77, file: !78, line: 285, baseType: !115, size: 64, align: 64, offset: 1088)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !78, line: 155, baseType: null)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !77, file: !78, line: 294, baseType: !118, size: 64, align: 64, offset: 1152)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !46, line: 141, baseType: !47)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !77, file: !78, line: 303, baseType: !29, size: 64, align: 64, offset: 1216)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !77, file: !78, line: 304, baseType: !29, size: 64, align: 64, offset: 1280)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !77, file: !78, line: 305, baseType: !29, size: 64, align: 64, offset: 1344)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !77, file: !78, line: 306, baseType: !29, size: 64, align: 64, offset: 1408)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !77, file: !78, line: 307, baseType: !124, size: 64, align: 64, offset: 1472)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !125, line: 62, baseType: !126)
!125 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!126 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !77, file: !78, line: 309, baseType: !74, size: 32, align: 32, offset: 1536)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !77, file: !78, line: 311, baseType: !129, size: 160, align: 8, offset: 1568)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 160, align: 8, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 20)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !50, file: !37, line: 343, baseType: !133, size: 64, align: 64, offset: 512)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !37, line: 316, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!35, !35, !82}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !50, file: !37, line: 344, baseType: !138, size: 64, align: 64, offset: 576)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !37, line: 318, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!74, !35, !82, !35}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !50, file: !37, line: 345, baseType: !29, size: 64, align: 64, offset: 640)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !50, file: !37, line: 346, baseType: !144, size: 64, align: 64, offset: 704)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !37, line: 320, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!35, !35}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !50, file: !37, line: 350, baseType: !149, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !37, line: 278, baseType: !151)
!151 = !DICompositeType(tag: DW_TAG_structure_type, file: !37, line: 236, size: 2176, align: 64, elements: !152)
!152 = !{!153, !158, !159, !160, !161, !162, !167, !169, !170, !171, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !151, file: !37, line: 241, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !37, line: 166, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!35, !35, !35}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !151, file: !37, line: 242, baseType: !154, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !151, file: !37, line: 243, baseType: !154, size: 64, align: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !151, file: !37, line: 244, baseType: !154, size: 64, align: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !151, file: !37, line: 245, baseType: !154, size: 64, align: 64, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !151, file: !37, line: 246, baseType: !163, size: 64, align: 64, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !37, line: 167, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!35, !35, !35, !35}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !151, file: !37, line: 247, baseType: !168, size: 64, align: 64, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !37, line: 165, baseType: !145)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !151, file: !37, line: 248, baseType: !168, size: 64, align: 64, offset: 448)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !151, file: !37, line: 249, baseType: !168, size: 64, align: 64, offset: 512)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !151, file: !37, line: 250, baseType: !172, size: 64, align: 64, offset: 576)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !37, line: 168, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!74, !35}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !151, file: !37, line: 251, baseType: !168, size: 64, align: 64, offset: 640)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !151, file: !37, line: 252, baseType: !154, size: 64, align: 64, offset: 704)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !151, file: !37, line: 253, baseType: !154, size: 64, align: 64, offset: 768)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !151, file: !37, line: 254, baseType: !154, size: 64, align: 64, offset: 832)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !151, file: !37, line: 255, baseType: !154, size: 64, align: 64, offset: 896)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !151, file: !37, line: 256, baseType: !154, size: 64, align: 64, offset: 960)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !151, file: !37, line: 257, baseType: !168, size: 64, align: 64, offset: 1024)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !151, file: !37, line: 258, baseType: !29, size: 64, align: 64, offset: 1088)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !151, file: !37, line: 259, baseType: !168, size: 64, align: 64, offset: 1152)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !151, file: !37, line: 261, baseType: !154, size: 64, align: 64, offset: 1216)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !151, file: !37, line: 262, baseType: !154, size: 64, align: 64, offset: 1280)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !151, file: !37, line: 263, baseType: !154, size: 64, align: 64, offset: 1344)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !151, file: !37, line: 264, baseType: !154, size: 64, align: 64, offset: 1408)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !151, file: !37, line: 265, baseType: !163, size: 64, align: 64, offset: 1472)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !151, file: !37, line: 266, baseType: !154, size: 64, align: 64, offset: 1536)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !151, file: !37, line: 267, baseType: !154, size: 64, align: 64, offset: 1600)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !151, file: !37, line: 268, baseType: !154, size: 64, align: 64, offset: 1664)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !151, file: !37, line: 269, baseType: !154, size: 64, align: 64, offset: 1728)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !151, file: !37, line: 270, baseType: !154, size: 64, align: 64, offset: 1792)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !151, file: !37, line: 272, baseType: !154, size: 64, align: 64, offset: 1856)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !151, file: !37, line: 273, baseType: !154, size: 64, align: 64, offset: 1920)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !151, file: !37, line: 274, baseType: !154, size: 64, align: 64, offset: 1984)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !151, file: !37, line: 275, baseType: !154, size: 64, align: 64, offset: 2048)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !151, file: !37, line: 277, baseType: !168, size: 64, align: 64, offset: 2112)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !50, file: !37, line: 351, baseType: !201, size: 64, align: 64, offset: 832)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !37, line: 292, baseType: !203)
!203 = !DICompositeType(tag: DW_TAG_structure_type, file: !37, line: 280, size: 640, align: 64, elements: !204)
!204 = !{!205, !210, !211, !216, !217, !218, !223, !224, !229, !230}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !203, file: !37, line: 281, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !37, line: 169, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!41, !35}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !203, file: !37, line: 282, baseType: !154, size: 64, align: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !203, file: !37, line: 283, baseType: !212, size: 64, align: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !37, line: 170, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!35, !35, !41}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !203, file: !37, line: 284, baseType: !212, size: 64, align: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !203, file: !37, line: 285, baseType: !29, size: 64, align: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !203, file: !37, line: 286, baseType: !219, size: 64, align: 64, offset: 320)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !37, line: 172, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!74, !35, !41, !35}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !203, file: !37, line: 287, baseType: !29, size: 64, align: 64, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !203, file: !37, line: 288, baseType: !225, size: 64, align: 64, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !37, line: 231, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!74, !35, !35}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !203, file: !37, line: 290, baseType: !154, size: 64, align: 64, offset: 512)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !203, file: !37, line: 291, baseType: !212, size: 64, align: 64, offset: 576)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !50, file: !37, line: 352, baseType: !232, size: 64, align: 64, offset: 896)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !37, line: 298, baseType: !234)
!234 = !DICompositeType(tag: DW_TAG_structure_type, file: !37, line: 294, size: 192, align: 64, elements: !235)
!235 = !{!236, !237, !238}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !234, file: !37, line: 295, baseType: !206, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !234, file: !37, line: 296, baseType: !154, size: 64, align: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !234, file: !37, line: 297, baseType: !239, size: 64, align: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !37, line: 174, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!74, !35, !35, !35}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !50, file: !37, line: 356, baseType: !244, size: 64, align: 64, offset: 960)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !37, line: 321, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!248, !35}
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !42, line: 186, baseType: !41)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !50, file: !37, line: 357, baseType: !163, size: 64, align: 64, offset: 1024)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !50, file: !37, line: 358, baseType: !144, size: 64, align: 64, offset: 1088)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !50, file: !37, line: 359, baseType: !252, size: 64, align: 64, offset: 1152)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !37, line: 317, baseType: !155)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !50, file: !37, line: 360, baseType: !254, size: 64, align: 64, offset: 1216)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !37, line: 319, baseType: !240)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !50, file: !37, line: 363, baseType: !256, size: 64, align: 64, offset: 1280)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !37, line: 304, baseType: !258)
!258 = !DICompositeType(tag: DW_TAG_structure_type, file: !37, line: 301, size: 128, align: 64, elements: !259)
!259 = !{!260, !281}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !258, file: !37, line: 302, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !37, line: 193, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!74, !35, !265, !74}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !37, line: 191, baseType: !267)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !37, line: 178, size: 640, align: 64, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276, !278, !279, !280}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !267, file: !37, line: 179, baseType: !29, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !267, file: !37, line: 180, baseType: !35, size: 64, align: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !267, file: !37, line: 181, baseType: !41, size: 64, align: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !267, file: !37, line: 182, baseType: !41, size: 64, align: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !267, file: !37, line: 184, baseType: !74, size: 32, align: 32, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !267, file: !37, line: 185, baseType: !74, size: 32, align: 32, offset: 288)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !267, file: !37, line: 186, baseType: !82, size: 64, align: 64, offset: 320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !267, file: !37, line: 187, baseType: !277, size: 64, align: 64, offset: 384)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !267, file: !37, line: 188, baseType: !277, size: 64, align: 64, offset: 448)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !267, file: !37, line: 189, baseType: !277, size: 64, align: 64, offset: 512)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !267, file: !37, line: 190, baseType: !29, size: 64, align: 64, offset: 576)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !258, file: !37, line: 303, baseType: !282, size: 64, align: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !37, line: 194, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !35, !265}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !50, file: !37, line: 366, baseType: !126, size: 64, align: 64, offset: 1344)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !50, file: !37, line: 368, baseType: !59, size: 64, align: 64, offset: 1408)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !50, file: !37, line: 372, baseType: !289, size: 64, align: 64, offset: 1472)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !37, line: 233, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!74, !35, !293, !29}
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !37, line: 232, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!74, !35, !29}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !50, file: !37, line: 375, baseType: !172, size: 64, align: 64, offset: 1536)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !50, file: !37, line: 379, baseType: !299, size: 64, align: 64, offset: 1600)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !37, line: 322, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!35, !35, !35, !74}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !50, file: !37, line: 382, baseType: !41, size: 64, align: 64, offset: 1664)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !50, file: !37, line: 385, baseType: !305, size: 64, align: 64, offset: 1728)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !37, line: 323, baseType: !145)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !50, file: !37, line: 386, baseType: !307, size: 64, align: 64, offset: 1792)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !37, line: 324, baseType: !145)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !50, file: !37, line: 389, baseType: !309, size: 64, align: 64, offset: 1856)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !311, line: 40, size: 256, align: 64, elements: !312)
!311 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!312 = !{!313, !314, !316, !317}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !310, file: !311, line: 41, baseType: !59, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !310, file: !311, line: 42, baseType: !315, size: 64, align: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !311, line: 18, baseType: !155)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !310, file: !311, line: 43, baseType: !74, size: 32, align: 32, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !310, file: !311, line: 45, baseType: !59, size: 64, align: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !50, file: !37, line: 390, baseType: !319, size: 64, align: 64, offset: 1920)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !321, line: 18, size: 320, align: 64, elements: !322)
!321 = !DIFile(filename: "./Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!322 = !{!323, !324, !325, !326, !327}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !320, file: !321, line: 19, baseType: !82, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !320, file: !321, line: 20, baseType: !74, size: 32, align: 32, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !320, file: !321, line: 21, baseType: !41, size: 64, align: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !320, file: !321, line: 22, baseType: !74, size: 32, align: 32, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !320, file: !321, line: 23, baseType: !82, size: 64, align: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !50, file: !37, line: 391, baseType: !329, size: 64, align: 64, offset: 1984)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !331, line: 11, size: 320, align: 64, elements: !332)
!331 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!332 = !{!333, !334, !339, !344, !345}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !330, file: !331, line: 12, baseType: !82, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !330, file: !331, line: 13, baseType: !335, size: 64, align: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !331, line: 8, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!35, !35, !29}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !330, file: !331, line: 14, baseType: !340, size: 64, align: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !331, line: 9, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!74, !35, !35, !29}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !330, file: !331, line: 15, baseType: !82, size: 64, align: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !330, file: !331, line: 16, baseType: !29, size: 64, align: 64, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !50, file: !37, line: 392, baseType: !49, size: 64, align: 64, offset: 2048)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !50, file: !37, line: 393, baseType: !35, size: 64, align: 64, offset: 2112)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !50, file: !37, line: 394, baseType: !349, size: 64, align: 64, offset: 2176)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !37, line: 325, baseType: !164)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !50, file: !37, line: 395, baseType: !351, size: 64, align: 64, offset: 2240)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !37, line: 326, baseType: !240)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !50, file: !37, line: 396, baseType: !41, size: 64, align: 64, offset: 2304)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !50, file: !37, line: 397, baseType: !354, size: 64, align: 64, offset: 2368)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !37, line: 327, baseType: !240)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !50, file: !37, line: 398, baseType: !356, size: 64, align: 64, offset: 2432)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !37, line: 329, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!35, !49, !41}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !50, file: !37, line: 399, baseType: !361, size: 64, align: 64, offset: 2496)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !37, line: 328, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!35, !49, !35, !35}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !50, file: !37, line: 400, baseType: !366, size: 64, align: 64, offset: 2560)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !37, line: 307, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{null, !29}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !50, file: !37, line: 401, baseType: !172, size: 64, align: 64, offset: 2624)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !50, file: !37, line: 402, baseType: !35, size: 64, align: 64, offset: 2688)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !50, file: !37, line: 403, baseType: !35, size: 64, align: 64, offset: 2752)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !50, file: !37, line: 404, baseType: !35, size: 64, align: 64, offset: 2816)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !50, file: !37, line: 405, baseType: !35, size: 64, align: 64, offset: 2880)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !50, file: !37, line: 406, baseType: !35, size: 64, align: 64, offset: 2944)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !50, file: !37, line: 407, baseType: !65, size: 64, align: 64, offset: 3008)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !50, file: !37, line: 410, baseType: !378, size: 32, align: 32, offset: 3072)
!378 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !50, file: !37, line: 412, baseType: !65, size: 64, align: 64, offset: 3136)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "dialects", scope: !32, file: !4, line: 19, baseType: !35, size: 64, align: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "field_limit", scope: !32, file: !4, line: 20, baseType: !47, size: 64, align: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "DialectObj", file: !4, line: 86, baseType: !384)
!384 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 74, size: 448, align: 64, elements: !385)
!385 = !{!386, !387, !388, !390, !391, !392, !393, !394, !395}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !384, file: !4, line: 75, baseType: !36, size: 128, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "doublequote", scope: !384, file: !4, line: 77, baseType: !74, size: 32, align: 32, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "delimiter", scope: !384, file: !4, line: 78, baseType: !389, size: 32, align: 32, offset: 160)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !11, line: 121, baseType: !378)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "quotechar", scope: !384, file: !4, line: 79, baseType: !389, size: 32, align: 32, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "escapechar", scope: !384, file: !4, line: 80, baseType: !389, size: 32, align: 32, offset: 224)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "skipinitialspace", scope: !384, file: !4, line: 81, baseType: !74, size: 32, align: 32, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "lineterminator", scope: !384, file: !4, line: 82, baseType: !35, size: 64, align: 64, offset: 320)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "quoting", scope: !384, file: !4, line: 83, baseType: !74, size: 32, align: 32, offset: 384)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "strict", scope: !384, file: !4, line: 85, baseType: !74, size: 32, align: 32, offset: 416)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !11, line: 351, baseType: !398)
!398 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 217, size: 384, align: 64, elements: !399)
!399 = !{!400, !401, !402, !403, !411}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !398, file: !11, line: 291, baseType: !36, size: 128, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !398, file: !11, line: 292, baseType: !41, size: 64, align: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !398, file: !11, line: 293, baseType: !248, size: 64, align: 64, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !398, file: !11, line: 349, baseType: !404, size: 32, align: 32, offset: 256)
!404 = !DICompositeType(tag: DW_TAG_structure_type, scope: !398, file: !11, line: 294, size: 32, align: 32, elements: !405)
!405 = !{!406, !407, !408, !409, !410}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !404, file: !11, line: 303, baseType: !378, size: 2, align: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !404, file: !11, line: 331, baseType: !378, size: 3, align: 32, offset: 2)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !404, file: !11, line: 336, baseType: !378, size: 1, align: 32, offset: 5)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !404, file: !11, line: 340, baseType: !378, size: 1, align: 32, offset: 6)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !404, file: !11, line: 345, baseType: !378, size: 1, align: 32, offset: 7)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !398, file: !11, line: 350, baseType: !412, size: 64, align: 64, offset: 320)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !125, line: 90, baseType: !74)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !11, line: 134, baseType: !417)
!417 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !11, line: 363, baseType: !420)
!420 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 356, size: 576, align: 64, elements: !421)
!421 = !{!422, !423, !424, !425}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !420, file: !11, line: 357, baseType: !397, size: 384, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !420, file: !11, line: 358, baseType: !41, size: 64, align: 64, offset: 384)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !420, file: !11, line: 360, baseType: !82, size: 64, align: 64, offset: 448)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !420, file: !11, line: 361, baseType: !41, size: 64, align: 64, offset: 512)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !11, line: 376, baseType: !428)
!428 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 368, size: 640, align: 64, elements: !429)
!429 = !{!430, !431}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !428, file: !11, line: 369, baseType: !419, size: 576, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !428, file: !11, line: 375, baseType: !432, size: 64, align: 64, offset: 576)
!432 = !DICompositeType(tag: DW_TAG_union_type, scope: !428, file: !11, line: 370, size: 64, align: 64, elements: !433)
!433 = !{!434, !435, !437, !440}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !432, file: !11, line: 371, baseType: !29, size: 64, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !432, file: !11, line: 372, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !432, file: !11, line: 373, baseType: !438, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !11, line: 129, baseType: !107)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !432, file: !11, line: 374, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !439)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReaderObj", file: !4, line: 104, baseType: !448)
!448 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 90, size: 704, align: 64, elements: !449)
!449 = !{!450, !451, !452, !453, !454, !456, !457, !458, !459, !460}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !448, file: !4, line: 91, baseType: !36, size: 128, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "input_iter", scope: !448, file: !4, line: 93, baseType: !35, size: 64, align: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "dialect", scope: !448, file: !4, line: 95, baseType: !382, size: 64, align: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !448, file: !4, line: 97, baseType: !35, size: 64, align: 64, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !448, file: !4, line: 98, baseType: !455, size: 32, align: 32, offset: 320)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParserState", file: !4, line: 55, baseType: !17)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !448, file: !4, line: 99, baseType: !441, size: 64, align: 64, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "field_size", scope: !448, file: !4, line: 100, baseType: !41, size: 64, align: 64, offset: 448)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "field_len", scope: !448, file: !4, line: 101, baseType: !41, size: 64, align: 64, offset: 512)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "numeric_field", scope: !448, file: !4, line: 102, baseType: !74, size: 32, align: 32, offset: 576)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "line_num", scope: !448, file: !4, line: 103, baseType: !126, size: 64, align: 64, offset: 640)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "WriterObj", file: !4, line: 121, baseType: !463)
!463 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 110, size: 512, align: 64, elements: !464)
!464 = !{!465, !466, !467, !468, !469, !470, !471}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !463, file: !4, line: 111, baseType: !36, size: 128, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "writeline", scope: !463, file: !4, line: 113, baseType: !35, size: 64, align: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dialect", scope: !463, file: !4, line: 115, baseType: !382, size: 64, align: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "rec", scope: !463, file: !4, line: 117, baseType: !441, size: 64, align: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "rec_size", scope: !463, file: !4, line: 118, baseType: !41, size: 64, align: 64, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "rec_len", scope: !463, file: !4, line: 119, baseType: !41, size: 64, align: 64, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "num_fields", scope: !463, file: !4, line: 120, baseType: !74, size: 32, align: 32, offset: 448)
!472 = !{!473, !486, !496, !501, !506, !509, !512, !517, !520, !523, !616, !620, !633, !645, !664, !673, !679, !699, !718, !741, !773, !781, !796, !803, !807, !813, !828, !843, !860, !893, !896, !908, !927, !938, !945, !963, !987, !995, !1015, !1019, !1033, !1037, !1041, !1047, !1060, !1075}
!473 = !DISubprogram(name: "PyInit__csv", scope: !4, file: !4, line: 1636, type: !474, isLocal: false, isDefinition: true, scopeLine: 1637, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__csv, variables: !476)
!474 = !DISubroutineType(types: !475)
!475 = !{!35}
!476 = !{!477, !478}
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "module", scope: !473, file: !4, line: 1638, type: !35)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "style", scope: !473, file: !4, line: 1639, type: !479)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "StyleDesc", file: !4, line: 64, baseType: !481)
!481 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 61, size: 128, align: 64, elements: !482)
!482 = !{!483, !485}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !481, file: !4, line: 62, baseType: !484, size: 32, align: 32)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuoteStyle", file: !4, line: 59, baseType: !3)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !481, file: !4, line: 63, baseType: !82, size: 64, align: 64, offset: 64)
!486 = !DISubprogram(name: "Dialect_dealloc", scope: !4, file: !4, line: 319, type: !487, isLocal: true, isDefinition: true, scopeLine: 320, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.DialectObj*)* @Dialect_dealloc, variables: !489)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !382}
!489 = !{!490, !491, !493}
!490 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !486, file: !4, line: 319, type: !382)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !492, file: !4, line: 321, type: !35)
!492 = distinct !DILexicalBlock(scope: !486, file: !4, line: 321, column: 8)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !494, file: !4, line: 321, type: !35)
!494 = distinct !DILexicalBlock(scope: !495, file: !4, line: 321, column: 112)
!495 = distinct !DILexicalBlock(scope: !492, file: !4, line: 321, column: 78)
!496 = !DISubprogram(name: "Dialect_get_delimiter", scope: !4, file: !4, line: 169, type: !497, isLocal: true, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.DialectObj*)* @Dialect_get_delimiter, variables: !499)
!497 = !DISubroutineType(types: !498)
!498 = !{!35, !382}
!499 = !{!500}
!500 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !496, file: !4, line: 169, type: !382)
!501 = !DISubprogram(name: "get_nullchar_as_None", scope: !4, file: !4, line: 152, type: !502, isLocal: true, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32)* @get_nullchar_as_None, variables: !504)
!502 = !DISubroutineType(types: !503)
!503 = !{!35, !389}
!504 = !{!505}
!505 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !501, file: !4, line: 152, type: !389)
!506 = !DISubprogram(name: "Dialect_get_escapechar", scope: !4, file: !4, line: 175, type: !497, isLocal: true, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.DialectObj*)* @Dialect_get_escapechar, variables: !507)
!507 = !{!508}
!508 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !506, file: !4, line: 175, type: !382)
!509 = !DISubprogram(name: "Dialect_get_lineterminator", scope: !4, file: !4, line: 163, type: !497, isLocal: true, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.DialectObj*)* @Dialect_get_lineterminator, variables: !510)
!510 = !{!511}
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !509, file: !4, line: 163, type: !382)
!512 = !DISubprogram(name: "get_string", scope: !4, file: !4, line: 145, type: !146, isLocal: true, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @get_string, variables: !513)
!513 = !{!514, !515}
!514 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !512, file: !4, line: 145, type: !35)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !516, file: !4, line: 147, type: !35)
!516 = distinct !DILexicalBlock(scope: !512, file: !4, line: 147, column: 8)
!517 = !DISubprogram(name: "Dialect_get_quotechar", scope: !4, file: !4, line: 181, type: !497, isLocal: true, isDefinition: true, scopeLine: 182, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.DialectObj*)* @Dialect_get_quotechar, variables: !518)
!518 = !{!519}
!519 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !517, file: !4, line: 181, type: !382)
!520 = !DISubprogram(name: "Dialect_get_quoting", scope: !4, file: !4, line: 187, type: !497, isLocal: true, isDefinition: true, scopeLine: 188, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.DialectObj*)* @Dialect_get_quoting, variables: !521)
!521 = !{!522}
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !520, file: !4, line: 187, type: !382)
!523 = !DISubprogram(name: "dialect_new", scope: !4, file: !4, line: 339, type: !524, isLocal: true, isDefinition: true, scopeLine: 340, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @dialect_new, variables: !528)
!524 = !DISubroutineType(types: !525)
!525 = !{!35, !526, !35, !35}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !37, line: 422, baseType: !50)
!528 = !{!529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !547, !550, !552, !554, !556, !558, !560, !562, !564, !566, !568, !571, !573, !576, !578, !581, !583, !586, !588, !591, !593, !596, !598, !601, !603, !606, !608, !611, !613}
!529 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !523, file: !4, line: 339, type: !526)
!530 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !523, file: !4, line: 339, type: !35)
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !523, file: !4, line: 339, type: !35)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !523, file: !4, line: 341, type: !382)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !523, file: !4, line: 342, type: !35)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dialect", scope: !523, file: !4, line: 343, type: !35)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "delimiter", scope: !523, file: !4, line: 344, type: !35)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "doublequote", scope: !523, file: !4, line: 345, type: !35)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "escapechar", scope: !523, file: !4, line: 346, type: !35)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lineterminator", scope: !523, file: !4, line: 347, type: !35)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "quotechar", scope: !523, file: !4, line: 348, type: !35)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "quoting", scope: !523, file: !4, line: 349, type: !35)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "skipinitialspace", scope: !523, file: !4, line: 350, type: !35)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "strict", scope: !523, file: !4, line: 351, type: !35)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !544, file: !4, line: 389, type: !35)
!544 = distinct !DILexicalBlock(scope: !545, file: !4, line: 389, column: 12)
!545 = distinct !DILexicalBlock(scope: !546, file: !4, line: 388, column: 29)
!546 = distinct !DILexicalBlock(scope: !523, file: !4, line: 388, column: 9)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !548, file: !4, line: 389, type: !35)
!548 = distinct !DILexicalBlock(scope: !549, file: !4, line: 389, column: 103)
!549 = distinct !DILexicalBlock(scope: !544, file: !4, line: 389, column: 69)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !551, file: !4, line: 394, type: !35)
!551 = distinct !DILexicalBlock(scope: !523, file: !4, line: 394, column: 8)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !553, file: !4, line: 395, type: !35)
!553 = distinct !DILexicalBlock(scope: !523, file: !4, line: 395, column: 8)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !555, file: !4, line: 396, type: !35)
!555 = distinct !DILexicalBlock(scope: !523, file: !4, line: 396, column: 8)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !557, file: !4, line: 397, type: !35)
!557 = distinct !DILexicalBlock(scope: !523, file: !4, line: 397, column: 8)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !559, file: !4, line: 398, type: !35)
!559 = distinct !DILexicalBlock(scope: !523, file: !4, line: 398, column: 8)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !561, file: !4, line: 399, type: !35)
!561 = distinct !DILexicalBlock(scope: !523, file: !4, line: 399, column: 8)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !563, file: !4, line: 400, type: !35)
!563 = distinct !DILexicalBlock(scope: !523, file: !4, line: 400, column: 8)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !565, file: !4, line: 401, type: !35)
!565 = distinct !DILexicalBlock(scope: !523, file: !4, line: 401, column: 8)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !567, file: !4, line: 453, type: !35)
!567 = distinct !DILexicalBlock(scope: !523, file: !4, line: 453, column: 8)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !569, file: !4, line: 453, type: !35)
!569 = distinct !DILexicalBlock(scope: !570, file: !4, line: 453, column: 96)
!570 = distinct !DILexicalBlock(scope: !567, file: !4, line: 453, column: 62)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !572, file: !4, line: 454, type: !35)
!572 = distinct !DILexicalBlock(scope: !523, file: !4, line: 454, column: 8)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !574, file: !4, line: 454, type: !35)
!574 = distinct !DILexicalBlock(scope: !575, file: !4, line: 454, column: 99)
!575 = distinct !DILexicalBlock(scope: !572, file: !4, line: 454, column: 65)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !577, file: !4, line: 455, type: !35)
!577 = distinct !DILexicalBlock(scope: !523, file: !4, line: 455, column: 8)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !579, file: !4, line: 455, type: !35)
!579 = distinct !DILexicalBlock(scope: !580, file: !4, line: 455, column: 101)
!580 = distinct !DILexicalBlock(scope: !577, file: !4, line: 455, column: 67)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !582, file: !4, line: 456, type: !35)
!582 = distinct !DILexicalBlock(scope: !523, file: !4, line: 456, column: 8)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !584, file: !4, line: 456, type: !35)
!584 = distinct !DILexicalBlock(scope: !585, file: !4, line: 456, column: 103)
!585 = distinct !DILexicalBlock(scope: !582, file: !4, line: 456, column: 69)
!586 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !587, file: !4, line: 457, type: !35)
!587 = distinct !DILexicalBlock(scope: !523, file: !4, line: 457, column: 8)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !589, file: !4, line: 457, type: !35)
!589 = distinct !DILexicalBlock(scope: !590, file: !4, line: 457, column: 102)
!590 = distinct !DILexicalBlock(scope: !587, file: !4, line: 457, column: 68)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !592, file: !4, line: 458, type: !35)
!592 = distinct !DILexicalBlock(scope: !523, file: !4, line: 458, column: 8)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !594, file: !4, line: 458, type: !35)
!594 = distinct !DILexicalBlock(scope: !595, file: !4, line: 458, column: 106)
!595 = distinct !DILexicalBlock(scope: !592, file: !4, line: 458, column: 72)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !597, file: !4, line: 459, type: !35)
!597 = distinct !DILexicalBlock(scope: !523, file: !4, line: 459, column: 8)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !599, file: !4, line: 459, type: !35)
!599 = distinct !DILexicalBlock(scope: !600, file: !4, line: 459, column: 101)
!600 = distinct !DILexicalBlock(scope: !597, file: !4, line: 459, column: 67)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !602, file: !4, line: 460, type: !35)
!602 = distinct !DILexicalBlock(scope: !523, file: !4, line: 460, column: 8)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !604, file: !4, line: 460, type: !35)
!604 = distinct !DILexicalBlock(scope: !605, file: !4, line: 460, column: 99)
!605 = distinct !DILexicalBlock(scope: !602, file: !4, line: 460, column: 65)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !607, file: !4, line: 461, type: !35)
!607 = distinct !DILexicalBlock(scope: !523, file: !4, line: 461, column: 8)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !609, file: !4, line: 461, type: !35)
!609 = distinct !DILexicalBlock(scope: !610, file: !4, line: 461, column: 108)
!610 = distinct !DILexicalBlock(scope: !607, file: !4, line: 461, column: 74)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !612, file: !4, line: 462, type: !35)
!612 = distinct !DILexicalBlock(scope: !523, file: !4, line: 462, column: 8)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !614, file: !4, line: 462, type: !35)
!614 = distinct !DILexicalBlock(scope: !615, file: !4, line: 462, column: 98)
!615 = distinct !DILexicalBlock(scope: !612, file: !4, line: 462, column: 64)
!616 = !DISubprogram(name: "get_dialect_from_registry", scope: !4, file: !4, line: 130, type: !146, isLocal: true, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @get_dialect_from_registry, variables: !617)
!617 = !{!618, !619}
!618 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name_obj", arg: 1, scope: !616, file: !4, line: 130, type: !35)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dialect_obj", scope: !616, file: !4, line: 132, type: !35)
!620 = !DISubprogram(name: "_set_char", scope: !4, file: !4, line: 234, type: !621, isLocal: true, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32*, %struct._object*, i32)* @_set_char, variables: !623)
!621 = !DISubroutineType(types: !622)
!622 = !{!74, !59, !441, !35, !389}
!623 = !{!624, !625, !626, !627, !628}
!624 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !620, file: !4, line: 234, type: !59)
!625 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "target", arg: 2, scope: !620, file: !4, line: 234, type: !441)
!626 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 3, scope: !620, file: !4, line: 234, type: !35)
!627 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dflt", arg: 4, scope: !620, file: !4, line: 234, type: !389)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !629, file: !4, line: 241, type: !41)
!629 = distinct !DILexicalBlock(scope: !630, file: !4, line: 240, column: 39)
!630 = distinct !DILexicalBlock(scope: !631, file: !4, line: 240, column: 13)
!631 = distinct !DILexicalBlock(scope: !632, file: !4, line: 238, column: 10)
!632 = distinct !DILexicalBlock(scope: !620, file: !4, line: 236, column: 9)
!633 = !DISubprogram(name: "_set_bool", scope: !4, file: !4, line: 193, type: !634, isLocal: true, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32*, %struct._object*, i32)* @_set_bool, variables: !637)
!634 = !DISubroutineType(types: !635)
!635 = !{!74, !59, !636, !35, !74}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!637 = !{!638, !639, !640, !641, !642}
!638 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !633, file: !4, line: 193, type: !59)
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "target", arg: 2, scope: !633, file: !4, line: 193, type: !636)
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 3, scope: !633, file: !4, line: 193, type: !35)
!641 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dflt", arg: 4, scope: !633, file: !4, line: 193, type: !74)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !643, file: !4, line: 198, type: !74)
!643 = distinct !DILexicalBlock(scope: !644, file: !4, line: 197, column: 10)
!644 = distinct !DILexicalBlock(scope: !633, file: !4, line: 195, column: 9)
!645 = !DISubprogram(name: "_set_str", scope: !4, file: !4, line: 264, type: !646, isLocal: true, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._object**, %struct._object*, i8*)* @_set_str, variables: !649)
!646 = !DISubroutineType(types: !647)
!647 = !{!74, !59, !648, !35, !59}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!649 = !{!650, !651, !652, !653, !654, !661}
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !645, file: !4, line: 264, type: !59)
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "target", arg: 2, scope: !645, file: !4, line: 264, type: !648)
!652 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 3, scope: !645, file: !4, line: 264, type: !35)
!653 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dflt", arg: 4, scope: !645, file: !4, line: 264, type: !59)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !655, file: !4, line: 279, type: !35)
!655 = distinct !DILexicalBlock(scope: !656, file: !4, line: 279, column: 16)
!656 = distinct !DILexicalBlock(scope: !657, file: !4, line: 276, column: 14)
!657 = distinct !DILexicalBlock(scope: !658, file: !4, line: 271, column: 18)
!658 = distinct !DILexicalBlock(scope: !659, file: !4, line: 269, column: 13)
!659 = distinct !DILexicalBlock(scope: !660, file: !4, line: 268, column: 10)
!660 = distinct !DILexicalBlock(scope: !645, file: !4, line: 266, column: 9)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !662, file: !4, line: 279, type: !35)
!662 = distinct !DILexicalBlock(scope: !663, file: !4, line: 279, column: 107)
!663 = distinct !DILexicalBlock(scope: !655, file: !4, line: 279, column: 73)
!664 = !DISubprogram(name: "_set_int", scope: !4, file: !4, line: 207, type: !634, isLocal: true, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32*, %struct._object*, i32)* @_set_int, variables: !665)
!665 = !{!666, !667, !668, !669, !670}
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !664, file: !4, line: 207, type: !59)
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "target", arg: 2, scope: !664, file: !4, line: 207, type: !636)
!668 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 3, scope: !664, file: !4, line: 207, type: !35)
!669 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dflt", arg: 4, scope: !664, file: !4, line: 207, type: !74)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !671, file: !4, line: 212, type: !47)
!671 = distinct !DILexicalBlock(scope: !672, file: !4, line: 211, column: 10)
!672 = distinct !DILexicalBlock(scope: !664, file: !4, line: 209, column: 9)
!673 = !DISubprogram(name: "dialect_check_quoting", scope: !4, file: !4, line: 288, type: !674, isLocal: true, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @dialect_check_quoting, variables: !676)
!674 = !DISubroutineType(types: !675)
!675 = !{!74, !74}
!676 = !{!677, !678}
!677 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "quoting", arg: 1, scope: !673, file: !4, line: 288, type: !74)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qs", scope: !673, file: !4, line: 290, type: !479)
!679 = !DISubprogram(name: "Reader_dealloc", scope: !4, file: !4, line: 868, type: !680, isLocal: true, isDefinition: true, scopeLine: 869, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.ReaderObj*)* @Reader_dealloc, variables: !682)
!680 = !DISubroutineType(types: !681)
!681 = !{null, !446}
!682 = !{!683, !684, !686, !689, !691, !694, !696}
!683 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !679, file: !4, line: 868, type: !446)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !685, file: !4, line: 871, type: !35)
!685 = distinct !DILexicalBlock(scope: !679, file: !4, line: 871, column: 8)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !687, file: !4, line: 871, type: !35)
!687 = distinct !DILexicalBlock(scope: !688, file: !4, line: 871, column: 105)
!688 = distinct !DILexicalBlock(scope: !685, file: !4, line: 871, column: 71)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !690, file: !4, line: 872, type: !35)
!690 = distinct !DILexicalBlock(scope: !679, file: !4, line: 872, column: 8)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !692, file: !4, line: 872, type: !35)
!692 = distinct !DILexicalBlock(scope: !693, file: !4, line: 872, column: 108)
!693 = distinct !DILexicalBlock(scope: !690, file: !4, line: 872, column: 74)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !695, file: !4, line: 873, type: !35)
!695 = distinct !DILexicalBlock(scope: !679, file: !4, line: 873, column: 8)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !697, file: !4, line: 873, type: !35)
!697 = distinct !DILexicalBlock(scope: !698, file: !4, line: 873, column: 104)
!698 = distinct !DILexicalBlock(scope: !695, file: !4, line: 873, column: 70)
!699 = !DISubprogram(name: "Reader_traverse", scope: !4, file: !4, line: 880, type: !700, isLocal: true, isDefinition: true, scopeLine: 881, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ReaderObj*, i32 (%struct._object*, i8*)*, i8*)* @Reader_traverse, variables: !702)
!700 = !DISubroutineType(types: !701)
!701 = !{!74, !446, !293, !29}
!702 = !{!703, !704, !705, !706, !710, !714}
!703 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !699, file: !4, line: 880, type: !446)
!704 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !699, file: !4, line: 880, type: !293)
!705 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !699, file: !4, line: 880, type: !29)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !707, file: !4, line: 882, type: !74)
!707 = distinct !DILexicalBlock(scope: !708, file: !4, line: 882, column: 29)
!708 = distinct !DILexicalBlock(scope: !709, file: !4, line: 882, column: 14)
!709 = distinct !DILexicalBlock(scope: !699, file: !4, line: 882, column: 8)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !711, file: !4, line: 883, type: !74)
!711 = distinct !DILexicalBlock(scope: !712, file: !4, line: 883, column: 32)
!712 = distinct !DILexicalBlock(scope: !713, file: !4, line: 883, column: 14)
!713 = distinct !DILexicalBlock(scope: !699, file: !4, line: 883, column: 8)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !715, file: !4, line: 884, type: !74)
!715 = distinct !DILexicalBlock(scope: !716, file: !4, line: 884, column: 28)
!716 = distinct !DILexicalBlock(scope: !717, file: !4, line: 884, column: 14)
!717 = distinct !DILexicalBlock(scope: !699, file: !4, line: 884, column: 8)
!718 = !DISubprogram(name: "Reader_clear", scope: !4, file: !4, line: 889, type: !719, isLocal: true, isDefinition: true, scopeLine: 890, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ReaderObj*)* @Reader_clear, variables: !721)
!719 = !DISubroutineType(types: !720)
!720 = !{!74, !446}
!721 = !{!722, !723, !725, !729, !731, !735, !737}
!722 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !718, file: !4, line: 889, type: !446)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !724, file: !4, line: 891, type: !35)
!724 = distinct !DILexicalBlock(scope: !718, file: !4, line: 891, column: 8)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !726, file: !4, line: 891, type: !35)
!726 = distinct !DILexicalBlock(scope: !727, file: !4, line: 891, column: 121)
!727 = distinct !DILexicalBlock(scope: !728, file: !4, line: 891, column: 86)
!728 = distinct !DILexicalBlock(scope: !724, file: !4, line: 891, column: 63)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !730, file: !4, line: 892, type: !35)
!730 = distinct !DILexicalBlock(scope: !718, file: !4, line: 892, column: 8)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !732, file: !4, line: 892, type: !35)
!732 = distinct !DILexicalBlock(scope: !733, file: !4, line: 892, column: 127)
!733 = distinct !DILexicalBlock(scope: !734, file: !4, line: 892, column: 89)
!734 = distinct !DILexicalBlock(scope: !730, file: !4, line: 892, column: 66)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !736, file: !4, line: 893, type: !35)
!736 = distinct !DILexicalBlock(scope: !718, file: !4, line: 893, column: 8)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !738, file: !4, line: 893, type: !35)
!738 = distinct !DILexicalBlock(scope: !739, file: !4, line: 893, column: 119)
!739 = distinct !DILexicalBlock(scope: !740, file: !4, line: 893, column: 85)
!740 = distinct !DILexicalBlock(scope: !736, file: !4, line: 893, column: 62)
!741 = !DISubprogram(name: "Reader_iternext", scope: !4, file: !4, line: 798, type: !742, isLocal: true, isDefinition: true, scopeLine: 799, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.ReaderObj*)* @Reader_iternext, variables: !744)
!742 = !DISubroutineType(types: !743)
!743 = !{!35, !446}
!744 = !{!745, !746, !747, !748, !749, !750, !751, !752, !753, !758, !762, !767, !771}
!745 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !741, file: !4, line: 798, type: !446)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fields", scope: !741, file: !4, line: 800, type: !35)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !741, file: !4, line: 801, type: !389)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !741, file: !4, line: 802, type: !41)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "linelen", scope: !741, file: !4, line: 802, type: !41)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !741, file: !4, line: 803, type: !378)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !741, file: !4, line: 804, type: !29)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lineobj", scope: !741, file: !4, line: 805, type: !35)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !754, file: !4, line: 830, type: !35)
!754 = distinct !DILexicalBlock(scope: !755, file: !4, line: 830, column: 16)
!755 = distinct !DILexicalBlock(scope: !756, file: !4, line: 823, column: 86)
!756 = distinct !DILexicalBlock(scope: !757, file: !4, line: 823, column: 13)
!757 = distinct !DILexicalBlock(scope: !741, file: !4, line: 809, column: 8)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !759, file: !4, line: 834, type: !35)
!759 = distinct !DILexicalBlock(scope: !760, file: !4, line: 834, column: 16)
!760 = distinct !DILexicalBlock(scope: !761, file: !4, line: 833, column: 125)
!761 = distinct !DILexicalBlock(scope: !757, file: !4, line: 833, column: 13)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !763, file: !4, line: 845, type: !35)
!763 = distinct !DILexicalBlock(scope: !764, file: !4, line: 845, column: 20)
!764 = distinct !DILexicalBlock(scope: !765, file: !4, line: 844, column: 28)
!765 = distinct !DILexicalBlock(scope: !766, file: !4, line: 844, column: 17)
!766 = distinct !DILexicalBlock(scope: !757, file: !4, line: 842, column: 27)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !768, file: !4, line: 851, type: !35)
!768 = distinct !DILexicalBlock(scope: !769, file: !4, line: 851, column: 20)
!769 = distinct !DILexicalBlock(scope: !770, file: !4, line: 850, column: 50)
!770 = distinct !DILexicalBlock(scope: !766, file: !4, line: 850, column: 17)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !772, file: !4, line: 856, type: !35)
!772 = distinct !DILexicalBlock(scope: !757, file: !4, line: 856, column: 12)
!773 = !DISubprogram(name: "parse_reset", scope: !4, file: !4, line: 785, type: !719, isLocal: true, isDefinition: true, scopeLine: 786, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ReaderObj*)* @parse_reset, variables: !774)
!774 = !{!775, !776, !778}
!775 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !773, file: !4, line: 785, type: !446)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !777, file: !4, line: 787, type: !35)
!777 = distinct !DILexicalBlock(scope: !773, file: !4, line: 787, column: 8)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !779, file: !4, line: 787, type: !35)
!779 = distinct !DILexicalBlock(scope: !780, file: !4, line: 787, column: 104)
!780 = distinct !DILexicalBlock(scope: !777, file: !4, line: 787, column: 70)
!781 = !DISubprogram(name: "parse_save_field", scope: !4, file: !4, line: 537, type: !719, isLocal: true, isDefinition: true, scopeLine: 538, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ReaderObj*)* @parse_save_field, variables: !782)
!782 = !{!783, !784, !785, !788, !790, !794}
!783 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !781, file: !4, line: 537, type: !446)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "field", scope: !781, file: !4, line: 539, type: !35)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !786, file: !4, line: 547, type: !35)
!786 = distinct !DILexicalBlock(scope: !787, file: !4, line: 546, column: 30)
!787 = distinct !DILexicalBlock(scope: !781, file: !4, line: 546, column: 9)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !789, file: !4, line: 551, type: !35)
!789 = distinct !DILexicalBlock(scope: !786, file: !4, line: 551, column: 12)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !791, file: !4, line: 557, type: !35)
!791 = distinct !DILexicalBlock(scope: !792, file: !4, line: 557, column: 12)
!792 = distinct !DILexicalBlock(scope: !793, file: !4, line: 556, column: 49)
!793 = distinct !DILexicalBlock(scope: !781, file: !4, line: 556, column: 9)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !795, file: !4, line: 560, type: !35)
!795 = distinct !DILexicalBlock(scope: !781, file: !4, line: 560, column: 8)
!796 = !DISubprogram(name: "parse_process_char", scope: !4, file: !4, line: 604, type: !797, isLocal: true, isDefinition: true, scopeLine: 605, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ReaderObj*, i32)* @parse_process_char, variables: !799)
!797 = !DISubroutineType(types: !798)
!798 = !{!74, !446, !389}
!799 = !{!800, !801, !802}
!800 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !796, file: !4, line: 604, type: !446)
!801 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 2, scope: !796, file: !4, line: 604, type: !389)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dialect", scope: !796, file: !4, line: 606, type: !382)
!803 = !DISubprogram(name: "parse_add_char", scope: !4, file: !4, line: 590, type: !797, isLocal: true, isDefinition: true, scopeLine: 591, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ReaderObj*, i32)* @parse_add_char, variables: !804)
!804 = !{!805, !806}
!805 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !803, file: !4, line: 590, type: !446)
!806 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 2, scope: !803, file: !4, line: 590, type: !389)
!807 = !DISubprogram(name: "parse_grow_buff", scope: !4, file: !4, line: 565, type: !719, isLocal: true, isDefinition: true, scopeLine: 566, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ReaderObj*)* @parse_grow_buff, variables: !808)
!808 = !{!809, !810}
!809 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !807, file: !4, line: 565, type: !446)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "field", scope: !811, file: !4, line: 574, type: !441)
!811 = distinct !DILexicalBlock(scope: !812, file: !4, line: 573, column: 10)
!812 = distinct !DILexicalBlock(scope: !807, file: !4, line: 567, column: 9)
!813 = !DISubprogram(name: "Writer_dealloc", scope: !4, file: !4, line: 1311, type: !814, isLocal: true, isDefinition: true, scopeLine: 1312, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.WriterObj*)* @Writer_dealloc, variables: !816)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !461}
!816 = !{!817, !818, !820, !823, !825}
!817 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !813, file: !4, line: 1311, type: !461)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !819, file: !4, line: 1314, type: !35)
!819 = distinct !DILexicalBlock(scope: !813, file: !4, line: 1314, column: 8)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !821, file: !4, line: 1314, type: !35)
!821 = distinct !DILexicalBlock(scope: !822, file: !4, line: 1314, column: 105)
!822 = distinct !DILexicalBlock(scope: !819, file: !4, line: 1314, column: 71)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !824, file: !4, line: 1315, type: !35)
!824 = distinct !DILexicalBlock(scope: !813, file: !4, line: 1315, column: 8)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !826, file: !4, line: 1315, type: !35)
!826 = distinct !DILexicalBlock(scope: !827, file: !4, line: 1315, column: 107)
!827 = distinct !DILexicalBlock(scope: !824, file: !4, line: 1315, column: 73)
!828 = !DISubprogram(name: "Writer_traverse", scope: !4, file: !4, line: 1322, type: !829, isLocal: true, isDefinition: true, scopeLine: 1323, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.WriterObj*, i32 (%struct._object*, i8*)*, i8*)* @Writer_traverse, variables: !831)
!829 = !DISubroutineType(types: !830)
!830 = !{!74, !461, !293, !29}
!831 = !{!832, !833, !834, !835, !839}
!832 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !828, file: !4, line: 1322, type: !461)
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !828, file: !4, line: 1322, type: !293)
!834 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !828, file: !4, line: 1322, type: !29)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !836, file: !4, line: 1324, type: !74)
!836 = distinct !DILexicalBlock(scope: !837, file: !4, line: 1324, column: 29)
!837 = distinct !DILexicalBlock(scope: !838, file: !4, line: 1324, column: 14)
!838 = distinct !DILexicalBlock(scope: !828, file: !4, line: 1324, column: 8)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !840, file: !4, line: 1325, type: !74)
!840 = distinct !DILexicalBlock(scope: !841, file: !4, line: 1325, column: 31)
!841 = distinct !DILexicalBlock(scope: !842, file: !4, line: 1325, column: 14)
!842 = distinct !DILexicalBlock(scope: !828, file: !4, line: 1325, column: 8)
!843 = !DISubprogram(name: "Writer_clear", scope: !4, file: !4, line: 1330, type: !844, isLocal: true, isDefinition: true, scopeLine: 1331, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.WriterObj*)* @Writer_clear, variables: !846)
!844 = !DISubroutineType(types: !845)
!845 = !{!74, !461}
!846 = !{!847, !848, !850, !854, !856}
!847 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !843, file: !4, line: 1330, type: !461)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !849, file: !4, line: 1332, type: !35)
!849 = distinct !DILexicalBlock(scope: !843, file: !4, line: 1332, column: 8)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !851, file: !4, line: 1332, type: !35)
!851 = distinct !DILexicalBlock(scope: !852, file: !4, line: 1332, column: 121)
!852 = distinct !DILexicalBlock(scope: !853, file: !4, line: 1332, column: 86)
!853 = distinct !DILexicalBlock(scope: !849, file: !4, line: 1332, column: 63)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !855, file: !4, line: 1333, type: !35)
!855 = distinct !DILexicalBlock(scope: !843, file: !4, line: 1333, column: 8)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !857, file: !4, line: 1333, type: !35)
!857 = distinct !DILexicalBlock(scope: !858, file: !4, line: 1333, column: 125)
!858 = distinct !DILexicalBlock(scope: !859, file: !4, line: 1333, column: 88)
!859 = distinct !DILexicalBlock(scope: !855, file: !4, line: 1333, column: 65)
!860 = !DISubprogram(name: "csv_writerow", scope: !4, file: !4, line: 1190, type: !861, isLocal: true, isDefinition: true, scopeLine: 1191, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.WriterObj*, %struct._object*)* @csv_writerow, variables: !863)
!861 = !DISubroutineType(types: !862)
!862 = !{!35, !461, !35}
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871, !875, !876, !877, !881, !885, !887, !889, !891}
!864 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !860, file: !4, line: 1190, type: !461)
!865 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seq", arg: 2, scope: !860, file: !4, line: 1190, type: !35)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dialect", scope: !860, file: !4, line: 1192, type: !382)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !860, file: !4, line: 1193, type: !41)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !860, file: !4, line: 1193, type: !41)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !860, file: !4, line: 1194, type: !35)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !860, file: !4, line: 1194, type: !35)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "field", scope: !872, file: !4, line: 1207, type: !35)
!872 = distinct !DILexicalBlock(scope: !873, file: !4, line: 1206, column: 31)
!873 = distinct !DILexicalBlock(scope: !874, file: !4, line: 1206, column: 5)
!874 = distinct !DILexicalBlock(scope: !860, file: !4, line: 1206, column: 5)
!875 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "append_ok", scope: !872, file: !4, line: 1208, type: !74)
!876 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "quoted", scope: !872, file: !4, line: 1209, type: !74)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !878, file: !4, line: 1229, type: !35)
!878 = distinct !DILexicalBlock(scope: !879, file: !4, line: 1229, column: 16)
!879 = distinct !DILexicalBlock(scope: !880, file: !4, line: 1227, column: 83)
!880 = distinct !DILexicalBlock(scope: !872, file: !4, line: 1227, column: 13)
!881 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !882, file: !4, line: 1233, type: !35)
!882 = distinct !DILexicalBlock(scope: !883, file: !4, line: 1233, column: 16)
!883 = distinct !DILexicalBlock(scope: !884, file: !4, line: 1231, column: 46)
!884 = distinct !DILexicalBlock(scope: !880, file: !4, line: 1231, column: 18)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !886, file: !4, line: 1236, type: !35)
!886 = distinct !DILexicalBlock(scope: !884, file: !4, line: 1235, column: 14)
!887 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !888, file: !4, line: 1239, type: !35)
!888 = distinct !DILexicalBlock(scope: !886, file: !4, line: 1239, column: 16)
!889 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !890, file: !4, line: 1243, type: !35)
!890 = distinct !DILexicalBlock(scope: !886, file: !4, line: 1243, column: 16)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !892, file: !4, line: 1259, type: !35)
!892 = distinct !DILexicalBlock(scope: !860, file: !4, line: 1259, column: 8)
!893 = !DISubprogram(name: "join_reset", scope: !4, file: !4, line: 999, type: !814, isLocal: true, isDefinition: true, scopeLine: 1000, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.WriterObj*)* @join_reset, variables: !894)
!894 = !{!895}
!895 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !893, file: !4, line: 999, type: !461)
!896 = !DISubprogram(name: "join_append", scope: !4, file: !4, line: 1129, type: !897, isLocal: true, isDefinition: true, scopeLine: 1130, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.WriterObj*, %struct._object*, i32*, i32)* @join_append, variables: !899)
!897 = !DISubroutineType(types: !898)
!898 = !{!74, !461, !35, !636, !74}
!899 = !{!900, !901, !902, !903, !904, !905, !906, !907}
!900 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !896, file: !4, line: 1129, type: !461)
!901 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "field", arg: 2, scope: !896, file: !4, line: 1129, type: !35)
!902 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "quoted", arg: 3, scope: !896, file: !4, line: 1129, type: !636)
!903 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "quote_empty", arg: 4, scope: !896, file: !4, line: 1129, type: !74)
!904 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "field_kind", scope: !896, file: !4, line: 1131, type: !378)
!905 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "field_data", scope: !896, file: !4, line: 1132, type: !29)
!906 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "field_len", scope: !896, file: !4, line: 1133, type: !41)
!907 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rec_len", scope: !896, file: !4, line: 1134, type: !41)
!908 = !DISubprogram(name: "join_append_data", scope: !4, file: !4, line: 1011, type: !909, isLocal: true, isDefinition: true, scopeLine: 1014, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.WriterObj*, i32, i8*, i64, i32, i32*, i32)* @join_append_data, variables: !911)
!909 = !DISubroutineType(types: !910)
!910 = !{!41, !461, !378, !29, !41, !74, !636, !74}
!911 = !{!912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !926}
!912 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !908, file: !4, line: 1011, type: !461)
!913 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "field_kind", arg: 2, scope: !908, file: !4, line: 1011, type: !378)
!914 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "field_data", arg: 3, scope: !908, file: !4, line: 1011, type: !29)
!915 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "field_len", arg: 4, scope: !908, file: !4, line: 1012, type: !41)
!916 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "quote_empty", arg: 5, scope: !908, file: !4, line: 1012, type: !74)
!917 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "quoted", arg: 6, scope: !908, file: !4, line: 1012, type: !636)
!918 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "copy_phase", arg: 7, scope: !908, file: !4, line: 1013, type: !74)
!919 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dialect", scope: !908, file: !4, line: 1015, type: !382)
!920 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !908, file: !4, line: 1016, type: !74)
!921 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rec_len", scope: !908, file: !4, line: 1017, type: !41)
!922 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !923, file: !4, line: 1039, type: !389)
!923 = distinct !DILexicalBlock(scope: !924, file: !4, line: 1038, column: 53)
!924 = distinct !DILexicalBlock(scope: !925, file: !4, line: 1038, column: 5)
!925 = distinct !DILexicalBlock(scope: !908, file: !4, line: 1038, column: 5)
!926 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "want_escape", scope: !923, file: !4, line: 1040, type: !74)
!927 = !DISubprogram(name: "join_check_rec_size", scope: !4, file: !4, line: 1097, type: !928, isLocal: true, isDefinition: true, scopeLine: 1098, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.WriterObj*, i64)* @join_check_rec_size, variables: !930)
!928 = !DISubroutineType(types: !929)
!929 = !{!74, !461, !41}
!930 = !{!931, !932, !933}
!931 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !927, file: !4, line: 1097, type: !461)
!932 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rec_len", arg: 2, scope: !927, file: !4, line: 1097, type: !41)
!933 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_rec", scope: !934, file: !4, line: 1113, type: !441)
!934 = distinct !DILexicalBlock(scope: !935, file: !4, line: 1112, column: 14)
!935 = distinct !DILexicalBlock(scope: !936, file: !4, line: 1106, column: 13)
!936 = distinct !DILexicalBlock(scope: !937, file: !4, line: 1105, column: 35)
!937 = distinct !DILexicalBlock(scope: !927, file: !4, line: 1105, column: 9)
!938 = !DISubprogram(name: "join_append_lineterminator", scope: !4, file: !4, line: 1160, type: !844, isLocal: true, isDefinition: true, scopeLine: 1161, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.WriterObj*)* @join_append_lineterminator, variables: !939)
!939 = !{!940, !941, !942, !943, !944}
!940 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !938, file: !4, line: 1160, type: !461)
!941 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "terminator_len", scope: !938, file: !4, line: 1162, type: !41)
!942 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !938, file: !4, line: 1162, type: !41)
!943 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "term_kind", scope: !938, file: !4, line: 1163, type: !378)
!944 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "term_data", scope: !938, file: !4, line: 1164, type: !29)
!945 = !DISubprogram(name: "csv_writerows", scope: !4, file: !4, line: 1270, type: !861, isLocal: true, isDefinition: true, scopeLine: 1271, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.WriterObj*, %struct._object*)* @csv_writerows, variables: !946)
!946 = !{!947, !948, !949, !950, !951, !952, !955, !959, !961}
!947 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !945, file: !4, line: 1270, type: !461)
!948 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seqseq", arg: 2, scope: !945, file: !4, line: 1270, type: !35)
!949 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "row_iter", scope: !945, file: !4, line: 1272, type: !35)
!950 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "row_obj", scope: !945, file: !4, line: 1272, type: !35)
