; ModuleID = 'programs_new/Python-new/_ctypes.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._typeobject = type { %struct.PyVarObject, i8*, i64, i64, void (%struct._object*)*, i32 (%struct._object*, %struct._IO_FILE*, i32)*, %struct._object* (%struct._object*, i8*)*, i32 (%struct._object*, i8*, %struct._object*)*, i8*, %struct._object* (%struct._object*)*, %struct.PyNumberMethods*, %struct.PySequenceMethods*, %struct.PyMappingMethods*, i64 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*)*, {}*, %struct.PyBufferProcs*, i64, i8*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, i32)*, i64, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*)*, %struct.PyMethodDef*, %struct.PyMemberDef*, %struct.PyGetSetDef*, %struct._typeobject*, %struct._object*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, {}*, i64, {}*, %struct._object* (%struct._typeobject*, i64)*, %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)*, void (i8*)*, i32 (%struct._object*)*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, void (%struct._object*)*, i32, void (%struct._object*)* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !19, subprograms: !667, globals: !2402)
!1 = !DIFile(filename: "_ctypes.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !11}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !4, line: 23, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./Include/pyatomic.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!7 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!8 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!9 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!10 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ffi_abi", file: !12, line: 75, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "build/temp.linux-x86_64-3.4/libffi/include/ffitarget.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !{!14, !15, !16, !17, !18}
!14 = !DIEnumerator(name: "FFI_FIRST_ABI", value: 0)
!15 = !DIEnumerator(name: "FFI_SYSV", value: 1)
!16 = !DIEnumerator(name: "FFI_UNIX64", value: 2)
!17 = !DIEnumerator(name: "FFI_LAST_ABI", value: 3)
!18 = !DIEnumerator(name: "FFI_DEFAULT_ABI", value: 2)
!19 = !{!20, !105, !366, !374, !385, !417, !67, !32, !110, !419, !421, !44, !424, !457, !458, !503, !504, !505, !513, !514, !364, !515, !573, !636, !59, !644, !648, !656, !657, !666}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !22, line: 109, baseType: !23)
!22 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !22, line: 105, size: 128, align: 64, elements: !24)
!24 = !{!25, !33}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !23, file: !22, line: 107, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !27, line: 177, baseType: !28)
!27 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !29, line: 102, baseType: !30)
!29 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !31, line: 181, baseType: !32)
!31 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!32 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !23, file: !22, line: 108, baseType: !34, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !22, line: 334, size: 3200, align: 64, elements: !36)
!36 = !{!37, !43, !47, !48, !49, !54, !118, !123, !128, !129, !134, !186, !217, !229, !235, !236, !237, !239, !241, !272, !273, !274, !283, !284, !289, !290, !292, !294, !304, !314, !332, !333, !334, !336, !338, !339, !341, !346, !351, !356, !357, !358, !359, !360, !361, !362, !363, !365}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !35, file: !22, line: 335, baseType: !38, size: 192, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !22, line: 114, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 111, size: 192, align: 64, elements: !40)
!40 = !{!41, !42}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !39, file: !22, line: 112, baseType: !21, size: 128, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !39, file: !22, line: 113, baseType: !26, size: 64, align: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !35, file: !22, line: 336, baseType: !44, size: 64, align: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !35, file: !22, line: 337, baseType: !26, size: 64, align: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !35, file: !22, line: 337, baseType: !26, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !35, file: !22, line: 341, baseType: !50, size: 64, align: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !22, line: 308, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !20}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !35, file: !22, line: 342, baseType: !55, size: 64, align: 64, offset: 448)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !22, line: 314, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !20, !60, !59}
!59 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !29, line: 48, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !63, line: 246, size: 1728, align: 64, elements: !64)
!63 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!64 = !{!65, !66, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !86, !87, !88, !89, !91, !93, !95, !99, !102, !104, !106, !107, !108, !109, !113, !114}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !62, file: !63, line: 247, baseType: !59, size: 32, align: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !62, file: !63, line: 252, baseType: !67, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !62, file: !63, line: 253, baseType: !67, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !62, file: !63, line: 254, baseType: !67, size: 64, align: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !62, file: !63, line: 255, baseType: !67, size: 64, align: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !62, file: !63, line: 256, baseType: !67, size: 64, align: 64, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !62, file: !63, line: 257, baseType: !67, size: 64, align: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !62, file: !63, line: 258, baseType: !67, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !62, file: !63, line: 259, baseType: !67, size: 64, align: 64, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !62, file: !63, line: 261, baseType: !67, size: 64, align: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !62, file: !63, line: 262, baseType: !67, size: 64, align: 64, offset: 640)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !62, file: !63, line: 263, baseType: !67, size: 64, align: 64, offset: 704)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !62, file: !63, line: 265, baseType: !79, size: 64, align: 64, offset: 768)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !63, line: 161, size: 192, align: 64, elements: !81)
!81 = !{!82, !83, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !80, file: !63, line: 162, baseType: !79, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !80, file: !63, line: 163, baseType: !84, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !80, file: !63, line: 167, baseType: !59, size: 32, align: 32, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !62, file: !63, line: 267, baseType: !84, size: 64, align: 64, offset: 832)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !62, file: !63, line: 269, baseType: !59, size: 32, align: 32, offset: 896)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !62, file: !63, line: 273, baseType: !59, size: 32, align: 32, offset: 928)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !62, file: !63, line: 275, baseType: !90, size: 64, align: 64, offset: 960)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !31, line: 140, baseType: !32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !62, file: !63, line: 279, baseType: !92, size: 16, align: 16, offset: 1024)
!92 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !62, file: !63, line: 280, baseType: !94, size: 8, align: 8, offset: 1040)
!94 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !62, file: !63, line: 281, baseType: !96, size: 8, align: 8, offset: 1048)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 8, align: 8, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 1)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !62, file: !63, line: 285, baseType: !100, size: 64, align: 64, offset: 1088)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !63, line: 155, baseType: null)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !62, file: !63, line: 294, baseType: !103, size: 64, align: 64, offset: 1152)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !31, line: 141, baseType: !32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !62, file: !63, line: 303, baseType: !105, size: 64, align: 64, offset: 1216)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !62, file: !63, line: 304, baseType: !105, size: 64, align: 64, offset: 1280)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !62, file: !63, line: 305, baseType: !105, size: 64, align: 64, offset: 1344)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !62, file: !63, line: 306, baseType: !105, size: 64, align: 64, offset: 1408)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !62, file: !63, line: 307, baseType: !110, size: 64, align: 64, offset: 1472)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !111, line: 62, baseType: !112)
!111 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!112 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !62, file: !63, line: 309, baseType: !59, size: 32, align: 32, offset: 1536)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !62, file: !63, line: 311, baseType: !115, size: 160, align: 8, offset: 1568)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 160, align: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 20)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !35, file: !22, line: 343, baseType: !119, size: 64, align: 64, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !22, line: 316, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!20, !20, !67}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !35, file: !22, line: 344, baseType: !124, size: 64, align: 64, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !22, line: 318, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!59, !20, !67, !20}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !35, file: !22, line: 345, baseType: !105, size: 64, align: 64, offset: 640)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !35, file: !22, line: 346, baseType: !130, size: 64, align: 64, offset: 704)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !22, line: 320, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!20, !20}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !35, file: !22, line: 350, baseType: !135, size: 64, align: 64, offset: 768)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !22, line: 278, baseType: !137)
!137 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 236, size: 2176, align: 64, elements: !138)
!138 = !{!139, !144, !145, !146, !147, !148, !153, !155, !156, !157, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !137, file: !22, line: 241, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !22, line: 166, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!20, !20, !20}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !137, file: !22, line: 242, baseType: !140, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !137, file: !22, line: 243, baseType: !140, size: 64, align: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !137, file: !22, line: 244, baseType: !140, size: 64, align: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !137, file: !22, line: 245, baseType: !140, size: 64, align: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !137, file: !22, line: 246, baseType: !149, size: 64, align: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !22, line: 167, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!20, !20, !20, !20}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !137, file: !22, line: 247, baseType: !154, size: 64, align: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !22, line: 165, baseType: !131)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !137, file: !22, line: 248, baseType: !154, size: 64, align: 64, offset: 448)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !137, file: !22, line: 249, baseType: !154, size: 64, align: 64, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !137, file: !22, line: 250, baseType: !158, size: 64, align: 64, offset: 576)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !22, line: 168, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!59, !20}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !137, file: !22, line: 251, baseType: !154, size: 64, align: 64, offset: 640)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !137, file: !22, line: 252, baseType: !140, size: 64, align: 64, offset: 704)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !137, file: !22, line: 253, baseType: !140, size: 64, align: 64, offset: 768)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !137, file: !22, line: 254, baseType: !140, size: 64, align: 64, offset: 832)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !137, file: !22, line: 255, baseType: !140, size: 64, align: 64, offset: 896)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !137, file: !22, line: 256, baseType: !140, size: 64, align: 64, offset: 960)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !137, file: !22, line: 257, baseType: !154, size: 64, align: 64, offset: 1024)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !137, file: !22, line: 258, baseType: !105, size: 64, align: 64, offset: 1088)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !137, file: !22, line: 259, baseType: !154, size: 64, align: 64, offset: 1152)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !137, file: !22, line: 261, baseType: !140, size: 64, align: 64, offset: 1216)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !137, file: !22, line: 262, baseType: !140, size: 64, align: 64, offset: 1280)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !137, file: !22, line: 263, baseType: !140, size: 64, align: 64, offset: 1344)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !137, file: !22, line: 264, baseType: !140, size: 64, align: 64, offset: 1408)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !137, file: !22, line: 265, baseType: !149, size: 64, align: 64, offset: 1472)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !137, file: !22, line: 266, baseType: !140, size: 64, align: 64, offset: 1536)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !137, file: !22, line: 267, baseType: !140, size: 64, align: 64, offset: 1600)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !137, file: !22, line: 268, baseType: !140, size: 64, align: 64, offset: 1664)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !137, file: !22, line: 269, baseType: !140, size: 64, align: 64, offset: 1728)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !137, file: !22, line: 270, baseType: !140, size: 64, align: 64, offset: 1792)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !137, file: !22, line: 272, baseType: !140, size: 64, align: 64, offset: 1856)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !137, file: !22, line: 273, baseType: !140, size: 64, align: 64, offset: 1920)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !137, file: !22, line: 274, baseType: !140, size: 64, align: 64, offset: 1984)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !137, file: !22, line: 275, baseType: !140, size: 64, align: 64, offset: 2048)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !137, file: !22, line: 277, baseType: !154, size: 64, align: 64, offset: 2112)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !35, file: !22, line: 351, baseType: !187, size: 64, align: 64, offset: 832)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !22, line: 292, baseType: !189)
!189 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 280, size: 640, align: 64, elements: !190)
!190 = !{!191, !196, !197, !202, !203, !204, !209, !210, !215, !216}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !189, file: !22, line: 281, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !22, line: 169, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!26, !20}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !189, file: !22, line: 282, baseType: !140, size: 64, align: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !189, file: !22, line: 283, baseType: !198, size: 64, align: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !22, line: 170, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!20, !20, !26}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !189, file: !22, line: 284, baseType: !198, size: 64, align: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !189, file: !22, line: 285, baseType: !105, size: 64, align: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !189, file: !22, line: 286, baseType: !205, size: 64, align: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !22, line: 172, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!59, !20, !26, !20}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !189, file: !22, line: 287, baseType: !105, size: 64, align: 64, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !189, file: !22, line: 288, baseType: !211, size: 64, align: 64, offset: 448)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !22, line: 231, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!59, !20, !20}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !189, file: !22, line: 290, baseType: !140, size: 64, align: 64, offset: 512)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !189, file: !22, line: 291, baseType: !198, size: 64, align: 64, offset: 576)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !35, file: !22, line: 352, baseType: !218, size: 64, align: 64, offset: 896)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !22, line: 298, baseType: !220)
!220 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 294, size: 192, align: 64, elements: !221)
!221 = !{!222, !223, !224}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !220, file: !22, line: 295, baseType: !192, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !220, file: !22, line: 296, baseType: !140, size: 64, align: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !220, file: !22, line: 297, baseType: !225, size: 64, align: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !22, line: 174, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!59, !20, !20, !20}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !35, file: !22, line: 356, baseType: !230, size: 64, align: 64, offset: 960)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !22, line: 321, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!234, !20}
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !27, line: 186, baseType: !26)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !35, file: !22, line: 357, baseType: !149, size: 64, align: 64, offset: 1024)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !35, file: !22, line: 358, baseType: !130, size: 64, align: 64, offset: 1088)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !35, file: !22, line: 359, baseType: !238, size: 64, align: 64, offset: 1152)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !22, line: 317, baseType: !141)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !35, file: !22, line: 360, baseType: !240, size: 64, align: 64, offset: 1216)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !22, line: 319, baseType: !226)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !35, file: !22, line: 363, baseType: !242, size: 64, align: 64, offset: 1280)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !22, line: 304, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 301, size: 128, align: 64, elements: !245)
!245 = !{!246, !267}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !244, file: !22, line: 302, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !22, line: 193, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!59, !20, !251, !59}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !22, line: 191, baseType: !253)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !22, line: 178, size: 640, align: 64, elements: !254)
!254 = !{!255, !256, !257, !258, !259, !260, !261, !262, !264, !265, !266}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !253, file: !22, line: 179, baseType: !105, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !253, file: !22, line: 180, baseType: !20, size: 64, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !253, file: !22, line: 181, baseType: !26, size: 64, align: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !253, file: !22, line: 182, baseType: !26, size: 64, align: 64, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !253, file: !22, line: 184, baseType: !59, size: 32, align: 32, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !253, file: !22, line: 185, baseType: !59, size: 32, align: 32, offset: 288)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !253, file: !22, line: 186, baseType: !67, size: 64, align: 64, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !253, file: !22, line: 187, baseType: !263, size: 64, align: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !253, file: !22, line: 188, baseType: !263, size: 64, align: 64, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !253, file: !22, line: 189, baseType: !263, size: 64, align: 64, offset: 512)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !253, file: !22, line: 190, baseType: !105, size: 64, align: 64, offset: 576)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !244, file: !22, line: 303, baseType: !268, size: 64, align: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !22, line: 194, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !20, !251}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !35, file: !22, line: 366, baseType: !112, size: 64, align: 64, offset: 1344)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !35, file: !22, line: 368, baseType: !44, size: 64, align: 64, offset: 1408)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !35, file: !22, line: 372, baseType: !275, size: 64, align: 64, offset: 1472)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !22, line: 233, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!59, !20, !279, !105}
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !22, line: 232, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!59, !20, !105}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !35, file: !22, line: 375, baseType: !158, size: 64, align: 64, offset: 1536)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !35, file: !22, line: 379, baseType: !285, size: 64, align: 64, offset: 1600)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !22, line: 322, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!20, !20, !20, !59}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !35, file: !22, line: 382, baseType: !26, size: 64, align: 64, offset: 1664)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !35, file: !22, line: 385, baseType: !291, size: 64, align: 64, offset: 1728)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !22, line: 323, baseType: !131)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !35, file: !22, line: 386, baseType: !293, size: 64, align: 64, offset: 1792)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !22, line: 324, baseType: !131)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !35, file: !22, line: 389, baseType: !295, size: 64, align: 64, offset: 1856)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !297, line: 40, size: 256, align: 64, elements: !298)
!297 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!298 = !{!299, !300, !302, !303}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !296, file: !297, line: 41, baseType: !44, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !296, file: !297, line: 42, baseType: !301, size: 64, align: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !297, line: 18, baseType: !141)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !296, file: !297, line: 43, baseType: !59, size: 32, align: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !296, file: !297, line: 45, baseType: !44, size: 64, align: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !35, file: !22, line: 390, baseType: !305, size: 64, align: 64, offset: 1920)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !307, line: 18, size: 320, align: 64, elements: !308)
!307 = !DIFile(filename: "./Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!308 = !{!309, !310, !311, !312, !313}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !307, line: 19, baseType: !67, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !306, file: !307, line: 20, baseType: !59, size: 32, align: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !306, file: !307, line: 21, baseType: !26, size: 64, align: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !306, file: !307, line: 22, baseType: !59, size: 32, align: 32, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !306, file: !307, line: 23, baseType: !67, size: 64, align: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !35, file: !22, line: 391, baseType: !315, size: 64, align: 64, offset: 1984)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !317, line: 11, size: 320, align: 64, elements: !318)
!317 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!318 = !{!319, !320, !325, !330, !331}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !316, file: !317, line: 12, baseType: !67, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !316, file: !317, line: 13, baseType: !321, size: 64, align: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !317, line: 8, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!20, !20, !105}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !316, file: !317, line: 14, baseType: !326, size: 64, align: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !317, line: 9, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!59, !20, !20, !105}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !316, file: !317, line: 15, baseType: !67, size: 64, align: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !316, file: !317, line: 16, baseType: !105, size: 64, align: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !35, file: !22, line: 392, baseType: !34, size: 64, align: 64, offset: 2048)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !35, file: !22, line: 393, baseType: !20, size: 64, align: 64, offset: 2112)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !35, file: !22, line: 394, baseType: !335, size: 64, align: 64, offset: 2176)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !22, line: 325, baseType: !150)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !35, file: !22, line: 395, baseType: !337, size: 64, align: 64, offset: 2240)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !22, line: 326, baseType: !226)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !35, file: !22, line: 396, baseType: !26, size: 64, align: 64, offset: 2304)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !35, file: !22, line: 397, baseType: !340, size: 64, align: 64, offset: 2368)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !22, line: 327, baseType: !226)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !35, file: !22, line: 398, baseType: !342, size: 64, align: 64, offset: 2432)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !22, line: 329, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!20, !34, !26}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !35, file: !22, line: 399, baseType: !347, size: 64, align: 64, offset: 2496)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !22, line: 328, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!20, !34, !20, !20}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !35, file: !22, line: 400, baseType: !352, size: 64, align: 64, offset: 2560)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !22, line: 307, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !105}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !35, file: !22, line: 401, baseType: !158, size: 64, align: 64, offset: 2624)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !35, file: !22, line: 402, baseType: !20, size: 64, align: 64, offset: 2688)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !35, file: !22, line: 403, baseType: !20, size: 64, align: 64, offset: 2752)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !35, file: !22, line: 404, baseType: !20, size: 64, align: 64, offset: 2816)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !35, file: !22, line: 405, baseType: !20, size: 64, align: 64, offset: 2880)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !35, file: !22, line: 406, baseType: !20, size: 64, align: 64, offset: 2944)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !35, file: !22, line: 407, baseType: !50, size: 64, align: 64, offset: 3008)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !35, file: !22, line: 410, baseType: !364, size: 32, align: 32, offset: 3072)
!364 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !35, file: !22, line: 412, baseType: !50, size: 64, align: 64, offset: 3136)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "DictRemoverObject", file: !368, line: 143, baseType: !369)
!368 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_ctypes/_ctypes.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!369 = !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 139, size: 256, align: 64, elements: !370)
!370 = !{!371, !372, !373}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !369, file: !368, line: 140, baseType: !21, size: 128, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !369, file: !368, line: 141, baseType: !20, size: 64, align: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !369, file: !368, line: 142, baseType: !20, size: 64, align: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyWeakReference", file: !376, line: 10, baseType: !377)
!376 = !DIFile(filename: "./Include/weakrefobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!377 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyWeakReference", file: !376, line: 16, size: 448, align: 64, elements: !378)
!378 = !{!379, !380, !381, !382, !383, !384}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !377, file: !376, line: 17, baseType: !21, size: 128, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "wr_object", scope: !377, file: !376, line: 23, baseType: !20, size: 64, align: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "wr_callback", scope: !377, file: !376, line: 26, baseType: !20, size: 64, align: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !377, file: !376, line: 31, baseType: !234, size: 64, align: 64, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "wr_prev", scope: !377, file: !376, line: 38, baseType: !374, size: 64, align: 64, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "wr_next", scope: !377, file: !376, line: 39, baseType: !374, size: 64, align: 64, offset: 384)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "CDataObject", file: !387, line: 15, baseType: !388)
!387 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_ctypes/ctypes.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "tagCDataObject", file: !387, line: 46, size: 768, align: 128, elements: !389)
!389 = !{!390, !391, !392, !393, !394, !395, !396, !397, !398}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !388, file: !387, line: 47, baseType: !21, size: 128, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "b_ptr", scope: !388, file: !387, line: 48, baseType: !67, size: 64, align: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "b_needsfree", scope: !388, file: !387, line: 49, baseType: !59, size: 32, align: 32, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "b_base", scope: !388, file: !387, line: 50, baseType: !385, size: 64, align: 64, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "b_size", scope: !388, file: !387, line: 51, baseType: !26, size: 64, align: 64, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "b_length", scope: !388, file: !387, line: 52, baseType: !26, size: 64, align: 64, offset: 384)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "b_index", scope: !388, file: !387, line: 53, baseType: !26, size: 64, align: 64, offset: 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "b_objects", scope: !388, file: !387, line: 55, baseType: !20, size: 64, align: 64, offset: 512)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "b_value", scope: !388, file: !387, line: 56, baseType: !399, size: 128, align: 128, offset: 640)
!399 = !DICompositeType(tag: DW_TAG_union_type, name: "value", file: !387, line: 27, size: 128, align: 128, elements: !400)
!400 = !{!401, !405, !407, !408, !409, !411, !413, !415}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !399, file: !387, line: 28, baseType: !402, size: 128, align: 8)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 128, align: 8, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 16)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !399, file: !387, line: 29, baseType: !406, size: 16, align: 16)
!406 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !399, file: !387, line: 30, baseType: !59, size: 32, align: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !399, file: !387, line: 31, baseType: !32, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !399, file: !387, line: 32, baseType: !410, size: 32, align: 32)
!410 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !399, file: !387, line: 33, baseType: !412, size: 64, align: 64)
!412 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ll", scope: !399, file: !387, line: 35, baseType: !414, size: 64, align: 64)
!414 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !399, file: !387, line: 37, baseType: !416, size: 128, align: 128)
!416 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !22, line: 422, baseType: !35)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !423)
!423 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCArgObject", file: !387, line: 14, baseType: !426)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "tagPyCArgObject", file: !387, line: 296, size: 512, align: 128, elements: !427)
!427 = !{!428, !429, !441, !442, !455, !456}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !426, file: !387, line: 297, baseType: !21, size: 128, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pffi_type", scope: !426, file: !387, line: 298, baseType: !430, size: 64, align: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "ffi_type", file: !432, line: 118, baseType: !433)
!432 = !DIFile(filename: "build/temp.linux-x86_64-3.4/libffi/include/ffi.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ffi_type", file: !432, line: 112, size: 192, align: 64, elements: !434)
!434 = !{!435, !436, !437, !438}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !433, file: !432, line: 114, baseType: !110, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !433, file: !432, line: 115, baseType: !92, size: 16, align: 16, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !433, file: !432, line: 116, baseType: !92, size: 16, align: 16, offset: 80)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !433, file: !432, line: 117, baseType: !439, size: 64, align: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !426, file: !387, line: 299, baseType: !46, size: 8, align: 8, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !426, file: !387, line: 313, baseType: !443, size: 128, align: 128, offset: 256)
!443 = !DICompositeType(tag: DW_TAG_union_type, scope: !426, file: !387, line: 300, size: 128, align: 128, elements: !444)
!444 = !{!445, !446, !447, !448, !449, !450, !451, !452, !453, !454}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !443, file: !387, line: 301, baseType: !46, size: 8, align: 8)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !443, file: !387, line: 302, baseType: !46, size: 8, align: 8)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !443, file: !387, line: 303, baseType: !406, size: 16, align: 16)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !443, file: !387, line: 304, baseType: !59, size: 32, align: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !443, file: !387, line: 305, baseType: !32, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !443, file: !387, line: 307, baseType: !414, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !443, file: !387, line: 309, baseType: !416, size: 128, align: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !443, file: !387, line: 310, baseType: !412, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !443, file: !387, line: 311, baseType: !410, size: 32, align: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !443, file: !387, line: 312, baseType: !105, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !426, file: !387, line: 314, baseType: !20, size: 64, align: 64, offset: 384)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !426, file: !387, line: 315, baseType: !26, size: 64, align: 64, offset: 448)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "StgDictObject", file: !387, line: 220, baseType: !460)
!460 = !DICompositeType(tag: DW_TAG_structure_type, file: !387, line: 187, size: 1472, align: 64, elements: !461)
!461 = !{!462, !475, !476, !477, !478, !479, !480, !485, !490, !495, !496, !497, !498, !499, !500, !501, !502}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !460, file: !387, line: 188, baseType: !463, size: 320, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictObject", file: !464, line: 28, baseType: !465)
!464 = !DIFile(filename: "./Include/dictobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!465 = !DICompositeType(tag: DW_TAG_structure_type, file: !464, line: 23, size: 320, align: 64, elements: !466)
!466 = !{!467, !468, !469, !473}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !465, file: !464, line: 24, baseType: !21, size: 128, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ma_used", scope: !465, file: !464, line: 25, baseType: !26, size: 64, align: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ma_keys", scope: !465, file: !464, line: 26, baseType: !470, size: 64, align: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictKeysObject", file: !464, line: 18, baseType: !472)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "_dictkeysobject", file: !22, line: 461, flags: DIFlagFwdDecl)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ma_values", scope: !465, file: !464, line: 27, baseType: !474, size: 64, align: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !460, file: !387, line: 197, baseType: !26, size: 64, align: 64, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !460, file: !387, line: 198, baseType: !26, size: 64, align: 64, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !460, file: !387, line: 199, baseType: !26, size: 64, align: 64, offset: 448)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ffi_type_pointer", scope: !460, file: !387, line: 200, baseType: !431, size: 192, align: 64, offset: 512)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !460, file: !387, line: 201, baseType: !20, size: 64, align: 64, offset: 704)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "setfunc", scope: !460, file: !387, line: 202, baseType: !481, size: 64, align: 64, offset: 768)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "SETFUNC", file: !387, line: 17, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!20, !105, !20, !26}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "getfunc", scope: !460, file: !387, line: 203, baseType: !486, size: 64, align: 64, offset: 832)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "GETFUNC", file: !387, line: 16, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!20, !105, !26}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "paramfunc", scope: !460, file: !387, line: 204, baseType: !491, size: 64, align: 64, offset: 896)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "PARAMFUNC", file: !387, line: 18, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64, align: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!424, !385}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "argtypes", scope: !460, file: !387, line: 207, baseType: !20, size: 64, align: 64, offset: 960)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "converters", scope: !460, file: !387, line: 208, baseType: !20, size: 64, align: 64, offset: 1024)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "restype", scope: !460, file: !387, line: 209, baseType: !20, size: 64, align: 64, offset: 1088)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "checker", scope: !460, file: !387, line: 210, baseType: !20, size: 64, align: 64, offset: 1152)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !460, file: !387, line: 211, baseType: !59, size: 32, align: 32, offset: 1216)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !460, file: !387, line: 214, baseType: !67, size: 64, align: 64, offset: 1280)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !460, file: !387, line: 215, baseType: !59, size: 32, align: 32, offset: 1344)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !460, file: !387, line: 216, baseType: !263, size: 64, align: 64, offset: 1408)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !507, line: 41, baseType: !508)
!507 = !DIFile(filename: "./Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!508 = !DICompositeType(tag: DW_TAG_structure_type, file: !507, line: 31, size: 320, align: 64, elements: !509)
!509 = !{!510, !511, !512}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !508, file: !507, line: 32, baseType: !38, size: 192, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !508, file: !507, line: 33, baseType: !234, size: 64, align: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !508, file: !507, line: 34, baseType: !96, size: 8, align: 8, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !111, line: 90, baseType: !59)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64, align: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !517, line: 139, baseType: !518)
!517 = !DIFile(filename: "./Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !517, line: 69, size: 1536, align: 64, elements: !519)
!519 = !{!520, !522, !523, !543, !546, !547, !548, !549, !550, !551, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !518, file: !517, line: 72, baseType: !521, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !518, file: !517, line: 73, baseType: !521, size: 64, align: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !518, file: !517, line: 74, baseType: !524, size: 64, align: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !517, line: 44, baseType: !526)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !517, line: 19, size: 832, align: 64, elements: !527)
!527 = !{!528, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !526, file: !517, line: 21, baseType: !529, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !526, file: !517, line: 22, baseType: !521, size: 64, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !526, file: !517, line: 24, baseType: !20, size: 64, align: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !526, file: !517, line: 25, baseType: !20, size: 64, align: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !526, file: !517, line: 26, baseType: !20, size: 64, align: 64, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !526, file: !517, line: 27, baseType: !20, size: 64, align: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !526, file: !517, line: 28, baseType: !20, size: 64, align: 64, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !526, file: !517, line: 30, baseType: !20, size: 64, align: 64, offset: 448)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !526, file: !517, line: 31, baseType: !20, size: 64, align: 64, offset: 512)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !526, file: !517, line: 32, baseType: !20, size: 64, align: 64, offset: 576)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !526, file: !517, line: 33, baseType: !59, size: 32, align: 32, offset: 640)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !526, file: !517, line: 34, baseType: !59, size: 32, align: 32, offset: 672)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !526, file: !517, line: 37, baseType: !59, size: 32, align: 32, offset: 704)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !526, file: !517, line: 43, baseType: !20, size: 64, align: 64, offset: 768)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !518, file: !517, line: 76, baseType: !544, size: 64, align: 64, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !517, line: 50, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !518, file: !517, line: 77, baseType: !59, size: 32, align: 32, offset: 256)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !518, file: !517, line: 78, baseType: !46, size: 8, align: 8, offset: 288)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !518, file: !517, line: 80, baseType: !46, size: 8, align: 8, offset: 296)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !518, file: !517, line: 85, baseType: !59, size: 32, align: 32, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !518, file: !517, line: 86, baseType: !59, size: 32, align: 32, offset: 352)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !518, file: !517, line: 88, baseType: !552, size: 64, align: 64, offset: 384)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !517, line: 54, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64, align: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!59, !20, !544, !59, !20}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !518, file: !517, line: 89, baseType: !552, size: 64, align: 64, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !518, file: !517, line: 90, baseType: !20, size: 64, align: 64, offset: 512)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !518, file: !517, line: 91, baseType: !20, size: 64, align: 64, offset: 576)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !518, file: !517, line: 93, baseType: !20, size: 64, align: 64, offset: 640)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !518, file: !517, line: 94, baseType: !20, size: 64, align: 64, offset: 704)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !518, file: !517, line: 95, baseType: !20, size: 64, align: 64, offset: 768)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !518, file: !517, line: 97, baseType: !20, size: 64, align: 64, offset: 832)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !518, file: !517, line: 98, baseType: !20, size: 64, align: 64, offset: 896)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !518, file: !517, line: 99, baseType: !20, size: 64, align: 64, offset: 960)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !518, file: !517, line: 101, baseType: !20, size: 64, align: 64, offset: 1024)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !518, file: !517, line: 103, baseType: !59, size: 32, align: 32, offset: 1088)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !518, file: !517, line: 105, baseType: !20, size: 64, align: 64, offset: 1152)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !518, file: !517, line: 106, baseType: !32, size: 64, align: 64, offset: 1216)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !518, file: !517, line: 108, baseType: !59, size: 32, align: 32, offset: 1280)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !518, file: !517, line: 109, baseType: !20, size: 64, align: 64, offset: 1344)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !518, file: !517, line: 134, baseType: !353, size: 64, align: 64, offset: 1408)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !518, file: !517, line: 135, baseType: !105, size: 64, align: 64, offset: 1472)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFuncPtrObject", file: !387, line: 104, baseType: !575)
!575 = !DICompositeType(tag: DW_TAG_structure_type, file: !387, line: 75, size: 1280, align: 128, elements: !576)
!576 = !{!577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !629, !630, !631, !632, !633, !634, !635}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !575, file: !387, line: 77, baseType: !21, size: 128, align: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "b_ptr", scope: !575, file: !387, line: 78, baseType: !67, size: 64, align: 64, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "b_needsfree", scope: !575, file: !387, line: 79, baseType: !59, size: 32, align: 32, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "b_base", scope: !575, file: !387, line: 80, baseType: !385, size: 64, align: 64, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "b_size", scope: !575, file: !387, line: 81, baseType: !26, size: 64, align: 64, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "b_length", scope: !575, file: !387, line: 82, baseType: !26, size: 64, align: 64, offset: 384)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "b_index", scope: !575, file: !387, line: 83, baseType: !26, size: 64, align: 64, offset: 448)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "b_objects", scope: !575, file: !387, line: 85, baseType: !20, size: 64, align: 64, offset: 512)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "b_value", scope: !575, file: !387, line: 86, baseType: !399, size: 128, align: 128, offset: 640)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "thunk", scope: !575, file: !387, line: 89, baseType: !587, size: 64, align: 64, offset: 768)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "CThunkObject", file: !387, line: 71, baseType: !589)
!589 = !DICompositeType(tag: DW_TAG_structure_type, file: !387, line: 59, size: 1024, align: 64, elements: !590)
!590 = !{!591, !592, !619, !620, !621, !622, !623, !624, !625, !626, !627}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !589, file: !387, line: 60, baseType: !38, size: 192, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pcl_write", scope: !589, file: !387, line: 61, baseType: !593, size: 64, align: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64, align: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "ffi_closure", file: !432, line: 310, baseType: !595)
!595 = !DICompositeType(tag: DW_TAG_structure_type, file: !432, line: 299, size: 384, align: 64, elements: !596)
!596 = !{!597, !601, !614, !618}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "tramp", scope: !595, file: !432, line: 304, baseType: !598, size: 192, align: 8)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 192, align: 8, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 24)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "cif", scope: !595, file: !432, line: 306, baseType: !602, size: 64, align: 64, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "ffi_cif", file: !432, line: 222, baseType: !604)
!604 = !DICompositeType(tag: DW_TAG_structure_type, file: !432, line: 212, size: 256, align: 64, elements: !605)
!605 = !{!606, !608, !609, !611, !612, !613}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "abi", scope: !604, file: !432, line: 213, baseType: !607, size: 32, align: 32)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "ffi_abi", file: !12, line: 108, baseType: !11)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !604, file: !432, line: 214, baseType: !364, size: 32, align: 32, offset: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !604, file: !432, line: 215, baseType: !610, size: 64, align: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rtype", scope: !604, file: !432, line: 216, baseType: !430, size: 64, align: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !604, file: !432, line: 217, baseType: !364, size: 32, align: 32, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !604, file: !432, line: 218, baseType: !364, size: 32, align: 32, offset: 224)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !595, file: !432, line: 307, baseType: !615, size: 64, align: 64, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64, align: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{null, !602, !105, !503, !105}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !595, file: !432, line: 308, baseType: !105, size: 64, align: 64, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pcl_exec", scope: !589, file: !387, line: 62, baseType: !105, size: 64, align: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "cif", scope: !589, file: !387, line: 63, baseType: !603, size: 256, align: 64, offset: 320)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !589, file: !387, line: 64, baseType: !59, size: 32, align: 32, offset: 576)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "converters", scope: !589, file: !387, line: 65, baseType: !20, size: 64, align: 64, offset: 640)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "callable", scope: !589, file: !387, line: 66, baseType: !20, size: 64, align: 64, offset: 704)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "restype", scope: !589, file: !387, line: 67, baseType: !20, size: 64, align: 64, offset: 768)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "setfunc", scope: !589, file: !387, line: 68, baseType: !481, size: 64, align: 64, offset: 832)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ffi_restype", scope: !589, file: !387, line: 69, baseType: !430, size: 64, align: 64, offset: 896)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "atypes", scope: !589, file: !387, line: 70, baseType: !628, size: 64, align: 64, offset: 960)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 64, align: 64, elements: !97)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "callable", scope: !575, file: !387, line: 90, baseType: !20, size: 64, align: 64, offset: 832)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "converters", scope: !575, file: !387, line: 94, baseType: !20, size: 64, align: 64, offset: 896)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "argtypes", scope: !575, file: !387, line: 95, baseType: !20, size: 64, align: 64, offset: 960)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "restype", scope: !575, file: !387, line: 96, baseType: !20, size: 64, align: 64, offset: 1024)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "checker", scope: !575, file: !387, line: 97, baseType: !20, size: 64, align: 64, offset: 1088)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "errcheck", scope: !575, file: !387, line: 98, baseType: !20, size: 64, align: 64, offset: 1152)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "paramflags", scope: !575, file: !387, line: 103, baseType: !20, size: 64, align: 64, offset: 1216)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !638, line: 33, baseType: !639)
!638 = !DIFile(filename: "./Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!639 = !DICompositeType(tag: DW_TAG_structure_type, file: !638, line: 25, size: 256, align: 64, elements: !640)
!640 = !{!641, !642}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !639, file: !638, line: 26, baseType: !38, size: 192, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !639, file: !638, line: 27, baseType: !643, size: 64, align: 64, offset: 192)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 64, align: 64, elements: !97)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "PPROC", file: !387, line: 270, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64, align: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!59}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !650, line: 40, baseType: !651)
!650 = !DIFile(filename: "./Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!651 = !DICompositeType(tag: DW_TAG_structure_type, file: !650, line: 23, size: 320, align: 64, elements: !652)
!652 = !{!653, !654, !655}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !651, file: !650, line: 24, baseType: !38, size: 192, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !651, file: !650, line: 26, baseType: !474, size: 64, align: 64, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !651, file: !650, line: 39, baseType: !26, size: 64, align: 64, offset: 256)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySliceObject", file: !659, line: 25, baseType: !660)
!659 = !DIFile(filename: "./Include/sliceobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!660 = !DICompositeType(tag: DW_TAG_structure_type, file: !659, line: 22, size: 320, align: 64, elements: !661)
!661 = !{!662, !663, !664, !665}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !660, file: !659, line: 23, baseType: !21, size: 128, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !660, file: !659, line: 24, baseType: !20, size: 64, align: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !660, file: !659, line: 24, baseType: !20, size: 64, align: 64, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !660, file: !659, line: 24, baseType: !20, size: 64, align: 64, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64, align: 64)
!667 = !{!668, !681, !687, !695, !713, !729, !735, !739, !750, !763, !796, !801, !815, !835, !839, !851, !864, !877, !893, !898, !908, !918, !933, !940, !978, !983, !991, !999, !1006, !1017, !1050, !1054, !1095, !1099, !1114, !1119, !1128, !1133, !1145, !1150, !1162, !1216, !1225, !1230, !1233, !1301, !1308, !1334, !1360, !1413, !1442, !1469, !1473, !1485, !1505, !1508, !1511, !1519, !1534, !1551, !1555, !1560, !1572, !1578, !1604, !1608, !1613, !1646, !1655, !1660, !1665, !1670, !1714, !1745, !1755, !1798, !1837, !1888, !1891, !1904, !1908, !1936, !1940, !1970, !1991, !2036, !2042, !2060, !2067, !2071, !2079, !2089, !2125, !2150, !2163, !2174, !2181, !2185, !2188, !2192, !2198, !2204, !2207, !2217, !2228, !2261, !2268, !2281, !2287, !2293, !2305, !2310, !2323, !2357, !2363, !2389, !2393}
!668 = !DISubprogram(name: "PyDict_SetItemProxy", scope: !368, file: !368, line: 213, type: !227, isLocal: false, isDefinition: true, scopeLine: 214, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, %struct._object*)* @PyDict_SetItemProxy, variables: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677, !679}
!670 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dict", arg: 1, scope: !668, file: !368, line: 213, type: !20)
!671 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !668, file: !368, line: 213, type: !20)
!672 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 3, scope: !668, file: !368, line: 213, type: !20)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !668, file: !368, line: 215, type: !20)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "remover", scope: !668, file: !368, line: 216, type: !366)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "proxy", scope: !668, file: !368, line: 217, type: !20)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !668, file: !368, line: 218, type: !59)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !678, file: !368, line: 233, type: !20)
!678 = distinct !DILexicalBlock(scope: !668, file: !368, line: 233, column: 8)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !680, file: !368, line: 238, type: !20)
!680 = distinct !DILexicalBlock(scope: !668, file: !368, line: 238, column: 8)
!681 = !DISubprogram(name: "PyDict_GetItemProxy", scope: !368, file: !368, line: 243, type: !142, isLocal: false, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyDict_GetItemProxy, variables: !682)
!682 = !{!683, !684, !685, !686}
!683 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dict", arg: 1, scope: !681, file: !368, line: 243, type: !20)
!684 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !681, file: !368, line: 243, type: !20)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !681, file: !368, line: 245, type: !20)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !681, file: !368, line: 246, type: !20)
!687 = !DISubprogram(name: "_ctypes_alloc_format_string", scope: !368, file: !368, line: 266, type: !688, isLocal: false, isDefinition: true, scopeLine: 267, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i8*)* @_ctypes_alloc_format_string, variables: !690)
!688 = !DISubroutineType(types: !689)
!689 = !{!67, !44, !44}
!690 = !{!691, !692, !693, !694}
!691 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prefix", arg: 1, scope: !687, file: !368, line: 266, type: !44)
!692 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "suffix", arg: 2, scope: !687, file: !368, line: 266, type: !44)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !687, file: !368, line: 268, type: !110)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !687, file: !368, line: 269, type: !67)
!695 = !DISubprogram(name: "_ctypes_alloc_format_string_with_shape", scope: !368, file: !368, line: 298, type: !696, isLocal: false, isDefinition: true, scopeLine: 300, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32, i64*, i8*, i8*)* @_ctypes_alloc_format_string_with_shape, variables: !700)
!696 = !DISubroutineType(types: !697)
!697 = !{!67, !59, !698, !44, !44}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!700 = !{!701, !702, !703, !704, !705, !706, !707, !711, !712}
!701 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndim", arg: 1, scope: !695, file: !368, line: 298, type: !59)
!702 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "shape", arg: 2, scope: !695, file: !368, line: 298, type: !698)
!703 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prefix", arg: 3, scope: !695, file: !368, line: 299, type: !44)
!704 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "suffix", arg: 4, scope: !695, file: !368, line: 299, type: !44)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_prefix", scope: !695, file: !368, line: 301, type: !67)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !695, file: !368, line: 302, type: !67)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !695, file: !368, line: 303, type: !708)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 256, align: 8, elements: !709)
!709 = !{!710}
!710 = !DISubrange(count: 32)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prefix_len", scope: !695, file: !368, line: 304, type: !59)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !695, file: !368, line: 305, type: !59)
!713 = !DISubprogram(name: "PyCData_FromBaseObj", scope: !368, file: !368, line: 2683, type: !714, isLocal: false, isDefinition: true, scopeLine: 2684, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i64, i8*)* @PyCData_FromBaseObj, variables: !716)
!714 = !DISubroutineType(types: !715)
!715 = !{!20, !20, !20, !26, !67}
!716 = !{!717, !718, !719, !720, !721, !722, !723}
!717 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !713, file: !368, line: 2683, type: !20)
!718 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 2, scope: !713, file: !368, line: 2683, type: !20)
!719 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !713, file: !368, line: 2683, type: !26)
!720 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "adr", arg: 4, scope: !713, file: !368, line: 2683, type: !67)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmem", scope: !713, file: !368, line: 2685, type: !385)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !713, file: !368, line: 2686, type: !458)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !724, file: !368, line: 2712, type: !20)
!724 = distinct !DILexicalBlock(scope: !725, file: !368, line: 2712, column: 16)
!725 = distinct !DILexicalBlock(scope: !726, file: !368, line: 2711, column: 53)
!726 = distinct !DILexicalBlock(scope: !727, file: !368, line: 2711, column: 13)
!727 = distinct !DILexicalBlock(scope: !728, file: !368, line: 2710, column: 12)
!728 = distinct !DILexicalBlock(scope: !713, file: !368, line: 2703, column: 9)
!729 = !DISubprogram(name: "PyCData_AtAddress", scope: !368, file: !368, line: 2725, type: !323, isLocal: false, isDefinition: true, scopeLine: 2726, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*)* @PyCData_AtAddress, variables: !730)
!730 = !{!731, !732, !733, !734}
!731 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !729, file: !368, line: 2725, type: !20)
!732 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 2, scope: !729, file: !368, line: 2725, type: !105)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pd", scope: !729, file: !368, line: 2727, type: !385)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !729, file: !368, line: 2728, type: !458)
!735 = !DISubprogram(name: "_ctypes_simple_instance", scope: !368, file: !368, line: 2754, type: !160, isLocal: false, isDefinition: true, scopeLine: 2755, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @_ctypes_simple_instance, variables: !736)
!736 = !{!737, !738}
!737 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !735, file: !368, line: 2754, type: !20)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !735, file: !368, line: 2756, type: !417)
!739 = !DISubprogram(name: "PyCData_get", scope: !368, file: !368, line: 2764, type: !740, isLocal: false, isDefinition: true, scopeLine: 2766, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object* (i8*, i64)*, %struct._object*, i64, i64, i8*)* @PyCData_get, variables: !742)
!740 = !DISubroutineType(types: !741)
!741 = !{!20, !20, !486, !20, !26, !26, !67}
!742 = !{!743, !744, !745, !746, !747, !748, !749}
!743 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !739, file: !368, line: 2764, type: !20)
!744 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "getfunc", arg: 2, scope: !739, file: !368, line: 2764, type: !486)
!745 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 3, scope: !739, file: !368, line: 2764, type: !20)
!746 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 4, scope: !739, file: !368, line: 2765, type: !26)
!747 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 5, scope: !739, file: !368, line: 2765, type: !26)
!748 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "adr", arg: 6, scope: !739, file: !368, line: 2765, type: !67)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !739, file: !368, line: 2767, type: !458)
!750 = !DISubprogram(name: "PyCData_set", scope: !368, file: !368, line: 2889, type: !751, isLocal: false, isDefinition: true, scopeLine: 2891, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, %struct._object* (i8*, %struct._object*, i64)*, %struct._object*, i64, i64, i8*)* @PyCData_set, variables: !753)
!751 = !DISubroutineType(types: !752)
!752 = !{!59, !20, !20, !481, !20, !26, !26, !67}
!753 = !{!754, !755, !756, !757, !758, !759, !760, !761, !762}
!754 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dst", arg: 1, scope: !750, file: !368, line: 2889, type: !20)
!755 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 2, scope: !750, file: !368, line: 2889, type: !20)
!756 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "setfunc", arg: 3, scope: !750, file: !368, line: 2889, type: !481)
!757 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 4, scope: !750, file: !368, line: 2889, type: !20)
!758 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 5, scope: !750, file: !368, line: 2890, type: !26)
!759 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 6, scope: !750, file: !368, line: 2890, type: !26)
!760 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 7, scope: !750, file: !368, line: 2890, type: !67)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mem", scope: !750, file: !368, line: 2892, type: !385)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !750, file: !368, line: 2893, type: !20)
!763 = !DISubprogram(name: "PyCArrayType_from_ctype", scope: !368, file: !368, line: 4513, type: !200, isLocal: false, isDefinition: true, scopeLine: 4514, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i64)* @PyCArrayType_from_ctype, variables: !764)
!764 = !{!765, !766, !767, !768, !769, !773, !774, !776, !780, !784, !788, !792, !794}
!765 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "itemtype", arg: 1, scope: !763, file: !368, line: 4513, type: !20)
!766 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 2, scope: !763, file: !368, line: 4513, type: !26)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !763, file: !368, line: 4516, type: !20)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !763, file: !368, line: 4517, type: !20)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !763, file: !368, line: 4518, type: !770)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 2048, align: 8, elements: !771)
!771 = !{!772}
!772 = !DISubrange(count: 256)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !763, file: !368, line: 4519, type: !20)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !775, file: !368, line: 4530, type: !20)
!775 = distinct !DILexicalBlock(scope: !763, file: !368, line: 4530, column: 8)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !777, file: !368, line: 4536, type: !20)
!777 = distinct !DILexicalBlock(scope: !778, file: !368, line: 4536, column: 12)
!778 = distinct !DILexicalBlock(scope: !779, file: !368, line: 4534, column: 17)
!779 = distinct !DILexicalBlock(scope: !763, file: !368, line: 4534, column: 9)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !781, file: !368, line: 4543, type: !20)
!781 = distinct !DILexicalBlock(scope: !782, file: !368, line: 4543, column: 12)
!782 = distinct !DILexicalBlock(scope: !783, file: !368, line: 4540, column: 83)
!783 = distinct !DILexicalBlock(scope: !763, file: !368, line: 4540, column: 9)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !785, file: !368, line: 4564, type: !20)
!785 = distinct !DILexicalBlock(scope: !786, file: !368, line: 4564, column: 12)
!786 = distinct !DILexicalBlock(scope: !787, file: !368, line: 4563, column: 31)
!787 = distinct !DILexicalBlock(scope: !763, file: !368, line: 4563, column: 9)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !789, file: !368, line: 4568, type: !20)
!789 = distinct !DILexicalBlock(scope: !790, file: !368, line: 4568, column: 12)
!790 = distinct !DILexicalBlock(scope: !791, file: !368, line: 4567, column: 56)
!791 = distinct !DILexicalBlock(scope: !763, file: !368, line: 4567, column: 9)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !793, file: !368, line: 4569, type: !20)
!793 = distinct !DILexicalBlock(scope: !790, file: !368, line: 4569, column: 12)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !795, file: !368, line: 4572, type: !20)
!795 = distinct !DILexicalBlock(scope: !763, file: !368, line: 4572, column: 8)
!796 = !DISubprogram(name: "PyInit__ctypes", scope: !368, file: !368, line: 5331, type: !797, isLocal: false, isDefinition: true, scopeLine: 5332, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__ctypes, variables: !799)
!797 = !DISubroutineType(types: !798)
!798 = !{!20}
!799 = !{!800}
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !796, file: !368, line: 5333, type: !20)
!801 = !DISubprogram(name: "_DictRemover_dealloc", scope: !368, file: !368, line: 146, type: !52, isLocal: true, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @_DictRemover_dealloc, variables: !802)
!802 = !{!803, !804, !805, !807, !810, !812}
!803 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "myself", arg: 1, scope: !801, file: !368, line: 146, type: !20)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !801, file: !368, line: 148, type: !366)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !806, file: !368, line: 149, type: !20)
!806 = distinct !DILexicalBlock(scope: !801, file: !368, line: 149, column: 8)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !808, file: !368, line: 149, type: !20)
!808 = distinct !DILexicalBlock(scope: !809, file: !368, line: 149, column: 101)
!809 = distinct !DILexicalBlock(scope: !806, file: !368, line: 149, column: 67)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !811, file: !368, line: 150, type: !20)
!811 = distinct !DILexicalBlock(scope: !801, file: !368, line: 150, column: 8)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !813, file: !368, line: 150, type: !20)
!813 = distinct !DILexicalBlock(scope: !814, file: !368, line: 150, column: 102)
!814 = distinct !DILexicalBlock(scope: !811, file: !368, line: 150, column: 68)
!815 = !DISubprogram(name: "_DictRemover_call", scope: !368, file: !368, line: 155, type: !151, isLocal: true, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @_DictRemover_call, variables: !816)
!816 = !{!817, !818, !819, !820, !821, !825, !829, !831}
!817 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "myself", arg: 1, scope: !815, file: !368, line: 155, type: !20)
!818 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !815, file: !368, line: 155, type: !20)
!819 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !815, file: !368, line: 155, type: !20)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !815, file: !368, line: 157, type: !366)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !822, file: !368, line: 162, type: !20)
!822 = distinct !DILexicalBlock(scope: !823, file: !368, line: 162, column: 12)
!823 = distinct !DILexicalBlock(scope: !824, file: !368, line: 158, column: 34)
!824 = distinct !DILexicalBlock(scope: !815, file: !368, line: 158, column: 9)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !826, file: !368, line: 162, type: !20)
!826 = distinct !DILexicalBlock(scope: !827, file: !368, line: 162, column: 117)
!827 = distinct !DILexicalBlock(scope: !828, file: !368, line: 162, column: 86)
!828 = distinct !DILexicalBlock(scope: !822, file: !368, line: 162, column: 63)
!829 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !830, file: !368, line: 163, type: !20)
!830 = distinct !DILexicalBlock(scope: !823, file: !368, line: 163, column: 12)
!831 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !832, file: !368, line: 163, type: !20)
!832 = distinct !DILexicalBlock(scope: !833, file: !368, line: 163, column: 119)
!833 = distinct !DILexicalBlock(scope: !834, file: !368, line: 163, column: 87)
!834 = distinct !DILexicalBlock(scope: !830, file: !368, line: 163, column: 64)
!835 = !DISubprogram(name: "CDataType_repeat", scope: !368, file: !368, line: 664, type: !200, isLocal: true, isDefinition: true, scopeLine: 665, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i64)* @CDataType_repeat, variables: !836)
!836 = !{!837, !838}
!837 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !835, file: !368, line: 664, type: !20)
!838 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 2, scope: !835, file: !368, line: 664, type: !26)
!839 = !DISubprogram(name: "PyCStructType_setattro", scope: !368, file: !368, line: 706, type: !227, isLocal: true, isDefinition: true, scopeLine: 707, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, %struct._object*)* @PyCStructType_setattro, variables: !840)
!840 = !{!841, !842, !843, !844, !847, !848, !850}
!841 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !839, file: !368, line: 706, type: !20)
!842 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !839, file: !368, line: 706, type: !20)
!843 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !839, file: !368, line: 706, type: !20)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !845, file: !368, line: 714, type: !110)
!845 = distinct !DILexicalBlock(scope: !846, file: !368, line: 714, column: 29)
!846 = distinct !DILexicalBlock(scope: !839, file: !368, line: 712, column: 9)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !845, file: !368, line: 714, type: !110)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !849, file: !368, line: 714, type: !421)
!849 = distinct !DILexicalBlock(scope: !845, file: !368, line: 714, column: 1926)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !849, file: !368, line: 714, type: !59)
!851 = !DISubprogram(name: "CDataType_traverse", scope: !368, file: !368, line: 697, type: !852, isLocal: true, isDefinition: true, scopeLine: 698, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._typeobject*, i32 (%struct._object*, i8*)*, i8*)* @CDataType_traverse, variables: !854)
!852 = !DISubroutineType(types: !853)
!853 = !{!59, !417, !279, !105}
!854 = !{!855, !856, !857, !858, !859}
!855 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !851, file: !368, line: 697, type: !417)
!856 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !851, file: !368, line: 697, type: !279)
!857 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !851, file: !368, line: 697, type: !105)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !851, file: !368, line: 699, type: !458)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !860, file: !368, line: 701, type: !59)
!860 = distinct !DILexicalBlock(scope: !861, file: !368, line: 701, column: 31)
!861 = distinct !DILexicalBlock(scope: !862, file: !368, line: 701, column: 18)
!862 = distinct !DILexicalBlock(scope: !863, file: !368, line: 701, column: 12)
!863 = distinct !DILexicalBlock(scope: !851, file: !368, line: 700, column: 9)
!864 = !DISubprogram(name: "CDataType_clear", scope: !368, file: !368, line: 688, type: !865, isLocal: true, isDefinition: true, scopeLine: 689, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._typeobject*)* @CDataType_clear, variables: !867)
!865 = !DISubroutineType(types: !866)
!866 = !{!59, !417}
!867 = !{!868, !869, !870, !873}
!868 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !864, file: !368, line: 688, type: !417)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !864, file: !368, line: 690, type: !458)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !871, file: !368, line: 692, type: !20)
!871 = distinct !DILexicalBlock(scope: !872, file: !368, line: 692, column: 12)
!872 = distinct !DILexicalBlock(scope: !864, file: !368, line: 691, column: 9)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !874, file: !368, line: 692, type: !20)
!874 = distinct !DILexicalBlock(scope: !875, file: !368, line: 692, column: 121)
!875 = distinct !DILexicalBlock(scope: !876, file: !368, line: 692, column: 88)
!876 = distinct !DILexicalBlock(scope: !871, file: !368, line: 692, column: 65)
!877 = !DISubprogram(name: "CDataType_from_param", scope: !368, file: !368, line: 606, type: !142, isLocal: true, isDefinition: true, scopeLine: 607, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @CDataType_from_param, variables: !878)
!878 = !{!879, !880, !881, !882, !883, !886, !887, !888, !889}
!879 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !877, file: !368, line: 606, type: !20)
!880 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !877, file: !368, line: 606, type: !20)
!881 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "as_parameter", scope: !877, file: !368, line: 608, type: !20)
