; ModuleID = 'irs-onlybc/_ctypes_test.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SPAM = type { i8*, i8* }
%struct.EGG = type { i8*, i32, %struct.SPAM* }
%struct.xxx_library = type { void (i8* (i32)*, void (i8*)*)* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !350, globals: !941)
!1 = !DIFile(filename: "_ctypes_test.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !6, !7, !8, !10, !11, !14, !15, !349}
!4 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!7 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !13, line: 90, baseType: !5)
!13 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!14 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !17, line: 109, baseType: !18)
!17 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !17, line: 105, size: 128, align: 64, elements: !19)
!19 = !{!20, !28}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !18, file: !17, line: 107, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !22, line: 177, baseType: !23)
!22 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !24, line: 102, baseType: !25)
!24 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !26, line: 181, baseType: !27)
!26 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!27 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !18, file: !17, line: 108, baseType: !29, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !17, line: 334, size: 3200, align: 64, elements: !31)
!31 = !{!32, !38, !41, !42, !43, !48, !108, !113, !118, !119, !124, !176, !207, !219, !225, !226, !227, !229, !231, !262, !263, !264, !273, !274, !279, !280, !282, !284, !294, !297, !315, !316, !317, !319, !321, !322, !324, !329, !334, !339, !340, !341, !342, !343, !344, !345, !346, !348}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !30, file: !17, line: 335, baseType: !33, size: 192, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !17, line: 114, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 111, size: 192, align: 64, elements: !35)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !34, file: !17, line: 112, baseType: !16, size: 128, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !34, file: !17, line: 113, baseType: !21, size: 64, align: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !30, file: !17, line: 336, baseType: !39, size: 64, align: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !30, file: !17, line: 337, baseType: !21, size: 64, align: 64, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !30, file: !17, line: 337, baseType: !21, size: 64, align: 64, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !30, file: !17, line: 341, baseType: !44, size: 64, align: 64, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !17, line: 308, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !15}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !30, file: !17, line: 342, baseType: !49, size: 64, align: 64, offset: 448)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !17, line: 314, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!5, !15, !53, !5}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !24, line: 48, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !56, line: 246, size: 1728, align: 64, elements: !57)
!56 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !78, !79, !80, !81, !83, !85, !87, !91, !94, !96, !97, !98, !99, !100, !103, !104}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !55, file: !56, line: 247, baseType: !5, size: 32, align: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !55, file: !56, line: 252, baseType: !8, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !55, file: !56, line: 253, baseType: !8, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !55, file: !56, line: 254, baseType: !8, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !55, file: !56, line: 255, baseType: !8, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !55, file: !56, line: 256, baseType: !8, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !55, file: !56, line: 257, baseType: !8, size: 64, align: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !55, file: !56, line: 258, baseType: !8, size: 64, align: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !55, file: !56, line: 259, baseType: !8, size: 64, align: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !55, file: !56, line: 261, baseType: !8, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !55, file: !56, line: 262, baseType: !8, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !55, file: !56, line: 263, baseType: !8, size: 64, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !55, file: !56, line: 265, baseType: !71, size: 64, align: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !56, line: 161, size: 192, align: 64, elements: !73)
!73 = !{!74, !75, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !72, file: !56, line: 162, baseType: !71, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !72, file: !56, line: 163, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !72, file: !56, line: 167, baseType: !5, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !55, file: !56, line: 267, baseType: !76, size: 64, align: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !55, file: !56, line: 269, baseType: !5, size: 32, align: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !55, file: !56, line: 273, baseType: !5, size: 32, align: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !55, file: !56, line: 275, baseType: !82, size: 64, align: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !26, line: 140, baseType: !27)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !55, file: !56, line: 279, baseType: !84, size: 16, align: 16, offset: 1024)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !55, file: !56, line: 280, baseType: !86, size: 8, align: 8, offset: 1040)
!86 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !55, file: !56, line: 281, baseType: !88, size: 8, align: 8, offset: 1048)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !55, file: !56, line: 285, baseType: !92, size: 64, align: 64, offset: 1088)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !56, line: 155, baseType: null)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !55, file: !56, line: 294, baseType: !95, size: 64, align: 64, offset: 1152)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !26, line: 141, baseType: !27)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !55, file: !56, line: 303, baseType: !10, size: 64, align: 64, offset: 1216)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !55, file: !56, line: 304, baseType: !10, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !55, file: !56, line: 305, baseType: !10, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !55, file: !56, line: 306, baseType: !10, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !55, file: !56, line: 307, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !13, line: 62, baseType: !102)
!102 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !55, file: !56, line: 309, baseType: !5, size: 32, align: 32, offset: 1536)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !55, file: !56, line: 311, baseType: !105, size: 160, align: 8, offset: 1568)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, align: 8, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 20)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !30, file: !17, line: 343, baseType: !109, size: 64, align: 64, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !17, line: 316, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!15, !15, !8}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !30, file: !17, line: 344, baseType: !114, size: 64, align: 64, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !17, line: 318, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!5, !15, !8, !15}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !30, file: !17, line: 345, baseType: !10, size: 64, align: 64, offset: 640)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !30, file: !17, line: 346, baseType: !120, size: 64, align: 64, offset: 704)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !17, line: 320, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!15, !15}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !30, file: !17, line: 350, baseType: !125, size: 64, align: 64, offset: 768)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !17, line: 278, baseType: !127)
!127 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 236, size: 2176, align: 64, elements: !128)
!128 = !{!129, !134, !135, !136, !137, !138, !143, !145, !146, !147, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !127, file: !17, line: 241, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !17, line: 166, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!15, !15, !15}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !127, file: !17, line: 242, baseType: !130, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !127, file: !17, line: 243, baseType: !130, size: 64, align: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !127, file: !17, line: 244, baseType: !130, size: 64, align: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !127, file: !17, line: 245, baseType: !130, size: 64, align: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !127, file: !17, line: 246, baseType: !139, size: 64, align: 64, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !17, line: 167, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!15, !15, !15, !15}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !127, file: !17, line: 247, baseType: !144, size: 64, align: 64, offset: 384)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !17, line: 165, baseType: !121)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !127, file: !17, line: 248, baseType: !144, size: 64, align: 64, offset: 448)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !127, file: !17, line: 249, baseType: !144, size: 64, align: 64, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !127, file: !17, line: 250, baseType: !148, size: 64, align: 64, offset: 576)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !17, line: 168, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!5, !15}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !127, file: !17, line: 251, baseType: !144, size: 64, align: 64, offset: 640)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !127, file: !17, line: 252, baseType: !130, size: 64, align: 64, offset: 704)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !127, file: !17, line: 253, baseType: !130, size: 64, align: 64, offset: 768)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !127, file: !17, line: 254, baseType: !130, size: 64, align: 64, offset: 832)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !127, file: !17, line: 255, baseType: !130, size: 64, align: 64, offset: 896)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !127, file: !17, line: 256, baseType: !130, size: 64, align: 64, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !127, file: !17, line: 257, baseType: !144, size: 64, align: 64, offset: 1024)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !127, file: !17, line: 258, baseType: !10, size: 64, align: 64, offset: 1088)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !127, file: !17, line: 259, baseType: !144, size: 64, align: 64, offset: 1152)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !127, file: !17, line: 261, baseType: !130, size: 64, align: 64, offset: 1216)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !127, file: !17, line: 262, baseType: !130, size: 64, align: 64, offset: 1280)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !127, file: !17, line: 263, baseType: !130, size: 64, align: 64, offset: 1344)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !127, file: !17, line: 264, baseType: !130, size: 64, align: 64, offset: 1408)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !127, file: !17, line: 265, baseType: !139, size: 64, align: 64, offset: 1472)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !127, file: !17, line: 266, baseType: !130, size: 64, align: 64, offset: 1536)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !127, file: !17, line: 267, baseType: !130, size: 64, align: 64, offset: 1600)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !127, file: !17, line: 268, baseType: !130, size: 64, align: 64, offset: 1664)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !127, file: !17, line: 269, baseType: !130, size: 64, align: 64, offset: 1728)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !127, file: !17, line: 270, baseType: !130, size: 64, align: 64, offset: 1792)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !127, file: !17, line: 272, baseType: !130, size: 64, align: 64, offset: 1856)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !127, file: !17, line: 273, baseType: !130, size: 64, align: 64, offset: 1920)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !127, file: !17, line: 274, baseType: !130, size: 64, align: 64, offset: 1984)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !127, file: !17, line: 275, baseType: !130, size: 64, align: 64, offset: 2048)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !127, file: !17, line: 277, baseType: !144, size: 64, align: 64, offset: 2112)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !30, file: !17, line: 351, baseType: !177, size: 64, align: 64, offset: 832)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !17, line: 292, baseType: !179)
!179 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 280, size: 640, align: 64, elements: !180)
!180 = !{!181, !186, !187, !192, !193, !194, !199, !200, !205, !206}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !179, file: !17, line: 281, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !17, line: 169, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!21, !15}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !179, file: !17, line: 282, baseType: !130, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !179, file: !17, line: 283, baseType: !188, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !17, line: 170, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!15, !15, !21}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !179, file: !17, line: 284, baseType: !188, size: 64, align: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !179, file: !17, line: 285, baseType: !10, size: 64, align: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !179, file: !17, line: 286, baseType: !195, size: 64, align: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !17, line: 172, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!5, !15, !21, !15}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !179, file: !17, line: 287, baseType: !10, size: 64, align: 64, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !179, file: !17, line: 288, baseType: !201, size: 64, align: 64, offset: 448)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !17, line: 231, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!5, !15, !15}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !179, file: !17, line: 290, baseType: !130, size: 64, align: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !179, file: !17, line: 291, baseType: !188, size: 64, align: 64, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !30, file: !17, line: 352, baseType: !208, size: 64, align: 64, offset: 896)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !17, line: 298, baseType: !210)
!210 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 294, size: 192, align: 64, elements: !211)
!211 = !{!212, !213, !214}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !210, file: !17, line: 295, baseType: !182, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !210, file: !17, line: 296, baseType: !130, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !210, file: !17, line: 297, baseType: !215, size: 64, align: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !17, line: 174, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!5, !15, !15, !15}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !30, file: !17, line: 356, baseType: !220, size: 64, align: 64, offset: 960)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !17, line: 321, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!224, !15}
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !22, line: 186, baseType: !21)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !30, file: !17, line: 357, baseType: !139, size: 64, align: 64, offset: 1024)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !30, file: !17, line: 358, baseType: !120, size: 64, align: 64, offset: 1088)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !30, file: !17, line: 359, baseType: !228, size: 64, align: 64, offset: 1152)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !17, line: 317, baseType: !131)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !30, file: !17, line: 360, baseType: !230, size: 64, align: 64, offset: 1216)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !17, line: 319, baseType: !216)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !30, file: !17, line: 363, baseType: !232, size: 64, align: 64, offset: 1280)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !17, line: 304, baseType: !234)
!234 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 301, size: 128, align: 64, elements: !235)
!235 = !{!236, !257}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !234, file: !17, line: 302, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !17, line: 193, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!5, !15, !241, !5}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !17, line: 191, baseType: !243)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !17, line: 178, size: 640, align: 64, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !254, !255, !256}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !243, file: !17, line: 179, baseType: !10, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !243, file: !17, line: 180, baseType: !15, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !243, file: !17, line: 181, baseType: !21, size: 64, align: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !243, file: !17, line: 182, baseType: !21, size: 64, align: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !243, file: !17, line: 184, baseType: !5, size: 32, align: 32, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !243, file: !17, line: 185, baseType: !5, size: 32, align: 32, offset: 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !243, file: !17, line: 186, baseType: !8, size: 64, align: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !243, file: !17, line: 187, baseType: !253, size: 64, align: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !243, file: !17, line: 188, baseType: !253, size: 64, align: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !243, file: !17, line: 189, baseType: !253, size: 64, align: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !243, file: !17, line: 190, baseType: !10, size: 64, align: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !234, file: !17, line: 303, baseType: !258, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !17, line: 194, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !15, !241}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !30, file: !17, line: 366, baseType: !102, size: 64, align: 64, offset: 1344)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !30, file: !17, line: 368, baseType: !39, size: 64, align: 64, offset: 1408)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !30, file: !17, line: 372, baseType: !265, size: 64, align: 64, offset: 1472)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !17, line: 233, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!5, !15, !269, !10}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !17, line: 232, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!5, !15, !10}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !30, file: !17, line: 375, baseType: !148, size: 64, align: 64, offset: 1536)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !30, file: !17, line: 379, baseType: !275, size: 64, align: 64, offset: 1600)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !17, line: 322, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!15, !15, !15, !5}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !30, file: !17, line: 382, baseType: !21, size: 64, align: 64, offset: 1664)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !30, file: !17, line: 385, baseType: !281, size: 64, align: 64, offset: 1728)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !17, line: 323, baseType: !121)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !30, file: !17, line: 386, baseType: !283, size: 64, align: 64, offset: 1792)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !17, line: 324, baseType: !121)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !30, file: !17, line: 389, baseType: !285, size: 64, align: 64, offset: 1856)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !287, line: 40, size: 256, align: 64, elements: !288)
!287 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!288 = !{!289, !290, !292, !293}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !286, file: !287, line: 41, baseType: !39, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !286, file: !287, line: 42, baseType: !291, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !287, line: 18, baseType: !131)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !286, file: !287, line: 43, baseType: !5, size: 32, align: 32, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !286, file: !287, line: 45, baseType: !39, size: 64, align: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !30, file: !17, line: 390, baseType: !295, size: 64, align: 64, offset: 1920)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !17, line: 390, flags: DIFlagFwdDecl)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !30, file: !17, line: 391, baseType: !298, size: 64, align: 64, offset: 1984)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !300, line: 11, size: 320, align: 64, elements: !301)
!300 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!301 = !{!302, !303, !308, !313, !314}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !299, file: !300, line: 12, baseType: !8, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !299, file: !300, line: 13, baseType: !304, size: 64, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !300, line: 8, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!15, !15, !10}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !299, file: !300, line: 14, baseType: !309, size: 64, align: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !300, line: 9, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!5, !15, !15, !10}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !299, file: !300, line: 15, baseType: !8, size: 64, align: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !299, file: !300, line: 16, baseType: !10, size: 64, align: 64, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !30, file: !17, line: 392, baseType: !29, size: 64, align: 64, offset: 2048)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !30, file: !17, line: 393, baseType: !15, size: 64, align: 64, offset: 2112)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !30, file: !17, line: 394, baseType: !318, size: 64, align: 64, offset: 2176)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !17, line: 325, baseType: !140)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !30, file: !17, line: 395, baseType: !320, size: 64, align: 64, offset: 2240)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !17, line: 326, baseType: !216)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !30, file: !17, line: 396, baseType: !21, size: 64, align: 64, offset: 2304)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !30, file: !17, line: 397, baseType: !323, size: 64, align: 64, offset: 2368)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !17, line: 327, baseType: !216)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !30, file: !17, line: 398, baseType: !325, size: 64, align: 64, offset: 2432)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !17, line: 329, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!15, !29, !21}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !30, file: !17, line: 399, baseType: !330, size: 64, align: 64, offset: 2496)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !17, line: 328, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!15, !29, !15, !15}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !30, file: !17, line: 400, baseType: !335, size: 64, align: 64, offset: 2560)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !17, line: 307, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !10}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !30, file: !17, line: 401, baseType: !148, size: 64, align: 64, offset: 2624)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !30, file: !17, line: 402, baseType: !15, size: 64, align: 64, offset: 2688)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !30, file: !17, line: 403, baseType: !15, size: 64, align: 64, offset: 2752)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !30, file: !17, line: 404, baseType: !15, size: 64, align: 64, offset: 2816)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !30, file: !17, line: 405, baseType: !15, size: 64, align: 64, offset: 2880)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !30, file: !17, line: 406, baseType: !15, size: 64, align: 64, offset: 2944)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !30, file: !17, line: 407, baseType: !44, size: 64, align: 64, offset: 3008)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !30, file: !17, line: 410, baseType: !347, size: 32, align: 32, offset: 3072)
!347 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !30, file: !17, line: 412, baseType: !44, size: 64, align: 64, offset: 3136)
!349 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!350 = !{!351, !365, !378, !384, !391, !398, !405, !424, !430, !436, !441, !454, !459, !466, !477, !487, !497, !507, !512, !519, !522, !528, !531, !538, !543, !555, !560, !570, !581, !591, !601, !611, !630, !642, !645, !657, !671, !677, !683, !687, !690, !716, !722, !727, !733, !738, !743, !746, !751, !756, !761, !764, !769, !774, !777, !782, !788, !794, !800, !806, !812, !818, !824, !830, !836, !842, !848, !854, !860, !865, !884, !894, !910, !916, !924, !927, !936}
!351 = !DISubprogram(name: "_testfunc_cbk_reg_int", scope: !352, file: !352, line: 16, type: !353, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32, i32, i32, i32 (i32, i32, i32, i32, i32)*)* @_testfunc_cbk_reg_int, variables: !358)
!352 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_ctypes/_ctypes_test.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!353 = !DISubroutineType(types: !354)
!354 = !{!5, !5, !5, !5, !5, !5, !355}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!5, !5, !5, !5, !5, !5}
!358 = !{!359, !360, !361, !362, !363, !364}
!359 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !351, file: !352, line: 16, type: !5)
!360 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !351, file: !352, line: 16, type: !5)
!361 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 3, scope: !351, file: !352, line: 16, type: !5)
!362 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 4, scope: !351, file: !352, line: 16, type: !5)
!363 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "e", arg: 5, scope: !351, file: !352, line: 16, type: !5)
!364 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 6, scope: !351, file: !352, line: 17, type: !355)
!365 = !DISubprogram(name: "_testfunc_cbk_reg_double", scope: !352, file: !352, line: 23, type: !366, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: true, function: double (double, double, double, double, double, double (double, double, double, double, double)*)* @_testfunc_cbk_reg_double, variables: !371)
!366 = !DISubroutineType(types: !367)
!367 = !{!7, !7, !7, !7, !7, !7, !368}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!7, !7, !7, !7, !7, !7}
!371 = !{!372, !373, !374, !375, !376, !377}
!372 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !365, file: !352, line: 23, type: !7)
!373 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !365, file: !352, line: 23, type: !7)
!374 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 3, scope: !365, file: !352, line: 23, type: !7)
!375 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 4, scope: !365, file: !352, line: 23, type: !7)
!376 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "e", arg: 5, scope: !365, file: !352, line: 23, type: !7)
!377 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 6, scope: !365, file: !352, line: 24, type: !368)
!378 = !DISubprogram(name: "testfunc_array", scope: !352, file: !352, line: 29, type: !379, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*)* @testfunc_array, variables: !382)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!382 = !{!383}
!383 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "values", arg: 1, scope: !378, file: !352, line: 29, type: !381)
!384 = !DISubprogram(name: "testfunc_Ddd", scope: !352, file: !352, line: 38, type: !385, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: true, function: x86_fp80 (double, double)* @testfunc_Ddd, variables: !387)
!385 = !DISubroutineType(types: !386)
!386 = !{!4, !7, !7}
!387 = !{!388, !389, !390}
!388 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !384, file: !352, line: 38, type: !7)
!389 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !384, file: !352, line: 38, type: !7)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !384, file: !352, line: 40, type: !4)
!391 = !DISubprogram(name: "testfunc_DDD", scope: !352, file: !352, line: 46, type: !392, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: true, function: x86_fp80 (x86_fp80, x86_fp80)* @testfunc_DDD, variables: !394)
!392 = !DISubroutineType(types: !393)
!393 = !{!4, !4, !4}
!394 = !{!395, !396, !397}
!395 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !391, file: !352, line: 46, type: !4)
!396 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !391, file: !352, line: 46, type: !4)
!397 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !391, file: !352, line: 48, type: !4)
!398 = !DISubprogram(name: "testfunc_iii", scope: !352, file: !352, line: 54, type: !399, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32)* @testfunc_iii, variables: !401)
!399 = !DISubroutineType(types: !400)
!400 = !{!5, !5, !5}
!401 = !{!402, !403, !404}
!402 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !398, file: !352, line: 54, type: !5)
!403 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !398, file: !352, line: 54, type: !5)
!404 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !398, file: !352, line: 56, type: !5)
!405 = !DISubprogram(name: "myprintf", scope: !352, file: !352, line: 61, type: !406, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, ...)* @myprintf, variables: !408)
!406 = !DISubroutineType(types: !407)
!407 = !{!5, !8, null}
!408 = !{!409, !410, !411}
!409 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt", arg: 1, scope: !405, file: !352, line: 61, type: !8)
!410 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !405, file: !352, line: 63, type: !5)
!411 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "argptr", scope: !405, file: !352, line: 64, type: !412)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !24, line: 79, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !414, line: 50, baseType: !415)
!414 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stdarg.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 64, baseType: !416)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 192, align: 64, elements: !89)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "__va_list_tag", file: !1, line: 64, baseType: !418)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 64, size: 192, align: 64, elements: !419)
!419 = !{!420, !421, !422, !423}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !418, file: !1, line: 64, baseType: !347, size: 32, align: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !418, file: !1, line: 64, baseType: !347, size: 32, align: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !418, file: !1, line: 64, baseType: !10, size: 64, align: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !418, file: !1, line: 64, baseType: !10, size: 64, align: 64, offset: 128)
!424 = !DISubprogram(name: "my_strtok", scope: !352, file: !352, line: 71, type: !425, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i8*)* @my_strtok, variables: !427)
!425 = !DISubroutineType(types: !426)
!426 = !{!8, !8, !39}
!427 = !{!428, !429}
!428 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "token", arg: 1, scope: !424, file: !352, line: 71, type: !8)
!429 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "delim", arg: 2, scope: !424, file: !352, line: 71, type: !39)
!430 = !DISubprogram(name: "my_strchr", scope: !352, file: !352, line: 76, type: !431, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i32)* @my_strchr, variables: !433)
!431 = !DISubroutineType(types: !432)
!432 = !{!8, !39, !5}
!433 = !{!434, !435}
!434 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !430, file: !352, line: 76, type: !39)
!435 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 2, scope: !430, file: !352, line: 76, type: !5)
!436 = !DISubprogram(name: "my_sqrt", scope: !352, file: !352, line: 82, type: !437, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: true, function: double (double)* @my_sqrt, variables: !439)
!437 = !DISubroutineType(types: !438)
!438 = !{!7, !7}
!439 = !{!440}
!440 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !436, file: !352, line: 82, type: !7)
!441 = !DISubprogram(name: "my_qsort", scope: !352, file: !352, line: 87, type: !442, isLocal: false, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i64, i64, i32 (i8*, i8*)*)* @my_qsort, variables: !449)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !10, !101, !101, !444}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!5, !447, !447}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!449 = !{!450, !451, !452, !453}
!450 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 1, scope: !441, file: !352, line: 87, type: !10)
!451 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "num", arg: 2, scope: !441, file: !352, line: 87, type: !101)
!452 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "width", arg: 3, scope: !441, file: !352, line: 87, type: !101)
!453 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "compare", arg: 4, scope: !441, file: !352, line: 87, type: !444)
!454 = !DISubprogram(name: "_testfunc_ai8", scope: !352, file: !352, line: 92, type: !455, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, function: i32* (i32*)* @_testfunc_ai8, variables: !457)
!455 = !DISubroutineType(types: !456)
!456 = !{!381, !381}
!457 = !{!458}
!458 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !454, file: !352, line: 92, type: !381)
!459 = !DISubprogram(name: "_testfunc_v", scope: !352, file: !352, line: 97, type: !460, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, i32*)* @_testfunc_v, variables: !462)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !5, !5, !381}
!462 = !{!463, !464, !465}
!463 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !459, file: !352, line: 97, type: !5)
!464 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !459, file: !352, line: 97, type: !5)
!465 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "presult", arg: 3, scope: !459, file: !352, line: 97, type: !381)
!466 = !DISubprogram(name: "_testfunc_i_bhilfd", scope: !352, file: !352, line: 102, type: !467, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8, i16, i32, i64, float, double)* @_testfunc_i_bhilfd, variables: !470)
!467 = !DISubroutineType(types: !468)
!468 = !{!5, !86, !469, !5, !27, !6, !7}
!469 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!470 = !{!471, !472, !473, !474, !475, !476}
!471 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 1, scope: !466, file: !352, line: 102, type: !86)
!472 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 2, scope: !466, file: !352, line: 102, type: !469)
!473 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 3, scope: !466, file: !352, line: 102, type: !5)
!474 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "l", arg: 4, scope: !466, file: !352, line: 102, type: !27)
!475 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 5, scope: !466, file: !352, line: 102, type: !6)
!476 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 6, scope: !466, file: !352, line: 102, type: !7)
!477 = !DISubprogram(name: "_testfunc_f_bhilfd", scope: !352, file: !352, line: 110, type: !478, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: true, function: float (i8, i16, i32, i64, float, double)* @_testfunc_f_bhilfd, variables: !480)
!478 = !DISubroutineType(types: !479)
!479 = !{!6, !86, !469, !5, !27, !6, !7}
!480 = !{!481, !482, !483, !484, !485, !486}
!481 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 1, scope: !477, file: !352, line: 110, type: !86)
!482 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 2, scope: !477, file: !352, line: 110, type: !469)
!483 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 3, scope: !477, file: !352, line: 110, type: !5)
!484 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "l", arg: 4, scope: !477, file: !352, line: 110, type: !27)
!485 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 5, scope: !477, file: !352, line: 110, type: !6)
!486 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 6, scope: !477, file: !352, line: 110, type: !7)
!487 = !DISubprogram(name: "_testfunc_d_bhilfd", scope: !352, file: !352, line: 118, type: !488, isLocal: false, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: true, function: double (i8, i16, i32, i64, float, double)* @_testfunc_d_bhilfd, variables: !490)
!488 = !DISubroutineType(types: !489)
!489 = !{!7, !86, !469, !5, !27, !6, !7}
!490 = !{!491, !492, !493, !494, !495, !496}
!491 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 1, scope: !487, file: !352, line: 118, type: !86)
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 2, scope: !487, file: !352, line: 118, type: !469)
!493 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 3, scope: !487, file: !352, line: 118, type: !5)
!494 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "l", arg: 4, scope: !487, file: !352, line: 118, type: !27)
!495 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 5, scope: !487, file: !352, line: 118, type: !6)
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 6, scope: !487, file: !352, line: 118, type: !7)
!497 = !DISubprogram(name: "_testfunc_D_bhilfD", scope: !352, file: !352, line: 126, type: !498, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, function: x86_fp80 (i8, i16, i32, i64, float, x86_fp80)* @_testfunc_D_bhilfD, variables: !500)
!498 = !DISubroutineType(types: !499)
!499 = !{!4, !86, !469, !5, !27, !6, !4}
!500 = !{!501, !502, !503, !504, !505, !506}
!501 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 1, scope: !497, file: !352, line: 126, type: !86)
!502 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 2, scope: !497, file: !352, line: 126, type: !469)
!503 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 3, scope: !497, file: !352, line: 126, type: !5)
!504 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "l", arg: 4, scope: !497, file: !352, line: 126, type: !27)
!505 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 5, scope: !497, file: !352, line: 126, type: !6)
!506 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 6, scope: !497, file: !352, line: 126, type: !4)
!507 = !DISubprogram(name: "_testfunc_p_p", scope: !352, file: !352, line: 134, type: !508, isLocal: false, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*)* @_testfunc_p_p, variables: !510)
!508 = !DISubroutineType(types: !509)
!509 = !{!8, !10}
!510 = !{!511}
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !507, file: !352, line: 134, type: !10)
!512 = !DISubprogram(name: "_testfunc_c_p_p", scope: !352, file: !352, line: 139, type: !513, isLocal: false, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32*, i8**)* @_testfunc_c_p_p, variables: !516)
!513 = !DISubroutineType(types: !514)
!514 = !{!10, !381, !515}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!516 = !{!517, !518}
!517 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argcp", arg: 1, scope: !512, file: !352, line: 139, type: !381)
!518 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !512, file: !352, line: 139, type: !515)
!519 = !DISubprogram(name: "get_strchr", scope: !352, file: !352, line: 144, type: !520, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: true, function: i8* ()* @get_strchr, variables: !2)
!520 = !DISubroutineType(types: !521)
!521 = !{!10}
!522 = !DISubprogram(name: "my_strdup", scope: !352, file: !352, line: 149, type: !523, isLocal: false, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*)* @my_strdup, variables: !525)
!523 = !DISubroutineType(types: !524)
!524 = !{!8, !8}
!525 = !{!526, !527}
!526 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 1, scope: !522, file: !352, line: 149, type: !8)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dst", scope: !522, file: !352, line: 151, type: !8)
!528 = !DISubprogram(name: "my_free", scope: !352, file: !352, line: 158, type: !337, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @my_free, variables: !529)
!529 = !{!530}
!530 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !528, file: !352, line: 158, type: !10)
!531 = !DISubprogram(name: "my_wcsdup", scope: !352, file: !352, line: 164, type: !532, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, function: i32* (i32*)* @my_wcsdup, variables: !534)
!532 = !DISubroutineType(types: !533)
!533 = !{!11, !11}
!534 = !{!535, !536, !537}
!535 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 1, scope: !531, file: !352, line: 164, type: !11)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !531, file: !352, line: 166, type: !101)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !531, file: !352, line: 167, type: !11)
!538 = !DISubprogram(name: "my_wcslen", scope: !352, file: !352, line: 174, type: !539, isLocal: false, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i32*)* @my_wcslen, variables: !541)
!539 = !DISubroutineType(types: !540)
!540 = !{!101, !11}
!541 = !{!542}
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 1, scope: !538, file: !352, line: 174, type: !11)
!543 = !DISubprogram(name: "_testfunc_callfuncp", scope: !352, file: !352, line: 191, type: !544, isLocal: false, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.FUNCS*)* @_testfunc_callfuncp, variables: !553)
!544 = !DISubroutineType(types: !545)
!545 = !{!5, !546}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "FUNCS", file: !352, line: 189, baseType: !548)
!548 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 186, size: 128, align: 64, elements: !549)
!549 = !{!550, !552}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !548, file: !352, line: 187, baseType: !551, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !548, file: !352, line: 188, baseType: !551, size: 64, align: 64, offset: 64)
!553 = !{!554}
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !543, file: !352, line: 191, type: !546)
!555 = !DISubprogram(name: "_testfunc_deref_pointer", scope: !352, file: !352, line: 198, type: !556, isLocal: false, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32*)* @_testfunc_deref_pointer, variables: !558)
!556 = !DISubroutineType(types: !557)
!557 = !{!5, !381}
!558 = !{!559}
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pi", arg: 1, scope: !555, file: !352, line: 198, type: !381)
!560 = !DISubprogram(name: "_testfunc_callback_with_pointer", scope: !352, file: !352, line: 211, type: !561, isLocal: false, isDefinition: true, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32 (i32*)*)* @_testfunc_callback_with_pointer, variables: !564)
!561 = !DISubroutineType(types: !562)
!562 = !{!5, !563}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!564 = !{!565, !566}
!565 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 1, scope: !560, file: !352, line: 211, type: !563)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "table", scope: !560, file: !352, line: 213, type: !567)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 320, align: 32, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 10)
!570 = !DISubprogram(name: "_testfunc_q_bhilfdq", scope: !352, file: !352, line: 219, type: !571, isLocal: false, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8, i16, i32, i64, float, double, i64)* @_testfunc_q_bhilfdq, variables: !573)
!571 = !DISubroutineType(types: !572)
!572 = !{!14, !86, !469, !5, !27, !6, !7, !14}
!573 = !{!574, !575, !576, !577, !578, !579, !580}
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 1, scope: !570, file: !352, line: 219, type: !86)
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 2, scope: !570, file: !352, line: 219, type: !469)
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 3, scope: !570, file: !352, line: 219, type: !5)
!577 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "l", arg: 4, scope: !570, file: !352, line: 219, type: !27)
!578 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 5, scope: !570, file: !352, line: 219, type: !6)
!579 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 6, scope: !570, file: !352, line: 220, type: !7)
!580 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "q", arg: 7, scope: !570, file: !352, line: 220, type: !14)
!581 = !DISubprogram(name: "_testfunc_q_bhilfd", scope: !352, file: !352, line: 225, type: !582, isLocal: false, isDefinition: true, scopeLine: 226, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8, i16, i32, i64, float, double)* @_testfunc_q_bhilfd, variables: !584)
!582 = !DISubroutineType(types: !583)
!583 = !{!14, !86, !469, !5, !27, !6, !7}
!584 = !{!585, !586, !587, !588, !589, !590}
!585 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 1, scope: !581, file: !352, line: 225, type: !86)
!586 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "h", arg: 2, scope: !581, file: !352, line: 225, type: !469)
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 3, scope: !581, file: !352, line: 225, type: !5)
!588 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "l", arg: 4, scope: !581, file: !352, line: 225, type: !27)
!589 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 5, scope: !581, file: !352, line: 225, type: !6)
!590 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 6, scope: !581, file: !352, line: 225, type: !7)
!591 = !DISubprogram(name: "_testfunc_callback_i_if", scope: !352, file: !352, line: 230, type: !592, isLocal: false, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32 (i32)*)* @_testfunc_callback_i_if, variables: !597)
!592 = !DISubroutineType(types: !593)
!593 = !{!5, !5, !594}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64, align: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!5, !5}
!597 = !{!598, !599, !600}
!598 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 1, scope: !591, file: !352, line: 230, type: !5)
!599 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 2, scope: !591, file: !352, line: 230, type: !594)
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum", scope: !591, file: !352, line: 232, type: !5)
!601 = !DISubprogram(name: "_testfunc_callback_q_qf", scope: !352, file: !352, line: 240, type: !602, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i64, i64 (i64)*)* @_testfunc_callback_q_qf, variables: !607)
!602 = !DISubroutineType(types: !603)
!603 = !{!14, !14, !604}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64, align: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!14, !14}
!607 = !{!608, !609, !610}
!608 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 1, scope: !601, file: !352, line: 240, type: !14)
!609 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 2, scope: !601, file: !352, line: 241, type: !604)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum", scope: !601, file: !352, line: 243, type: !14)
!611 = !DISubprogram(name: "getSPAMANDEGGS", scope: !352, file: !352, line: 274, type: !612, isLocal: false, isDefinition: true, scopeLine: 275, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.EGG**)* @getSPAMANDEGGS, variables: !628)
!612 = !DISubroutineType(types: !613)
!613 = !{!5, !614}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "EGG", file: !352, line: 263, baseType: !617)
!617 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 259, size: 192, align: 64, elements: !618)
!618 = !{!619, !620, !621}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !617, file: !352, line: 260, baseType: !8, size: 64, align: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "num_spams", scope: !617, file: !352, line: 261, baseType: !5, size: 32, align: 32, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "spams", scope: !617, file: !352, line: 262, baseType: !622, size: 64, align: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64, align: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPAM", file: !352, line: 257, baseType: !624)
!624 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 254, size: 128, align: 64, elements: !625)
!625 = !{!626, !627}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !624, file: !352, line: 255, baseType: !8, size: 64, align: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !624, file: !352, line: 256, baseType: !8, size: 64, align: 64, offset: 64)
!628 = !{!629}
!629 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "eggs", arg: 1, scope: !611, file: !352, line: 274, type: !614)
!630 = !DISubprogram(name: "_testfunc_byval", scope: !352, file: !352, line: 285, type: !631, isLocal: false, isDefinition: true, scopeLine: 286, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i64, %struct.tagpoint*)* @_testfunc_byval, variables: !639)
!631 = !DISubroutineType(types: !632)
!632 = !{!5, !633, !638}
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "point", file: !352, line: 283, baseType: !634)
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "tagpoint", file: !352, line: 280, size: 64, align: 32, elements: !635)
!635 = !{!636, !637}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !634, file: !352, line: 281, baseType: !5, size: 32, align: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !634, file: !352, line: 282, baseType: !5, size: 32, align: 32, offset: 32)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64, align: 64)
!639 = !{!640, !641}
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "in", arg: 1, scope: !630, file: !352, line: 285, type: !633)
!641 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pout", arg: 2, scope: !630, file: !352, line: 285, type: !638)
!642 = !DISubprogram(name: "get_an_integer", scope: !352, file: !352, line: 296, type: !643, isLocal: false, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @get_an_integer, variables: !2)
!643 = !DISubroutineType(types: !644)
!644 = !{!5}
!645 = !DISubprogram(name: "integrate", scope: !352, file: !352, line: 302, type: !646, isLocal: false, isDefinition: true, scopeLine: 303, flags: DIFlagPrototyped, isOptimized: true, function: double (double, double, double (double)*, i64)* @integrate, variables: !649)
!646 = !DISubroutineType(types: !647)
!647 = !{!7, !7, !7, !648, !27}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!649 = !{!650, !651, !652, !653, !654, !655, !656}
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !645, file: !352, line: 302, type: !7)
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !645, file: !352, line: 302, type: !7)
!652 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 3, scope: !645, file: !352, line: 302, type: !648)
!653 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nstep", arg: 4, scope: !645, file: !352, line: 302, type: !27)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !645, file: !352, line: 304, type: !7)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum", scope: !645, file: !352, line: 304, type: !7)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !645, file: !352, line: 304, type: !7)
!657 = !DISubprogram(name: "library_get", scope: !352, file: !352, line: 329, type: !658, isLocal: false, isDefinition: true, scopeLine: 330, flags: DIFlagPrototyped, isOptimized: true, function: %struct.xxx_library* ()* @library_get, variables: !2)
!658 = !DISubroutineType(types: !659)
!659 = !{!660}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "xxx_library", file: !352, line: 312, baseType: !662)
!662 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 310, size: 64, align: 64, elements: !663)
!663 = !{!664}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "initialize", scope: !662, file: !352, line: 311, baseType: !665, size: 64, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !668, !336}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64, align: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!10, !5}
!671 = !DISubprogram(name: "py_func_si", scope: !352, file: !352, line: 345, type: !132, isLocal: false, isDefinition: true, scopeLine: 346, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @py_func_si, variables: !672)
!672 = !{!673, !674, !675, !676}
!673 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !671, file: !352, line: 345, type: !15)
!674 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !671, file: !352, line: 345, type: !15)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !671, file: !352, line: 347, type: !8)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !671, file: !352, line: 348, type: !5)
!677 = !DISubprogram(name: "_py_func_si", scope: !352, file: !352, line: 355, type: !678, isLocal: false, isDefinition: true, scopeLine: 356, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32)* @_py_func_si, variables: !680)
!678 = !DISubroutineType(types: !679)
!679 = !{null, !8, !5}
!680 = !{!681, !682}
!681 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !677, file: !352, line: 355, type: !8)
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !677, file: !352, line: 355, type: !5)
!683 = !DISubprogram(name: "py_func", scope: !352, file: !352, line: 359, type: !132, isLocal: false, isDefinition: true, scopeLine: 360, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @py_func, variables: !684)
!684 = !{!685, !686}
!685 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !683, file: !352, line: 359, type: !15)
!686 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !683, file: !352, line: 359, type: !15)
!687 = !DISubprogram(name: "_py_func", scope: !352, file: !352, line: 365, type: !688, isLocal: false, isDefinition: true, scopeLine: 366, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_py_func, variables: !2)
!688 = !DISubroutineType(types: !689)
!689 = !{null}
!690 = !DISubprogram(name: "set_bitfields", scope: !352, file: !352, line: 377, type: !691, isLocal: false, isDefinition: true, scopeLine: 378, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.BITS*, i8, i32)* @set_bitfields, variables: !712)
!691 = !DISubroutineType(types: !692)
!692 = !{null, !693, !9, !5}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64, align: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "BITS", file: !352, line: 372, size: 96, align: 32, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !694, file: !352, line: 373, baseType: !5, size: 1, align: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !694, file: !352, line: 373, baseType: !5, size: 2, align: 32, offset: 1)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !694, file: !352, line: 373, baseType: !5, size: 3, align: 32, offset: 3)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !694, file: !352, line: 373, baseType: !5, size: 4, align: 32, offset: 6)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !694, file: !352, line: 373, baseType: !5, size: 5, align: 32, offset: 10)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "F", scope: !694, file: !352, line: 373, baseType: !5, size: 6, align: 32, offset: 15)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "G", scope: !694, file: !352, line: 373, baseType: !5, size: 7, align: 32, offset: 21)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "H", scope: !694, file: !352, line: 373, baseType: !5, size: 8, align: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "I", scope: !694, file: !352, line: 373, baseType: !5, size: 9, align: 32, offset: 40)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "M", scope: !694, file: !352, line: 374, baseType: !469, size: 1, align: 16, offset: 49)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "N", scope: !694, file: !352, line: 374, baseType: !469, size: 2, align: 16, offset: 50)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "O", scope: !694, file: !352, line: 374, baseType: !469, size: 3, align: 16, offset: 52)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !694, file: !352, line: 374, baseType: !469, size: 4, align: 16, offset: 55)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "Q", scope: !694, file: !352, line: 374, baseType: !469, size: 5, align: 16, offset: 59)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !694, file: !352, line: 374, baseType: !469, size: 6, align: 16, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "S", scope: !694, file: !352, line: 374, baseType: !469, size: 7, align: 16, offset: 70)
!712 = !{!713, !714, !715}
!713 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bits", arg: 1, scope: !690, file: !352, line: 377, type: !693)
!714 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !690, file: !352, line: 377, type: !9)
!715 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !690, file: !352, line: 377, type: !5)
!716 = !DISubprogram(name: "unpack_bitfields", scope: !352, file: !352, line: 400, type: !717, isLocal: false, isDefinition: true, scopeLine: 401, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.BITS*, i8)* @unpack_bitfields, variables: !719)
!717 = !DISubroutineType(types: !718)
!718 = !{!5, !693, !9}
!719 = !{!720, !721}
!720 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bits", arg: 1, scope: !716, file: !352, line: 400, type: !693)
!721 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !716, file: !352, line: 400, type: !9)
!722 = !DISubprogram(name: "tf_b", scope: !352, file: !352, line: 436, type: !723, isLocal: false, isDefinition: true, scopeLine: 436, flags: DIFlagPrototyped, isOptimized: true, function: i8 (i8)* @tf_b, variables: !725)
!723 = !DISubroutineType(types: !724)
!724 = !{!86, !86}
!725 = !{!726}
!726 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !722, file: !352, line: 436, type: !86)
!727 = !DISubprogram(name: "tf_B", scope: !352, file: !352, line: 437, type: !728, isLocal: false, isDefinition: true, scopeLine: 437, flags: DIFlagPrototyped, isOptimized: true, function: i8 (i8)* @tf_B, variables: !731)
!728 = !DISubroutineType(types: !729)
!729 = !{!730, !730}
!730 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!731 = !{!732}
!732 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !727, file: !352, line: 437, type: !730)
!733 = !DISubprogram(name: "tf_h", scope: !352, file: !352, line: 438, type: !734, isLocal: false, isDefinition: true, scopeLine: 438, flags: DIFlagPrototyped, isOptimized: true, function: i16 (i16)* @tf_h, variables: !736)
!734 = !DISubroutineType(types: !735)
!735 = !{!469, !469}
!736 = !{!737}
!737 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !733, file: !352, line: 438, type: !469)
!738 = !DISubprogram(name: "tf_H", scope: !352, file: !352, line: 439, type: !739, isLocal: false, isDefinition: true, scopeLine: 439, flags: DIFlagPrototyped, isOptimized: true, function: i16 (i16)* @tf_H, variables: !741)
!739 = !DISubroutineType(types: !740)
!740 = !{!84, !84}
!741 = !{!742}
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !738, file: !352, line: 439, type: !84)
!743 = !DISubprogram(name: "tf_i", scope: !352, file: !352, line: 440, type: !595, isLocal: false, isDefinition: true, scopeLine: 440, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @tf_i, variables: !744)
!744 = !{!745}
!745 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !743, file: !352, line: 440, type: !5)
!746 = !DISubprogram(name: "tf_I", scope: !352, file: !352, line: 441, type: !747, isLocal: false, isDefinition: true, scopeLine: 441, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @tf_I, variables: !749)
!747 = !DISubroutineType(types: !748)
!748 = !{!347, !347}
!749 = !{!750}
!750 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !746, file: !352, line: 441, type: !347)
!751 = !DISubprogram(name: "tf_l", scope: !352, file: !352, line: 442, type: !752, isLocal: false, isDefinition: true, scopeLine: 442, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i64)* @tf_l, variables: !754)
!752 = !DISubroutineType(types: !753)
!753 = !{!27, !27}
!754 = !{!755}
!755 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !751, file: !352, line: 442, type: !27)
!756 = !DISubprogram(name: "tf_L", scope: !352, file: !352, line: 443, type: !757, isLocal: false, isDefinition: true, scopeLine: 443, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i64)* @tf_L, variables: !759)
!757 = !DISubroutineType(types: !758)
!758 = !{!102, !102}
!759 = !{!760}
!760 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !756, file: !352, line: 443, type: !102)
!761 = !DISubprogram(name: "tf_q", scope: !352, file: !352, line: 444, type: !605, isLocal: false, isDefinition: true, scopeLine: 444, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i64)* @tf_q, variables: !762)
!762 = !{!763}
!763 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !761, file: !352, line: 444, type: !14)
!764 = !DISubprogram(name: "tf_Q", scope: !352, file: !352, line: 445, type: !765, isLocal: false, isDefinition: true, scopeLine: 445, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i64)* @tf_Q, variables: !767)
!765 = !DISubroutineType(types: !766)
!766 = !{!349, !349}
!767 = !{!768}
!768 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !764, file: !352, line: 445, type: !349)
!769 = !DISubprogram(name: "tf_f", scope: !352, file: !352, line: 446, type: !770, isLocal: false, isDefinition: true, scopeLine: 446, flags: DIFlagPrototyped, isOptimized: true, function: float (float)* @tf_f, variables: !772)
!770 = !DISubroutineType(types: !771)
!771 = !{!6, !6}
!772 = !{!773}
!773 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !769, file: !352, line: 446, type: !6)
!774 = !DISubprogram(name: "tf_d", scope: !352, file: !352, line: 447, type: !437, isLocal: false, isDefinition: true, scopeLine: 447, flags: DIFlagPrototyped, isOptimized: true, function: double (double)* @tf_d, variables: !775)
!775 = !{!776}
!776 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !774, file: !352, line: 447, type: !7)
!777 = !DISubprogram(name: "tf_D", scope: !352, file: !352, line: 448, type: !778, isLocal: false, isDefinition: true, scopeLine: 448, flags: DIFlagPrototyped, isOptimized: true, function: x86_fp80 (x86_fp80)* @tf_D, variables: !780)
!778 = !DISubroutineType(types: !779)
!779 = !{!4, !4}
!780 = !{!781}
!781 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !777, file: !352, line: 448, type: !4)
!782 = !DISubprogram(name: "tf_bb", scope: !352, file: !352, line: 467, type: !783, isLocal: false, isDefinition: true, scopeLine: 467, flags: DIFlagPrototyped, isOptimized: true, function: i8 (i8, i8)* @tf_bb, variables: !785)
!783 = !DISubroutineType(types: !784)
!784 = !{!86, !86, !86}
!785 = !{!786, !787}
!786 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !782, file: !352, line: 467, type: !86)
!787 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 2, scope: !782, file: !352, line: 467, type: !86)
!788 = !DISubprogram(name: "tf_bB", scope: !352, file: !352, line: 468, type: !789, isLocal: false, isDefinition: true, scopeLine: 468, flags: DIFlagPrototyped, isOptimized: true, function: i8 (i8, i8)* @tf_bB, variables: !791)
!789 = !DISubroutineType(types: !790)
!790 = !{!730, !86, !730}
!791 = !{!792, !793}
!792 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !788, file: !352, line: 468, type: !86)
!793 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 2, scope: !788, file: !352, line: 468, type: !730)
!794 = !DISubprogram(name: "tf_bh", scope: !352, file: !352, line: 469, type: !795, isLocal: false, isDefinition: true, scopeLine: 469, flags: DIFlagPrototyped, isOptimized: true, function: i16 (i8, i16)* @tf_bh, variables: !797)
!795 = !DISubroutineType(types: !796)
!796 = !{!469, !86, !469}
!797 = !{!798, !799}
!798 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !794, file: !352, line: 469, type: !86)
!799 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 2, scope: !794, file: !352, line: 469, type: !469)
!800 = !DISubprogram(name: "tf_bH", scope: !352, file: !352, line: 470, type: !801, isLocal: false, isDefinition: true, scopeLine: 470, flags: DIFlagPrototyped, isOptimized: true, function: i16 (i8, i16)* @tf_bH, variables: !803)
!801 = !DISubroutineType(types: !802)
!802 = !{!84, !86, !84}
!803 = !{!804, !805}
!804 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !800, file: !352, line: 470, type: !86)
!805 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 2, scope: !800, file: !352, line: 470, type: !84)
!806 = !DISubprogram(name: "tf_bi", scope: !352, file: !352, line: 471, type: !807, isLocal: false, isDefinition: true, scopeLine: 471, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8, i32)* @tf_bi, variables: !809)
!807 = !DISubroutineType(types: !808)
!808 = !{!5, !86, !5}
!809 = !{!810, !811}
!810 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !806, file: !352, line: 471, type: !86)
!811 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 2, scope: !806, file: !352, line: 471, type: !5)
!812 = !DISubprogram(name: "tf_bI", scope: !352, file: !352, line: 472, type: !813, isLocal: false, isDefinition: true, scopeLine: 472, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8, i32)* @tf_bI, variables: !815)
!813 = !DISubroutineType(types: !814)
!814 = !{!347, !86, !347}
!815 = !{!816, !817}
!816 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !812, file: !352, line: 472, type: !86)
!817 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 2, scope: !812, file: !352, line: 472, type: !347)
!818 = !DISubprogram(name: "tf_bl", scope: !352, file: !352, line: 473, type: !819, isLocal: false, isDefinition: true, scopeLine: 473, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8, i64)* @tf_bl, variables: !821)
!819 = !DISubroutineType(types: !820)
!820 = !{!27, !86, !27}
!821 = !{!822, !823}
!822 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !818, file: !352, line: 473, type: !86)
!823 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 2, scope: !818, file: !352, line: 473, type: !27)
!824 = !DISubprogram(name: "tf_bL", scope: !352, file: !352, line: 474, type: !825, isLocal: false, isDefinition: true, scopeLine: 474, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8, i64)* @tf_bL, variables: !827)
!825 = !DISubroutineType(types: !826)
!826 = !{!102, !86, !102}
!827 = !{!828, !829}
!828 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !824, file: !352, line: 474, type: !86)
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 2, scope: !824, file: !352, line: 474, type: !102)
!830 = !DISubprogram(name: "tf_bq", scope: !352, file: !352, line: 475, type: !831, isLocal: false, isDefinition: true, scopeLine: 475, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8, i64)* @tf_bq, variables: !833)
!831 = !DISubroutineType(types: !832)
!832 = !{!14, !86, !14}
!833 = !{!834, !835}
!834 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !830, file: !352, line: 475, type: !86)
!835 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 2, scope: !830, file: !352, line: 475, type: !14)
!836 = !DISubprogram(name: "tf_bQ", scope: !352, file: !352, line: 476, type: !837, isLocal: false, isDefinition: true, scopeLine: 476, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8, i64)* @tf_bQ, variables: !839)
!837 = !DISubroutineType(types: !838)
!838 = !{!349, !86, !349}
!839 = !{!840, !841}
!840 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !836, file: !352, line: 476, type: !86)
!841 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 2, scope: !836, file: !352, line: 476, type: !349)
!842 = !DISubprogram(name: "tf_bf", scope: !352, file: !352, line: 477, type: !843, isLocal: false, isDefinition: true, scopeLine: 477, flags: DIFlagPrototyped, isOptimized: true, function: float (i8, float)* @tf_bf, variables: !845)
!843 = !DISubroutineType(types: !844)
!844 = !{!6, !86, !6}
!845 = !{!846, !847}
!846 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !842, file: !352, line: 477, type: !86)
!847 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 2, scope: !842, file: !352, line: 477, type: !6)
!848 = !DISubprogram(name: "tf_bd", scope: !352, file: !352, line: 478, type: !849, isLocal: false, isDefinition: true, scopeLine: 478, flags: DIFlagPrototyped, isOptimized: true, function: double (i8, double)* @tf_bd, variables: !851)
!849 = !DISubroutineType(types: !850)
!850 = !{!7, !86, !7}
!851 = !{!852, !853}
!852 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !848, file: !352, line: 478, type: !86)
!853 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 2, scope: !848, file: !352, line: 478, type: !7)
!854 = !DISubprogram(name: "tf_bD", scope: !352, file: !352, line: 479, type: !855, isLocal: false, isDefinition: true, scopeLine: 479, flags: DIFlagPrototyped, isOptimized: true, function: x86_fp80 (i8, x86_fp80)* @tf_bD, variables: !857)
!855 = !DISubroutineType(types: !856)
!856 = !{!4, !86, !4}
!857 = !{!858, !859}
!858 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !854, file: !352, line: 479, type: !86)
!859 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 2, scope: !854, file: !352, line: 479, type: !4)
!860 = !DISubprogram(name: "tv_i", scope: !352, file: !352, line: 480, type: !861, isLocal: false, isDefinition: true, scopeLine: 480, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @tv_i, variables: !863)
!861 = !DISubroutineType(types: !862)
!862 = !{null, !5}
!863 = !{!864}
!864 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !860, file: !352, line: 480, type: !5)
!865 = !DISubprogram(name: "PointInRect", scope: !352, file: !352, line: 517, type: !866, isLocal: false, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.RECT*, i64, i64)* @PointInRect, variables: !881)
!866 = !DISubroutineType(types: !867)
!867 = !{!5, !868, !876}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64, align: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "RECT", file: !352, line: 513, baseType: !870)
!870 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 508, size: 256, align: 64, elements: !871)
!871 = !{!872, !873, !874, !875}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !870, file: !352, line: 509, baseType: !27, size: 64, align: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !870, file: !352, line: 510, baseType: !27, size: 64, align: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !870, file: !352, line: 511, baseType: !27, size: 64, align: 64, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !870, file: !352, line: 512, baseType: !27, size: 64, align: 64, offset: 192)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "POINT", file: !352, line: 506, baseType: !877)
!877 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 503, size: 128, align: 64, elements: !878)
!878 = !{!879, !880}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !877, file: !352, line: 504, baseType: !27, size: 64, align: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !877, file: !352, line: 505, baseType: !27, size: 64, align: 64, offset: 64)
!881 = !{!882, !883}
!882 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prc", arg: 1, scope: !865, file: !352, line: 517, type: !868)
!883 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pt", arg: 2, scope: !865, file: !352, line: 517, type: !876)
!884 = !DISubprogram(name: "ret_2h_func", scope: !352, file: !352, line: 535, type: !885, isLocal: false, isDefinition: true, scopeLine: 536, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @ret_2h_func, variables: !892)
!885 = !DISubroutineType(types: !886)
!886 = !{!887, !887}
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "S2H", file: !352, line: 533, baseType: !888)
!888 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 530, size: 32, align: 16, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !888, file: !352, line: 531, baseType: !469, size: 16, align: 16)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !888, file: !352, line: 532, baseType: !469, size: 16, align: 16, offset: 16)
!892 = !{!893}
!893 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inp", arg: 1, scope: !884, file: !352, line: 535, type: !887)
!894 = !DISubprogram(name: "ret_8i_func", scope: !352, file: !352, line: 546, type: !895, isLocal: false, isDefinition: true, scopeLine: 547, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.S8I*, %struct.S8I*)* @ret_8i_func, variables: !908)
!895 = !DISubroutineType(types: !896)
!896 = !{!897, !897}
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "S8I", file: !352, line: 544, baseType: !898)
!898 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 542, size: 256, align: 32, elements: !899)
!899 = !{!900, !901, !902, !903, !904, !905, !906, !907}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !898, file: !352, line: 543, baseType: !5, size: 32, align: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !898, file: !352, line: 543, baseType: !5, size: 32, align: 32, offset: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !898, file: !352, line: 543, baseType: !5, size: 32, align: 32, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !898, file: !352, line: 543, baseType: !5, size: 32, align: 32, offset: 96)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !898, file: !352, line: 543, baseType: !5, size: 32, align: 32, offset: 128)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !898, file: !352, line: 543, baseType: !5, size: 32, align: 32, offset: 160)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !898, file: !352, line: 543, baseType: !5, size: 32, align: 32, offset: 192)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !898, file: !352, line: 543, baseType: !5, size: 32, align: 32, offset: 224)
!908 = !{!909}
!909 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inp", arg: 1, scope: !894, file: !352, line: 546, type: !897)
!910 = !DISubprogram(name: "GetRectangle", scope: !352, file: !352, line: 559, type: !911, isLocal: false, isDefinition: true, scopeLine: 560, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.RECT*)* @GetRectangle, variables: !913)
!911 = !DISubroutineType(types: !912)
!912 = !{!5, !5, !868}
!913 = !{!914, !915}
!914 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flag", arg: 1, scope: !910, file: !352, line: 559, type: !5)
!915 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prect", arg: 2, scope: !910, file: !352, line: 559, type: !868)
!916 = !DISubprogram(name: "TwoOutArgs", scope: !352, file: !352, line: 570, type: !917, isLocal: false, isDefinition: true, scopeLine: 571, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32*, i32, i32*)* @TwoOutArgs, variables: !919)
!917 = !DISubroutineType(types: !918)
!918 = !{null, !5, !381, !5, !381}
!919 = !{!920, !921, !922, !923}
!920 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !916, file: !352, line: 570, type: !5)
!921 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pi", arg: 2, scope: !916, file: !352, line: 570, type: !381)
!922 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 3, scope: !916, file: !352, line: 570, type: !5)
!923 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pj", arg: 4, scope: !916, file: !352, line: 570, type: !381)
!924 = !DISubprogram(name: "PyInit__ctypes_test", scope: !352, file: !352, line: 613, type: !925, isLocal: false, isDefinition: true, scopeLine: 614, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__ctypes_test, variables: !2)
!925 = !DISubroutineType(types: !926)
!926 = !{!15}
!927 = !DISubprogram(name: "vprintf", scope: !928, file: !928, line: 36, type: !929, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct.__va_list_tag*)* @vprintf, variables: !933)
!928 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!929 = !DISubroutineType(types: !930)
!930 = !{!5, !931, !932}
!931 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !39)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!933 = !{!934, !935}
!934 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__fmt", arg: 1, scope: !927, file: !928, line: 36, type: !931)
!935 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__arg", arg: 2, scope: !927, file: !928, line: 36, type: !932)
!936 = !DISubprogram(name: "_xxx_init", scope: !352, file: !352, line: 314, type: !666, isLocal: true, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true, function: void (i8* (i32)*, void (i8*)*)* @_xxx_init, variables: !937)
!937 = !{!938, !939, !940}
!938 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Xalloc", arg: 1, scope: !936, file: !352, line: 314, type: !668)
!939 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "Xfree", arg: 2, scope: !936, file: !352, line: 314, type: !336)
!940 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !936, file: !352, line: 316, type: !10)
!941 = !{!942, !946, !948, !949, !950, !951, !952, !975}
!942 = !DIGlobalVariable(name: "my_spams", scope: !0, file: !352, line: 265, type: !943, isLocal: false, isDefinition: true, variable: [2 x %struct.SPAM]* @my_spams)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 256, align: 64, elements: !944)
!944 = !{!945}
!945 = !DISubrange(count: 2)
!946 = !DIGlobalVariable(name: "my_eggs", scope: !0, file: !352, line: 270, type: !947, isLocal: false, isDefinition: true, variable: [1 x %struct.EGG]* @my_eggs)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 192, align: 64, elements: !89)
!948 = !DIGlobalVariable(name: "an_integer", scope: !0, file: !352, line: 294, type: !5, isLocal: false, isDefinition: true, variable: i32* @an_integer)
!949 = !DIGlobalVariable(name: "_xxx_lib", scope: !0, file: !352, line: 325, type: !661, isLocal: false, isDefinition: true, variable: %struct.xxx_library* @_xxx_lib)
!950 = !DIGlobalVariable(name: "last_tf_arg_s", scope: !0, file: !352, line: 369, type: !14, isLocal: false, isDefinition: true, variable: i64* @last_tf_arg_s)
!951 = !DIGlobalVariable(name: "last_tf_arg_u", scope: !0, file: !352, line: 370, type: !349, isLocal: false, isDefinition: true, variable: i64* @last_tf_arg_u)
!952 = !DIGlobalVariable(name: "_ctypes_testmodule", scope: !0, file: !352, line: 600, type: !953, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @_ctypes_testmodule)
!953 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !954, line: 47, size: 832, align: 64, elements: !955)
!954 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!955 = !{!956, !965, !966, !967, !968, !971, !972, !973, !974}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !953, file: !954, line: 48, baseType: !957, size: 320, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !954, line: 38, baseType: !958)
!958 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !954, line: 33, size: 320, align: 64, elements: !959)
!959 = !{!960, !961, !963, !964}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !958, file: !954, line: 34, baseType: !16, size: 128, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !958, file: !954, line: 35, baseType: !962, size: 64, align: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !958, file: !954, line: 36, baseType: !21, size: 64, align: 64, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !958, file: !954, line: 37, baseType: !15, size: 64, align: 64, offset: 256)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !953, file: !954, line: 49, baseType: !39, size: 64, align: 64, offset: 320)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !953, file: !954, line: 50, baseType: !39, size: 64, align: 64, offset: 384)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !953, file: !954, line: 51, baseType: !21, size: 64, align: 64, offset: 448)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !953, file: !954, line: 52, baseType: !969, size: 64, align: 64, offset: 512)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !287, line: 47, baseType: !286)
