; ModuleID = 'programs_new/Python-new/_curses_panel.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !444, globals: !608)
!1 = !DIFile(filename: "_curses_panel.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !350, !11, !351, !354, !356, !437}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "_curses_panelstate", file: !7, line: 22, baseType: !8)
!7 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_curses_panel.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!8 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 19, size: 128, align: 64, elements: !9)
!9 = !{!10, !349}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "PyCursesError", scope: !8, file: !7, line: 20, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !13, line: 109, baseType: !14)
!13 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !13, line: 105, size: 128, align: 64, elements: !15)
!15 = !{!16, !24}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !14, file: !13, line: 107, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !18, line: 177, baseType: !19)
!18 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !20, line: 102, baseType: !21)
!20 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !22, line: 181, baseType: !23)
!22 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!23 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !14, file: !13, line: 108, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !13, line: 334, size: 3200, align: 64, elements: !27)
!27 = !{!28, !34, !38, !39, !40, !45, !108, !113, !118, !119, !124, !176, !207, !219, !225, !226, !227, !229, !231, !262, !263, !264, !273, !274, !279, !280, !282, !284, !294, !297, !315, !316, !317, !319, !321, !322, !324, !329, !334, !339, !340, !341, !342, !343, !344, !345, !346, !348}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !26, file: !13, line: 335, baseType: !29, size: 192, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !13, line: 114, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 111, size: 192, align: 64, elements: !31)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !30, file: !13, line: 112, baseType: !12, size: 128, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !30, file: !13, line: 113, baseType: !17, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !26, file: !13, line: 336, baseType: !35, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!37 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !26, file: !13, line: 337, baseType: !17, size: 64, align: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !26, file: !13, line: 337, baseType: !17, size: 64, align: 64, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !26, file: !13, line: 341, baseType: !41, size: 64, align: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !13, line: 308, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !11}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !26, file: !13, line: 342, baseType: !46, size: 64, align: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !13, line: 314, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !11, !51, !50}
!50 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !20, line: 48, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !54, line: 246, size: 1728, align: 64, elements: !55)
!54 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!55 = !{!56, !57, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !77, !78, !79, !80, !82, !84, !86, !90, !93, !95, !96, !97, !98, !99, !103, !104}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !53, file: !54, line: 247, baseType: !50, size: 32, align: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !53, file: !54, line: 252, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !53, file: !54, line: 253, baseType: !58, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !53, file: !54, line: 254, baseType: !58, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !53, file: !54, line: 255, baseType: !58, size: 64, align: 64, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !53, file: !54, line: 256, baseType: !58, size: 64, align: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !53, file: !54, line: 257, baseType: !58, size: 64, align: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !53, file: !54, line: 258, baseType: !58, size: 64, align: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !53, file: !54, line: 259, baseType: !58, size: 64, align: 64, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !53, file: !54, line: 261, baseType: !58, size: 64, align: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !53, file: !54, line: 262, baseType: !58, size: 64, align: 64, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !53, file: !54, line: 263, baseType: !58, size: 64, align: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !53, file: !54, line: 265, baseType: !70, size: 64, align: 64, offset: 768)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !54, line: 161, size: 192, align: 64, elements: !72)
!72 = !{!73, !74, !76}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !71, file: !54, line: 162, baseType: !70, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !71, file: !54, line: 163, baseType: !75, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !71, file: !54, line: 167, baseType: !50, size: 32, align: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !53, file: !54, line: 267, baseType: !75, size: 64, align: 64, offset: 832)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !53, file: !54, line: 269, baseType: !50, size: 32, align: 32, offset: 896)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !53, file: !54, line: 273, baseType: !50, size: 32, align: 32, offset: 928)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !53, file: !54, line: 275, baseType: !81, size: 64, align: 64, offset: 960)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !22, line: 140, baseType: !23)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !53, file: !54, line: 279, baseType: !83, size: 16, align: 16, offset: 1024)
!83 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !53, file: !54, line: 280, baseType: !85, size: 8, align: 8, offset: 1040)
!85 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !53, file: !54, line: 281, baseType: !87, size: 8, align: 8, offset: 1048)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, align: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 1)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !53, file: !54, line: 285, baseType: !91, size: 64, align: 64, offset: 1088)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !54, line: 155, baseType: null)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !53, file: !54, line: 294, baseType: !94, size: 64, align: 64, offset: 1152)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !22, line: 141, baseType: !23)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !53, file: !54, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !53, file: !54, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !53, file: !54, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !53, file: !54, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !53, file: !54, line: 307, baseType: !100, size: 64, align: 64, offset: 1472)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !101, line: 62, baseType: !102)
!101 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!102 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !53, file: !54, line: 309, baseType: !50, size: 32, align: 32, offset: 1536)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !53, file: !54, line: 311, baseType: !105, size: 160, align: 8, offset: 1568)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 160, align: 8, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 20)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !26, file: !13, line: 343, baseType: !109, size: 64, align: 64, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !13, line: 316, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!11, !11, !58}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !26, file: !13, line: 344, baseType: !114, size: 64, align: 64, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !13, line: 318, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!50, !11, !58, !11}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !26, file: !13, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !26, file: !13, line: 346, baseType: !120, size: 64, align: 64, offset: 704)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !13, line: 320, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!11, !11}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !26, file: !13, line: 350, baseType: !125, size: 64, align: 64, offset: 768)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !13, line: 278, baseType: !127)
!127 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 236, size: 2176, align: 64, elements: !128)
!128 = !{!129, !134, !135, !136, !137, !138, !143, !145, !146, !147, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !127, file: !13, line: 241, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !13, line: 166, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!11, !11, !11}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !127, file: !13, line: 242, baseType: !130, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !127, file: !13, line: 243, baseType: !130, size: 64, align: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !127, file: !13, line: 244, baseType: !130, size: 64, align: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !127, file: !13, line: 245, baseType: !130, size: 64, align: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !127, file: !13, line: 246, baseType: !139, size: 64, align: 64, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !13, line: 167, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!11, !11, !11, !11}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !127, file: !13, line: 247, baseType: !144, size: 64, align: 64, offset: 384)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !13, line: 165, baseType: !121)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !127, file: !13, line: 248, baseType: !144, size: 64, align: 64, offset: 448)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !127, file: !13, line: 249, baseType: !144, size: 64, align: 64, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !127, file: !13, line: 250, baseType: !148, size: 64, align: 64, offset: 576)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !13, line: 168, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!50, !11}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !127, file: !13, line: 251, baseType: !144, size: 64, align: 64, offset: 640)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !127, file: !13, line: 252, baseType: !130, size: 64, align: 64, offset: 704)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !127, file: !13, line: 253, baseType: !130, size: 64, align: 64, offset: 768)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !127, file: !13, line: 254, baseType: !130, size: 64, align: 64, offset: 832)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !127, file: !13, line: 255, baseType: !130, size: 64, align: 64, offset: 896)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !127, file: !13, line: 256, baseType: !130, size: 64, align: 64, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !127, file: !13, line: 257, baseType: !144, size: 64, align: 64, offset: 1024)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !127, file: !13, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !127, file: !13, line: 259, baseType: !144, size: 64, align: 64, offset: 1152)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !127, file: !13, line: 261, baseType: !130, size: 64, align: 64, offset: 1216)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !127, file: !13, line: 262, baseType: !130, size: 64, align: 64, offset: 1280)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !127, file: !13, line: 263, baseType: !130, size: 64, align: 64, offset: 1344)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !127, file: !13, line: 264, baseType: !130, size: 64, align: 64, offset: 1408)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !127, file: !13, line: 265, baseType: !139, size: 64, align: 64, offset: 1472)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !127, file: !13, line: 266, baseType: !130, size: 64, align: 64, offset: 1536)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !127, file: !13, line: 267, baseType: !130, size: 64, align: 64, offset: 1600)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !127, file: !13, line: 268, baseType: !130, size: 64, align: 64, offset: 1664)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !127, file: !13, line: 269, baseType: !130, size: 64, align: 64, offset: 1728)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !127, file: !13, line: 270, baseType: !130, size: 64, align: 64, offset: 1792)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !127, file: !13, line: 272, baseType: !130, size: 64, align: 64, offset: 1856)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !127, file: !13, line: 273, baseType: !130, size: 64, align: 64, offset: 1920)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !127, file: !13, line: 274, baseType: !130, size: 64, align: 64, offset: 1984)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !127, file: !13, line: 275, baseType: !130, size: 64, align: 64, offset: 2048)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !127, file: !13, line: 277, baseType: !144, size: 64, align: 64, offset: 2112)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !26, file: !13, line: 351, baseType: !177, size: 64, align: 64, offset: 832)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !13, line: 292, baseType: !179)
!179 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 280, size: 640, align: 64, elements: !180)
!180 = !{!181, !186, !187, !192, !193, !194, !199, !200, !205, !206}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !179, file: !13, line: 281, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !13, line: 169, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!17, !11}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !179, file: !13, line: 282, baseType: !130, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !179, file: !13, line: 283, baseType: !188, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !13, line: 170, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!11, !11, !17}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !179, file: !13, line: 284, baseType: !188, size: 64, align: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !179, file: !13, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !179, file: !13, line: 286, baseType: !195, size: 64, align: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !13, line: 172, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!50, !11, !17, !11}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !179, file: !13, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !179, file: !13, line: 288, baseType: !201, size: 64, align: 64, offset: 448)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !13, line: 231, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!50, !11, !11}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !179, file: !13, line: 290, baseType: !130, size: 64, align: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !179, file: !13, line: 291, baseType: !188, size: 64, align: 64, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !26, file: !13, line: 352, baseType: !208, size: 64, align: 64, offset: 896)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !13, line: 298, baseType: !210)
!210 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 294, size: 192, align: 64, elements: !211)
!211 = !{!212, !213, !214}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !210, file: !13, line: 295, baseType: !182, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !210, file: !13, line: 296, baseType: !130, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !210, file: !13, line: 297, baseType: !215, size: 64, align: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !13, line: 174, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!50, !11, !11, !11}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !26, file: !13, line: 356, baseType: !220, size: 64, align: 64, offset: 960)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !13, line: 321, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!224, !11}
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !18, line: 186, baseType: !17)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !26, file: !13, line: 357, baseType: !139, size: 64, align: 64, offset: 1024)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !26, file: !13, line: 358, baseType: !120, size: 64, align: 64, offset: 1088)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !26, file: !13, line: 359, baseType: !228, size: 64, align: 64, offset: 1152)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !13, line: 317, baseType: !131)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !26, file: !13, line: 360, baseType: !230, size: 64, align: 64, offset: 1216)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !13, line: 319, baseType: !216)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !26, file: !13, line: 363, baseType: !232, size: 64, align: 64, offset: 1280)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !13, line: 304, baseType: !234)
!234 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 301, size: 128, align: 64, elements: !235)
!235 = !{!236, !257}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !234, file: !13, line: 302, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !13, line: 193, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!50, !11, !241, !50}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !13, line: 191, baseType: !243)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !13, line: 178, size: 640, align: 64, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !254, !255, !256}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !243, file: !13, line: 179, baseType: !4, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !243, file: !13, line: 180, baseType: !11, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !243, file: !13, line: 181, baseType: !17, size: 64, align: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !243, file: !13, line: 182, baseType: !17, size: 64, align: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !243, file: !13, line: 184, baseType: !50, size: 32, align: 32, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !243, file: !13, line: 185, baseType: !50, size: 32, align: 32, offset: 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !243, file: !13, line: 186, baseType: !58, size: 64, align: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !243, file: !13, line: 187, baseType: !253, size: 64, align: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !243, file: !13, line: 188, baseType: !253, size: 64, align: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !243, file: !13, line: 189, baseType: !253, size: 64, align: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !243, file: !13, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !234, file: !13, line: 303, baseType: !258, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !13, line: 194, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !11, !241}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !26, file: !13, line: 366, baseType: !102, size: 64, align: 64, offset: 1344)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !26, file: !13, line: 368, baseType: !35, size: 64, align: 64, offset: 1408)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !26, file: !13, line: 372, baseType: !265, size: 64, align: 64, offset: 1472)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !13, line: 233, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!50, !11, !269, !4}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !13, line: 232, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!50, !11, !4}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !26, file: !13, line: 375, baseType: !148, size: 64, align: 64, offset: 1536)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !26, file: !13, line: 379, baseType: !275, size: 64, align: 64, offset: 1600)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !13, line: 322, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!11, !11, !11, !50}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !26, file: !13, line: 382, baseType: !17, size: 64, align: 64, offset: 1664)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !26, file: !13, line: 385, baseType: !281, size: 64, align: 64, offset: 1728)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !13, line: 323, baseType: !121)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !26, file: !13, line: 386, baseType: !283, size: 64, align: 64, offset: 1792)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !13, line: 324, baseType: !121)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !26, file: !13, line: 389, baseType: !285, size: 64, align: 64, offset: 1856)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !287, line: 40, size: 256, align: 64, elements: !288)
!287 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!288 = !{!289, !290, !292, !293}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !286, file: !287, line: 41, baseType: !35, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !286, file: !287, line: 42, baseType: !291, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !287, line: 18, baseType: !131)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !286, file: !287, line: 43, baseType: !50, size: 32, align: 32, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !286, file: !287, line: 45, baseType: !35, size: 64, align: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !26, file: !13, line: 390, baseType: !295, size: 64, align: 64, offset: 1920)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !13, line: 390, flags: DIFlagFwdDecl)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !26, file: !13, line: 391, baseType: !298, size: 64, align: 64, offset: 1984)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !300, line: 11, size: 320, align: 64, elements: !301)
!300 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!301 = !{!302, !303, !308, !313, !314}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !299, file: !300, line: 12, baseType: !58, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !299, file: !300, line: 13, baseType: !304, size: 64, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !300, line: 8, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!11, !11, !4}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !299, file: !300, line: 14, baseType: !309, size: 64, align: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !300, line: 9, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!50, !11, !11, !4}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !299, file: !300, line: 15, baseType: !58, size: 64, align: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !299, file: !300, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !26, file: !13, line: 392, baseType: !25, size: 64, align: 64, offset: 2048)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !26, file: !13, line: 393, baseType: !11, size: 64, align: 64, offset: 2112)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !26, file: !13, line: 394, baseType: !318, size: 64, align: 64, offset: 2176)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !13, line: 325, baseType: !140)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !26, file: !13, line: 395, baseType: !320, size: 64, align: 64, offset: 2240)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !13, line: 326, baseType: !216)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !26, file: !13, line: 396, baseType: !17, size: 64, align: 64, offset: 2304)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !26, file: !13, line: 397, baseType: !323, size: 64, align: 64, offset: 2368)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !13, line: 327, baseType: !216)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !26, file: !13, line: 398, baseType: !325, size: 64, align: 64, offset: 2432)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !13, line: 329, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!11, !25, !17}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !26, file: !13, line: 399, baseType: !330, size: 64, align: 64, offset: 2496)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !13, line: 328, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!11, !25, !11, !11}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !26, file: !13, line: 400, baseType: !335, size: 64, align: 64, offset: 2560)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !13, line: 307, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !4}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !26, file: !13, line: 401, baseType: !148, size: 64, align: 64, offset: 2624)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !26, file: !13, line: 402, baseType: !11, size: 64, align: 64, offset: 2688)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !26, file: !13, line: 403, baseType: !11, size: 64, align: 64, offset: 2752)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !26, file: !13, line: 404, baseType: !11, size: 64, align: 64, offset: 2816)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !26, file: !13, line: 405, baseType: !11, size: 64, align: 64, offset: 2880)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !26, file: !13, line: 406, baseType: !11, size: 64, align: 64, offset: 2944)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !26, file: !13, line: 407, baseType: !41, size: 64, align: 64, offset: 3008)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !26, file: !13, line: 410, baseType: !347, size: 32, align: 32, offset: 3072)
!347 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !26, file: !13, line: 412, baseType: !41, size: 64, align: 64, offset: 3136)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "PyCursesPanel_Type", scope: !8, file: !7, line: 21, baseType: !11, size: 64, align: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!50}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !13, line: 422, baseType: !26)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCursesPanelObject", file: !7, line: 84, baseType: !358)
!358 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 80, size: 256, align: 64, elements: !359)
!359 = !{!360, !361, !428}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !358, file: !7, line: 81, baseType: !12, size: 128, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !358, file: !7, line: 82, baseType: !362, size: 64, align: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "PANEL", file: !364, line: 50, baseType: !365)
!364 = !DIFile(filename: "/usr/include/ncursesw/panel.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "panel", file: !364, line: 44, size: 256, align: 64, elements: !366)
!366 = !{!367, !424, !426, !427}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !365, file: !364, line: 46, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW", file: !370, line: 354, baseType: !371)
!370 = !DIFile(filename: "/usr/include/ncursesw/ncurses.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "_win_st", file: !370, line: 403, size: 1024, align: 64, elements: !372)
!372 = !{!373, !375, !376, !377, !378, !379, !380, !381, !384, !385, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !399, !400, !401, !402, !403, !404, !413, !414}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_cury", scope: !371, file: !370, line: 405, baseType: !374, size: 16, align: 16)
!374 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_curx", scope: !371, file: !370, line: 405, baseType: !374, size: 16, align: 16, offset: 16)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_maxy", scope: !371, file: !370, line: 408, baseType: !374, size: 16, align: 16, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_maxx", scope: !371, file: !370, line: 408, baseType: !374, size: 16, align: 16, offset: 48)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_begy", scope: !371, file: !370, line: 409, baseType: !374, size: 16, align: 16, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_begx", scope: !371, file: !370, line: 409, baseType: !374, size: 16, align: 16, offset: 80)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !371, file: !370, line: 411, baseType: !374, size: 16, align: 16, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_attrs", scope: !371, file: !370, line: 414, baseType: !382, size: 64, align: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "attr_t", file: !370, line: 356, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "chtype", file: !370, line: 150, baseType: !102)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_bkgd", scope: !371, file: !370, line: 415, baseType: !383, size: 64, align: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_notimeout", scope: !371, file: !370, line: 418, baseType: !386, size: 8, align: 8, offset: 256)
!386 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_clear", scope: !371, file: !370, line: 419, baseType: !386, size: 8, align: 8, offset: 264)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_leaveok", scope: !371, file: !370, line: 420, baseType: !386, size: 8, align: 8, offset: 272)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_scroll", scope: !371, file: !370, line: 421, baseType: !386, size: 8, align: 8, offset: 280)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_idlok", scope: !371, file: !370, line: 422, baseType: !386, size: 8, align: 8, offset: 288)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_idcok", scope: !371, file: !370, line: 423, baseType: !386, size: 8, align: 8, offset: 296)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_immed", scope: !371, file: !370, line: 424, baseType: !386, size: 8, align: 8, offset: 304)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_sync", scope: !371, file: !370, line: 425, baseType: !386, size: 8, align: 8, offset: 312)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_use_keypad", scope: !371, file: !370, line: 426, baseType: !386, size: 8, align: 8, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_delay", scope: !371, file: !370, line: 427, baseType: !50, size: 32, align: 32, offset: 352)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_line", scope: !371, file: !370, line: 429, baseType: !397, size: 64, align: 64, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldat", file: !370, line: 401, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_regtop", scope: !371, file: !370, line: 432, baseType: !374, size: 16, align: 16, offset: 448)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_regbottom", scope: !371, file: !370, line: 433, baseType: !374, size: 16, align: 16, offset: 464)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_parx", scope: !371, file: !370, line: 436, baseType: !50, size: 32, align: 32, offset: 480)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_pary", scope: !371, file: !370, line: 437, baseType: !50, size: 32, align: 32, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_parent", scope: !371, file: !370, line: 438, baseType: !368, size: 64, align: 64, offset: 576)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !371, file: !370, line: 446, baseType: !405, size: 96, align: 16, offset: 640)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "pdat", file: !370, line: 441, size: 96, align: 16, elements: !406)
!406 = !{!407, !408, !409, !410, !411, !412}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_y", scope: !405, file: !370, line: 443, baseType: !374, size: 16, align: 16)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_x", scope: !405, file: !370, line: 443, baseType: !374, size: 16, align: 16, offset: 16)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_top", scope: !405, file: !370, line: 444, baseType: !374, size: 16, align: 16, offset: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_left", scope: !405, file: !370, line: 444, baseType: !374, size: 16, align: 16, offset: 48)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_bottom", scope: !405, file: !370, line: 445, baseType: !374, size: 16, align: 16, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_right", scope: !405, file: !370, line: 445, baseType: !374, size: 16, align: 16, offset: 80)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_yoffset", scope: !371, file: !370, line: 448, baseType: !374, size: 16, align: 16, offset: 736)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_bkgrnd", scope: !371, file: !370, line: 451, baseType: !415, size: 256, align: 64, offset: 768)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "cchar_t", file: !370, line: 396, baseType: !416)
!416 = !DICompositeType(tag: DW_TAG_structure_type, file: !370, line: 386, size: 256, align: 64, elements: !417)
!417 = !{!418, !419}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !416, file: !370, line: 388, baseType: !382, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "chars", scope: !416, file: !370, line: 389, baseType: !420, size: 160, align: 32, offset: 64)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 160, align: 32, elements: !422)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !101, line: 90, baseType: !50)
!422 = !{!423}
!423 = !DISubrange(count: 5)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "below", scope: !365, file: !364, line: 47, baseType: !425, size: 64, align: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "above", scope: !365, file: !364, line: 48, baseType: !425, size: 64, align: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !365, file: !364, line: 49, baseType: !4, size: 64, align: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "wo", scope: !358, file: !7, line: 83, baseType: !429, size: 64, align: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCursesWindowObject", file: !431, line: 80, baseType: !432)
!431 = !DIFile(filename: "./Include/py_curses.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!432 = !DICompositeType(tag: DW_TAG_structure_type, file: !431, line: 76, size: 256, align: 64, elements: !433)
!433 = !{!434, !435, !436}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !432, file: !431, line: 77, baseType: !12, size: 128, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !432, file: !431, line: 78, baseType: !368, size: 64, align: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !432, file: !431, line: 79, baseType: !58, size: 64, align: 64, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "list_of_panels", file: !7, line: 109, baseType: !439)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "_list_of_panels", file: !7, line: 106, size: 128, align: 64, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "po", scope: !439, file: !7, line: 107, baseType: !356, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !439, file: !7, line: 108, baseType: !443, size: 64, align: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!444 = !{!445, !459, !464, !470, !476, !487, !493, !498, !501, !510, !519, !522, !531, !536, !543, !548, !551, !557, !560, !563, !571, !580, !595, !598, !601, !605}
!445 = !DISubprogram(name: "PyInit__curses_panel", scope: !7, file: !7, line: 499, type: !446, isLocal: false, isDefinition: true, scopeLine: 500, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__curses_panel, variables: !448)
!446 = !DISubroutineType(types: !447)
!447 = !{!11}
!448 = !{!449, !450, !451, !452, !454, !456}
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !445, file: !7, line: 501, type: !11)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !445, file: !7, line: 501, type: !11)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !445, file: !7, line: 501, type: !11)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !453, file: !7, line: 527, type: !11)
!453 = distinct !DILexicalBlock(scope: !445, file: !7, line: 527, column: 8)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !455, file: !7, line: 530, type: !11)
!455 = distinct !DILexicalBlock(scope: !445, file: !7, line: 530, column: 8)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !457, file: !7, line: 530, type: !11)
!457 = distinct !DILexicalBlock(scope: !458, file: !7, line: 530, column: 93)
!458 = distinct !DILexicalBlock(scope: !455, file: !7, line: 530, column: 59)
!459 = !DISubprogram(name: "PyCurses_bottom_panel", scope: !7, file: !7, line: 394, type: !122, isLocal: true, isDefinition: true, scopeLine: 395, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyCurses_bottom_panel, variables: !460)
!460 = !{!461, !462, !463}
!461 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !459, file: !7, line: 394, type: !11)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pan", scope: !459, file: !7, line: 396, type: !362)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "po", scope: !459, file: !7, line: 397, type: !356)
!464 = !DISubprogram(name: "find_po", scope: !7, file: !7, line: 158, type: !465, isLocal: true, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: true, function: %struct.PyCursesPanelObject* (%struct.panel*)* @find_po, variables: !467)
!465 = !DISubroutineType(types: !466)
!466 = !{!356, !362}
!467 = !{!468, !469}
!468 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pan", arg: 1, scope: !464, file: !7, line: 158, type: !362)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !464, file: !7, line: 160, type: !437)
!470 = !DISubprogram(name: "PyCurses_new_panel", scope: !7, file: !7, line: 419, type: !132, isLocal: true, isDefinition: true, scopeLine: 420, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyCurses_new_panel, variables: !471)
!471 = !{!472, !473, !474, !475}
!472 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !470, file: !7, line: 419, type: !11)
!473 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !470, file: !7, line: 419, type: !11)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "win", scope: !470, file: !7, line: 421, type: !429)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pan", scope: !470, file: !7, line: 422, type: !362)
!476 = !DISubprogram(name: "PyCursesPanel_New", scope: !7, file: !7, line: 202, type: !477, isLocal: true, isDefinition: true, scopeLine: 203, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.panel*, %struct.PyCursesWindowObject*)* @PyCursesPanel_New, variables: !479)
!477 = !DISubroutineType(types: !478)
!478 = !{!11, !362, !429}
!479 = !{!480, !481, !482, !483}
!480 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pan", arg: 1, scope: !476, file: !7, line: 202, type: !362)
!481 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "wo", arg: 2, scope: !476, file: !7, line: 202, type: !429)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "po", scope: !476, file: !7, line: 204, type: !356)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !484, file: !7, line: 212, type: !11)
!484 = distinct !DILexicalBlock(scope: !485, file: !7, line: 212, column: 12)
!485 = distinct !DILexicalBlock(scope: !486, file: !7, line: 210, column: 29)
!486 = distinct !DILexicalBlock(scope: !476, file: !7, line: 210, column: 9)
!487 = !DISubprogram(name: "insert_lop", scope: !7, file: !7, line: 116, type: !488, isLocal: true, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyCursesPanelObject*)* @insert_lop, variables: !490)
!488 = !DISubroutineType(types: !489)
!489 = !{!50, !356}
!490 = !{!491, !492}
!491 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "po", arg: 1, scope: !487, file: !7, line: 116, type: !356)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new", scope: !487, file: !7, line: 118, type: !437)
!493 = !DISubprogram(name: "PyCurses_top_panel", scope: !7, file: !7, line: 440, type: !122, isLocal: true, isDefinition: true, scopeLine: 441, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyCurses_top_panel, variables: !494)
!494 = !{!495, !496, !497}
!495 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !493, file: !7, line: 440, type: !11)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pan", scope: !493, file: !7, line: 442, type: !362)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "po", scope: !493, file: !7, line: 443, type: !356)
!498 = !DISubprogram(name: "PyCurses_update_panels", scope: !7, file: !7, line: 464, type: !122, isLocal: true, isDefinition: true, scopeLine: 465, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyCurses_update_panels, variables: !499)
!499 = !{!500}
!500 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !498, file: !7, line: 464, type: !11)
!501 = !DISubprogram(name: "_curses_panel_traverse", scope: !7, file: !7, line: 34, type: !267, isLocal: true, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)* @_curses_panel_traverse, variables: !502)
!502 = !{!503, !504, !505, !506}
!503 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !501, file: !7, line: 34, type: !11)
!504 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !501, file: !7, line: 34, type: !269)
!505 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !501, file: !7, line: 34, type: !4)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !507, file: !7, line: 36, type: !50)
!507 = distinct !DILexicalBlock(scope: !508, file: !7, line: 36, column: 75)
!508 = distinct !DILexicalBlock(scope: !509, file: !7, line: 36, column: 14)
!509 = distinct !DILexicalBlock(scope: !501, file: !7, line: 36, column: 8)
!510 = !DISubprogram(name: "_curses_panel_clear", scope: !7, file: !7, line: 27, type: !150, isLocal: true, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @_curses_panel_clear, variables: !511)
!511 = !{!512, !513, !515}
!512 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !510, file: !7, line: 27, type: !11)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !514, file: !7, line: 29, type: !11)
!514 = distinct !DILexicalBlock(scope: !510, file: !7, line: 29, column: 8)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !516, file: !7, line: 29, type: !11)
!516 = distinct !DILexicalBlock(scope: !517, file: !7, line: 29, column: 213)
!517 = distinct !DILexicalBlock(scope: !518, file: !7, line: 29, column: 132)
!518 = distinct !DILexicalBlock(scope: !514, file: !7, line: 29, column: 109)
!519 = !DISubprogram(name: "_curses_panel_free", scope: !7, file: !7, line: 41, type: !337, isLocal: true, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @_curses_panel_free, variables: !520)
!520 = !{!521}
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !519, file: !7, line: 41, type: !4)
!522 = !DISubprogram(name: "PyCursesPanel_Dealloc", scope: !7, file: !7, line: 221, type: !523, isLocal: true, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyCursesPanelObject*)* @PyCursesPanel_Dealloc, variables: !525)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !356}
!525 = !{!526, !527}
!526 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "po", arg: 1, scope: !522, file: !7, line: 221, type: !356)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !528, file: !7, line: 225, type: !11)
!528 = distinct !DILexicalBlock(scope: !529, file: !7, line: 225, column: 12)
!529 = distinct !DILexicalBlock(scope: !530, file: !7, line: 224, column: 31)
!530 = distinct !DILexicalBlock(scope: !522, file: !7, line: 224, column: 9)
!531 = !DISubprogram(name: "remove_lop", scope: !7, file: !7, line: 132, type: !523, isLocal: true, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyCursesPanelObject*)* @remove_lop, variables: !532)
!532 = !{!533, !534, !535}
!533 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "po", arg: 1, scope: !531, file: !7, line: 132, type: !356)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !531, file: !7, line: 134, type: !437)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !531, file: !7, line: 134, type: !437)
!536 = !DISubprogram(name: "PyCursesPanel_above", scope: !7, file: !7, line: 234, type: !537, isLocal: true, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyCursesPanelObject*)* @PyCursesPanel_above, variables: !539)
!537 = !DISubroutineType(types: !538)
!538 = !{!11, !356}
!539 = !{!540, !541, !542}
!540 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !536, file: !7, line: 234, type: !356)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pan", scope: !536, file: !7, line: 236, type: !362)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "po", scope: !536, file: !7, line: 237, type: !356)
!543 = !DISubprogram(name: "PyCursesPanel_below", scope: !7, file: !7, line: 259, type: !537, isLocal: true, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyCursesPanelObject*)* @PyCursesPanel_below, variables: !544)
!544 = !{!545, !546, !547}
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !543, file: !7, line: 259, type: !356)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pan", scope: !543, file: !7, line: 261, type: !362)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "po", scope: !543, file: !7, line: 262, type: !356)
!548 = !DISubprogram(name: "PyCursesPanel_bottom_panel", scope: !7, file: !7, line: 192, type: !537, isLocal: true, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyCursesPanelObject*)* @PyCursesPanel_bottom_panel, variables: !549)
!549 = !{!550}
!550 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !548, file: !7, line: 192, type: !356)
!551 = !DISubprogram(name: "PyCursesCheckERR", scope: !7, file: !7, line: 59, type: !552, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32, i8*)* @PyCursesCheckERR, variables: !554)
!552 = !DISubroutineType(types: !553)
!553 = !{!11, !50, !58}
!554 = !{!555, !556}
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "code", arg: 1, scope: !551, file: !7, line: 59, type: !50)
!556 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fname", arg: 2, scope: !551, file: !7, line: 59, type: !58)
!557 = !DISubprogram(name: "PyCursesPanel_panel_hidden", scope: !7, file: !7, line: 196, type: !537, isLocal: true, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyCursesPanelObject*)* @PyCursesPanel_panel_hidden, variables: !558)
!558 = !{!559}
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !557, file: !7, line: 196, type: !356)
!560 = !DISubprogram(name: "PyCursesPanel_hide_panel", scope: !7, file: !7, line: 193, type: !537, isLocal: true, isDefinition: true, scopeLine: 193, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyCursesPanelObject*)* @PyCursesPanel_hide_panel, variables: !561)
!561 = !{!562}
!562 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !560, file: !7, line: 193, type: !356)
!563 = !DISubprogram(name: "PyCursesPanel_move_panel", scope: !7, file: !7, line: 197, type: !564, isLocal: true, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyCursesPanelObject*, %struct._object*)* @PyCursesPanel_move_panel, variables: !566)
!564 = !DISubroutineType(types: !565)
!565 = !{!11, !356, !11}
!566 = !{!567, !568, !569, !570}
!567 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !563, file: !7, line: 197, type: !356)
!568 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !563, file: !7, line: 197, type: !11)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg1", scope: !563, file: !7, line: 197, type: !50)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg2", scope: !563, file: !7, line: 197, type: !50)
!571 = !DISubprogram(name: "PyCursesPanel_replace_panel", scope: !7, file: !7, line: 289, type: !564, isLocal: true, isDefinition: true, scopeLine: 290, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyCursesPanelObject*, %struct._object*)* @PyCursesPanel_replace_panel, variables: !572)
!572 = !{!573, !574, !575, !576, !577, !578}
!573 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !571, file: !7, line: 289, type: !356)
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !571, file: !7, line: 289, type: !11)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "po", scope: !571, file: !7, line: 291, type: !356)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !571, file: !7, line: 292, type: !429)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rtn", scope: !571, file: !7, line: 293, type: !50)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !579, file: !7, line: 315, type: !11)
!579 = distinct !DILexicalBlock(scope: !571, file: !7, line: 315, column: 8)
!580 = !DISubprogram(name: "PyCursesPanel_set_panel_userptr", scope: !7, file: !7, line: 323, type: !564, isLocal: true, isDefinition: true, scopeLine: 324, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyCursesPanelObject*, %struct._object*)* @PyCursesPanel_set_panel_userptr, variables: !581)
!581 = !{!582, !583, !584, !585, !586, !590, !592}
!582 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !580, file: !7, line: 323, type: !356)
!583 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !580, file: !7, line: 323, type: !11)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldobj", scope: !580, file: !7, line: 325, type: !11)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !580, file: !7, line: 326, type: !50)
!586 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !587, file: !7, line: 333, type: !11)
!587 = distinct !DILexicalBlock(scope: !588, file: !7, line: 333, column: 12)
!588 = distinct !DILexicalBlock(scope: !589, file: !7, line: 331, column: 21)
!589 = distinct !DILexicalBlock(scope: !580, file: !7, line: 331, column: 9)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !591, file: !7, line: 335, type: !11)
!591 = distinct !DILexicalBlock(scope: !580, file: !7, line: 335, column: 8)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !593, file: !7, line: 335, type: !11)
!593 = distinct !DILexicalBlock(scope: !594, file: !7, line: 335, column: 98)
!594 = distinct !DILexicalBlock(scope: !591, file: !7, line: 335, column: 64)
!595 = !DISubprogram(name: "PyCursesPanel_show_panel", scope: !7, file: !7, line: 194, type: !537, isLocal: true, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyCursesPanelObject*)* @PyCursesPanel_show_panel, variables: !596)
!596 = !{!597}
!597 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !595, file: !7, line: 194, type: !356)
!598 = !DISubprogram(name: "PyCursesPanel_top_panel", scope: !7, file: !7, line: 195, type: !537, isLocal: true, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyCursesPanelObject*)* @PyCursesPanel_top_panel, variables: !599)
!599 = !{!600}
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !598, file: !7, line: 195, type: !356)
!601 = !DISubprogram(name: "PyCursesPanel_userptr", scope: !7, file: !7, line: 340, type: !537, isLocal: true, isDefinition: true, scopeLine: 341, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyCursesPanelObject*)* @PyCursesPanel_userptr, variables: !602)
!602 = !{!603, !604}
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !601, file: !7, line: 340, type: !356)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !601, file: !7, line: 342, type: !11)
!605 = !DISubprogram(name: "PyCursesPanel_window", scope: !7, file: !7, line: 282, type: !537, isLocal: true, isDefinition: true, scopeLine: 283, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyCursesPanelObject*)* @PyCursesPanel_window, variables: !606)
!606 = !{!607}
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !605, file: !7, line: 282, type: !356)
!608 = !{!609, !610, !633, !635, !636, !637, !652, !656, !660, !661}
!609 = !DIGlobalVariable(name: "PyCurses_API", scope: !0, file: !431, line: 93, type: !350, isLocal: true, isDefinition: true, variable: i8*** @PyCurses_API)
!610 = !DIGlobalVariable(name: "_curses_panelmodule", scope: !0, file: !7, line: 486, type: !611, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @_curses_panelmodule)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !612, line: 47, size: 832, align: 64, elements: !613)
!612 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!613 = !{!614, !623, !624, !625, !626, !629, !630, !631, !632}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !611, file: !612, line: 48, baseType: !615, size: 320, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !612, line: 38, baseType: !616)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !612, line: 33, size: 320, align: 64, elements: !617)
!617 = !{!618, !619, !621, !622}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !616, file: !612, line: 34, baseType: !12, size: 128, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !616, file: !612, line: 35, baseType: !620, size: 64, align: 64, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !616, file: !612, line: 36, baseType: !17, size: 64, align: 64, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !616, file: !612, line: 37, baseType: !11, size: 64, align: 64, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !611, file: !612, line: 49, baseType: !35, size: 64, align: 64, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !611, file: !612, line: 50, baseType: !35, size: 64, align: 64, offset: 384)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !611, file: !612, line: 51, baseType: !17, size: 64, align: 64, offset: 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !611, file: !612, line: 52, baseType: !627, size: 64, align: 64, offset: 512)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !287, line: 47, baseType: !286)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !611, file: !612, line: 53, baseType: !148, size: 64, align: 64, offset: 576)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !611, file: !612, line: 54, baseType: !265, size: 64, align: 64, offset: 640)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !611, file: !612, line: 55, baseType: !148, size: 64, align: 64, offset: 704)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !611, file: !612, line: 56, baseType: !335, size: 64, align: 64, offset: 768)
!633 = !DIGlobalVariable(name: "PyCurses_methods", scope: !0, file: !7, line: 475, type: !634, isLocal: true, isDefinition: true, variable: [5 x %struct.PyMethodDef]* @PyCurses_methods)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 1280, align: 64, elements: !422)
!635 = !DIGlobalVariable(name: "lop", scope: !0, file: !7, line: 112, type: !437, isLocal: true, isDefinition: true, variable: %struct._list_of_panels** @lop)
!636 = !DIGlobalVariable(name: "catchall_NULL", scope: !0, file: !431, line: 107, type: !58, isLocal: true, isDefinition: true, variable: i8** @catchall_NULL)
!637 = !DIGlobalVariable(name: "PyCursesPanel_Type_spec", scope: !0, file: !7, line: 381, type: !638, isLocal: true, isDefinition: true, variable: %struct.PyType_Spec* @PyCursesPanel_Type_spec)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyType_Spec", file: !13, line: 436, baseType: !639)
!639 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 430, size: 256, align: 64, elements: !640)
!640 = !{!641, !642, !643, !644, !645}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !639, file: !13, line: 431, baseType: !35, size: 64, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "basicsize", scope: !639, file: !13, line: 432, baseType: !50, size: 32, align: 32, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !639, file: !13, line: 433, baseType: !50, size: 32, align: 32, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !639, file: !13, line: 434, baseType: !347, size: 32, align: 32, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !639, file: !13, line: 435, baseType: !646, size: 64, align: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyType_Slot", file: !13, line: 428, baseType: !648)
!648 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 425, size: 128, align: 64, elements: !649)
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !648, file: !13, line: 426, baseType: !50, size: 32, align: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "pfunc", scope: !648, file: !13, line: 427, baseType: !4, size: 64, align: 64, offset: 64)
!652 = !DIGlobalVariable(name: "PyCursesPanel_Type_slots", scope: !0, file: !7, line: 375, type: !653, isLocal: true, isDefinition: true, variable: [3 x %struct.PyType_Slot]* @PyCursesPanel_Type_slots)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 384, align: 64, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 3)
!656 = !DIGlobalVariable(name: "PyCursesPanel_Methods", scope: !0, file: !7, line: 357, type: !657, isLocal: true, isDefinition: true, variable: [13 x %struct.PyMethodDef]* @PyCursesPanel_Methods)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 3328, align: 64, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 13)
!660 = !DIGlobalVariable(name: "catchall_ERR", scope: !0, file: !431, line: 106, type: !58, isLocal: true, isDefinition: true, variable: i8** @catchall_ERR)
!661 = !DIGlobalVariable(name: "PyCursesVersion", scope: !0, file: !7, line: 9, type: !58, isLocal: true, isDefinition: true, variable: i8** @PyCursesVersion)
!662 = !{i32 2, !"Dwarf Version", i32 4}
!663 = !{i32 2, !"Debug Info Version", i32 3}
!664 = !{i32 1, !"PIC Level", i32 2}
!665 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!666 = !DILocation(line: 501, column: 5, scope: !445)
!667 = !DIExpression()
!668 = !DILocation(line: 501, column: 15, scope: !445)
!669 = !DILocation(line: 501, column: 19, scope: !445)
!670 = !DILocation(line: 501, column: 23, scope: !445)
!671 = !DILocation(line: 504, column: 9, scope: !445)
!672 = !DILocation(line: 504, column: 7, scope: !445)
!673 = !{!674, !674, i64 0}
!674 = !{!"any pointer", !675, i64 0}
!675 = !{!"omnipotent char", !676, i64 0}
!676 = !{!"Simple C/C++ TBAA"}
!677 = !DILocation(line: 505, column: 9, scope: !678)
!678 = distinct !DILexicalBlock(scope: !445, file: !7, line: 505, column: 9)
!679 = !DILocation(line: 505, column: 11, scope: !678)
!680 = !DILocation(line: 505, column: 9, scope: !445)
!681 = !DILocation(line: 506, column: 9, scope: !678)
!682 = !DILocation(line: 507, column: 26, scope: !445)
!683 = !DILocation(line: 507, column: 9, scope: !445)
!684 = !DILocation(line: 507, column: 7, scope: !445)
!685 = !DILocation(line: 510, column: 72, scope: !445)
!686 = !DILocation(line: 510, column: 46, scope: !445)
!687 = !DILocation(line: 510, column: 28, scope: !445)
!688 = !DILocation(line: 510, column: 6, scope: !445)
!689 = !DILocation(line: 510, column: 51, scope: !445)
!690 = !DILocation(line: 510, column: 70, scope: !445)
!691 = !{!692, !674, i64 8}
!692 = !{!"", !674, i64 0, !674, i64 8}
!693 = !DILocation(line: 512, column: 50, scope: !694)
!694 = distinct !DILexicalBlock(scope: !445, file: !7, line: 512, column: 9)
!695 = !DILocation(line: 512, column: 32, scope: !694)
!696 = !DILocation(line: 512, column: 10, scope: !694)
!697 = !DILocation(line: 512, column: 55, scope: !694)
!698 = !DILocation(line: 512, column: 74, scope: !694)
!699 = !DILocation(line: 512, column: 9, scope: !445)
!700 = !DILocation(line: 513, column: 9, scope: !694)
!701 = !DILocation(line: 515, column: 29, scope: !445)
!702 = !DILocation(line: 515, column: 20, scope: !445)
!703 = !DILocation(line: 515, column: 18, scope: !445)
!704 = !DILocation(line: 516, column: 9, scope: !705)
!705 = distinct !DILexicalBlock(scope: !445, file: !7, line: 516, column: 9)
!706 = !DILocation(line: 516, column: 9, scope: !445)
!707 = !DILocation(line: 517, column: 9, scope: !705)
!708 = !DILocation(line: 520, column: 67, scope: !445)
!709 = !DILocation(line: 520, column: 46, scope: !445)
!710 = !DILocation(line: 520, column: 28, scope: !445)
!711 = !DILocation(line: 520, column: 6, scope: !445)
!712 = !DILocation(line: 520, column: 51, scope: !445)
!713 = !DILocation(line: 520, column: 65, scope: !445)
