; ModuleID = 'programs_new/Python-new/_cursesmodule.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyMethodDef = type { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }
%struct._object = type { i64, %struct._typeobject* }

!281 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!282 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!283 = !DIEnumerator(name: "THOUSEP", value: 65537)
!284 = !DIEnumerator(name: "__GROUPING", value: 65538)
!285 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!286 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!287 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!288 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!289 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!290 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!291 = !DIEnumerator(name: "__YESSTR", value: 327682)
!292 = !DIEnumerator(name: "__NOSTR", value: 327683)
!293 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!294 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!295 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!296 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!297 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!298 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!299 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!300 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!301 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!302 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!303 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!304 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!305 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!306 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!307 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!308 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!309 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!310 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!311 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!312 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!313 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!314 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!315 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!316 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!317 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!318 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!319 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!320 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!321 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!322 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!323 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!324 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!325 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!326 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!327 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!328 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!329 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!330 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!331 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!332 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!333 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!334 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!335 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!336 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!337 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!338 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!339 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!340 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!341 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!342 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!343 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!344 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!345 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!346 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!347 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!348 = !{!349, !350, !362, !397, !439, !688, !690, !374, !376, !693, !694, !758, !692, !716, !389, !715, !775, !783, !784, !787, !795, !811, !813, !707, !815, !754}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !352, line: 109, baseType: !353)
!352 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !352, line: 105, size: 128, align: 64, elements: !354)
!354 = !{!355, !363}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !353, file: !352, line: 107, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !357, line: 177, baseType: !358)
!357 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !359, line: 102, baseType: !360)
!359 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !361, line: 181, baseType: !362)
!361 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!362 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !353, file: !352, line: 108, baseType: !364, size: 64, align: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !352, line: 334, size: 3200, align: 64, elements: !366)
!366 = !{!367, !373, !377, !378, !379, !384, !447, !452, !457, !458, !463, !515, !546, !558, !564, !565, !566, !568, !570, !601, !602, !603, !612, !613, !618, !619, !621, !623, !633, !636, !654, !655, !656, !658, !660, !661, !663, !668, !673, !678, !679, !680, !681, !682, !683, !684, !685, !687}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !365, file: !352, line: 335, baseType: !368, size: 192, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !352, line: 114, baseType: !369)
!369 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 111, size: 192, align: 64, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !369, file: !352, line: 112, baseType: !351, size: 128, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !369, file: !352, line: 113, baseType: !356, size: 64, align: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !365, file: !352, line: 336, baseType: !374, size: 64, align: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !376)
!376 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !365, file: !352, line: 337, baseType: !356, size: 64, align: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !365, file: !352, line: 337, baseType: !356, size: 64, align: 64, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !365, file: !352, line: 341, baseType: !380, size: 64, align: 64, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !352, line: 308, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !350}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !365, file: !352, line: 342, baseType: !385, size: 64, align: 64, offset: 448)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !352, line: 314, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!389, !350, !390, !389}
!389 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !359, line: 48, baseType: !392)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !393, line: 246, size: 1728, align: 64, elements: !394)
!393 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!394 = !{!395, !396, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !416, !417, !418, !419, !421, !423, !425, !429, !432, !434, !435, !436, !437, !438, !442, !443}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !392, file: !393, line: 247, baseType: !389, size: 32, align: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !392, file: !393, line: 252, baseType: !397, size: 64, align: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !392, file: !393, line: 253, baseType: !397, size: 64, align: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !392, file: !393, line: 254, baseType: !397, size: 64, align: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !392, file: !393, line: 255, baseType: !397, size: 64, align: 64, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !392, file: !393, line: 256, baseType: !397, size: 64, align: 64, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !392, file: !393, line: 257, baseType: !397, size: 64, align: 64, offset: 384)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !392, file: !393, line: 258, baseType: !397, size: 64, align: 64, offset: 448)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !392, file: !393, line: 259, baseType: !397, size: 64, align: 64, offset: 512)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !392, file: !393, line: 261, baseType: !397, size: 64, align: 64, offset: 576)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !392, file: !393, line: 262, baseType: !397, size: 64, align: 64, offset: 640)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !392, file: !393, line: 263, baseType: !397, size: 64, align: 64, offset: 704)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !392, file: !393, line: 265, baseType: !409, size: 64, align: 64, offset: 768)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !393, line: 161, size: 192, align: 64, elements: !411)
!411 = !{!412, !413, !415}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !410, file: !393, line: 162, baseType: !409, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !410, file: !393, line: 163, baseType: !414, size: 64, align: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !410, file: !393, line: 167, baseType: !389, size: 32, align: 32, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !392, file: !393, line: 267, baseType: !414, size: 64, align: 64, offset: 832)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !392, file: !393, line: 269, baseType: !389, size: 32, align: 32, offset: 896)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !392, file: !393, line: 273, baseType: !389, size: 32, align: 32, offset: 928)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !392, file: !393, line: 275, baseType: !420, size: 64, align: 64, offset: 960)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !361, line: 140, baseType: !362)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !392, file: !393, line: 279, baseType: !422, size: 16, align: 16, offset: 1024)
!422 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !392, file: !393, line: 280, baseType: !424, size: 8, align: 8, offset: 1040)
!424 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !392, file: !393, line: 281, baseType: !426, size: 8, align: 8, offset: 1048)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 8, align: 8, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 1)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !392, file: !393, line: 285, baseType: !430, size: 64, align: 64, offset: 1088)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !393, line: 155, baseType: null)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !392, file: !393, line: 294, baseType: !433, size: 64, align: 64, offset: 1152)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !361, line: 141, baseType: !362)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !392, file: !393, line: 303, baseType: !349, size: 64, align: 64, offset: 1216)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !392, file: !393, line: 304, baseType: !349, size: 64, align: 64, offset: 1280)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !392, file: !393, line: 305, baseType: !349, size: 64, align: 64, offset: 1344)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !392, file: !393, line: 306, baseType: !349, size: 64, align: 64, offset: 1408)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !392, file: !393, line: 307, baseType: !439, size: 64, align: 64, offset: 1472)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !440, line: 62, baseType: !441)
!440 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!441 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !392, file: !393, line: 309, baseType: !389, size: 32, align: 32, offset: 1536)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !392, file: !393, line: 311, baseType: !444, size: 160, align: 8, offset: 1568)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 160, align: 8, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 20)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !365, file: !352, line: 343, baseType: !448, size: 64, align: 64, offset: 512)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !352, line: 316, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!350, !350, !397}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !365, file: !352, line: 344, baseType: !453, size: 64, align: 64, offset: 576)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !352, line: 318, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!389, !350, !397, !350}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !365, file: !352, line: 345, baseType: !349, size: 64, align: 64, offset: 640)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !365, file: !352, line: 346, baseType: !459, size: 64, align: 64, offset: 704)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !352, line: 320, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{!350, !350}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !365, file: !352, line: 350, baseType: !464, size: 64, align: 64, offset: 768)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !352, line: 278, baseType: !466)
!466 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 236, size: 2176, align: 64, elements: !467)
!467 = !{!468, !473, !474, !475, !476, !477, !482, !484, !485, !486, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !466, file: !352, line: 241, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !352, line: 166, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!350, !350, !350}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !466, file: !352, line: 242, baseType: !469, size: 64, align: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !466, file: !352, line: 243, baseType: !469, size: 64, align: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !466, file: !352, line: 244, baseType: !469, size: 64, align: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !466, file: !352, line: 245, baseType: !469, size: 64, align: 64, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !466, file: !352, line: 246, baseType: !478, size: 64, align: 64, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !352, line: 167, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{!350, !350, !350, !350}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !466, file: !352, line: 247, baseType: !483, size: 64, align: 64, offset: 384)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !352, line: 165, baseType: !460)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !466, file: !352, line: 248, baseType: !483, size: 64, align: 64, offset: 448)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !466, file: !352, line: 249, baseType: !483, size: 64, align: 64, offset: 512)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !466, file: !352, line: 250, baseType: !487, size: 64, align: 64, offset: 576)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !352, line: 168, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!389, !350}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !466, file: !352, line: 251, baseType: !483, size: 64, align: 64, offset: 640)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !466, file: !352, line: 252, baseType: !469, size: 64, align: 64, offset: 704)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !466, file: !352, line: 253, baseType: !469, size: 64, align: 64, offset: 768)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !466, file: !352, line: 254, baseType: !469, size: 64, align: 64, offset: 832)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !466, file: !352, line: 255, baseType: !469, size: 64, align: 64, offset: 896)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !466, file: !352, line: 256, baseType: !469, size: 64, align: 64, offset: 960)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !466, file: !352, line: 257, baseType: !483, size: 64, align: 64, offset: 1024)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !466, file: !352, line: 258, baseType: !349, size: 64, align: 64, offset: 1088)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !466, file: !352, line: 259, baseType: !483, size: 64, align: 64, offset: 1152)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !466, file: !352, line: 261, baseType: !469, size: 64, align: 64, offset: 1216)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !466, file: !352, line: 262, baseType: !469, size: 64, align: 64, offset: 1280)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !466, file: !352, line: 263, baseType: !469, size: 64, align: 64, offset: 1344)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !466, file: !352, line: 264, baseType: !469, size: 64, align: 64, offset: 1408)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !466, file: !352, line: 265, baseType: !478, size: 64, align: 64, offset: 1472)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !466, file: !352, line: 266, baseType: !469, size: 64, align: 64, offset: 1536)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !466, file: !352, line: 267, baseType: !469, size: 64, align: 64, offset: 1600)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !466, file: !352, line: 268, baseType: !469, size: 64, align: 64, offset: 1664)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !466, file: !352, line: 269, baseType: !469, size: 64, align: 64, offset: 1728)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !466, file: !352, line: 270, baseType: !469, size: 64, align: 64, offset: 1792)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !466, file: !352, line: 272, baseType: !469, size: 64, align: 64, offset: 1856)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !466, file: !352, line: 273, baseType: !469, size: 64, align: 64, offset: 1920)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !466, file: !352, line: 274, baseType: !469, size: 64, align: 64, offset: 1984)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !466, file: !352, line: 275, baseType: !469, size: 64, align: 64, offset: 2048)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !466, file: !352, line: 277, baseType: !483, size: 64, align: 64, offset: 2112)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !365, file: !352, line: 351, baseType: !516, size: 64, align: 64, offset: 832)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !352, line: 292, baseType: !518)
!518 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 280, size: 640, align: 64, elements: !519)
!519 = !{!520, !525, !526, !531, !532, !533, !538, !539, !544, !545}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !518, file: !352, line: 281, baseType: !521, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !352, line: 169, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64, align: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!356, !350}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !518, file: !352, line: 282, baseType: !469, size: 64, align: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !518, file: !352, line: 283, baseType: !527, size: 64, align: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !352, line: 170, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!350, !350, !356}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !518, file: !352, line: 284, baseType: !527, size: 64, align: 64, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !518, file: !352, line: 285, baseType: !349, size: 64, align: 64, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !518, file: !352, line: 286, baseType: !534, size: 64, align: 64, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !352, line: 172, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!389, !350, !356, !350}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !518, file: !352, line: 287, baseType: !349, size: 64, align: 64, offset: 384)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !518, file: !352, line: 288, baseType: !540, size: 64, align: 64, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !352, line: 231, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!389, !350, !350}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !518, file: !352, line: 290, baseType: !469, size: 64, align: 64, offset: 512)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !518, file: !352, line: 291, baseType: !527, size: 64, align: 64, offset: 576)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !365, file: !352, line: 352, baseType: !547, size: 64, align: 64, offset: 896)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !352, line: 298, baseType: !549)
!549 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 294, size: 192, align: 64, elements: !550)
!550 = !{!551, !552, !553}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !549, file: !352, line: 295, baseType: !521, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !549, file: !352, line: 296, baseType: !469, size: 64, align: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !549, file: !352, line: 297, baseType: !554, size: 64, align: 64, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !352, line: 174, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!389, !350, !350, !350}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !365, file: !352, line: 356, baseType: !559, size: 64, align: 64, offset: 960)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !352, line: 321, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64, align: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!563, !350}
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !357, line: 186, baseType: !356)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !365, file: !352, line: 357, baseType: !478, size: 64, align: 64, offset: 1024)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !365, file: !352, line: 358, baseType: !459, size: 64, align: 64, offset: 1088)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !365, file: !352, line: 359, baseType: !567, size: 64, align: 64, offset: 1152)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !352, line: 317, baseType: !470)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !365, file: !352, line: 360, baseType: !569, size: 64, align: 64, offset: 1216)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !352, line: 319, baseType: !555)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !365, file: !352, line: 363, baseType: !571, size: 64, align: 64, offset: 1280)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !352, line: 304, baseType: !573)
!573 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 301, size: 128, align: 64, elements: !574)
!574 = !{!575, !596}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !573, file: !352, line: 302, baseType: !576, size: 64, align: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !352, line: 193, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64, align: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!389, !350, !580, !389}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !352, line: 191, baseType: !582)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !352, line: 178, size: 640, align: 64, elements: !583)
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !593, !594, !595}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !582, file: !352, line: 179, baseType: !349, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !582, file: !352, line: 180, baseType: !350, size: 64, align: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !582, file: !352, line: 181, baseType: !356, size: 64, align: 64, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !582, file: !352, line: 182, baseType: !356, size: 64, align: 64, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !582, file: !352, line: 184, baseType: !389, size: 32, align: 32, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !582, file: !352, line: 185, baseType: !389, size: 32, align: 32, offset: 288)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !582, file: !352, line: 186, baseType: !397, size: 64, align: 64, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !582, file: !352, line: 187, baseType: !592, size: 64, align: 64, offset: 384)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !582, file: !352, line: 188, baseType: !592, size: 64, align: 64, offset: 448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !582, file: !352, line: 189, baseType: !592, size: 64, align: 64, offset: 512)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !582, file: !352, line: 190, baseType: !349, size: 64, align: 64, offset: 576)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !573, file: !352, line: 303, baseType: !597, size: 64, align: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !352, line: 194, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64, align: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{null, !350, !580}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !365, file: !352, line: 366, baseType: !441, size: 64, align: 64, offset: 1344)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !365, file: !352, line: 368, baseType: !374, size: 64, align: 64, offset: 1408)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !365, file: !352, line: 372, baseType: !604, size: 64, align: 64, offset: 1472)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !352, line: 233, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64, align: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!389, !350, !608, !349}
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !352, line: 232, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64, align: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!389, !350, !349}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !365, file: !352, line: 375, baseType: !487, size: 64, align: 64, offset: 1536)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !365, file: !352, line: 379, baseType: !614, size: 64, align: 64, offset: 1600)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !352, line: 322, baseType: !615)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64, align: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!350, !350, !350, !389}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !365, file: !352, line: 382, baseType: !356, size: 64, align: 64, offset: 1664)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !365, file: !352, line: 385, baseType: !620, size: 64, align: 64, offset: 1728)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !352, line: 323, baseType: !460)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !365, file: !352, line: 386, baseType: !622, size: 64, align: 64, offset: 1792)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !352, line: 324, baseType: !460)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !365, file: !352, line: 389, baseType: !624, size: 64, align: 64, offset: 1856)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64, align: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !626, line: 40, size: 256, align: 64, elements: !627)
!626 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!627 = !{!628, !629, !631, !632}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !625, file: !626, line: 41, baseType: !374, size: 64, align: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !625, file: !626, line: 42, baseType: !630, size: 64, align: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !626, line: 18, baseType: !470)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !625, file: !626, line: 43, baseType: !389, size: 32, align: 32, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !625, file: !626, line: 45, baseType: !374, size: 64, align: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !365, file: !352, line: 390, baseType: !634, size: 64, align: 64, offset: 1920)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64, align: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !352, line: 390, flags: DIFlagFwdDecl)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !365, file: !352, line: 391, baseType: !637, size: 64, align: 64, offset: 1984)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64, align: 64)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !639, line: 11, size: 320, align: 64, elements: !640)
!639 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!640 = !{!641, !642, !647, !652, !653}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !638, file: !639, line: 12, baseType: !397, size: 64, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !638, file: !639, line: 13, baseType: !643, size: 64, align: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !639, line: 8, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64, align: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!350, !350, !349}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !638, file: !639, line: 14, baseType: !648, size: 64, align: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !639, line: 9, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64, align: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!389, !350, !350, !349}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !638, file: !639, line: 15, baseType: !397, size: 64, align: 64, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !638, file: !639, line: 16, baseType: !349, size: 64, align: 64, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !365, file: !352, line: 392, baseType: !364, size: 64, align: 64, offset: 2048)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !365, file: !352, line: 393, baseType: !350, size: 64, align: 64, offset: 2112)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !365, file: !352, line: 394, baseType: !657, size: 64, align: 64, offset: 2176)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !352, line: 325, baseType: !479)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !365, file: !352, line: 395, baseType: !659, size: 64, align: 64, offset: 2240)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !352, line: 326, baseType: !555)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !365, file: !352, line: 396, baseType: !356, size: 64, align: 64, offset: 2304)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !365, file: !352, line: 397, baseType: !662, size: 64, align: 64, offset: 2368)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !352, line: 327, baseType: !555)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !365, file: !352, line: 398, baseType: !664, size: 64, align: 64, offset: 2432)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !352, line: 329, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!350, !364, !356}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !365, file: !352, line: 399, baseType: !669, size: 64, align: 64, offset: 2496)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !352, line: 328, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64, align: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!350, !364, !350, !350}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !365, file: !352, line: 400, baseType: !674, size: 64, align: 64, offset: 2560)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !352, line: 307, baseType: !675)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64, align: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !349}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !365, file: !352, line: 401, baseType: !487, size: 64, align: 64, offset: 2624)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !365, file: !352, line: 402, baseType: !350, size: 64, align: 64, offset: 2688)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !365, file: !352, line: 403, baseType: !350, size: 64, align: 64, offset: 2752)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !365, file: !352, line: 404, baseType: !350, size: 64, align: 64, offset: 2816)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !365, file: !352, line: 405, baseType: !350, size: 64, align: 64, offset: 2880)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !365, file: !352, line: 406, baseType: !350, size: 64, align: 64, offset: 2944)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !365, file: !352, line: 407, baseType: !380, size: 64, align: 64, offset: 3008)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !365, file: !352, line: 410, baseType: !686, size: 32, align: 32, offset: 3072)
!686 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !365, file: !352, line: 412, baseType: !380, size: 64, align: 64, offset: 3136)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !692)
!692 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCursesWindowObject", file: !696, line: 80, baseType: !697)
!696 = !DIFile(filename: "./Include/py_curses.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!697 = !DICompositeType(tag: DW_TAG_structure_type, file: !696, line: 76, size: 256, align: 64, elements: !698)
!698 = !{!699, !700, !757}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !697, file: !696, line: 77, baseType: !351, size: 128, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !697, file: !696, line: 78, baseType: !701, size: 64, align: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64, align: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "WINDOW", file: !703, line: 354, baseType: !704)
!703 = !DIFile(filename: "/usr/include/ncursesw/ncurses.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "_win_st", file: !703, line: 403, size: 1024, align: 64, elements: !705)
!705 = !{!706, !708, !709, !710, !711, !712, !713, !714, !717, !718, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !732, !733, !734, !735, !736, !737, !746, !747}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_cury", scope: !704, file: !703, line: 405, baseType: !707, size: 16, align: 16)
!707 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "_curx", scope: !704, file: !703, line: 405, baseType: !707, size: 16, align: 16, offset: 16)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_maxy", scope: !704, file: !703, line: 408, baseType: !707, size: 16, align: 16, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "_maxx", scope: !704, file: !703, line: 408, baseType: !707, size: 16, align: 16, offset: 48)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_begy", scope: !704, file: !703, line: 409, baseType: !707, size: 16, align: 16, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "_begx", scope: !704, file: !703, line: 409, baseType: !707, size: 16, align: 16, offset: 80)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !704, file: !703, line: 411, baseType: !707, size: 16, align: 16, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_attrs", scope: !704, file: !703, line: 414, baseType: !715, size: 64, align: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "attr_t", file: !703, line: 356, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "chtype", file: !703, line: 150, baseType: !441)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_bkgd", scope: !704, file: !703, line: 415, baseType: !716, size: 64, align: 64, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_notimeout", scope: !704, file: !703, line: 418, baseType: !719, size: 8, align: 8, offset: 256)
!719 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_clear", scope: !704, file: !703, line: 419, baseType: !719, size: 8, align: 8, offset: 264)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_leaveok", scope: !704, file: !703, line: 420, baseType: !719, size: 8, align: 8, offset: 272)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_scroll", scope: !704, file: !703, line: 421, baseType: !719, size: 8, align: 8, offset: 280)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_idlok", scope: !704, file: !703, line: 422, baseType: !719, size: 8, align: 8, offset: 288)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_idcok", scope: !704, file: !703, line: 423, baseType: !719, size: 8, align: 8, offset: 296)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_immed", scope: !704, file: !703, line: 424, baseType: !719, size: 8, align: 8, offset: 304)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_sync", scope: !704, file: !703, line: 425, baseType: !719, size: 8, align: 8, offset: 312)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_use_keypad", scope: !704, file: !703, line: 426, baseType: !719, size: 8, align: 8, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_delay", scope: !704, file: !703, line: 427, baseType: !389, size: 32, align: 32, offset: 352)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "_line", scope: !704, file: !703, line: 429, baseType: !730, size: 64, align: 64, offset: 384)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64, align: 64)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldat", file: !703, line: 401, flags: DIFlagFwdDecl)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_regtop", scope: !704, file: !703, line: 432, baseType: !707, size: 16, align: 16, offset: 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_regbottom", scope: !704, file: !703, line: 433, baseType: !707, size: 16, align: 16, offset: 464)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_parx", scope: !704, file: !703, line: 436, baseType: !389, size: 32, align: 32, offset: 480)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_pary", scope: !704, file: !703, line: 437, baseType: !389, size: 32, align: 32, offset: 512)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_parent", scope: !704, file: !703, line: 438, baseType: !701, size: 64, align: 64, offset: 576)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !704, file: !703, line: 446, baseType: !738, size: 96, align: 16, offset: 640)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "pdat", file: !703, line: 441, size: 96, align: 16, elements: !739)
!739 = !{!740, !741, !742, !743, !744, !745}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_y", scope: !738, file: !703, line: 443, baseType: !707, size: 16, align: 16)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_x", scope: !738, file: !703, line: 443, baseType: !707, size: 16, align: 16, offset: 16)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_top", scope: !738, file: !703, line: 444, baseType: !707, size: 16, align: 16, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_left", scope: !738, file: !703, line: 444, baseType: !707, size: 16, align: 16, offset: 48)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_bottom", scope: !738, file: !703, line: 445, baseType: !707, size: 16, align: 16, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_pad_right", scope: !738, file: !703, line: 445, baseType: !707, size: 16, align: 16, offset: 80)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_yoffset", scope: !704, file: !703, line: 448, baseType: !707, size: 16, align: 16, offset: 736)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_bkgrnd", scope: !704, file: !703, line: 451, baseType: !748, size: 256, align: 64, offset: 768)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "cchar_t", file: !703, line: 396, baseType: !749)
!749 = !DICompositeType(tag: DW_TAG_structure_type, file: !703, line: 386, size: 256, align: 64, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !749, file: !703, line: 388, baseType: !715, size: 64, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "chars", scope: !749, file: !703, line: 389, baseType: !753, size: 160, align: 32, offset: 64)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !754, size: 160, align: 32, elements: !755)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !440, line: 90, baseType: !389)
!755 = !{!756}
!756 = !DISubrange(count: 5)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !697, file: !696, line: 79, baseType: !397, size: 64, align: 64, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !760)
!760 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !761)
!761 = !{!762, !763, !764, !765, !773}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !760, file: !4, line: 291, baseType: !351, size: 128, align: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !760, file: !4, line: 292, baseType: !356, size: 64, align: 64, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !760, file: !4, line: 293, baseType: !563, size: 64, align: 64, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !760, file: !4, line: 349, baseType: !766, size: 32, align: 32, offset: 256)
!766 = !DICompositeType(tag: DW_TAG_structure_type, scope: !760, file: !4, line: 294, size: 32, align: 32, elements: !767)
!767 = !{!768, !769, !770, !771, !772}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !766, file: !4, line: 303, baseType: !686, size: 2, align: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !766, file: !4, line: 331, baseType: !686, size: 3, align: 32, offset: 2)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !766, file: !4, line: 336, baseType: !686, size: 1, align: 32, offset: 5)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !766, file: !4, line: 340, baseType: !686, size: 1, align: 32, offset: 6)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !766, file: !4, line: 345, baseType: !686, size: 1, align: 32, offset: 7)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !760, file: !4, line: 350, baseType: !774, size: 64, align: 64, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64, align: 64)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !777, line: 41, baseType: !778)
!777 = !DIFile(filename: "./Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!778 = !DICompositeType(tag: DW_TAG_structure_type, file: !777, line: 31, size: 320, align: 64, elements: !779)
!779 = !{!780, !781, !782}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !778, file: !777, line: 32, baseType: !368, size: 192, align: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !778, file: !777, line: 33, baseType: !563, size: 64, align: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !778, file: !777, line: 34, baseType: !426, size: 8, align: 8, offset: 256)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !686)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64, align: 64)
!785 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !786)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !692)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64, align: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !789)
!789 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !790)
!790 = !{!791, !792, !793, !794}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !789, file: !4, line: 357, baseType: !759, size: 384, align: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !789, file: !4, line: 358, baseType: !356, size: 64, align: 64, offset: 384)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !789, file: !4, line: 360, baseType: !397, size: 64, align: 64, offset: 448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !789, file: !4, line: 361, baseType: !356, size: 64, align: 64, offset: 512)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64, align: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !797)
!797 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !797, file: !4, line: 369, baseType: !788, size: 576, align: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !797, file: !4, line: 375, baseType: !801, size: 64, align: 64, offset: 576)
!801 = !DICompositeType(tag: DW_TAG_union_type, scope: !797, file: !4, line: 370, size: 64, align: 64, elements: !802)
!802 = !{!803, !804, !806, !809}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !801, file: !4, line: 371, baseType: !349, size: 64, align: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !801, file: !4, line: 372, baseType: !805, size: 64, align: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64, align: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !801, file: !4, line: 373, baseType: !807, size: 64, align: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64, align: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !422)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !801, file: !4, line: 374, baseType: !810, size: 64, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64, align: 64)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64, align: 64)
!812 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !808)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64, align: 64)
!814 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !783)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!816 = !{!817, !1190, !1195, !1208, !1227, !1247, !1253, !1276, !1286, !1308, !1313, !1318, !1323, !1331, !1351, !1363, !1371, !1382, !1388, !1393, !1398, !1401, !1404, !1407, !1414, !1418, !1427, !1441, !1449, !1455, !1459, !1464, !1467, !1537, !1553, !1567, !1572, !1577, !1598, !1603, !1615, !1620, !1625, !1630, !1637, !1649, !1654, !1658, !1681, !1703, !1712, !1718, !1721, !1726, !1731, !1737, !1743, !1749, !1754, !1759, !1778, !1791, !1804, !1823, !1829, !1833, !1852, !1858, !1863, !1868, !1874, !1877, !1880, !1889, !1892, !1897, !1900, !1905, !1912, !1916, !1920, !1932, !1938, !1948, !1952, !1953, !1954, !1957, !1960, !1963, !1968, !1976, !1981, !1987, !1990, !1993, !1998, !2001, !2006, !2009, !2013, !2016, !2019, !2022, !2036, !2041, !2046, !2067, !2070, !2073, !2076, !2081, !2086, !2094, !2101, !2376, !2381, !2384, !2391, !2397, !2401, !2404, !2409, !2414, !2421, !2426, !2433, !2442, !2447, !2450, !2453, !2456, !2459, !2462, !2469, !2474, !2479, !2484, !2489, !2492, !2495, !2498, !2505, !2547, !2554, !2557, !2563, !2577, !2589, !2592, !2595, !2600, !2605, !2610, !2625, !2630, !2636, !2642, !2648, !2661, !2666}
!817 = !DISubprogram(name: "PyInit__curses", scope: !818, file: !818, line: 3360, type: !819, isLocal: false, isDefinition: true, scopeLine: 3361, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__curses, variables: !821)
!818 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_cursesmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!819 = !DISubroutineType(types: !820)
!820 = !{!350}
!821 = !{!822, !823, !824, !825, !826, !828, !830, !832, !836, !838, !842, !844, !848, !850, !854, !856, !860, !862, !866, !868, !872, !874, !878, !880, !884, !886, !890, !892, !896, !898, !902, !904, !908, !910, !914, !916, !920, !922, !926, !928, !932, !934, !938, !940, !944, !946, !950, !952, !956, !958, !962, !964, !968, !970, !974, !976, !980, !982, !986, !988, !992, !994, !998, !1000, !1004, !1006, !1010, !1012, !1016, !1018, !1022, !1024, !1028, !1030, !1034, !1036, !1040, !1042, !1046, !1048, !1052, !1054, !1058, !1060, !1064, !1066, !1070, !1072, !1076, !1078, !1082, !1084, !1088, !1090, !1094, !1096, !1100, !1102, !1106, !1108, !1112, !1114, !1118, !1120, !1124, !1126, !1130, !1132, !1136, !1138, !1142, !1144, !1148, !1150, !1154, !1156, !1157, !1158, !1164, !1165, !1167, !1168, !1171, !1172, !1174, !1178, !1180, !1184, !1186}
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !817, file: !818, line: 3362, type: !350)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !817, file: !818, line: 3362, type: !350)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !817, file: !818, line: 3362, type: !350)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c_api_object", scope: !817, file: !818, line: 3362, type: !350)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !827, file: !818, line: 3389, type: !350)
!827 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3389, column: 8)
!828 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !829, file: !818, line: 3399, type: !350)
!829 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3399, column: 8)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !831, file: !818, line: 3401, type: !350)
!831 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3401, column: 8)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !833, file: !818, line: 3401, type: !350)
!833 = distinct !DILexicalBlock(scope: !834, file: !818, line: 3401, column: 116)
!834 = distinct !DILexicalBlock(scope: !835, file: !818, line: 3401, column: 111)
!835 = distinct !DILexicalBlock(scope: !831, file: !818, line: 3401, column: 60)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !837, file: !818, line: 3402, type: !350)
!837 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3402, column: 8)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !839, file: !818, line: 3402, type: !350)
!839 = distinct !DILexicalBlock(scope: !840, file: !818, line: 3402, column: 114)
!840 = distinct !DILexicalBlock(scope: !841, file: !818, line: 3402, column: 109)
!841 = distinct !DILexicalBlock(scope: !837, file: !818, line: 3402, column: 59)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !843, file: !818, line: 3406, type: !350)
!843 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3406, column: 8)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !845, file: !818, line: 3406, type: !350)
!845 = distinct !DILexicalBlock(scope: !846, file: !818, line: 3406, column: 150)
!846 = distinct !DILexicalBlock(scope: !847, file: !818, line: 3406, column: 145)
!847 = distinct !DILexicalBlock(scope: !843, file: !818, line: 3406, column: 85)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !849, file: !818, line: 3407, type: !350)
!849 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3407, column: 8)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !851, file: !818, line: 3407, type: !350)
!851 = distinct !DILexicalBlock(scope: !852, file: !818, line: 3407, column: 128)
!852 = distinct !DILexicalBlock(scope: !853, file: !818, line: 3407, column: 123)
!853 = distinct !DILexicalBlock(scope: !849, file: !818, line: 3407, column: 67)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !855, file: !818, line: 3408, type: !350)
!855 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3408, column: 8)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !857, file: !818, line: 3408, type: !350)
!857 = distinct !DILexicalBlock(scope: !858, file: !818, line: 3408, column: 139)
!858 = distinct !DILexicalBlock(scope: !859, file: !818, line: 3408, column: 134)
!859 = distinct !DILexicalBlock(scope: !855, file: !818, line: 3408, column: 76)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !861, file: !818, line: 3409, type: !350)
!861 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3409, column: 8)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !863, file: !818, line: 3409, type: !350)
!863 = distinct !DILexicalBlock(scope: !864, file: !818, line: 3409, column: 140)
!864 = distinct !DILexicalBlock(scope: !865, file: !818, line: 3409, column: 135)
!865 = distinct !DILexicalBlock(scope: !861, file: !818, line: 3409, column: 76)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !867, file: !818, line: 3410, type: !350)
!867 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3410, column: 8)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !869, file: !818, line: 3410, type: !350)
!869 = distinct !DILexicalBlock(scope: !870, file: !818, line: 3410, column: 139)
!870 = distinct !DILexicalBlock(scope: !871, file: !818, line: 3410, column: 134)
!871 = distinct !DILexicalBlock(scope: !867, file: !818, line: 3410, column: 77)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !873, file: !818, line: 3411, type: !350)
!873 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3411, column: 8)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !875, file: !818, line: 3411, type: !350)
!875 = distinct !DILexicalBlock(scope: !876, file: !818, line: 3411, column: 137)
!876 = distinct !DILexicalBlock(scope: !877, file: !818, line: 3411, column: 132)
!877 = distinct !DILexicalBlock(scope: !873, file: !818, line: 3411, column: 77)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !879, file: !818, line: 3412, type: !350)
!879 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3412, column: 8)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !881, file: !818, line: 3412, type: !350)
!881 = distinct !DILexicalBlock(scope: !882, file: !818, line: 3412, column: 135)
!882 = distinct !DILexicalBlock(scope: !883, file: !818, line: 3412, column: 130)
!883 = distinct !DILexicalBlock(scope: !879, file: !818, line: 3412, column: 77)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !885, file: !818, line: 3413, type: !350)
!885 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3413, column: 8)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !887, file: !818, line: 3413, type: !350)
!887 = distinct !DILexicalBlock(scope: !888, file: !818, line: 3413, column: 136)
!888 = distinct !DILexicalBlock(scope: !889, file: !818, line: 3413, column: 131)
!889 = distinct !DILexicalBlock(scope: !885, file: !818, line: 3413, column: 77)
!890 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !891, file: !818, line: 3414, type: !350)
!891 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3414, column: 8)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !893, file: !818, line: 3414, type: !350)
!893 = distinct !DILexicalBlock(scope: !894, file: !818, line: 3414, column: 142)
!894 = distinct !DILexicalBlock(scope: !895, file: !818, line: 3414, column: 137)
!895 = distinct !DILexicalBlock(scope: !891, file: !818, line: 3414, column: 77)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !897, file: !818, line: 3416, type: !350)
!897 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3416, column: 8)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !899, file: !818, line: 3416, type: !350)
!899 = distinct !DILexicalBlock(scope: !900, file: !818, line: 3416, column: 137)
!900 = distinct !DILexicalBlock(scope: !901, file: !818, line: 3416, column: 132)
!901 = distinct !DILexicalBlock(scope: !897, file: !818, line: 3416, column: 77)
!902 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !903, file: !818, line: 3418, type: !350)
!903 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3418, column: 8)
!904 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !905, file: !818, line: 3418, type: !350)
!905 = distinct !DILexicalBlock(scope: !906, file: !818, line: 3418, column: 139)
!906 = distinct !DILexicalBlock(scope: !907, file: !818, line: 3418, column: 134)
!907 = distinct !DILexicalBlock(scope: !903, file: !818, line: 3418, column: 77)
!908 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !909, file: !818, line: 3419, type: !350)
!909 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3419, column: 8)
!910 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !911, file: !818, line: 3419, type: !350)
!911 = distinct !DILexicalBlock(scope: !912, file: !818, line: 3419, column: 147)
!912 = distinct !DILexicalBlock(scope: !913, file: !818, line: 3419, column: 142)
!913 = distinct !DILexicalBlock(scope: !909, file: !818, line: 3419, column: 84)
!914 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !915, file: !818, line: 3420, type: !350)
!915 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3420, column: 8)
!916 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !917, file: !818, line: 3420, type: !350)
!917 = distinct !DILexicalBlock(scope: !918, file: !818, line: 3420, column: 151)
!918 = distinct !DILexicalBlock(scope: !919, file: !818, line: 3420, column: 146)
!919 = distinct !DILexicalBlock(scope: !915, file: !818, line: 3420, column: 91)
!920 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !921, file: !818, line: 3424, type: !350)
!921 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3424, column: 8)
!922 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !923, file: !818, line: 3424, type: !350)
!923 = distinct !DILexicalBlock(scope: !924, file: !818, line: 3424, column: 142)
!924 = distinct !DILexicalBlock(scope: !925, file: !818, line: 3424, column: 137)
!925 = distinct !DILexicalBlock(scope: !921, file: !818, line: 3424, column: 77)
!926 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !927, file: !818, line: 3427, type: !350)
!927 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3427, column: 8)
!928 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !929, file: !818, line: 3427, type: !350)
!929 = distinct !DILexicalBlock(scope: !930, file: !818, line: 3427, column: 136)
!930 = distinct !DILexicalBlock(scope: !931, file: !818, line: 3427, column: 131)
!931 = distinct !DILexicalBlock(scope: !927, file: !818, line: 3427, column: 77)
!932 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !933, file: !818, line: 3430, type: !350)
!933 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3430, column: 8)
!934 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !935, file: !818, line: 3430, type: !350)
!935 = distinct !DILexicalBlock(scope: !936, file: !818, line: 3430, column: 135)
!936 = distinct !DILexicalBlock(scope: !937, file: !818, line: 3430, column: 130)
!937 = distinct !DILexicalBlock(scope: !933, file: !818, line: 3430, column: 77)
!938 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !939, file: !818, line: 3433, type: !350)
!939 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3433, column: 8)
!940 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !941, file: !818, line: 3433, type: !350)
!941 = distinct !DILexicalBlock(scope: !942, file: !818, line: 3433, column: 137)
!942 = distinct !DILexicalBlock(scope: !943, file: !818, line: 3433, column: 132)
!943 = distinct !DILexicalBlock(scope: !939, file: !818, line: 3433, column: 77)
!944 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !945, file: !818, line: 3436, type: !350)
!945 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3436, column: 8)
!946 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !947, file: !818, line: 3436, type: !350)
!947 = distinct !DILexicalBlock(scope: !948, file: !818, line: 3436, column: 135)
!948 = distinct !DILexicalBlock(scope: !949, file: !818, line: 3436, column: 130)
!949 = distinct !DILexicalBlock(scope: !945, file: !818, line: 3436, column: 77)
!950 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !951, file: !818, line: 3439, type: !350)
!951 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3439, column: 8)
!952 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !953, file: !818, line: 3439, type: !350)
!953 = distinct !DILexicalBlock(scope: !954, file: !818, line: 3439, column: 140)
!954 = distinct !DILexicalBlock(scope: !955, file: !818, line: 3439, column: 135)
!955 = distinct !DILexicalBlock(scope: !951, file: !818, line: 3439, column: 77)
!956 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !957, file: !818, line: 3442, type: !350)
!957 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3442, column: 8)
!958 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !959, file: !818, line: 3442, type: !350)
!959 = distinct !DILexicalBlock(scope: !960, file: !818, line: 3442, column: 121)
!960 = distinct !DILexicalBlock(scope: !961, file: !818, line: 3442, column: 116)
!961 = distinct !DILexicalBlock(scope: !957, file: !818, line: 3442, column: 57)
!962 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !963, file: !818, line: 3443, type: !350)
!963 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3443, column: 8)
!964 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !965, file: !818, line: 3443, type: !350)
!965 = distinct !DILexicalBlock(scope: !966, file: !818, line: 3443, column: 119)
!966 = distinct !DILexicalBlock(scope: !967, file: !818, line: 3443, column: 114)
!967 = distinct !DILexicalBlock(scope: !963, file: !818, line: 3443, column: 57)
!968 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !969, file: !818, line: 3444, type: !350)
!969 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3444, column: 8)
!970 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !971, file: !818, line: 3444, type: !350)
!971 = distinct !DILexicalBlock(scope: !972, file: !818, line: 3444, column: 121)
!972 = distinct !DILexicalBlock(scope: !973, file: !818, line: 3444, column: 116)
!973 = distinct !DILexicalBlock(scope: !969, file: !818, line: 3444, column: 57)
!974 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !975, file: !818, line: 3445, type: !350)
!975 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3445, column: 8)
!976 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !977, file: !818, line: 3445, type: !350)
!977 = distinct !DILexicalBlock(scope: !978, file: !818, line: 3445, column: 122)
!978 = distinct !DILexicalBlock(scope: !979, file: !818, line: 3445, column: 117)
!979 = distinct !DILexicalBlock(scope: !975, file: !818, line: 3445, column: 57)
!980 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !981, file: !818, line: 3446, type: !350)
!981 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3446, column: 8)
!982 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !983, file: !818, line: 3446, type: !350)
!983 = distinct !DILexicalBlock(scope: !984, file: !818, line: 3446, column: 120)
!984 = distinct !DILexicalBlock(scope: !985, file: !818, line: 3446, column: 115)
!985 = distinct !DILexicalBlock(scope: !981, file: !818, line: 3446, column: 57)
!986 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !987, file: !818, line: 3447, type: !350)
!987 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3447, column: 8)
!988 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !989, file: !818, line: 3447, type: !350)
!989 = distinct !DILexicalBlock(scope: !990, file: !818, line: 3447, column: 123)
!990 = distinct !DILexicalBlock(scope: !991, file: !818, line: 3447, column: 118)
!991 = distinct !DILexicalBlock(scope: !987, file: !818, line: 3447, column: 57)
!992 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !993, file: !818, line: 3448, type: !350)
!993 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3448, column: 8)
!994 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !995, file: !818, line: 3448, type: !350)
!995 = distinct !DILexicalBlock(scope: !996, file: !818, line: 3448, column: 120)
!996 = distinct !DILexicalBlock(scope: !997, file: !818, line: 3448, column: 115)
!997 = distinct !DILexicalBlock(scope: !993, file: !818, line: 3448, column: 57)
!998 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !999, file: !818, line: 3449, type: !350)
!999 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3449, column: 8)
!1000 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1001, file: !818, line: 3449, type: !350)
!1001 = distinct !DILexicalBlock(scope: !1002, file: !818, line: 3449, column: 121)
!1002 = distinct !DILexicalBlock(scope: !1003, file: !818, line: 3449, column: 116)
!1003 = distinct !DILexicalBlock(scope: !999, file: !818, line: 3449, column: 57)
!1004 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1005, file: !818, line: 3453, type: !350)
!1005 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3453, column: 8)
!1006 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1007, file: !818, line: 3453, type: !350)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !818, line: 3453, column: 151)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !818, line: 3453, column: 146)
!1009 = distinct !DILexicalBlock(scope: !1005, file: !818, line: 3453, column: 83)
!1010 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1011, file: !818, line: 3454, type: !350)
!1011 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3454, column: 8)
!1012 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1013, file: !818, line: 3454, type: !350)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !818, line: 3454, column: 152)
!1014 = distinct !DILexicalBlock(scope: !1015, file: !818, line: 3454, column: 147)
!1015 = distinct !DILexicalBlock(scope: !1011, file: !818, line: 3454, column: 83)
!1016 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1017, file: !818, line: 3455, type: !350)
!1017 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3455, column: 8)
!1018 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1019, file: !818, line: 3455, type: !350)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !818, line: 3455, column: 151)
!1020 = distinct !DILexicalBlock(scope: !1021, file: !818, line: 3455, column: 146)
!1021 = distinct !DILexicalBlock(scope: !1017, file: !818, line: 3455, column: 83)
!1022 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1023, file: !818, line: 3456, type: !350)
!1023 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3456, column: 8)
!1024 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1025, file: !818, line: 3456, type: !350)
!1025 = distinct !DILexicalBlock(scope: !1026, file: !818, line: 3456, column: 158)
!1026 = distinct !DILexicalBlock(scope: !1027, file: !818, line: 3456, column: 153)
!1027 = distinct !DILexicalBlock(scope: !1023, file: !818, line: 3456, column: 83)
!1028 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1029, file: !818, line: 3457, type: !350)
!1029 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3457, column: 8)
!1030 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1031, file: !818, line: 3457, type: !350)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !818, line: 3457, column: 158)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !818, line: 3457, column: 153)
!1033 = distinct !DILexicalBlock(scope: !1029, file: !818, line: 3457, column: 83)
!1034 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1035, file: !818, line: 3459, type: !350)
!1035 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3459, column: 8)
!1036 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1037, file: !818, line: 3459, type: !350)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !818, line: 3459, column: 151)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !818, line: 3459, column: 146)
!1039 = distinct !DILexicalBlock(scope: !1035, file: !818, line: 3459, column: 83)
!1040 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1041, file: !818, line: 3460, type: !350)
!1041 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3460, column: 8)
!1042 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1043, file: !818, line: 3460, type: !350)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !818, line: 3460, column: 152)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !818, line: 3460, column: 147)
!1045 = distinct !DILexicalBlock(scope: !1041, file: !818, line: 3460, column: 83)
!1046 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1047, file: !818, line: 3461, type: !350)
!1047 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3461, column: 8)
!1048 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1049, file: !818, line: 3461, type: !350)
!1049 = distinct !DILexicalBlock(scope: !1050, file: !818, line: 3461, column: 151)
!1050 = distinct !DILexicalBlock(scope: !1051, file: !818, line: 3461, column: 146)
!1051 = distinct !DILexicalBlock(scope: !1047, file: !818, line: 3461, column: 83)
!1052 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1053, file: !818, line: 3462, type: !350)
!1053 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3462, column: 8)
!1054 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1055, file: !818, line: 3462, type: !350)
!1055 = distinct !DILexicalBlock(scope: !1056, file: !818, line: 3462, column: 158)
!1056 = distinct !DILexicalBlock(scope: !1057, file: !818, line: 3462, column: 153)
!1057 = distinct !DILexicalBlock(scope: !1053, file: !818, line: 3462, column: 83)
!1058 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1059, file: !818, line: 3463, type: !350)
!1059 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3463, column: 8)
!1060 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1061, file: !818, line: 3463, type: !350)
!1061 = distinct !DILexicalBlock(scope: !1062, file: !818, line: 3463, column: 158)
!1062 = distinct !DILexicalBlock(scope: !1063, file: !818, line: 3463, column: 153)
!1063 = distinct !DILexicalBlock(scope: !1059, file: !818, line: 3463, column: 83)
!1064 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1065, file: !818, line: 3465, type: !350)
!1065 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3465, column: 8)
!1066 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1067, file: !818, line: 3465, type: !350)
!1067 = distinct !DILexicalBlock(scope: !1068, file: !818, line: 3465, column: 151)
!1068 = distinct !DILexicalBlock(scope: !1069, file: !818, line: 3465, column: 146)
!1069 = distinct !DILexicalBlock(scope: !1065, file: !818, line: 3465, column: 83)
!1070 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1071, file: !818, line: 3466, type: !350)
!1071 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3466, column: 8)
!1072 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1073, file: !818, line: 3466, type: !350)
!1073 = distinct !DILexicalBlock(scope: !1074, file: !818, line: 3466, column: 152)
!1074 = distinct !DILexicalBlock(scope: !1075, file: !818, line: 3466, column: 147)
!1075 = distinct !DILexicalBlock(scope: !1071, file: !818, line: 3466, column: 83)
!1076 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1077, file: !818, line: 3467, type: !350)
!1077 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3467, column: 8)
!1078 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1079, file: !818, line: 3467, type: !350)
!1079 = distinct !DILexicalBlock(scope: !1080, file: !818, line: 3467, column: 151)
!1080 = distinct !DILexicalBlock(scope: !1081, file: !818, line: 3467, column: 146)
!1081 = distinct !DILexicalBlock(scope: !1077, file: !818, line: 3467, column: 83)
!1082 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1083, file: !818, line: 3468, type: !350)
!1083 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3468, column: 8)
!1084 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1085, file: !818, line: 3468, type: !350)
!1085 = distinct !DILexicalBlock(scope: !1086, file: !818, line: 3468, column: 158)
!1086 = distinct !DILexicalBlock(scope: !1087, file: !818, line: 3468, column: 153)
!1087 = distinct !DILexicalBlock(scope: !1083, file: !818, line: 3468, column: 83)
!1088 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1089, file: !818, line: 3469, type: !350)
!1089 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3469, column: 8)
!1090 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1091, file: !818, line: 3469, type: !350)
!1091 = distinct !DILexicalBlock(scope: !1092, file: !818, line: 3469, column: 158)
!1092 = distinct !DILexicalBlock(scope: !1093, file: !818, line: 3469, column: 153)
!1093 = distinct !DILexicalBlock(scope: !1089, file: !818, line: 3469, column: 83)
!1094 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1095, file: !818, line: 3471, type: !350)
!1095 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3471, column: 8)
!1096 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1097, file: !818, line: 3471, type: !350)
!1097 = distinct !DILexicalBlock(scope: !1098, file: !818, line: 3471, column: 151)
!1098 = distinct !DILexicalBlock(scope: !1099, file: !818, line: 3471, column: 146)
!1099 = distinct !DILexicalBlock(scope: !1095, file: !818, line: 3471, column: 83)
!1100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1101, file: !818, line: 3472, type: !350)
!1101 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3472, column: 8)
!1102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1103, file: !818, line: 3472, type: !350)
!1103 = distinct !DILexicalBlock(scope: !1104, file: !818, line: 3472, column: 152)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !818, line: 3472, column: 147)
!1105 = distinct !DILexicalBlock(scope: !1101, file: !818, line: 3472, column: 83)
!1106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1107, file: !818, line: 3473, type: !350)
!1107 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3473, column: 8)
!1108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1109, file: !818, line: 3473, type: !350)
!1109 = distinct !DILexicalBlock(scope: !1110, file: !818, line: 3473, column: 151)
!1110 = distinct !DILexicalBlock(scope: !1111, file: !818, line: 3473, column: 146)
!1111 = distinct !DILexicalBlock(scope: !1107, file: !818, line: 3473, column: 83)
!1112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1113, file: !818, line: 3474, type: !350)
!1113 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3474, column: 8)
!1114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1115, file: !818, line: 3474, type: !350)
!1115 = distinct !DILexicalBlock(scope: !1116, file: !818, line: 3474, column: 158)
!1116 = distinct !DILexicalBlock(scope: !1117, file: !818, line: 3474, column: 153)
!1117 = distinct !DILexicalBlock(scope: !1113, file: !818, line: 3474, column: 83)
!1118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1119, file: !818, line: 3475, type: !350)
!1119 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3475, column: 8)
!1120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1121, file: !818, line: 3475, type: !350)
!1121 = distinct !DILexicalBlock(scope: !1122, file: !818, line: 3475, column: 158)
!1122 = distinct !DILexicalBlock(scope: !1123, file: !818, line: 3475, column: 153)
!1123 = distinct !DILexicalBlock(scope: !1119, file: !818, line: 3475, column: 83)
!1124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1125, file: !818, line: 3477, type: !350)
!1125 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3477, column: 8)
!1126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1127, file: !818, line: 3477, type: !350)
!1127 = distinct !DILexicalBlock(scope: !1128, file: !818, line: 3477, column: 149)
!1128 = distinct !DILexicalBlock(scope: !1129, file: !818, line: 3477, column: 144)
!1129 = distinct !DILexicalBlock(scope: !1125, file: !818, line: 3477, column: 84)
!1130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1131, file: !818, line: 3478, type: !350)
!1131 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3478, column: 8)
!1132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1133, file: !818, line: 3478, type: !350)
!1133 = distinct !DILexicalBlock(scope: !1134, file: !818, line: 3478, column: 148)
!1134 = distinct !DILexicalBlock(scope: !1135, file: !818, line: 3478, column: 143)
!1135 = distinct !DILexicalBlock(scope: !1131, file: !818, line: 3478, column: 84)
!1136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1137, file: !818, line: 3479, type: !350)
!1137 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3479, column: 8)
!1138 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1139, file: !818, line: 3479, type: !350)
!1139 = distinct !DILexicalBlock(scope: !1140, file: !818, line: 3479, column: 147)
!1140 = distinct !DILexicalBlock(scope: !1141, file: !818, line: 3479, column: 142)
!1141 = distinct !DILexicalBlock(scope: !1137, file: !818, line: 3479, column: 84)
!1142 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1143, file: !818, line: 3481, type: !350)
!1143 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3481, column: 8)
!1144 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1145, file: !818, line: 3481, type: !350)
!1145 = distinct !DILexicalBlock(scope: !1146, file: !818, line: 3481, column: 159)
!1146 = distinct !DILexicalBlock(scope: !1147, file: !818, line: 3481, column: 154)
!1147 = distinct !DILexicalBlock(scope: !1143, file: !818, line: 3481, column: 90)
!1148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1149, file: !818, line: 3482, type: !350)
!1149 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3482, column: 8)
!1150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1151, file: !818, line: 3482, type: !350)
!1151 = distinct !DILexicalBlock(scope: !1152, file: !818, line: 3482, column: 158)
!1152 = distinct !DILexicalBlock(scope: !1153, file: !818, line: 3482, column: 153)
!1153 = distinct !DILexicalBlock(scope: !1149, file: !818, line: 3482, column: 84)
!1154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !1155, file: !818, line: 3486, type: !389)
!1155 = distinct !DILexicalBlock(scope: !817, file: !818, line: 3485, column: 5)
!1156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key_n", scope: !1155, file: !818, line: 3487, type: !397)
!1157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key_n2", scope: !1155, file: !818, line: 3488, type: !397)
!1158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !1159, file: !818, line: 3492, type: !439)
!1159 = distinct !DILexicalBlock(scope: !1160, file: !818, line: 3492, column: 55)
!1160 = distinct !DILexicalBlock(scope: !1161, file: !818, line: 3492, column: 17)
!1161 = distinct !DILexicalBlock(scope: !1162, file: !818, line: 3490, column: 42)
!1162 = distinct !DILexicalBlock(scope: !1163, file: !818, line: 3490, column: 9)
!1163 = distinct !DILexicalBlock(scope: !1155, file: !818, line: 3490, column: 9)
!1164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !1159, file: !818, line: 3492, type: !439)
!1165 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !1166, file: !818, line: 3492, type: !690)
!1166 = distinct !DILexicalBlock(scope: !1159, file: !818, line: 3492, column: 1709)
!1167 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !1166, file: !818, line: 3492, type: !389)
!1168 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p1", scope: !1169, file: !818, line: 3495, type: !397)
!1169 = distinct !DILexicalBlock(scope: !1170, file: !818, line: 3494, column: 2414)
!1170 = distinct !DILexicalBlock(scope: !1161, file: !818, line: 3494, column: 17)
!1171 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p2", scope: !1169, file: !818, line: 3495, type: !397)
!1172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1173, file: !818, line: 3513, type: !350)
!1173 = distinct !DILexicalBlock(scope: !1161, file: !818, line: 3513, column: 16)
!1174 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1175, file: !818, line: 3513, type: !350)
!1175 = distinct !DILexicalBlock(scope: !1176, file: !818, line: 3513, column: 124)
!1176 = distinct !DILexicalBlock(scope: !1177, file: !818, line: 3513, column: 119)
!1177 = distinct !DILexicalBlock(scope: !1173, file: !818, line: 3513, column: 67)
!1178 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1179, file: !818, line: 3518, type: !350)
!1179 = distinct !DILexicalBlock(scope: !1155, file: !818, line: 3518, column: 12)
!1180 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1181, file: !818, line: 3518, type: !350)
!1181 = distinct !DILexicalBlock(scope: !1182, file: !818, line: 3518, column: 124)
!1182 = distinct !DILexicalBlock(scope: !1183, file: !818, line: 3518, column: 119)
!1183 = distinct !DILexicalBlock(scope: !1179, file: !818, line: 3518, column: 64)
!1184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !1185, file: !818, line: 3519, type: !350)
!1185 = distinct !DILexicalBlock(scope: !1155, file: !818, line: 3519, column: 12)
!1186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !1187, file: !818, line: 3519, type: !350)
!1187 = distinct !DILexicalBlock(scope: !1188, file: !818, line: 3519, column: 124)
!1188 = distinct !DILexicalBlock(scope: !1189, file: !818, line: 3519, column: 119)
!1189 = distinct !DILexicalBlock(scope: !1185, file: !818, line: 3519, column: 64)
!1190 = !DISubprogram(name: "PyCursesWindow_Dealloc", scope: !818, file: !818, line: 548, type: !1191, isLocal: true, isDefinition: true, scopeLine: 549, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyCursesWindowObject*)* @PyCursesWindow_Dealloc, variables: !1193)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{null, !694}
!1193 = !{!1194}
!1194 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "wo", arg: 1, scope: !1190, file: !818, line: 548, type: !694)
!1195 = !DISubprogram(name: "curses_window_addch", scope: !818, file: !818, line: 611, type: !1196, isLocal: true, isDefinition: true, scopeLine: 612, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyCursesWindowObject*, %struct._object*)* @curses_window_addch, variables: !1198)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!350, !694, !350}
!1198 = !{!1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207}
!1199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !1195, file: !818, line: 611, type: !694)
!1200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !1195, file: !818, line: 611, type: !350)
!1201 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_value", scope: !1195, file: !818, line: 613, type: !350)
!1202 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "group_left_1", scope: !1195, file: !818, line: 614, type: !389)
!1203 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !1195, file: !818, line: 615, type: !389)
!1204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !1195, file: !818, line: 616, type: !389)
!1205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch", scope: !1195, file: !818, line: 617, type: !350)
!1206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "group_right_1", scope: !1195, file: !818, line: 618, type: !389)
!1207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "attr", scope: !1195, file: !818, line: 619, type: !362)
!1208 = !DISubprogram(name: "curses_window_addch_impl", scope: !818, file: !818, line: 653, type: !1209, isLocal: true, isDefinition: true, scopeLine: 655, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyCursesWindowObject*, i32, i32, i32, %struct._object*, i32, i64)* @curses_window_addch_impl, variables: !1211)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!350, !694, !389, !389, !389, !350, !389, !362}
!1211 = !{!1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226}
!1212 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !1208, file: !818, line: 653, type: !694)
!1213 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group_left_1", arg: 2, scope: !1208, file: !818, line: 653, type: !389)
!1214 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 3, scope: !1208, file: !818, line: 653, type: !389)
!1215 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 4, scope: !1208, file: !818, line: 653, type: !389)
!1216 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ch", arg: 5, scope: !1208, file: !818, line: 653, type: !350)
!1217 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "group_right_1", arg: 6, scope: !1208, file: !818, line: 653, type: !389)
!1218 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 7, scope: !1208, file: !818, line: 653, type: !362)
!1219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cwself", scope: !1208, file: !818, line: 656, type: !694)
!1220 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coordinates_group", scope: !1208, file: !818, line: 657, type: !389)
!1221 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "attr_group", scope: !1208, file: !818, line: 658, type: !389)
!1222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rtn", scope: !1208, file: !818, line: 659, type: !389)
!1223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !1208, file: !818, line: 660, type: !389)
!1224 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cch", scope: !1208, file: !818, line: 661, type: !716)
!1225 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wch", scope: !1208, file: !818, line: 663, type: !748)
!1226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "funcname", scope: !1208, file: !818, line: 665, type: !374)
!1227 = !DISubprogram(name: "PyCurses_ConvertToCchar_t", scope: !818, file: !818, line: 278, type: !1228, isLocal: true, isDefinition: true, scopeLine: 284, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyCursesWindowObject*, %struct._object*, i64*, %struct.cchar_t*)* @PyCurses_ConvertToCchar_t, variables: !1232)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!389, !694, !350, !1230, !1231}
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64, align: 64)
!1232 = !{!1233, !1234, !1235, !1236, !1237, !1238, !1242}
!1233 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "win", arg: 1, scope: !1227, file: !818, line: 278, type: !694)
!1234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !1227, file: !818, line: 278, type: !350)
!1235 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ch", arg: 3, scope: !1227, file: !818, line: 279, type: !1230)
!1236 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "wch", arg: 4, scope: !1227, file: !818, line: 281, type: !1231)
!1237 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !1227, file: !818, line: 285, type: !362)
!1238 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !1227, file: !818, line: 287, type: !1239)
!1239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !754, size: 64, align: 32, elements: !1240)
!1240 = !{!1241}
!1241 = !DISubrange(count: 2)
!1242 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overflow", scope: !1243, file: !818, line: 310, type: !389)
!1243 = distinct !DILexicalBlock(scope: !1244, file: !818, line: 309, column: 63)
