; ModuleID = 'irs-onlybc/_datetimemodule.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !8, subprograms: !456, globals: !2374)
!1 = !DIFile(filename: "_datetimemodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./Include/pytime.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "_PyTime_ROUND_DOWN", value: 0)
!7 = !DIEnumerator(name: "_PyTime_ROUND_UP", value: 1)
!8 = !{!9, !10, !355, !368, !353, !377, !378, !386, !16, !99, !387, !394, !406, !57, !418, !426, !49, !445, !36, !22, !365, !448}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !12, line: 109, baseType: !13)
!12 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !12, line: 105, size: 128, align: 64, elements: !14)
!14 = !{!15, !23}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !13, file: !12, line: 107, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !17, line: 177, baseType: !18)
!17 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !19, line: 102, baseType: !20)
!19 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !21, line: 181, baseType: !22)
!21 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!22 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !13, file: !12, line: 108, baseType: !24, size: 64, align: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !12, line: 334, size: 3200, align: 64, elements: !26)
!26 = !{!27, !33, !37, !38, !39, !44, !107, !112, !117, !118, !123, !175, !206, !218, !224, !225, !226, !228, !230, !261, !262, !263, !272, !273, !278, !279, !281, !283, !293, !303, !321, !322, !323, !325, !327, !328, !330, !335, !340, !345, !346, !347, !348, !349, !350, !351, !352, !354}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !25, file: !12, line: 335, baseType: !28, size: 192, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !12, line: 114, baseType: !29)
!29 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 111, size: 192, align: 64, elements: !30)
!30 = !{!31, !32}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !29, file: !12, line: 112, baseType: !11, size: 128, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !29, file: !12, line: 113, baseType: !16, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !25, file: !12, line: 336, baseType: !34, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!36 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !25, file: !12, line: 337, baseType: !16, size: 64, align: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !25, file: !12, line: 337, baseType: !16, size: 64, align: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !25, file: !12, line: 341, baseType: !40, size: 64, align: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !12, line: 308, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{null, !10}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !25, file: !12, line: 342, baseType: !45, size: 64, align: 64, offset: 448)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !12, line: 314, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !10, !50, !49}
!49 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !19, line: 48, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !53, line: 246, size: 1728, align: 64, elements: !54)
!53 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!54 = !{!55, !56, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !76, !77, !78, !79, !81, !83, !85, !89, !92, !94, !95, !96, !97, !98, !102, !103}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !52, file: !53, line: 247, baseType: !49, size: 32, align: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !52, file: !53, line: 252, baseType: !57, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !52, file: !53, line: 253, baseType: !57, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !52, file: !53, line: 254, baseType: !57, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !52, file: !53, line: 255, baseType: !57, size: 64, align: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !52, file: !53, line: 256, baseType: !57, size: 64, align: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !52, file: !53, line: 257, baseType: !57, size: 64, align: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !52, file: !53, line: 258, baseType: !57, size: 64, align: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !52, file: !53, line: 259, baseType: !57, size: 64, align: 64, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !52, file: !53, line: 261, baseType: !57, size: 64, align: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !52, file: !53, line: 262, baseType: !57, size: 64, align: 64, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !52, file: !53, line: 263, baseType: !57, size: 64, align: 64, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !52, file: !53, line: 265, baseType: !69, size: 64, align: 64, offset: 768)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !53, line: 161, size: 192, align: 64, elements: !71)
!71 = !{!72, !73, !75}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !70, file: !53, line: 162, baseType: !69, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !70, file: !53, line: 163, baseType: !74, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !70, file: !53, line: 167, baseType: !49, size: 32, align: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !52, file: !53, line: 267, baseType: !74, size: 64, align: 64, offset: 832)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !52, file: !53, line: 269, baseType: !49, size: 32, align: 32, offset: 896)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !52, file: !53, line: 273, baseType: !49, size: 32, align: 32, offset: 928)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !52, file: !53, line: 275, baseType: !80, size: 64, align: 64, offset: 960)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !21, line: 140, baseType: !22)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !52, file: !53, line: 279, baseType: !82, size: 16, align: 16, offset: 1024)
!82 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !52, file: !53, line: 280, baseType: !84, size: 8, align: 8, offset: 1040)
!84 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !52, file: !53, line: 281, baseType: !86, size: 8, align: 8, offset: 1048)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 8, align: 8, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 1)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !52, file: !53, line: 285, baseType: !90, size: 64, align: 64, offset: 1088)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !53, line: 155, baseType: null)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !52, file: !53, line: 294, baseType: !93, size: 64, align: 64, offset: 1152)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !21, line: 141, baseType: !22)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !52, file: !53, line: 303, baseType: !9, size: 64, align: 64, offset: 1216)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !52, file: !53, line: 304, baseType: !9, size: 64, align: 64, offset: 1280)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !52, file: !53, line: 305, baseType: !9, size: 64, align: 64, offset: 1344)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !52, file: !53, line: 306, baseType: !9, size: 64, align: 64, offset: 1408)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !52, file: !53, line: 307, baseType: !99, size: 64, align: 64, offset: 1472)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !100, line: 62, baseType: !101)
!100 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!101 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !52, file: !53, line: 309, baseType: !49, size: 32, align: 32, offset: 1536)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !52, file: !53, line: 311, baseType: !104, size: 160, align: 8, offset: 1568)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 160, align: 8, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 20)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !25, file: !12, line: 343, baseType: !108, size: 64, align: 64, offset: 512)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !12, line: 316, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!10, !10, !57}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !25, file: !12, line: 344, baseType: !113, size: 64, align: 64, offset: 576)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !12, line: 318, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!49, !10, !57, !10}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !25, file: !12, line: 345, baseType: !9, size: 64, align: 64, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !25, file: !12, line: 346, baseType: !119, size: 64, align: 64, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !12, line: 320, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!10, !10}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !25, file: !12, line: 350, baseType: !124, size: 64, align: 64, offset: 768)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !12, line: 278, baseType: !126)
!126 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 236, size: 2176, align: 64, elements: !127)
!127 = !{!128, !133, !134, !135, !136, !137, !142, !144, !145, !146, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !126, file: !12, line: 241, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !12, line: 166, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!10, !10, !10}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !126, file: !12, line: 242, baseType: !129, size: 64, align: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !126, file: !12, line: 243, baseType: !129, size: 64, align: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !126, file: !12, line: 244, baseType: !129, size: 64, align: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !126, file: !12, line: 245, baseType: !129, size: 64, align: 64, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !126, file: !12, line: 246, baseType: !138, size: 64, align: 64, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !12, line: 167, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!10, !10, !10, !10}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !126, file: !12, line: 247, baseType: !143, size: 64, align: 64, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !12, line: 165, baseType: !120)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !126, file: !12, line: 248, baseType: !143, size: 64, align: 64, offset: 448)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !126, file: !12, line: 249, baseType: !143, size: 64, align: 64, offset: 512)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !126, file: !12, line: 250, baseType: !147, size: 64, align: 64, offset: 576)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !12, line: 168, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!49, !10}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !126, file: !12, line: 251, baseType: !143, size: 64, align: 64, offset: 640)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !126, file: !12, line: 252, baseType: !129, size: 64, align: 64, offset: 704)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !126, file: !12, line: 253, baseType: !129, size: 64, align: 64, offset: 768)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !126, file: !12, line: 254, baseType: !129, size: 64, align: 64, offset: 832)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !126, file: !12, line: 255, baseType: !129, size: 64, align: 64, offset: 896)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !126, file: !12, line: 256, baseType: !129, size: 64, align: 64, offset: 960)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !126, file: !12, line: 257, baseType: !143, size: 64, align: 64, offset: 1024)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !126, file: !12, line: 258, baseType: !9, size: 64, align: 64, offset: 1088)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !126, file: !12, line: 259, baseType: !143, size: 64, align: 64, offset: 1152)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !126, file: !12, line: 261, baseType: !129, size: 64, align: 64, offset: 1216)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !126, file: !12, line: 262, baseType: !129, size: 64, align: 64, offset: 1280)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !126, file: !12, line: 263, baseType: !129, size: 64, align: 64, offset: 1344)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !126, file: !12, line: 264, baseType: !129, size: 64, align: 64, offset: 1408)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !126, file: !12, line: 265, baseType: !138, size: 64, align: 64, offset: 1472)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !126, file: !12, line: 266, baseType: !129, size: 64, align: 64, offset: 1536)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !126, file: !12, line: 267, baseType: !129, size: 64, align: 64, offset: 1600)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !126, file: !12, line: 268, baseType: !129, size: 64, align: 64, offset: 1664)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !126, file: !12, line: 269, baseType: !129, size: 64, align: 64, offset: 1728)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !126, file: !12, line: 270, baseType: !129, size: 64, align: 64, offset: 1792)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !126, file: !12, line: 272, baseType: !129, size: 64, align: 64, offset: 1856)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !126, file: !12, line: 273, baseType: !129, size: 64, align: 64, offset: 1920)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !126, file: !12, line: 274, baseType: !129, size: 64, align: 64, offset: 1984)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !126, file: !12, line: 275, baseType: !129, size: 64, align: 64, offset: 2048)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !126, file: !12, line: 277, baseType: !143, size: 64, align: 64, offset: 2112)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !25, file: !12, line: 351, baseType: !176, size: 64, align: 64, offset: 832)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !12, line: 292, baseType: !178)
!178 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 280, size: 640, align: 64, elements: !179)
!179 = !{!180, !185, !186, !191, !192, !193, !198, !199, !204, !205}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !178, file: !12, line: 281, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !12, line: 169, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!16, !10}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !178, file: !12, line: 282, baseType: !129, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !178, file: !12, line: 283, baseType: !187, size: 64, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !12, line: 170, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!10, !10, !16}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !178, file: !12, line: 284, baseType: !187, size: 64, align: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !178, file: !12, line: 285, baseType: !9, size: 64, align: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !178, file: !12, line: 286, baseType: !194, size: 64, align: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !12, line: 172, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!49, !10, !16, !10}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !178, file: !12, line: 287, baseType: !9, size: 64, align: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !178, file: !12, line: 288, baseType: !200, size: 64, align: 64, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !12, line: 231, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!49, !10, !10}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !178, file: !12, line: 290, baseType: !129, size: 64, align: 64, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !178, file: !12, line: 291, baseType: !187, size: 64, align: 64, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !25, file: !12, line: 352, baseType: !207, size: 64, align: 64, offset: 896)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !12, line: 298, baseType: !209)
!209 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 294, size: 192, align: 64, elements: !210)
!210 = !{!211, !212, !213}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !209, file: !12, line: 295, baseType: !181, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !209, file: !12, line: 296, baseType: !129, size: 64, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !209, file: !12, line: 297, baseType: !214, size: 64, align: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !12, line: 174, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!49, !10, !10, !10}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !25, file: !12, line: 356, baseType: !219, size: 64, align: 64, offset: 960)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !12, line: 321, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!223, !10}
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !17, line: 186, baseType: !16)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !25, file: !12, line: 357, baseType: !138, size: 64, align: 64, offset: 1024)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !25, file: !12, line: 358, baseType: !119, size: 64, align: 64, offset: 1088)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !25, file: !12, line: 359, baseType: !227, size: 64, align: 64, offset: 1152)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !12, line: 317, baseType: !130)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !25, file: !12, line: 360, baseType: !229, size: 64, align: 64, offset: 1216)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !12, line: 319, baseType: !215)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !25, file: !12, line: 363, baseType: !231, size: 64, align: 64, offset: 1280)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !12, line: 304, baseType: !233)
!233 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 301, size: 128, align: 64, elements: !234)
!234 = !{!235, !256}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !233, file: !12, line: 302, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !12, line: 193, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!49, !10, !240, !49}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !12, line: 191, baseType: !242)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !12, line: 178, size: 640, align: 64, elements: !243)
!243 = !{!244, !245, !246, !247, !248, !249, !250, !251, !253, !254, !255}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !242, file: !12, line: 179, baseType: !9, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !242, file: !12, line: 180, baseType: !10, size: 64, align: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !242, file: !12, line: 181, baseType: !16, size: 64, align: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !242, file: !12, line: 182, baseType: !16, size: 64, align: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !242, file: !12, line: 184, baseType: !49, size: 32, align: 32, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !242, file: !12, line: 185, baseType: !49, size: 32, align: 32, offset: 288)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !242, file: !12, line: 186, baseType: !57, size: 64, align: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !242, file: !12, line: 187, baseType: !252, size: 64, align: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !242, file: !12, line: 188, baseType: !252, size: 64, align: 64, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !242, file: !12, line: 189, baseType: !252, size: 64, align: 64, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !242, file: !12, line: 190, baseType: !9, size: 64, align: 64, offset: 576)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !233, file: !12, line: 303, baseType: !257, size: 64, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !12, line: 194, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !10, !240}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !25, file: !12, line: 366, baseType: !101, size: 64, align: 64, offset: 1344)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !25, file: !12, line: 368, baseType: !34, size: 64, align: 64, offset: 1408)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !25, file: !12, line: 372, baseType: !264, size: 64, align: 64, offset: 1472)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !12, line: 233, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!49, !10, !268, !9}
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !12, line: 232, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!49, !10, !9}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !25, file: !12, line: 375, baseType: !147, size: 64, align: 64, offset: 1536)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !25, file: !12, line: 379, baseType: !274, size: 64, align: 64, offset: 1600)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !12, line: 322, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!10, !10, !10, !49}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !25, file: !12, line: 382, baseType: !16, size: 64, align: 64, offset: 1664)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !25, file: !12, line: 385, baseType: !280, size: 64, align: 64, offset: 1728)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !12, line: 323, baseType: !120)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !25, file: !12, line: 386, baseType: !282, size: 64, align: 64, offset: 1792)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !12, line: 324, baseType: !120)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !25, file: !12, line: 389, baseType: !284, size: 64, align: 64, offset: 1856)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !286, line: 40, size: 256, align: 64, elements: !287)
!286 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!287 = !{!288, !289, !291, !292}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !285, file: !286, line: 41, baseType: !34, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !285, file: !286, line: 42, baseType: !290, size: 64, align: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !286, line: 18, baseType: !130)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !285, file: !286, line: 43, baseType: !49, size: 32, align: 32, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !285, file: !286, line: 45, baseType: !34, size: 64, align: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !25, file: !12, line: 390, baseType: !294, size: 64, align: 64, offset: 1920)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !296, line: 18, size: 320, align: 64, elements: !297)
!296 = !DIFile(filename: "./Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!297 = !{!298, !299, !300, !301, !302}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !295, file: !296, line: 19, baseType: !57, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !295, file: !296, line: 20, baseType: !49, size: 32, align: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !295, file: !296, line: 21, baseType: !16, size: 64, align: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !295, file: !296, line: 22, baseType: !49, size: 32, align: 32, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !295, file: !296, line: 23, baseType: !57, size: 64, align: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !25, file: !12, line: 391, baseType: !304, size: 64, align: 64, offset: 1984)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !306, line: 11, size: 320, align: 64, elements: !307)
!306 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!307 = !{!308, !309, !314, !319, !320}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !305, file: !306, line: 12, baseType: !57, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !305, file: !306, line: 13, baseType: !310, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !306, line: 8, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!10, !10, !9}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !305, file: !306, line: 14, baseType: !315, size: 64, align: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !306, line: 9, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!49, !10, !10, !9}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !305, file: !306, line: 15, baseType: !57, size: 64, align: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !305, file: !306, line: 16, baseType: !9, size: 64, align: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !25, file: !12, line: 392, baseType: !24, size: 64, align: 64, offset: 2048)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !25, file: !12, line: 393, baseType: !10, size: 64, align: 64, offset: 2112)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !25, file: !12, line: 394, baseType: !324, size: 64, align: 64, offset: 2176)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !12, line: 325, baseType: !139)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !25, file: !12, line: 395, baseType: !326, size: 64, align: 64, offset: 2240)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !12, line: 326, baseType: !215)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !25, file: !12, line: 396, baseType: !16, size: 64, align: 64, offset: 2304)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !25, file: !12, line: 397, baseType: !329, size: 64, align: 64, offset: 2368)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !12, line: 327, baseType: !215)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !25, file: !12, line: 398, baseType: !331, size: 64, align: 64, offset: 2432)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !12, line: 329, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!10, !24, !16}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !25, file: !12, line: 399, baseType: !336, size: 64, align: 64, offset: 2496)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !12, line: 328, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!10, !24, !10, !10}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !25, file: !12, line: 400, baseType: !341, size: 64, align: 64, offset: 2560)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !12, line: 307, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{null, !9}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !25, file: !12, line: 401, baseType: !147, size: 64, align: 64, offset: 2624)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !25, file: !12, line: 402, baseType: !10, size: 64, align: 64, offset: 2688)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !25, file: !12, line: 403, baseType: !10, size: 64, align: 64, offset: 2752)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !25, file: !12, line: 404, baseType: !10, size: 64, align: 64, offset: 2816)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !25, file: !12, line: 405, baseType: !10, size: 64, align: 64, offset: 2880)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !25, file: !12, line: 406, baseType: !10, size: 64, align: 64, offset: 2944)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !25, file: !12, line: 407, baseType: !40, size: 64, align: 64, offset: 3008)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !25, file: !12, line: 410, baseType: !353, size: 32, align: 32, offset: 3072)
!353 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !25, file: !12, line: 412, baseType: !40, size: 64, align: 64, offset: 3136)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDateTime_Date", file: !357, line: 97, baseType: !358)
!357 = !DIFile(filename: "./Include/datetime.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!358 = !DICompositeType(tag: DW_TAG_structure_type, file: !357, line: 93, size: 256, align: 64, elements: !359)
!359 = !{!360, !361, !362, !363}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !358, file: !357, line: 95, baseType: !11, size: 128, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "hashcode", scope: !358, file: !357, line: 95, baseType: !223, size: 64, align: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "hastzinfo", scope: !358, file: !357, line: 95, baseType: !36, size: 8, align: 8, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !358, file: !357, line: 96, baseType: !364, size: 32, align: 8, offset: 200)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 32, align: 8, elements: !366)
!365 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!366 = !{!367}
!367 = !DISubrange(count: 4)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDateTime_Delta", file: !357, line: 41, baseType: !370)
!370 = !DICompositeType(tag: DW_TAG_structure_type, file: !357, line: 34, size: 320, align: 64, elements: !371)
!371 = !{!372, !373, !374, !375, !376}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !370, file: !357, line: 36, baseType: !11, size: 128, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "hashcode", scope: !370, file: !357, line: 37, baseType: !223, size: 64, align: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "days", scope: !370, file: !357, line: 38, baseType: !49, size: 32, align: 32, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !370, file: !357, line: 39, baseType: !49, size: 32, align: 32, offset: 224)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "microseconds", scope: !370, file: !357, line: 40, baseType: !49, size: 32, align: 32, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !380, line: 41, baseType: !381)
!380 = !DIFile(filename: "./Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!381 = !DICompositeType(tag: DW_TAG_structure_type, file: !380, line: 31, size: 320, align: 64, elements: !382)
!382 = !{!383, !384, !385}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !381, file: !380, line: 32, baseType: !28, size: 192, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !381, file: !380, line: 33, baseType: !223, size: 64, align: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !381, file: !380, line: 34, baseType: !86, size: 8, align: 8, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyDateTime_BaseTZInfo", file: !357, line: 64, baseType: !389)
!389 = !DICompositeType(tag: DW_TAG_structure_type, file: !357, line: 61, size: 256, align: 64, elements: !390)
!390 = !{!391, !392, !393}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !389, file: !357, line: 63, baseType: !11, size: 128, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "hashcode", scope: !389, file: !357, line: 63, baseType: !223, size: 64, align: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "hastzinfo", scope: !389, file: !357, line: 63, baseType: !36, size: 8, align: 8, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDateTime_DateTime", file: !357, line: 112, baseType: !396)
!396 = !DICompositeType(tag: DW_TAG_structure_type, file: !357, line: 108, size: 384, align: 64, elements: !397)
!397 = !{!398, !399, !400, !401, !405}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !396, file: !357, line: 110, baseType: !11, size: 128, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "hashcode", scope: !396, file: !357, line: 110, baseType: !223, size: 64, align: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "hastzinfo", scope: !396, file: !357, line: 110, baseType: !36, size: 8, align: 8, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !396, file: !357, line: 110, baseType: !402, size: 80, align: 8, offset: 200)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 80, align: 8, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 10)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tzinfo", scope: !396, file: !357, line: 111, baseType: !10, size: 64, align: 64, offset: 320)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDateTime_Time", file: !357, line: 85, baseType: !408)
!408 = !DICompositeType(tag: DW_TAG_structure_type, file: !357, line: 81, size: 320, align: 64, elements: !409)
!409 = !{!410, !411, !412, !413, !417}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !408, file: !357, line: 83, baseType: !11, size: 128, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "hashcode", scope: !408, file: !357, line: 83, baseType: !223, size: 64, align: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "hastzinfo", scope: !408, file: !357, line: 83, baseType: !36, size: 8, align: 8, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !408, file: !357, line: 83, baseType: !414, size: 48, align: 8, offset: 200)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 48, align: 8, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 6)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tzinfo", scope: !408, file: !357, line: 84, baseType: !10, size: 64, align: 64, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !420, line: 33, baseType: !421)
!420 = !DIFile(filename: "./Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!421 = !DICompositeType(tag: DW_TAG_structure_type, file: !420, line: 25, size: 256, align: 64, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !421, file: !420, line: 26, baseType: !28, size: 192, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !421, file: !420, line: 27, baseType: !425, size: 64, align: 64, offset: 192)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, align: 64, elements: !87)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !428, line: 351, baseType: !429)
!428 = !DIFile(filename: "./Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!429 = !DICompositeType(tag: DW_TAG_structure_type, file: !428, line: 217, size: 384, align: 64, elements: !430)
!430 = !{!431, !432, !433, !434, !442}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !429, file: !428, line: 291, baseType: !11, size: 128, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !429, file: !428, line: 292, baseType: !16, size: 64, align: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !429, file: !428, line: 293, baseType: !223, size: 64, align: 64, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !429, file: !428, line: 349, baseType: !435, size: 32, align: 32, offset: 256)
!435 = !DICompositeType(tag: DW_TAG_structure_type, scope: !429, file: !428, line: 294, size: 32, align: 32, elements: !436)
!436 = !{!437, !438, !439, !440, !441}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !435, file: !428, line: 303, baseType: !353, size: 2, align: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !435, file: !428, line: 331, baseType: !353, size: 3, align: 32, offset: 2)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !435, file: !428, line: 336, baseType: !353, size: 1, align: 32, offset: 5)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !435, file: !428, line: 340, baseType: !353, size: 1, align: 32, offset: 6)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !435, file: !428, line: 345, baseType: !353, size: 1, align: 32, offset: 7)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !429, file: !428, line: 350, baseType: !443, size: 64, align: 64, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !100, line: 90, baseType: !49)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !446, line: 75, baseType: !447)
!446 = !DIFile(filename: "/usr/include/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !21, line: 148, baseType: !22)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDateTime_TimeZone", file: !450, line: 763, baseType: !451)
!450 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_datetimemodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!451 = !DICompositeType(tag: DW_TAG_structure_type, file: !450, line: 758, size: 256, align: 64, elements: !452)
!452 = !{!453, !454, !455}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !451, file: !450, line: 760, baseType: !11, size: 128, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !451, file: !450, line: 761, baseType: !10, size: 64, align: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !451, file: !450, line: 762, baseType: !10, size: 64, align: 64, offset: 192)
!456 = !{!457, !499, !504, !508, !520, !528, !540, !546, !553, !560, !564, !569, !584, !594, !599, !605, !608, !616, !624, !630, !650, !661, !669, !677, !680, !689, !694, !706, !772, !776, !801, !805, !826, !831, !839, !856, !865, !872, !879, !882, !899, !907, !913, !916, !920, !923, !927, !939, !943, !947, !953, !957, !961, !981, !986, !998, !1005, !1014, !1018, !1032, !1043, !1055, !1101, !1105, !1110, !1120, !1148, !1151, !1173, !1177, !1184, !1196, !1199, !1220, !1230, !1234, !1247, !1257, !1263, !1269, !1280, !1283, !1286, !1289, !1292, !1301, !1305, !1310, !1322, !1329, !1359, !1382, !1397, !1401, !1405, !1422, !1449, !1473, !1490, !1494, !1500, !1509, !1515, !1519, !1523, !1527, !1532, !1539, !1561, !1569, !1572, !1582, !1587, !1600, !1627, !1652, !1660, !1678, !1703, !1706, !1710, !1715, !1728, !1733, !1748, !1773, !1784, !1796, !1799, !1807, !1815, !1818, !1890, !1925, !1937, !1948, !1958, !1986, !1990, !1993, !2014, !2027, !2039, !2043, !2047, !2061, !2065, !2074, !2080, !2084, !2088, !2092, !2097, !2102, !2121, !2132, !2137, !2141, !2145, !2186, !2221, !2238, !2244, !2249, !2259, !2266, !2272, !2278, !2282, !2286, !2292, !2295, !2302, !2312, !2319, !2322, !2331, !2339, !2351, !2366}
!457 = !DISubprogram(name: "PyInit__datetime", scope: !450, file: !450, line: 5222, type: !458, isLocal: false, isDefinition: true, scopeLine: 5223, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__datetime, variables: !460)
!458 = !DISubroutineType(types: !459)
!459 = !{!10}
!460 = !{!461, !462, !463, !464, !465, !467, !469, !471, !473, !475, !477, !479, !481, !483, !485, !487, !489, !491, !493, !495, !497}
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !457, file: !450, line: 5224, type: !10)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !457, file: !450, line: 5225, type: !10)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !457, file: !450, line: 5226, type: !10)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "delta", scope: !457, file: !450, line: 5227, type: !10)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !466, file: !450, line: 5252, type: !10)
!466 = distinct !DILexicalBlock(scope: !457, file: !450, line: 5252, column: 8)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !468, file: !450, line: 5257, type: !10)
!468 = distinct !DILexicalBlock(scope: !457, file: !450, line: 5257, column: 8)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !470, file: !450, line: 5262, type: !10)
!470 = distinct !DILexicalBlock(scope: !457, file: !450, line: 5262, column: 8)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !472, file: !450, line: 5270, type: !10)
!472 = distinct !DILexicalBlock(scope: !457, file: !450, line: 5270, column: 8)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !474, file: !450, line: 5275, type: !10)
!474 = distinct !DILexicalBlock(scope: !457, file: !450, line: 5275, column: 8)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !476, file: !450, line: 5280, type: !10)
!476 = distinct !DILexicalBlock(scope: !457, file: !450, line: 5280, column: 8)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !478, file: !450, line: 5288, type: !10)
!478 = distinct !DILexicalBlock(scope: !457, file: !450, line: 5288, column: 8)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !480, file: !450, line: 5293, type: !10)
!480 = distinct !DILexicalBlock(scope: !457, file: !450, line: 5293, column: 8)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !482, file: !450, line: 5298, type: !10)
!482 = distinct !DILexicalBlock(scope: !457, file: !450, line: 5298, column: 8)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !484, file: !450, line: 5306, type: !10)
!484 = distinct !DILexicalBlock(scope: !457, file: !450, line: 5306, column: 8)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !486, file: !450, line: 5311, type: !10)
!486 = distinct !DILexicalBlock(scope: !457, file: !450, line: 5311, column: 8)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !488, file: !450, line: 5316, type: !10)
!488 = distinct !DILexicalBlock(scope: !457, file: !450, line: 5316, column: 8)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !490, file: !450, line: 5325, type: !10)
!490 = distinct !DILexicalBlock(scope: !457, file: !450, line: 5325, column: 8)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !492, file: !450, line: 5334, type: !10)
!492 = distinct !DILexicalBlock(scope: !457, file: !450, line: 5334, column: 8)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !494, file: !450, line: 5337, type: !10)
!494 = distinct !DILexicalBlock(scope: !457, file: !450, line: 5337, column: 8)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !496, file: !450, line: 5343, type: !10)
!496 = distinct !DILexicalBlock(scope: !457, file: !450, line: 5343, column: 8)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !498, file: !450, line: 5346, type: !10)
!498 = distinct !DILexicalBlock(scope: !457, file: !450, line: 5346, column: 8)
!499 = !DISubprogram(name: "date_repr", scope: !450, file: !450, line: 2627, type: !500, isLocal: true, isDefinition: true, scopeLine: 2628, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyDateTime_Date*)* @date_repr, variables: !502)
!500 = !DISubroutineType(types: !501)
!501 = !{!10, !355}
!502 = !{!503}
!503 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !499, file: !450, line: 2627, type: !355)
!504 = !DISubprogram(name: "date_add", scope: !450, file: !450, line: 2570, type: !131, isLocal: true, isDefinition: true, scopeLine: 2571, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @date_add, variables: !505)
!505 = !{!506, !507}
!506 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "left", arg: 1, scope: !504, file: !450, line: 2570, type: !10)
!507 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "right", arg: 2, scope: !504, file: !450, line: 2570, type: !10)
!508 = !DISubprogram(name: "add_date_timedelta", scope: !450, file: !450, line: 2555, type: !509, isLocal: true, isDefinition: true, scopeLine: 2556, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyDateTime_Date*, %struct.PyDateTime_Delta*, i32)* @add_date_timedelta, variables: !511)
!509 = !DISubroutineType(types: !510)
!510 = !{!10, !355, !368, !49}
!511 = !{!512, !513, !514, !515, !516, !517, !518, !519}
!512 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "date", arg: 1, scope: !508, file: !450, line: 2555, type: !355)
!513 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "delta", arg: 2, scope: !508, file: !450, line: 2555, type: !368)
!514 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "negate", arg: 3, scope: !508, file: !450, line: 2555, type: !49)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !508, file: !450, line: 2557, type: !10)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "year", scope: !508, file: !450, line: 2558, type: !49)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "month", scope: !508, file: !450, line: 2559, type: !49)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "deltadays", scope: !508, file: !450, line: 2560, type: !49)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "day", scope: !508, file: !450, line: 2562, type: !49)
!520 = !DISubprogram(name: "normalize_date", scope: !450, file: !450, line: 564, type: !521, isLocal: true, isDefinition: true, scopeLine: 565, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32*, i32*, i32*)* @normalize_date, variables: !524)
!521 = !DISubroutineType(types: !522)
!522 = !{!49, !523, !523, !523}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!524 = !{!525, !526, !527}
!525 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "year", arg: 1, scope: !520, file: !450, line: 564, type: !523)
!526 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "month", arg: 2, scope: !520, file: !450, line: 564, type: !523)
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "day", arg: 3, scope: !520, file: !450, line: 564, type: !523)
!528 = !DISubprogram(name: "normalize_y_m_d", scope: !450, file: !450, line: 497, type: !521, isLocal: true, isDefinition: true, scopeLine: 498, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32*, i32*, i32*)* @normalize_y_m_d, variables: !529)
!529 = !{!530, !531, !532, !533, !534}
!530 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 1, scope: !528, file: !450, line: 497, type: !523)
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 2, scope: !528, file: !450, line: 497, type: !523)
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 3, scope: !528, file: !450, line: 497, type: !523)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dim", scope: !528, file: !450, line: 499, type: !49)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ordinal", scope: !535, file: !450, line: 538, type: !49)
!535 = distinct !DILexicalBlock(scope: !536, file: !450, line: 537, column: 14)
!536 = distinct !DILexicalBlock(scope: !537, file: !450, line: 528, column: 18)
!537 = distinct !DILexicalBlock(scope: !538, file: !450, line: 518, column: 13)
!538 = distinct !DILexicalBlock(scope: !539, file: !450, line: 513, column: 29)
!539 = distinct !DILexicalBlock(scope: !528, file: !450, line: 513, column: 9)
!540 = !DISubprogram(name: "days_in_month", scope: !450, file: !450, line: 206, type: !541, isLocal: true, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32)* @days_in_month, variables: !543)
!541 = !DISubroutineType(types: !542)
!542 = !{!49, !49, !49}
!543 = !{!544, !545}
!544 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "year", arg: 1, scope: !540, file: !450, line: 206, type: !49)
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "month", arg: 2, scope: !540, file: !450, line: 206, type: !49)
!546 = !DISubprogram(name: "is_leap", scope: !450, file: !450, line: 193, type: !547, isLocal: true, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @is_leap, variables: !549)
!547 = !DISubroutineType(types: !548)
!548 = !{!49, !49}
!549 = !{!550, !551}
!550 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "year", arg: 1, scope: !546, file: !450, line: 193, type: !49)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ayear", scope: !546, file: !450, line: 200, type: !552)
!552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!553 = !DISubprogram(name: "ymd_to_ord", scope: !450, file: !450, line: 338, type: !554, isLocal: true, isDefinition: true, scopeLine: 339, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32)* @ymd_to_ord, variables: !556)
!554 = !DISubroutineType(types: !555)
!555 = !{!49, !49, !49, !49}
!556 = !{!557, !558, !559}
!557 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "year", arg: 1, scope: !553, file: !450, line: 338, type: !49)
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "month", arg: 2, scope: !553, file: !450, line: 338, type: !49)
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "day", arg: 3, scope: !553, file: !450, line: 338, type: !49)
!560 = !DISubprogram(name: "days_before_year", scope: !450, file: !450, line: 234, type: !547, isLocal: true, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @days_before_year, variables: !561)
!561 = !{!562, !563}
!562 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "year", arg: 1, scope: !560, file: !450, line: 234, type: !49)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !560, file: !450, line: 236, type: !49)
!564 = !DISubprogram(name: "days_before_month", scope: !450, file: !450, line: 218, type: !541, isLocal: true, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32)* @days_before_month, variables: !565)
!565 = !{!566, !567, !568}
!566 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "year", arg: 1, scope: !564, file: !450, line: 218, type: !49)
!567 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "month", arg: 2, scope: !564, file: !450, line: 218, type: !49)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "days", scope: !564, file: !450, line: 220, type: !49)
!569 = !DISubprogram(name: "ord_to_ymd", scope: !450, file: !450, line: 254, type: !570, isLocal: true, isDefinition: true, scopeLine: 255, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32*, i32*, i32*)* @ord_to_ymd, variables: !572)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !49, !523, !523, !523}
!572 = !{!573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583}
!573 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ordinal", arg: 1, scope: !569, file: !450, line: 254, type: !49)
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "year", arg: 2, scope: !569, file: !450, line: 254, type: !523)
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "month", arg: 3, scope: !569, file: !450, line: 254, type: !523)
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "day", arg: 4, scope: !569, file: !450, line: 254, type: !523)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !569, file: !450, line: 256, type: !49)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n1", scope: !569, file: !450, line: 256, type: !49)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n4", scope: !569, file: !450, line: 256, type: !49)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n100", scope: !569, file: !450, line: 256, type: !49)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n400", scope: !569, file: !450, line: 256, type: !49)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "leapyear", scope: !569, file: !450, line: 256, type: !49)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "preceding", scope: !569, file: !450, line: 256, type: !49)
!584 = !DISubprogram(name: "date_subtract", scope: !450, file: !450, line: 2597, type: !131, isLocal: true, isDefinition: true, scopeLine: 2598, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @date_subtract, variables: !585)
!585 = !{!586, !587, !588, !593}
!586 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "left", arg: 1, scope: !584, file: !450, line: 2597, type: !10)
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "right", arg: 2, scope: !584, file: !450, line: 2597, type: !10)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left_ord", scope: !589, file: !450, line: 2605, type: !49)
!589 = distinct !DILexicalBlock(scope: !590, file: !450, line: 2603, column: 151)
!590 = distinct !DILexicalBlock(scope: !591, file: !450, line: 2603, column: 13)
!591 = distinct !DILexicalBlock(scope: !592, file: !450, line: 2602, column: 145)
!592 = distinct !DILexicalBlock(scope: !584, file: !450, line: 2602, column: 9)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "right_ord", scope: !589, file: !450, line: 2608, type: !49)
!594 = !DISubprogram(name: "date_hash", scope: !450, file: !450, line: 2781, type: !595, isLocal: true, isDefinition: true, scopeLine: 2782, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.PyDateTime_Date*)* @date_hash, variables: !597)
!595 = !DISubroutineType(types: !596)
!596 = !{!223, !355}
!597 = !{!598}
!598 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !594, file: !450, line: 2781, type: !355)
!599 = !DISubprogram(name: "generic_hash", scope: !450, file: !450, line: 2772, type: !600, isLocal: true, isDefinition: true, scopeLine: 2773, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8*, i32)* @generic_hash, variables: !602)
!600 = !DISubroutineType(types: !601)
!601 = !{!223, !377, !49}
!602 = !{!603, !604}
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data", arg: 1, scope: !599, file: !450, line: 2772, type: !377)
!604 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !599, file: !450, line: 2772, type: !49)
!605 = !DISubprogram(name: "date_str", scope: !450, file: !450, line: 2643, type: !500, isLocal: true, isDefinition: true, scopeLine: 2644, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyDateTime_Date*)* @date_str, variables: !606)
!606 = !{!607}
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !605, file: !450, line: 2643, type: !355)
!608 = !DISubprogram(name: "date_richcompare", scope: !450, file: !450, line: 2730, type: !276, isLocal: true, isDefinition: true, scopeLine: 2731, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @date_richcompare, variables: !609)
!609 = !{!610, !611, !612, !613}
!610 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !608, file: !450, line: 2730, type: !10)
!611 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "other", arg: 2, scope: !608, file: !450, line: 2730, type: !10)
!612 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !608, file: !450, line: 2730, type: !49)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "diff", scope: !614, file: !450, line: 2733, type: !49)
!614 = distinct !DILexicalBlock(scope: !615, file: !450, line: 2732, column: 147)
!615 = distinct !DILexicalBlock(scope: !608, file: !450, line: 2732, column: 9)
!616 = !DISubprogram(name: "diff_to_bool", scope: !450, file: !450, line: 1360, type: !617, isLocal: true, isDefinition: true, scopeLine: 1361, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32, i32)* @diff_to_bool, variables: !619)
!617 = !DISubroutineType(types: !618)
!618 = !{!10, !49, !49}
!619 = !{!620, !621, !622, !623}
!620 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "diff", arg: 1, scope: !616, file: !450, line: 1360, type: !49)
!621 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 2, scope: !616, file: !450, line: 1360, type: !49)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !616, file: !450, line: 1362, type: !10)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "istrue", scope: !616, file: !450, line: 1363, type: !49)
!624 = !DISubprogram(name: "date_fromtimestamp", scope: !450, file: !450, line: 2511, type: !131, isLocal: true, isDefinition: true, scopeLine: 2512, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @date_fromtimestamp, variables: !625)
!625 = !{!626, !627, !628, !629}
!626 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cls", arg: 1, scope: !624, file: !450, line: 2511, type: !10)
!627 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !624, file: !450, line: 2511, type: !10)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timestamp", scope: !624, file: !450, line: 2513, type: !10)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !624, file: !450, line: 2514, type: !10)
!630 = !DISubprogram(name: "date_local_from_object", scope: !450, file: !450, line: 2457, type: !131, isLocal: true, isDefinition: true, scopeLine: 2458, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @date_local_from_object, variables: !631)
!631 = !{!632, !633, !634, !649}
!632 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cls", arg: 1, scope: !630, file: !450, line: 2457, type: !10)
!633 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !630, file: !450, line: 2457, type: !10)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tm", scope: !630, file: !450, line: 2459, type: !635)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64, align: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !446, line: 133, size: 448, align: 64, elements: !637)
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !636, file: !446, line: 135, baseType: !49, size: 32, align: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !636, file: !446, line: 136, baseType: !49, size: 32, align: 32, offset: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !636, file: !446, line: 137, baseType: !49, size: 32, align: 32, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !636, file: !446, line: 138, baseType: !49, size: 32, align: 32, offset: 96)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !636, file: !446, line: 139, baseType: !49, size: 32, align: 32, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !636, file: !446, line: 140, baseType: !49, size: 32, align: 32, offset: 160)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !636, file: !446, line: 141, baseType: !49, size: 32, align: 32, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !636, file: !446, line: 142, baseType: !49, size: 32, align: 32, offset: 224)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !636, file: !446, line: 143, baseType: !49, size: 32, align: 32, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !636, file: !446, line: 146, baseType: !22, size: 64, align: 64, offset: 320)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !636, file: !446, line: 147, baseType: !34, size: 64, align: 64, offset: 384)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !630, file: !450, line: 2460, type: !445)
!650 = !DISubprogram(name: "date_fromordinal", scope: !450, file: !450, line: 2525, type: !131, isLocal: true, isDefinition: true, scopeLine: 2526, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @date_fromordinal, variables: !651)
!651 = !{!652, !653, !654, !655, !656, !659, !660}
!652 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cls", arg: 1, scope: !650, file: !450, line: 2525, type: !10)
!653 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !650, file: !450, line: 2525, type: !10)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !650, file: !450, line: 2527, type: !10)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ordinal", scope: !650, file: !450, line: 2528, type: !49)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "year", scope: !657, file: !450, line: 2531, type: !49)
!657 = distinct !DILexicalBlock(scope: !658, file: !450, line: 2530, column: 60)
!658 = distinct !DILexicalBlock(scope: !650, file: !450, line: 2530, column: 9)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "month", scope: !657, file: !450, line: 2532, type: !49)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "day", scope: !657, file: !450, line: 2533, type: !49)
!661 = !DISubprogram(name: "date_today", scope: !450, file: !450, line: 2488, type: !131, isLocal: true, isDefinition: true, scopeLine: 2489, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @date_today, variables: !662)
!662 = !{!663, !664, !665, !666, !667}
!663 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cls", arg: 1, scope: !661, file: !450, line: 2488, type: !10)
!664 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dummy", arg: 2, scope: !661, file: !450, line: 2488, type: !10)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "time", scope: !661, file: !450, line: 2490, type: !10)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !661, file: !450, line: 2491, type: !10)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !668, file: !450, line: 2505, type: !10)
!668 = distinct !DILexicalBlock(scope: !661, file: !450, line: 2505, column: 8)
!669 = !DISubprogram(name: "time_time", scope: !450, file: !450, line: 1312, type: !458, isLocal: true, isDefinition: true, scopeLine: 1313, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @time_time, variables: !670)
!670 = !{!671, !672, !673}
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !669, file: !450, line: 1314, type: !10)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "time", scope: !669, file: !450, line: 1315, type: !10)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !674, file: !450, line: 1321, type: !10)
!674 = distinct !DILexicalBlock(scope: !675, file: !450, line: 1321, column: 12)
!675 = distinct !DILexicalBlock(scope: !676, file: !450, line: 1317, column: 29)
!676 = distinct !DILexicalBlock(scope: !669, file: !450, line: 1317, column: 9)
!677 = !DISubprogram(name: "date_ctime", scope: !450, file: !450, line: 2650, type: !500, isLocal: true, isDefinition: true, scopeLine: 2651, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyDateTime_Date*)* @date_ctime, variables: !678)
!678 = !{!679}
!679 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !677, file: !450, line: 2650, type: !355)
!680 = !DISubprogram(name: "format_ctime", scope: !450, file: !450, line: 1004, type: !681, isLocal: true, isDefinition: true, scopeLine: 1005, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyDateTime_Date*, i32, i32, i32)* @format_ctime, variables: !683)
!681 = !DISubroutineType(types: !682)
!682 = !{!10, !355, !49, !49, !49}
!683 = !{!684, !685, !686, !687, !688}
!684 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "date", arg: 1, scope: !680, file: !450, line: 1004, type: !355)
!685 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hours", arg: 2, scope: !680, file: !450, line: 1004, type: !49)
!686 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "minutes", arg: 3, scope: !680, file: !450, line: 1004, type: !49)
!687 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seconds", arg: 4, scope: !680, file: !450, line: 1004, type: !49)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wday", scope: !680, file: !450, line: 1014, type: !49)
!689 = !DISubprogram(name: "weekday", scope: !450, file: !450, line: 345, type: !554, isLocal: true, isDefinition: true, scopeLine: 346, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32)* @weekday, variables: !690)
!690 = !{!691, !692, !693}
!691 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "year", arg: 1, scope: !689, file: !450, line: 345, type: !49)
!692 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "month", arg: 2, scope: !689, file: !450, line: 345, type: !49)
!693 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "day", arg: 3, scope: !689, file: !450, line: 345, type: !49)
!694 = !DISubprogram(name: "date_strftime", scope: !450, file: !450, line: 2656, type: !695, isLocal: true, isDefinition: true, scopeLine: 2657, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyDateTime_Date*, %struct._object*, %struct._object*)* @date_strftime, variables: !697)
!695 = !DISubroutineType(types: !696)
!696 = !{!10, !355, !10, !10}
!697 = !{!698, !699, !700, !701, !702, !703, !704}
!698 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !694, file: !450, line: 2656, type: !355)
!699 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !694, file: !450, line: 2656, type: !10)
!700 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !694, file: !450, line: 2656, type: !10)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !694, file: !450, line: 2661, type: !10)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tuple", scope: !694, file: !450, line: 2662, type: !10)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format", scope: !694, file: !450, line: 2663, type: !10)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !705, file: !450, line: 2676, type: !10)
!705 = distinct !DILexicalBlock(scope: !694, file: !450, line: 2676, column: 8)
!706 = !DISubprogram(name: "wrap_strftime", scope: !450, file: !450, line: 1142, type: !707, isLocal: true, isDefinition: true, scopeLine: 1144, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*, %struct._object*)* @wrap_strftime, variables: !709)
!707 = !DISubroutineType(types: !708)
!708 = !{!10, !10, !10, !10, !10}
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !738, !739, !743, !745, !746, !750, !752, !754, !757, !759, !762, !764, !767, !769}
!710 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !706, file: !450, line: 1142, type: !10)
!711 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 2, scope: !706, file: !450, line: 1142, type: !10)
!712 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timetuple", arg: 3, scope: !706, file: !450, line: 1142, type: !10)
!713 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tzinfoarg", arg: 4, scope: !706, file: !450, line: 1143, type: !10)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !706, file: !450, line: 1145, type: !10)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zreplacement", scope: !706, file: !450, line: 1147, type: !10)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Zreplacement", scope: !706, file: !450, line: 1148, type: !10)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "freplacement", scope: !706, file: !450, line: 1149, type: !10)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pin", scope: !706, file: !450, line: 1151, type: !34)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flen", scope: !706, file: !450, line: 1152, type: !16)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch", scope: !706, file: !450, line: 1153, type: !36)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newfmt", scope: !706, file: !450, line: 1155, type: !10)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pnew", scope: !706, file: !450, line: 1156, type: !57)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "totalnew", scope: !706, file: !450, line: 1157, type: !99)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "usednew", scope: !706, file: !450, line: 1159, type: !99)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptoappend", scope: !706, file: !450, line: 1161, type: !34)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ntoappend", scope: !706, file: !450, line: 1162, type: !16)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !728, file: !450, line: 1201, type: !735)
!728 = distinct !DILexicalBlock(scope: !729, file: !450, line: 1199, column: 45)
!729 = distinct !DILexicalBlock(scope: !730, file: !450, line: 1199, column: 17)
!730 = distinct !DILexicalBlock(scope: !731, file: !450, line: 1198, column: 29)
!731 = distinct !DILexicalBlock(scope: !732, file: !450, line: 1198, column: 18)
!732 = distinct !DILexicalBlock(scope: !733, file: !450, line: 1191, column: 18)
!733 = distinct !DILexicalBlock(scope: !734, file: !450, line: 1187, column: 13)
!734 = distinct !DILexicalBlock(scope: !706, file: !450, line: 1186, column: 35)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 800, align: 8, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 100)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tzinfo", scope: !728, file: !450, line: 1202, type: !10)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !740, file: !450, line: 1213, type: !10)
!740 = distinct !DILexicalBlock(scope: !741, file: !450, line: 1213, column: 24)
!741 = distinct !DILexicalBlock(scope: !742, file: !450, line: 1205, column: 74)
!742 = distinct !DILexicalBlock(scope: !728, file: !450, line: 1205, column: 21)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format", scope: !744, file: !450, line: 1284, type: !10)
!744 = distinct !DILexicalBlock(scope: !706, file: !450, line: 1283, column: 5)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "time", scope: !744, file: !450, line: 1285, type: !10)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !747, file: !450, line: 1293, type: !10)
!747 = distinct !DILexicalBlock(scope: !748, file: !450, line: 1293, column: 16)
!748 = distinct !DILexicalBlock(scope: !749, file: !450, line: 1290, column: 35)
!749 = distinct !DILexicalBlock(scope: !744, file: !450, line: 1290, column: 13)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !751, file: !450, line: 1295, type: !10)
!751 = distinct !DILexicalBlock(scope: !744, file: !450, line: 1295, column: 12)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !753, file: !450, line: 1298, type: !10)
!753 = distinct !DILexicalBlock(scope: !706, file: !450, line: 1298, column: 8)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !755, file: !450, line: 1298, type: !10)
!755 = distinct !DILexicalBlock(scope: !756, file: !450, line: 1298, column: 104)
!756 = distinct !DILexicalBlock(scope: !753, file: !450, line: 1298, column: 70)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !758, file: !450, line: 1299, type: !10)
!758 = distinct !DILexicalBlock(scope: !706, file: !450, line: 1299, column: 8)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !760, file: !450, line: 1299, type: !10)
!760 = distinct !DILexicalBlock(scope: !761, file: !450, line: 1299, column: 104)
!761 = distinct !DILexicalBlock(scope: !758, file: !450, line: 1299, column: 70)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !763, file: !450, line: 1300, type: !10)
!763 = distinct !DILexicalBlock(scope: !706, file: !450, line: 1300, column: 8)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !765, file: !450, line: 1300, type: !10)
!765 = distinct !DILexicalBlock(scope: !766, file: !450, line: 1300, column: 104)
!766 = distinct !DILexicalBlock(scope: !763, file: !450, line: 1300, column: 70)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !768, file: !450, line: 1301, type: !10)
!768 = distinct !DILexicalBlock(scope: !706, file: !450, line: 1301, column: 8)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !770, file: !450, line: 1301, type: !10)
!770 = distinct !DILexicalBlock(scope: !771, file: !450, line: 1301, column: 98)
!771 = distinct !DILexicalBlock(scope: !768, file: !450, line: 1301, column: 64)
!772 = !DISubprogram(name: "get_tzinfo_member", scope: !450, file: !450, line: 850, type: !121, isLocal: true, isDefinition: true, scopeLine: 851, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @get_tzinfo_member, variables: !773)
!773 = !{!774, !775}
!774 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !772, file: !450, line: 850, type: !10)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tzinfo", scope: !772, file: !450, line: 852, type: !10)
!776 = !DISubprogram(name: "format_utcoffset", scope: !450, file: !450, line: 1035, type: !777, isLocal: true, isDefinition: true, scopeLine: 1037, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i64, i8*, %struct._object*, %struct._object*)* @format_utcoffset, variables: !779)
!777 = !DISubroutineType(types: !778)
!778 = !{!49, !57, !99, !34, !10, !10}
!779 = !{!780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !794, !797, !799}
!780 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 1, scope: !776, file: !450, line: 1035, type: !57)
!781 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buflen", arg: 2, scope: !776, file: !450, line: 1035, type: !99)
!782 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sep", arg: 3, scope: !776, file: !450, line: 1035, type: !34)
!783 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tzinfo", arg: 4, scope: !776, file: !450, line: 1036, type: !10)
!784 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tzinfoarg", arg: 5, scope: !776, file: !450, line: 1036, type: !10)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !776, file: !450, line: 1038, type: !10)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hours", scope: !776, file: !450, line: 1039, type: !49)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "minutes", scope: !776, file: !450, line: 1039, type: !49)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seconds", scope: !776, file: !450, line: 1039, type: !49)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !776, file: !450, line: 1040, type: !36)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !791, file: !450, line: 1048, type: !10)
!791 = distinct !DILexicalBlock(scope: !792, file: !450, line: 1048, column: 12)
!792 = distinct !DILexicalBlock(scope: !793, file: !450, line: 1047, column: 38)
!793 = distinct !DILexicalBlock(scope: !776, file: !450, line: 1047, column: 9)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !795, file: !450, line: 1054, type: !10)
!795 = distinct !DILexicalBlock(scope: !796, file: !450, line: 1053, column: 53)
!796 = distinct !DILexicalBlock(scope: !776, file: !450, line: 1053, column: 9)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !798, file: !450, line: 1057, type: !10)
!798 = distinct !DILexicalBlock(scope: !795, file: !450, line: 1057, column: 12)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !800, file: !450, line: 1066, type: !10)
!800 = distinct !DILexicalBlock(scope: !776, file: !450, line: 1066, column: 8)
!801 = !DISubprogram(name: "call_utcoffset", scope: !450, file: !450, line: 920, type: !131, isLocal: true, isDefinition: true, scopeLine: 921, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @call_utcoffset, variables: !802)
!802 = !{!803, !804}
!803 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tzinfo", arg: 1, scope: !801, file: !450, line: 920, type: !10)
!804 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tzinfoarg", arg: 2, scope: !801, file: !450, line: 920, type: !10)
!805 = !DISubprogram(name: "call_tzinfo_method", scope: !450, file: !450, line: 870, type: !806, isLocal: true, isDefinition: true, scopeLine: 871, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*, %struct._object*)* @call_tzinfo_method, variables: !808)
!806 = !DISubroutineType(types: !807)
!807 = !{!10, !10, !57, !10}
!808 = !{!809, !810, !811, !812, !813, !819, !823}
!809 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tzinfo", arg: 1, scope: !805, file: !450, line: 870, type: !10)
!810 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !805, file: !450, line: 870, type: !57)
!811 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tzinfoarg", arg: 3, scope: !805, file: !450, line: 870, type: !10)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !805, file: !450, line: 872, type: !10)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !814, file: !450, line: 885, type: !10)
!814 = distinct !DILexicalBlock(scope: !815, file: !450, line: 885, column: 16)
!815 = distinct !DILexicalBlock(scope: !816, file: !450, line: 884, column: 121)
!816 = distinct !DILexicalBlock(scope: !817, file: !450, line: 884, column: 13)
!817 = distinct !DILexicalBlock(scope: !818, file: !450, line: 883, column: 151)
!818 = distinct !DILexicalBlock(scope: !805, file: !450, line: 883, column: 9)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !820, file: !450, line: 892, type: !10)
!820 = distinct !DILexicalBlock(scope: !821, file: !450, line: 892, column: 16)
!821 = distinct !DILexicalBlock(scope: !822, file: !450, line: 891, column: 105)
!822 = distinct !DILexicalBlock(scope: !817, file: !450, line: 890, column: 13)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !824, file: !450, line: 900, type: !10)
!824 = distinct !DILexicalBlock(scope: !825, file: !450, line: 900, column: 12)
!825 = distinct !DILexicalBlock(scope: !818, file: !450, line: 899, column: 10)
!826 = !DISubprogram(name: "delta_negative", scope: !450, file: !450, line: 1742, type: !827, isLocal: true, isDefinition: true, scopeLine: 1743, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyDateTime_Delta*)* @delta_negative, variables: !829)
!827 = !DISubroutineType(types: !828)
!828 = !{!10, !368}
!829 = !{!830}
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !826, file: !450, line: 1742, type: !368)
!831 = !DISubprogram(name: "divmod", scope: !450, file: !450, line: 139, type: !832, isLocal: true, isDefinition: true, scopeLine: 140, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32*)* @divmod, variables: !834)
!832 = !DISubroutineType(types: !833)
!833 = !{!49, !49, !49, !523}
!834 = !{!835, !836, !837, !838}
!835 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !831, file: !450, line: 139, type: !49)
!836 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 2, scope: !831, file: !450, line: 139, type: !49)
!837 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "r", arg: 3, scope: !831, file: !450, line: 139, type: !523)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "quo", scope: !831, file: !450, line: 141, type: !49)
!839 = !DISubprogram(name: "make_Zreplacement", scope: !450, file: !450, line: 1077, type: !131, isLocal: true, isDefinition: true, scopeLine: 1078, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @make_Zreplacement, variables: !840)
!840 = !{!841, !842, !843, !844, !845, !846, !850, !852, !854}
!841 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !839, file: !450, line: 1077, type: !10)
!842 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tzinfoarg", arg: 2, scope: !839, file: !450, line: 1077, type: !10)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !839, file: !450, line: 1079, type: !10)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tzinfo", scope: !839, file: !450, line: 1080, type: !10)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Zreplacement", scope: !839, file: !450, line: 1081, type: !10)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !847, file: !450, line: 1094, type: !10)
!847 = distinct !DILexicalBlock(scope: !848, file: !450, line: 1094, column: 12)
!848 = distinct !DILexicalBlock(scope: !849, file: !450, line: 1093, column: 36)
!849 = distinct !DILexicalBlock(scope: !839, file: !450, line: 1093, column: 9)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !851, file: !450, line: 1103, type: !10)
!851 = distinct !DILexicalBlock(scope: !839, file: !450, line: 1103, column: 8)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !853, file: !450, line: 1105, type: !10)
!853 = distinct !DILexicalBlock(scope: !839, file: !450, line: 1105, column: 8)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !855, file: !450, line: 1116, type: !10)
!855 = distinct !DILexicalBlock(scope: !839, file: !450, line: 1116, column: 8)
!856 = !DISubprogram(name: "call_tzname", scope: !450, file: !450, line: 946, type: !131, isLocal: true, isDefinition: true, scopeLine: 947, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @call_tzname, variables: !857)
!857 = !{!858, !859, !860, !861}
!858 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tzinfo", arg: 1, scope: !856, file: !450, line: 946, type: !10)
!859 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tzinfoarg", arg: 2, scope: !856, file: !450, line: 946, type: !10)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !856, file: !450, line: 948, type: !10)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !862, file: !450, line: 967, type: !10)
!862 = distinct !DILexicalBlock(scope: !863, file: !450, line: 967, column: 12)
!863 = distinct !DILexicalBlock(scope: !864, file: !450, line: 963, column: 81)
!864 = distinct !DILexicalBlock(scope: !856, file: !450, line: 963, column: 9)
!865 = !DISubprogram(name: "make_freplacement", scope: !450, file: !450, line: 1121, type: !121, isLocal: true, isDefinition: true, scopeLine: 1122, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @make_freplacement, variables: !866)
!866 = !{!867, !868}
!867 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !865, file: !450, line: 1121, type: !10)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "freplacement", scope: !865, file: !450, line: 1123, type: !869)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 512, align: 8, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 64)
!872 = !DISubprogram(name: "date_format", scope: !450, file: !450, line: 2681, type: !873, isLocal: true, isDefinition: true, scopeLine: 2682, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyDateTime_Date*, %struct._object*)* @date_format, variables: !875)
!873 = !DISubroutineType(types: !874)
!874 = !{!10, !355, !10}
!875 = !{!876, !877, !878}
!876 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !872, file: !450, line: 2681, type: !355)
!877 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !872, file: !450, line: 2681, type: !10)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format", scope: !872, file: !450, line: 2683, type: !10)
!879 = !DISubprogram(name: "date_timetuple", scope: !450, file: !450, line: 2743, type: !500, isLocal: true, isDefinition: true, scopeLine: 2744, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyDateTime_Date*)* @date_timetuple, variables: !880)
!880 = !{!881}
!881 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !879, file: !450, line: 2743, type: !355)
!882 = !DISubprogram(name: "build_struct_time", scope: !450, file: !450, line: 1330, type: !883, isLocal: true, isDefinition: true, scopeLine: 1331, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32, i32, i32, i32, i32, i32, i32)* @build_struct_time, variables: !885)
!883 = !DISubroutineType(types: !884)
!884 = !{!10, !49, !49, !49, !49, !49, !49, !49}
!885 = !{!886, !887, !888, !889, !890, !891, !892, !893, !894, !895}
!886 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 1, scope: !882, file: !450, line: 1330, type: !49)
!887 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 2, scope: !882, file: !450, line: 1330, type: !49)
!888 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 3, scope: !882, file: !450, line: 1330, type: !49)
!889 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hh", arg: 4, scope: !882, file: !450, line: 1330, type: !49)
!890 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mm", arg: 5, scope: !882, file: !450, line: 1330, type: !49)
!891 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ss", arg: 6, scope: !882, file: !450, line: 1330, type: !49)
!892 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dstflag", arg: 7, scope: !882, file: !450, line: 1330, type: !49)
!893 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "time", scope: !882, file: !450, line: 1332, type: !10)
!894 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !882, file: !450, line: 1333, type: !10)
!895 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !896, file: !450, line: 1346, type: !10)
!896 = distinct !DILexicalBlock(scope: !897, file: !450, line: 1346, column: 12)
!897 = distinct !DILexicalBlock(scope: !898, file: !450, line: 1336, column: 29)
!898 = distinct !DILexicalBlock(scope: !882, file: !450, line: 1336, column: 9)
!899 = !DISubprogram(name: "date_isocalendar", scope: !450, file: !450, line: 2706, type: !500, isLocal: true, isDefinition: true, scopeLine: 2707, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyDateTime_Date*)* @date_isocalendar, variables: !900)
!900 = !{!901, !902, !903, !904, !905, !906}
!901 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !899, file: !450, line: 2706, type: !355)
!902 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "year", scope: !899, file: !450, line: 2708, type: !49)
!903 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "week1_monday", scope: !899, file: !450, line: 2709, type: !49)
