; ModuleID = 'irs-onlybc/_elementtree.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !59, subprograms: !603, globals: !2427)
!1 = !DIFile(filename: "_elementtree.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !47, !52}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "XML_Error", file: !4, line: 54, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/expat/expat.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!6 = !DIEnumerator(name: "XML_ERROR_NONE", value: 0)
!7 = !DIEnumerator(name: "XML_ERROR_NO_MEMORY", value: 1)
!8 = !DIEnumerator(name: "XML_ERROR_SYNTAX", value: 2)
!9 = !DIEnumerator(name: "XML_ERROR_NO_ELEMENTS", value: 3)
!10 = !DIEnumerator(name: "XML_ERROR_INVALID_TOKEN", value: 4)
!11 = !DIEnumerator(name: "XML_ERROR_UNCLOSED_TOKEN", value: 5)
!12 = !DIEnumerator(name: "XML_ERROR_PARTIAL_CHAR", value: 6)
!13 = !DIEnumerator(name: "XML_ERROR_TAG_MISMATCH", value: 7)
!14 = !DIEnumerator(name: "XML_ERROR_DUPLICATE_ATTRIBUTE", value: 8)
!15 = !DIEnumerator(name: "XML_ERROR_JUNK_AFTER_DOC_ELEMENT", value: 9)
!16 = !DIEnumerator(name: "XML_ERROR_PARAM_ENTITY_REF", value: 10)
!17 = !DIEnumerator(name: "XML_ERROR_UNDEFINED_ENTITY", value: 11)
!18 = !DIEnumerator(name: "XML_ERROR_RECURSIVE_ENTITY_REF", value: 12)
!19 = !DIEnumerator(name: "XML_ERROR_ASYNC_ENTITY", value: 13)
!20 = !DIEnumerator(name: "XML_ERROR_BAD_CHAR_REF", value: 14)
!21 = !DIEnumerator(name: "XML_ERROR_BINARY_ENTITY_REF", value: 15)
!22 = !DIEnumerator(name: "XML_ERROR_ATTRIBUTE_EXTERNAL_ENTITY_REF", value: 16)
!23 = !DIEnumerator(name: "XML_ERROR_MISPLACED_XML_PI", value: 17)
!24 = !DIEnumerator(name: "XML_ERROR_UNKNOWN_ENCODING", value: 18)
!25 = !DIEnumerator(name: "XML_ERROR_INCORRECT_ENCODING", value: 19)
!26 = !DIEnumerator(name: "XML_ERROR_UNCLOSED_CDATA_SECTION", value: 20)
!27 = !DIEnumerator(name: "XML_ERROR_EXTERNAL_ENTITY_HANDLING", value: 21)
!28 = !DIEnumerator(name: "XML_ERROR_NOT_STANDALONE", value: 22)
!29 = !DIEnumerator(name: "XML_ERROR_UNEXPECTED_STATE", value: 23)
!30 = !DIEnumerator(name: "XML_ERROR_ENTITY_DECLARED_IN_PE", value: 24)
!31 = !DIEnumerator(name: "XML_ERROR_FEATURE_REQUIRES_XML_DTD", value: 25)
!32 = !DIEnumerator(name: "XML_ERROR_CANT_CHANGE_FEATURE_ONCE_PARSING", value: 26)
!33 = !DIEnumerator(name: "XML_ERROR_UNBOUND_PREFIX", value: 27)
!34 = !DIEnumerator(name: "XML_ERROR_UNDECLARING_PREFIX", value: 28)
!35 = !DIEnumerator(name: "XML_ERROR_INCOMPLETE_PE", value: 29)
!36 = !DIEnumerator(name: "XML_ERROR_XML_DECL", value: 30)
!37 = !DIEnumerator(name: "XML_ERROR_TEXT_DECL", value: 31)
!38 = !DIEnumerator(name: "XML_ERROR_PUBLICID", value: 32)
!39 = !DIEnumerator(name: "XML_ERROR_SUSPENDED", value: 33)
!40 = !DIEnumerator(name: "XML_ERROR_NOT_SUSPENDED", value: 34)
!41 = !DIEnumerator(name: "XML_ERROR_ABORTED", value: 35)
!42 = !DIEnumerator(name: "XML_ERROR_FINISHED", value: 36)
!43 = !DIEnumerator(name: "XML_ERROR_SUSPEND_PE", value: 37)
!44 = !DIEnumerator(name: "XML_ERROR_RESERVED_PREFIX_XML", value: 38)
!45 = !DIEnumerator(name: "XML_ERROR_RESERVED_PREFIX_XMLNS", value: 39)
!46 = !DIEnumerator(name: "XML_ERROR_RESERVED_NAMESPACE_URI", value: 40)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "XML_Status", file: !4, line: 45, size: 32, align: 32, elements: !48)
!48 = !{!49, !50, !51}
!49 = !DIEnumerator(name: "XML_STATUS_ERROR", value: 0)
!50 = !DIEnumerator(name: "XML_STATUS_OK", value: 1)
!51 = !DIEnumerator(name: "XML_STATUS_SUSPENDED", value: 2)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !53, line: 451, size: 32, align: 32, elements: !54)
!53 = !DIFile(filename: "./Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!54 = !{!55, !56, !57, !58}
!55 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!56 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!57 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!58 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!59 = !{!60, !406, !145, !150, !414, !416, !84, !419, !442, !445, !446, !454, !462, !479, !487, !505, !513, !530, !531, !533, !535, !537, !99, !72, !555, !563, !567, !586, !591, !592, !596, !597, !598, !599, !66}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !62, line: 109, baseType: !63)
!62 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !62, line: 105, size: 128, align: 64, elements: !64)
!64 = !{!65, !73}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !63, file: !62, line: 107, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !67, line: 177, baseType: !68)
!67 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !69, line: 102, baseType: !70)
!69 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !71, line: 181, baseType: !72)
!71 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!72 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !63, file: !62, line: 108, baseType: !74, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !62, line: 334, size: 3200, align: 64, elements: !76)
!76 = !{!77, !83, !87, !88, !89, !94, !158, !163, !168, !169, !174, !226, !257, !269, !275, !276, !277, !279, !281, !312, !313, !314, !323, !324, !329, !330, !332, !334, !344, !354, !372, !373, !374, !376, !378, !379, !381, !386, !391, !396, !397, !398, !399, !400, !401, !402, !403, !405}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !75, file: !62, line: 335, baseType: !78, size: 192, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !62, line: 114, baseType: !79)
!79 = !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 111, size: 192, align: 64, elements: !80)
!80 = !{!81, !82}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !79, file: !62, line: 112, baseType: !61, size: 128, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !79, file: !62, line: 113, baseType: !66, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !75, file: !62, line: 336, baseType: !84, size: 64, align: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!86 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !75, file: !62, line: 337, baseType: !66, size: 64, align: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !75, file: !62, line: 337, baseType: !66, size: 64, align: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !75, file: !62, line: 341, baseType: !90, size: 64, align: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !62, line: 308, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !60}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !75, file: !62, line: 342, baseType: !95, size: 64, align: 64, offset: 448)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !62, line: 314, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!99, !60, !100, !99}
!99 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !69, line: 48, baseType: !102)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !103, line: 246, size: 1728, align: 64, elements: !104)
!103 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!104 = !{!105, !106, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !126, !127, !128, !129, !131, !133, !135, !139, !142, !144, !146, !147, !148, !149, !153, !154}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !102, file: !103, line: 247, baseType: !99, size: 32, align: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !102, file: !103, line: 252, baseType: !107, size: 64, align: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !102, file: !103, line: 253, baseType: !107, size: 64, align: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !102, file: !103, line: 254, baseType: !107, size: 64, align: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !102, file: !103, line: 255, baseType: !107, size: 64, align: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !102, file: !103, line: 256, baseType: !107, size: 64, align: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !102, file: !103, line: 257, baseType: !107, size: 64, align: 64, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !102, file: !103, line: 258, baseType: !107, size: 64, align: 64, offset: 448)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !102, file: !103, line: 259, baseType: !107, size: 64, align: 64, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !102, file: !103, line: 261, baseType: !107, size: 64, align: 64, offset: 576)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !102, file: !103, line: 262, baseType: !107, size: 64, align: 64, offset: 640)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !102, file: !103, line: 263, baseType: !107, size: 64, align: 64, offset: 704)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !102, file: !103, line: 265, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !103, line: 161, size: 192, align: 64, elements: !121)
!121 = !{!122, !123, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !120, file: !103, line: 162, baseType: !119, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !120, file: !103, line: 163, baseType: !124, size: 64, align: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !120, file: !103, line: 167, baseType: !99, size: 32, align: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !102, file: !103, line: 267, baseType: !124, size: 64, align: 64, offset: 832)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !102, file: !103, line: 269, baseType: !99, size: 32, align: 32, offset: 896)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !102, file: !103, line: 273, baseType: !99, size: 32, align: 32, offset: 928)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !102, file: !103, line: 275, baseType: !130, size: 64, align: 64, offset: 960)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !71, line: 140, baseType: !72)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !102, file: !103, line: 279, baseType: !132, size: 16, align: 16, offset: 1024)
!132 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !102, file: !103, line: 280, baseType: !134, size: 8, align: 8, offset: 1040)
!134 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !102, file: !103, line: 281, baseType: !136, size: 8, align: 8, offset: 1048)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 8, align: 8, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 1)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !102, file: !103, line: 285, baseType: !140, size: 64, align: 64, offset: 1088)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !103, line: 155, baseType: null)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !102, file: !103, line: 294, baseType: !143, size: 64, align: 64, offset: 1152)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !71, line: 141, baseType: !72)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !102, file: !103, line: 303, baseType: !145, size: 64, align: 64, offset: 1216)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !102, file: !103, line: 304, baseType: !145, size: 64, align: 64, offset: 1280)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !102, file: !103, line: 305, baseType: !145, size: 64, align: 64, offset: 1344)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !102, file: !103, line: 306, baseType: !145, size: 64, align: 64, offset: 1408)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !102, file: !103, line: 307, baseType: !150, size: 64, align: 64, offset: 1472)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !151, line: 62, baseType: !152)
!151 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!152 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !102, file: !103, line: 309, baseType: !99, size: 32, align: 32, offset: 1536)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !102, file: !103, line: 311, baseType: !155, size: 160, align: 8, offset: 1568)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 160, align: 8, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 20)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !75, file: !62, line: 343, baseType: !159, size: 64, align: 64, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !62, line: 316, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!60, !60, !107}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !75, file: !62, line: 344, baseType: !164, size: 64, align: 64, offset: 576)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !62, line: 318, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!99, !60, !107, !60}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !75, file: !62, line: 345, baseType: !145, size: 64, align: 64, offset: 640)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !75, file: !62, line: 346, baseType: !170, size: 64, align: 64, offset: 704)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !62, line: 320, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!60, !60}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !75, file: !62, line: 350, baseType: !175, size: 64, align: 64, offset: 768)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !62, line: 278, baseType: !177)
!177 = !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 236, size: 2176, align: 64, elements: !178)
!178 = !{!179, !184, !185, !186, !187, !188, !193, !195, !196, !197, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !177, file: !62, line: 241, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !62, line: 166, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!60, !60, !60}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !177, file: !62, line: 242, baseType: !180, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !177, file: !62, line: 243, baseType: !180, size: 64, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !177, file: !62, line: 244, baseType: !180, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !177, file: !62, line: 245, baseType: !180, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !177, file: !62, line: 246, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !62, line: 167, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!60, !60, !60, !60}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !177, file: !62, line: 247, baseType: !194, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !62, line: 165, baseType: !171)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !177, file: !62, line: 248, baseType: !194, size: 64, align: 64, offset: 448)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !177, file: !62, line: 249, baseType: !194, size: 64, align: 64, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !177, file: !62, line: 250, baseType: !198, size: 64, align: 64, offset: 576)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !62, line: 168, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!99, !60}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !177, file: !62, line: 251, baseType: !194, size: 64, align: 64, offset: 640)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !177, file: !62, line: 252, baseType: !180, size: 64, align: 64, offset: 704)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !177, file: !62, line: 253, baseType: !180, size: 64, align: 64, offset: 768)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !177, file: !62, line: 254, baseType: !180, size: 64, align: 64, offset: 832)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !177, file: !62, line: 255, baseType: !180, size: 64, align: 64, offset: 896)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !177, file: !62, line: 256, baseType: !180, size: 64, align: 64, offset: 960)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !177, file: !62, line: 257, baseType: !194, size: 64, align: 64, offset: 1024)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !177, file: !62, line: 258, baseType: !145, size: 64, align: 64, offset: 1088)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !177, file: !62, line: 259, baseType: !194, size: 64, align: 64, offset: 1152)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !177, file: !62, line: 261, baseType: !180, size: 64, align: 64, offset: 1216)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !177, file: !62, line: 262, baseType: !180, size: 64, align: 64, offset: 1280)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !177, file: !62, line: 263, baseType: !180, size: 64, align: 64, offset: 1344)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !177, file: !62, line: 264, baseType: !180, size: 64, align: 64, offset: 1408)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !177, file: !62, line: 265, baseType: !189, size: 64, align: 64, offset: 1472)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !177, file: !62, line: 266, baseType: !180, size: 64, align: 64, offset: 1536)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !177, file: !62, line: 267, baseType: !180, size: 64, align: 64, offset: 1600)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !177, file: !62, line: 268, baseType: !180, size: 64, align: 64, offset: 1664)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !177, file: !62, line: 269, baseType: !180, size: 64, align: 64, offset: 1728)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !177, file: !62, line: 270, baseType: !180, size: 64, align: 64, offset: 1792)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !177, file: !62, line: 272, baseType: !180, size: 64, align: 64, offset: 1856)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !177, file: !62, line: 273, baseType: !180, size: 64, align: 64, offset: 1920)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !177, file: !62, line: 274, baseType: !180, size: 64, align: 64, offset: 1984)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !177, file: !62, line: 275, baseType: !180, size: 64, align: 64, offset: 2048)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !177, file: !62, line: 277, baseType: !194, size: 64, align: 64, offset: 2112)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !75, file: !62, line: 351, baseType: !227, size: 64, align: 64, offset: 832)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !62, line: 292, baseType: !229)
!229 = !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 280, size: 640, align: 64, elements: !230)
!230 = !{!231, !236, !237, !242, !243, !244, !249, !250, !255, !256}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !229, file: !62, line: 281, baseType: !232, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !62, line: 169, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!66, !60}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !229, file: !62, line: 282, baseType: !180, size: 64, align: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !229, file: !62, line: 283, baseType: !238, size: 64, align: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !62, line: 170, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!60, !60, !66}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !229, file: !62, line: 284, baseType: !238, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !229, file: !62, line: 285, baseType: !145, size: 64, align: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !229, file: !62, line: 286, baseType: !245, size: 64, align: 64, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !62, line: 172, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!99, !60, !66, !60}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !229, file: !62, line: 287, baseType: !145, size: 64, align: 64, offset: 384)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !229, file: !62, line: 288, baseType: !251, size: 64, align: 64, offset: 448)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !62, line: 231, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!99, !60, !60}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !229, file: !62, line: 290, baseType: !180, size: 64, align: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !229, file: !62, line: 291, baseType: !238, size: 64, align: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !75, file: !62, line: 352, baseType: !258, size: 64, align: 64, offset: 896)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !62, line: 298, baseType: !260)
!260 = !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 294, size: 192, align: 64, elements: !261)
!261 = !{!262, !263, !264}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !260, file: !62, line: 295, baseType: !232, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !260, file: !62, line: 296, baseType: !180, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !260, file: !62, line: 297, baseType: !265, size: 64, align: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !62, line: 174, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!99, !60, !60, !60}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !75, file: !62, line: 356, baseType: !270, size: 64, align: 64, offset: 960)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !62, line: 321, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !60}
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !67, line: 186, baseType: !66)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !75, file: !62, line: 357, baseType: !189, size: 64, align: 64, offset: 1024)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !75, file: !62, line: 358, baseType: !170, size: 64, align: 64, offset: 1088)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !75, file: !62, line: 359, baseType: !278, size: 64, align: 64, offset: 1152)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !62, line: 317, baseType: !181)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !75, file: !62, line: 360, baseType: !280, size: 64, align: 64, offset: 1216)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !62, line: 319, baseType: !266)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !75, file: !62, line: 363, baseType: !282, size: 64, align: 64, offset: 1280)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !62, line: 304, baseType: !284)
!284 = !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 301, size: 128, align: 64, elements: !285)
!285 = !{!286, !307}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !284, file: !62, line: 302, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !62, line: 193, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!99, !60, !291, !99}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !62, line: 191, baseType: !293)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !62, line: 178, size: 640, align: 64, elements: !294)
!294 = !{!295, !296, !297, !298, !299, !300, !301, !302, !304, !305, !306}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !293, file: !62, line: 179, baseType: !145, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !293, file: !62, line: 180, baseType: !60, size: 64, align: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !293, file: !62, line: 181, baseType: !66, size: 64, align: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !293, file: !62, line: 182, baseType: !66, size: 64, align: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !293, file: !62, line: 184, baseType: !99, size: 32, align: 32, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !293, file: !62, line: 185, baseType: !99, size: 32, align: 32, offset: 288)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !293, file: !62, line: 186, baseType: !107, size: 64, align: 64, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !293, file: !62, line: 187, baseType: !303, size: 64, align: 64, offset: 384)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !293, file: !62, line: 188, baseType: !303, size: 64, align: 64, offset: 448)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !293, file: !62, line: 189, baseType: !303, size: 64, align: 64, offset: 512)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !293, file: !62, line: 190, baseType: !145, size: 64, align: 64, offset: 576)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !284, file: !62, line: 303, baseType: !308, size: 64, align: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !62, line: 194, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{null, !60, !291}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !75, file: !62, line: 366, baseType: !152, size: 64, align: 64, offset: 1344)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !75, file: !62, line: 368, baseType: !84, size: 64, align: 64, offset: 1408)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !75, file: !62, line: 372, baseType: !315, size: 64, align: 64, offset: 1472)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !62, line: 233, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!99, !60, !319, !145}
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !62, line: 232, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!99, !60, !145}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !75, file: !62, line: 375, baseType: !198, size: 64, align: 64, offset: 1536)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !75, file: !62, line: 379, baseType: !325, size: 64, align: 64, offset: 1600)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !62, line: 322, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!60, !60, !60, !99}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !75, file: !62, line: 382, baseType: !66, size: 64, align: 64, offset: 1664)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !75, file: !62, line: 385, baseType: !331, size: 64, align: 64, offset: 1728)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !62, line: 323, baseType: !171)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !75, file: !62, line: 386, baseType: !333, size: 64, align: 64, offset: 1792)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !62, line: 324, baseType: !171)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !75, file: !62, line: 389, baseType: !335, size: 64, align: 64, offset: 1856)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !337, line: 40, size: 256, align: 64, elements: !338)
!337 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!338 = !{!339, !340, !342, !343}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !336, file: !337, line: 41, baseType: !84, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !336, file: !337, line: 42, baseType: !341, size: 64, align: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !337, line: 18, baseType: !181)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !336, file: !337, line: 43, baseType: !99, size: 32, align: 32, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !336, file: !337, line: 45, baseType: !84, size: 64, align: 64, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !75, file: !62, line: 390, baseType: !345, size: 64, align: 64, offset: 1920)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !347, line: 18, size: 320, align: 64, elements: !348)
!347 = !DIFile(filename: "./Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!348 = !{!349, !350, !351, !352, !353}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !346, file: !347, line: 19, baseType: !107, size: 64, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !346, file: !347, line: 20, baseType: !99, size: 32, align: 32, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !346, file: !347, line: 21, baseType: !66, size: 64, align: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !346, file: !347, line: 22, baseType: !99, size: 32, align: 32, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !346, file: !347, line: 23, baseType: !107, size: 64, align: 64, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !75, file: !62, line: 391, baseType: !355, size: 64, align: 64, offset: 1984)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !357, line: 11, size: 320, align: 64, elements: !358)
!357 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!358 = !{!359, !360, !365, !370, !371}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !356, file: !357, line: 12, baseType: !107, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !356, file: !357, line: 13, baseType: !361, size: 64, align: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !357, line: 8, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!60, !60, !145}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !356, file: !357, line: 14, baseType: !366, size: 64, align: 64, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !357, line: 9, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{!99, !60, !60, !145}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !356, file: !357, line: 15, baseType: !107, size: 64, align: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !356, file: !357, line: 16, baseType: !145, size: 64, align: 64, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !75, file: !62, line: 392, baseType: !74, size: 64, align: 64, offset: 2048)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !75, file: !62, line: 393, baseType: !60, size: 64, align: 64, offset: 2112)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !75, file: !62, line: 394, baseType: !375, size: 64, align: 64, offset: 2176)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !62, line: 325, baseType: !190)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !75, file: !62, line: 395, baseType: !377, size: 64, align: 64, offset: 2240)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !62, line: 326, baseType: !266)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !75, file: !62, line: 396, baseType: !66, size: 64, align: 64, offset: 2304)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !75, file: !62, line: 397, baseType: !380, size: 64, align: 64, offset: 2368)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !62, line: 327, baseType: !266)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !75, file: !62, line: 398, baseType: !382, size: 64, align: 64, offset: 2432)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !62, line: 329, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!60, !74, !66}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !75, file: !62, line: 399, baseType: !387, size: 64, align: 64, offset: 2496)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !62, line: 328, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{!60, !74, !60, !60}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !75, file: !62, line: 400, baseType: !392, size: 64, align: 64, offset: 2560)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !62, line: 307, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{null, !145}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !75, file: !62, line: 401, baseType: !198, size: 64, align: 64, offset: 2624)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !75, file: !62, line: 402, baseType: !60, size: 64, align: 64, offset: 2688)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !75, file: !62, line: 403, baseType: !60, size: 64, align: 64, offset: 2752)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !75, file: !62, line: 404, baseType: !60, size: 64, align: 64, offset: 2816)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !75, file: !62, line: 405, baseType: !60, size: 64, align: 64, offset: 2880)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !75, file: !62, line: 406, baseType: !60, size: 64, align: 64, offset: 2944)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !75, file: !62, line: 407, baseType: !90, size: 64, align: 64, offset: 3008)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !75, file: !62, line: 410, baseType: !404, size: 32, align: 32, offset: 3072)
!404 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !75, file: !62, line: 412, baseType: !90, size: 64, align: 64, offset: 3136)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "elementtreestate", file: !408, line: 86, baseType: !409)
!408 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_elementtree.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!409 = !DICompositeType(tag: DW_TAG_structure_type, file: !408, line: 82, size: 192, align: 64, elements: !410)
!410 = !{!411, !412, !413}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "parseerror_obj", scope: !409, file: !408, line: 83, baseType: !60, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "deepcopy_obj", scope: !409, file: !408, line: 84, baseType: !60, size: 64, align: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "elementpath_obj", scope: !409, file: !408, line: 85, baseType: !60, size: 64, align: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !418)
!418 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElementObject", file: !408, line: 220, baseType: !421)
!421 = !DICompositeType(tag: DW_TAG_structure_type, file: !408, line: 198, size: 448, align: 64, elements: !422)
!422 = !{!423, !424, !425, !426, !427, !441}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !421, file: !408, line: 199, baseType: !61, size: 128, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !421, file: !408, line: 202, baseType: !60, size: 64, align: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !421, file: !408, line: 210, baseType: !60, size: 64, align: 64, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !421, file: !408, line: 214, baseType: !60, size: 64, align: 64, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !421, file: !408, line: 216, baseType: !428, size: 64, align: 64, offset: 320)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElementObjectExtra", file: !408, line: 196, baseType: !430)
!430 = !DICompositeType(tag: DW_TAG_structure_type, file: !408, line: 182, size: 448, align: 64, elements: !431)
!431 = !{!432, !433, !434, !435, !437}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "attrib", scope: !430, file: !408, line: 185, baseType: !60, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !430, file: !408, line: 188, baseType: !99, size: 32, align: 32, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !430, file: !408, line: 189, baseType: !99, size: 32, align: 32, offset: 96)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !430, file: !408, line: 192, baseType: !436, size: 64, align: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_children", scope: !430, file: !408, line: 194, baseType: !438, size: 256, align: 64, offset: 192)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 256, align: 64, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 4)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !421, file: !408, line: 218, baseType: !60, size: 64, align: 64, offset: 384)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_uintptr_t", file: !67, line: 153, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !444, line: 122, baseType: !152)
!444 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !448, line: 41, baseType: !449)
!448 = !DIFile(filename: "./Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!449 = !DICompositeType(tag: DW_TAG_structure_type, file: !448, line: 31, size: 320, align: 64, elements: !450)
!450 = !{!451, !452, !453}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !449, file: !448, line: 32, baseType: !78, size: 192, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !449, file: !448, line: 33, baseType: !274, size: 64, align: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !449, file: !448, line: 34, baseType: !136, size: 8, align: 8, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !456, line: 40, baseType: !457)
!456 = !DIFile(filename: "./Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!457 = !DICompositeType(tag: DW_TAG_structure_type, file: !456, line: 23, size: 320, align: 64, elements: !458)
!458 = !{!459, !460, !461}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !457, file: !456, line: 24, baseType: !78, size: 192, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !457, file: !456, line: 26, baseType: !436, size: 64, align: 64, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !457, file: !456, line: 39, baseType: !66, size: 64, align: 64, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "TreeBuilderObject", file: !408, line: 2228, baseType: !464)
!464 = !DICompositeType(tag: DW_TAG_structure_type, file: !408, line: 2207, size: 896, align: 64, elements: !465)
!465 = !{!466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !464, file: !408, line: 2208, baseType: !61, size: 128, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !464, file: !408, line: 2210, baseType: !60, size: 64, align: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "this", scope: !464, file: !408, line: 2212, baseType: !60, size: 64, align: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !464, file: !408, line: 2213, baseType: !60, size: 64, align: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !464, file: !408, line: 2215, baseType: !60, size: 64, align: 64, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !464, file: !408, line: 2217, baseType: !60, size: 64, align: 64, offset: 384)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !464, file: !408, line: 2218, baseType: !66, size: 64, align: 64, offset: 448)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "element_factory", scope: !464, file: !408, line: 2220, baseType: !60, size: 64, align: 64, offset: 512)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !464, file: !408, line: 2223, baseType: !60, size: 64, align: 64, offset: 576)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "start_event_obj", scope: !464, file: !408, line: 2224, baseType: !60, size: 64, align: 64, offset: 640)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "end_event_obj", scope: !464, file: !408, line: 2225, baseType: !60, size: 64, align: 64, offset: 704)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "start_ns_event_obj", scope: !464, file: !408, line: 2226, baseType: !60, size: 64, align: 64, offset: 768)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "end_ns_event_obj", scope: !464, file: !408, line: 2227, baseType: !60, size: 64, align: 64, offset: 832)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !481, line: 33, baseType: !482)
!481 = !DIFile(filename: "./Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!482 = !DICompositeType(tag: DW_TAG_structure_type, file: !481, line: 25, size: 256, align: 64, elements: !483)
!483 = !{!484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !482, file: !481, line: 26, baseType: !78, size: 192, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !482, file: !481, line: 27, baseType: !486, size: 64, align: 64, offset: 192)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 64, align: 64, elements: !137)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !53, line: 351, baseType: !489)
!489 = !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 217, size: 384, align: 64, elements: !490)
!490 = !{!491, !492, !493, !494, !502}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !489, file: !53, line: 291, baseType: !61, size: 128, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !489, file: !53, line: 292, baseType: !66, size: 64, align: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !489, file: !53, line: 293, baseType: !274, size: 64, align: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !489, file: !53, line: 349, baseType: !495, size: 32, align: 32, offset: 256)
!495 = !DICompositeType(tag: DW_TAG_structure_type, scope: !489, file: !53, line: 294, size: 32, align: 32, elements: !496)
!496 = !{!497, !498, !499, !500, !501}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !495, file: !53, line: 303, baseType: !404, size: 2, align: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !495, file: !53, line: 331, baseType: !404, size: 3, align: 32, offset: 2)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !495, file: !53, line: 336, baseType: !404, size: 1, align: 32, offset: 5)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !495, file: !53, line: 340, baseType: !404, size: 1, align: 32, offset: 6)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !495, file: !53, line: 345, baseType: !404, size: 1, align: 32, offset: 7)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !489, file: !53, line: 350, baseType: !503, size: 64, align: 64, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !151, line: 90, baseType: !99)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !53, line: 363, baseType: !507)
!507 = !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 356, size: 576, align: 64, elements: !508)
!508 = !{!509, !510, !511, !512}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !507, file: !53, line: 357, baseType: !488, size: 384, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !507, file: !53, line: 358, baseType: !66, size: 64, align: 64, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !507, file: !53, line: 360, baseType: !107, size: 64, align: 64, offset: 448)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !507, file: !53, line: 361, baseType: !66, size: 64, align: 64, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !53, line: 376, baseType: !515)
!515 = !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 368, size: 640, align: 64, elements: !516)
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !515, file: !53, line: 369, baseType: !506, size: 576, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !515, file: !53, line: 375, baseType: !519, size: 64, align: 64, offset: 576)
!519 = !DICompositeType(tag: DW_TAG_union_type, scope: !515, file: !53, line: 370, size: 64, align: 64, elements: !520)
!520 = !{!521, !522, !525, !528}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !519, file: !53, line: 371, baseType: !145, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !519, file: !53, line: 372, baseType: !523, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !53, line: 134, baseType: !418)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !519, file: !53, line: 373, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !53, line: 129, baseType: !132)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !519, file: !53, line: 374, baseType: !529, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !53, line: 121, baseType: !404)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !524)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !527)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !530)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElementIterObject", file: !408, line: 1949, baseType: !539)
!539 = !DICompositeType(tag: DW_TAG_structure_type, file: !408, line: 1942, size: 384, align: 64, elements: !540)
!540 = !{!541, !542, !551, !552, !553, !554}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !539, file: !408, line: 1943, baseType: !61, size: 128, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "parent_stack", scope: !539, file: !408, line: 1944, baseType: !543, size: 64, align: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParentLocator", file: !408, line: 1940, baseType: !545)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "ParentLocator_t", file: !408, line: 1936, size: 192, align: 64, elements: !546)
!546 = !{!547, !548, !549}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !545, file: !408, line: 1937, baseType: !419, size: 64, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "child_index", scope: !545, file: !408, line: 1938, baseType: !66, size: 64, align: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !545, file: !408, line: 1939, baseType: !550, size: 64, align: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "root_element", scope: !539, file: !408, line: 1945, baseType: !419, size: 64, align: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "sought_tag", scope: !539, file: !408, line: 1946, baseType: !60, size: 64, align: 64, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "root_done", scope: !539, file: !408, line: 1947, baseType: !99, size: 32, align: 32, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "gettext", scope: !539, file: !408, line: 1948, baseType: !99, size: 32, align: 32, offset: 352)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_StartNamespaceDeclHandler", file: !4, line: 378, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64, align: 64)
!557 = !DISubroutineType(types: !558)
!558 = !{null, !145, !559, !559}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Char", file: !562, line: 98, baseType: !86)
!562 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/expat/expat_external.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_EndNamespaceDeclHandler", file: !4, line: 383, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64, align: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !145, !559}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLParserObject", file: !408, line: 2742, baseType: !569)
!569 = !DICompositeType(tag: DW_TAG_structure_type, file: !408, line: 2722, size: 832, align: 64, elements: !570)
!570 = !{!571, !572, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !569, file: !408, line: 2723, baseType: !61, size: 128, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !569, file: !408, line: 2725, baseType: !573, size: 64, align: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_Parser", file: !4, line: 25, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64, align: 64)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "XML_ParserStruct", file: !4, line: 24, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !569, file: !408, line: 2727, baseType: !60, size: 64, align: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "entity", scope: !569, file: !408, line: 2728, baseType: !60, size: 64, align: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !569, file: !408, line: 2730, baseType: !60, size: 64, align: 64, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "handle_start", scope: !569, file: !408, line: 2732, baseType: !60, size: 64, align: 64, offset: 384)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "handle_data", scope: !569, file: !408, line: 2733, baseType: !60, size: 64, align: 64, offset: 448)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "handle_end", scope: !569, file: !408, line: 2734, baseType: !60, size: 64, align: 64, offset: 512)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "handle_comment", scope: !569, file: !408, line: 2736, baseType: !60, size: 64, align: 64, offset: 576)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "handle_pi", scope: !569, file: !408, line: 2737, baseType: !60, size: 64, align: 64, offset: 640)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "handle_doctype", scope: !569, file: !408, line: 2738, baseType: !60, size: 64, align: 64, offset: 704)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "handle_close", scope: !569, file: !408, line: 2740, baseType: !60, size: 64, align: 64, offset: 768)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_StartElementHandler", file: !4, line: 252, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{null, !145, !559, !590}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_EndElementHandler", file: !4, line: 256, baseType: !564)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_DefaultHandler", file: !4, line: 291, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64, align: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !145, !559, !99}
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_CharacterDataHandler", file: !4, line: 261, baseType: !593)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_CommentHandler", file: !4, line: 272, baseType: !564)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_ProcessingInstructionHandler", file: !4, line: 266, baseType: !556)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "XML_StartDoctypeDeclHandler", file: !4, line: 298, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64, align: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !145, !559, !559, !559, !99}
!603 = !{!604, !625, !640, !653, !664, !667, !673, !677, !685, !703, !725, !728, !751, !772, !803, !810, !816, !826, !830, !835, !866, !937, !944, !956, !962, !986, !990, !1015, !1019, !1030, !1035, !1051, !1055, !1061, !1076, !1096, !1101, !1104, !1109, !1114, !1124, !1147, !1209, !1248, !1256, !1304, !1336, !1347, !1357, !1368, !1376, !1386, !1393, !1406, !1424, !1443, !1463, !1468, !1490, !1497, !1505, !1511, !1529, !1533, !1541, !1551, !1555, !1559, !1569, !1585, !1621, !1630, !1636, !1658, !1662, !1675, !1701, !1735, !1741, !1746, !1755, !1798, !1863, !1874, !1883, !1924, !1937, !1983, !2082, !2099, !2119, !2125, !2129, !2176, !2223, !2257, !2275, !2300, !2314, !2331, !2363, !2421}
!604 = !DISubprogram(name: "PyInit__elementtree", scope: !408, file: !408, line: 3705, type: !605, isLocal: false, isDefinition: true, scopeLine: 3706, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__elementtree, variables: !607)
!605 = !DISubroutineType(types: !606)
!606 = !{!60}
!607 = !{!608, !609, !610, !611, !613, !616, !621, !622, !624}
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !604, file: !408, line: 3707, type: !60)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !604, file: !408, line: 3707, type: !60)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !604, file: !408, line: 3708, type: !406)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !612, file: !408, line: 3734, type: !60)
!612 = distinct !DILexicalBlock(scope: !604, file: !408, line: 3734, column: 8)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !614, file: !408, line: 3734, type: !60)
!614 = distinct !DILexicalBlock(scope: !615, file: !408, line: 3734, column: 96)
!615 = distinct !DILexicalBlock(scope: !612, file: !408, line: 3734, column: 62)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !617, file: !408, line: 3743, type: !150)
!617 = distinct !DILexicalBlock(scope: !618, file: !408, line: 3743, column: 28)
!618 = distinct !DILexicalBlock(scope: !619, file: !408, line: 3743, column: 13)
!619 = distinct !DILexicalBlock(scope: !620, file: !408, line: 3741, column: 21)
!620 = distinct !DILexicalBlock(scope: !604, file: !408, line: 3741, column: 9)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !617, file: !408, line: 3743, type: !150)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !623, file: !408, line: 3743, type: !416)
!623 = distinct !DILexicalBlock(scope: !617, file: !408, line: 3743, column: 2063)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !623, file: !408, line: 3743, type: !99)
!625 = !DISubprogram(name: "subelement", scope: !408, file: !408, line: 561, type: !191, isLocal: true, isDefinition: true, scopeLine: 562, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @subelement, variables: !626)
!626 = !{!627, !628, !629, !630, !631, !632, !633, !634, !636}
!627 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !625, file: !408, line: 561, type: !60)
!628 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !625, file: !408, line: 561, type: !60)
!629 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !625, file: !408, line: 561, type: !60)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "elem", scope: !625, file: !408, line: 563, type: !60)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "parent", scope: !625, file: !408, line: 565, type: !419)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tag", scope: !625, file: !408, line: 566, type: !60)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "attrib", scope: !625, file: !408, line: 567, type: !60)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !635, file: !408, line: 596, type: !60)
!635 = distinct !DILexicalBlock(scope: !625, file: !408, line: 596, column: 8)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !637, file: !408, line: 601, type: !60)
!637 = distinct !DILexicalBlock(scope: !638, file: !408, line: 601, column: 12)
!638 = distinct !DILexicalBlock(scope: !639, file: !408, line: 600, column: 51)
!639 = distinct !DILexicalBlock(scope: !625, file: !408, line: 600, column: 9)
!640 = !DISubprogram(name: "get_attrib_from_keywords", scope: !408, file: !408, line: 341, type: !172, isLocal: true, isDefinition: true, scopeLine: 342, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @get_attrib_from_keywords, variables: !641)
!641 = !{!642, !643, !644, !645, !651}
!642 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 1, scope: !640, file: !408, line: 341, type: !60)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "attrib_str", scope: !640, file: !408, line: 343, type: !60)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "attrib", scope: !640, file: !408, line: 344, type: !60)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !646, file: !408, line: 351, type: !60)
!646 = distinct !DILexicalBlock(scope: !647, file: !408, line: 351, column: 16)
!647 = distinct !DILexicalBlock(scope: !648, file: !408, line: 350, column: 85)
!648 = distinct !DILexicalBlock(scope: !649, file: !408, line: 350, column: 13)
!649 = distinct !DILexicalBlock(scope: !650, file: !408, line: 346, column: 17)
!650 = distinct !DILexicalBlock(scope: !640, file: !408, line: 346, column: 9)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !652, file: !408, line: 362, type: !60)
!652 = distinct !DILexicalBlock(scope: !640, file: !408, line: 362, column: 8)
!653 = !DISubprogram(name: "create_new_element", scope: !408, file: !408, line: 279, type: !182, isLocal: true, isDefinition: true, scopeLine: 280, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @create_new_element, variables: !654)
!654 = !{!655, !656, !657, !658}
!655 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tag", arg: 1, scope: !653, file: !408, line: 279, type: !60)
!656 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attrib", arg: 2, scope: !653, file: !408, line: 279, type: !60)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !653, file: !408, line: 281, type: !419)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !659, file: !408, line: 304, type: !60)
!659 = distinct !DILexicalBlock(scope: !660, file: !408, line: 304, column: 16)
!660 = distinct !DILexicalBlock(scope: !661, file: !408, line: 303, column: 45)
!661 = distinct !DILexicalBlock(scope: !662, file: !408, line: 303, column: 13)
!662 = distinct !DILexicalBlock(scope: !663, file: !408, line: 302, column: 64)
!663 = distinct !DILexicalBlock(scope: !653, file: !408, line: 302, column: 9)
!664 = !DISubprogram(name: "is_empty_dict", scope: !408, file: !408, line: 173, type: !200, isLocal: true, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @is_empty_dict, variables: !665)
!665 = !{!666}
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !664, file: !408, line: 173, type: !60)
!667 = !DISubprogram(name: "create_extra", scope: !408, file: !408, line: 229, type: !668, isLocal: true, isDefinition: true, scopeLine: 230, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ElementObject*, %struct._object*)* @create_extra, variables: !670)
!668 = !DISubroutineType(types: !669)
!669 = !{!99, !419, !60}
!670 = !{!671, !672}
!671 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !667, file: !408, line: 229, type: !419)
!672 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attrib", arg: 2, scope: !667, file: !408, line: 229, type: !60)
!673 = !DISubprogram(name: "element_add_subelement", scope: !408, file: !408, line: 485, type: !668, isLocal: true, isDefinition: true, scopeLine: 486, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ElementObject*, %struct._object*)* @element_add_subelement, variables: !674)
!674 = !{!675, !676}
!675 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !673, file: !408, line: 485, type: !419)
!676 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "element", arg: 2, scope: !673, file: !408, line: 485, type: !60)
!677 = !DISubprogram(name: "element_resize", scope: !408, file: !408, line: 432, type: !678, isLocal: true, isDefinition: true, scopeLine: 433, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ElementObject*, i32)* @element_resize, variables: !680)
!678 = !DISubroutineType(types: !679)
!679 = !{!99, !419, !99}
!680 = !{!681, !682, !683, !684}
!681 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !677, file: !408, line: 432, type: !419)
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "extra", arg: 2, scope: !677, file: !408, line: 432, type: !99)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !677, file: !408, line: 434, type: !99)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "children", scope: !677, file: !408, line: 435, type: !436)
!685 = !DISubprogram(name: "elementtree_traverse", scope: !408, file: !408, line: 112, type: !317, isLocal: true, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)* @elementtree_traverse, variables: !686)
!686 = !{!687, !688, !689, !690, !691, !695, !699}
!687 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !685, file: !408, line: 112, type: !60)
!688 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !685, file: !408, line: 112, type: !319)
!689 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !685, file: !408, line: 112, type: !145)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !685, file: !408, line: 114, type: !406)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !692, file: !408, line: 115, type: !99)
!692 = distinct !DILexicalBlock(scope: !693, file: !408, line: 115, column: 34)
!693 = distinct !DILexicalBlock(scope: !694, file: !408, line: 115, column: 14)
!694 = distinct !DILexicalBlock(scope: !685, file: !408, line: 115, column: 8)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !696, file: !408, line: 116, type: !99)
!696 = distinct !DILexicalBlock(scope: !697, file: !408, line: 116, column: 32)
!697 = distinct !DILexicalBlock(scope: !698, file: !408, line: 116, column: 14)
!698 = distinct !DILexicalBlock(scope: !685, file: !408, line: 116, column: 8)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !700, file: !408, line: 117, type: !99)
!700 = distinct !DILexicalBlock(scope: !701, file: !408, line: 117, column: 35)
!701 = distinct !DILexicalBlock(scope: !702, file: !408, line: 117, column: 14)
!702 = distinct !DILexicalBlock(scope: !685, file: !408, line: 117, column: 8)
!703 = !DISubprogram(name: "elementtree_clear", scope: !408, file: !408, line: 102, type: !200, isLocal: true, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @elementtree_clear, variables: !704)
!704 = !{!705, !706, !707, !709, !713, !715, !719, !721}
!705 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !703, file: !408, line: 102, type: !60)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !703, file: !408, line: 104, type: !406)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !708, file: !408, line: 105, type: !60)
!708 = distinct !DILexicalBlock(scope: !703, file: !408, line: 105, column: 8)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !710, file: !408, line: 105, type: !60)
!710 = distinct !DILexicalBlock(scope: !711, file: !408, line: 105, column: 131)
!711 = distinct !DILexicalBlock(scope: !712, file: !408, line: 105, column: 91)
!712 = distinct !DILexicalBlock(scope: !708, file: !408, line: 105, column: 68)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !714, file: !408, line: 106, type: !60)
!714 = distinct !DILexicalBlock(scope: !703, file: !408, line: 106, column: 8)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !716, file: !408, line: 106, type: !60)
!716 = distinct !DILexicalBlock(scope: !717, file: !408, line: 106, column: 127)
!717 = distinct !DILexicalBlock(scope: !718, file: !408, line: 106, column: 89)
!718 = distinct !DILexicalBlock(scope: !714, file: !408, line: 106, column: 66)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !720, file: !408, line: 107, type: !60)
!720 = distinct !DILexicalBlock(scope: !703, file: !408, line: 107, column: 8)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !722, file: !408, line: 107, type: !60)
!722 = distinct !DILexicalBlock(scope: !723, file: !408, line: 107, column: 133)
!723 = distinct !DILexicalBlock(scope: !724, file: !408, line: 107, column: 92)
!724 = distinct !DILexicalBlock(scope: !720, file: !408, line: 107, column: 69)
!725 = !DISubprogram(name: "elementtree_free", scope: !408, file: !408, line: 122, type: !394, isLocal: true, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @elementtree_free, variables: !726)
!726 = !{!727}
!727 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !725, file: !408, line: 122, type: !145)
!728 = !DISubprogram(name: "elementiter_dealloc", scope: !408, file: !408, line: 1953, type: !729, isLocal: true, isDefinition: true, scopeLine: 1954, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.ElementIterObject*)* @elementiter_dealloc, variables: !731)
!729 = !DISubroutineType(types: !730)
!730 = !{null, !537}
!731 = !{!732, !733, !734, !736, !738, !741, !743, !746, !748}
!732 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "it", arg: 1, scope: !728, file: !408, line: 1953, type: !537)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !728, file: !408, line: 1955, type: !543)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !735, file: !408, line: 1957, type: !543)
!735 = distinct !DILexicalBlock(scope: !728, file: !408, line: 1956, column: 15)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !737, file: !408, line: 1958, type: !60)
!737 = distinct !DILexicalBlock(scope: !735, file: !408, line: 1958, column: 12)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !739, file: !408, line: 1958, type: !60)
!739 = distinct !DILexicalBlock(scope: !740, file: !408, line: 1958, column: 105)
!740 = distinct !DILexicalBlock(scope: !737, file: !408, line: 1958, column: 71)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !742, file: !408, line: 1963, type: !60)
!742 = distinct !DILexicalBlock(scope: !728, file: !408, line: 1963, column: 8)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !744, file: !408, line: 1963, type: !60)
!744 = distinct !DILexicalBlock(scope: !745, file: !408, line: 1963, column: 106)
!745 = distinct !DILexicalBlock(scope: !742, file: !408, line: 1963, column: 72)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !747, file: !408, line: 1964, type: !60)
!747 = distinct !DILexicalBlock(scope: !728, file: !408, line: 1964, column: 8)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !749, file: !408, line: 1964, type: !60)
!749 = distinct !DILexicalBlock(scope: !750, file: !408, line: 1964, column: 108)
!750 = distinct !DILexicalBlock(scope: !747, file: !408, line: 1964, column: 74)
!751 = !DISubprogram(name: "elementiter_traverse", scope: !408, file: !408, line: 1971, type: !752, isLocal: true, isDefinition: true, scopeLine: 1972, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ElementIterObject*, i32 (%struct._object*, i8*)*, i8*)* @elementiter_traverse, variables: !754)
!752 = !DISubroutineType(types: !753)
!753 = !{!99, !537, !319, !145}
!754 = !{!755, !756, !757, !758, !759, !764, !768}
!755 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "it", arg: 1, scope: !751, file: !408, line: 1971, type: !537)
!756 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !751, file: !408, line: 1971, type: !319)
!757 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !751, file: !408, line: 1971, type: !145)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !751, file: !408, line: 1973, type: !543)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !760, file: !408, line: 1975, type: !99)
!760 = distinct !DILexicalBlock(scope: !761, file: !408, line: 1975, column: 29)
!761 = distinct !DILexicalBlock(scope: !762, file: !408, line: 1975, column: 18)
!762 = distinct !DILexicalBlock(scope: !763, file: !408, line: 1975, column: 12)
!763 = distinct !DILexicalBlock(scope: !751, file: !408, line: 1974, column: 15)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !765, file: !408, line: 1979, type: !99)
!765 = distinct !DILexicalBlock(scope: !766, file: !408, line: 1979, column: 32)
!766 = distinct !DILexicalBlock(scope: !767, file: !408, line: 1979, column: 14)
!767 = distinct !DILexicalBlock(scope: !751, file: !408, line: 1979, column: 8)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !769, file: !408, line: 1980, type: !99)
!769 = distinct !DILexicalBlock(scope: !770, file: !408, line: 1980, column: 30)
!770 = distinct !DILexicalBlock(scope: !771, file: !408, line: 1980, column: 14)
!771 = distinct !DILexicalBlock(scope: !751, file: !408, line: 1980, column: 8)
!772 = !DISubprogram(name: "elementiter_next", scope: !408, file: !408, line: 2000, type: !773, isLocal: true, isDefinition: true, scopeLine: 2001, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.ElementIterObject*)* @elementiter_next, variables: !775)
!773 = !DISubroutineType(types: !774)
!774 = !{!60, !537}
!775 = !{!776, !777, !778, !779, !789, !792, !795, !797, !798, !800}
!776 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "it", arg: 1, scope: !772, file: !408, line: 2000, type: !537)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur_parent", scope: !772, file: !408, line: 2013, type: !419)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "child_index", scope: !772, file: !408, line: 2014, type: !66)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "text", scope: !780, file: !408, line: 2040, type: !60)
!780 = distinct !DILexicalBlock(scope: !781, file: !408, line: 2039, column: 38)
!781 = distinct !DILexicalBlock(scope: !782, file: !408, line: 2039, column: 25)
!782 = distinct !DILexicalBlock(scope: !783, file: !408, line: 2038, column: 71)
!783 = distinct !DILexicalBlock(scope: !784, file: !408, line: 2036, column: 21)
!784 = distinct !DILexicalBlock(scope: !785, file: !408, line: 2027, column: 20)
!785 = distinct !DILexicalBlock(scope: !786, file: !408, line: 2024, column: 17)
!786 = distinct !DILexicalBlock(scope: !787, file: !408, line: 2023, column: 40)
!787 = distinct !DILexicalBlock(scope: !788, file: !408, line: 2023, column: 13)
!788 = distinct !DILexicalBlock(scope: !772, file: !408, line: 2016, column: 15)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "child", scope: !790, file: !408, line: 2061, type: !419)
!790 = distinct !DILexicalBlock(scope: !791, file: !408, line: 2060, column: 75)
!791 = distinct !DILexicalBlock(scope: !788, file: !408, line: 2060, column: 13)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "text", scope: !793, file: !408, line: 2072, type: !60)
!793 = distinct !DILexicalBlock(scope: !794, file: !408, line: 2071, column: 30)
!794 = distinct !DILexicalBlock(scope: !790, file: !408, line: 2071, column: 17)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tail", scope: !796, file: !408, line: 2089, type: !60)
!796 = distinct !DILexicalBlock(scope: !791, file: !408, line: 2088, column: 14)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next", scope: !796, file: !408, line: 2090, type: !543)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !799, file: !408, line: 2098, type: !60)
!799 = distinct !DILexicalBlock(scope: !796, file: !408, line: 2098, column: 16)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !801, file: !408, line: 2098, type: !60)
!801 = distinct !DILexicalBlock(scope: !802, file: !408, line: 2098, column: 124)
!802 = distinct !DILexicalBlock(scope: !799, file: !408, line: 2098, column: 90)
!803 = !DISubprogram(name: "parent_stack_push_new", scope: !408, file: !408, line: 1987, type: !804, isLocal: true, isDefinition: true, scopeLine: 1988, flags: DIFlagPrototyped, isOptimized: true, function: %struct.ParentLocator_t* (%struct.ParentLocator_t*, %struct.ElementObject*)* @parent_stack_push_new, variables: !806)
!804 = !DISubroutineType(types: !805)
!805 = !{!543, !543, !419}
!806 = !{!807, !808, !809}
!807 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stack", arg: 1, scope: !803, file: !408, line: 1987, type: !543)
!808 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "parent", arg: 2, scope: !803, file: !408, line: 1987, type: !419)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_node", scope: !803, file: !408, line: 1989, type: !543)
!810 = !DISubprogram(name: "element_get_text", scope: !408, file: !408, line: 521, type: !811, isLocal: true, isDefinition: true, scopeLine: 522, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.ElementObject*)* @element_get_text, variables: !813)
!811 = !DISubroutineType(types: !812)
!812 = !{!60, !419}
!813 = !{!814, !815}
!814 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !810, file: !408, line: 521, type: !419)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !810, file: !408, line: 525, type: !60)
!816 = !DISubprogram(name: "list_join", scope: !408, file: !408, line: 154, type: !172, isLocal: true, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @list_join, variables: !817)
!817 = !{!818, !819, !820, !821, !823}
!818 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 1, scope: !816, file: !408, line: 154, type: !60)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "joiner", scope: !816, file: !408, line: 157, type: !60)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !816, file: !408, line: 158, type: !60)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !822, file: !408, line: 164, type: !60)
!822 = distinct !DILexicalBlock(scope: !816, file: !408, line: 164, column: 8)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !824, file: !408, line: 166, type: !60)
!824 = distinct !DILexicalBlock(scope: !825, file: !408, line: 166, column: 12)
!825 = distinct !DILexicalBlock(scope: !816, file: !408, line: 165, column: 9)
!826 = !DISubprogram(name: "element_get_tail", scope: !408, file: !408, line: 541, type: !811, isLocal: true, isDefinition: true, scopeLine: 542, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.ElementObject*)* @element_get_tail, variables: !827)
!827 = !{!828, !829}
!828 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !826, file: !408, line: 541, type: !419)
!829 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !826, file: !408, line: 545, type: !60)
!830 = !DISubprogram(name: "treebuilder_dealloc", scope: !408, file: !408, line: 2318, type: !831, isLocal: true, isDefinition: true, scopeLine: 2319, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.TreeBuilderObject*)* @treebuilder_dealloc, variables: !833)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !462}
!833 = !{!834}
!834 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !830, file: !408, line: 2318, type: !462)
!835 = !DISubprogram(name: "treebuilder_gc_traverse", scope: !408, file: !408, line: 2289, type: !836, isLocal: true, isDefinition: true, scopeLine: 2290, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.TreeBuilderObject*, i32 (%struct._object*, i8*)*, i8*)* @treebuilder_gc_traverse, variables: !838)
!836 = !DISubroutineType(types: !837)
!837 = !{!99, !462, !319, !145}
!838 = !{!839, !840, !841, !842, !846, !850, !854, !858, !862}
!839 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !835, file: !408, line: 2289, type: !462)
!840 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !835, file: !408, line: 2289, type: !319)
!841 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !835, file: !408, line: 2289, type: !145)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !843, file: !408, line: 2291, type: !99)
!843 = distinct !DILexicalBlock(scope: !844, file: !408, line: 2291, column: 26)
!844 = distinct !DILexicalBlock(scope: !845, file: !408, line: 2291, column: 14)
!845 = distinct !DILexicalBlock(scope: !835, file: !408, line: 2291, column: 8)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !847, file: !408, line: 2292, type: !99)
!847 = distinct !DILexicalBlock(scope: !848, file: !408, line: 2292, column: 26)
!848 = distinct !DILexicalBlock(scope: !849, file: !408, line: 2292, column: 14)
!849 = distinct !DILexicalBlock(scope: !835, file: !408, line: 2292, column: 8)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !851, file: !408, line: 2293, type: !99)
!851 = distinct !DILexicalBlock(scope: !852, file: !408, line: 2293, column: 26)
!852 = distinct !DILexicalBlock(scope: !853, file: !408, line: 2293, column: 14)
!853 = distinct !DILexicalBlock(scope: !835, file: !408, line: 2293, column: 8)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !855, file: !408, line: 2294, type: !99)
!855 = distinct !DILexicalBlock(scope: !856, file: !408, line: 2294, column: 26)
!856 = distinct !DILexicalBlock(scope: !857, file: !408, line: 2294, column: 14)
!857 = distinct !DILexicalBlock(scope: !835, file: !408, line: 2294, column: 8)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !859, file: !408, line: 2295, type: !99)
!859 = distinct !DILexicalBlock(scope: !860, file: !408, line: 2295, column: 27)
!860 = distinct !DILexicalBlock(scope: !861, file: !408, line: 2295, column: 14)
!861 = distinct !DILexicalBlock(scope: !835, file: !408, line: 2295, column: 8)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !863, file: !408, line: 2296, type: !99)
!863 = distinct !DILexicalBlock(scope: !864, file: !408, line: 2296, column: 37)
!864 = distinct !DILexicalBlock(scope: !865, file: !408, line: 2296, column: 14)
!865 = distinct !DILexicalBlock(scope: !835, file: !408, line: 2296, column: 8)
!866 = !DISubprogram(name: "treebuilder_gc_clear", scope: !408, file: !408, line: 2301, type: !867, isLocal: true, isDefinition: true, scopeLine: 2302, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.TreeBuilderObject*)* @treebuilder_gc_clear, variables: !869)
!867 = !DISubroutineType(types: !868)
!868 = !{!99, !462}
!869 = !{!870, !871, !873, !877, !879, !883, !885, !889, !891, !895, !897, !901, !903, !907, !909, !913, !915, !919, !921, !925, !927, !931, !933}
!870 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !866, file: !408, line: 2301, type: !462)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !872, file: !408, line: 2303, type: !60)
!872 = distinct !DILexicalBlock(scope: !866, file: !408, line: 2303, column: 8)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !874, file: !408, line: 2303, type: !60)
!874 = distinct !DILexicalBlock(scope: !875, file: !408, line: 2303, column: 139)
!875 = distinct !DILexicalBlock(scope: !876, file: !408, line: 2303, column: 95)
!876 = distinct !DILexicalBlock(scope: !872, file: !408, line: 2303, column: 72)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !878, file: !408, line: 2304, type: !60)
!878 = distinct !DILexicalBlock(scope: !866, file: !408, line: 2304, column: 8)
!879 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !880, file: !408, line: 2304, type: !60)
!880 = distinct !DILexicalBlock(scope: !881, file: !408, line: 2304, column: 143)
!881 = distinct !DILexicalBlock(scope: !882, file: !408, line: 2304, column: 97)
!882 = distinct !DILexicalBlock(scope: !878, file: !408, line: 2304, column: 74)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !884, file: !408, line: 2305, type: !60)
!884 = distinct !DILexicalBlock(scope: !866, file: !408, line: 2305, column: 8)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !886, file: !408, line: 2305, type: !60)
!886 = distinct !DILexicalBlock(scope: !887, file: !408, line: 2305, column: 133)
!887 = distinct !DILexicalBlock(scope: !888, file: !408, line: 2305, column: 92)
!888 = distinct !DILexicalBlock(scope: !884, file: !408, line: 2305, column: 69)
!889 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !890, file: !408, line: 2306, type: !60)
!890 = distinct !DILexicalBlock(scope: !866, file: !408, line: 2306, column: 8)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !892, file: !408, line: 2306, type: !60)
!892 = distinct !DILexicalBlock(scope: !893, file: !408, line: 2306, column: 137)
!893 = distinct !DILexicalBlock(scope: !894, file: !408, line: 2306, column: 94)
!894 = distinct !DILexicalBlock(scope: !890, file: !408, line: 2306, column: 71)
!895 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !896, file: !408, line: 2307, type: !60)
!896 = distinct !DILexicalBlock(scope: !866, file: !408, line: 2307, column: 8)
!897 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !898, file: !408, line: 2307, type: !60)
!898 = distinct !DILexicalBlock(scope: !899, file: !408, line: 2307, column: 119)
!899 = distinct !DILexicalBlock(scope: !900, file: !408, line: 2307, column: 85)
!900 = distinct !DILexicalBlock(scope: !896, file: !408, line: 2307, column: 62)
!901 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !902, file: !408, line: 2308, type: !60)
!902 = distinct !DILexicalBlock(scope: !866, file: !408, line: 2308, column: 8)
!903 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !904, file: !408, line: 2308, type: !60)
!904 = distinct !DILexicalBlock(scope: !905, file: !408, line: 2308, column: 117)
!905 = distinct !DILexicalBlock(scope: !906, file: !408, line: 2308, column: 84)
!906 = distinct !DILexicalBlock(scope: !902, file: !408, line: 2308, column: 61)
!907 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !908, file: !408, line: 2309, type: !60)
!908 = distinct !DILexicalBlock(scope: !866, file: !408, line: 2309, column: 8)
!909 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !910, file: !408, line: 2309, type: !60)
!910 = distinct !DILexicalBlock(scope: !911, file: !408, line: 2309, column: 115)
!911 = distinct !DILexicalBlock(scope: !912, file: !408, line: 2309, column: 83)
!912 = distinct !DILexicalBlock(scope: !908, file: !408, line: 2309, column: 60)
!913 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !914, file: !408, line: 2310, type: !60)
!914 = distinct !DILexicalBlock(scope: !866, file: !408, line: 2310, column: 8)
!915 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !916, file: !408, line: 2310, type: !60)
!916 = distinct !DILexicalBlock(scope: !917, file: !408, line: 2310, column: 115)
!917 = distinct !DILexicalBlock(scope: !918, file: !408, line: 2310, column: 83)
!918 = distinct !DILexicalBlock(scope: !914, file: !408, line: 2310, column: 60)
!919 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !920, file: !408, line: 2311, type: !60)
!920 = distinct !DILexicalBlock(scope: !866, file: !408, line: 2311, column: 8)
!921 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !922, file: !408, line: 2311, type: !60)
!922 = distinct !DILexicalBlock(scope: !923, file: !408, line: 2311, column: 115)
!923 = distinct !DILexicalBlock(scope: !924, file: !408, line: 2311, column: 83)
!924 = distinct !DILexicalBlock(scope: !920, file: !408, line: 2311, column: 60)
!925 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !926, file: !408, line: 2312, type: !60)
!926 = distinct !DILexicalBlock(scope: !866, file: !408, line: 2312, column: 8)
!927 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !928, file: !408, line: 2312, type: !60)
!928 = distinct !DILexicalBlock(scope: !929, file: !408, line: 2312, column: 137)
!929 = distinct !DILexicalBlock(scope: !930, file: !408, line: 2312, column: 94)
!930 = distinct !DILexicalBlock(scope: !926, file: !408, line: 2312, column: 71)
!931 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !932, file: !408, line: 2313, type: !60)
!932 = distinct !DILexicalBlock(scope: !866, file: !408, line: 2313, column: 8)
!933 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !934, file: !408, line: 2313, type: !60)
!934 = distinct !DILexicalBlock(scope: !935, file: !408, line: 2313, column: 115)
!935 = distinct !DILexicalBlock(scope: !936, file: !408, line: 2313, column: 83)
!936 = distinct !DILexicalBlock(scope: !932, file: !408, line: 2313, column: 60)
!937 = !DISubprogram(name: "treebuilder_data", scope: !408, file: !408, line: 2602, type: !938, isLocal: true, isDefinition: true, scopeLine: 2603, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.TreeBuilderObject*, %struct._object*)* @treebuilder_data, variables: !940)
!938 = !DISubroutineType(types: !939)
!939 = !{!60, !462, !60}
!940 = !{!941, !942, !943}
!941 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !937, file: !408, line: 2602, type: !462)
!942 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !937, file: !408, line: 2602, type: !60)
!943 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !937, file: !408, line: 2604, type: !60)
!944 = !DISubprogram(name: "treebuilder_handle_data", scope: !408, file: !408, line: 2469, type: !938, isLocal: true, isDefinition: true, scopeLine: 2470, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.TreeBuilderObject*, %struct._object*)* @treebuilder_handle_data, variables: !945)
!945 = !{!946, !947, !948, !953}
!946 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !944, file: !408, line: 2469, type: !462)
