; ModuleID = 'programs_new/Python-new/_heapqmodule.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !353, globals: !593)
!1 = !DIFile(filename: "_heapqmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !343, !352}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !7, line: 109, baseType: !8)
!7 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !7, line: 105, size: 128, align: 64, elements: !9)
!9 = !{!10, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !8, file: !7, line: 107, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !12, line: 177, baseType: !13)
!12 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !14, line: 102, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !16, line: 181, baseType: !17)
!16 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !8, file: !7, line: 108, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !7, line: 334, size: 3200, align: 64, elements: !21)
!21 = !{!22, !28, !32, !33, !34, !39, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !291, !309, !310, !311, !313, !315, !316, !318, !323, !328, !333, !334, !335, !336, !337, !338, !339, !340, !342}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !20, file: !7, line: 335, baseType: !23, size: 192, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !7, line: 114, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 111, size: 192, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !24, file: !7, line: 112, baseType: !6, size: 128, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !24, file: !7, line: 113, baseType: !11, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !20, file: !7, line: 336, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !20, file: !7, line: 341, baseType: !35, size: 64, align: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !7, line: 308, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !5}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !20, file: !7, line: 342, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !7, line: 314, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !5, !45, !44}
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !14, line: 48, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 246, size: 1728, align: 64, elements: !49)
!48 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!49 = !{!50, !51, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !71, !72, !73, !74, !76, !78, !80, !84, !87, !89, !90, !91, !92, !93, !97, !98}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !48, line: 247, baseType: !44, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !47, file: !48, line: 252, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !47, file: !48, line: 253, baseType: !52, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !47, file: !48, line: 254, baseType: !52, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !47, file: !48, line: 255, baseType: !52, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !47, file: !48, line: 256, baseType: !52, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !47, file: !48, line: 257, baseType: !52, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !47, file: !48, line: 258, baseType: !52, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !47, file: !48, line: 259, baseType: !52, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !47, file: !48, line: 261, baseType: !52, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !47, file: !48, line: 262, baseType: !52, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !47, file: !48, line: 263, baseType: !52, size: 64, align: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !47, file: !48, line: 265, baseType: !64, size: 64, align: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !48, line: 161, size: 192, align: 64, elements: !66)
!66 = !{!67, !68, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !65, file: !48, line: 162, baseType: !64, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !65, file: !48, line: 163, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !65, file: !48, line: 167, baseType: !44, size: 32, align: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !47, file: !48, line: 267, baseType: !69, size: 64, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !47, file: !48, line: 269, baseType: !44, size: 32, align: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !47, file: !48, line: 273, baseType: !44, size: 32, align: 32, offset: 928)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !47, file: !48, line: 275, baseType: !75, size: 64, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !16, line: 140, baseType: !17)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !47, file: !48, line: 279, baseType: !77, size: 16, align: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !47, file: !48, line: 280, baseType: !79, size: 8, align: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !47, file: !48, line: 281, baseType: !81, size: 8, align: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !47, file: !48, line: 285, baseType: !85, size: 64, align: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !48, line: 155, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !47, file: !48, line: 294, baseType: !88, size: 64, align: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !16, line: 141, baseType: !17)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !47, file: !48, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !47, file: !48, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !47, file: !48, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !47, file: !48, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !47, file: !48, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !47, file: !48, line: 309, baseType: !44, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !47, file: !48, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !20, file: !7, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !7, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!5, !5, !52}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !20, file: !7, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !7, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!44, !5, !52, !5}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !20, file: !7, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !20, file: !7, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !7, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!5, !5}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !20, file: !7, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !7, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !7, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !7, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!5, !5, !5}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !7, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !7, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !7, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !7, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !7, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !7, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!5, !5, !5, !5}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !7, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !7, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !7, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !7, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !7, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !7, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!44, !5}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !7, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !7, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !7, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !7, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !7, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !7, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !7, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !7, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !7, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !7, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !7, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !7, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !7, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !7, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !7, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !7, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !7, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !7, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !7, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !7, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !7, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !7, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !7, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !7, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !20, file: !7, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !7, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !7, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !7, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!11, !5}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !7, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !7, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !7, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!5, !5, !11}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !7, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !7, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !7, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !7, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!44, !5, !11, !5}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !7, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !7, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !7, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!44, !5, !5}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !7, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !7, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !20, file: !7, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !7, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !7, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !7, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !7, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !7, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!44, !5, !5, !5}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !20, file: !7, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !7, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !5}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !12, line: 186, baseType: !11)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !20, file: !7, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !20, file: !7, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !20, file: !7, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !7, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !20, file: !7, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !7, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !20, file: !7, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !7, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !7, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !7, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!44, !5, !235, !44}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !7, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !7, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !7, line: 179, baseType: !4, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !7, line: 180, baseType: !5, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !7, line: 181, baseType: !11, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !7, line: 182, baseType: !11, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !7, line: 184, baseType: !44, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !7, line: 185, baseType: !44, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !7, line: 186, baseType: !52, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !7, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !7, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !7, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !7, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !7, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !7, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !5, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !20, file: !7, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !20, file: !7, line: 368, baseType: !29, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !20, file: !7, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !7, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!44, !5, !263, !4}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !7, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!44, !5, !4}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !20, file: !7, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !20, file: !7, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !7, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!5, !5, !5, !44}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !20, file: !7, line: 382, baseType: !11, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !20, file: !7, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !7, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !20, file: !7, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !7, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !20, file: !7, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !29, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !44, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !29, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !20, file: !7, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !7, line: 390, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !20, file: !7, line: 391, baseType: !292, size: 64, align: 64, offset: 1984)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !294, line: 11, size: 320, align: 64, elements: !295)
!294 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!295 = !{!296, !297, !302, !307, !308}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !293, file: !294, line: 12, baseType: !52, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !293, file: !294, line: 13, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !294, line: 8, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!5, !5, !4}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !293, file: !294, line: 14, baseType: !303, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !294, line: 9, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!44, !5, !5, !4}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !293, file: !294, line: 15, baseType: !52, size: 64, align: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !293, file: !294, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !20, file: !7, line: 392, baseType: !19, size: 64, align: 64, offset: 2048)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !20, file: !7, line: 393, baseType: !5, size: 64, align: 64, offset: 2112)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !20, file: !7, line: 394, baseType: !312, size: 64, align: 64, offset: 2176)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !7, line: 325, baseType: !134)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !20, file: !7, line: 395, baseType: !314, size: 64, align: 64, offset: 2240)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !7, line: 326, baseType: !210)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !20, file: !7, line: 396, baseType: !11, size: 64, align: 64, offset: 2304)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !20, file: !7, line: 397, baseType: !317, size: 64, align: 64, offset: 2368)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !7, line: 327, baseType: !210)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !20, file: !7, line: 398, baseType: !319, size: 64, align: 64, offset: 2432)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !7, line: 329, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!5, !19, !11}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !20, file: !7, line: 399, baseType: !324, size: 64, align: 64, offset: 2496)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !7, line: 328, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!5, !19, !5, !5}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !20, file: !7, line: 400, baseType: !329, size: 64, align: 64, offset: 2560)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !7, line: 307, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !4}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !20, file: !7, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !20, file: !7, line: 402, baseType: !5, size: 64, align: 64, offset: 2688)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !20, file: !7, line: 403, baseType: !5, size: 64, align: 64, offset: 2752)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !20, file: !7, line: 404, baseType: !5, size: 64, align: 64, offset: 2816)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !20, file: !7, line: 405, baseType: !5, size: 64, align: 64, offset: 2880)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !20, file: !7, line: 406, baseType: !5, size: 64, align: 64, offset: 2944)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !20, file: !7, line: 407, baseType: !35, size: 64, align: 64, offset: 3008)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !20, file: !7, line: 410, baseType: !341, size: 32, align: 32, offset: 3072)
!341 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !20, file: !7, line: 412, baseType: !35, size: 64, align: 64, offset: 3136)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !345, line: 40, baseType: !346)
!345 = !DIFile(filename: "./Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!346 = !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 23, size: 320, align: 64, elements: !347)
!347 = !{!348, !349, !351}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !346, file: !345, line: 24, baseType: !23, size: 192, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !346, file: !345, line: 26, baseType: !350, size: 64, align: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !346, file: !345, line: 39, baseType: !11, size: 64, align: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!353 = !{!354, !361, !367, !393, !405, !436, !451, !462, !468, !510, !552, !575}
!354 = !DISubprogram(name: "PyInit__heapq", scope: !355, file: !355, line: 710, type: !356, isLocal: false, isDefinition: true, scopeLine: 711, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__heapq, variables: !358)
!355 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_heapqmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!356 = !DISubroutineType(types: !357)
!357 = !{!5}
!358 = !{!359, !360}
!359 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !354, file: !355, line: 712, type: !5)
!360 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "about", scope: !354, file: !355, line: 712, type: !5)
!361 = !DISubprogram(name: "heappush", scope: !355, file: !355, line: 127, type: !126, isLocal: true, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @heappush, variables: !362)
!362 = !{!363, !364, !365, !366}
!363 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !361, file: !355, line: 127, type: !5)
!364 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !361, file: !355, line: 127, type: !5)
!365 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "heap", scope: !361, file: !355, line: 129, type: !5)
!366 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !361, file: !355, line: 129, type: !5)
!367 = !DISubprogram(name: "_siftdown", scope: !355, file: !355, line: 12, type: !368, isLocal: true, isDefinition: true, scopeLine: 13, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyListObject*, i64, i64)* @_siftdown, variables: !370)
!368 = !DISubroutineType(types: !369)
!369 = !{!44, !343, !11, !11}
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !385, !389, !391}
!371 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "heap", arg: 1, scope: !367, file: !355, line: 12, type: !343)
!372 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "startpos", arg: 2, scope: !367, file: !355, line: 12, type: !11)
!373 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pos", arg: 3, scope: !367, file: !355, line: 12, type: !11)
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newitem", scope: !367, file: !355, line: 14, type: !5)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "parent", scope: !367, file: !355, line: 14, type: !5)
!376 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "olditem", scope: !367, file: !355, line: 14, type: !5)
!377 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmp", scope: !367, file: !355, line: 15, type: !44)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "parentpos", scope: !367, file: !355, line: 16, type: !11)
!379 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !367, file: !355, line: 17, type: !11)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !381, file: !355, line: 35, type: !5)
!381 = distinct !DILexicalBlock(scope: !382, file: !355, line: 35, column: 16)
!382 = distinct !DILexicalBlock(scope: !383, file: !355, line: 34, column: 24)
!383 = distinct !DILexicalBlock(scope: !384, file: !355, line: 34, column: 13)
!384 = distinct !DILexicalBlock(scope: !367, file: !355, line: 30, column: 27)
!385 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !386, file: !355, line: 39, type: !5)
!386 = distinct !DILexicalBlock(scope: !387, file: !355, line: 39, column: 16)
!387 = distinct !DILexicalBlock(scope: !388, file: !355, line: 38, column: 56)
!388 = distinct !DILexicalBlock(scope: !384, file: !355, line: 38, column: 13)
!389 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !390, file: !355, line: 49, type: !5)
!390 = distinct !DILexicalBlock(scope: !384, file: !355, line: 49, column: 12)
!391 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !392, file: !355, line: 57, type: !5)
!392 = distinct !DILexicalBlock(scope: !367, file: !355, line: 57, column: 8)
!393 = !DISubprogram(name: "heappushpop", scope: !355, file: !355, line: 230, type: !126, isLocal: true, isDefinition: true, scopeLine: 231, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @heappushpop, variables: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !401}
!395 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !393, file: !355, line: 230, type: !5)
!396 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !393, file: !355, line: 230, type: !5)
!397 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "heap", scope: !393, file: !355, line: 232, type: !5)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !393, file: !355, line: 232, type: !5)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "returnitem", scope: !393, file: !355, line: 232, type: !5)
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmp", scope: !393, file: !355, line: 233, type: !44)
!401 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !402, file: !355, line: 260, type: !5)
!402 = distinct !DILexicalBlock(scope: !403, file: !355, line: 260, column: 12)
!403 = distinct !DILexicalBlock(scope: !404, file: !355, line: 259, column: 49)
!404 = distinct !DILexicalBlock(scope: !393, file: !355, line: 259, column: 9)
!405 = !DISubprogram(name: "_siftup", scope: !355, file: !355, line: 63, type: !406, isLocal: true, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyListObject*, i64)* @_siftup, variables: !408)
!406 = !DISubroutineType(types: !407)
!407 = !{!44, !343, !11}
!408 = !{!409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !428, !432, !434}
!409 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "heap", arg: 1, scope: !405, file: !355, line: 63, type: !343)
!410 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pos", arg: 2, scope: !405, file: !355, line: 63, type: !11)
!411 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "startpos", scope: !405, file: !355, line: 65, type: !11)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "endpos", scope: !405, file: !355, line: 65, type: !11)
!413 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "childpos", scope: !405, file: !355, line: 65, type: !11)
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rightpos", scope: !405, file: !355, line: 65, type: !11)
!415 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "limit", scope: !405, file: !355, line: 65, type: !11)
!416 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmp", scope: !405, file: !355, line: 66, type: !44)
!417 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newitem", scope: !405, file: !355, line: 67, type: !5)
!418 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !405, file: !355, line: 67, type: !5)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "olditem", scope: !405, file: !355, line: 67, type: !5)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !405, file: !355, line: 68, type: !11)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !422, file: !355, line: 93, type: !5)
!422 = distinct !DILexicalBlock(scope: !423, file: !355, line: 93, column: 20)
!423 = distinct !DILexicalBlock(scope: !424, file: !355, line: 92, column: 28)
!424 = distinct !DILexicalBlock(scope: !425, file: !355, line: 92, column: 17)
!425 = distinct !DILexicalBlock(scope: !426, file: !355, line: 87, column: 32)
!426 = distinct !DILexicalBlock(scope: !427, file: !355, line: 87, column: 13)
!427 = distinct !DILexicalBlock(scope: !405, file: !355, line: 83, column: 25)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !429, file: !355, line: 100, type: !5)
!429 = distinct !DILexicalBlock(scope: !430, file: !355, line: 100, column: 16)
!430 = distinct !DILexicalBlock(scope: !431, file: !355, line: 99, column: 56)
!431 = distinct !DILexicalBlock(scope: !427, file: !355, line: 99, column: 13)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !433, file: !355, line: 110, type: !5)
!433 = distinct !DILexicalBlock(scope: !427, file: !355, line: 110, column: 12)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !435, file: !355, line: 121, type: !5)
!435 = distinct !DILexicalBlock(scope: !405, file: !355, line: 121, column: 8)
!436 = !DISubprogram(name: "heappop", scope: !355, file: !355, line: 152, type: !126, isLocal: true, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @heappop, variables: !437)
!437 = !{!438, !439, !440, !441, !442, !443, !447}
!438 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !436, file: !355, line: 152, type: !5)
!439 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "heap", arg: 2, scope: !436, file: !355, line: 152, type: !5)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lastelt", scope: !436, file: !355, line: 154, type: !5)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "returnitem", scope: !436, file: !355, line: 154, type: !5)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !436, file: !355, line: 155, type: !11)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !444, file: !355, line: 172, type: !5)
!444 = distinct !DILexicalBlock(scope: !445, file: !355, line: 172, column: 12)
!445 = distinct !DILexicalBlock(scope: !446, file: !355, line: 171, column: 56)
!446 = distinct !DILexicalBlock(scope: !436, file: !355, line: 171, column: 9)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !448, file: !355, line: 182, type: !5)
!448 = distinct !DILexicalBlock(scope: !449, file: !355, line: 182, column: 12)
!449 = distinct !DILexicalBlock(scope: !450, file: !355, line: 181, column: 49)
!450 = distinct !DILexicalBlock(scope: !436, file: !355, line: 181, column: 9)
!451 = !DISubprogram(name: "heapreplace", scope: !355, file: !355, line: 192, type: !126, isLocal: true, isDefinition: true, scopeLine: 193, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @heapreplace, variables: !452)
!452 = !{!453, !454, !455, !456, !457, !458}
!453 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !451, file: !355, line: 192, type: !5)
!454 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !451, file: !355, line: 192, type: !5)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "heap", scope: !451, file: !355, line: 194, type: !5)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !451, file: !355, line: 194, type: !5)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "returnitem", scope: !451, file: !355, line: 194, type: !5)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !459, file: !355, line: 213, type: !5)
!459 = distinct !DILexicalBlock(scope: !460, file: !355, line: 213, column: 12)
!460 = distinct !DILexicalBlock(scope: !461, file: !355, line: 212, column: 49)
!461 = distinct !DILexicalBlock(scope: !451, file: !355, line: 212, column: 9)
!462 = !DISubprogram(name: "heapify", scope: !355, file: !355, line: 272, type: !126, isLocal: true, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @heapify, variables: !463)
!463 = !{!464, !465, !466, !467}
!464 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !462, file: !355, line: 272, type: !5)
!465 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "heap", arg: 2, scope: !462, file: !355, line: 272, type: !5)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !462, file: !355, line: 274, type: !11)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !462, file: !355, line: 274, type: !11)
!468 = !DISubprogram(name: "nlargest", scope: !355, file: !355, line: 300, type: !126, isLocal: true, isDefinition: true, scopeLine: 301, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @nlargest, variables: !469)
!469 = !{!470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !488, !490, !495, !499, !501, !503, !505, !507}
!470 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !468, file: !355, line: 300, type: !5)
!471 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !468, file: !355, line: 300, type: !5)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "heap", scope: !468, file: !355, line: 302, type: !5)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "elem", scope: !468, file: !355, line: 302, type: !5)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iterable", scope: !468, file: !355, line: 302, type: !5)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sol", scope: !468, file: !355, line: 302, type: !5)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !468, file: !355, line: 302, type: !5)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldelem", scope: !468, file: !355, line: 302, type: !5)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !468, file: !355, line: 303, type: !11)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !468, file: !355, line: 303, type: !11)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmp", scope: !468, file: !355, line: 304, type: !44)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !482, file: !355, line: 326, type: !5)
!482 = distinct !DILexicalBlock(scope: !483, file: !355, line: 326, column: 16)
!483 = distinct !DILexicalBlock(scope: !484, file: !355, line: 325, column: 46)
!484 = distinct !DILexicalBlock(scope: !485, file: !355, line: 325, column: 13)
!485 = distinct !DILexicalBlock(scope: !486, file: !355, line: 317, column: 27)
!486 = distinct !DILexicalBlock(scope: !487, file: !355, line: 317, column: 5)
!487 = distinct !DILexicalBlock(scope: !468, file: !355, line: 317, column: 5)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !489, file: !355, line: 329, type: !5)
!489 = distinct !DILexicalBlock(scope: !485, file: !355, line: 329, column: 12)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !491, file: !355, line: 349, type: !5)
!491 = distinct !DILexicalBlock(scope: !492, file: !355, line: 349, column: 16)
!492 = distinct !DILexicalBlock(scope: !493, file: !355, line: 348, column: 24)
!493 = distinct !DILexicalBlock(scope: !494, file: !355, line: 348, column: 13)
!494 = distinct !DILexicalBlock(scope: !468, file: !355, line: 339, column: 15)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !496, file: !355, line: 353, type: !5)
!496 = distinct !DILexicalBlock(scope: !497, file: !355, line: 353, column: 16)
!497 = distinct !DILexicalBlock(scope: !498, file: !355, line: 352, column: 23)
!498 = distinct !DILexicalBlock(scope: !494, file: !355, line: 352, column: 13)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !500, file: !355, line: 358, type: !5)
!500 = distinct !DILexicalBlock(scope: !494, file: !355, line: 358, column: 12)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !502, file: !355, line: 368, type: !5)
!502 = distinct !DILexicalBlock(scope: !468, file: !355, line: 368, column: 8)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !504, file: !355, line: 372, type: !5)
!504 = distinct !DILexicalBlock(scope: !468, file: !355, line: 372, column: 8)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !506, file: !355, line: 373, type: !5)
!506 = distinct !DILexicalBlock(scope: !468, file: !355, line: 373, column: 8)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !508, file: !355, line: 373, type: !5)
!508 = distinct !DILexicalBlock(scope: !509, file: !355, line: 373, column: 96)
!509 = distinct !DILexicalBlock(scope: !506, file: !355, line: 373, column: 62)
!510 = !DISubprogram(name: "nsmallest", scope: !355, file: !355, line: 470, type: !126, isLocal: true, isDefinition: true, scopeLine: 471, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @nsmallest, variables: !511)
!511 = !{!512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !530, !532, !537, !541, !543, !545, !547, !549}
!512 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !510, file: !355, line: 470, type: !5)
!513 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !510, file: !355, line: 470, type: !5)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "heap", scope: !510, file: !355, line: 472, type: !5)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "elem", scope: !510, file: !355, line: 472, type: !5)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iterable", scope: !510, file: !355, line: 472, type: !5)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "los", scope: !510, file: !355, line: 472, type: !5)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !510, file: !355, line: 472, type: !5)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldelem", scope: !510, file: !355, line: 472, type: !5)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !510, file: !355, line: 473, type: !11)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !510, file: !355, line: 473, type: !11)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmp", scope: !510, file: !355, line: 474, type: !44)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !524, file: !355, line: 496, type: !5)
!524 = distinct !DILexicalBlock(scope: !525, file: !355, line: 496, column: 16)
!525 = distinct !DILexicalBlock(scope: !526, file: !355, line: 495, column: 46)
!526 = distinct !DILexicalBlock(scope: !527, file: !355, line: 495, column: 13)
!527 = distinct !DILexicalBlock(scope: !528, file: !355, line: 487, column: 27)
!528 = distinct !DILexicalBlock(scope: !529, file: !355, line: 487, column: 5)
!529 = distinct !DILexicalBlock(scope: !510, file: !355, line: 487, column: 5)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !531, file: !355, line: 499, type: !5)
!531 = distinct !DILexicalBlock(scope: !527, file: !355, line: 499, column: 12)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !533, file: !355, line: 520, type: !5)
!533 = distinct !DILexicalBlock(scope: !534, file: !355, line: 520, column: 16)
!534 = distinct !DILexicalBlock(scope: !535, file: !355, line: 519, column: 24)
!535 = distinct !DILexicalBlock(scope: !536, file: !355, line: 519, column: 13)
!536 = distinct !DILexicalBlock(scope: !510, file: !355, line: 510, column: 15)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !538, file: !355, line: 524, type: !5)
!538 = distinct !DILexicalBlock(scope: !539, file: !355, line: 524, column: 16)
!539 = distinct !DILexicalBlock(scope: !540, file: !355, line: 523, column: 23)
!540 = distinct !DILexicalBlock(scope: !536, file: !355, line: 523, column: 13)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !542, file: !355, line: 530, type: !5)
!542 = distinct !DILexicalBlock(scope: !536, file: !355, line: 530, column: 12)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !544, file: !355, line: 539, type: !5)
!544 = distinct !DILexicalBlock(scope: !510, file: !355, line: 539, column: 8)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !546, file: !355, line: 543, type: !5)
!546 = distinct !DILexicalBlock(scope: !510, file: !355, line: 543, column: 8)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !548, file: !355, line: 544, type: !5)
!548 = distinct !DILexicalBlock(scope: !510, file: !355, line: 544, column: 8)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !550, file: !355, line: 544, type: !5)
!550 = distinct !DILexicalBlock(scope: !551, file: !355, line: 544, column: 96)
!551 = distinct !DILexicalBlock(scope: !548, file: !355, line: 544, column: 62)
!552 = !DISubprogram(name: "_siftupmax", scope: !355, file: !355, line: 420, type: !406, isLocal: true, isDefinition: true, scopeLine: 421, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyListObject*, i64)* @_siftupmax, variables: !553)
!553 = !{!554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !571, !573}
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "heap", arg: 1, scope: !552, file: !355, line: 420, type: !343)
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pos", arg: 2, scope: !552, file: !355, line: 420, type: !11)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "startpos", scope: !552, file: !355, line: 422, type: !11)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "endpos", scope: !552, file: !355, line: 422, type: !11)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "childpos", scope: !552, file: !355, line: 422, type: !11)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rightpos", scope: !552, file: !355, line: 422, type: !11)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "limit", scope: !552, file: !355, line: 422, type: !11)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmp", scope: !552, file: !355, line: 423, type: !44)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newitem", scope: !552, file: !355, line: 424, type: !5)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !552, file: !355, line: 424, type: !5)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !565, file: !355, line: 448, type: !5)
!565 = distinct !DILexicalBlock(scope: !566, file: !355, line: 448, column: 20)
!566 = distinct !DILexicalBlock(scope: !567, file: !355, line: 447, column: 28)
!567 = distinct !DILexicalBlock(scope: !568, file: !355, line: 447, column: 17)
!568 = distinct !DILexicalBlock(scope: !569, file: !355, line: 442, column: 32)
!569 = distinct !DILexicalBlock(scope: !570, file: !355, line: 442, column: 13)
!570 = distinct !DILexicalBlock(scope: !552, file: !355, line: 438, column: 25)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !572, file: !355, line: 457, type: !5)
!572 = distinct !DILexicalBlock(scope: !570, file: !355, line: 457, column: 12)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !574, file: !355, line: 464, type: !5)
!574 = distinct !DILexicalBlock(scope: !552, file: !355, line: 464, column: 8)
!575 = !DISubprogram(name: "_siftdownmax", scope: !355, file: !355, line: 383, type: !368, isLocal: true, isDefinition: true, scopeLine: 384, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyListObject*, i64, i64)* @_siftdownmax, variables: !576)
!576 = !{!577, !578, !579, !580, !581, !582, !583, !584, !589, !591}
!577 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "heap", arg: 1, scope: !575, file: !355, line: 383, type: !343)
!578 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "startpos", arg: 2, scope: !575, file: !355, line: 383, type: !11)
!579 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pos", arg: 3, scope: !575, file: !355, line: 383, type: !11)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newitem", scope: !575, file: !355, line: 385, type: !5)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "parent", scope: !575, file: !355, line: 385, type: !5)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmp", scope: !575, file: !355, line: 386, type: !44)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "parentpos", scope: !575, file: !355, line: 387, type: !11)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !585, file: !355, line: 404, type: !5)
!585 = distinct !DILexicalBlock(scope: !586, file: !355, line: 404, column: 16)
!586 = distinct !DILexicalBlock(scope: !587, file: !355, line: 403, column: 24)
!587 = distinct !DILexicalBlock(scope: !588, file: !355, line: 403, column: 13)
!588 = distinct !DILexicalBlock(scope: !575, file: !355, line: 399, column: 27)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !590, file: !355, line: 410, type: !5)
!590 = distinct !DILexicalBlock(scope: !588, file: !355, line: 410, column: 12)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !592, file: !355, line: 414, type: !5)
!592 = distinct !DILexicalBlock(scope: !575, file: !355, line: 414, column: 8)
!593 = !{!594, !617, !621, !625, !629, !633, !637, !641, !645, !649, !653}
!594 = !DIGlobalVariable(name: "_heapqmodule", scope: !0, file: !355, line: 697, type: !595, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @_heapqmodule)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !596, line: 47, size: 832, align: 64, elements: !597)
!596 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!597 = !{!598, !607, !608, !609, !610, !613, !614, !615, !616}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !595, file: !596, line: 48, baseType: !599, size: 320, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !596, line: 38, baseType: !600)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !596, line: 33, size: 320, align: 64, elements: !601)
!601 = !{!602, !603, !605, !606}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !600, file: !596, line: 34, baseType: !6, size: 128, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !600, file: !596, line: 35, baseType: !604, size: 64, align: 64, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !600, file: !596, line: 36, baseType: !11, size: 64, align: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !600, file: !596, line: 37, baseType: !5, size: 64, align: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !595, file: !596, line: 49, baseType: !29, size: 64, align: 64, offset: 320)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !595, file: !596, line: 50, baseType: !29, size: 64, align: 64, offset: 384)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !595, file: !596, line: 51, baseType: !11, size: 64, align: 64, offset: 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !595, file: !596, line: 52, baseType: !611, size: 64, align: 64, offset: 512)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !281, line: 47, baseType: !280)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !595, file: !596, line: 53, baseType: !142, size: 64, align: 64, offset: 576)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !595, file: !596, line: 54, baseType: !259, size: 64, align: 64, offset: 640)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !595, file: !596, line: 55, baseType: !142, size: 64, align: 64, offset: 704)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !595, file: !596, line: 56, baseType: !329, size: 64, align: 64, offset: 768)
!617 = !DIGlobalVariable(name: "module_doc", scope: !0, file: !355, line: 571, type: !618, isLocal: true, isDefinition: true, variable: [1264 x i8]* @module_doc)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 10112, align: 8, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 1264)
!621 = !DIGlobalVariable(name: "heapq_methods", scope: !0, file: !355, line: 553, type: !622, isLocal: true, isDefinition: true, variable: [8 x %struct.PyMethodDef]* @heapq_methods)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 2048, align: 64, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 8)
!625 = !DIGlobalVariable(name: "heappush_doc", scope: !0, file: !355, line: 148, type: !626, isLocal: true, isDefinition: true, variable: [83 x i8]* @heappush_doc)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 664, align: 8, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 83)
!629 = !DIGlobalVariable(name: "heappushpop_doc", scope: !0, file: !355, line: 266, type: !630, isLocal: true, isDefinition: true, variable: [210 x i8]* @heappushpop_doc)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 1680, align: 8, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 210)
!633 = !DIGlobalVariable(name: "heappop_doc", scope: !0, file: !355, line: 188, type: !634, isLocal: true, isDefinition: true, variable: [68 x i8]* @heappop_doc)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 544, align: 8, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 68)
!637 = !DIGlobalVariable(name: "heapreplace_doc", scope: !0, file: !355, line: 219, type: !638, isLocal: true, isDefinition: true, variable: [441 x i8]* @heapreplace_doc)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 3528, align: 8, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 441)
!641 = !DIGlobalVariable(name: "heapify_doc", scope: !0, file: !355, line: 296, type: !642, isLocal: true, isDefinition: true, variable: [60 x i8]* @heapify_doc)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 480, align: 8, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 60)
!645 = !DIGlobalVariable(name: "nlargest_doc", scope: !0, file: !355, line: 377, type: !646, isLocal: true, isDefinition: true, variable: [95 x i8]* @nlargest_doc)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 760, align: 8, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 95)
!649 = !DIGlobalVariable(name: "nsmallest_doc", scope: !0, file: !355, line: 548, type: !650, isLocal: true, isDefinition: true, variable: [82 x i8]* @nsmallest_doc)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 656, align: 8, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 82)
!653 = !DIGlobalVariable(name: "__about__", scope: !0, file: !355, line: 602, type: !654, isLocal: true, isDefinition: true, variable: [4721 x i8]* @__about__)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 37768, align: 8, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 4721)
!657 = !{i32 2, !"Dwarf Version", i32 4}
!658 = !{i32 2, !"Debug Info Version", i32 3}
!659 = !{i32 1, !"PIC Level", i32 2}
!660 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!661 = !DILocation(line: 712, column: 5, scope: !354)
!662 = !DIExpression()
!663 = !DILocation(line: 712, column: 15, scope: !354)
!664 = !DILocation(line: 712, column: 19, scope: !354)
!665 = !DILocation(line: 714, column: 9, scope: !354)
!666 = !DILocation(line: 714, column: 7, scope: !354)
!667 = !{!668, !668, i64 0}
!668 = !{!"any pointer", !669, i64 0}
!669 = !{!"omnipotent char", !670, i64 0}
!670 = !{!"Simple C/C++ TBAA"}
