; ModuleID = 'programs_new/Python-new/_iomodule.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !369, globals: !674)
!1 = !DIFile(filename: "_iomodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !12, !15, !247, !350, !358, !55}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !6, line: 177, baseType: !7)
!6 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !8, line: 102, baseType: !9)
!8 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !10, line: 181, baseType: !11)
!10 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!11 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !13, line: 62, baseType: !14)
!13 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!14 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !17, line: 109, baseType: !18)
!17 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !17, line: 105, size: 128, align: 64, elements: !19)
!19 = !{!20, !21}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !18, file: !17, line: 107, baseType: !5, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !18, file: !17, line: 108, baseType: !22, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !17, line: 334, size: 3200, align: 64, elements: !24)
!24 = !{!25, !31, !35, !36, !37, !42, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !23, file: !17, line: 335, baseType: !26, size: 192, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !17, line: 114, baseType: !27)
!27 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 111, size: 192, align: 64, elements: !28)
!28 = !{!29, !30}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !27, file: !17, line: 112, baseType: !16, size: 128, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !27, file: !17, line: 113, baseType: !5, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !23, file: !17, line: 336, baseType: !32, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !23, file: !17, line: 337, baseType: !5, size: 64, align: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !23, file: !17, line: 337, baseType: !5, size: 64, align: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !23, file: !17, line: 341, baseType: !38, size: 64, align: 64, offset: 384)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !17, line: 308, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{null, !15}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !23, file: !17, line: 342, baseType: !43, size: 64, align: 64, offset: 448)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !17, line: 314, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !15, !48, !47}
!47 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !8, line: 48, baseType: !50)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !51, line: 246, size: 1728, align: 64, elements: !52)
!51 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!52 = !{!53, !54, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !74, !75, !76, !77, !79, !81, !83, !87, !90, !92, !93, !94, !95, !96, !97, !98}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !50, file: !51, line: 247, baseType: !47, size: 32, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !50, file: !51, line: 252, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !50, file: !51, line: 253, baseType: !55, size: 64, align: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !50, file: !51, line: 254, baseType: !55, size: 64, align: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !50, file: !51, line: 255, baseType: !55, size: 64, align: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !50, file: !51, line: 256, baseType: !55, size: 64, align: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !50, file: !51, line: 257, baseType: !55, size: 64, align: 64, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !50, file: !51, line: 258, baseType: !55, size: 64, align: 64, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !50, file: !51, line: 259, baseType: !55, size: 64, align: 64, offset: 512)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !50, file: !51, line: 261, baseType: !55, size: 64, align: 64, offset: 576)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !50, file: !51, line: 262, baseType: !55, size: 64, align: 64, offset: 640)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !50, file: !51, line: 263, baseType: !55, size: 64, align: 64, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !50, file: !51, line: 265, baseType: !67, size: 64, align: 64, offset: 768)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !51, line: 161, size: 192, align: 64, elements: !69)
!69 = !{!70, !71, !73}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !68, file: !51, line: 162, baseType: !67, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !68, file: !51, line: 163, baseType: !72, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !68, file: !51, line: 167, baseType: !47, size: 32, align: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !50, file: !51, line: 267, baseType: !72, size: 64, align: 64, offset: 832)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !50, file: !51, line: 269, baseType: !47, size: 32, align: 32, offset: 896)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !50, file: !51, line: 273, baseType: !47, size: 32, align: 32, offset: 928)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !50, file: !51, line: 275, baseType: !78, size: 64, align: 64, offset: 960)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !10, line: 140, baseType: !11)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !50, file: !51, line: 279, baseType: !80, size: 16, align: 16, offset: 1024)
!80 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !50, file: !51, line: 280, baseType: !82, size: 8, align: 8, offset: 1040)
!82 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !50, file: !51, line: 281, baseType: !84, size: 8, align: 8, offset: 1048)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 8, align: 8, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 1)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !50, file: !51, line: 285, baseType: !88, size: 64, align: 64, offset: 1088)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !51, line: 155, baseType: null)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !50, file: !51, line: 294, baseType: !91, size: 64, align: 64, offset: 1152)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !10, line: 141, baseType: !11)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !50, file: !51, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !50, file: !51, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !50, file: !51, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !50, file: !51, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !50, file: !51, line: 307, baseType: !12, size: 64, align: 64, offset: 1472)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !50, file: !51, line: 309, baseType: !47, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !50, file: !51, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !23, file: !17, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !17, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!15, !15, !55}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !23, file: !17, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !17, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!47, !15, !55, !15}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !23, file: !17, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !23, file: !17, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !17, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!15, !15}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !23, file: !17, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !17, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !17, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !17, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!15, !15, !15}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !17, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !17, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !17, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !17, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !17, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !17, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!15, !15, !15, !15}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !17, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !17, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !17, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !17, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !17, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !17, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!47, !15}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !17, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !17, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !17, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !17, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !17, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !17, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !17, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !17, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !17, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !17, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !17, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !17, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !17, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !17, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !17, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !17, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !17, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !17, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !17, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !17, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !17, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !17, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !17, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !17, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !23, file: !17, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !17, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !17, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !17, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!5, !15}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !17, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !17, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !17, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!15, !15, !5}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !17, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !17, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !17, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !17, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!47, !15, !5, !15}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !17, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !17, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !17, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!47, !15, !15}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !17, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !17, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !23, file: !17, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !17, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !17, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !17, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !17, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !17, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!47, !15, !15, !15}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !23, file: !17, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !17, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !15}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !6, line: 186, baseType: !5)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !23, file: !17, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !23, file: !17, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !23, file: !17, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !17, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !23, file: !17, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !17, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !23, file: !17, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !17, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !17, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !17, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!47, !15, !235, !47}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !17, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !17, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !17, line: 179, baseType: !4, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !17, line: 180, baseType: !15, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !17, line: 181, baseType: !5, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !17, line: 182, baseType: !5, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !17, line: 184, baseType: !47, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !17, line: 185, baseType: !47, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !17, line: 186, baseType: !55, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !17, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !17, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !17, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !17, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !17, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !17, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !15, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !23, file: !17, line: 366, baseType: !14, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !23, file: !17, line: 368, baseType: !32, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !23, file: !17, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !17, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!47, !15, !263, !4}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !17, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!47, !15, !4}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !23, file: !17, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !23, file: !17, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !17, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!15, !15, !15, !47}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !23, file: !17, line: 382, baseType: !5, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !23, file: !17, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !17, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !23, file: !17, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !17, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !23, file: !17, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !32, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !47, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !32, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !23, file: !17, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !291, line: 18, size: 320, align: 64, elements: !292)
!291 = !DIFile(filename: "Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!292 = !{!293, !294, !295, !296, !297}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !291, line: 19, baseType: !55, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !290, file: !291, line: 20, baseType: !47, size: 32, align: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !290, file: !291, line: 21, baseType: !5, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !290, file: !291, line: 22, baseType: !47, size: 32, align: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !290, file: !291, line: 23, baseType: !55, size: 64, align: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !23, file: !17, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !55, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!15, !15, !4}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!47, !15, !15, !4}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !55, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !23, file: !17, line: 392, baseType: !22, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !23, file: !17, line: 393, baseType: !15, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !23, file: !17, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !17, line: 325, baseType: !134)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !23, file: !17, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !17, line: 326, baseType: !210)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !23, file: !17, line: 396, baseType: !5, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !23, file: !17, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !17, line: 327, baseType: !210)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !23, file: !17, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !17, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!15, !22, !5}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !23, file: !17, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !17, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!15, !22, !15, !15}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !23, file: !17, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !17, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !4}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !23, file: !17, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !23, file: !17, line: 402, baseType: !15, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !23, file: !17, line: 403, baseType: !15, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !23, file: !17, line: 404, baseType: !15, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !23, file: !17, line: 405, baseType: !15, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !23, file: !17, line: 406, baseType: !15, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !23, file: !17, line: 407, baseType: !38, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !23, file: !17, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !23, file: !17, line: 412, baseType: !38, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyIO_State", file: !352, line: 135, baseType: !353)
!352 = !DIFile(filename: "./Modules/_io/_iomodule.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!353 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 130, size: 192, align: 64, elements: !354)
!354 = !{!355, !356, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !353, file: !352, line: 131, baseType: !47, size: 32, align: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "locale_module", scope: !353, file: !352, line: 132, baseType: !15, size: 64, align: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "unsupported_operation", scope: !353, file: !352, line: 134, baseType: !15, size: 64, align: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyWeakReference", file: !360, line: 10, baseType: !361)
!360 = !DIFile(filename: "Include/weakrefobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyWeakReference", file: !360, line: 16, size: 448, align: 64, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !361, file: !360, line: 17, baseType: !16, size: 128, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "wr_object", scope: !361, file: !360, line: 23, baseType: !15, size: 64, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "wr_callback", scope: !361, file: !360, line: 26, baseType: !15, size: 64, align: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !361, file: !360, line: 31, baseType: !218, size: 64, align: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "wr_prev", scope: !361, file: !360, line: 38, baseType: !358, size: 64, align: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "wr_next", scope: !361, file: !360, line: 39, baseType: !358, size: 64, align: 64, offset: 384)
!369 = !{!370, !384, !389, !395, !413, !478, !611, !638, !654, !671}
!370 = !DISubprogram(name: "PyNumber_AsOff_t", scope: !371, file: !371, line: 475, type: !372, isLocal: false, isDefinition: true, scopeLine: 476, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*, %struct._object*)* @PyNumber_AsOff_t, variables: !376)
!371 = !DIFile(filename: "./Modules/_io/_iomodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!372 = !DISubroutineType(types: !373)
!373 = !{!374, !15, !15}
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_off_t", file: !352, line: 94, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !8, line: 92, baseType: !91)
!376 = !{!377, !378, !379, !380, !381, !382}
!377 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 1, scope: !370, file: !371, line: 475, type: !15)
!378 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "err", arg: 2, scope: !370, file: !371, line: 475, type: !15)
!379 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !370, file: !371, line: 477, type: !374)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "runerr", scope: !370, file: !371, line: 478, type: !15)
!381 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !370, file: !371, line: 479, type: !15)
!382 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !383, file: !371, line: 514, type: !15)
!383 = distinct !DILexicalBlock(scope: !370, file: !371, line: 514, column: 8)
!384 = !DISubprogram(name: "_PyIO_ConvertSsize_t", scope: !371, file: !371, line: 521, type: !265, isLocal: false, isDefinition: true, scopeLine: 521, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*)* @_PyIO_ConvertSsize_t, variables: !385)
!385 = !{!386, !387, !388}
!386 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !384, file: !371, line: 521, type: !15)
!387 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "result", arg: 2, scope: !384, file: !371, line: 521, type: !4)
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "limit", scope: !384, file: !371, line: 522, type: !5)
!389 = !DISubprogram(name: "_PyIO_get_module_state", scope: !371, file: !371, line: 543, type: !390, isLocal: false, isDefinition: true, scopeLine: 544, flags: DIFlagPrototyped, isOptimized: true, function: %struct._PyIO_State* ()* @_PyIO_get_module_state, variables: !392)
!390 = !DISubroutineType(types: !391)
!391 = !{!350}
!392 = !{!393, !394}
!393 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !389, file: !371, line: 545, type: !15)
!394 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !389, file: !371, line: 546, type: !350)
!395 = !DISubprogram(name: "_PyIO_get_locale_module", scope: !371, file: !371, line: 557, type: !396, isLocal: false, isDefinition: true, scopeLine: 558, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._PyIO_State*)* @_PyIO_get_locale_module, variables: !398)
!396 = !DISubroutineType(types: !397)
!397 = !{!15, !350}
!398 = !{!399, !400, !401, !405, !409}
!399 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 1, scope: !395, file: !371, line: 557, type: !350)
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !395, file: !371, line: 559, type: !15)
!401 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !402, file: !371, line: 567, type: !15)
!402 = distinct !DILexicalBlock(scope: !403, file: !371, line: 567, column: 12)
!403 = distinct !DILexicalBlock(scope: !404, file: !371, line: 560, column: 45)
!404 = distinct !DILexicalBlock(scope: !395, file: !371, line: 560, column: 9)
!405 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !406, file: !371, line: 567, type: !15)
!406 = distinct !DILexicalBlock(scope: !407, file: !371, line: 567, column: 139)
!407 = distinct !DILexicalBlock(scope: !408, file: !371, line: 567, column: 97)
!408 = distinct !DILexicalBlock(scope: !402, file: !371, line: 567, column: 74)
!409 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !410, file: !371, line: 574, type: !15)
!410 = distinct !DILexicalBlock(scope: !411, file: !371, line: 574, column: 12)
!411 = distinct !DILexicalBlock(scope: !412, file: !371, line: 573, column: 45)
!412 = distinct !DILexicalBlock(scope: !395, file: !371, line: 573, column: 9)
!413 = !DISubprogram(name: "PyInit__io", scope: !371, file: !371, line: 633, type: !414, isLocal: false, isDefinition: true, scopeLine: 634, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__io, variables: !416)
!414 = !DISubroutineType(types: !415)
!415 = !{!15}
!416 = !{!417, !418, !419, !423, !427, !431, !435, !439, !443, !447, !451, !455, !459, !463, !467, !471, !473, !476}
!417 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !413, file: !371, line: 635, type: !15)
!418 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !413, file: !371, line: 636, type: !350)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !420, file: !371, line: 675, type: !15)
!420 = distinct !DILexicalBlock(scope: !421, file: !371, line: 675, column: 177)
!421 = distinct !DILexicalBlock(scope: !422, file: !371, line: 675, column: 172)
!422 = distinct !DILexicalBlock(scope: !413, file: !371, line: 675, column: 106)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !424, file: !371, line: 676, type: !15)
!424 = distinct !DILexicalBlock(scope: !425, file: !371, line: 676, column: 189)
!425 = distinct !DILexicalBlock(scope: !426, file: !371, line: 676, column: 184)
!426 = distinct !DILexicalBlock(scope: !413, file: !371, line: 676, column: 112)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !428, file: !371, line: 677, type: !15)
!428 = distinct !DILexicalBlock(scope: !429, file: !371, line: 677, column: 209)
!429 = distinct !DILexicalBlock(scope: !430, file: !371, line: 677, column: 204)
!430 = distinct !DILexicalBlock(scope: !413, file: !371, line: 677, column: 122)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !432, file: !371, line: 678, type: !15)
!432 = distinct !DILexicalBlock(scope: !433, file: !371, line: 678, column: 193)
!433 = distinct !DILexicalBlock(scope: !434, file: !371, line: 678, column: 188)
!434 = distinct !DILexicalBlock(scope: !413, file: !371, line: 678, column: 114)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !436, file: !371, line: 683, type: !15)
!436 = distinct !DILexicalBlock(scope: !437, file: !371, line: 683, column: 176)
!437 = distinct !DILexicalBlock(scope: !438, file: !371, line: 683, column: 171)
!438 = distinct !DILexicalBlock(scope: !413, file: !371, line: 683, column: 106)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !440, file: !371, line: 687, type: !15)
!440 = distinct !DILexicalBlock(scope: !441, file: !371, line: 687, column: 180)
!441 = distinct !DILexicalBlock(scope: !442, file: !371, line: 687, column: 175)
!442 = distinct !DILexicalBlock(scope: !413, file: !371, line: 687, column: 108)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !444, file: !371, line: 693, type: !15)
!444 = distinct !DILexicalBlock(scope: !445, file: !371, line: 693, column: 184)
!445 = distinct !DILexicalBlock(scope: !446, file: !371, line: 693, column: 179)
!446 = distinct !DILexicalBlock(scope: !413, file: !371, line: 693, column: 110)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !448, file: !371, line: 697, type: !15)
!448 = distinct !DILexicalBlock(scope: !449, file: !371, line: 697, column: 208)
!449 = distinct !DILexicalBlock(scope: !450, file: !371, line: 697, column: 203)
!450 = distinct !DILexicalBlock(scope: !413, file: !371, line: 697, column: 122)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !452, file: !371, line: 701, type: !15)
!452 = distinct !DILexicalBlock(scope: !453, file: !371, line: 701, column: 208)
!453 = distinct !DILexicalBlock(scope: !454, file: !371, line: 701, column: 203)
!454 = distinct !DILexicalBlock(scope: !413, file: !371, line: 701, column: 122)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !456, file: !371, line: 705, type: !15)
!456 = distinct !DILexicalBlock(scope: !457, file: !371, line: 705, column: 208)
!457 = distinct !DILexicalBlock(scope: !458, file: !371, line: 705, column: 203)
!458 = distinct !DILexicalBlock(scope: !413, file: !371, line: 705, column: 122)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !460, file: !371, line: 709, type: !15)
!460 = distinct !DILexicalBlock(scope: !461, file: !371, line: 709, column: 208)
!461 = distinct !DILexicalBlock(scope: !462, file: !371, line: 709, column: 203)
!462 = distinct !DILexicalBlock(scope: !413, file: !371, line: 709, column: 122)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !464, file: !371, line: 713, type: !15)
!464 = distinct !DILexicalBlock(scope: !465, file: !371, line: 713, column: 204)
!465 = distinct !DILexicalBlock(scope: !466, file: !371, line: 713, column: 199)
!466 = distinct !DILexicalBlock(scope: !413, file: !371, line: 713, column: 120)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !468, file: !371, line: 716, type: !15)
!468 = distinct !DILexicalBlock(scope: !469, file: !371, line: 716, column: 252)
!469 = distinct !DILexicalBlock(scope: !470, file: !371, line: 716, column: 247)
!470 = distinct !DILexicalBlock(scope: !413, file: !371, line: 716, column: 144)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !472, file: !371, line: 767, type: !15)
!472 = distinct !DILexicalBlock(scope: !413, file: !371, line: 767, column: 8)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !474, file: !371, line: 767, type: !15)
!474 = distinct !DILexicalBlock(scope: !475, file: !371, line: 767, column: 120)
!475 = distinct !DILexicalBlock(scope: !472, file: !371, line: 767, column: 86)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !477, file: !371, line: 768, type: !15)
!477 = distinct !DILexicalBlock(scope: !413, file: !371, line: 768, column: 8)
!478 = !DISubprogram(name: "io_open", scope: !371, file: !371, line: 221, type: !135, isLocal: true, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @io_open, variables: !479)
!479 = !{!480, !481, !482, !483, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !508, !509, !510, !511, !512, !513, !514, !515, !519, !521, !523, !563, !564, !565, !567, !571, !573, !575, !579, !583, !585, !589, !591, !593, !596, !598, !601, !603, !606, !608}
!480 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !478, file: !371, line: 221, type: !15)
!481 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !478, file: !371, line: 221, type: !15)
!482 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !478, file: !371, line: 221, type: !15)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kwlist", scope: !478, file: !371, line: 223, type: !484)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 576, align: 64, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 9)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file", scope: !478, file: !371, line: 226, type: !15)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "opener", scope: !478, file: !371, line: 226, type: !15)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !478, file: !371, line: 227, type: !55)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffering", scope: !478, file: !371, line: 228, type: !47)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "closefd", scope: !478, file: !371, line: 228, type: !47)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "encoding", scope: !478, file: !371, line: 229, type: !55)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errors", scope: !478, file: !371, line: 229, type: !55)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newline", scope: !478, file: !371, line: 229, type: !55)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !478, file: !371, line: 230, type: !348)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "creating", scope: !478, file: !371, line: 232, type: !47)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reading", scope: !478, file: !371, line: 232, type: !47)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "writing", scope: !478, file: !371, line: 232, type: !47)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "appending", scope: !478, file: !371, line: 232, type: !47)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "updating", scope: !478, file: !371, line: 232, type: !47)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "text", scope: !478, file: !371, line: 233, type: !47)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "binary", scope: !478, file: !371, line: 233, type: !47)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "universal", scope: !478, file: !371, line: 233, type: !47)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rawmode", scope: !478, file: !371, line: 235, type: !505)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 48, align: 8, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 6)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !478, file: !371, line: 235, type: !55)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line_buffering", scope: !478, file: !371, line: 236, type: !47)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "isatty", scope: !478, file: !371, line: 236, type: !47)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "raw", scope: !478, file: !371, line: 238, type: !15)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modeobj", scope: !478, file: !371, line: 238, type: !15)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !478, file: !371, line: 238, type: !15)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wrapper", scope: !478, file: !371, line: 238, type: !15)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !516, file: !371, line: 260, type: !34)
!516 = distinct !DILexicalBlock(scope: !517, file: !371, line: 259, column: 40)
!517 = distinct !DILexicalBlock(scope: !518, file: !371, line: 259, column: 5)
!518 = distinct !DILexicalBlock(scope: !478, file: !371, line: 259, column: 5)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !520, file: !371, line: 364, type: !15)
!520 = distinct !DILexicalBlock(scope: !478, file: !371, line: 363, column: 5)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !522, file: !371, line: 368, type: !15)
!522 = distinct !DILexicalBlock(scope: !520, file: !371, line: 368, column: 12)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !524, file: !371, line: 384, type: !527)
!524 = distinct !DILexicalBlock(scope: !525, file: !371, line: 383, column: 9)
!525 = distinct !DILexicalBlock(scope: !526, file: !371, line: 380, column: 24)
!526 = distinct !DILexicalBlock(scope: !478, file: !371, line: 380, column: 9)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !528, line: 46, size: 1152, align: 64, elements: !529)
!528 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!529 = !{!530, !532, !534, !536, !538, !540, !542, !543, !544, !545, !547, !549, !557, !558, !559}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !527, file: !528, line: 48, baseType: !531, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !10, line: 133, baseType: !14)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !527, file: !528, line: 53, baseType: !533, size: 64, align: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !10, line: 136, baseType: !14)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !527, file: !528, line: 61, baseType: !535, size: 64, align: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !10, line: 139, baseType: !14)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !527, file: !528, line: 62, baseType: !537, size: 32, align: 32, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !10, line: 138, baseType: !348)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !527, file: !528, line: 64, baseType: !539, size: 32, align: 32, offset: 224)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !10, line: 134, baseType: !348)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !527, file: !528, line: 65, baseType: !541, size: 32, align: 32, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !10, line: 135, baseType: !348)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !527, file: !528, line: 67, baseType: !47, size: 32, align: 32, offset: 288)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !527, file: !528, line: 69, baseType: !531, size: 64, align: 64, offset: 320)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !527, file: !528, line: 74, baseType: !78, size: 64, align: 64, offset: 384)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !527, file: !528, line: 78, baseType: !546, size: 64, align: 64, offset: 448)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !10, line: 162, baseType: !11)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !527, file: !528, line: 80, baseType: !548, size: 64, align: 64, offset: 512)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !10, line: 167, baseType: !11)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !527, file: !528, line: 91, baseType: !550, size: 128, align: 64, offset: 576)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !551, line: 120, size: 128, align: 64, elements: !552)
!551 = !DIFile(filename: "/usr/include/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!552 = !{!553, !555}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !550, file: !551, line: 122, baseType: !554, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !10, line: 148, baseType: !11)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !550, file: !551, line: 123, baseType: !556, size: 64, align: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !10, line: 184, baseType: !11)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !527, file: !528, line: 92, baseType: !550, size: 128, align: 64, offset: 704)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !527, file: !528, line: 93, baseType: !550, size: 128, align: 64, offset: 832)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !527, file: !528, line: 106, baseType: !560, size: 192, align: 64, offset: 960)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 192, align: 64, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 3)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fileno", scope: !524, file: !371, line: 385, type: !11)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !524, file: !371, line: 386, type: !15)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !566, file: !371, line: 391, type: !15)
!566 = distinct !DILexicalBlock(scope: !524, file: !371, line: 391, column: 16)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !568, file: !371, line: 414, type: !15)
!568 = distinct !DILexicalBlock(scope: !569, file: !371, line: 414, column: 12)
!569 = distinct !DILexicalBlock(scope: !570, file: !371, line: 407, column: 25)
!570 = distinct !DILexicalBlock(scope: !478, file: !371, line: 407, column: 9)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "Buffered_class", scope: !572, file: !371, line: 420, type: !15)
!572 = distinct !DILexicalBlock(scope: !478, file: !371, line: 419, column: 5)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !574, file: !371, line: 436, type: !15)
!574 = distinct !DILexicalBlock(scope: !478, file: !371, line: 436, column: 8)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !576, file: !371, line: 436, type: !15)
!576 = distinct !DILexicalBlock(scope: !577, file: !371, line: 436, column: 101)
!577 = distinct !DILexicalBlock(scope: !578, file: !371, line: 436, column: 76)
!578 = distinct !DILexicalBlock(scope: !574, file: !371, line: 436, column: 53)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !580, file: !371, line: 443, type: !15)
!580 = distinct !DILexicalBlock(scope: !581, file: !371, line: 443, column: 12)
!581 = distinct !DILexicalBlock(scope: !582, file: !371, line: 442, column: 17)
!582 = distinct !DILexicalBlock(scope: !478, file: !371, line: 442, column: 9)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !584, file: !371, line: 453, type: !15)
!584 = distinct !DILexicalBlock(scope: !478, file: !371, line: 453, column: 8)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !586, file: !371, line: 453, type: !15)
!586 = distinct !DILexicalBlock(scope: !587, file: !371, line: 453, column: 107)
!587 = distinct !DILexicalBlock(scope: !588, file: !371, line: 453, column: 79)
!588 = distinct !DILexicalBlock(scope: !584, file: !371, line: 453, column: 56)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !590, file: !371, line: 459, type: !15)
!590 = distinct !DILexicalBlock(scope: !478, file: !371, line: 459, column: 8)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !592, file: !371, line: 463, type: !15)
!592 = distinct !DILexicalBlock(scope: !478, file: !371, line: 463, column: 8)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !594, file: !371, line: 463, type: !15)
!594 = distinct !DILexicalBlock(scope: !595, file: !371, line: 463, column: 95)
!595 = distinct !DILexicalBlock(scope: !592, file: !371, line: 463, column: 61)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !597, file: !371, line: 464, type: !15)
!597 = distinct !DILexicalBlock(scope: !478, file: !371, line: 464, column: 8)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !599, file: !371, line: 464, type: !15)
!599 = distinct !DILexicalBlock(scope: !600, file: !371, line: 464, column: 99)
!600 = distinct !DILexicalBlock(scope: !597, file: !371, line: 464, column: 65)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !602, file: !371, line: 465, type: !15)
!602 = distinct !DILexicalBlock(scope: !478, file: !371, line: 465, column: 8)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !604, file: !371, line: 465, type: !15)
!604 = distinct !DILexicalBlock(scope: !605, file: !371, line: 465, column: 98)
!605 = distinct !DILexicalBlock(scope: !602, file: !371, line: 465, column: 64)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !607, file: !371, line: 466, type: !15)
!607 = distinct !DILexicalBlock(scope: !478, file: !371, line: 466, column: 8)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !609, file: !371, line: 466, type: !15)
!609 = distinct !DILexicalBlock(scope: !610, file: !371, line: 466, column: 99)
!610 = distinct !DILexicalBlock(scope: !607, file: !371, line: 466, column: 65)
!611 = !DISubprogram(name: "fstat64", scope: !612, file: !612, line: 517, type: !613, isLocal: false, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.stat64*)* @fstat64, variables: !635)
!612 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!613 = !DISubroutineType(types: !614)
!614 = !{!47, !47, !615}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64, align: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !528, line: 119, size: 1152, align: 64, elements: !617)
!617 = !{!618, !619, !621, !622, !623, !624, !625, !626, !627, !628, !629, !631, !632, !633, !634}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !616, file: !528, line: 121, baseType: !531, size: 64, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !616, file: !528, line: 123, baseType: !620, size: 64, align: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !10, line: 137, baseType: !14)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !616, file: !528, line: 124, baseType: !535, size: 64, align: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !616, file: !528, line: 125, baseType: !537, size: 32, align: 32, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !616, file: !528, line: 132, baseType: !539, size: 32, align: 32, offset: 224)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !616, file: !528, line: 133, baseType: !541, size: 32, align: 32, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !616, file: !528, line: 135, baseType: !47, size: 32, align: 32, offset: 288)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !616, file: !528, line: 136, baseType: !531, size: 64, align: 64, offset: 320)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !616, file: !528, line: 137, baseType: !78, size: 64, align: 64, offset: 384)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !616, file: !528, line: 143, baseType: !546, size: 64, align: 64, offset: 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !616, file: !528, line: 144, baseType: !630, size: 64, align: 64, offset: 512)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !10, line: 168, baseType: !11)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !616, file: !528, line: 152, baseType: !550, size: 128, align: 64, offset: 576)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !616, file: !528, line: 153, baseType: !550, size: 128, align: 64, offset: 704)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !616, file: !528, line: 154, baseType: !550, size: 128, align: 64, offset: 832)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !616, file: !528, line: 164, baseType: !560, size: 192, align: 64, offset: 960)
!635 = !{!636, !637}
!636 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__fd", arg: 1, scope: !611, file: !612, line: 517, type: !47)
!637 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__statbuf", arg: 2, scope: !611, file: !612, line: 517, type: !615)
!638 = !DISubprogram(name: "iomodule_traverse", scope: !371, file: !371, line: 582, type: !261, isLocal: true, isDefinition: true, scopeLine: 582, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)* @iomodule_traverse, variables: !639)
!639 = !{!640, !641, !642, !643, !644, !650}
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mod", arg: 1, scope: !638, file: !371, line: 582, type: !15)
!641 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !638, file: !371, line: 582, type: !263)
!642 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !638, file: !371, line: 582, type: !4)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !638, file: !371, line: 583, type: !350)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !645, file: !371, line: 587, type: !47)
!645 = distinct !DILexicalBlock(scope: !646, file: !371, line: 587, column: 40)
!646 = distinct !DILexicalBlock(scope: !647, file: !371, line: 587, column: 18)
!647 = distinct !DILexicalBlock(scope: !648, file: !371, line: 587, column: 12)
!648 = distinct !DILexicalBlock(scope: !649, file: !371, line: 586, column: 45)
!649 = distinct !DILexicalBlock(scope: !638, file: !371, line: 586, column: 9)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !651, file: !371, line: 589, type: !47)
!651 = distinct !DILexicalBlock(scope: !652, file: !371, line: 589, column: 44)
!652 = distinct !DILexicalBlock(scope: !653, file: !371, line: 589, column: 14)
!653 = distinct !DILexicalBlock(scope: !638, file: !371, line: 589, column: 8)
!654 = !DISubprogram(name: "iomodule_clear", scope: !371, file: !371, line: 595, type: !144, isLocal: true, isDefinition: true, scopeLine: 595, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @iomodule_clear, variables: !655)
!655 = !{!656, !657, !658, !661, !665, !667}
!656 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mod", arg: 1, scope: !654, file: !371, line: 595, type: !15)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !654, file: !371, line: 596, type: !350)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !659, file: !371, line: 600, type: !15)
!659 = distinct !DILexicalBlock(scope: !660, file: !371, line: 600, column: 12)
!660 = distinct !DILexicalBlock(scope: !654, file: !371, line: 599, column: 9)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !662, file: !371, line: 600, type: !15)
!662 = distinct !DILexicalBlock(scope: !663, file: !371, line: 600, column: 139)
!663 = distinct !DILexicalBlock(scope: !664, file: !371, line: 600, column: 97)
!664 = distinct !DILexicalBlock(scope: !659, file: !371, line: 600, column: 74)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !666, file: !371, line: 601, type: !15)
!666 = distinct !DILexicalBlock(scope: !654, file: !371, line: 601, column: 8)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !668, file: !371, line: 601, type: !15)
!668 = distinct !DILexicalBlock(scope: !669, file: !371, line: 601, column: 151)
!669 = distinct !DILexicalBlock(scope: !670, file: !371, line: 601, column: 101)
!670 = distinct !DILexicalBlock(scope: !666, file: !371, line: 601, column: 78)
!671 = !DISubprogram(name: "iomodule_free", scope: !371, file: !371, line: 606, type: !40, isLocal: true, isDefinition: true, scopeLine: 606, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @iomodule_free, variables: !672)
!672 = !{!673}
!673 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mod", arg: 1, scope: !671, file: !371, line: 606, type: !15)
!674 = !{!675, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !729, !733, !741, !742, !743}
!675 = !DIGlobalVariable(name: "_PyIO_Module", scope: !0, file: !371, line: 620, type: !676, isLocal: false, isDefinition: true, variable: %struct.PyModuleDef* @_PyIO_Module)
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !677, line: 47, size: 832, align: 64, elements: !678)
!677 = !DIFile(filename: "Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!678 = !{!679, !688, !689, !690, !691, !694, !695, !696, !697}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !676, file: !677, line: 48, baseType: !680, size: 320, align: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !677, line: 38, baseType: !681)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !677, line: 33, size: 320, align: 64, elements: !682)
!682 = !{!683, !684, !686, !687}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !681, file: !677, line: 34, baseType: !16, size: 128, align: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !681, file: !677, line: 35, baseType: !685, size: 64, align: 64, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !681, file: !677, line: 36, baseType: !5, size: 64, align: 64, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !681, file: !677, line: 37, baseType: !15, size: 64, align: 64, offset: 256)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !676, file: !677, line: 49, baseType: !32, size: 64, align: 64, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !676, file: !677, line: 50, baseType: !32, size: 64, align: 64, offset: 384)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !676, file: !677, line: 51, baseType: !5, size: 64, align: 64, offset: 448)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !676, file: !677, line: 52, baseType: !692, size: 64, align: 64, offset: 512)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !281, line: 47, baseType: !280)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !676, file: !677, line: 53, baseType: !142, size: 64, align: 64, offset: 576)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !676, file: !677, line: 54, baseType: !259, size: 64, align: 64, offset: 640)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !676, file: !677, line: 55, baseType: !142, size: 64, align: 64, offset: 704)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !676, file: !677, line: 56, baseType: !336, size: 64, align: 64, offset: 768)
!698 = !DIGlobalVariable(name: "_PyIO_str_close", scope: !0, file: !371, line: 26, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_close)
!699 = !DIGlobalVariable(name: "_PyIO_str_closed", scope: !0, file: !371, line: 27, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_closed)
!700 = !DIGlobalVariable(name: "_PyIO_str_decode", scope: !0, file: !371, line: 28, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_decode)
!701 = !DIGlobalVariable(name: "_PyIO_str_encode", scope: !0, file: !371, line: 29, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_encode)
!702 = !DIGlobalVariable(name: "_PyIO_str_fileno", scope: !0, file: !371, line: 30, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_fileno)
!703 = !DIGlobalVariable(name: "_PyIO_str_flush", scope: !0, file: !371, line: 31, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_flush)
!704 = !DIGlobalVariable(name: "_PyIO_str_getstate", scope: !0, file: !371, line: 32, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_getstate)
!705 = !DIGlobalVariable(name: "_PyIO_str_isatty", scope: !0, file: !371, line: 33, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_isatty)
!706 = !DIGlobalVariable(name: "_PyIO_str_newlines", scope: !0, file: !371, line: 34, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_newlines)
!707 = !DIGlobalVariable(name: "_PyIO_str_nl", scope: !0, file: !371, line: 35, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_nl)
!708 = !DIGlobalVariable(name: "_PyIO_str_read", scope: !0, file: !371, line: 36, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_read)
!709 = !DIGlobalVariable(name: "_PyIO_str_read1", scope: !0, file: !371, line: 37, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_read1)
!710 = !DIGlobalVariable(name: "_PyIO_str_readable", scope: !0, file: !371, line: 38, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_readable)
!711 = !DIGlobalVariable(name: "_PyIO_str_readall", scope: !0, file: !371, line: 39, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_readall)
!712 = !DIGlobalVariable(name: "_PyIO_str_readinto", scope: !0, file: !371, line: 40, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_readinto)
!713 = !DIGlobalVariable(name: "_PyIO_str_readline", scope: !0, file: !371, line: 41, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_readline)
!714 = !DIGlobalVariable(name: "_PyIO_str_reset", scope: !0, file: !371, line: 42, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_reset)
!715 = !DIGlobalVariable(name: "_PyIO_str_seek", scope: !0, file: !371, line: 43, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_seek)
!716 = !DIGlobalVariable(name: "_PyIO_str_seekable", scope: !0, file: !371, line: 44, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_seekable)
!717 = !DIGlobalVariable(name: "_PyIO_str_setstate", scope: !0, file: !371, line: 45, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_setstate)
!718 = !DIGlobalVariable(name: "_PyIO_str_tell", scope: !0, file: !371, line: 46, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_tell)
!719 = !DIGlobalVariable(name: "_PyIO_str_truncate", scope: !0, file: !371, line: 47, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_truncate)
!720 = !DIGlobalVariable(name: "_PyIO_str_writable", scope: !0, file: !371, line: 48, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_writable)
!721 = !DIGlobalVariable(name: "_PyIO_str_write", scope: !0, file: !371, line: 49, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_str_write)
!722 = !DIGlobalVariable(name: "_PyIO_empty_str", scope: !0, file: !371, line: 51, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_empty_str)
!723 = !DIGlobalVariable(name: "_PyIO_empty_bytes", scope: !0, file: !371, line: 52, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_empty_bytes)
!724 = !DIGlobalVariable(name: "_PyIO_zero", scope: !0, file: !371, line: 53, type: !15, isLocal: false, isDefinition: true, variable: %struct._object** @_PyIO_zero)
!725 = !DIGlobalVariable(name: "module_doc", scope: !0, file: !371, line: 56, type: !726, isLocal: true, isDefinition: true, variable: [1473 x i8]* @module_doc)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 11784, align: 8, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 1473)
!729 = !DIGlobalVariable(name: "module_methods", scope: !0, file: !371, line: 615, type: !730, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMethodDef]* @module_methods)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !693, size: 512, align: 64, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 2)
!733 = !DIGlobalVariable(name: "PyId_isatty", scope: !478, file: !371, line: 240, type: !734, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @io_open.PyId_isatty)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !17, line: 144, baseType: !735)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !17, line: 140, size: 192, align: 64, elements: !736)
!736 = !{!737, !739, !740}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !735, file: !17, line: 141, baseType: !738, size: 64, align: 64)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64, align: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !735, file: !17, line: 142, baseType: !32, size: 64, align: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !735, file: !17, line: 143, baseType: !15, size: 64, align: 64, offset: 128)
!741 = !DIGlobalVariable(name: "PyId_fileno", scope: !478, file: !371, line: 241, type: !734, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @io_open.PyId_fileno)
!742 = !DIGlobalVariable(name: "PyId_mode", scope: !478, file: !371, line: 242, type: !734, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @io_open.PyId_mode)
!743 = !DIGlobalVariable(name: "open_doc", scope: !0, file: !371, line: 96, type: !744, isLocal: true, isDefinition: true, variable: [6355 x i8]* @open_doc)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 50840, align: 8, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 6355)
!747 = !{i32 2, !"Dwarf Version", i32 4}
!748 = !{i32 2, !"Debug Info Version", i32 3}
!749 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!750 = !{!751, !751, i64 0}
!751 = !{!"any pointer", !752, i64 0}
!752 = !{!"omnipotent char", !753, i64 0}
!753 = !{!"Simple C/C++ TBAA"}
!754 = !DIExpression()
!755 = !DILocation(line: 475, column: 28, scope: !370)
!756 = !DILocation(line: 475, column: 44, scope: !370)
!757 = !DILocation(line: 477, column: 5, scope: !370)
!758 = !DILocation(line: 477, column: 14, scope: !370)
!759 = !DILocation(line: 478, column: 5, scope: !370)
!760 = !DILocation(line: 478, column: 15, scope: !370)
!761 = !DILocation(line: 479, column: 5, scope: !370)
!762 = !DILocation(line: 479, column: 15, scope: !370)
!763 = !DILocation(line: 479, column: 38, scope: !370)
!764 = !DILocation(line: 479, column: 23, scope: !370)
!765 = !DILocation(line: 480, column: 9, scope: !766)
!766 = distinct !DILexicalBlock(scope: !370, file: !371, line: 480, column: 9)
!767 = !DILocation(line: 480, column: 15, scope: !766)
!768 = !DILocation(line: 480, column: 9, scope: !370)
!769 = !DILocation(line: 481, column: 9, scope: !766)
!770 = !DILocation(line: 484, column: 31, scope: !370)
!771 = !DILocation(line: 484, column: 14, scope: !370)
!772 = !DILocation(line: 484, column: 12, scope: !370)
!773 = !{!774, !774, i64 0}
!774 = !{!"long", !752, i64 0}
!775 = !DILocation(line: 485, column: 9, scope: !776)
!776 = distinct !DILexicalBlock(scope: !370, file: !371, line: 485, column: 9)
!777 = !DILocation(line: 485, column: 16, scope: !776)
!778 = !DILocation(line: 485, column: 22, scope: !776)
!779 = !DILocation(line: 485, column: 36, scope: !780)
!780 = !DILexicalBlockFile(scope: !776, file: !371, discriminator: 1)
!781 = !DILocation(line: 485, column: 34, scope: !776)
!782 = !DILocation(line: 485, column: 9, scope: !370)
!783 = !DILocation(line: 486, column: 9, scope: !776)
!784 = !DILocation(line: 489, column: 38, scope: !785)
!785 = distinct !DILexicalBlock(scope: !370, file: !371, line: 489, column: 9)
!786 = !DILocation(line: 489, column: 46, scope: !785)
!787 = !DILocation(line: 489, column: 10, scope: !785)
!788 = !DILocation(line: 489, column: 9, scope: !370)
!789 = !DILocation(line: 490, column: 9, scope: !785)
!790 = !DILocation(line: 492, column: 5, scope: !370)
!791 = !DILocation(line: 496, column: 10, scope: !792)
!792 = distinct !DILexicalBlock(scope: !370, file: !371, line: 496, column: 9)
!793 = !DILocation(line: 496, column: 9, scope: !370)
!794 = !DILocation(line: 501, column: 26, scope: !795)
!795 = distinct !DILexicalBlock(scope: !796, file: !371, line: 501, column: 13)
!796 = distinct !DILexicalBlock(scope: !792, file: !371, line: 496, column: 15)
!797 = !DILocation(line: 501, column: 13, scope: !795)
!798 = !DILocation(line: 501, column: 33, scope: !795)
!799 = !DILocation(line: 501, column: 13, scope: !796)
!800 = !DILocation(line: 502, column: 20, scope: !795)
!801 = !DILocation(line: 502, column: 13, scope: !795)
!802 = !DILocation(line: 504, column: 20, scope: !795)
