; ModuleID = 'programs_new/Python-new/_json.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !536, globals: !1510)
!1 = !DIFile(filename: "_json.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !10}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !11, line: 23, size: 32, align: 32, elements: !12)
!11 = !DIFile(filename: "./Include/pyatomic.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!12 = !{!13, !14, !15, !16, !17}
!13 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!14 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!15 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!16 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!17 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!18 = !{!19, !365, !104, !383, !391, !409, !410, !412, !414, !401, !66, !416, !424, !437, !495, !45, !503, !518, !526, !527, !300}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !21, line: 109, baseType: !22)
!21 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !21, line: 105, size: 128, align: 64, elements: !23)
!23 = !{!24, !32}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !22, file: !21, line: 107, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !26, line: 177, baseType: !27)
!26 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !28, line: 102, baseType: !29)
!28 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !30, line: 181, baseType: !31)
!30 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!31 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !22, file: !21, line: 108, baseType: !33, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !21, line: 334, size: 3200, align: 64, elements: !35)
!35 = !{!36, !42, !46, !47, !48, !53, !117, !122, !127, !128, !133, !185, !216, !228, !234, !235, !236, !238, !240, !271, !272, !273, !282, !283, !288, !289, !291, !293, !303, !313, !331, !332, !333, !335, !337, !338, !340, !345, !350, !355, !356, !357, !358, !359, !360, !361, !362, !364}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !34, file: !21, line: 335, baseType: !37, size: 192, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !21, line: 114, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 111, size: 192, align: 64, elements: !39)
!39 = !{!40, !41}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !38, file: !21, line: 112, baseType: !20, size: 128, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !38, file: !21, line: 113, baseType: !25, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !34, file: !21, line: 336, baseType: !43, size: 64, align: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !34, file: !21, line: 337, baseType: !25, size: 64, align: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !34, file: !21, line: 337, baseType: !25, size: 64, align: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !34, file: !21, line: 341, baseType: !49, size: 64, align: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !21, line: 308, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{null, !19}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !34, file: !21, line: 342, baseType: !54, size: 64, align: 64, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !21, line: 314, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !19, !59, !58}
!58 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !28, line: 48, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 246, size: 1728, align: 64, elements: !63)
!62 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!63 = !{!64, !65, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !85, !86, !87, !88, !90, !92, !94, !98, !101, !103, !105, !106, !107, !108, !112, !113}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !61, file: !62, line: 247, baseType: !58, size: 32, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !61, file: !62, line: 252, baseType: !66, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !61, file: !62, line: 253, baseType: !66, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !61, file: !62, line: 254, baseType: !66, size: 64, align: 64, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !61, file: !62, line: 255, baseType: !66, size: 64, align: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !61, file: !62, line: 256, baseType: !66, size: 64, align: 64, offset: 320)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !61, file: !62, line: 257, baseType: !66, size: 64, align: 64, offset: 384)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !61, file: !62, line: 258, baseType: !66, size: 64, align: 64, offset: 448)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !61, file: !62, line: 259, baseType: !66, size: 64, align: 64, offset: 512)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !61, file: !62, line: 261, baseType: !66, size: 64, align: 64, offset: 576)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !61, file: !62, line: 262, baseType: !66, size: 64, align: 64, offset: 640)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !61, file: !62, line: 263, baseType: !66, size: 64, align: 64, offset: 704)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !61, file: !62, line: 265, baseType: !78, size: 64, align: 64, offset: 768)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !62, line: 161, size: 192, align: 64, elements: !80)
!80 = !{!81, !82, !84}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !79, file: !62, line: 162, baseType: !78, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !79, file: !62, line: 163, baseType: !83, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !79, file: !62, line: 167, baseType: !58, size: 32, align: 32, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !61, file: !62, line: 267, baseType: !83, size: 64, align: 64, offset: 832)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !61, file: !62, line: 269, baseType: !58, size: 32, align: 32, offset: 896)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !61, file: !62, line: 273, baseType: !58, size: 32, align: 32, offset: 928)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !61, file: !62, line: 275, baseType: !89, size: 64, align: 64, offset: 960)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !30, line: 140, baseType: !31)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !61, file: !62, line: 279, baseType: !91, size: 16, align: 16, offset: 1024)
!91 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !61, file: !62, line: 280, baseType: !93, size: 8, align: 8, offset: 1040)
!93 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !61, file: !62, line: 281, baseType: !95, size: 8, align: 8, offset: 1048)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8, align: 8, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 1)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !61, file: !62, line: 285, baseType: !99, size: 64, align: 64, offset: 1088)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !62, line: 155, baseType: null)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !61, file: !62, line: 294, baseType: !102, size: 64, align: 64, offset: 1152)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !30, line: 141, baseType: !31)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !61, file: !62, line: 303, baseType: !104, size: 64, align: 64, offset: 1216)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !61, file: !62, line: 304, baseType: !104, size: 64, align: 64, offset: 1280)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !61, file: !62, line: 305, baseType: !104, size: 64, align: 64, offset: 1344)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !61, file: !62, line: 306, baseType: !104, size: 64, align: 64, offset: 1408)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !61, file: !62, line: 307, baseType: !109, size: 64, align: 64, offset: 1472)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !110, line: 62, baseType: !111)
!110 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!111 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !61, file: !62, line: 309, baseType: !58, size: 32, align: 32, offset: 1536)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !61, file: !62, line: 311, baseType: !114, size: 160, align: 8, offset: 1568)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 160, align: 8, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 20)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !34, file: !21, line: 343, baseType: !118, size: 64, align: 64, offset: 512)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !21, line: 316, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!19, !19, !66}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !34, file: !21, line: 344, baseType: !123, size: 64, align: 64, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !21, line: 318, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!58, !19, !66, !19}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !34, file: !21, line: 345, baseType: !104, size: 64, align: 64, offset: 640)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !34, file: !21, line: 346, baseType: !129, size: 64, align: 64, offset: 704)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !21, line: 320, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!19, !19}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !34, file: !21, line: 350, baseType: !134, size: 64, align: 64, offset: 768)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !21, line: 278, baseType: !136)
!136 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 236, size: 2176, align: 64, elements: !137)
!137 = !{!138, !143, !144, !145, !146, !147, !152, !154, !155, !156, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !136, file: !21, line: 241, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !21, line: 166, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!19, !19, !19}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !136, file: !21, line: 242, baseType: !139, size: 64, align: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !136, file: !21, line: 243, baseType: !139, size: 64, align: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !136, file: !21, line: 244, baseType: !139, size: 64, align: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !136, file: !21, line: 245, baseType: !139, size: 64, align: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !136, file: !21, line: 246, baseType: !148, size: 64, align: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !21, line: 167, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!19, !19, !19, !19}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !136, file: !21, line: 247, baseType: !153, size: 64, align: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !21, line: 165, baseType: !130)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !136, file: !21, line: 248, baseType: !153, size: 64, align: 64, offset: 448)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !136, file: !21, line: 249, baseType: !153, size: 64, align: 64, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !136, file: !21, line: 250, baseType: !157, size: 64, align: 64, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !21, line: 168, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!58, !19}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !136, file: !21, line: 251, baseType: !153, size: 64, align: 64, offset: 640)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !136, file: !21, line: 252, baseType: !139, size: 64, align: 64, offset: 704)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !136, file: !21, line: 253, baseType: !139, size: 64, align: 64, offset: 768)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !136, file: !21, line: 254, baseType: !139, size: 64, align: 64, offset: 832)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !136, file: !21, line: 255, baseType: !139, size: 64, align: 64, offset: 896)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !136, file: !21, line: 256, baseType: !139, size: 64, align: 64, offset: 960)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !136, file: !21, line: 257, baseType: !153, size: 64, align: 64, offset: 1024)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !136, file: !21, line: 258, baseType: !104, size: 64, align: 64, offset: 1088)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !136, file: !21, line: 259, baseType: !153, size: 64, align: 64, offset: 1152)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !136, file: !21, line: 261, baseType: !139, size: 64, align: 64, offset: 1216)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !136, file: !21, line: 262, baseType: !139, size: 64, align: 64, offset: 1280)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !136, file: !21, line: 263, baseType: !139, size: 64, align: 64, offset: 1344)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !136, file: !21, line: 264, baseType: !139, size: 64, align: 64, offset: 1408)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !136, file: !21, line: 265, baseType: !148, size: 64, align: 64, offset: 1472)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !136, file: !21, line: 266, baseType: !139, size: 64, align: 64, offset: 1536)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !136, file: !21, line: 267, baseType: !139, size: 64, align: 64, offset: 1600)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !136, file: !21, line: 268, baseType: !139, size: 64, align: 64, offset: 1664)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !136, file: !21, line: 269, baseType: !139, size: 64, align: 64, offset: 1728)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !136, file: !21, line: 270, baseType: !139, size: 64, align: 64, offset: 1792)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !136, file: !21, line: 272, baseType: !139, size: 64, align: 64, offset: 1856)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !136, file: !21, line: 273, baseType: !139, size: 64, align: 64, offset: 1920)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !136, file: !21, line: 274, baseType: !139, size: 64, align: 64, offset: 1984)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !136, file: !21, line: 275, baseType: !139, size: 64, align: 64, offset: 2048)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !136, file: !21, line: 277, baseType: !153, size: 64, align: 64, offset: 2112)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !34, file: !21, line: 351, baseType: !186, size: 64, align: 64, offset: 832)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !21, line: 292, baseType: !188)
!188 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 280, size: 640, align: 64, elements: !189)
!189 = !{!190, !195, !196, !201, !202, !203, !208, !209, !214, !215}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !188, file: !21, line: 281, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !21, line: 169, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!25, !19}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !188, file: !21, line: 282, baseType: !139, size: 64, align: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !188, file: !21, line: 283, baseType: !197, size: 64, align: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !21, line: 170, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!19, !19, !25}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !188, file: !21, line: 284, baseType: !197, size: 64, align: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !188, file: !21, line: 285, baseType: !104, size: 64, align: 64, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !188, file: !21, line: 286, baseType: !204, size: 64, align: 64, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !21, line: 172, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!58, !19, !25, !19}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !188, file: !21, line: 287, baseType: !104, size: 64, align: 64, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !188, file: !21, line: 288, baseType: !210, size: 64, align: 64, offset: 448)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !21, line: 231, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!58, !19, !19}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !188, file: !21, line: 290, baseType: !139, size: 64, align: 64, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !188, file: !21, line: 291, baseType: !197, size: 64, align: 64, offset: 576)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !34, file: !21, line: 352, baseType: !217, size: 64, align: 64, offset: 896)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !21, line: 298, baseType: !219)
!219 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 294, size: 192, align: 64, elements: !220)
!220 = !{!221, !222, !223}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !219, file: !21, line: 295, baseType: !191, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !219, file: !21, line: 296, baseType: !139, size: 64, align: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !219, file: !21, line: 297, baseType: !224, size: 64, align: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !21, line: 174, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!58, !19, !19, !19}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !34, file: !21, line: 356, baseType: !229, size: 64, align: 64, offset: 960)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !21, line: 321, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!233, !19}
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !26, line: 186, baseType: !25)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !34, file: !21, line: 357, baseType: !148, size: 64, align: 64, offset: 1024)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !34, file: !21, line: 358, baseType: !129, size: 64, align: 64, offset: 1088)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !34, file: !21, line: 359, baseType: !237, size: 64, align: 64, offset: 1152)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !21, line: 317, baseType: !140)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !34, file: !21, line: 360, baseType: !239, size: 64, align: 64, offset: 1216)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !21, line: 319, baseType: !225)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !34, file: !21, line: 363, baseType: !241, size: 64, align: 64, offset: 1280)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !21, line: 304, baseType: !243)
!243 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 301, size: 128, align: 64, elements: !244)
!244 = !{!245, !266}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !243, file: !21, line: 302, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !21, line: 193, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!58, !19, !250, !58}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !21, line: 191, baseType: !252)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !21, line: 178, size: 640, align: 64, elements: !253)
!253 = !{!254, !255, !256, !257, !258, !259, !260, !261, !263, !264, !265}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !252, file: !21, line: 179, baseType: !104, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !252, file: !21, line: 180, baseType: !19, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !252, file: !21, line: 181, baseType: !25, size: 64, align: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !252, file: !21, line: 182, baseType: !25, size: 64, align: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !252, file: !21, line: 184, baseType: !58, size: 32, align: 32, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !252, file: !21, line: 185, baseType: !58, size: 32, align: 32, offset: 288)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !252, file: !21, line: 186, baseType: !66, size: 64, align: 64, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !252, file: !21, line: 187, baseType: !262, size: 64, align: 64, offset: 384)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !252, file: !21, line: 188, baseType: !262, size: 64, align: 64, offset: 448)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !252, file: !21, line: 189, baseType: !262, size: 64, align: 64, offset: 512)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !252, file: !21, line: 190, baseType: !104, size: 64, align: 64, offset: 576)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !243, file: !21, line: 303, baseType: !267, size: 64, align: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !21, line: 194, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !19, !250}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !34, file: !21, line: 366, baseType: !111, size: 64, align: 64, offset: 1344)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !34, file: !21, line: 368, baseType: !43, size: 64, align: 64, offset: 1408)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !34, file: !21, line: 372, baseType: !274, size: 64, align: 64, offset: 1472)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !21, line: 233, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!58, !19, !278, !104}
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !21, line: 232, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!58, !19, !104}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !34, file: !21, line: 375, baseType: !157, size: 64, align: 64, offset: 1536)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !34, file: !21, line: 379, baseType: !284, size: 64, align: 64, offset: 1600)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !21, line: 322, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!19, !19, !19, !58}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !34, file: !21, line: 382, baseType: !25, size: 64, align: 64, offset: 1664)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !34, file: !21, line: 385, baseType: !290, size: 64, align: 64, offset: 1728)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !21, line: 323, baseType: !130)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !34, file: !21, line: 386, baseType: !292, size: 64, align: 64, offset: 1792)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !21, line: 324, baseType: !130)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !34, file: !21, line: 389, baseType: !294, size: 64, align: 64, offset: 1856)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !296, line: 40, size: 256, align: 64, elements: !297)
!296 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!297 = !{!298, !299, !301, !302}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !295, file: !296, line: 41, baseType: !43, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !295, file: !296, line: 42, baseType: !300, size: 64, align: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !296, line: 18, baseType: !140)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !295, file: !296, line: 43, baseType: !58, size: 32, align: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !295, file: !296, line: 45, baseType: !43, size: 64, align: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !34, file: !21, line: 390, baseType: !304, size: 64, align: 64, offset: 1920)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !306, line: 18, size: 320, align: 64, elements: !307)
!306 = !DIFile(filename: "./Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!307 = !{!308, !309, !310, !311, !312}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !305, file: !306, line: 19, baseType: !66, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !305, file: !306, line: 20, baseType: !58, size: 32, align: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !305, file: !306, line: 21, baseType: !25, size: 64, align: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !305, file: !306, line: 22, baseType: !58, size: 32, align: 32, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !305, file: !306, line: 23, baseType: !66, size: 64, align: 64, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !34, file: !21, line: 391, baseType: !314, size: 64, align: 64, offset: 1984)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !316, line: 11, size: 320, align: 64, elements: !317)
!316 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!317 = !{!318, !319, !324, !329, !330}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !315, file: !316, line: 12, baseType: !66, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !315, file: !316, line: 13, baseType: !320, size: 64, align: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !316, line: 8, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!19, !19, !104}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !315, file: !316, line: 14, baseType: !325, size: 64, align: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !316, line: 9, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!58, !19, !19, !104}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !315, file: !316, line: 15, baseType: !66, size: 64, align: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !315, file: !316, line: 16, baseType: !104, size: 64, align: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !34, file: !21, line: 392, baseType: !33, size: 64, align: 64, offset: 2048)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !34, file: !21, line: 393, baseType: !19, size: 64, align: 64, offset: 2112)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !34, file: !21, line: 394, baseType: !334, size: 64, align: 64, offset: 2176)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !21, line: 325, baseType: !149)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !34, file: !21, line: 395, baseType: !336, size: 64, align: 64, offset: 2240)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !21, line: 326, baseType: !225)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !34, file: !21, line: 396, baseType: !25, size: 64, align: 64, offset: 2304)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !34, file: !21, line: 397, baseType: !339, size: 64, align: 64, offset: 2368)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !21, line: 327, baseType: !225)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !34, file: !21, line: 398, baseType: !341, size: 64, align: 64, offset: 2432)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !21, line: 329, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!19, !33, !25}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !34, file: !21, line: 399, baseType: !346, size: 64, align: 64, offset: 2496)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !21, line: 328, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!19, !33, !19, !19}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !34, file: !21, line: 400, baseType: !351, size: 64, align: 64, offset: 2560)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !21, line: 307, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !104}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !34, file: !21, line: 401, baseType: !157, size: 64, align: 64, offset: 2624)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !34, file: !21, line: 402, baseType: !19, size: 64, align: 64, offset: 2688)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !34, file: !21, line: 403, baseType: !19, size: 64, align: 64, offset: 2752)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !34, file: !21, line: 404, baseType: !19, size: 64, align: 64, offset: 2816)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !34, file: !21, line: 405, baseType: !19, size: 64, align: 64, offset: 2880)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !34, file: !21, line: 406, baseType: !19, size: 64, align: 64, offset: 2944)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !34, file: !21, line: 407, baseType: !49, size: 64, align: 64, offset: 3008)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !34, file: !21, line: 410, baseType: !363, size: 32, align: 32, offset: 3072)
!363 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !34, file: !21, line: 412, baseType: !49, size: 64, align: 64, offset: 3136)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !367)
!367 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !368)
!368 = !{!369, !370, !371, !372, !380}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !367, file: !4, line: 291, baseType: !20, size: 128, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !367, file: !4, line: 292, baseType: !25, size: 64, align: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !367, file: !4, line: 293, baseType: !233, size: 64, align: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !367, file: !4, line: 349, baseType: !373, size: 32, align: 32, offset: 256)
!373 = !DICompositeType(tag: DW_TAG_structure_type, scope: !367, file: !4, line: 294, size: 32, align: 32, elements: !374)
!374 = !{!375, !376, !377, !378, !379}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !373, file: !4, line: 303, baseType: !363, size: 2, align: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !373, file: !4, line: 331, baseType: !363, size: 3, align: 32, offset: 2)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !373, file: !4, line: 336, baseType: !363, size: 1, align: 32, offset: 5)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !373, file: !4, line: 340, baseType: !363, size: 1, align: 32, offset: 6)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !373, file: !4, line: 345, baseType: !363, size: 1, align: 32, offset: 7)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !367, file: !4, line: 350, baseType: !381, size: 64, align: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !110, line: 90, baseType: !58)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !385)
!385 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !386)
!386 = !{!387, !388, !389, !390}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !385, file: !4, line: 357, baseType: !366, size: 384, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !385, file: !4, line: 358, baseType: !25, size: 64, align: 64, offset: 384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !385, file: !4, line: 360, baseType: !66, size: 64, align: 64, offset: 448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !385, file: !4, line: 361, baseType: !25, size: 64, align: 64, offset: 512)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !393)
!393 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !394)
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !393, file: !4, line: 369, baseType: !384, size: 576, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !393, file: !4, line: 375, baseType: !397, size: 64, align: 64, offset: 576)
!397 = !DICompositeType(tag: DW_TAG_union_type, scope: !393, file: !4, line: 370, size: 64, align: 64, elements: !398)
!398 = !{!399, !400, !404, !407}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !397, file: !4, line: 371, baseType: !104, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !397, file: !4, line: 372, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !403)
!403 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !397, file: !4, line: 373, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !91)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !397, file: !4, line: 374, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !363)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !402)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !406)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !409)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !418, line: 33, baseType: !419)
!418 = !DIFile(filename: "./Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!419 = !DICompositeType(tag: DW_TAG_structure_type, file: !418, line: 25, size: 256, align: 64, elements: !420)
!420 = !{!421, !422}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !419, file: !418, line: 26, baseType: !37, size: 192, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !419, file: !418, line: 27, baseType: !423, size: 64, align: 64, offset: 192)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 64, align: 64, elements: !96)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyScannerObject", file: !426, line: 28, baseType: !427)
!426 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_json.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyScannerObject", file: !426, line: 19, size: 576, align: 64, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434, !435, !436}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !427, file: !426, line: 20, baseType: !20, size: 128, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "strict", scope: !427, file: !426, line: 21, baseType: !19, size: 64, align: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "object_hook", scope: !427, file: !426, line: 22, baseType: !19, size: 64, align: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "object_pairs_hook", scope: !427, file: !426, line: 23, baseType: !19, size: 64, align: 64, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "parse_float", scope: !427, file: !426, line: 24, baseType: !19, size: 64, align: 64, offset: 320)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "parse_int", scope: !427, file: !426, line: 25, baseType: !19, size: 64, align: 64, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "parse_constant", scope: !427, file: !426, line: 26, baseType: !19, size: 64, align: 64, offset: 448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "memo", scope: !427, file: !426, line: 27, baseType: !19, size: 64, align: 64, offset: 512)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !439, line: 139, baseType: !440)
!439 = !DIFile(filename: "./Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !439, line: 69, size: 1536, align: 64, elements: !441)
!441 = !{!442, !444, !445, !465, !468, !469, !470, !471, !472, !473, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !440, file: !439, line: 72, baseType: !443, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !440, file: !439, line: 73, baseType: !443, size: 64, align: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !440, file: !439, line: 74, baseType: !446, size: 64, align: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !439, line: 44, baseType: !448)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !439, line: 19, size: 832, align: 64, elements: !449)
!449 = !{!450, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !448, file: !439, line: 21, baseType: !451, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !448, file: !439, line: 22, baseType: !443, size: 64, align: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !448, file: !439, line: 24, baseType: !19, size: 64, align: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !448, file: !439, line: 25, baseType: !19, size: 64, align: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !448, file: !439, line: 26, baseType: !19, size: 64, align: 64, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !448, file: !439, line: 27, baseType: !19, size: 64, align: 64, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !448, file: !439, line: 28, baseType: !19, size: 64, align: 64, offset: 384)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !448, file: !439, line: 30, baseType: !19, size: 64, align: 64, offset: 448)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !448, file: !439, line: 31, baseType: !19, size: 64, align: 64, offset: 512)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !448, file: !439, line: 32, baseType: !19, size: 64, align: 64, offset: 576)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !448, file: !439, line: 33, baseType: !58, size: 32, align: 32, offset: 640)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !448, file: !439, line: 34, baseType: !58, size: 32, align: 32, offset: 672)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !448, file: !439, line: 37, baseType: !58, size: 32, align: 32, offset: 704)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !448, file: !439, line: 43, baseType: !19, size: 64, align: 64, offset: 768)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !440, file: !439, line: 76, baseType: !466, size: 64, align: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !439, line: 50, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !440, file: !439, line: 77, baseType: !58, size: 32, align: 32, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !440, file: !439, line: 78, baseType: !45, size: 8, align: 8, offset: 288)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !440, file: !439, line: 80, baseType: !45, size: 8, align: 8, offset: 296)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !440, file: !439, line: 85, baseType: !58, size: 32, align: 32, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !440, file: !439, line: 86, baseType: !58, size: 32, align: 32, offset: 352)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !440, file: !439, line: 88, baseType: !474, size: 64, align: 64, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !439, line: 54, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{!58, !19, !466, !58, !19}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !440, file: !439, line: 89, baseType: !474, size: 64, align: 64, offset: 448)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !440, file: !439, line: 90, baseType: !19, size: 64, align: 64, offset: 512)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !440, file: !439, line: 91, baseType: !19, size: 64, align: 64, offset: 576)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !440, file: !439, line: 93, baseType: !19, size: 64, align: 64, offset: 640)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !440, file: !439, line: 94, baseType: !19, size: 64, align: 64, offset: 704)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !440, file: !439, line: 95, baseType: !19, size: 64, align: 64, offset: 768)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !440, file: !439, line: 97, baseType: !19, size: 64, align: 64, offset: 832)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !440, file: !439, line: 98, baseType: !19, size: 64, align: 64, offset: 896)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !440, file: !439, line: 99, baseType: !19, size: 64, align: 64, offset: 960)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !440, file: !439, line: 101, baseType: !19, size: 64, align: 64, offset: 1024)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !440, file: !439, line: 103, baseType: !58, size: 32, align: 32, offset: 1088)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !440, file: !439, line: 105, baseType: !19, size: 64, align: 64, offset: 1152)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !440, file: !439, line: 106, baseType: !31, size: 64, align: 64, offset: 1216)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !440, file: !439, line: 108, baseType: !58, size: 32, align: 32, offset: 1280)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !440, file: !439, line: 109, baseType: !19, size: 64, align: 64, offset: 1344)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !440, file: !439, line: 134, baseType: !352, size: 64, align: 64, offset: 1408)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !440, file: !439, line: 135, baseType: !104, size: 64, align: 64, offset: 1472)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !497, line: 41, baseType: !498)
!497 = !DIFile(filename: "./Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!498 = !DICompositeType(tag: DW_TAG_structure_type, file: !497, line: 31, size: 320, align: 64, elements: !499)
!499 = !{!500, !501, !502}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !498, file: !497, line: 32, baseType: !37, size: 192, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !498, file: !497, line: 33, baseType: !233, size: 64, align: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !498, file: !497, line: 34, baseType: !95, size: 8, align: 8, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyEncoderObject", file: !426, line: 52, baseType: !505)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PyEncoderObject", file: !426, line: 40, size: 704, align: 64, elements: !506)
!506 = !{!507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !505, file: !426, line: 41, baseType: !20, size: 128, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !505, file: !426, line: 42, baseType: !19, size: 64, align: 64, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "defaultfn", scope: !505, file: !426, line: 43, baseType: !19, size: 64, align: 64, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "encoder", scope: !505, file: !426, line: 44, baseType: !19, size: 64, align: 64, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "indent", scope: !505, file: !426, line: 45, baseType: !19, size: 64, align: 64, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "key_separator", scope: !505, file: !426, line: 46, baseType: !19, size: 64, align: 64, offset: 384)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "item_separator", scope: !505, file: !426, line: 47, baseType: !19, size: 64, align: 64, offset: 448)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "sort_keys", scope: !505, file: !426, line: 48, baseType: !19, size: 64, align: 64, offset: 512)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "skipkeys", scope: !505, file: !426, line: 49, baseType: !19, size: 64, align: 64, offset: 576)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "fast_encode", scope: !505, file: !426, line: 50, baseType: !58, size: 32, align: 32, offset: 640)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "allow_nan", scope: !505, file: !426, line: 51, baseType: !58, size: 32, align: 32, offset: 672)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFloatObject", file: !520, line: 18, baseType: !521)
!520 = !DIFile(filename: "./Include/floatobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!521 = !DICompositeType(tag: DW_TAG_structure_type, file: !520, line: 15, size: 192, align: 64, elements: !522)
!522 = !{!523, !524}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !521, file: !520, line: 16, baseType: !20, size: 128, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ob_fval", scope: !521, file: !520, line: 17, baseType: !525, size: 64, align: 64, offset: 128)
!525 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !529, line: 40, baseType: !530)
!529 = !DIFile(filename: "./Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!530 = !DICompositeType(tag: DW_TAG_structure_type, file: !529, line: 23, size: 320, align: 64, elements: !531)
!531 = !{!532, !533, !535}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !530, file: !529, line: 24, baseType: !37, size: 192, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !530, file: !529, line: 26, baseType: !534, size: 64, align: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !530, file: !529, line: 39, baseType: !25, size: 64, align: 64, offset: 256)
!536 = !{!537, !552, !557, !577, !588, !597, !686, !703, !706, !722, !725, !735, !792, !802, !811, !816, !819, !899, !927, !939, !963, !993, !1039, !1082, !1092, !1095, !1110, !1234, !1237, !1246, !1252, !1262, !1273, !1310, !1399, !1437, !1489, !1504}
!537 = !DISubprogram(name: "PyInit__json", scope: !426, file: !426, line: 1865, type: !538, isLocal: false, isDefinition: true, scopeLine: 1866, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__json, variables: !540)
!538 = !DISubroutineType(types: !539)
!539 = !{!19}
!540 = !{!541, !542, !546, !550}
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !537, file: !426, line: 1867, type: !19)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !543, file: !426, line: 1878, type: !19)
!543 = distinct !DILexicalBlock(scope: !544, file: !426, line: 1878, column: 12)
!544 = distinct !DILexicalBlock(scope: !545, file: !426, line: 1877, column: 79)
!545 = distinct !DILexicalBlock(scope: !537, file: !426, line: 1877, column: 9)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !547, file: !426, line: 1883, type: !19)
!547 = distinct !DILexicalBlock(scope: !548, file: !426, line: 1883, column: 12)
!548 = distinct !DILexicalBlock(scope: !549, file: !426, line: 1882, column: 79)
!549 = distinct !DILexicalBlock(scope: !537, file: !426, line: 1882, column: 9)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !551, file: !426, line: 1888, type: !19)
!551 = distinct !DILexicalBlock(scope: !537, file: !426, line: 1888, column: 8)
!552 = !DISubprogram(name: "py_encode_basestring_ascii", scope: !426, file: !426, line: 516, type: !141, isLocal: true, isDefinition: true, scopeLine: 517, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @py_encode_basestring_ascii, variables: !553)
!553 = !{!554, !555, !556}
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !552, file: !426, line: 516, type: !19)
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pystr", arg: 2, scope: !552, file: !426, line: 516, type: !19)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rval", scope: !552, file: !426, line: 518, type: !19)
!557 = !DISubprogram(name: "ascii_escape_unicode", scope: !426, file: !426, line: 163, type: !131, isLocal: true, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @ascii_escape_unicode, variables: !558)
!558 = !{!559, !560, !561, !562, !563, !564, !565, !566, !568, !569, !573}
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pystr", arg: 1, scope: !557, file: !426, line: 163, type: !19)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !557, file: !426, line: 166, type: !25)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "input_chars", scope: !557, file: !426, line: 167, type: !25)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "output_size", scope: !557, file: !426, line: 168, type: !25)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chars", scope: !557, file: !426, line: 169, type: !25)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rval", scope: !557, file: !426, line: 170, type: !19)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "input", scope: !557, file: !426, line: 171, type: !104)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "output", scope: !557, file: !426, line: 172, type: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !557, file: !426, line: 173, type: !58)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !570, file: !426, line: 184, type: !409)
!570 = distinct !DILexicalBlock(scope: !571, file: !426, line: 183, column: 56)
!571 = distinct !DILexicalBlock(scope: !572, file: !426, line: 183, column: 5)
!572 = distinct !DILexicalBlock(scope: !557, file: !426, line: 183, column: 5)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !574, file: !426, line: 206, type: !409)
!574 = distinct !DILexicalBlock(scope: !575, file: !426, line: 205, column: 39)
!575 = distinct !DILexicalBlock(scope: !576, file: !426, line: 205, column: 5)
!576 = distinct !DILexicalBlock(scope: !557, file: !426, line: 205, column: 5)
!577 = !DISubprogram(name: "ascii_escape_unichar", scope: !426, file: !426, line: 127, type: !578, isLocal: true, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i32, i8*, i64)* @ascii_escape_unichar, variables: !580)
!578 = !DISubroutineType(types: !579)
!579 = !{!25, !409, !567, !25}
!580 = !{!581, !582, !583, !584}
!581 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !577, file: !426, line: 127, type: !409)
!582 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "output", arg: 2, scope: !577, file: !426, line: 127, type: !567)
!583 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chars", arg: 3, scope: !577, file: !426, line: 127, type: !25)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !585, file: !426, line: 144, type: !409)
!585 = distinct !DILexicalBlock(scope: !586, file: !426, line: 142, column: 31)
!586 = distinct !DILexicalBlock(scope: !587, file: !426, line: 142, column: 17)
!587 = distinct !DILexicalBlock(scope: !577, file: !426, line: 133, column: 16)
!588 = !DISubprogram(name: "py_scanstring", scope: !426, file: !426, line: 487, type: !141, isLocal: true, isDefinition: true, scopeLine: 488, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @py_scanstring, variables: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596}
!590 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !588, file: !426, line: 487, type: !19)
!591 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !588, file: !426, line: 487, type: !19)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pystr", scope: !588, file: !426, line: 489, type: !19)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rval", scope: !588, file: !426, line: 490, type: !19)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !588, file: !426, line: 491, type: !25)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next_end", scope: !588, file: !426, line: 492, type: !25)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "strict", scope: !588, file: !426, line: 493, type: !58)
!597 = !DISubprogram(name: "scanstring_unicode", scope: !426, file: !426, line: 297, type: !598, isLocal: true, isDefinition: true, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i64, i32, i64*)* @scanstring_unicode, variables: !600)
!598 = !DISubroutineType(types: !599)
!599 = !{!19, !19, !25, !58, !262}
!600 = !{!601, !602, !603, !604, !605, !606, !607, !608, !609, !612, !613, !614, !615, !617, !625, !627, !631, !637, !640, !644, !650, !652, !656, !664, !666, !670, !672, !676, !678, !681, !683}
!601 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pystr", arg: 1, scope: !597, file: !426, line: 297, type: !19)
!602 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 2, scope: !597, file: !426, line: 297, type: !25)
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "strict", arg: 3, scope: !597, file: !426, line: 297, type: !58)
!604 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "next_end_ptr", arg: 4, scope: !597, file: !426, line: 297, type: !262)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rval", scope: !597, file: !426, line: 307, type: !19)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !597, file: !426, line: 308, type: !25)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "begin", scope: !597, file: !426, line: 309, type: !25)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next", scope: !597, file: !426, line: 310, type: !25)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !597, file: !426, line: 311, type: !610)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !597, file: !426, line: 312, type: !58)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chunks", scope: !597, file: !426, line: 313, type: !19)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chunk", scope: !597, file: !426, line: 314, type: !19)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !616, file: !426, line: 329, type: !409)
!616 = distinct !DILexicalBlock(scope: !597, file: !426, line: 327, column: 15)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !618, file: !426, line: 346, type: !19)
!618 = distinct !DILexicalBlock(scope: !619, file: !426, line: 346, column: 174)
!619 = distinct !DILexicalBlock(scope: !620, file: !426, line: 346, column: 169)
!620 = distinct !DILexicalBlock(scope: !621, file: !426, line: 346, column: 139)
!621 = distinct !DILexicalBlock(scope: !622, file: !426, line: 346, column: 38)
!622 = distinct !DILexicalBlock(scope: !623, file: !426, line: 346, column: 17)
!623 = distinct !DILexicalBlock(scope: !624, file: !426, line: 345, column: 26)
!624 = distinct !DILexicalBlock(scope: !616, file: !426, line: 345, column: 13)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !626, file: !426, line: 346, type: !19)
!626 = distinct !DILexicalBlock(scope: !621, file: !426, line: 346, column: 391)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !628, file: !426, line: 346, type: !19)
!628 = distinct !DILexicalBlock(scope: !629, file: !426, line: 346, column: 488)
!629 = distinct !DILexicalBlock(scope: !630, file: !426, line: 346, column: 461)
!630 = distinct !DILexicalBlock(scope: !626, file: !426, line: 346, column: 438)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "digit", scope: !632, file: !426, line: 394, type: !409)
!632 = distinct !DILexicalBlock(scope: !633, file: !426, line: 393, column: 40)
!633 = distinct !DILexicalBlock(scope: !634, file: !426, line: 393, column: 13)
!634 = distinct !DILexicalBlock(scope: !635, file: !426, line: 393, column: 13)
!635 = distinct !DILexicalBlock(scope: !636, file: !426, line: 384, column: 14)
!636 = distinct !DILexicalBlock(scope: !616, file: !426, line: 365, column: 13)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2", scope: !638, file: !426, line: 415, type: !409)
!638 = distinct !DILexicalBlock(scope: !639, file: !426, line: 414, column: 218)
!639 = distinct !DILexicalBlock(scope: !635, file: !426, line: 412, column: 17)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "digit", scope: !641, file: !426, line: 419, type: !409)
!641 = distinct !DILexicalBlock(scope: !642, file: !426, line: 418, column: 44)
!642 = distinct !DILexicalBlock(scope: !643, file: !426, line: 418, column: 17)
!643 = distinct !DILexicalBlock(scope: !638, file: !426, line: 418, column: 17)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !645, file: !426, line: 442, type: !19)
!645 = distinct !DILexicalBlock(scope: !646, file: !426, line: 442, column: 170)
!646 = distinct !DILexicalBlock(scope: !647, file: !426, line: 442, column: 165)
!647 = distinct !DILexicalBlock(scope: !648, file: !426, line: 442, column: 135)
!648 = distinct !DILexicalBlock(scope: !649, file: !426, line: 442, column: 34)
!649 = distinct !DILexicalBlock(scope: !616, file: !426, line: 442, column: 13)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !651, file: !426, line: 442, type: !19)
!651 = distinct !DILexicalBlock(scope: !648, file: !426, line: 442, column: 387)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !653, file: !426, line: 442, type: !19)
!653 = distinct !DILexicalBlock(scope: !654, file: !426, line: 442, column: 484)
!654 = distinct !DILexicalBlock(scope: !655, file: !426, line: 442, column: 457)
!655 = distinct !DILexicalBlock(scope: !651, file: !426, line: 442, column: 434)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !657, file: !426, line: 456, type: !19)
!657 = distinct !DILexicalBlock(scope: !658, file: !426, line: 456, column: 170)
!658 = distinct !DILexicalBlock(scope: !659, file: !426, line: 456, column: 165)
!659 = distinct !DILexicalBlock(scope: !660, file: !426, line: 456, column: 135)
!660 = distinct !DILexicalBlock(scope: !661, file: !426, line: 456, column: 34)
!661 = distinct !DILexicalBlock(scope: !662, file: !426, line: 456, column: 13)
!662 = distinct !DILexicalBlock(scope: !663, file: !426, line: 455, column: 10)
!663 = distinct !DILexicalBlock(scope: !597, file: !426, line: 449, column: 9)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !665, file: !426, line: 456, type: !19)
!665 = distinct !DILexicalBlock(scope: !660, file: !426, line: 456, column: 387)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !667, file: !426, line: 456, type: !19)
!667 = distinct !DILexicalBlock(scope: !668, file: !426, line: 456, column: 484)
!668 = distinct !DILexicalBlock(scope: !669, file: !426, line: 456, column: 457)
!669 = distinct !DILexicalBlock(scope: !665, file: !426, line: 456, column: 434)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !671, file: !426, line: 461, type: !19)
!671 = distinct !DILexicalBlock(scope: !662, file: !426, line: 461, column: 12)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !673, file: !426, line: 461, type: !19)
!673 = distinct !DILexicalBlock(scope: !674, file: !426, line: 461, column: 111)
!674 = distinct !DILexicalBlock(scope: !675, file: !426, line: 461, column: 83)
!675 = distinct !DILexicalBlock(scope: !671, file: !426, line: 461, column: 60)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !677, file: !426, line: 468, type: !19)
!677 = distinct !DILexicalBlock(scope: !597, file: !426, line: 468, column: 8)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !679, file: !426, line: 468, type: !19)
!679 = distinct !DILexicalBlock(scope: !680, file: !426, line: 468, column: 98)
!680 = distinct !DILexicalBlock(scope: !677, file: !426, line: 468, column: 64)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !682, file: !426, line: 469, type: !19)
!682 = distinct !DILexicalBlock(scope: !597, file: !426, line: 469, column: 8)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !684, file: !426, line: 469, type: !19)
!684 = distinct !DILexicalBlock(scope: !685, file: !426, line: 469, column: 97)
!685 = distinct !DILexicalBlock(scope: !682, file: !426, line: 469, column: 63)
!686 = !DISubprogram(name: "raise_errmsg", scope: !426, file: !426, line: 222, type: !687, isLocal: true, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, %struct._object*, i64)* @raise_errmsg, variables: !689)
!687 = !DISubroutineType(types: !688)
!688 = !{null, !66, !19, !25}
!689 = !{!690, !691, !692, !693, !694, !697, !699}
!690 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msg", arg: 1, scope: !686, file: !426, line: 222, type: !66)
!691 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 2, scope: !686, file: !426, line: 222, type: !19)
!692 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 3, scope: !686, file: !426, line: 222, type: !25)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pymsg", scope: !686, file: !426, line: 227, type: !19)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoder", scope: !695, file: !426, line: 229, type: !19)
!695 = distinct !DILexicalBlock(scope: !696, file: !426, line: 228, column: 34)
!696 = distinct !DILexicalBlock(scope: !686, file: !426, line: 228, column: 9)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !698, file: !426, line: 233, type: !19)
!698 = distinct !DILexicalBlock(scope: !695, file: !426, line: 233, column: 12)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !700, file: !426, line: 240, type: !19)
!700 = distinct !DILexicalBlock(scope: !701, file: !426, line: 240, column: 12)
!701 = distinct !DILexicalBlock(scope: !702, file: !426, line: 238, column: 16)
!702 = distinct !DILexicalBlock(scope: !686, file: !426, line: 238, column: 9)
!703 = !DISubprogram(name: "join_list_unicode", scope: !426, file: !426, line: 67, type: !131, isLocal: true, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @join_list_unicode, variables: !704)
!704 = !{!705}
!705 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lst", arg: 1, scope: !703, file: !426, line: 67, type: !19)
!706 = !DISubprogram(name: "_build_rval_index_tuple", scope: !426, file: !426, line: 255, type: !199, isLocal: true, isDefinition: true, scopeLine: 255, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i64)* @_build_rval_index_tuple, variables: !707)
!707 = !{!708, !709, !710, !711, !712, !716, !720}
!708 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rval", arg: 1, scope: !706, file: !426, line: 255, type: !19)
!709 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idx", arg: 2, scope: !706, file: !426, line: 255, type: !25)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tpl", scope: !706, file: !426, line: 257, type: !19)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pyidx", scope: !706, file: !426, line: 258, type: !19)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !713, file: !426, line: 267, type: !19)
!713 = distinct !DILexicalBlock(scope: !714, file: !426, line: 267, column: 12)
!714 = distinct !DILexicalBlock(scope: !715, file: !426, line: 266, column: 30)
!715 = distinct !DILexicalBlock(scope: !706, file: !426, line: 266, column: 9)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !717, file: !426, line: 272, type: !19)
!717 = distinct !DILexicalBlock(scope: !718, file: !426, line: 272, column: 12)
!718 = distinct !DILexicalBlock(scope: !719, file: !426, line: 271, column: 28)
!719 = distinct !DILexicalBlock(scope: !706, file: !426, line: 271, column: 9)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !721, file: !426, line: 273, type: !19)
!721 = distinct !DILexicalBlock(scope: !718, file: !426, line: 273, column: 12)
!722 = !DISubprogram(name: "scanner_dealloc", scope: !426, file: !426, line: 534, type: !51, isLocal: true, isDefinition: true, scopeLine: 535, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @scanner_dealloc, variables: !723)
!723 = !{!724}
!724 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !722, file: !426, line: 534, type: !19)
!725 = !DISubprogram(name: "scanner_call", scope: !426, file: !426, line: 1040, type: !150, isLocal: true, isDefinition: true, scopeLine: 1041, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @scanner_call, variables: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734}
!727 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !725, file: !426, line: 1040, type: !19)
!728 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !725, file: !426, line: 1040, type: !19)
!729 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !725, file: !426, line: 1040, type: !19)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pystr", scope: !725, file: !426, line: 1043, type: !19)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rval", scope: !725, file: !426, line: 1044, type: !19)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !725, file: !426, line: 1045, type: !25)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next_idx", scope: !725, file: !426, line: 1046, type: !25)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !725, file: !426, line: 1048, type: !424)
!735 = !DISubprogram(name: "scan_once_unicode", scope: !426, file: !426, line: 923, type: !736, isLocal: true, isDefinition: true, scopeLine: 924, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._PyScannerObject*, %struct._object*, i64, i64*)* @scan_once_unicode, variables: !738)
!736 = !DISubroutineType(types: !737)
!737 = !{!19, !424, !19, !25, !262}
!738 = !{!739, !740, !741, !742, !743, !744, !745, !746, !747, !756, !757, !760, !762, !766, !767, !768, !769, !771, !772, !773, !774, !777, !778, !779, !780, !784, !785, !786, !787, !789, !790, !791}
!739 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !735, file: !426, line: 923, type: !424)
!740 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pystr", arg: 2, scope: !735, file: !426, line: 923, type: !19)
!741 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idx", arg: 3, scope: !735, file: !426, line: 923, type: !25)
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "next_idx_ptr", arg: 4, scope: !735, file: !426, line: 923, type: !262)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !735, file: !426, line: 932, type: !19)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !735, file: !426, line: 933, type: !104)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !735, file: !426, line: 934, type: !58)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !735, file: !426, line: 935, type: !25)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !748, file: !426, line: 961, type: !751)
!748 = distinct !DILexicalBlock(scope: !749, file: !426, line: 961, column: 54)
!749 = distinct !DILexicalBlock(scope: !750, file: !426, line: 961, column: 17)
!750 = distinct !DILexicalBlock(scope: !735, file: !426, line: 953, column: 198)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !11, line: 33, baseType: !753)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !11, line: 31, size: 64, align: 64, elements: !754)
!754 = !{!755}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !753, file: !11, line: 32, baseType: !104, size: 64, align: 64)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !748, file: !426, line: 961, type: !104)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !748, file: !426, line: 961, type: !758)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !104)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !748, file: !426, line: 961, type: !761)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !11, line: 29, baseType: !10)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !763, file: !426, line: 965, type: !751)
!763 = distinct !DILexicalBlock(scope: !764, file: !426, line: 965, column: 56)
!764 = distinct !DILexicalBlock(scope: !765, file: !426, line: 965, column: 20)
!765 = distinct !DILexicalBlock(scope: !750, file: !426, line: 965, column: 15)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !763, file: !426, line: 965, type: !104)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !763, file: !426, line: 965, type: !758)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !763, file: !426, line: 965, type: !761)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !770, file: !426, line: 965, type: !751)
!770 = distinct !DILexicalBlock(scope: !764, file: !426, line: 965, column: 905)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !770, file: !426, line: 965, type: !104)
!772 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !770, file: !426, line: 965, type: !758)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !770, file: !426, line: 965, type: !761)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !775, file: !426, line: 969, type: !751)
!775 = distinct !DILexicalBlock(scope: !776, file: !426, line: 969, column: 54)
!776 = distinct !DILexicalBlock(scope: !750, file: !426, line: 969, column: 17)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !775, file: !426, line: 969, type: !104)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !775, file: !426, line: 969, type: !758)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !775, file: !426, line: 969, type: !761)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !781, file: !426, line: 973, type: !751)
!781 = distinct !DILexicalBlock(scope: !782, file: !426, line: 973, column: 56)
!782 = distinct !DILexicalBlock(scope: !783, file: !426, line: 973, column: 20)
!783 = distinct !DILexicalBlock(scope: !750, file: !426, line: 973, column: 15)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !781, file: !426, line: 973, type: !104)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !781, file: !426, line: 973, type: !758)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !781, file: !426, line: 973, type: !761)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !788, file: !426, line: 973, type: !751)
!788 = distinct !DILexicalBlock(scope: !782, file: !426, line: 973, column: 905)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !788, file: !426, line: 973, type: !104)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !788, file: !426, line: 973, type: !758)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !788, file: !426, line: 973, type: !761)
!792 = !DISubprogram(name: "raise_stop_iteration", scope: !426, file: !426, line: 245, type: !793, isLocal: true, isDefinition: true, scopeLine: 246, flags: DIFlagPrototyped, isOptimized: true, function: void (i64)* @raise_stop_iteration, variables: !795)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !25}
!795 = !{!796, !797, !798}
!796 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idx", arg: 1, scope: !792, file: !426, line: 245, type: !25)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !792, file: !426, line: 247, type: !19)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !799, file: !426, line: 250, type: !19)
!799 = distinct !DILexicalBlock(scope: !800, file: !426, line: 250, column: 12)
!800 = distinct !DILexicalBlock(scope: !801, file: !426, line: 248, column: 30)
!801 = distinct !DILexicalBlock(scope: !792, file: !426, line: 248, column: 9)
!802 = !DISubprogram(name: "_Py_ANNOTATE_MEMORY_ORDER", scope: !11, file: !11, line: 59, type: !803, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32)* @_Py_ANNOTATE_MEMORY_ORDER, variables: !808)
!803 = !DISubroutineType(types: !804)
!804 = !{null, !805, !761}
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64, align: 64)
!806 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!808 = !{!809, !810}
!809 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "address", arg: 1, scope: !802, file: !11, line: 59, type: !805)
!810 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 2, scope: !802, file: !11, line: 59, type: !761)
!811 = !DISubprogram(name: "_Py_atomic_thread_fence", scope: !11, file: !11, line: 51, type: !812, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @_Py_atomic_thread_fence, variables: !814)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !761}
!814 = !{!815}
!815 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !811, file: !11, line: 51, type: !761)
!816 = !DISubprogram(name: "_Py_atomic_signal_fence", scope: !11, file: !11, line: 44, type: !812, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @_Py_atomic_signal_fence, variables: !817)
!817 = !{!818}
!818 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !816, file: !11, line: 44, type: !761)
!819 = !DISubprogram(name: "_parse_object_unicode", scope: !426, file: !426, line: 573, type: !736, isLocal: true, isDefinition: true, scopeLine: 573, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._PyScannerObject*, %struct._object*, i64, i64*)* @_parse_object_unicode, variables: !820)
!820 = !{!821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !838, !842, !845, !847, !851, !853, !857, !861, !863, !866, !870, !872, !876, !880, !884, !886, !889, !891, !894, !896}
!821 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !819, file: !426, line: 573, type: !424)
!822 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pystr", arg: 2, scope: !819, file: !426, line: 573, type: !19)
!823 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idx", arg: 3, scope: !819, file: !426, line: 573, type: !25)
!824 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "next_idx_ptr", arg: 4, scope: !819, file: !426, line: 573, type: !262)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !819, file: !426, line: 581, type: !104)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !819, file: !426, line: 582, type: !58)
!827 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end_idx", scope: !819, file: !426, line: 583, type: !25)
!828 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !819, file: !426, line: 584, type: !19)
!829 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rval", scope: !819, file: !426, line: 585, type: !19)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !819, file: !426, line: 586, type: !19)
!831 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "strict", scope: !819, file: !426, line: 587, type: !58)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "has_pairs_hook", scope: !819, file: !426, line: 588, type: !58)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next_idx", scope: !819, file: !426, line: 589, type: !25)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "memokey", scope: !835, file: !426, line: 611, type: !19)
!835 = distinct !DILexicalBlock(scope: !836, file: !426, line: 610, column: 19)
!836 = distinct !DILexicalBlock(scope: !837, file: !426, line: 609, column: 218)
!837 = distinct !DILexicalBlock(scope: !819, file: !426, line: 609, column: 9)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !839, file: !426, line: 624, type: !19)
!839 = distinct !DILexicalBlock(scope: !840, file: !426, line: 624, column: 20)
!840 = distinct !DILexicalBlock(scope: !841, file: !426, line: 622, column: 40)
!841 = distinct !DILexicalBlock(scope: !835, file: !426, line: 622, column: 17)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !843, file: !426, line: 648, type: !19)
!843 = distinct !DILexicalBlock(scope: !844, file: !426, line: 647, column: 33)
!844 = distinct !DILexicalBlock(scope: !835, file: !426, line: 647, column: 17)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !846, file: !426, line: 651, type: !19)
!846 = distinct !DILexicalBlock(scope: !843, file: !426, line: 651, column: 20)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !848, file: !426, line: 651, type: !19)
!848 = distinct !DILexicalBlock(scope: !849, file: !426, line: 651, column: 113)
!849 = distinct !DILexicalBlock(scope: !850, file: !426, line: 651, column: 88)
!850 = distinct !DILexicalBlock(scope: !846, file: !426, line: 651, column: 65)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !852, file: !426, line: 652, type: !19)
!852 = distinct !DILexicalBlock(scope: !843, file: !426, line: 652, column: 20)
!853 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !854, file: !426, line: 652, type: !19)
!854 = distinct !DILexicalBlock(scope: !855, file: !426, line: 652, column: 113)
!855 = distinct !DILexicalBlock(scope: !856, file: !426, line: 652, column: 88)
!856 = distinct !DILexicalBlock(scope: !852, file: !426, line: 652, column: 65)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !858, file: !426, line: 654, type: !19)
!858 = distinct !DILexicalBlock(scope: !859, file: !426, line: 654, column: 24)
!859 = distinct !DILexicalBlock(scope: !860, file: !426, line: 653, column: 54)
!860 = distinct !DILexicalBlock(scope: !843, file: !426, line: 653, column: 21)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !862, file: !426, line: 657, type: !19)
!862 = distinct !DILexicalBlock(scope: !843, file: !426, line: 657, column: 20)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !864, file: !426, line: 662, type: !19)
!864 = distinct !DILexicalBlock(scope: !865, file: !426, line: 662, column: 20)
!865 = distinct !DILexicalBlock(scope: !844, file: !426, line: 659, column: 18)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !867, file: !426, line: 662, type: !19)
!867 = distinct !DILexicalBlock(scope: !868, file: !426, line: 662, column: 113)
!868 = distinct !DILexicalBlock(scope: !869, file: !426, line: 662, column: 88)
!869 = distinct !DILexicalBlock(scope: !864, file: !426, line: 662, column: 65)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !871, file: !426, line: 663, type: !19)
!871 = distinct !DILexicalBlock(scope: !865, file: !426, line: 663, column: 20)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !873, file: !426, line: 663, type: !19)
!873 = distinct !DILexicalBlock(scope: !874, file: !426, line: 663, column: 113)
!874 = distinct !DILexicalBlock(scope: !875, file: !426, line: 663, column: 88)
!875 = distinct !DILexicalBlock(scope: !871, file: !426, line: 663, column: 65)
!876 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !877, file: !426, line: 688, type: !19)
!877 = distinct !DILexicalBlock(scope: !878, file: !426, line: 688, column: 12)
!878 = distinct !DILexicalBlock(scope: !879, file: !426, line: 686, column: 25)
!879 = distinct !DILexicalBlock(scope: !819, file: !426, line: 686, column: 9)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !881, file: !426, line: 695, type: !19)
!881 = distinct !DILexicalBlock(scope: !882, file: !426, line: 695, column: 12)
!882 = distinct !DILexicalBlock(scope: !883, file: !426, line: 693, column: 46)
!883 = distinct !DILexicalBlock(scope: !819, file: !426, line: 693, column: 9)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !885, file: !426, line: 700, type: !19)
!885 = distinct !DILexicalBlock(scope: !819, file: !426, line: 700, column: 8)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !887, file: !426, line: 700, type: !19)
!887 = distinct !DILexicalBlock(scope: !888, file: !426, line: 700, column: 95)
!888 = distinct !DILexicalBlock(scope: !885, file: !426, line: 700, column: 61)
!889 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !890, file: !426, line: 701, type: !19)
!890 = distinct !DILexicalBlock(scope: !819, file: !426, line: 701, column: 8)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !892, file: !426, line: 701, type: !19)
!892 = distinct !DILexicalBlock(scope: !893, file: !426, line: 701, column: 95)
!893 = distinct !DILexicalBlock(scope: !890, file: !426, line: 701, column: 61)
!894 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !895, file: !426, line: 702, type: !19)
!895 = distinct !DILexicalBlock(scope: !819, file: !426, line: 702, column: 8)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !897, file: !426, line: 702, type: !19)
!897 = distinct !DILexicalBlock(scope: !898, file: !426, line: 702, column: 96)
!898 = distinct !DILexicalBlock(scope: !895, file: !426, line: 702, column: 62)
!899 = !DISubprogram(name: "_parse_array_unicode", scope: !426, file: !426, line: 707, type: !736, isLocal: true, isDefinition: true, scopeLine: 707, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._PyScannerObject*, %struct._object*, i64, i64*)* @_parse_array_unicode, variables: !900)
!900 = !{!901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !916, !920, !922, !925}
!901 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !899, file: !426, line: 707, type: !424)
!902 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pystr", arg: 2, scope: !899, file: !426, line: 707, type: !19)
!903 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "idx", arg: 3, scope: !899, file: !426, line: 707, type: !25)
!904 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "next_idx_ptr", arg: 4, scope: !899, file: !426, line: 707, type: !262)
!905 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !899, file: !426, line: 715, type: !104)
!906 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !899, file: !426, line: 716, type: !58)
!907 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end_idx", scope: !899, file: !426, line: 717, type: !25)
!908 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !899, file: !426, line: 718, type: !19)
!909 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rval", scope: !899, file: !426, line: 719, type: !19)
!910 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next_idx", scope: !899, file: !426, line: 720, type: !25)
!911 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !912, file: !426, line: 746, type: !19)
!912 = distinct !DILexicalBlock(scope: !913, file: !426, line: 746, column: 16)
!913 = distinct !DILexicalBlock(scope: !914, file: !426, line: 736, column: 19)
!914 = distinct !DILexicalBlock(scope: !915, file: !426, line: 735, column: 218)
!915 = distinct !DILexicalBlock(scope: !899, file: !426, line: 735, column: 9)
!916 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !917, file: !426, line: 746, type: !19)
!917 = distinct !DILexicalBlock(scope: !918, file: !426, line: 746, column: 109)
!918 = distinct !DILexicalBlock(scope: !919, file: !426, line: 746, column: 84)
!919 = distinct !DILexicalBlock(scope: !912, file: !426, line: 746, column: 61)
