; ModuleID = 'irs-onlybc/_localemodule.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !343, globals: !685)
!1 = !DIFile(filename: "_localemodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !94}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !7, line: 109, baseType: !8)
!7 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !7, line: 105, size: 128, align: 64, elements: !9)
!9 = !{!10, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !8, file: !7, line: 107, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !12, line: 177, baseType: !13)
!12 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !14, line: 102, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !16, line: 181, baseType: !17)
!16 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !8, file: !7, line: 108, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !7, line: 334, size: 3200, align: 64, elements: !21)
!21 = !{!22, !28, !32, !33, !34, !39, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !291, !309, !310, !311, !313, !315, !316, !318, !323, !328, !333, !334, !335, !336, !337, !338, !339, !340, !342}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !20, file: !7, line: 335, baseType: !23, size: 192, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !7, line: 114, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 111, size: 192, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !24, file: !7, line: 112, baseType: !6, size: 128, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !24, file: !7, line: 113, baseType: !11, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !20, file: !7, line: 336, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !20, file: !7, line: 341, baseType: !35, size: 64, align: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !7, line: 308, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !5}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !20, file: !7, line: 342, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !7, line: 314, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !5, !45, !44}
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !14, line: 48, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 246, size: 1728, align: 64, elements: !49)
!48 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!49 = !{!50, !51, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !71, !72, !73, !74, !76, !78, !80, !84, !87, !89, !90, !91, !92, !93, !97, !98}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !48, line: 247, baseType: !44, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !47, file: !48, line: 252, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !47, file: !48, line: 253, baseType: !52, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !47, file: !48, line: 254, baseType: !52, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !47, file: !48, line: 255, baseType: !52, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !47, file: !48, line: 256, baseType: !52, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !47, file: !48, line: 257, baseType: !52, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !47, file: !48, line: 258, baseType: !52, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !47, file: !48, line: 259, baseType: !52, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !47, file: !48, line: 261, baseType: !52, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !47, file: !48, line: 262, baseType: !52, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !47, file: !48, line: 263, baseType: !52, size: 64, align: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !47, file: !48, line: 265, baseType: !64, size: 64, align: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !48, line: 161, size: 192, align: 64, elements: !66)
!66 = !{!67, !68, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !65, file: !48, line: 162, baseType: !64, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !65, file: !48, line: 163, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !65, file: !48, line: 167, baseType: !44, size: 32, align: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !47, file: !48, line: 267, baseType: !69, size: 64, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !47, file: !48, line: 269, baseType: !44, size: 32, align: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !47, file: !48, line: 273, baseType: !44, size: 32, align: 32, offset: 928)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !47, file: !48, line: 275, baseType: !75, size: 64, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !16, line: 140, baseType: !17)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !47, file: !48, line: 279, baseType: !77, size: 16, align: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !47, file: !48, line: 280, baseType: !79, size: 8, align: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !47, file: !48, line: 281, baseType: !81, size: 8, align: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !47, file: !48, line: 285, baseType: !85, size: 64, align: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !48, line: 155, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !47, file: !48, line: 294, baseType: !88, size: 64, align: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !16, line: 141, baseType: !17)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !47, file: !48, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !47, file: !48, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !47, file: !48, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !47, file: !48, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !47, file: !48, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !47, file: !48, line: 309, baseType: !44, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !47, file: !48, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !20, file: !7, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !7, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!5, !5, !52}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !20, file: !7, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !7, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!44, !5, !52, !5}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !20, file: !7, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !20, file: !7, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !7, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!5, !5}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !20, file: !7, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !7, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !7, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !7, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!5, !5, !5}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !7, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !7, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !7, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !7, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !7, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !7, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!5, !5, !5, !5}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !7, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !7, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !7, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !7, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !7, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !7, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!44, !5}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !7, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !7, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !7, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !7, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !7, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !7, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !7, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !7, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !7, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !7, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !7, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !7, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !7, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !7, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !7, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !7, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !7, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !7, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !7, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !7, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !7, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !7, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !7, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !7, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !20, file: !7, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !7, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !7, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !7, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!11, !5}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !7, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !7, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !7, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!5, !5, !11}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !7, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !7, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !7, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !7, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!44, !5, !11, !5}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !7, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !7, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !7, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!44, !5, !5}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !7, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !7, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !20, file: !7, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !7, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !7, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !7, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !7, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !7, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!44, !5, !5, !5}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !20, file: !7, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !7, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !5}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !12, line: 186, baseType: !11)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !20, file: !7, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !20, file: !7, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !20, file: !7, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !7, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !20, file: !7, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !7, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !20, file: !7, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !7, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !7, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !7, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!44, !5, !235, !44}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !7, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !7, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !7, line: 179, baseType: !4, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !7, line: 180, baseType: !5, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !7, line: 181, baseType: !11, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !7, line: 182, baseType: !11, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !7, line: 184, baseType: !44, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !7, line: 185, baseType: !44, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !7, line: 186, baseType: !52, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !7, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !7, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !7, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !7, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !7, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !7, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !5, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !20, file: !7, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !20, file: !7, line: 368, baseType: !29, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !20, file: !7, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !7, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!44, !5, !263, !4}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !7, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!44, !5, !4}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !20, file: !7, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !20, file: !7, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !7, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!5, !5, !5, !44}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !20, file: !7, line: 382, baseType: !11, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !20, file: !7, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !7, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !20, file: !7, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !7, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !20, file: !7, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !29, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !44, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !29, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !20, file: !7, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !7, line: 390, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !20, file: !7, line: 391, baseType: !292, size: 64, align: 64, offset: 1984)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !294, line: 11, size: 320, align: 64, elements: !295)
!294 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!295 = !{!296, !297, !302, !307, !308}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !293, file: !294, line: 12, baseType: !52, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !293, file: !294, line: 13, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !294, line: 8, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!5, !5, !4}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !293, file: !294, line: 14, baseType: !303, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !294, line: 9, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!44, !5, !5, !4}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !293, file: !294, line: 15, baseType: !52, size: 64, align: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !293, file: !294, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !20, file: !7, line: 392, baseType: !19, size: 64, align: 64, offset: 2048)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !20, file: !7, line: 393, baseType: !5, size: 64, align: 64, offset: 2112)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !20, file: !7, line: 394, baseType: !312, size: 64, align: 64, offset: 2176)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !7, line: 325, baseType: !134)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !20, file: !7, line: 395, baseType: !314, size: 64, align: 64, offset: 2240)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !7, line: 326, baseType: !210)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !20, file: !7, line: 396, baseType: !11, size: 64, align: 64, offset: 2304)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !20, file: !7, line: 397, baseType: !317, size: 64, align: 64, offset: 2368)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !7, line: 327, baseType: !210)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !20, file: !7, line: 398, baseType: !319, size: 64, align: 64, offset: 2432)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !7, line: 329, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!5, !19, !11}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !20, file: !7, line: 399, baseType: !324, size: 64, align: 64, offset: 2496)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !7, line: 328, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!5, !19, !5, !5}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !20, file: !7, line: 400, baseType: !329, size: 64, align: 64, offset: 2560)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !7, line: 307, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !4}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !20, file: !7, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !20, file: !7, line: 402, baseType: !5, size: 64, align: 64, offset: 2688)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !20, file: !7, line: 403, baseType: !5, size: 64, align: 64, offset: 2752)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !20, file: !7, line: 404, baseType: !5, size: 64, align: 64, offset: 2816)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !20, file: !7, line: 405, baseType: !5, size: 64, align: 64, offset: 2880)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !20, file: !7, line: 406, baseType: !5, size: 64, align: 64, offset: 2944)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !20, file: !7, line: 407, baseType: !35, size: 64, align: 64, offset: 3008)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !20, file: !7, line: 410, baseType: !341, size: 32, align: 32, offset: 3072)
!341 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !20, file: !7, line: 412, baseType: !35, size: 64, align: 64, offset: 3136)
!343 = !{!344, !393, !401, !582, !599, !610, !623, !634, !639, !645, !652, !657, !679}
!344 = !DISubprogram(name: "PyInit__locale", scope: !345, file: !345, line: 622, type: !346, isLocal: false, isDefinition: true, scopeLine: 623, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__locale, variables: !348)
!345 = !DIFile(filename: "./Modules/_localemodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!346 = !DISubroutineType(types: !347)
!347 = !{!5}
!348 = !{!349, !350, !351, !352, !353, !355, !358, !360, !363, !365, !368, !370, !373, !375, !378, !380, !383, !385, !388, !390}
!349 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !344, file: !345, line: 624, type: !5)
!350 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !344, file: !345, line: 624, type: !5)
!351 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !344, file: !345, line: 624, type: !5)
!352 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !344, file: !345, line: 626, type: !44)
!353 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !354, file: !345, line: 637, type: !5)
!354 = distinct !DILexicalBlock(scope: !344, file: !345, line: 637, column: 8)
!355 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !356, file: !345, line: 637, type: !5)
!356 = distinct !DILexicalBlock(scope: !357, file: !345, line: 637, column: 93)
!357 = distinct !DILexicalBlock(scope: !354, file: !345, line: 637, column: 59)
!358 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !359, file: !345, line: 641, type: !5)
!359 = distinct !DILexicalBlock(scope: !344, file: !345, line: 641, column: 8)
!360 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !361, file: !345, line: 641, type: !5)
!361 = distinct !DILexicalBlock(scope: !362, file: !345, line: 641, column: 93)
!362 = distinct !DILexicalBlock(scope: !359, file: !345, line: 641, column: 59)
!363 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !364, file: !345, line: 645, type: !5)
!364 = distinct !DILexicalBlock(scope: !344, file: !345, line: 645, column: 8)
!365 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !366, file: !345, line: 645, type: !5)
!366 = distinct !DILexicalBlock(scope: !367, file: !345, line: 645, column: 93)
!367 = distinct !DILexicalBlock(scope: !364, file: !345, line: 645, column: 59)
!368 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !369, file: !345, line: 649, type: !5)
!369 = distinct !DILexicalBlock(scope: !344, file: !345, line: 649, column: 8)
!370 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !371, file: !345, line: 649, type: !5)
!371 = distinct !DILexicalBlock(scope: !372, file: !345, line: 649, column: 93)
!372 = distinct !DILexicalBlock(scope: !369, file: !345, line: 649, column: 59)
!373 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !374, file: !345, line: 654, type: !5)
!374 = distinct !DILexicalBlock(scope: !344, file: !345, line: 654, column: 8)
!375 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !376, file: !345, line: 654, type: !5)
!376 = distinct !DILexicalBlock(scope: !377, file: !345, line: 654, column: 93)
!377 = distinct !DILexicalBlock(scope: !374, file: !345, line: 654, column: 59)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !379, file: !345, line: 659, type: !5)
!379 = distinct !DILexicalBlock(scope: !344, file: !345, line: 659, column: 8)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !381, file: !345, line: 659, type: !5)
!381 = distinct !DILexicalBlock(scope: !382, file: !345, line: 659, column: 93)
!382 = distinct !DILexicalBlock(scope: !379, file: !345, line: 659, column: 59)
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !384, file: !345, line: 663, type: !5)
!384 = distinct !DILexicalBlock(scope: !344, file: !345, line: 663, column: 8)
!385 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !386, file: !345, line: 663, type: !5)
!386 = distinct !DILexicalBlock(scope: !387, file: !345, line: 663, column: 93)
!387 = distinct !DILexicalBlock(scope: !384, file: !345, line: 663, column: 59)
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !389, file: !345, line: 667, type: !5)
!389 = distinct !DILexicalBlock(scope: !344, file: !345, line: 667, column: 8)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !391, file: !345, line: 667, type: !5)
!391 = distinct !DILexicalBlock(scope: !392, file: !345, line: 667, column: 93)
!392 = distinct !DILexicalBlock(scope: !389, file: !345, line: 667, column: 59)
!393 = !DISubprogram(name: "PyLocale_setlocale", scope: !345, file: !345, line: 90, type: !126, isLocal: true, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyLocale_setlocale, variables: !394)
!394 = !{!395, !396, !397, !398, !399, !400}
!395 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !393, file: !345, line: 90, type: !5)
!396 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !393, file: !345, line: 90, type: !5)
!397 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "category", scope: !393, file: !345, line: 92, type: !44)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "locale", scope: !393, file: !345, line: 93, type: !52)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !393, file: !345, line: 93, type: !52)
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result_object", scope: !393, file: !345, line: 94, type: !5)
!401 = !DISubprogram(name: "PyLocale_localeconv", scope: !345, file: !345, line: 134, type: !116, isLocal: true, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyLocale_localeconv, variables: !402)
!402 = !{!403, !404, !405, !434, !435, !441, !443, !449, !451, !456, !458, !464, !466, !472, !474, !480, !482, !488, !490, !495, !497, !503, !505, !511, !513, !519, !521, !527, !529, !535, !537, !543, !545, !551, !553, !559, !561, !567, !569, !575, !577, !579}
!403 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !401, file: !345, line: 134, type: !5)
!404 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !401, file: !345, line: 136, type: !5)
!405 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !401, file: !345, line: 137, type: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !408, line: 54, size: 768, align: 64, elements: !409)
!408 = !DIFile(filename: "/usr/include/locale.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!409 = !{!410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !407, file: !408, line: 58, baseType: !52, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !407, file: !408, line: 59, baseType: !52, size: 64, align: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !407, file: !408, line: 65, baseType: !52, size: 64, align: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !407, file: !408, line: 71, baseType: !52, size: 64, align: 64, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !407, file: !408, line: 72, baseType: !52, size: 64, align: 64, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !407, file: !408, line: 73, baseType: !52, size: 64, align: 64, offset: 320)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !407, file: !408, line: 74, baseType: !52, size: 64, align: 64, offset: 384)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !407, file: !408, line: 75, baseType: !52, size: 64, align: 64, offset: 448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !407, file: !408, line: 76, baseType: !52, size: 64, align: 64, offset: 512)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !407, file: !408, line: 77, baseType: !52, size: 64, align: 64, offset: 576)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !407, file: !408, line: 78, baseType: !31, size: 8, align: 8, offset: 640)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !407, file: !408, line: 79, baseType: !31, size: 8, align: 8, offset: 648)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !407, file: !408, line: 81, baseType: !31, size: 8, align: 8, offset: 656)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !407, file: !408, line: 83, baseType: !31, size: 8, align: 8, offset: 664)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !407, file: !408, line: 85, baseType: !31, size: 8, align: 8, offset: 672)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !407, file: !408, line: 87, baseType: !31, size: 8, align: 8, offset: 680)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !407, file: !408, line: 94, baseType: !31, size: 8, align: 8, offset: 688)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !407, file: !408, line: 95, baseType: !31, size: 8, align: 8, offset: 696)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !407, file: !408, line: 98, baseType: !31, size: 8, align: 8, offset: 704)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !407, file: !408, line: 100, baseType: !31, size: 8, align: 8, offset: 712)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !407, file: !408, line: 102, baseType: !31, size: 8, align: 8, offset: 720)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !407, file: !408, line: 104, baseType: !31, size: 8, align: 8, offset: 728)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !407, file: !408, line: 111, baseType: !31, size: 8, align: 8, offset: 736)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !407, file: !408, line: 112, baseType: !31, size: 8, align: 8, offset: 744)
!434 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !401, file: !345, line: 138, type: !5)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !436, file: !345, line: 174, type: !5)
!436 = distinct !DILexicalBlock(scope: !437, file: !345, line: 174, column: 170)
!437 = distinct !DILexicalBlock(scope: !438, file: !345, line: 174, column: 165)
!438 = distinct !DILexicalBlock(scope: !439, file: !345, line: 174, column: 111)
!439 = distinct !DILexicalBlock(scope: !440, file: !345, line: 174, column: 71)
!440 = distinct !DILexicalBlock(scope: !401, file: !345, line: 174, column: 8)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !442, file: !345, line: 174, type: !5)
!442 = distinct !DILexicalBlock(scope: !439, file: !345, line: 174, column: 385)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !444, file: !345, line: 175, type: !5)
!444 = distinct !DILexicalBlock(scope: !445, file: !345, line: 175, column: 170)
!445 = distinct !DILexicalBlock(scope: !446, file: !345, line: 175, column: 165)
!446 = distinct !DILexicalBlock(scope: !447, file: !345, line: 175, column: 111)
!447 = distinct !DILexicalBlock(scope: !448, file: !345, line: 175, column: 71)
!448 = distinct !DILexicalBlock(scope: !401, file: !345, line: 175, column: 8)
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !450, file: !345, line: 175, type: !5)
!450 = distinct !DILexicalBlock(scope: !447, file: !345, line: 175, column: 385)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !452, file: !345, line: 177, type: !5)
!452 = distinct !DILexicalBlock(scope: !453, file: !345, line: 177, column: 102)
!453 = distinct !DILexicalBlock(scope: !454, file: !345, line: 177, column: 97)
!454 = distinct !DILexicalBlock(scope: !455, file: !345, line: 177, column: 48)
!455 = distinct !DILexicalBlock(scope: !401, file: !345, line: 177, column: 8)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !457, file: !345, line: 177, type: !5)
!457 = distinct !DILexicalBlock(scope: !455, file: !345, line: 177, column: 317)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !459, file: !345, line: 180, type: !5)
!459 = distinct !DILexicalBlock(scope: !460, file: !345, line: 180, column: 174)
!460 = distinct !DILexicalBlock(scope: !461, file: !345, line: 180, column: 169)
!461 = distinct !DILexicalBlock(scope: !462, file: !345, line: 180, column: 113)
!462 = distinct !DILexicalBlock(scope: !463, file: !345, line: 180, column: 73)
!463 = distinct !DILexicalBlock(scope: !401, file: !345, line: 180, column: 8)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !465, file: !345, line: 180, type: !5)
!465 = distinct !DILexicalBlock(scope: !462, file: !345, line: 180, column: 389)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !467, file: !345, line: 181, type: !5)
!467 = distinct !DILexicalBlock(scope: !468, file: !345, line: 181, column: 174)
!468 = distinct !DILexicalBlock(scope: !469, file: !345, line: 181, column: 169)
!469 = distinct !DILexicalBlock(scope: !470, file: !345, line: 181, column: 113)
!470 = distinct !DILexicalBlock(scope: !471, file: !345, line: 181, column: 73)
!471 = distinct !DILexicalBlock(scope: !401, file: !345, line: 181, column: 8)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !473, file: !345, line: 181, type: !5)
!473 = distinct !DILexicalBlock(scope: !470, file: !345, line: 181, column: 389)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !475, file: !345, line: 182, type: !5)
!475 = distinct !DILexicalBlock(scope: !476, file: !345, line: 182, column: 178)
!476 = distinct !DILexicalBlock(scope: !477, file: !345, line: 182, column: 173)
!477 = distinct !DILexicalBlock(scope: !478, file: !345, line: 182, column: 115)
!478 = distinct !DILexicalBlock(scope: !479, file: !345, line: 182, column: 75)
!479 = distinct !DILexicalBlock(scope: !401, file: !345, line: 182, column: 8)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !481, file: !345, line: 182, type: !5)
!481 = distinct !DILexicalBlock(scope: !478, file: !345, line: 182, column: 393)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !483, file: !345, line: 183, type: !5)
!483 = distinct !DILexicalBlock(scope: !484, file: !345, line: 183, column: 178)
!484 = distinct !DILexicalBlock(scope: !485, file: !345, line: 183, column: 173)
!485 = distinct !DILexicalBlock(scope: !486, file: !345, line: 183, column: 115)
!486 = distinct !DILexicalBlock(scope: !487, file: !345, line: 183, column: 75)
!487 = distinct !DILexicalBlock(scope: !401, file: !345, line: 183, column: 8)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !489, file: !345, line: 183, type: !5)
!489 = distinct !DILexicalBlock(scope: !486, file: !345, line: 183, column: 393)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !491, file: !345, line: 185, type: !5)
!491 = distinct !DILexicalBlock(scope: !492, file: !345, line: 185, column: 106)
!492 = distinct !DILexicalBlock(scope: !493, file: !345, line: 185, column: 101)
!493 = distinct !DILexicalBlock(scope: !494, file: !345, line: 185, column: 48)
!494 = distinct !DILexicalBlock(scope: !401, file: !345, line: 185, column: 8)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !496, file: !345, line: 185, type: !5)
!496 = distinct !DILexicalBlock(scope: !494, file: !345, line: 185, column: 321)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !498, file: !345, line: 187, type: !5)
!498 = distinct !DILexicalBlock(scope: !499, file: !345, line: 187, column: 170)
!499 = distinct !DILexicalBlock(scope: !500, file: !345, line: 187, column: 165)
!500 = distinct !DILexicalBlock(scope: !501, file: !345, line: 187, column: 111)
!501 = distinct !DILexicalBlock(scope: !502, file: !345, line: 187, column: 71)
!502 = distinct !DILexicalBlock(scope: !401, file: !345, line: 187, column: 8)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !504, file: !345, line: 187, type: !5)
!504 = distinct !DILexicalBlock(scope: !501, file: !345, line: 187, column: 385)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !506, file: !345, line: 188, type: !5)
!506 = distinct !DILexicalBlock(scope: !507, file: !345, line: 188, column: 170)
!507 = distinct !DILexicalBlock(scope: !508, file: !345, line: 188, column: 165)
!508 = distinct !DILexicalBlock(scope: !509, file: !345, line: 188, column: 111)
!509 = distinct !DILexicalBlock(scope: !510, file: !345, line: 188, column: 71)
!510 = distinct !DILexicalBlock(scope: !401, file: !345, line: 188, column: 8)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !512, file: !345, line: 188, type: !5)
!512 = distinct !DILexicalBlock(scope: !509, file: !345, line: 188, column: 385)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !514, file: !345, line: 189, type: !5)
!514 = distinct !DILexicalBlock(scope: !515, file: !345, line: 189, column: 155)
!515 = distinct !DILexicalBlock(scope: !516, file: !345, line: 189, column: 150)
!516 = distinct !DILexicalBlock(scope: !517, file: !345, line: 189, column: 94)
!517 = distinct !DILexicalBlock(scope: !518, file: !345, line: 189, column: 54)
!518 = distinct !DILexicalBlock(scope: !401, file: !345, line: 189, column: 8)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !520, file: !345, line: 189, type: !5)
!520 = distinct !DILexicalBlock(scope: !517, file: !345, line: 189, column: 370)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !522, file: !345, line: 190, type: !5)
!522 = distinct !DILexicalBlock(scope: !523, file: !345, line: 190, column: 147)
!523 = distinct !DILexicalBlock(scope: !524, file: !345, line: 190, column: 142)
!524 = distinct !DILexicalBlock(scope: !525, file: !345, line: 190, column: 90)
!525 = distinct !DILexicalBlock(scope: !526, file: !345, line: 190, column: 50)
!526 = distinct !DILexicalBlock(scope: !401, file: !345, line: 190, column: 8)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !528, file: !345, line: 190, type: !5)
!528 = distinct !DILexicalBlock(scope: !525, file: !345, line: 190, column: 362)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !530, file: !345, line: 191, type: !5)
!530 = distinct !DILexicalBlock(scope: !531, file: !345, line: 191, column: 151)
!531 = distinct !DILexicalBlock(scope: !532, file: !345, line: 191, column: 146)
!532 = distinct !DILexicalBlock(scope: !533, file: !345, line: 191, column: 92)
!533 = distinct !DILexicalBlock(scope: !534, file: !345, line: 191, column: 52)
!534 = distinct !DILexicalBlock(scope: !401, file: !345, line: 191, column: 8)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !536, file: !345, line: 191, type: !5)
!536 = distinct !DILexicalBlock(scope: !533, file: !345, line: 191, column: 366)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !538, file: !345, line: 192, type: !5)
!538 = distinct !DILexicalBlock(scope: !539, file: !345, line: 192, column: 153)
!539 = distinct !DILexicalBlock(scope: !540, file: !345, line: 192, column: 148)
!540 = distinct !DILexicalBlock(scope: !541, file: !345, line: 192, column: 93)
!541 = distinct !DILexicalBlock(scope: !542, file: !345, line: 192, column: 53)
!542 = distinct !DILexicalBlock(scope: !401, file: !345, line: 192, column: 8)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !544, file: !345, line: 192, type: !5)
!544 = distinct !DILexicalBlock(scope: !541, file: !345, line: 192, column: 368)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !546, file: !345, line: 193, type: !5)
!546 = distinct !DILexicalBlock(scope: !547, file: !345, line: 193, column: 151)
!547 = distinct !DILexicalBlock(scope: !548, file: !345, line: 193, column: 146)
!548 = distinct !DILexicalBlock(scope: !549, file: !345, line: 193, column: 92)
!549 = distinct !DILexicalBlock(scope: !550, file: !345, line: 193, column: 52)
!550 = distinct !DILexicalBlock(scope: !401, file: !345, line: 193, column: 8)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !552, file: !345, line: 193, type: !5)
!552 = distinct !DILexicalBlock(scope: !549, file: !345, line: 193, column: 366)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !554, file: !345, line: 194, type: !5)
!554 = distinct !DILexicalBlock(scope: !555, file: !345, line: 194, column: 153)
!555 = distinct !DILexicalBlock(scope: !556, file: !345, line: 194, column: 148)
!556 = distinct !DILexicalBlock(scope: !557, file: !345, line: 194, column: 93)
!557 = distinct !DILexicalBlock(scope: !558, file: !345, line: 194, column: 53)
!558 = distinct !DILexicalBlock(scope: !401, file: !345, line: 194, column: 8)
!559 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !560, file: !345, line: 194, type: !5)
!560 = distinct !DILexicalBlock(scope: !557, file: !345, line: 194, column: 368)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !562, file: !345, line: 195, type: !5)
!562 = distinct !DILexicalBlock(scope: !563, file: !345, line: 195, column: 147)
!563 = distinct !DILexicalBlock(scope: !564, file: !345, line: 195, column: 142)
!564 = distinct !DILexicalBlock(scope: !565, file: !345, line: 195, column: 90)
!565 = distinct !DILexicalBlock(scope: !566, file: !345, line: 195, column: 50)
!566 = distinct !DILexicalBlock(scope: !401, file: !345, line: 195, column: 8)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !568, file: !345, line: 195, type: !5)
!568 = distinct !DILexicalBlock(scope: !565, file: !345, line: 195, column: 362)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !570, file: !345, line: 196, type: !5)
!570 = distinct !DILexicalBlock(scope: !571, file: !345, line: 196, column: 147)
!571 = distinct !DILexicalBlock(scope: !572, file: !345, line: 196, column: 142)
!572 = distinct !DILexicalBlock(scope: !573, file: !345, line: 196, column: 90)
!573 = distinct !DILexicalBlock(scope: !574, file: !345, line: 196, column: 50)
!574 = distinct !DILexicalBlock(scope: !401, file: !345, line: 196, column: 8)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !576, file: !345, line: 196, type: !5)
!576 = distinct !DILexicalBlock(scope: !573, file: !345, line: 196, column: 362)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !578, file: !345, line: 200, type: !5)
!578 = distinct !DILexicalBlock(scope: !401, file: !345, line: 200, column: 8)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !580, file: !345, line: 200, type: !5)
!580 = distinct !DILexicalBlock(scope: !581, file: !345, line: 200, column: 98)
!581 = distinct !DILexicalBlock(scope: !578, file: !345, line: 200, column: 64)
!582 = !DISubprogram(name: "copy_grouping", scope: !345, file: !345, line: 52, type: !583, isLocal: true, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @copy_grouping, variables: !585)
!583 = !DISubroutineType(types: !584)
!584 = !{!5, !52}
!585 = !{!586, !587, !588, !589, !590, !595}
!586 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !582, file: !345, line: 52, type: !52)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !582, file: !345, line: 54, type: !44)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !582, file: !345, line: 55, type: !5)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !582, file: !345, line: 55, type: !5)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !591, file: !345, line: 75, type: !5)
!591 = distinct !DILexicalBlock(scope: !592, file: !345, line: 75, column: 16)
!592 = distinct !DILexicalBlock(scope: !593, file: !345, line: 74, column: 45)
!593 = distinct !DILexicalBlock(scope: !594, file: !345, line: 74, column: 13)
!594 = distinct !DILexicalBlock(scope: !582, file: !345, line: 69, column: 8)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !596, file: !345, line: 82, type: !5)
!596 = distinct !DILexicalBlock(scope: !597, file: !345, line: 82, column: 12)
!597 = distinct !DILexicalBlock(scope: !598, file: !345, line: 81, column: 15)
!598 = distinct !DILexicalBlock(scope: !582, file: !345, line: 81, column: 9)
!599 = !DISubprogram(name: "PyLocale_strcoll", scope: !345, file: !345, line: 209, type: !126, isLocal: true, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyLocale_strcoll, variables: !600)
!600 = !{!601, !602, !603, !604, !605, !606, !609}
!601 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !599, file: !345, line: 209, type: !5)
!602 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !599, file: !345, line: 209, type: !5)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "os1", scope: !599, file: !345, line: 211, type: !5)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "os2", scope: !599, file: !345, line: 211, type: !5)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !599, file: !345, line: 211, type: !5)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ws1", scope: !599, file: !345, line: 212, type: !607)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64, align: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !95, line: 90, baseType: !44)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ws2", scope: !599, file: !345, line: 212, type: !607)
!610 = !DISubprogram(name: "PyLocale_strxfrm", scope: !345, file: !345, line: 240, type: !126, isLocal: true, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyLocale_strxfrm, variables: !611)
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619, !620}
!612 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !610, file: !345, line: 240, type: !5)
!613 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !610, file: !345, line: 240, type: !5)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !610, file: !345, line: 242, type: !5)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n1", scope: !610, file: !345, line: 243, type: !11)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !610, file: !345, line: 244, type: !607)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !610, file: !345, line: 244, type: !607)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n2", scope: !610, file: !345, line: 245, type: !94)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !610, file: !345, line: 246, type: !5)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_buf", scope: !621, file: !345, line: 265, type: !607)
!621 = distinct !DILexicalBlock(scope: !622, file: !345, line: 263, column: 27)
!622 = distinct !DILexicalBlock(scope: !610, file: !345, line: 263, column: 9)
!623 = !DISubprogram(name: "PyLocale_nl_langinfo", scope: !345, file: !345, line: 434, type: !126, isLocal: true, isDefinition: true, scopeLine: 435, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyLocale_nl_langinfo, variables: !624)
!624 = !{!625, !626, !627, !628, !629}
!625 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !623, file: !345, line: 434, type: !5)
!626 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !623, file: !345, line: 434, type: !5)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !623, file: !345, line: 436, type: !44)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !623, file: !345, line: 436, type: !44)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !630, file: !345, line: 446, type: !29)
!630 = distinct !DILexicalBlock(scope: !631, file: !345, line: 443, column: 50)
!631 = distinct !DILexicalBlock(scope: !632, file: !345, line: 443, column: 13)
!632 = distinct !DILexicalBlock(scope: !633, file: !345, line: 442, column: 5)
!633 = distinct !DILexicalBlock(scope: !623, file: !345, line: 442, column: 5)
!634 = !DISubprogram(name: "PyIntl_gettext", scope: !345, file: !345, line: 462, type: !126, isLocal: true, isDefinition: true, scopeLine: 463, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyIntl_gettext, variables: !635)
!635 = !{!636, !637, !638}
!636 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !634, file: !345, line: 462, type: !5)
!637 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !634, file: !345, line: 462, type: !5)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !634, file: !345, line: 464, type: !52)
!639 = !DISubprogram(name: "PyIntl_dgettext", scope: !345, file: !345, line: 475, type: !126, isLocal: true, isDefinition: true, scopeLine: 476, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyIntl_dgettext, variables: !640)
!640 = !{!641, !642, !643, !644}
!641 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !639, file: !345, line: 475, type: !5)
!642 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !639, file: !345, line: 475, type: !5)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "domain", scope: !639, file: !345, line: 477, type: !52)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !639, file: !345, line: 477, type: !52)
!645 = !DISubprogram(name: "PyIntl_dcgettext", scope: !345, file: !345, line: 488, type: !126, isLocal: true, isDefinition: true, scopeLine: 489, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyIntl_dcgettext, variables: !646)
!646 = !{!647, !648, !649, !650, !651}
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !645, file: !345, line: 488, type: !5)
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !645, file: !345, line: 488, type: !5)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "domain", scope: !645, file: !345, line: 490, type: !52)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msgid", scope: !645, file: !345, line: 490, type: !52)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "category", scope: !645, file: !345, line: 491, type: !44)
!652 = !DISubprogram(name: "PyIntl_textdomain", scope: !345, file: !345, line: 502, type: !126, isLocal: true, isDefinition: true, scopeLine: 503, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyIntl_textdomain, variables: !653)
!653 = !{!654, !655, !656}
!654 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !652, file: !345, line: 502, type: !5)
!655 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !652, file: !345, line: 502, type: !5)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "domain", scope: !652, file: !345, line: 504, type: !52)
!657 = !DISubprogram(name: "PyIntl_bindtextdomain", scope: !345, file: !345, line: 520, type: !126, isLocal: true, isDefinition: true, scopeLine: 521, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyIntl_bindtextdomain, variables: !658)
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666, !667, !671, !674, !676}
!659 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !657, file: !345, line: 520, type: !5)
!660 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !657, file: !345, line: 520, type: !5)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "domain", scope: !657, file: !345, line: 522, type: !52)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dirname", scope: !657, file: !345, line: 522, type: !52)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "current_dirname", scope: !657, file: !345, line: 522, type: !52)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dirname_obj", scope: !657, file: !345, line: 523, type: !5)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dirname_bytes", scope: !657, file: !345, line: 523, type: !5)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !657, file: !345, line: 523, type: !5)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !668, file: !345, line: 540, type: !5)
!668 = distinct !DILexicalBlock(scope: !669, file: !345, line: 540, column: 12)
!669 = distinct !DILexicalBlock(scope: !670, file: !345, line: 539, column: 40)
!670 = distinct !DILexicalBlock(scope: !657, file: !345, line: 539, column: 9)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !672, file: !345, line: 540, type: !5)
!672 = distinct !DILexicalBlock(scope: !673, file: !345, line: 540, column: 109)
!673 = distinct !DILexicalBlock(scope: !668, file: !345, line: 540, column: 75)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !675, file: !345, line: 545, type: !5)
!675 = distinct !DILexicalBlock(scope: !657, file: !345, line: 545, column: 8)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !677, file: !345, line: 545, type: !5)
!677 = distinct !DILexicalBlock(scope: !678, file: !345, line: 545, column: 105)
!678 = distinct !DILexicalBlock(scope: !675, file: !345, line: 545, column: 71)
!679 = !DISubprogram(name: "PyIntl_bind_textdomain_codeset", scope: !345, file: !345, line: 555, type: !126, isLocal: true, isDefinition: true, scopeLine: 556, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyIntl_bind_textdomain_codeset, variables: !680)
!680 = !{!681, !682, !683, !684}
!681 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !679, file: !345, line: 555, type: !5)
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !679, file: !345, line: 555, type: !5)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "domain", scope: !679, file: !345, line: 557, type: !52)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codeset", scope: !679, file: !345, line: 557, type: !52)
!685 = !{!686, !687, !710, !714, !718, !722, !726, !730, !734, !738, !742, !743, !747, !751, !755, !759}
!686 = !DIGlobalVariable(name: "Error", scope: !0, file: !345, line: 43, type: !5, isLocal: true, isDefinition: true, variable: %struct._object** @Error)
!687 = !DIGlobalVariable(name: "_localemodule", scope: !0, file: !345, line: 609, type: !688, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @_localemodule)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !689, line: 47, size: 832, align: 64, elements: !690)
!689 = !DIFile(filename: "Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!690 = !{!691, !700, !701, !702, !703, !706, !707, !708, !709}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !688, file: !689, line: 48, baseType: !692, size: 320, align: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !689, line: 38, baseType: !693)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !689, line: 33, size: 320, align: 64, elements: !694)
!694 = !{!695, !696, !698, !699}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !693, file: !689, line: 34, baseType: !6, size: 128, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !693, file: !689, line: 35, baseType: !697, size: 64, align: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !693, file: !689, line: 36, baseType: !11, size: 64, align: 64, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !693, file: !689, line: 37, baseType: !5, size: 64, align: 64, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !688, file: !689, line: 49, baseType: !29, size: 64, align: 64, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !688, file: !689, line: 50, baseType: !29, size: 64, align: 64, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !688, file: !689, line: 51, baseType: !11, size: 64, align: 64, offset: 448)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !688, file: !689, line: 52, baseType: !704, size: 64, align: 64, offset: 512)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64, align: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !281, line: 47, baseType: !280)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !688, file: !689, line: 53, baseType: !142, size: 64, align: 64, offset: 576)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !688, file: !689, line: 54, baseType: !259, size: 64, align: 64, offset: 640)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !688, file: !689, line: 55, baseType: !142, size: 64, align: 64, offset: 704)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !688, file: !689, line: 56, baseType: !329, size: 64, align: 64, offset: 768)
!710 = !DIGlobalVariable(name: "locale__doc__", scope: !0, file: !345, line: 41, type: !711, isLocal: true, isDefinition: true, variable: [27 x i8]* @locale__doc__)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 216, align: 8, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 27)
!714 = !DIGlobalVariable(name: "PyLocale_Methods", scope: !0, file: !345, line: 569, type: !715, isLocal: true, isDefinition: true, variable: [12 x %struct.PyMethodDef]* @PyLocale_Methods)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 3072, align: 64, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 12)
!718 = !DIGlobalVariable(name: "setlocale__doc__", scope: !0, file: !345, line: 47, type: !719, isLocal: true, isDefinition: true, variable: [70 x i8]* @setlocale__doc__)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 560, align: 8, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 70)
!722 = !DIGlobalVariable(name: "localeconv__doc__", scope: !0, file: !345, line: 130, type: !723, isLocal: true, isDefinition: true, variable: [69 x i8]* @localeconv__doc__)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 552, align: 8, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 69)
!726 = !DIGlobalVariable(name: "strcoll__doc__", scope: !0, file: !345, line: 205, type: !727, isLocal: true, isDefinition: true, variable: [68 x i8]* @strcoll__doc__)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 544, align: 8, elements: !728)
!728 = !{!729}
!729 = !DISubrange(count: 68)
!730 = !DIGlobalVariable(name: "strxfrm__doc__", scope: !0, file: !345, line: 234, type: !731, isLocal: true, isDefinition: true, variable: [100 x i8]* @strxfrm__doc__)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 800, align: 8, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 100)
!734 = !DIGlobalVariable(name: "nl_langinfo__doc__", scope: !0, file: !345, line: 429, type: !735, isLocal: true, isDefinition: true, variable: [92 x i8]* @nl_langinfo__doc__)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 736, align: 8, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 92)
!738 = !DIGlobalVariable(name: "gettext__doc__", scope: !0, file: !345, line: 457, type: !739, isLocal: true, isDefinition: true, variable: [50 x i8]* @gettext__doc__)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 400, align: 8, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 50)
!742 = !DIGlobalVariable(name: "dgettext__doc__", scope: !0, file: !345, line: 470, type: !723, isLocal: true, isDefinition: true, variable: [69 x i8]* @dgettext__doc__)
!743 = !DIGlobalVariable(name: "dcgettext__doc__", scope: !0, file: !345, line: 483, type: !744, isLocal: true, isDefinition: true, variable: [93 x i8]* @dcgettext__doc__)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 744, align: 8, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 93)
!747 = !DIGlobalVariable(name: "textdomain__doc__", scope: !0, file: !345, line: 497, type: !748, isLocal: true, isDefinition: true, variable: [96 x i8]* @textdomain__doc__)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 768, align: 8, elements: !749)
!749 = !{!750}
!750 = !DISubrange(count: 96)
!751 = !DIGlobalVariable(name: "bindtextdomain__doc__", scope: !0, file: !345, line: 515, type: !752, isLocal: true, isDefinition: true, variable: [74 x i8]* @bindtextdomain__doc__)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 592, align: 8, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 74)
!755 = !DIGlobalVariable(name: "bind_textdomain_codeset__doc__", scope: !0, file: !345, line: 550, type: !756, isLocal: true, isDefinition: true, variable: [91 x i8]* @bind_textdomain_codeset__doc__)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 728, align: 8, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 91)
!759 = !DIGlobalVariable(name: "langinfo_constants", scope: !0, file: !345, line: 325, type: !760, isLocal: true, isDefinition: true, variable: [57 x %struct.langinfo_constant]* @langinfo_constants)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !761, size: 7296, align: 64, elements: !765)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "langinfo_constant", file: !345, line: 322, size: 128, align: 64, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !761, file: !345, line: 323, baseType: !52, size: 64, align: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !761, file: !345, line: 324, baseType: !44, size: 32, align: 32, offset: 64)
!765 = !{!766}
!766 = !DISubrange(count: 57)
!767 = !{i32 2, !"Dwarf Version", i32 4}
!768 = !{i32 2, !"Debug Info Version", i32 3}
!769 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!770 = !DILocation(line: 624, column: 5, scope: !344)
!771 = !DIExpression()
!772 = !DILocation(line: 624, column: 15, scope: !344)
!773 = !DILocation(line: 624, column: 19, scope: !344)
!774 = !DILocation(line: 624, column: 23, scope: !344)
!775 = !DILocation(line: 626, column: 5, scope: !344)
!776 = !DILocation(line: 626, column: 9, scope: !344)
!777 = !DILocation(line: 629, column: 9, scope: !344)
!778 = !DILocation(line: 629, column: 7, scope: !344)
!779 = !{!780, !780, i64 0}
!780 = !{!"any pointer", !781, i64 0}
!781 = !{!"omnipotent char", !782, i64 0}
!782 = !{!"Simple C/C++ TBAA"}
!783 = !DILocation(line: 630, column: 9, scope: !784)
!784 = distinct !DILexicalBlock(scope: !344, file: !345, line: 630, column: 9)
!785 = !DILocation(line: 630, column: 11, scope: !784)
!786 = !DILocation(line: 630, column: 9, scope: !344)
!787 = !DILocation(line: 631, column: 5, scope: !784)
!788 = !DILocation(line: 633, column: 26, scope: !344)
!789 = !DILocation(line: 633, column: 9, scope: !344)
!790 = !DILocation(line: 633, column: 7, scope: !344)
!791 = !DILocation(line: 635, column: 9, scope: !344)
!792 = !DILocation(line: 635, column: 7, scope: !344)
!793 = !DILocation(line: 636, column: 26, scope: !344)
!794 = !DILocation(line: 636, column: 41, scope: !344)
!795 = !DILocation(line: 636, column: 5, scope: !344)
!796 = !DILocation(line: 637, column: 5, scope: !344)
!797 = !DILocation(line: 637, column: 10, scope: !798)
!798 = !DILexicalBlockFile(scope: !354, file: !345, discriminator: 1)
!799 = !DILocation(line: 637, column: 20, scope: !354)
!800 = !DILocation(line: 637, column: 51, scope: !354)
!801 = !DILocation(line: 637, column: 59, scope: !357)
!802 = !DILocation(line: 637, column: 75, scope: !357)
!803 = !DILocation(line: 637, column: 59, scope: !354)
!804 = !DILocation(line: 637, column: 90, scope: !805)
!805 = !DILexicalBlockFile(scope: !357, file: !345, discriminator: 2)
!806 = !DILocation(line: 637, column: 95, scope: !807)
!807 = !DILexicalBlockFile(scope: !356, file: !345, discriminator: 4)
!808 = !DILocation(line: 637, column: 105, scope: !356)
!809 = !DILocation(line: 637, column: 135, scope: !356)
!810 = !DILocation(line: 637, column: 161, scope: !811)
!811 = distinct !DILexicalBlock(scope: !356, file: !345, line: 637, column: 158)
!812 = !DILocation(line: 637, column: 178, scope: !811)
!813 = !DILocation(line: 637, column: 158, scope: !811)
!814 = !{!815, !816, i64 0}
!815 = !{!"_object", !816, i64 0, !780, i64 8}
!816 = !{!"long", !781, i64 0}
!817 = !DILocation(line: 637, column: 188, scope: !811)
!818 = !DILocation(line: 637, column: 158, scope: !356)
!819 = !DILocation(line: 637, column: 158, scope: !820)
!820 = !DILexicalBlockFile(scope: !356, file: !345, discriminator: 5)
!821 = !DILocation(line: 637, column: 219, scope: !822)
!822 = !DILexicalBlockFile(scope: !811, file: !345, discriminator: 6)
!823 = !DILocation(line: 637, column: 237, scope: !811)
!824 = !{!815, !780, i64 8}
!825 = !DILocation(line: 637, column: 247, scope: !811)
!826 = !{!827, !780, i64 48}
