; ModuleID = 'programs_new/Python-new/_lsprof.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !419, globals: !751)
!1 = !DIFile(filename: "_lsprof.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !343, !344, !350, !362, !369, !381, !389, !409, !396}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !7, line: 109, baseType: !8)
!7 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !7, line: 105, size: 128, align: 64, elements: !9)
!9 = !{!10, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !8, file: !7, line: 107, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !12, line: 177, baseType: !13)
!12 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !14, line: 102, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !16, line: 181, baseType: !17)
!16 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !8, file: !7, line: 108, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !7, line: 334, size: 3200, align: 64, elements: !21)
!21 = !{!22, !28, !32, !33, !34, !39, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !291, !309, !310, !311, !313, !315, !316, !318, !323, !328, !333, !334, !335, !336, !337, !338, !339, !340, !342}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !20, file: !7, line: 335, baseType: !23, size: 192, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !7, line: 114, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 111, size: 192, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !24, file: !7, line: 112, baseType: !6, size: 128, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !24, file: !7, line: 113, baseType: !11, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !20, file: !7, line: 336, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !20, file: !7, line: 341, baseType: !35, size: 64, align: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !7, line: 308, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !5}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !20, file: !7, line: 342, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !7, line: 314, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !5, !45, !44}
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !14, line: 48, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 246, size: 1728, align: 64, elements: !49)
!48 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!49 = !{!50, !51, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !71, !72, !73, !74, !76, !78, !80, !84, !87, !89, !90, !91, !92, !93, !97, !98}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !48, line: 247, baseType: !44, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !47, file: !48, line: 252, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !47, file: !48, line: 253, baseType: !52, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !47, file: !48, line: 254, baseType: !52, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !47, file: !48, line: 255, baseType: !52, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !47, file: !48, line: 256, baseType: !52, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !47, file: !48, line: 257, baseType: !52, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !47, file: !48, line: 258, baseType: !52, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !47, file: !48, line: 259, baseType: !52, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !47, file: !48, line: 261, baseType: !52, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !47, file: !48, line: 262, baseType: !52, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !47, file: !48, line: 263, baseType: !52, size: 64, align: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !47, file: !48, line: 265, baseType: !64, size: 64, align: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !48, line: 161, size: 192, align: 64, elements: !66)
!66 = !{!67, !68, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !65, file: !48, line: 162, baseType: !64, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !65, file: !48, line: 163, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !65, file: !48, line: 167, baseType: !44, size: 32, align: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !47, file: !48, line: 267, baseType: !69, size: 64, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !47, file: !48, line: 269, baseType: !44, size: 32, align: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !47, file: !48, line: 273, baseType: !44, size: 32, align: 32, offset: 928)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !47, file: !48, line: 275, baseType: !75, size: 64, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !16, line: 140, baseType: !17)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !47, file: !48, line: 279, baseType: !77, size: 16, align: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !47, file: !48, line: 280, baseType: !79, size: 8, align: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !47, file: !48, line: 281, baseType: !81, size: 8, align: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !47, file: !48, line: 285, baseType: !85, size: 64, align: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !48, line: 155, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !47, file: !48, line: 294, baseType: !88, size: 64, align: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !16, line: 141, baseType: !17)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !47, file: !48, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !47, file: !48, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !47, file: !48, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !47, file: !48, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !47, file: !48, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !47, file: !48, line: 309, baseType: !44, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !47, file: !48, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !20, file: !7, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !7, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!5, !5, !52}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !20, file: !7, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !7, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!44, !5, !52, !5}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !20, file: !7, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !20, file: !7, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !7, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!5, !5}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !20, file: !7, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !7, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !7, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !7, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!5, !5, !5}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !7, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !7, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !7, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !7, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !7, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !7, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!5, !5, !5, !5}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !7, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !7, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !7, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !7, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !7, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !7, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!44, !5}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !7, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !7, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !7, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !7, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !7, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !7, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !7, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !7, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !7, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !7, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !7, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !7, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !7, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !7, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !7, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !7, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !7, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !7, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !7, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !7, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !7, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !7, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !7, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !7, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !20, file: !7, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !7, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !7, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !7, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!11, !5}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !7, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !7, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !7, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!5, !5, !11}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !7, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !7, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !7, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !7, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!44, !5, !11, !5}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !7, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !7, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !7, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!44, !5, !5}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !7, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !7, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !20, file: !7, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !7, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !7, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !7, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !7, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !7, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!44, !5, !5, !5}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !20, file: !7, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !7, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !5}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !12, line: 186, baseType: !11)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !20, file: !7, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !20, file: !7, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !20, file: !7, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !7, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !20, file: !7, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !7, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !20, file: !7, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !7, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !7, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !7, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!44, !5, !235, !44}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !7, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !7, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !7, line: 179, baseType: !4, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !7, line: 180, baseType: !5, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !7, line: 181, baseType: !11, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !7, line: 182, baseType: !11, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !7, line: 184, baseType: !44, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !7, line: 185, baseType: !44, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !7, line: 186, baseType: !52, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !7, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !7, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !7, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !7, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !7, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !7, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !5, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !20, file: !7, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !20, file: !7, line: 368, baseType: !29, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !20, file: !7, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !7, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!44, !5, !263, !4}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !7, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!44, !5, !4}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !20, file: !7, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !20, file: !7, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !7, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!5, !5, !5, !44}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !20, file: !7, line: 382, baseType: !11, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !20, file: !7, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !7, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !20, file: !7, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !7, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !20, file: !7, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !29, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !44, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !29, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !20, file: !7, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !7, line: 390, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !20, file: !7, line: 391, baseType: !292, size: 64, align: 64, offset: 1984)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !294, line: 11, size: 320, align: 64, elements: !295)
!294 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!295 = !{!296, !297, !302, !307, !308}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !293, file: !294, line: 12, baseType: !52, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !293, file: !294, line: 13, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !294, line: 8, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!5, !5, !4}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !293, file: !294, line: 14, baseType: !303, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !294, line: 9, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!44, !5, !5, !4}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !293, file: !294, line: 15, baseType: !52, size: 64, align: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !293, file: !294, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !20, file: !7, line: 392, baseType: !19, size: 64, align: 64, offset: 2048)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !20, file: !7, line: 393, baseType: !5, size: 64, align: 64, offset: 2112)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !20, file: !7, line: 394, baseType: !312, size: 64, align: 64, offset: 2176)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !7, line: 325, baseType: !134)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !20, file: !7, line: 395, baseType: !314, size: 64, align: 64, offset: 2240)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !7, line: 326, baseType: !210)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !20, file: !7, line: 396, baseType: !11, size: 64, align: 64, offset: 2304)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !20, file: !7, line: 397, baseType: !317, size: 64, align: 64, offset: 2368)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !7, line: 327, baseType: !210)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !20, file: !7, line: 398, baseType: !319, size: 64, align: 64, offset: 2432)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !7, line: 329, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!5, !19, !11}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !20, file: !7, line: 399, baseType: !324, size: 64, align: 64, offset: 2496)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !7, line: 328, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!5, !19, !5, !5}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !20, file: !7, line: 400, baseType: !329, size: 64, align: 64, offset: 2560)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !7, line: 307, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !4}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !20, file: !7, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !20, file: !7, line: 402, baseType: !5, size: 64, align: 64, offset: 2688)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !20, file: !7, line: 403, baseType: !5, size: 64, align: 64, offset: 2752)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !20, file: !7, line: 404, baseType: !5, size: 64, align: 64, offset: 2816)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !20, file: !7, line: 405, baseType: !5, size: 64, align: 64, offset: 2880)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !20, file: !7, line: 406, baseType: !5, size: 64, align: 64, offset: 2944)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !20, file: !7, line: 407, baseType: !35, size: 64, align: 64, offset: 3008)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !20, file: !7, line: 410, baseType: !341, size: 32, align: 32, offset: 3072)
!341 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !20, file: !7, line: 412, baseType: !35, size: 64, align: 64, offset: 3136)
!343 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "timezone", file: !346, line: 56, size: 64, align: 32, elements: !347)
!346 = !DIFile(filename: "/usr/include/sys/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tz_minuteswest", scope: !345, file: !346, line: 58, baseType: !44, size: 32, align: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tz_dsttime", scope: !345, file: !346, line: 59, baseType: !44, size: 32, align: 32, offset: 32)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfilerSubEntry", file: !352, line: 78, baseType: !353)
!352 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_lsprof.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfilerSubEntry", file: !352, line: 71, size: 512, align: 64, elements: !354)
!354 = !{!355, !364, !365, !366, !367, !368}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !353, file: !352, line: 72, baseType: !356, size: 192, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "rotating_node_t", file: !357, line: 15, baseType: !358)
!357 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/rotatingtree.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "rotating_node_s", file: !357, line: 18, size: 192, align: 64, elements: !359)
!359 = !{!360, !361, !363}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !358, file: !357, line: 19, baseType: !4, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !358, file: !357, line: 20, baseType: !362, size: 64, align: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !358, file: !357, line: 21, baseType: !362, size: 64, align: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !353, file: !352, line: 73, baseType: !343, size: 64, align: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !353, file: !352, line: 74, baseType: !343, size: 64, align: 64, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "callcount", scope: !353, file: !352, line: 75, baseType: !17, size: 64, align: 64, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "recursivecallcount", scope: !353, file: !352, line: 76, baseType: !17, size: 64, align: 64, offset: 384)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "recursionLevel", scope: !353, file: !352, line: 77, baseType: !17, size: 64, align: 64, offset: 448)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfilerEntry", file: !352, line: 90, baseType: !371)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfilerEntry", file: !352, line: 81, size: 640, align: 64, elements: !372)
!372 = !{!373, !374, !375, !376, !377, !378, !379, !380}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !371, file: !352, line: 82, baseType: !356, size: 192, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "userObj", scope: !371, file: !352, line: 83, baseType: !5, size: 64, align: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !371, file: !352, line: 84, baseType: !343, size: 64, align: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !371, file: !352, line: 85, baseType: !343, size: 64, align: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "callcount", scope: !371, file: !352, line: 86, baseType: !17, size: 64, align: 64, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "recursivecallcount", scope: !371, file: !352, line: 87, baseType: !17, size: 64, align: 64, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "recursionLevel", scope: !371, file: !352, line: 88, baseType: !17, size: 64, align: 64, offset: 512)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "calls", scope: !371, file: !352, line: 89, baseType: !362, size: 64, align: 64, offset: 576)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "statscollector_t", file: !352, line: 538, baseType: !383)
!383 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 534, size: 192, align: 64, elements: !384)
!384 = !{!385, !386, !387}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !383, file: !352, line: 535, baseType: !5, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "sublist", scope: !383, file: !352, line: 536, baseType: !5, size: 64, align: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !383, file: !352, line: 537, baseType: !388, size: 64, align: 64, offset: 128)
!388 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfilerObject", file: !352, line: 107, baseType: !391)
!391 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 99, size: 512, align: 64, elements: !392)
!392 = !{!393, !394, !395, !405, !406, !407, !408}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !391, file: !352, line: 100, baseType: !6, size: 128, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "profilerEntries", scope: !391, file: !352, line: 101, baseType: !362, size: 64, align: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "currentProfilerContext", scope: !391, file: !352, line: 102, baseType: !396, size: 64, align: 64, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfilerContext", file: !352, line: 97, baseType: !398)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfilerContext", file: !352, line: 92, size: 256, align: 64, elements: !399)
!399 = !{!400, !401, !402, !404}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "t0", scope: !398, file: !352, line: 93, baseType: !343, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "subt", scope: !398, file: !352, line: 94, baseType: !343, size: 64, align: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !398, file: !352, line: 95, baseType: !403, size: 64, align: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ctxEntry", scope: !398, file: !352, line: 96, baseType: !369, size: 64, align: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "freelistProfilerContext", scope: !391, file: !352, line: 103, baseType: !396, size: 64, align: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !391, file: !352, line: 104, baseType: !44, size: 32, align: 32, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "externalTimer", scope: !391, file: !352, line: 105, baseType: !5, size: 64, align: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "externalTimerUnit", scope: !391, file: !352, line: 106, baseType: !388, size: 64, align: 64, offset: 448)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunctionObject", file: !281, line: 80, baseType: !411)
!411 = !DICompositeType(tag: DW_TAG_structure_type, file: !281, line: 75, size: 320, align: 64, elements: !412)
!412 = !{!413, !414, !417, !418}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !411, file: !281, line: 76, baseType: !6, size: 128, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "m_ml", scope: !411, file: !281, line: 77, baseType: !415, size: 64, align: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !281, line: 47, baseType: !280)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "m_self", scope: !411, file: !281, line: 78, baseType: !5, size: 64, align: 64, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "m_module", scope: !411, file: !281, line: 79, baseType: !5, size: 64, align: 64, offset: 256)
!419 = !{!420, !426, !436, !442, !455, !467, !480, !487, !492, !501, !506, !517, !522, !525, !543, !554, !563, !569, !573, !641, !654, !660, !668, !700, !709, !715, !724, !728, !732}
!420 = !DISubprogram(name: "PyInit__lsprof", scope: !352, file: !352, line: 863, type: !421, isLocal: false, isDefinition: true, scopeLine: 864, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__lsprof, variables: !423)
!421 = !DISubroutineType(types: !422)
!422 = !{!5}
!423 = !{!424, !425}
!424 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "module", scope: !420, file: !352, line: 865, type: !5)
!425 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !420, file: !352, line: 865, type: !5)
!426 = !DISubprogram(name: "profiler_dealloc", scope: !352, file: !352, line: 745, type: !427, isLocal: true, isDefinition: true, scopeLine: 746, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.ProfilerObject*)* @profiler_dealloc, variables: !429)
!427 = !DISubroutineType(types: !428)
!428 = !{null, !389}
!429 = !{!430, !431, !433}
!430 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !426, file: !352, line: 745, type: !389)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !432, file: !352, line: 751, type: !5)
!432 = distinct !DILexicalBlock(scope: !426, file: !352, line: 751, column: 8)
!433 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !434, file: !352, line: 751, type: !5)
!434 = distinct !DILexicalBlock(scope: !435, file: !352, line: 751, column: 109)
!435 = distinct !DILexicalBlock(scope: !432, file: !352, line: 751, column: 75)
!436 = !DISubprogram(name: "flush_unmatched", scope: !352, file: !352, line: 697, type: !427, isLocal: true, isDefinition: true, scopeLine: 698, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.ProfilerObject*)* @flush_unmatched, variables: !437)
!437 = !{!438, !439, !441}
!438 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pObj", arg: 1, scope: !436, file: !352, line: 697, type: !389)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pContext", scope: !440, file: !352, line: 700, type: !396)
!440 = distinct !DILexicalBlock(scope: !436, file: !352, line: 699, column: 42)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "profEntry", scope: !440, file: !352, line: 701, type: !369)
!442 = !DISubprogram(name: "Stop", scope: !352, file: !352, line: 336, type: !443, isLocal: true, isDefinition: true, scopeLine: 337, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.ProfilerObject*, %struct._ProfilerContext*, %struct._ProfilerEntry*)* @Stop, variables: !445)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !389, !396, !369}
!445 = !{!446, !447, !448, !449, !450, !451, !454}
!446 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pObj", arg: 1, scope: !442, file: !352, line: 336, type: !389)
!447 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 2, scope: !442, file: !352, line: 336, type: !396)
!448 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "entry", arg: 3, scope: !442, file: !352, line: 336, type: !369)
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tt", scope: !442, file: !352, line: 338, type: !343)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !442, file: !352, line: 339, type: !343)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "caller", scope: !452, file: !352, line: 351, type: !369)
!452 = distinct !DILexicalBlock(scope: !453, file: !352, line: 349, column: 50)
!453 = distinct !DILexicalBlock(scope: !442, file: !352, line: 349, column: 9)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "subentry", scope: !452, file: !352, line: 352, type: !350)
!455 = !DISubprogram(name: "CallExternalTimer", scope: !352, file: !352, line: 124, type: !456, isLocal: true, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.ProfilerObject*)* @CallExternalTimer, variables: !458)
!456 = !DISubroutineType(types: !457)
!457 = !{!343, !389}
!458 = !{!459, !460, !461, !462, !465}
!459 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pObj", arg: 1, scope: !455, file: !352, line: 124, type: !389)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !455, file: !352, line: 126, type: !343)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !455, file: !352, line: 127, type: !5)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !463, file: !352, line: 141, type: !388)
!463 = distinct !DILexicalBlock(scope: !464, file: !352, line: 137, column: 10)
!464 = distinct !DILexicalBlock(scope: !455, file: !352, line: 132, column: 9)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !466, file: !352, line: 145, type: !5)
!466 = distinct !DILexicalBlock(scope: !455, file: !352, line: 145, column: 8)
!467 = !DISubprogram(name: "hpTimer", scope: !352, file: !352, line: 43, type: !468, isLocal: true, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true, function: i64 ()* @hpTimer, variables: !470)
!468 = !DISubroutineType(types: !469)
!469 = !{!343}
!470 = !{!471, !479}
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tv", scope: !467, file: !352, line: 45, type: !472)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !473, line: 30, size: 128, align: 64, elements: !474)
!473 = !DIFile(filename: "/usr/include/bits/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!474 = !{!475, !477}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !472, file: !473, line: 32, baseType: !476, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !16, line: 148, baseType: !17)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !472, file: !473, line: 33, baseType: !478, size: 64, align: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !16, line: 150, baseType: !17)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !467, file: !352, line: 46, type: !343)
!480 = !DISubprogram(name: "getSubEntry", scope: !352, file: !352, line: 257, type: !481, isLocal: true, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: true, function: %struct._ProfilerSubEntry* (%struct.ProfilerObject*, %struct._ProfilerEntry*, %struct._ProfilerEntry*)* @getSubEntry, variables: !483)
!481 = !DISubroutineType(types: !482)
!482 = !{!350, !389, !369, !369}
!483 = !{!484, !485, !486}
!484 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pObj", arg: 1, scope: !480, file: !352, line: 257, type: !389)
!485 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "caller", arg: 2, scope: !480, file: !352, line: 257, type: !369)
!486 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "entry", arg: 3, scope: !480, file: !352, line: 257, type: !369)
!487 = !DISubprogram(name: "clearEntries", scope: !352, file: !352, line: 298, type: !427, isLocal: true, isDefinition: true, scopeLine: 299, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.ProfilerObject*)* @clearEntries, variables: !488)
!488 = !{!489, !490}
!489 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pObj", arg: 1, scope: !487, file: !352, line: 298, type: !389)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !491, file: !352, line: 308, type: !396)
!491 = distinct !DILexicalBlock(scope: !487, file: !352, line: 307, column: 43)
!492 = !DISubprogram(name: "freeEntry", scope: !352, file: !352, line: 289, type: !493, isLocal: true, isDefinition: true, scopeLine: 290, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.rotating_node_s*, i8*)* @freeEntry, variables: !495)
!493 = !DISubroutineType(types: !494)
!494 = !{!44, !362, !4}
!495 = !{!496, !497, !498, !499}
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "header", arg: 1, scope: !492, file: !352, line: 289, type: !362)
!497 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !492, file: !352, line: 289, type: !4)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !492, file: !352, line: 291, type: !369)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !500, file: !352, line: 293, type: !5)
!500 = distinct !DILexicalBlock(scope: !492, file: !352, line: 293, column: 8)
!501 = !DISubprogram(name: "freeSubEntry", scope: !352, file: !352, line: 282, type: !493, isLocal: true, isDefinition: true, scopeLine: 283, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.rotating_node_s*, i8*)* @freeSubEntry, variables: !502)
!502 = !{!503, !504, !505}
!503 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "header", arg: 1, scope: !501, file: !352, line: 282, type: !362)
!504 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !501, file: !352, line: 282, type: !4)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "subentry", scope: !501, file: !352, line: 284, type: !350)
!506 = !DISubprogram(name: "profiler_getstats", scope: !352, file: !352, line: 626, type: !507, isLocal: true, isDefinition: true, scopeLine: 627, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.ProfilerObject*, %struct._object*)* @profiler_getstats, variables: !509)
!507 = !DISubroutineType(types: !508)
!508 = !{!5, !389, !5}
!509 = !{!510, !511, !512, !513}
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pObj", arg: 1, scope: !506, file: !352, line: 626, type: !389)
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noarg", arg: 2, scope: !506, file: !352, line: 626, type: !5)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "collect", scope: !506, file: !352, line: 628, type: !382)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !514, file: !352, line: 642, type: !5)
!514 = distinct !DILexicalBlock(scope: !515, file: !352, line: 642, column: 12)
!515 = distinct !DILexicalBlock(scope: !516, file: !352, line: 641, column: 15)
!516 = distinct !DILexicalBlock(scope: !506, file: !352, line: 640, column: 9)
!517 = !DISubprogram(name: "pending_exception", scope: !352, file: !352, line: 483, type: !518, isLocal: true, isDefinition: true, scopeLine: 484, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ProfilerObject*)* @pending_exception, variables: !520)
!518 = !DISubroutineType(types: !519)
!519 = !{!44, !389}
!520 = !{!521}
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pObj", arg: 1, scope: !517, file: !352, line: 483, type: !389)
!522 = !DISubprogram(name: "hpTimerUnit", scope: !352, file: !352, line: 58, type: !523, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true, function: double ()* @hpTimerUnit, variables: !2)
!523 = !DISubroutineType(types: !524)
!524 = !{!388}
!525 = !DISubprogram(name: "statsForEntry", scope: !352, file: !352, line: 561, type: !493, isLocal: true, isDefinition: true, scopeLine: 562, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.rotating_node_s*, i8*)* @statsForEntry, variables: !526)
!526 = !{!527, !528, !529, !530, !531, !532, !533, !539, !541}
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "node", arg: 1, scope: !525, file: !352, line: 561, type: !362)
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !525, file: !352, line: 561, type: !4)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !525, file: !352, line: 563, type: !369)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "collect", scope: !525, file: !352, line: 564, type: !381)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "info", scope: !525, file: !352, line: 565, type: !5)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !525, file: !352, line: 566, type: !44)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !534, file: !352, line: 576, type: !5)
!534 = distinct !DILexicalBlock(scope: !535, file: !352, line: 576, column: 16)
!535 = distinct !DILexicalBlock(scope: !536, file: !352, line: 575, column: 64)
!536 = distinct !DILexicalBlock(scope: !537, file: !352, line: 574, column: 13)
!537 = distinct !DILexicalBlock(scope: !538, file: !352, line: 570, column: 58)
!538 = distinct !DILexicalBlock(scope: !525, file: !352, line: 570, column: 9)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !540, file: !352, line: 593, type: !5)
!540 = distinct !DILexicalBlock(scope: !525, file: !352, line: 593, column: 8)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !542, file: !352, line: 597, type: !5)
!542 = distinct !DILexicalBlock(scope: !525, file: !352, line: 597, column: 8)
!543 = !DISubprogram(name: "statsForSubEntry", scope: !352, file: !352, line: 540, type: !493, isLocal: true, isDefinition: true, scopeLine: 541, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.rotating_node_s*, i8*)* @statsForSubEntry, variables: !544)
!544 = !{!545, !546, !547, !548, !549, !550, !551, !552}
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "node", arg: 1, scope: !543, file: !352, line: 540, type: !362)
!546 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !543, file: !352, line: 540, type: !4)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sentry", scope: !543, file: !352, line: 542, type: !350)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "collect", scope: !543, file: !352, line: 543, type: !381)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !543, file: !352, line: 544, type: !369)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !543, file: !352, line: 545, type: !44)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sinfo", scope: !543, file: !352, line: 546, type: !5)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !553, file: !352, line: 557, type: !5)
!553 = distinct !DILexicalBlock(scope: !543, file: !352, line: 557, column: 8)
!554 = !DISubprogram(name: "profiler_enable", scope: !352, file: !352, line: 680, type: !555, isLocal: true, isDefinition: true, scopeLine: 681, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.ProfilerObject*, %struct._object*, %struct._object*)* @profiler_enable, variables: !557)
!555 = !DISubroutineType(types: !556)
!556 = !{!5, !389, !5, !5}
!557 = !{!558, !559, !560, !561, !562}
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !554, file: !352, line: 680, type: !389)
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !554, file: !352, line: 680, type: !5)
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !554, file: !352, line: 680, type: !5)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "subcalls", scope: !554, file: !352, line: 682, type: !44)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "builtins", scope: !554, file: !352, line: 683, type: !44)
!563 = !DISubprogram(name: "setSubcalls", scope: !352, file: !352, line: 649, type: !564, isLocal: true, isDefinition: true, scopeLine: 650, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ProfilerObject*, i32)* @setSubcalls, variables: !566)
!564 = !DISubroutineType(types: !565)
!565 = !{!44, !389, !44}
!566 = !{!567, !568}
!567 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pObj", arg: 1, scope: !563, file: !352, line: 649, type: !389)
!568 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nvalue", arg: 2, scope: !563, file: !352, line: 649, type: !44)
!569 = !DISubprogram(name: "setBuiltins", scope: !352, file: !352, line: 659, type: !564, isLocal: true, isDefinition: true, scopeLine: 660, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ProfilerObject*, i32)* @setBuiltins, variables: !570)
!570 = !{!571, !572}
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pObj", arg: 1, scope: !569, file: !352, line: 659, type: !389)
!572 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nvalue", arg: 2, scope: !569, file: !352, line: 659, type: !44)
!573 = !DISubprogram(name: "profiler_callback", scope: !352, file: !352, line: 432, type: !574, isLocal: true, isDefinition: true, scopeLine: 434, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._frame*, i32, %struct._object*)* @profiler_callback, variables: !636)
!574 = !DISubroutineType(types: !575)
!575 = !{!44, !5, !576, !44, !5}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFrameObject", file: !578, line: 53, baseType: !579)
!578 = !DIFile(filename: "./Include/frameobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !578, line: 17, size: 3072, align: 64, elements: !580)
!580 = !{!581, !582, !584, !611, !612, !613, !614, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !634}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !579, file: !578, line: 18, baseType: !23, size: 192, align: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "f_back", scope: !579, file: !578, line: 19, baseType: !583, size: 64, align: 64, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64, align: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "f_code", scope: !579, file: !578, line: 20, baseType: !585, size: 64, align: 64, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !587, line: 33, baseType: !588)
!587 = !DIFile(filename: "./Include/code.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!588 = !DICompositeType(tag: DW_TAG_structure_type, file: !587, line: 11, size: 1152, align: 64, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !605, !606, !607, !608, !609, !610}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !588, file: !587, line: 12, baseType: !6, size: 128, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !588, file: !587, line: 13, baseType: !44, size: 32, align: 32, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !588, file: !587, line: 14, baseType: !44, size: 32, align: 32, offset: 160)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !588, file: !587, line: 15, baseType: !44, size: 32, align: 32, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !588, file: !587, line: 16, baseType: !44, size: 32, align: 32, offset: 224)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !588, file: !587, line: 17, baseType: !44, size: 32, align: 32, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "co_code", scope: !588, file: !587, line: 18, baseType: !5, size: 64, align: 64, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !588, file: !587, line: 19, baseType: !5, size: 64, align: 64, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !588, file: !587, line: 20, baseType: !5, size: 64, align: 64, offset: 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "co_varnames", scope: !588, file: !587, line: 21, baseType: !5, size: 64, align: 64, offset: 512)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "co_freevars", scope: !588, file: !587, line: 22, baseType: !5, size: 64, align: 64, offset: 576)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "co_cellvars", scope: !588, file: !587, line: 23, baseType: !5, size: 64, align: 64, offset: 640)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "co_cell2arg", scope: !588, file: !587, line: 25, baseType: !603, size: 64, align: 64, offset: 704)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64, align: 64)
!604 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !588, file: !587, line: 26, baseType: !5, size: 64, align: 64, offset: 768)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !588, file: !587, line: 27, baseType: !5, size: 64, align: 64, offset: 832)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !588, file: !587, line: 28, baseType: !44, size: 32, align: 32, offset: 896)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "co_lnotab", scope: !588, file: !587, line: 29, baseType: !5, size: 64, align: 64, offset: 960)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "co_zombieframe", scope: !588, file: !587, line: 31, baseType: !4, size: 64, align: 64, offset: 1024)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !588, file: !587, line: 32, baseType: !5, size: 64, align: 64, offset: 1088)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "f_builtins", scope: !579, file: !578, line: 21, baseType: !5, size: 64, align: 64, offset: 320)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "f_globals", scope: !579, file: !578, line: 22, baseType: !5, size: 64, align: 64, offset: 384)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "f_locals", scope: !579, file: !578, line: 23, baseType: !5, size: 64, align: 64, offset: 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "f_valuestack", scope: !579, file: !578, line: 24, baseType: !615, size: 64, align: 64, offset: 512)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "f_stacktop", scope: !579, file: !578, line: 28, baseType: !615, size: 64, align: 64, offset: 576)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "f_trace", scope: !579, file: !578, line: 29, baseType: !5, size: 64, align: 64, offset: 640)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_type", scope: !579, file: !578, line: 38, baseType: !5, size: 64, align: 64, offset: 704)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_value", scope: !579, file: !578, line: 38, baseType: !5, size: 64, align: 64, offset: 768)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_traceback", scope: !579, file: !578, line: 38, baseType: !5, size: 64, align: 64, offset: 832)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "f_gen", scope: !579, file: !578, line: 40, baseType: !5, size: 64, align: 64, offset: 896)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "f_lasti", scope: !579, file: !578, line: 42, baseType: !44, size: 32, align: 32, offset: 960)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "f_lineno", scope: !579, file: !578, line: 48, baseType: !44, size: 32, align: 32, offset: 992)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "f_iblock", scope: !579, file: !578, line: 49, baseType: !44, size: 32, align: 32, offset: 1024)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "f_executing", scope: !579, file: !578, line: 50, baseType: !31, size: 8, align: 8, offset: 1056)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "f_blockstack", scope: !579, file: !578, line: 51, baseType: !627, size: 1920, align: 32, offset: 1088)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 1920, align: 32, elements: !100)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTryBlock", file: !578, line: 15, baseType: !629)
!629 = !DICompositeType(tag: DW_TAG_structure_type, file: !578, line: 11, size: 96, align: 32, elements: !630)
!630 = !{!631, !632, !633}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "b_type", scope: !629, file: !578, line: 12, baseType: !44, size: 32, align: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "b_handler", scope: !629, file: !578, line: 13, baseType: !44, size: 32, align: 32, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "b_level", scope: !629, file: !578, line: 14, baseType: !44, size: 32, align: 32, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "f_localsplus", scope: !579, file: !578, line: 52, baseType: !635, size: 64, align: 64, offset: 3008)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, align: 64, elements: !82)
!636 = !{!637, !638, !639, !640}
!637 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !573, file: !352, line: 432, type: !5)
!638 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frame", arg: 2, scope: !573, file: !352, line: 432, type: !576)
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "what", arg: 3, scope: !573, file: !352, line: 432, type: !44)
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 4, scope: !573, file: !352, line: 433, type: !5)
!641 = !DISubprogram(name: "ptrace_enter_call", scope: !352, file: !352, line: 365, type: !642, isLocal: true, isDefinition: true, scopeLine: 366, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, i8*, %struct._object*)* @ptrace_enter_call, variables: !644)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !5, !4, !5}
!644 = !{!645, !646, !647, !648, !649, !650, !651, !652, !653}
!645 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !641, file: !352, line: 365, type: !5)
!646 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !641, file: !352, line: 365, type: !4)
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "userObj", arg: 3, scope: !641, file: !352, line: 365, type: !5)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pObj", scope: !641, file: !352, line: 369, type: !389)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "profEntry", scope: !641, file: !352, line: 370, type: !369)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pContext", scope: !641, file: !352, line: 371, type: !396)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "last_type", scope: !641, file: !352, line: 379, type: !5)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "last_value", scope: !641, file: !352, line: 379, type: !5)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "last_tb", scope: !641, file: !352, line: 379, type: !5)
!654 = !DISubprogram(name: "getEntry", scope: !352, file: !352, line: 251, type: !655, isLocal: true, isDefinition: true, scopeLine: 252, flags: DIFlagPrototyped, isOptimized: true, function: %struct._ProfilerEntry* (%struct.ProfilerObject*, i8*)* @getEntry, variables: !657)
!655 = !DISubroutineType(types: !656)
!656 = !{!369, !389, !4}
!657 = !{!658, !659}
!658 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pObj", arg: 1, scope: !654, file: !352, line: 251, type: !389)
!659 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !654, file: !352, line: 251, type: !4)
!660 = !DISubprogram(name: "newProfilerEntry", scope: !352, file: !352, line: 223, type: !661, isLocal: true, isDefinition: true, scopeLine: 224, flags: DIFlagPrototyped, isOptimized: true, function: %struct._ProfilerEntry* (%struct.ProfilerObject*, i8*, %struct._object*)* @newProfilerEntry, variables: !663)
!661 = !DISubroutineType(types: !662)
!662 = !{!369, !389, !4, !5}
!663 = !{!664, !665, !666, !667}
!664 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pObj", arg: 1, scope: !660, file: !352, line: 223, type: !389)
!665 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !660, file: !352, line: 223, type: !4)
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "userObj", arg: 3, scope: !660, file: !352, line: 223, type: !5)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !660, file: !352, line: 225, type: !369)
!668 = !DISubprogram(name: "normalizeUserObj", scope: !352, file: !352, line: 160, type: !116, isLocal: true, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @normalizeUserObj, variables: !669)
!669 = !{!670, !671, !672, !675, !676, !681, !683, !685, !687, !688, !691, !693, !695, !698}
!670 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !668, file: !352, line: 160, type: !5)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fn", scope: !668, file: !352, line: 162, type: !409)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !673, file: !352, line: 174, type: !5)
!673 = distinct !DILexicalBlock(scope: !674, file: !352, line: 172, column: 35)
!674 = distinct !DILexicalBlock(scope: !668, file: !352, line: 172, column: 9)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modname", scope: !673, file: !352, line: 175, type: !5)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !677, file: !352, line: 189, type: !5)
!677 = distinct !DILexicalBlock(scope: !678, file: !352, line: 188, column: 77)
!678 = distinct !DILexicalBlock(scope: !679, file: !352, line: 188, column: 17)
!679 = distinct !DILexicalBlock(scope: !680, file: !352, line: 187, column: 36)
!680 = distinct !DILexicalBlock(scope: !673, file: !352, line: 187, column: 13)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !682, file: !352, line: 192, type: !5)
!682 = distinct !DILexicalBlock(scope: !677, file: !352, line: 192, column: 20)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !684, file: !352, line: 195, type: !5)
!684 = distinct !DILexicalBlock(scope: !679, file: !352, line: 195, column: 16)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !686, file: !352, line: 203, type: !5)
!686 = distinct !DILexicalBlock(scope: !674, file: !352, line: 199, column: 10)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !686, file: !352, line: 204, type: !5)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mo", scope: !689, file: !352, line: 206, type: !5)
!689 = distinct !DILexicalBlock(scope: !690, file: !352, line: 205, column: 33)
!690 = distinct !DILexicalBlock(scope: !686, file: !352, line: 205, column: 13)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !692, file: !352, line: 207, type: !5)
!692 = distinct !DILexicalBlock(scope: !689, file: !352, line: 207, column: 16)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !694, file: !352, line: 208, type: !5)
!694 = distinct !DILexicalBlock(scope: !689, file: !352, line: 208, column: 16)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !696, file: !352, line: 210, type: !5)
!696 = distinct !DILexicalBlock(scope: !697, file: !352, line: 209, column: 35)
!697 = distinct !DILexicalBlock(scope: !689, file: !352, line: 209, column: 17)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !699, file: !352, line: 211, type: !5)
!699 = distinct !DILexicalBlock(scope: !696, file: !352, line: 211, column: 20)
!700 = !DISubprogram(name: "initContext", scope: !352, file: !352, line: 316, type: !443, isLocal: true, isDefinition: true, scopeLine: 317, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.ProfilerObject*, %struct._ProfilerContext*, %struct._ProfilerEntry*)* @initContext, variables: !701)
!701 = !{!702, !703, !704, !705, !708}
!702 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pObj", arg: 1, scope: !700, file: !352, line: 316, type: !389)
!703 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 2, scope: !700, file: !352, line: 316, type: !396)
!704 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "entry", arg: 3, scope: !700, file: !352, line: 316, type: !369)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "caller", scope: !706, file: !352, line: 325, type: !369)
!706 = distinct !DILexicalBlock(scope: !707, file: !352, line: 323, column: 50)
!707 = distinct !DILexicalBlock(scope: !700, file: !352, line: 323, column: 9)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "subentry", scope: !706, file: !352, line: 326, type: !350)
!709 = !DISubprogram(name: "newSubEntry", scope: !352, file: !352, line: 264, type: !481, isLocal: true, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: true, function: %struct._ProfilerSubEntry* (%struct.ProfilerObject*, %struct._ProfilerEntry*, %struct._ProfilerEntry*)* @newSubEntry, variables: !710)
!710 = !{!711, !712, !713, !714}
!711 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pObj", arg: 1, scope: !709, file: !352, line: 264, type: !389)
!712 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "caller", arg: 2, scope: !709, file: !352, line: 264, type: !369)
!713 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "entry", arg: 3, scope: !709, file: !352, line: 264, type: !369)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !709, file: !352, line: 266, type: !350)
!715 = !DISubprogram(name: "ptrace_leave_call", scope: !352, file: !352, line: 409, type: !716, isLocal: true, isDefinition: true, scopeLine: 410, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, i8*)* @ptrace_leave_call, variables: !718)
!716 = !DISubroutineType(types: !717)
!717 = !{null, !5, !4}
!718 = !{!719, !720, !721, !722, !723}
!719 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !715, file: !352, line: 409, type: !5)
!720 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !715, file: !352, line: 409, type: !4)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pObj", scope: !715, file: !352, line: 412, type: !389)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "profEntry", scope: !715, file: !352, line: 413, type: !369)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pContext", scope: !715, file: !352, line: 414, type: !396)
!724 = !DISubprogram(name: "profiler_disable", scope: !352, file: !352, line: 719, type: !507, isLocal: true, isDefinition: true, scopeLine: 720, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.ProfilerObject*, %struct._object*)* @profiler_disable, variables: !725)
!725 = !{!726, !727}
!726 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !724, file: !352, line: 719, type: !389)
!727 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noarg", arg: 2, scope: !724, file: !352, line: 719, type: !5)
!728 = !DISubprogram(name: "profiler_clear", scope: !352, file: !352, line: 737, type: !507, isLocal: true, isDefinition: true, scopeLine: 738, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.ProfilerObject*, %struct._object*)* @profiler_clear, variables: !729)
!729 = !{!730, !731}
!730 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pObj", arg: 1, scope: !728, file: !352, line: 737, type: !389)
!731 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "noarg", arg: 2, scope: !728, file: !352, line: 737, type: !5)
!732 = !DISubprogram(name: "profiler_init", scope: !352, file: !352, line: 756, type: !733, isLocal: true, isDefinition: true, scopeLine: 757, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ProfilerObject*, %struct._object*, %struct._object*)* @profiler_init, variables: !735)
!733 = !DISubroutineType(types: !734)
!734 = !{!44, !389, !5, !5}
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743, !744, !746, !748}
!736 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pObj", arg: 1, scope: !732, file: !352, line: 756, type: !389)
!737 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !732, file: !352, line: 756, type: !5)
!738 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !732, file: !352, line: 756, type: !5)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !732, file: !352, line: 758, type: !5)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timer", scope: !732, file: !352, line: 759, type: !5)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timeunit", scope: !732, file: !352, line: 760, type: !388)
!742 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "subcalls", scope: !732, file: !352, line: 761, type: !44)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "builtins", scope: !732, file: !352, line: 762, type: !44)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !745, file: !352, line: 775, type: !5)
!745 = distinct !DILexicalBlock(scope: !732, file: !352, line: 775, column: 8)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !747, file: !352, line: 776, type: !5)
!747 = distinct !DILexicalBlock(scope: !732, file: !352, line: 776, column: 8)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !749, file: !352, line: 776, type: !5)
!749 = distinct !DILexicalBlock(scope: !750, file: !352, line: 776, column: 93)
!750 = distinct !DILexicalBlock(scope: !747, file: !352, line: 776, column: 59)
!751 = !{!752, !753, !754, !756, !757, !778, !780, !781, !785, !789, !793, !797, !801, !805, !809, !811, !825, !830, !831}
!752 = !DIGlobalVariable(name: "empty_tuple", scope: !0, file: !352, line: 122, type: !5, isLocal: true, isDefinition: true, variable: %struct._object** @empty_tuple)
!753 = !DIGlobalVariable(name: "initialized", scope: !0, file: !352, line: 529, type: !44, isLocal: true, isDefinition: true, variable: i32* @initialized)
!754 = !DIGlobalVariable(name: "StatsEntryType", scope: !0, file: !352, line: 530, type: !755, isLocal: true, isDefinition: true, variable: %struct._typeobject* @StatsEntryType)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !7, line: 422, baseType: !20)
!756 = !DIGlobalVariable(name: "StatsSubEntryType", scope: !0, file: !352, line: 531, type: !755, isLocal: true, isDefinition: true, variable: %struct._typeobject* @StatsSubEntryType)
!757 = !DIGlobalVariable(name: "_lsprofmodule", scope: !0, file: !352, line: 850, type: !758, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @_lsprofmodule)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !759, line: 47, size: 832, align: 64, elements: !760)
!759 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!760 = !{!761, !770, !771, !772, !773, !774, !775, !776, !777}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !758, file: !759, line: 48, baseType: !762, size: 320, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !759, line: 38, baseType: !763)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !759, line: 33, size: 320, align: 64, elements: !764)
!764 = !{!765, !766, !768, !769}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !763, file: !759, line: 34, baseType: !6, size: 128, align: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !763, file: !759, line: 35, baseType: !767, size: 64, align: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !763, file: !759, line: 36, baseType: !11, size: 64, align: 64, offset: 192)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !763, file: !759, line: 37, baseType: !5, size: 64, align: 64, offset: 256)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !758, file: !759, line: 49, baseType: !29, size: 64, align: 64, offset: 320)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !758, file: !759, line: 50, baseType: !29, size: 64, align: 64, offset: 384)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !758, file: !759, line: 51, baseType: !11, size: 64, align: 64, offset: 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !758, file: !759, line: 52, baseType: !415, size: 64, align: 64, offset: 512)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !758, file: !759, line: 53, baseType: !142, size: 64, align: 64, offset: 576)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !758, file: !759, line: 54, baseType: !259, size: 64, align: 64, offset: 640)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !758, file: !759, line: 55, baseType: !142, size: 64, align: 64, offset: 704)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !758, file: !759, line: 56, baseType: !329, size: 64, align: 64, offset: 768)
!778 = !DIGlobalVariable(name: "moduleMethods", scope: !0, file: !352, line: 845, type: !779, isLocal: true, isDefinition: true, variable: [1 x %struct.PyMethodDef]* @moduleMethods)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 256, align: 64, elements: !82)
!780 = !DIGlobalVariable(name: "PyProfiler_Type", scope: !0, file: !352, line: 803, type: !755, isLocal: true, isDefinition: true, variable: %struct._typeobject* @PyProfiler_Type)
!781 = !DIGlobalVariable(name: "profiler_doc", scope: !0, file: !352, line: 793, type: !782, isLocal: true, isDefinition: true, variable: [359 x i8]* @profiler_doc)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 2872, align: 8, elements: !783)
!783 = !{!784}
!784 = !DISubrange(count: 359)
!785 = !DIGlobalVariable(name: "profiler_methods", scope: !0, file: !352, line: 781, type: !786, isLocal: true, isDefinition: true, variable: [5 x %struct.PyMethodDef]* @profiler_methods)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 1280, align: 64, elements: !787)
!787 = !{!788}
!788 = !DISubrange(count: 5)
!789 = !DIGlobalVariable(name: "getstats_doc", scope: !0, file: !352, line: 601, type: !790, isLocal: true, isDefinition: true, variable: [773 x i8]* @getstats_doc)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 6184, align: 8, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 773)
!793 = !DIGlobalVariable(name: "kwlist", scope: !554, file: !352, line: 684, type: !794, isLocal: true, isDefinition: true, variable: [3 x i8*]* @profiler_enable.kwlist)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 192, align: 64, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 3)
!797 = !DIGlobalVariable(name: "enable_doc", scope: !0, file: !352, line: 669, type: !798, isLocal: true, isDefinition: true, variable: [285 x i8]* @enable_doc)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 2280, align: 8, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 285)
!801 = !DIGlobalVariable(name: "disable_doc", scope: !0, file: !352, line: 712, type: !802, isLocal: true, isDefinition: true, variable: [51 x i8]* @disable_doc)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 408, align: 8, elements: !803)
!803 = !{!804}
!804 = !DISubrange(count: 51)
!805 = !DIGlobalVariable(name: "clear_doc", scope: !0, file: !352, line: 730, type: !806, isLocal: true, isDefinition: true, variable: [60 x i8]* @clear_doc)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 480, align: 8, elements: !807)
!807 = !{!808}
!808 = !DISubrange(count: 60)
!809 = !DIGlobalVariable(name: "kwlist", scope: !732, file: !352, line: 763, type: !810, isLocal: true, isDefinition: true, variable: [5 x i8*]* @profiler_init.kwlist)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 320, align: 64, elements: !787)
!811 = !DIGlobalVariable(name: "profiler_entry_desc", scope: !0, file: !352, line: 515, type: !812, isLocal: true, isDefinition: true, variable: %struct.PyStructSequence_Desc* @profiler_entry_desc)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStructSequence_Desc", file: !813, line: 20, baseType: !814)
!813 = !DIFile(filename: "./Include/structseq.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyStructSequence_Desc", file: !813, line: 15, size: 256, align: 64, elements: !815)
!815 = !{!816, !817, !818, !824}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !814, file: !813, line: 16, baseType: !52, size: 64, align: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !814, file: !813, line: 17, baseType: !52, size: 64, align: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "fields", scope: !814, file: !813, line: 18, baseType: !819, size: 64, align: 64, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64, align: 64)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyStructSequence_Field", file: !813, line: 10, size: 128, align: 64, elements: !821)
!821 = !{!822, !823}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !820, file: !813, line: 11, baseType: !52, size: 64, align: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !820, file: !813, line: 12, baseType: !52, size: 64, align: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "n_in_sequence", scope: !814, file: !813, line: 19, baseType: !44, size: 32, align: 32, offset: 192)
!825 = !DIGlobalVariable(name: "profiler_entry_fields", scope: !0, file: !352, line: 496, type: !826, isLocal: true, isDefinition: true, variable: [7 x %struct.PyStructSequence_Field]* @profiler_entry_fields)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 896, align: 64, elements: !828)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStructSequence_Field", file: !813, line: 13, baseType: !820)
!828 = !{!829}
!829 = !DISubrange(count: 7)
!830 = !DIGlobalVariable(name: "profiler_subentry_desc", scope: !0, file: !352, line: 522, type: !812, isLocal: true, isDefinition: true, variable: %struct.PyStructSequence_Desc* @profiler_subentry_desc)
!831 = !DIGlobalVariable(name: "profiler_subentry_fields", scope: !0, file: !352, line: 506, type: !832, isLocal: true, isDefinition: true, variable: [6 x %struct.PyStructSequence_Field]* @profiler_subentry_fields)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 768, align: 64, elements: !833)
!833 = !{!834}
!834 = !DISubrange(count: 6)
!835 = !{i32 2, !"Dwarf Version", i32 4}
!836 = !{i32 2, !"Debug Info Version", i32 3}
!837 = !{i32 1, !"PIC Level", i32 2}
!838 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!839 = !DILocation(line: 865, column: 5, scope: !420)
!840 = !DIExpression()
!841 = !DILocation(line: 865, column: 15, scope: !420)
!842 = !DILocation(line: 865, column: 24, scope: !420)
!843 = !DILocation(line: 866, column: 14, scope: !420)
!844 = !DILocation(line: 866, column: 12, scope: !420)
!845 = !{!846, !846, i64 0}
!846 = !{!"any pointer", !847, i64 0}
!847 = !{!"omnipotent char", !848, i64 0}
!848 = !{!"Simple C/C++ TBAA"}
!849 = !DILocation(line: 867, column: 9, scope: !850)
!850 = distinct !DILexicalBlock(scope: !420, file: !352, line: 867, column: 9)
!851 = !DILocation(line: 867, column: 16, scope: !850)
!852 = !DILocation(line: 867, column: 9, scope: !420)
!853 = !DILocation(line: 868, column: 9, scope: !850)
!854 = !DILocation(line: 869, column: 26, scope: !420)
!855 = !DILocation(line: 869, column: 9, scope: !420)
!856 = !DILocation(line: 869, column: 7, scope: !420)
!857 = !DILocation(line: 870, column: 9, scope: !858)
!858 = distinct !DILexicalBlock(scope: !420, file: !352, line: 870, column: 9)
!859 = !DILocation(line: 870, column: 40, scope: !858)
!860 = !DILocation(line: 870, column: 9, scope: !420)
!861 = !DILocation(line: 871, column: 9, scope: !858)
!862 = !DILocation(line: 872, column: 26, scope: !420)
!863 = !DILocation(line: 872, column: 5, scope: !420)
!864 = !DILocation(line: 874, column: 10, scope: !865)
!865 = distinct !DILexicalBlock(scope: !420, file: !352, line: 874, column: 9)
!866 = !{!867, !867, i64 0}
!867 = !{!"int", !847, i64 0}
!868 = !DILocation(line: 874, column: 9, scope: !420)
!869 = !DILocation(line: 875, column: 13, scope: !870)
!870 = distinct !DILexicalBlock(scope: !871, file: !352, line: 875, column: 13)
!871 = distinct !DILexicalBlock(scope: !865, file: !352, line: 874, column: 23)
!872 = !DILocation(line: 876, column: 62, scope: !870)
!873 = !DILocation(line: 875, column: 13, scope: !871)
!874 = !DILocation(line: 877, column: 13, scope: !870)
!875 = !DILocation(line: 878, column: 13, scope: !876)
!876 = distinct !DILexicalBlock(scope: !871, file: !352, line: 878, column: 13)
!877 = !DILocation(line: 879, column: 65, scope: !876)
!878 = !DILocation(line: 878, column: 13, scope: !871)
!879 = !DILocation(line: 880, column: 13, scope: !876)
!880 = !DILocation(line: 881, column: 5, scope: !871)
!881 = !DILocation(line: 882, column: 61, scope: !420)
!882 = !{!883, !884, i64 0}
!883 = !{!"_object", !884, i64 0, !846, i64 8}
!884 = !{!"long", !847, i64 0}
!885 = !DILocation(line: 883, column: 64, scope: !420)
