; ModuleID = 'programs_new/Python-new/_operator.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !439, globals: !983)
!1 = !DIFile(filename: "_operator.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !12, !350, !368, !376, !395, !397, !401, !409, !410, !394, !418, !420, !422, !424, !431}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !14, line: 109, baseType: !15)
!14 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !14, line: 105, size: 128, align: 64, elements: !16)
!16 = !{!17, !25}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !15, file: !14, line: 107, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !19, line: 177, baseType: !20)
!19 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !21, line: 102, baseType: !22)
!21 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !23, line: 181, baseType: !24)
!23 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!24 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !15, file: !14, line: 108, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !14, line: 334, size: 3200, align: 64, elements: !28)
!28 = !{!29, !35, !39, !40, !41, !46, !109, !114, !119, !120, !125, !177, !208, !220, !226, !227, !228, !230, !232, !263, !264, !265, !274, !275, !280, !281, !283, !285, !295, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !27, file: !14, line: 335, baseType: !30, size: 192, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !14, line: 114, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 111, size: 192, align: 64, elements: !32)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !14, line: 112, baseType: !13, size: 128, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !31, file: !14, line: 113, baseType: !18, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !27, file: !14, line: 336, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !27, file: !14, line: 341, baseType: !42, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !14, line: 308, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !12}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !27, file: !14, line: 342, baseType: !47, size: 64, align: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !14, line: 314, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !12, !52, !51}
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !21, line: 48, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !55, line: 246, size: 1728, align: 64, elements: !56)
!55 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!56 = !{!57, !58, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !78, !79, !80, !81, !83, !85, !87, !91, !94, !96, !97, !98, !99, !100, !104, !105}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !54, file: !55, line: 247, baseType: !51, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !54, file: !55, line: 252, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !54, file: !55, line: 253, baseType: !59, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !54, file: !55, line: 254, baseType: !59, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !54, file: !55, line: 255, baseType: !59, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !54, file: !55, line: 256, baseType: !59, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !54, file: !55, line: 257, baseType: !59, size: 64, align: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !54, file: !55, line: 258, baseType: !59, size: 64, align: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !54, file: !55, line: 259, baseType: !59, size: 64, align: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !54, file: !55, line: 261, baseType: !59, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !54, file: !55, line: 262, baseType: !59, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !54, file: !55, line: 263, baseType: !59, size: 64, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !54, file: !55, line: 265, baseType: !71, size: 64, align: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !55, line: 161, size: 192, align: 64, elements: !73)
!73 = !{!74, !75, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !72, file: !55, line: 162, baseType: !71, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !72, file: !55, line: 163, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !72, file: !55, line: 167, baseType: !51, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !54, file: !55, line: 267, baseType: !76, size: 64, align: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !54, file: !55, line: 269, baseType: !51, size: 32, align: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !54, file: !55, line: 273, baseType: !51, size: 32, align: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !54, file: !55, line: 275, baseType: !82, size: 64, align: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !23, line: 140, baseType: !24)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !54, file: !55, line: 279, baseType: !84, size: 16, align: 16, offset: 1024)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !54, file: !55, line: 280, baseType: !86, size: 8, align: 8, offset: 1040)
!86 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !54, file: !55, line: 281, baseType: !88, size: 8, align: 8, offset: 1048)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !54, file: !55, line: 285, baseType: !92, size: 64, align: 64, offset: 1088)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !55, line: 155, baseType: null)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !54, file: !55, line: 294, baseType: !95, size: 64, align: 64, offset: 1152)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !23, line: 141, baseType: !24)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !54, file: !55, line: 303, baseType: !11, size: 64, align: 64, offset: 1216)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !54, file: !55, line: 304, baseType: !11, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !54, file: !55, line: 305, baseType: !11, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !54, file: !55, line: 306, baseType: !11, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !54, file: !55, line: 307, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !54, file: !55, line: 309, baseType: !51, size: 32, align: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !54, file: !55, line: 311, baseType: !106, size: 160, align: 8, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !27, file: !14, line: 343, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !14, line: 316, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!12, !12, !59}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !27, file: !14, line: 344, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !14, line: 318, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!51, !12, !59, !12}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !27, file: !14, line: 345, baseType: !11, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !27, file: !14, line: 346, baseType: !121, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !14, line: 320, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!12, !12}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !27, file: !14, line: 350, baseType: !126, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !14, line: 278, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 236, size: 2176, align: 64, elements: !129)
!129 = !{!130, !135, !136, !137, !138, !139, !144, !146, !147, !148, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !128, file: !14, line: 241, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !14, line: 166, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!12, !12, !12}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !128, file: !14, line: 242, baseType: !131, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !128, file: !14, line: 243, baseType: !131, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !128, file: !14, line: 244, baseType: !131, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !128, file: !14, line: 245, baseType: !131, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !128, file: !14, line: 246, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !14, line: 167, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!12, !12, !12, !12}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !128, file: !14, line: 247, baseType: !145, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !14, line: 165, baseType: !122)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !128, file: !14, line: 248, baseType: !145, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !128, file: !14, line: 249, baseType: !145, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !128, file: !14, line: 250, baseType: !149, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !14, line: 168, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!51, !12}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !128, file: !14, line: 251, baseType: !145, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !128, file: !14, line: 252, baseType: !131, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !128, file: !14, line: 253, baseType: !131, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !128, file: !14, line: 254, baseType: !131, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !128, file: !14, line: 255, baseType: !131, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !128, file: !14, line: 256, baseType: !131, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !128, file: !14, line: 257, baseType: !145, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !128, file: !14, line: 258, baseType: !11, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !128, file: !14, line: 259, baseType: !145, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !128, file: !14, line: 261, baseType: !131, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !128, file: !14, line: 262, baseType: !131, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !128, file: !14, line: 263, baseType: !131, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !128, file: !14, line: 264, baseType: !131, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !128, file: !14, line: 265, baseType: !140, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !128, file: !14, line: 266, baseType: !131, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !128, file: !14, line: 267, baseType: !131, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !128, file: !14, line: 268, baseType: !131, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !128, file: !14, line: 269, baseType: !131, size: 64, align: 64, offset: 1728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !128, file: !14, line: 270, baseType: !131, size: 64, align: 64, offset: 1792)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !128, file: !14, line: 272, baseType: !131, size: 64, align: 64, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !128, file: !14, line: 273, baseType: !131, size: 64, align: 64, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !128, file: !14, line: 274, baseType: !131, size: 64, align: 64, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !128, file: !14, line: 275, baseType: !131, size: 64, align: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !128, file: !14, line: 277, baseType: !145, size: 64, align: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !27, file: !14, line: 351, baseType: !178, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !14, line: 292, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 280, size: 640, align: 64, elements: !181)
!181 = !{!182, !187, !188, !193, !194, !195, !200, !201, !206, !207}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !180, file: !14, line: 281, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !14, line: 169, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!18, !12}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !180, file: !14, line: 282, baseType: !131, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !180, file: !14, line: 283, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !14, line: 170, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!12, !12, !18}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !180, file: !14, line: 284, baseType: !189, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !180, file: !14, line: 285, baseType: !11, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !180, file: !14, line: 286, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !14, line: 172, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!51, !12, !18, !12}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !180, file: !14, line: 287, baseType: !11, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !180, file: !14, line: 288, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !14, line: 231, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!51, !12, !12}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !180, file: !14, line: 290, baseType: !131, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !180, file: !14, line: 291, baseType: !189, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !27, file: !14, line: 352, baseType: !209, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !14, line: 298, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 294, size: 192, align: 64, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !211, file: !14, line: 295, baseType: !183, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !211, file: !14, line: 296, baseType: !131, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !211, file: !14, line: 297, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !14, line: 174, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!51, !12, !12, !12}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !27, file: !14, line: 356, baseType: !221, size: 64, align: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !14, line: 321, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !12}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !19, line: 186, baseType: !18)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !27, file: !14, line: 357, baseType: !140, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !27, file: !14, line: 358, baseType: !121, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !27, file: !14, line: 359, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !14, line: 317, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !27, file: !14, line: 360, baseType: !231, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !14, line: 319, baseType: !217)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !27, file: !14, line: 363, baseType: !233, size: 64, align: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !14, line: 304, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 301, size: 128, align: 64, elements: !236)
!236 = !{!237, !258}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !235, file: !14, line: 302, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !14, line: 193, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!51, !12, !242, !51}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !14, line: 191, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !14, line: 178, size: 640, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !255, !256, !257}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !244, file: !14, line: 179, baseType: !11, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !244, file: !14, line: 180, baseType: !12, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !14, line: 181, baseType: !18, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !244, file: !14, line: 182, baseType: !18, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !244, file: !14, line: 184, baseType: !51, size: 32, align: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !244, file: !14, line: 185, baseType: !51, size: 32, align: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !244, file: !14, line: 186, baseType: !59, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !244, file: !14, line: 187, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !244, file: !14, line: 188, baseType: !254, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !244, file: !14, line: 189, baseType: !254, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !244, file: !14, line: 190, baseType: !11, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !235, file: !14, line: 303, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !14, line: 194, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !12, !242}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !27, file: !14, line: 366, baseType: !103, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !27, file: !14, line: 368, baseType: !36, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !27, file: !14, line: 372, baseType: !266, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !14, line: 233, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!51, !12, !270, !11}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !14, line: 232, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!51, !12, !11}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !27, file: !14, line: 375, baseType: !149, size: 64, align: 64, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !27, file: !14, line: 379, baseType: !276, size: 64, align: 64, offset: 1600)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !14, line: 322, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!12, !12, !12, !51}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !27, file: !14, line: 382, baseType: !18, size: 64, align: 64, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !27, file: !14, line: 385, baseType: !282, size: 64, align: 64, offset: 1728)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !14, line: 323, baseType: !122)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !27, file: !14, line: 386, baseType: !284, size: 64, align: 64, offset: 1792)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !14, line: 324, baseType: !122)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !27, file: !14, line: 389, baseType: !286, size: 64, align: 64, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 40, size: 256, align: 64, elements: !289)
!288 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 41, baseType: !36, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 18, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 43, baseType: !51, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 45, baseType: !36, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !27, file: !14, line: 390, baseType: !296, size: 64, align: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !14, line: 390, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !27, file: !14, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !59, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!12, !12, !11}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!51, !12, !12, !11}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !59, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !11, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !27, file: !14, line: 392, baseType: !26, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !27, file: !14, line: 393, baseType: !12, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !27, file: !14, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !14, line: 325, baseType: !141)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !27, file: !14, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !14, line: 326, baseType: !217)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !27, file: !14, line: 396, baseType: !18, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !27, file: !14, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !14, line: 327, baseType: !217)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !27, file: !14, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !14, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!12, !26, !18}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !27, file: !14, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !14, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!12, !26, !12, !12}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !27, file: !14, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !14, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !11}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !27, file: !14, line: 401, baseType: !149, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !27, file: !14, line: 402, baseType: !12, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !27, file: !14, line: 403, baseType: !12, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !27, file: !14, line: 404, baseType: !12, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !27, file: !14, line: 405, baseType: !12, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !27, file: !14, line: 406, baseType: !12, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !27, file: !14, line: 407, baseType: !42, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !27, file: !14, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !27, file: !14, line: 412, baseType: !42, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !352)
!352 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !353)
!353 = !{!354, !355, !356, !357, !365}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !352, file: !4, line: 291, baseType: !13, size: 128, align: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !352, file: !4, line: 292, baseType: !18, size: 64, align: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !352, file: !4, line: 293, baseType: !225, size: 64, align: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !352, file: !4, line: 349, baseType: !358, size: 32, align: 32, offset: 256)
!358 = !DICompositeType(tag: DW_TAG_structure_type, scope: !352, file: !4, line: 294, size: 32, align: 32, elements: !359)
!359 = !{!360, !361, !362, !363, !364}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !358, file: !4, line: 303, baseType: !348, size: 2, align: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !358, file: !4, line: 331, baseType: !348, size: 3, align: 32, offset: 2)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !358, file: !4, line: 336, baseType: !348, size: 1, align: 32, offset: 5)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !358, file: !4, line: 340, baseType: !348, size: 1, align: 32, offset: 6)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !358, file: !4, line: 345, baseType: !348, size: 1, align: 32, offset: 7)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !352, file: !4, line: 350, baseType: !366, size: 64, align: 64, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !102, line: 90, baseType: !51)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !370)
!370 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !371)
!371 = !{!372, !373, !374, !375}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !370, file: !4, line: 357, baseType: !351, size: 384, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !370, file: !4, line: 358, baseType: !18, size: 64, align: 64, offset: 384)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !370, file: !4, line: 360, baseType: !59, size: 64, align: 64, offset: 448)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !370, file: !4, line: 361, baseType: !18, size: 64, align: 64, offset: 512)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !378)
!378 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !379)
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !378, file: !4, line: 369, baseType: !369, size: 576, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !378, file: !4, line: 375, baseType: !382, size: 64, align: 64, offset: 576)
!382 = !DICompositeType(tag: DW_TAG_union_type, scope: !378, file: !4, line: 370, size: 64, align: 64, elements: !383)
!383 = !{!384, !385, !389, !392}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !382, file: !4, line: 371, baseType: !11, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !382, file: !4, line: 372, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !388)
!388 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !382, file: !4, line: 373, baseType: !390, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !84)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !382, file: !4, line: 374, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !348)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !388)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !403, line: 33, baseType: !404)
!403 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!404 = !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 25, size: 256, align: 64, elements: !405)
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !404, file: !403, line: 26, baseType: !30, size: 192, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !404, file: !403, line: 27, baseType: !408, size: 64, align: 64, offset: 192)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, align: 64, elements: !89)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "itemgetterobject", file: !412, line: 404, baseType: !413)
!412 = !DIFile(filename: "./Modules/_operator.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!413 = !DICompositeType(tag: DW_TAG_structure_type, file: !412, line: 400, size: 256, align: 64, elements: !414)
!414 = !{!415, !416, !417}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !413, file: !412, line: 401, baseType: !13, size: 128, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "nitems", scope: !413, file: !412, line: 402, baseType: !18, size: 64, align: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !413, file: !412, line: 403, baseType: !12, size: 64, align: 64, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !387)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "attrgetterobject", file: !412, line: 541, baseType: !426)
!426 = !DICompositeType(tag: DW_TAG_structure_type, file: !412, line: 537, size: 256, align: 64, elements: !427)
!427 = !{!428, !429, !430}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !426, file: !412, line: 538, baseType: !13, size: 128, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "nattrs", scope: !426, file: !412, line: 539, baseType: !18, size: 64, align: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !426, file: !412, line: 540, baseType: !12, size: 64, align: 64, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "methodcallerobject", file: !412, line: 796, baseType: !433)
!433 = !DICompositeType(tag: DW_TAG_structure_type, file: !412, line: 791, size: 320, align: 64, elements: !434)
!434 = !{!435, !436, !437, !438}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !433, file: !412, line: 792, baseType: !13, size: 128, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !433, file: !412, line: 793, baseType: !12, size: 64, align: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !433, file: !412, line: 794, baseType: !12, size: 64, align: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "kwds", scope: !433, file: !412, line: 795, baseType: !12, size: 64, align: 64, offset: 256)
!439 = !{!440, !445, !450, !457, !464, !471, !478, !485, !489, !495, !501, !507, !513, !519, !525, !529, !533, !537, !541, !545, !551, !557, !562, !568, !574, !580, !586, !592, !598, !604, !610, !616, !622, !628, !634, !640, !646, !652, !658, !664, !671, !677, !683, !689, !695, !701, !707, !713, !719, !725, !736, !750, !757, !767, !787, !798, !810, !820, !840, !855, !866, !922, !942, !954, !969}
!440 = !DISubprogram(name: "PyInit__operator", scope: !412, file: !412, line: 936, type: !441, isLocal: false, isDefinition: true, scopeLine: 937, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__operator, variables: !443)
!441 = !DISubroutineType(types: !442)
!442 = !{!12}
!443 = !{!444}
!444 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !440, file: !412, line: 938, type: !12)
!445 = !DISubprogram(name: "truth", scope: !412, file: !412, line: 68, type: !133, isLocal: true, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @truth, variables: !446)
!446 = !{!447, !448, !449}
!447 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !445, file: !412, line: 68, type: !12)
!448 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a1", arg: 2, scope: !445, file: !412, line: 68, type: !12)
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !445, file: !412, line: 68, type: !24)
!450 = !DISubprogram(name: "op_contains", scope: !412, file: !412, line: 99, type: !133, isLocal: true, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_contains, variables: !451)
!451 = !{!452, !453, !454, !455, !456}
!452 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !450, file: !412, line: 99, type: !12)
!453 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !450, file: !412, line: 99, type: !12)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !450, file: !412, line: 99, type: !12)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !450, file: !412, line: 99, type: !12)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !450, file: !412, line: 99, type: !24)
!457 = !DISubprogram(name: "indexOf", scope: !412, file: !412, line: 100, type: !133, isLocal: true, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @indexOf, variables: !458)
!458 = !{!459, !460, !461, !462, !463}
!459 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !457, file: !412, line: 100, type: !12)
!460 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !457, file: !412, line: 100, type: !12)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !457, file: !412, line: 100, type: !12)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !457, file: !412, line: 100, type: !12)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !457, file: !412, line: 100, type: !18)
!464 = !DISubprogram(name: "countOf", scope: !412, file: !412, line: 101, type: !133, isLocal: true, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @countOf, variables: !465)
!465 = !{!466, !467, !468, !469, !470}
!466 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !464, file: !412, line: 101, type: !12)
!467 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !464, file: !412, line: 101, type: !12)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !464, file: !412, line: 101, type: !12)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !464, file: !412, line: 101, type: !12)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !464, file: !412, line: 101, type: !18)
!471 = !DISubprogram(name: "is_", scope: !412, file: !412, line: 137, type: !133, isLocal: true, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @is_, variables: !472)
!472 = !{!473, !474, !475, !476, !477}
!473 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !471, file: !412, line: 137, type: !12)
!474 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !471, file: !412, line: 137, type: !12)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !471, file: !412, line: 139, type: !12)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !471, file: !412, line: 139, type: !12)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !471, file: !412, line: 139, type: !12)
!478 = !DISubprogram(name: "is_not", scope: !412, file: !412, line: 148, type: !133, isLocal: true, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @is_not, variables: !479)
!479 = !{!480, !481, !482, !483, !484}
!480 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !478, file: !412, line: 148, type: !12)
!481 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !478, file: !412, line: 148, type: !12)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !478, file: !412, line: 150, type: !12)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !478, file: !412, line: 150, type: !12)
!484 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !478, file: !412, line: 150, type: !12)
!485 = !DISubprogram(name: "op_index", scope: !412, file: !412, line: 131, type: !133, isLocal: true, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_index, variables: !486)
!486 = !{!487, !488}
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !485, file: !412, line: 131, type: !12)
!488 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !485, file: !412, line: 131, type: !12)
!489 = !DISubprogram(name: "op_add", scope: !412, file: !412, line: 69, type: !133, isLocal: true, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_add, variables: !490)
!490 = !{!491, !492, !493, !494}
!491 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !489, file: !412, line: 69, type: !12)
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !489, file: !412, line: 69, type: !12)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !489, file: !412, line: 69, type: !12)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !489, file: !412, line: 69, type: !12)
!495 = !DISubprogram(name: "op_sub", scope: !412, file: !412, line: 70, type: !133, isLocal: true, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_sub, variables: !496)
!496 = !{!497, !498, !499, !500}
!497 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !495, file: !412, line: 70, type: !12)
!498 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !495, file: !412, line: 70, type: !12)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !495, file: !412, line: 70, type: !12)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !495, file: !412, line: 70, type: !12)
!501 = !DISubprogram(name: "op_mul", scope: !412, file: !412, line: 71, type: !133, isLocal: true, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_mul, variables: !502)
!502 = !{!503, !504, !505, !506}
!503 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !501, file: !412, line: 71, type: !12)
!504 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !501, file: !412, line: 71, type: !12)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !501, file: !412, line: 71, type: !12)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !501, file: !412, line: 71, type: !12)
!507 = !DISubprogram(name: "op_floordiv", scope: !412, file: !412, line: 72, type: !133, isLocal: true, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_floordiv, variables: !508)
!508 = !{!509, !510, !511, !512}
!509 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !507, file: !412, line: 72, type: !12)
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !507, file: !412, line: 72, type: !12)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !507, file: !412, line: 72, type: !12)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !507, file: !412, line: 72, type: !12)
!513 = !DISubprogram(name: "op_truediv", scope: !412, file: !412, line: 73, type: !133, isLocal: true, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_truediv, variables: !514)
!514 = !{!515, !516, !517, !518}
!515 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !513, file: !412, line: 73, type: !12)
!516 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !513, file: !412, line: 73, type: !12)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !513, file: !412, line: 73, type: !12)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !513, file: !412, line: 73, type: !12)
!519 = !DISubprogram(name: "op_mod", scope: !412, file: !412, line: 74, type: !133, isLocal: true, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_mod, variables: !520)
!520 = !{!521, !522, !523, !524}
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !519, file: !412, line: 74, type: !12)
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !519, file: !412, line: 74, type: !12)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !519, file: !412, line: 74, type: !12)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !519, file: !412, line: 74, type: !12)
!525 = !DISubprogram(name: "op_neg", scope: !412, file: !412, line: 75, type: !133, isLocal: true, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_neg, variables: !526)
!526 = !{!527, !528}
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !525, file: !412, line: 75, type: !12)
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a1", arg: 2, scope: !525, file: !412, line: 75, type: !12)
!529 = !DISubprogram(name: "op_pos", scope: !412, file: !412, line: 76, type: !133, isLocal: true, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_pos, variables: !530)
!530 = !{!531, !532}
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !529, file: !412, line: 76, type: !12)
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a1", arg: 2, scope: !529, file: !412, line: 76, type: !12)
!533 = !DISubprogram(name: "op_abs", scope: !412, file: !412, line: 77, type: !133, isLocal: true, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_abs, variables: !534)
!534 = !{!535, !536}
!535 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !533, file: !412, line: 77, type: !12)
!536 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a1", arg: 2, scope: !533, file: !412, line: 77, type: !12)
!537 = !DISubprogram(name: "op_inv", scope: !412, file: !412, line: 78, type: !133, isLocal: true, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_inv, variables: !538)
!538 = !{!539, !540}
!539 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !537, file: !412, line: 78, type: !12)
!540 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a1", arg: 2, scope: !537, file: !412, line: 78, type: !12)
!541 = !DISubprogram(name: "op_invert", scope: !412, file: !412, line: 79, type: !133, isLocal: true, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_invert, variables: !542)
!542 = !{!543, !544}
!543 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !541, file: !412, line: 79, type: !12)
!544 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a1", arg: 2, scope: !541, file: !412, line: 79, type: !12)
!545 = !DISubprogram(name: "op_lshift", scope: !412, file: !412, line: 80, type: !133, isLocal: true, isDefinition: true, scopeLine: 80, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_lshift, variables: !546)
!546 = !{!547, !548, !549, !550}
!547 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !545, file: !412, line: 80, type: !12)
!548 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !545, file: !412, line: 80, type: !12)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !545, file: !412, line: 80, type: !12)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !545, file: !412, line: 80, type: !12)
!551 = !DISubprogram(name: "op_rshift", scope: !412, file: !412, line: 81, type: !133, isLocal: true, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_rshift, variables: !552)
!552 = !{!553, !554, !555, !556}
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !551, file: !412, line: 81, type: !12)
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !551, file: !412, line: 81, type: !12)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !551, file: !412, line: 81, type: !12)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !551, file: !412, line: 81, type: !12)
!557 = !DISubprogram(name: "op_not_", scope: !412, file: !412, line: 82, type: !133, isLocal: true, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_not_, variables: !558)
!558 = !{!559, !560, !561}
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !557, file: !412, line: 82, type: !12)
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a1", arg: 2, scope: !557, file: !412, line: 82, type: !12)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !557, file: !412, line: 82, type: !24)
!562 = !DISubprogram(name: "op_and_", scope: !412, file: !412, line: 83, type: !133, isLocal: true, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_and_, variables: !563)
!563 = !{!564, !565, !566, !567}
!564 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !562, file: !412, line: 83, type: !12)
!565 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !562, file: !412, line: 83, type: !12)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !562, file: !412, line: 83, type: !12)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !562, file: !412, line: 83, type: !12)
!568 = !DISubprogram(name: "op_xor", scope: !412, file: !412, line: 84, type: !133, isLocal: true, isDefinition: true, scopeLine: 84, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_xor, variables: !569)
!569 = !{!570, !571, !572, !573}
!570 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !568, file: !412, line: 84, type: !12)
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !568, file: !412, line: 84, type: !12)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !568, file: !412, line: 84, type: !12)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !568, file: !412, line: 84, type: !12)
!574 = !DISubprogram(name: "op_or_", scope: !412, file: !412, line: 85, type: !133, isLocal: true, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_or_, variables: !575)
!575 = !{!576, !577, !578, !579}
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !574, file: !412, line: 85, type: !12)
!577 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !574, file: !412, line: 85, type: !12)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !574, file: !412, line: 85, type: !12)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !574, file: !412, line: 85, type: !12)
!580 = !DISubprogram(name: "op_iadd", scope: !412, file: !412, line: 86, type: !133, isLocal: true, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_iadd, variables: !581)
!581 = !{!582, !583, !584, !585}
!582 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !580, file: !412, line: 86, type: !12)
!583 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !580, file: !412, line: 86, type: !12)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !580, file: !412, line: 86, type: !12)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !580, file: !412, line: 86, type: !12)
!586 = !DISubprogram(name: "op_isub", scope: !412, file: !412, line: 87, type: !133, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_isub, variables: !587)
!587 = !{!588, !589, !590, !591}
!588 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !586, file: !412, line: 87, type: !12)
!589 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !586, file: !412, line: 87, type: !12)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !586, file: !412, line: 87, type: !12)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !586, file: !412, line: 87, type: !12)
!592 = !DISubprogram(name: "op_imul", scope: !412, file: !412, line: 88, type: !133, isLocal: true, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_imul, variables: !593)
!593 = !{!594, !595, !596, !597}
!594 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !592, file: !412, line: 88, type: !12)
!595 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !592, file: !412, line: 88, type: !12)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !592, file: !412, line: 88, type: !12)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !592, file: !412, line: 88, type: !12)
!598 = !DISubprogram(name: "op_ifloordiv", scope: !412, file: !412, line: 89, type: !133, isLocal: true, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_ifloordiv, variables: !599)
!599 = !{!600, !601, !602, !603}
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !598, file: !412, line: 89, type: !12)
!601 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !598, file: !412, line: 89, type: !12)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !598, file: !412, line: 89, type: !12)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !598, file: !412, line: 89, type: !12)
!604 = !DISubprogram(name: "op_itruediv", scope: !412, file: !412, line: 90, type: !133, isLocal: true, isDefinition: true, scopeLine: 90, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_itruediv, variables: !605)
!605 = !{!606, !607, !608, !609}
!606 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !604, file: !412, line: 90, type: !12)
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !604, file: !412, line: 90, type: !12)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !604, file: !412, line: 90, type: !12)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !604, file: !412, line: 90, type: !12)
!610 = !DISubprogram(name: "op_imod", scope: !412, file: !412, line: 91, type: !133, isLocal: true, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_imod, variables: !611)
!611 = !{!612, !613, !614, !615}
!612 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !610, file: !412, line: 91, type: !12)
!613 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !610, file: !412, line: 91, type: !12)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !610, file: !412, line: 91, type: !12)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !610, file: !412, line: 91, type: !12)
!616 = !DISubprogram(name: "op_ilshift", scope: !412, file: !412, line: 92, type: !133, isLocal: true, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_ilshift, variables: !617)
!617 = !{!618, !619, !620, !621}
!618 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !616, file: !412, line: 92, type: !12)
!619 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !616, file: !412, line: 92, type: !12)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !616, file: !412, line: 92, type: !12)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !616, file: !412, line: 92, type: !12)
!622 = !DISubprogram(name: "op_irshift", scope: !412, file: !412, line: 93, type: !133, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_irshift, variables: !623)
!623 = !{!624, !625, !626, !627}
!624 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !622, file: !412, line: 93, type: !12)
!625 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !622, file: !412, line: 93, type: !12)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !622, file: !412, line: 93, type: !12)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !622, file: !412, line: 93, type: !12)
!628 = !DISubprogram(name: "op_iand", scope: !412, file: !412, line: 94, type: !133, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_iand, variables: !629)
!629 = !{!630, !631, !632, !633}
!630 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !628, file: !412, line: 94, type: !12)
!631 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !628, file: !412, line: 94, type: !12)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !628, file: !412, line: 94, type: !12)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !628, file: !412, line: 94, type: !12)
!634 = !DISubprogram(name: "op_ixor", scope: !412, file: !412, line: 95, type: !133, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_ixor, variables: !635)
!635 = !{!636, !637, !638, !639}
!636 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !634, file: !412, line: 95, type: !12)
!637 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !634, file: !412, line: 95, type: !12)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !634, file: !412, line: 95, type: !12)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !634, file: !412, line: 95, type: !12)
!640 = !DISubprogram(name: "op_ior", scope: !412, file: !412, line: 96, type: !133, isLocal: true, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_ior, variables: !641)
!641 = !{!642, !643, !644, !645}
!642 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !640, file: !412, line: 96, type: !12)
!643 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !640, file: !412, line: 96, type: !12)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !640, file: !412, line: 96, type: !12)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !640, file: !412, line: 96, type: !12)
!646 = !DISubprogram(name: "op_concat", scope: !412, file: !412, line: 97, type: !133, isLocal: true, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_concat, variables: !647)
!647 = !{!648, !649, !650, !651}
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !646, file: !412, line: 97, type: !12)
!649 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !646, file: !412, line: 97, type: !12)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !646, file: !412, line: 97, type: !12)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !646, file: !412, line: 97, type: !12)
!652 = !DISubprogram(name: "op_iconcat", scope: !412, file: !412, line: 98, type: !133, isLocal: true, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_iconcat, variables: !653)
!653 = !{!654, !655, !656, !657}
!654 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !652, file: !412, line: 98, type: !12)
!655 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !652, file: !412, line: 98, type: !12)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !652, file: !412, line: 98, type: !12)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !652, file: !412, line: 98, type: !12)
!658 = !DISubprogram(name: "op_getitem", scope: !412, file: !412, line: 102, type: !133, isLocal: true, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_getitem, variables: !659)
!659 = !{!660, !661, !662, !663}
!660 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !658, file: !412, line: 102, type: !12)
!661 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !658, file: !412, line: 102, type: !12)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !658, file: !412, line: 102, type: !12)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !658, file: !412, line: 102, type: !12)
!664 = !DISubprogram(name: "op_setitem", scope: !412, file: !412, line: 104, type: !133, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_setitem, variables: !665)
!665 = !{!666, !667, !668, !669, !670}
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !664, file: !412, line: 104, type: !12)
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !664, file: !412, line: 104, type: !12)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !664, file: !412, line: 104, type: !12)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !664, file: !412, line: 104, type: !12)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a3", scope: !664, file: !412, line: 104, type: !12)
!671 = !DISubprogram(name: "op_delitem", scope: !412, file: !412, line: 103, type: !133, isLocal: true, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_delitem, variables: !672)
!672 = !{!673, !674, !675, !676}
!673 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !671, file: !412, line: 103, type: !12)
!674 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !671, file: !412, line: 103, type: !12)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !671, file: !412, line: 103, type: !12)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !671, file: !412, line: 103, type: !12)
!677 = !DISubprogram(name: "op_pow", scope: !412, file: !412, line: 113, type: !133, isLocal: true, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_pow, variables: !678)
!678 = !{!679, !680, !681, !682}
!679 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !677, file: !412, line: 113, type: !12)
!680 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !677, file: !412, line: 113, type: !12)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !677, file: !412, line: 115, type: !12)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !677, file: !412, line: 115, type: !12)
!683 = !DISubprogram(name: "op_ipow", scope: !412, file: !412, line: 122, type: !133, isLocal: true, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_ipow, variables: !684)
!684 = !{!685, !686, !687, !688}
!685 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !683, file: !412, line: 122, type: !12)
!686 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !683, file: !412, line: 122, type: !12)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !683, file: !412, line: 124, type: !12)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !683, file: !412, line: 124, type: !12)
!689 = !DISubprogram(name: "op_lt", scope: !412, file: !412, line: 105, type: !133, isLocal: true, isDefinition: true, scopeLine: 105, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_lt, variables: !690)
!690 = !{!691, !692, !693, !694}
!691 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !689, file: !412, line: 105, type: !12)
!692 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !689, file: !412, line: 105, type: !12)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !689, file: !412, line: 105, type: !12)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !689, file: !412, line: 105, type: !12)
!695 = !DISubprogram(name: "op_le", scope: !412, file: !412, line: 106, type: !133, isLocal: true, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_le, variables: !696)
!696 = !{!697, !698, !699, !700}
!697 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !695, file: !412, line: 106, type: !12)
!698 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !695, file: !412, line: 106, type: !12)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !695, file: !412, line: 106, type: !12)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !695, file: !412, line: 106, type: !12)
!701 = !DISubprogram(name: "op_eq", scope: !412, file: !412, line: 107, type: !133, isLocal: true, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_eq, variables: !702)
!702 = !{!703, !704, !705, !706}
!703 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !701, file: !412, line: 107, type: !12)
!704 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !701, file: !412, line: 107, type: !12)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !701, file: !412, line: 107, type: !12)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !701, file: !412, line: 107, type: !12)
!707 = !DISubprogram(name: "op_ne", scope: !412, file: !412, line: 108, type: !133, isLocal: true, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_ne, variables: !708)
!708 = !{!709, !710, !711, !712}
!709 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !707, file: !412, line: 108, type: !12)
!710 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !707, file: !412, line: 108, type: !12)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !707, file: !412, line: 108, type: !12)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !707, file: !412, line: 108, type: !12)
!713 = !DISubprogram(name: "op_gt", scope: !412, file: !412, line: 109, type: !133, isLocal: true, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_gt, variables: !714)
!714 = !{!715, !716, !717, !718}
!715 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !713, file: !412, line: 109, type: !12)
!716 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !713, file: !412, line: 109, type: !12)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !713, file: !412, line: 109, type: !12)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !713, file: !412, line: 109, type: !12)
!719 = !DISubprogram(name: "op_ge", scope: !412, file: !412, line: 110, type: !133, isLocal: true, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @op_ge, variables: !720)
!720 = !{!721, !722, !723, !724}
!721 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !719, file: !412, line: 110, type: !12)
!722 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !719, file: !412, line: 110, type: !12)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a1", scope: !719, file: !412, line: 110, type: !12)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a2", scope: !719, file: !412, line: 110, type: !12)
!725 = !DISubprogram(name: "compare_digest", scope: !412, file: !412, line: 249, type: !133, isLocal: true, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @compare_digest, variables: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !735}
!727 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !725, file: !412, line: 249, type: !12)
!728 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !725, file: !412, line: 249, type: !12)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !725, file: !412, line: 251, type: !12)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !725, file: !412, line: 251, type: !12)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !725, file: !412, line: 252, type: !51)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view_a", scope: !733, file: !412, line: 277, type: !243)
!733 = distinct !DILexicalBlock(scope: !734, file: !412, line: 276, column: 10)
!734 = distinct !DILexicalBlock(scope: !725, file: !412, line: 259, column: 8)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view_b", scope: !733, file: !412, line: 278, type: !243)
!736 = !DISubprogram(name: "_tscmp", scope: !412, file: !412, line: 174, type: !737, isLocal: true, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*, i64, i64)* @_tscmp, variables: !739)
!737 = !DISubroutineType(types: !738)
!738 = !{!51, !395, !395, !18, !18}
!739 = !{!740, !741, !742, !743, !744, !746, !747, !748, !749}
!740 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !736, file: !412, line: 174, type: !395)
!741 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !736, file: !412, line: 174, type: !395)
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len_a", arg: 3, scope: !736, file: !412, line: 175, type: !18)
!743 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len_b", arg: 4, scope: !736, file: !412, line: 175, type: !18)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !736, file: !412, line: 181, type: !745)
!745 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !18)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left", scope: !736, file: !412, line: 182, type: !398)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "right", scope: !736, file: !412, line: 183, type: !398)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !736, file: !412, line: 184, type: !18)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !736, file: !412, line: 185, type: !388)
!750 = !DISubprogram(name: "length_hint", scope: !412, file: !412, line: 221, type: !133, isLocal: true, isDefinition: true, scopeLine: 222, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @length_hint, variables: !751)
!751 = !{!752, !753, !754, !755, !756}
!752 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !750, file: !412, line: 221, type: !12)
!753 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !750, file: !412, line: 221, type: !12)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !750, file: !412, line: 223, type: !12)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "defaultvalue", scope: !750, file: !412, line: 224, type: !18)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !750, file: !412, line: 224, type: !18)
!757 = !DISubprogram(name: "itemgetter_dealloc", scope: !412, file: !412, line: 439, type: !758, isLocal: true, isDefinition: true, scopeLine: 440, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.itemgetterobject*)* @itemgetter_dealloc, variables: !760)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !410}
!760 = !{!761, !762, !764}
!761 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ig", arg: 1, scope: !757, file: !412, line: 439, type: !410)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !763, file: !412, line: 442, type: !12)
!763 = distinct !DILexicalBlock(scope: !757, file: !412, line: 442, column: 8)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !765, file: !412, line: 442, type: !12)
!765 = distinct !DILexicalBlock(scope: !766, file: !412, line: 442, column: 100)
!766 = distinct !DILexicalBlock(scope: !763, file: !412, line: 442, column: 66)
!767 = !DISubprogram(name: "itemgetter_call", scope: !412, file: !412, line: 454, type: !768, isLocal: true, isDefinition: true, scopeLine: 455, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.itemgetterobject*, %struct._object*, %struct._object*)* @itemgetter_call, variables: !770)
!768 = !DISubroutineType(types: !769)
!769 = !{!12, !410, !12, !12}
!770 = !{!771, !772, !773, !774, !775, !776, !777, !778, !782, !783}
!771 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ig", arg: 1, scope: !767, file: !412, line: 454, type: !410)
!772 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !767, file: !412, line: 454, type: !12)
!773 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !767, file: !412, line: 454, type: !12)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !767, file: !412, line: 456, type: !12)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !767, file: !412, line: 456, type: !12)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !767, file: !412, line: 457, type: !18)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nitems", scope: !767, file: !412, line: 457, type: !18)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !779, file: !412, line: 472, type: !12)
!779 = distinct !DILexicalBlock(scope: !780, file: !412, line: 471, column: 34)
!780 = distinct !DILexicalBlock(scope: !781, file: !412, line: 471, column: 5)
!781 = distinct !DILexicalBlock(scope: !767, file: !412, line: 471, column: 5)
!782 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !779, file: !412, line: 472, type: !12)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !784, file: !412, line: 476, type: !12)
!784 = distinct !DILexicalBlock(scope: !785, file: !412, line: 476, column: 16)
!785 = distinct !DILexicalBlock(scope: !786, file: !412, line: 475, column: 32)
!786 = distinct !DILexicalBlock(scope: !779, file: !412, line: 475, column: 13)
!787 = !DISubprogram(name: "itemgetter_traverse", scope: !412, file: !412, line: 447, type: !788, isLocal: true, isDefinition: true, scopeLine: 448, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.itemgetterobject*, i32 (%struct._object*, i8*)*, i8*)* @itemgetter_traverse, variables: !790)
!788 = !DISubroutineType(types: !789)
!789 = !{!51, !410, !270, !11}
!790 = !{!791, !792, !793, !794}
!791 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ig", arg: 1, scope: !787, file: !412, line: 447, type: !410)
!792 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !787, file: !412, line: 447, type: !270)
!793 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !787, file: !412, line: 447, type: !11)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !795, file: !412, line: 449, type: !51)
!795 = distinct !DILexicalBlock(scope: !796, file: !412, line: 449, column: 24)
!796 = distinct !DILexicalBlock(scope: !797, file: !412, line: 449, column: 14)
!797 = distinct !DILexicalBlock(scope: !787, file: !412, line: 449, column: 8)
!798 = !DISubprogram(name: "itemgetter_new", scope: !412, file: !412, line: 409, type: !799, isLocal: true, isDefinition: true, scopeLine: 410, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @itemgetter_new, variables: !803)
!799 = !DISubroutineType(types: !800)
!800 = !{!12, !801, !12, !12}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64, align: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !14, line: 422, baseType: !27)
!803 = !{!804, !805, !806, !807, !808, !809}
!804 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !798, file: !412, line: 409, type: !801)
!805 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !798, file: !412, line: 409, type: !12)
!806 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !798, file: !412, line: 409, type: !12)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ig", scope: !798, file: !412, line: 411, type: !410)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !798, file: !412, line: 412, type: !12)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nitems", scope: !798, file: !412, line: 413, type: !18)
!810 = !DISubprogram(name: "attrgetter_dealloc", scope: !412, file: !412, line: 658, type: !811, isLocal: true, isDefinition: true, scopeLine: 659, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.attrgetterobject*)* @attrgetter_dealloc, variables: !813)
!811 = !DISubroutineType(types: !812)
!812 = !{null, !424}
!813 = !{!814, !815, !817}
!814 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ag", arg: 1, scope: !810, file: !412, line: 658, type: !424)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !816, file: !412, line: 661, type: !12)
!816 = distinct !DILexicalBlock(scope: !810, file: !412, line: 661, column: 8)
!817 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !818, file: !412, line: 661, type: !12)
!818 = distinct !DILexicalBlock(scope: !819, file: !412, line: 661, column: 100)
!819 = distinct !DILexicalBlock(scope: !816, file: !412, line: 661, column: 66)
!820 = !DISubprogram(name: "attrgetter_call", scope: !412, file: !412, line: 706, type: !821, isLocal: true, isDefinition: true, scopeLine: 707, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.attrgetterobject*, %struct._object*, %struct._object*)* @attrgetter_call, variables: !823)
!821 = !DISubroutineType(types: !822)
!822 = !{!12, !424, !12, !12}
!823 = !{!824, !825, !826, !827, !828, !829, !830, !831, !835, !836}
!824 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ag", arg: 1, scope: !820, file: !412, line: 706, type: !424)
!825 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !820, file: !412, line: 706, type: !12)
!826 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kw", arg: 3, scope: !820, file: !412, line: 706, type: !12)
!827 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !820, file: !412, line: 708, type: !12)
!828 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !820, file: !412, line: 708, type: !12)
!829 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !820, file: !412, line: 709, type: !18)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nattrs", scope: !820, file: !412, line: 709, type: !18)
!831 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "attr", scope: !832, file: !412, line: 724, type: !12)
!832 = distinct !DILexicalBlock(scope: !833, file: !412, line: 723, column: 34)
!833 = distinct !DILexicalBlock(scope: !834, file: !412, line: 723, column: 5)
!834 = distinct !DILexicalBlock(scope: !820, file: !412, line: 723, column: 5)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !832, file: !412, line: 724, type: !12)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !837, file: !412, line: 728, type: !12)
!837 = distinct !DILexicalBlock(scope: !838, file: !412, line: 728, column: 16)
!838 = distinct !DILexicalBlock(scope: !839, file: !412, line: 727, column: 32)
!839 = distinct !DILexicalBlock(scope: !832, file: !412, line: 727, column: 13)
!840 = !DISubprogram(name: "dotted_getattr", scope: !412, file: !412, line: 673, type: !133, isLocal: true, isDefinition: true, scopeLine: 674, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @dotted_getattr, variables: !841)
!841 = !{!842, !843, !844, !845, !848, !849, !850}
!842 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !840, file: !412, line: 673, type: !12)
!843 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attr", arg: 2, scope: !840, file: !412, line: 673, type: !12)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newobj", scope: !840, file: !412, line: 675, type: !12)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name_idx", scope: !846, file: !412, line: 680, type: !18)
!846 = distinct !DILexicalBlock(scope: !847, file: !412, line: 679, column: 60)
!847 = distinct !DILexicalBlock(scope: !840, file: !412, line: 679, column: 9)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name_count", scope: !846, file: !412, line: 680, type: !18)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "attr_name", scope: !846, file: !412, line: 681, type: !12)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !851, file: !412, line: 688, type: !12)
!851 = distinct !DILexicalBlock(scope: !852, file: !412, line: 688, column: 16)
!852 = distinct !DILexicalBlock(scope: !853, file: !412, line: 685, column: 63)
!853 = distinct !DILexicalBlock(scope: !854, file: !412, line: 685, column: 9)
!854 = distinct !DILexicalBlock(scope: !846, file: !412, line: 685, column: 9)
!855 = !DISubprogram(name: "attrgetter_traverse", scope: !412, file: !412, line: 666, type: !856, isLocal: true, isDefinition: true, scopeLine: 667, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.attrgetterobject*, i32 (%struct._object*, i8*)*, i8*)* @attrgetter_traverse, variables: !858)
!856 = !DISubroutineType(types: !857)
!857 = !{!51, !424, !270, !11}
!858 = !{!859, !860, !861, !862}
!859 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ag", arg: 1, scope: !855, file: !412, line: 666, type: !424)
!860 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !855, file: !412, line: 666, type: !270)
!861 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !855, file: !412, line: 666, type: !11)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !863, file: !412, line: 668, type: !51)
!863 = distinct !DILexicalBlock(scope: !864, file: !412, line: 668, column: 24)
!864 = distinct !DILexicalBlock(scope: !865, file: !412, line: 668, column: 14)
!865 = distinct !DILexicalBlock(scope: !855, file: !412, line: 668, column: 8)
!866 = !DISubprogram(name: "attrgetter_new", scope: !412, file: !412, line: 546, type: !799, isLocal: true, isDefinition: true, scopeLine: 547, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @attrgetter_new, variables: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !880, !881, !882, !883, !884, !888, !892, !895, !896, !897, !898, !899, !903, !910, !912, !916, !918}
!868 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !866, file: !412, line: 546, type: !801)
!869 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !866, file: !412, line: 546, type: !12)
!870 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !866, file: !412, line: 546, type: !12)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ag", scope: !866, file: !412, line: 548, type: !424)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "attr", scope: !866, file: !412, line: 549, type: !12)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nattrs", scope: !866, file: !412, line: 550, type: !18)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !866, file: !412, line: 550, type: !18)
!875 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "char_idx", scope: !866, file: !412, line: 550, type: !18)
