; ModuleID = 'programs_new/Python-new/_pickle.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82}
!18 = !DIEnumerator(name: "MARK", value: 40)
!19 = !DIEnumerator(name: "STOP", value: 46)
!20 = !DIEnumerator(name: "POP", value: 48)
!21 = !DIEnumerator(name: "POP_MARK", value: 49)
!22 = !DIEnumerator(name: "DUP", value: 50)
!23 = !DIEnumerator(name: "FLOAT", value: 70)
!24 = !DIEnumerator(name: "INT", value: 73)
!25 = !DIEnumerator(name: "BININT", value: 74)
!26 = !DIEnumerator(name: "BININT1", value: 75)
!27 = !DIEnumerator(name: "LONG", value: 76)
!28 = !DIEnumerator(name: "BININT2", value: 77)
!29 = !DIEnumerator(name: "NONE", value: 78)
!30 = !DIEnumerator(name: "PERSID", value: 80)
!31 = !DIEnumerator(name: "BINPERSID", value: 81)
!32 = !DIEnumerator(name: "REDUCE", value: 82)
!33 = !DIEnumerator(name: "STRING", value: 83)
!34 = !DIEnumerator(name: "BINSTRING", value: 84)
!35 = !DIEnumerator(name: "SHORT_BINSTRING", value: 85)
!36 = !DIEnumerator(name: "UNICODE", value: 86)
!37 = !DIEnumerator(name: "BINUNICODE", value: 88)
!38 = !DIEnumerator(name: "APPEND", value: 97)
!39 = !DIEnumerator(name: "BUILD", value: 98)
!40 = !DIEnumerator(name: "GLOBAL", value: 99)
!41 = !DIEnumerator(name: "DICT", value: 100)
!42 = !DIEnumerator(name: "EMPTY_DICT", value: 125)
!43 = !DIEnumerator(name: "APPENDS", value: 101)
!44 = !DIEnumerator(name: "GET", value: 103)
!45 = !DIEnumerator(name: "BINGET", value: 104)
!46 = !DIEnumerator(name: "INST", value: 105)
!47 = !DIEnumerator(name: "LONG_BINGET", value: 106)
!48 = !DIEnumerator(name: "LIST", value: 108)
!49 = !DIEnumerator(name: "EMPTY_LIST", value: 93)
!50 = !DIEnumerator(name: "OBJ", value: 111)
!51 = !DIEnumerator(name: "PUT", value: 112)
!52 = !DIEnumerator(name: "BINPUT", value: 113)
!53 = !DIEnumerator(name: "LONG_BINPUT", value: 114)
!54 = !DIEnumerator(name: "SETITEM", value: 115)
!55 = !DIEnumerator(name: "TUPLE", value: 116)
!56 = !DIEnumerator(name: "EMPTY_TUPLE", value: 41)
!57 = !DIEnumerator(name: "SETITEMS", value: 117)
!58 = !DIEnumerator(name: "BINFLOAT", value: 71)
!59 = !DIEnumerator(name: "PROTO", value: -128)
!60 = !DIEnumerator(name: "NEWOBJ", value: -127)
!61 = !DIEnumerator(name: "EXT1", value: -126)
!62 = !DIEnumerator(name: "EXT2", value: -125)
!63 = !DIEnumerator(name: "EXT4", value: -124)
!64 = !DIEnumerator(name: "TUPLE1", value: -123)
!65 = !DIEnumerator(name: "TUPLE2", value: -122)
!66 = !DIEnumerator(name: "TUPLE3", value: -121)
!67 = !DIEnumerator(name: "NEWTRUE", value: -120)
!68 = !DIEnumerator(name: "NEWFALSE", value: -119)
!69 = !DIEnumerator(name: "LONG1", value: -118)
!70 = !DIEnumerator(name: "LONG4", value: -117)
!71 = !DIEnumerator(name: "BINBYTES", value: 66)
!72 = !DIEnumerator(name: "SHORT_BINBYTES", value: 67)
!73 = !DIEnumerator(name: "SHORT_BINUNICODE", value: -116)
!74 = !DIEnumerator(name: "BINUNICODE8", value: -115)
!75 = !DIEnumerator(name: "BINBYTES8", value: -114)
!76 = !DIEnumerator(name: "EMPTY_SET", value: -113)
!77 = !DIEnumerator(name: "ADDITEMS", value: -112)
!78 = !DIEnumerator(name: "FROZENSET", value: -111)
!79 = !DIEnumerator(name: "NEWOBJ_EX", value: -110)
!80 = !DIEnumerator(name: "STACK_GLOBAL", value: -109)
!81 = !DIEnumerator(name: "MEMOIZE", value: -108)
!82 = !DIEnumerator(name: "FRAME", value: -107)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !84, line: 23, size: 32, align: 32, elements: !85)
!84 = !DIFile(filename: "./Include/pyatomic.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!85 = !{!86, !87, !88, !89, !90}
!86 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!87 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!88 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!89 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!90 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !92, line: 451, size: 32, align: 32, elements: !93)
!92 = !DIFile(filename: "./Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!93 = !{!94, !95, !96, !97}
!94 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!95 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!96 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!97 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!98 = !{!99, !184, !445, !138, !480, !105, !189, !481, !489, !547, !548, !146, !560, !313, !568, !569, !587, !595, !613, !612, !623, !625, !627, !125, !629, !637, !663, !672, !678, !16, !111, !705, !707, !123, !709, !342, !711, !717, !723}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !101, line: 109, baseType: !102)
!101 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !101, line: 105, size: 128, align: 64, elements: !103)
!103 = !{!104, !112}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !102, file: !101, line: 107, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !106, line: 177, baseType: !107)
!106 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !108, line: 102, baseType: !109)
!108 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !110, line: 181, baseType: !111)
!110 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!111 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !102, file: !101, line: 108, baseType: !113, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !101, line: 334, size: 3200, align: 64, elements: !115)
!115 = !{!116, !122, !126, !127, !128, !133, !197, !202, !207, !208, !213, !265, !296, !308, !314, !315, !316, !318, !320, !351, !352, !353, !362, !363, !368, !369, !371, !373, !383, !393, !411, !412, !413, !415, !417, !418, !420, !425, !430, !435, !436, !437, !438, !439, !440, !441, !442, !444}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !114, file: !101, line: 335, baseType: !117, size: 192, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !101, line: 114, baseType: !118)
!118 = !DICompositeType(tag: DW_TAG_structure_type, file: !101, line: 111, size: 192, align: 64, elements: !119)
!119 = !{!120, !121}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !118, file: !101, line: 112, baseType: !100, size: 128, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !118, file: !101, line: 113, baseType: !105, size: 64, align: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !114, file: !101, line: 336, baseType: !123, size: 64, align: 64, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !114, file: !101, line: 337, baseType: !105, size: 64, align: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !114, file: !101, line: 337, baseType: !105, size: 64, align: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !114, file: !101, line: 341, baseType: !129, size: 64, align: 64, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !101, line: 308, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !99}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !114, file: !101, line: 342, baseType: !134, size: 64, align: 64, offset: 448)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !101, line: 314, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!138, !99, !139, !138}
!138 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !108, line: 48, baseType: !141)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !142, line: 246, size: 1728, align: 64, elements: !143)
!142 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!143 = !{!144, !145, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !165, !166, !167, !168, !170, !172, !174, !178, !181, !183, !185, !186, !187, !188, !192, !193}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !141, file: !142, line: 247, baseType: !138, size: 32, align: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !141, file: !142, line: 252, baseType: !146, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !141, file: !142, line: 253, baseType: !146, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !141, file: !142, line: 254, baseType: !146, size: 64, align: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !141, file: !142, line: 255, baseType: !146, size: 64, align: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !141, file: !142, line: 256, baseType: !146, size: 64, align: 64, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !141, file: !142, line: 257, baseType: !146, size: 64, align: 64, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !141, file: !142, line: 258, baseType: !146, size: 64, align: 64, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !141, file: !142, line: 259, baseType: !146, size: 64, align: 64, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !141, file: !142, line: 261, baseType: !146, size: 64, align: 64, offset: 576)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !141, file: !142, line: 262, baseType: !146, size: 64, align: 64, offset: 640)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !141, file: !142, line: 263, baseType: !146, size: 64, align: 64, offset: 704)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !141, file: !142, line: 265, baseType: !158, size: 64, align: 64, offset: 768)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !142, line: 161, size: 192, align: 64, elements: !160)
!160 = !{!161, !162, !164}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !159, file: !142, line: 162, baseType: !158, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !159, file: !142, line: 163, baseType: !163, size: 64, align: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !159, file: !142, line: 167, baseType: !138, size: 32, align: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !141, file: !142, line: 267, baseType: !163, size: 64, align: 64, offset: 832)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !141, file: !142, line: 269, baseType: !138, size: 32, align: 32, offset: 896)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !141, file: !142, line: 273, baseType: !138, size: 32, align: 32, offset: 928)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !141, file: !142, line: 275, baseType: !169, size: 64, align: 64, offset: 960)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !110, line: 140, baseType: !111)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !141, file: !142, line: 279, baseType: !171, size: 16, align: 16, offset: 1024)
!171 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !141, file: !142, line: 280, baseType: !173, size: 8, align: 8, offset: 1040)
!173 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !141, file: !142, line: 281, baseType: !175, size: 8, align: 8, offset: 1048)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 8, align: 8, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 1)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !141, file: !142, line: 285, baseType: !179, size: 64, align: 64, offset: 1088)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !142, line: 155, baseType: null)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !141, file: !142, line: 294, baseType: !182, size: 64, align: 64, offset: 1152)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !110, line: 141, baseType: !111)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !141, file: !142, line: 303, baseType: !184, size: 64, align: 64, offset: 1216)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !141, file: !142, line: 304, baseType: !184, size: 64, align: 64, offset: 1280)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !141, file: !142, line: 305, baseType: !184, size: 64, align: 64, offset: 1344)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !141, file: !142, line: 306, baseType: !184, size: 64, align: 64, offset: 1408)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !141, file: !142, line: 307, baseType: !189, size: 64, align: 64, offset: 1472)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !190, line: 62, baseType: !191)
!190 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!191 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !141, file: !142, line: 309, baseType: !138, size: 32, align: 32, offset: 1536)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !141, file: !142, line: 311, baseType: !194, size: 160, align: 8, offset: 1568)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 160, align: 8, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 20)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !114, file: !101, line: 343, baseType: !198, size: 64, align: 64, offset: 512)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !101, line: 316, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!99, !99, !146}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !114, file: !101, line: 344, baseType: !203, size: 64, align: 64, offset: 576)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !101, line: 318, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!138, !99, !146, !99}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !114, file: !101, line: 345, baseType: !184, size: 64, align: 64, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !114, file: !101, line: 346, baseType: !209, size: 64, align: 64, offset: 704)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !101, line: 320, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!99, !99}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !114, file: !101, line: 350, baseType: !214, size: 64, align: 64, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !101, line: 278, baseType: !216)
!216 = !DICompositeType(tag: DW_TAG_structure_type, file: !101, line: 236, size: 2176, align: 64, elements: !217)
!217 = !{!218, !223, !224, !225, !226, !227, !232, !234, !235, !236, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !216, file: !101, line: 241, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !101, line: 166, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!99, !99, !99}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !216, file: !101, line: 242, baseType: !219, size: 64, align: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !216, file: !101, line: 243, baseType: !219, size: 64, align: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !216, file: !101, line: 244, baseType: !219, size: 64, align: 64, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !216, file: !101, line: 245, baseType: !219, size: 64, align: 64, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !216, file: !101, line: 246, baseType: !228, size: 64, align: 64, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !101, line: 167, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!99, !99, !99, !99}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !216, file: !101, line: 247, baseType: !233, size: 64, align: 64, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !101, line: 165, baseType: !210)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !216, file: !101, line: 248, baseType: !233, size: 64, align: 64, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !216, file: !101, line: 249, baseType: !233, size: 64, align: 64, offset: 512)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !216, file: !101, line: 250, baseType: !237, size: 64, align: 64, offset: 576)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !101, line: 168, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!138, !99}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !216, file: !101, line: 251, baseType: !233, size: 64, align: 64, offset: 640)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !216, file: !101, line: 252, baseType: !219, size: 64, align: 64, offset: 704)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !216, file: !101, line: 253, baseType: !219, size: 64, align: 64, offset: 768)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !216, file: !101, line: 254, baseType: !219, size: 64, align: 64, offset: 832)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !216, file: !101, line: 255, baseType: !219, size: 64, align: 64, offset: 896)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !216, file: !101, line: 256, baseType: !219, size: 64, align: 64, offset: 960)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !216, file: !101, line: 257, baseType: !233, size: 64, align: 64, offset: 1024)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !216, file: !101, line: 258, baseType: !184, size: 64, align: 64, offset: 1088)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !216, file: !101, line: 259, baseType: !233, size: 64, align: 64, offset: 1152)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !216, file: !101, line: 261, baseType: !219, size: 64, align: 64, offset: 1216)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !216, file: !101, line: 262, baseType: !219, size: 64, align: 64, offset: 1280)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !216, file: !101, line: 263, baseType: !219, size: 64, align: 64, offset: 1344)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !216, file: !101, line: 264, baseType: !219, size: 64, align: 64, offset: 1408)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !216, file: !101, line: 265, baseType: !228, size: 64, align: 64, offset: 1472)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !216, file: !101, line: 266, baseType: !219, size: 64, align: 64, offset: 1536)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !216, file: !101, line: 267, baseType: !219, size: 64, align: 64, offset: 1600)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !216, file: !101, line: 268, baseType: !219, size: 64, align: 64, offset: 1664)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !216, file: !101, line: 269, baseType: !219, size: 64, align: 64, offset: 1728)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !216, file: !101, line: 270, baseType: !219, size: 64, align: 64, offset: 1792)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !216, file: !101, line: 272, baseType: !219, size: 64, align: 64, offset: 1856)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !216, file: !101, line: 273, baseType: !219, size: 64, align: 64, offset: 1920)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !216, file: !101, line: 274, baseType: !219, size: 64, align: 64, offset: 1984)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !216, file: !101, line: 275, baseType: !219, size: 64, align: 64, offset: 2048)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !216, file: !101, line: 277, baseType: !233, size: 64, align: 64, offset: 2112)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !114, file: !101, line: 351, baseType: !266, size: 64, align: 64, offset: 832)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !101, line: 292, baseType: !268)
!268 = !DICompositeType(tag: DW_TAG_structure_type, file: !101, line: 280, size: 640, align: 64, elements: !269)
!269 = !{!270, !275, !276, !281, !282, !283, !288, !289, !294, !295}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !268, file: !101, line: 281, baseType: !271, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !101, line: 169, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!105, !99}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !268, file: !101, line: 282, baseType: !219, size: 64, align: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !268, file: !101, line: 283, baseType: !277, size: 64, align: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !101, line: 170, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!99, !99, !105}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !268, file: !101, line: 284, baseType: !277, size: 64, align: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !268, file: !101, line: 285, baseType: !184, size: 64, align: 64, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !268, file: !101, line: 286, baseType: !284, size: 64, align: 64, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !101, line: 172, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!138, !99, !105, !99}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !268, file: !101, line: 287, baseType: !184, size: 64, align: 64, offset: 384)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !268, file: !101, line: 288, baseType: !290, size: 64, align: 64, offset: 448)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !101, line: 231, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!138, !99, !99}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !268, file: !101, line: 290, baseType: !219, size: 64, align: 64, offset: 512)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !268, file: !101, line: 291, baseType: !277, size: 64, align: 64, offset: 576)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !114, file: !101, line: 352, baseType: !297, size: 64, align: 64, offset: 896)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !101, line: 298, baseType: !299)
!299 = !DICompositeType(tag: DW_TAG_structure_type, file: !101, line: 294, size: 192, align: 64, elements: !300)
!300 = !{!301, !302, !303}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !299, file: !101, line: 295, baseType: !271, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !299, file: !101, line: 296, baseType: !219, size: 64, align: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !299, file: !101, line: 297, baseType: !304, size: 64, align: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !101, line: 174, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!138, !99, !99, !99}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !114, file: !101, line: 356, baseType: !309, size: 64, align: 64, offset: 960)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !101, line: 321, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!313, !99}
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !106, line: 186, baseType: !105)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !114, file: !101, line: 357, baseType: !228, size: 64, align: 64, offset: 1024)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !114, file: !101, line: 358, baseType: !209, size: 64, align: 64, offset: 1088)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !114, file: !101, line: 359, baseType: !317, size: 64, align: 64, offset: 1152)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !101, line: 317, baseType: !220)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !114, file: !101, line: 360, baseType: !319, size: 64, align: 64, offset: 1216)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !101, line: 319, baseType: !305)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !114, file: !101, line: 363, baseType: !321, size: 64, align: 64, offset: 1280)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !101, line: 304, baseType: !323)
!323 = !DICompositeType(tag: DW_TAG_structure_type, file: !101, line: 301, size: 128, align: 64, elements: !324)
!324 = !{!325, !346}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !323, file: !101, line: 302, baseType: !326, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !101, line: 193, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!138, !99, !330, !138}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !101, line: 191, baseType: !332)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !101, line: 178, size: 640, align: 64, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !339, !340, !341, !343, !344, !345}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !332, file: !101, line: 179, baseType: !184, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !332, file: !101, line: 180, baseType: !99, size: 64, align: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !332, file: !101, line: 181, baseType: !105, size: 64, align: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !332, file: !101, line: 182, baseType: !105, size: 64, align: 64, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !332, file: !101, line: 184, baseType: !138, size: 32, align: 32, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !332, file: !101, line: 185, baseType: !138, size: 32, align: 32, offset: 288)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !332, file: !101, line: 186, baseType: !146, size: 64, align: 64, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !332, file: !101, line: 187, baseType: !342, size: 64, align: 64, offset: 384)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !332, file: !101, line: 188, baseType: !342, size: 64, align: 64, offset: 448)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !332, file: !101, line: 189, baseType: !342, size: 64, align: 64, offset: 512)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !332, file: !101, line: 190, baseType: !184, size: 64, align: 64, offset: 576)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !323, file: !101, line: 303, baseType: !347, size: 64, align: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !101, line: 194, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !99, !330}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !114, file: !101, line: 366, baseType: !191, size: 64, align: 64, offset: 1344)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !114, file: !101, line: 368, baseType: !123, size: 64, align: 64, offset: 1408)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !114, file: !101, line: 372, baseType: !354, size: 64, align: 64, offset: 1472)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !101, line: 233, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!138, !99, !358, !184}
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !101, line: 232, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!138, !99, !184}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !114, file: !101, line: 375, baseType: !237, size: 64, align: 64, offset: 1536)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !114, file: !101, line: 379, baseType: !364, size: 64, align: 64, offset: 1600)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !101, line: 322, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!99, !99, !99, !138}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !114, file: !101, line: 382, baseType: !105, size: 64, align: 64, offset: 1664)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !114, file: !101, line: 385, baseType: !370, size: 64, align: 64, offset: 1728)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !101, line: 323, baseType: !210)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !114, file: !101, line: 386, baseType: !372, size: 64, align: 64, offset: 1792)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !101, line: 324, baseType: !210)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !114, file: !101, line: 389, baseType: !374, size: 64, align: 64, offset: 1856)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !376, line: 40, size: 256, align: 64, elements: !377)
!376 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!377 = !{!378, !379, !381, !382}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !375, file: !376, line: 41, baseType: !123, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !375, file: !376, line: 42, baseType: !380, size: 64, align: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !376, line: 18, baseType: !220)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !375, file: !376, line: 43, baseType: !138, size: 32, align: 32, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !375, file: !376, line: 45, baseType: !123, size: 64, align: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !114, file: !101, line: 390, baseType: !384, size: 64, align: 64, offset: 1920)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !386, line: 18, size: 320, align: 64, elements: !387)
!386 = !DIFile(filename: "./Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!387 = !{!388, !389, !390, !391, !392}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !385, file: !386, line: 19, baseType: !146, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !385, file: !386, line: 20, baseType: !138, size: 32, align: 32, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !385, file: !386, line: 21, baseType: !105, size: 64, align: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !385, file: !386, line: 22, baseType: !138, size: 32, align: 32, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !385, file: !386, line: 23, baseType: !146, size: 64, align: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !114, file: !101, line: 391, baseType: !394, size: 64, align: 64, offset: 1984)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !396, line: 11, size: 320, align: 64, elements: !397)
!396 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!397 = !{!398, !399, !404, !409, !410}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !395, file: !396, line: 12, baseType: !146, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !395, file: !396, line: 13, baseType: !400, size: 64, align: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !396, line: 8, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!99, !99, !184}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !395, file: !396, line: 14, baseType: !405, size: 64, align: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !396, line: 9, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!138, !99, !99, !184}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !395, file: !396, line: 15, baseType: !146, size: 64, align: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !395, file: !396, line: 16, baseType: !184, size: 64, align: 64, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !114, file: !101, line: 392, baseType: !113, size: 64, align: 64, offset: 2048)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !114, file: !101, line: 393, baseType: !99, size: 64, align: 64, offset: 2112)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !114, file: !101, line: 394, baseType: !414, size: 64, align: 64, offset: 2176)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !101, line: 325, baseType: !229)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !114, file: !101, line: 395, baseType: !416, size: 64, align: 64, offset: 2240)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !101, line: 326, baseType: !305)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !114, file: !101, line: 396, baseType: !105, size: 64, align: 64, offset: 2304)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !114, file: !101, line: 397, baseType: !419, size: 64, align: 64, offset: 2368)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !101, line: 327, baseType: !305)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !114, file: !101, line: 398, baseType: !421, size: 64, align: 64, offset: 2432)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !101, line: 329, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!99, !113, !105}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !114, file: !101, line: 399, baseType: !426, size: 64, align: 64, offset: 2496)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !101, line: 328, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!99, !113, !99, !99}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !114, file: !101, line: 400, baseType: !431, size: 64, align: 64, offset: 2560)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !101, line: 307, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !184}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !114, file: !101, line: 401, baseType: !237, size: 64, align: 64, offset: 2624)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !114, file: !101, line: 402, baseType: !99, size: 64, align: 64, offset: 2688)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !114, file: !101, line: 403, baseType: !99, size: 64, align: 64, offset: 2752)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !114, file: !101, line: 404, baseType: !99, size: 64, align: 64, offset: 2816)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !114, file: !101, line: 405, baseType: !99, size: 64, align: 64, offset: 2880)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !114, file: !101, line: 406, baseType: !99, size: 64, align: 64, offset: 2944)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !114, file: !101, line: 407, baseType: !129, size: 64, align: 64, offset: 3008)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !114, file: !101, line: 410, baseType: !443, size: 32, align: 32, offset: 3072)
!443 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !114, file: !101, line: 412, baseType: !129, size: 64, align: 64, offset: 3136)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "PicklerObject", file: !4, line: 558, baseType: !447)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "PicklerObject", file: !4, line: 527, size: 1024, align: 64, elements: !448)
!448 = !{!449, !450, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !447, file: !4, line: 528, baseType: !100, size: 128, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "memo", scope: !447, file: !4, line: 529, baseType: !451, size: 64, align: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemoTable", file: !4, line: 525, baseType: !453)
!453 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 520, size: 256, align: 64, elements: !454)
!454 = !{!455, !456, !457, !458}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "mt_mask", scope: !453, file: !4, line: 521, baseType: !105, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "mt_used", scope: !453, file: !4, line: 522, baseType: !105, size: 64, align: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "mt_allocated", scope: !453, file: !4, line: 523, baseType: !105, size: 64, align: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "mt_table", scope: !453, file: !4, line: 524, baseType: !459, size: 64, align: 64, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemoEntry", file: !4, line: 518, baseType: !461)
!461 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 515, size: 128, align: 64, elements: !462)
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "me_key", scope: !461, file: !4, line: 516, baseType: !99, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "me_value", scope: !461, file: !4, line: 517, baseType: !105, size: 64, align: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "pers_func", scope: !447, file: !4, line: 532, baseType: !99, size: 64, align: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch_table", scope: !447, file: !4, line: 533, baseType: !99, size: 64, align: 64, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !447, file: !4, line: 535, baseType: !99, size: 64, align: 64, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "output_buffer", scope: !447, file: !4, line: 536, baseType: !99, size: 64, align: 64, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "output_len", scope: !447, file: !4, line: 538, baseType: !105, size: 64, align: 64, offset: 448)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "max_output_len", scope: !447, file: !4, line: 539, baseType: !105, size: 64, align: 64, offset: 512)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !447, file: !4, line: 540, baseType: !138, size: 32, align: 32, offset: 576)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "bin", scope: !447, file: !4, line: 541, baseType: !138, size: 32, align: 32, offset: 608)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "framing", scope: !447, file: !4, line: 542, baseType: !138, size: 32, align: 32, offset: 640)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "frame_start", scope: !447, file: !4, line: 543, baseType: !105, size: 64, align: 64, offset: 704)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !447, file: !4, line: 547, baseType: !105, size: 64, align: 64, offset: 768)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "fast", scope: !447, file: !4, line: 548, baseType: !138, size: 32, align: 32, offset: 832)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "fast_nesting", scope: !447, file: !4, line: 554, baseType: !138, size: 32, align: 32, offset: 864)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "fix_imports", scope: !447, file: !4, line: 555, baseType: !138, size: 32, align: 32, offset: 896)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "fast_memo", scope: !447, file: !4, line: 557, baseType: !99, size: 64, align: 64, offset: 960)
!480 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !483, line: 41, baseType: !484)
!483 = !DIFile(filename: "./Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!484 = !DICompositeType(tag: DW_TAG_structure_type, file: !483, line: 31, size: 320, align: 64, elements: !485)
!485 = !{!486, !487, !488}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !484, file: !483, line: 32, baseType: !117, size: 192, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !484, file: !483, line: 33, baseType: !313, size: 64, align: 64, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !484, file: !483, line: 34, baseType: !175, size: 8, align: 8, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !491, line: 139, baseType: !492)
!491 = !DIFile(filename: "./Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !491, line: 69, size: 1536, align: 64, elements: !493)
!493 = !{!494, !496, !497, !517, !520, !521, !522, !523, !524, !525, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !492, file: !491, line: 72, baseType: !495, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !492, file: !491, line: 73, baseType: !495, size: 64, align: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !492, file: !491, line: 74, baseType: !498, size: 64, align: 64, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !491, line: 44, baseType: !500)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !491, line: 19, size: 832, align: 64, elements: !501)
!501 = !{!502, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !500, file: !491, line: 21, baseType: !503, size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !500, file: !491, line: 22, baseType: !495, size: 64, align: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !500, file: !491, line: 24, baseType: !99, size: 64, align: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !500, file: !491, line: 25, baseType: !99, size: 64, align: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !500, file: !491, line: 26, baseType: !99, size: 64, align: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !500, file: !491, line: 27, baseType: !99, size: 64, align: 64, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !500, file: !491, line: 28, baseType: !99, size: 64, align: 64, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !500, file: !491, line: 30, baseType: !99, size: 64, align: 64, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !500, file: !491, line: 31, baseType: !99, size: 64, align: 64, offset: 512)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !500, file: !491, line: 32, baseType: !99, size: 64, align: 64, offset: 576)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !500, file: !491, line: 33, baseType: !138, size: 32, align: 32, offset: 640)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !500, file: !491, line: 34, baseType: !138, size: 32, align: 32, offset: 672)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !500, file: !491, line: 37, baseType: !138, size: 32, align: 32, offset: 704)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !500, file: !491, line: 43, baseType: !99, size: 64, align: 64, offset: 768)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !492, file: !491, line: 76, baseType: !518, size: 64, align: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64, align: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !491, line: 50, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !492, file: !491, line: 77, baseType: !138, size: 32, align: 32, offset: 256)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !492, file: !491, line: 78, baseType: !125, size: 8, align: 8, offset: 288)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !492, file: !491, line: 80, baseType: !125, size: 8, align: 8, offset: 296)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !492, file: !491, line: 85, baseType: !138, size: 32, align: 32, offset: 320)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !492, file: !491, line: 86, baseType: !138, size: 32, align: 32, offset: 352)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !492, file: !491, line: 88, baseType: !526, size: 64, align: 64, offset: 384)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !491, line: 54, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!138, !99, !518, !138, !99}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !492, file: !491, line: 89, baseType: !526, size: 64, align: 64, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !492, file: !491, line: 90, baseType: !99, size: 64, align: 64, offset: 512)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !492, file: !491, line: 91, baseType: !99, size: 64, align: 64, offset: 576)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !492, file: !491, line: 93, baseType: !99, size: 64, align: 64, offset: 640)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !492, file: !491, line: 94, baseType: !99, size: 64, align: 64, offset: 704)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !492, file: !491, line: 95, baseType: !99, size: 64, align: 64, offset: 768)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !492, file: !491, line: 97, baseType: !99, size: 64, align: 64, offset: 832)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !492, file: !491, line: 98, baseType: !99, size: 64, align: 64, offset: 896)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !492, file: !491, line: 99, baseType: !99, size: 64, align: 64, offset: 960)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !492, file: !491, line: 101, baseType: !99, size: 64, align: 64, offset: 1024)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !492, file: !491, line: 103, baseType: !138, size: 32, align: 32, offset: 1088)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !492, file: !491, line: 105, baseType: !99, size: 64, align: 64, offset: 1152)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !492, file: !491, line: 106, baseType: !111, size: 64, align: 64, offset: 1216)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !492, file: !491, line: 108, baseType: !138, size: 32, align: 32, offset: 1280)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !492, file: !491, line: 109, baseType: !99, size: 64, align: 64, offset: 1344)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !492, file: !491, line: 134, baseType: !432, size: 64, align: 64, offset: 1408)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !492, file: !491, line: 135, baseType: !184, size: 64, align: 64, offset: 1472)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64, align: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLongObject", file: !550, line: 10, baseType: !551)
!550 = !DIFile(filename: "./Include/longobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "_longobject", file: !552, line: 89, size: 256, align: 64, elements: !553)
!552 = !DIFile(filename: "./Include/longintrepr.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!553 = !{!554, !555}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !551, file: !552, line: 90, baseType: !117, size: 192, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ob_digit", scope: !551, file: !552, line: 91, baseType: !556, size: 32, align: 32, offset: 192)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 32, align: 32, elements: !176)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit", file: !552, line: 49, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !559, line: 51, baseType: !443)
!559 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64, align: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFloatObject", file: !562, line: 18, baseType: !563)
!562 = !DIFile(filename: "./Include/floatobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!563 = !DICompositeType(tag: DW_TAG_structure_type, file: !562, line: 15, size: 192, align: 64, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !563, file: !562, line: 16, baseType: !100, size: 128, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ob_fval", scope: !563, file: !562, line: 17, baseType: !567, size: 64, align: 64, offset: 128)
!567 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !92, line: 351, baseType: !571)
!571 = !DICompositeType(tag: DW_TAG_structure_type, file: !92, line: 217, size: 384, align: 64, elements: !572)
!572 = !{!573, !574, !575, !576, !584}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !571, file: !92, line: 291, baseType: !100, size: 128, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !571, file: !92, line: 292, baseType: !105, size: 64, align: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !571, file: !92, line: 293, baseType: !313, size: 64, align: 64, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !571, file: !92, line: 349, baseType: !577, size: 32, align: 32, offset: 256)
!577 = !DICompositeType(tag: DW_TAG_structure_type, scope: !571, file: !92, line: 294, size: 32, align: 32, elements: !578)
!578 = !{!579, !580, !581, !582, !583}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !577, file: !92, line: 303, baseType: !443, size: 2, align: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !577, file: !92, line: 331, baseType: !443, size: 3, align: 32, offset: 2)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !577, file: !92, line: 336, baseType: !443, size: 1, align: 32, offset: 5)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !577, file: !92, line: 340, baseType: !443, size: 1, align: 32, offset: 6)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !577, file: !92, line: 345, baseType: !443, size: 1, align: 32, offset: 7)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !571, file: !92, line: 350, baseType: !585, size: 64, align: 64, offset: 320)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !190, line: 90, baseType: !138)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !92, line: 363, baseType: !589)
!589 = !DICompositeType(tag: DW_TAG_structure_type, file: !92, line: 356, size: 576, align: 64, elements: !590)
!590 = !{!591, !592, !593, !594}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !589, file: !92, line: 357, baseType: !570, size: 384, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !589, file: !92, line: 358, baseType: !105, size: 64, align: 64, offset: 384)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !589, file: !92, line: 360, baseType: !146, size: 64, align: 64, offset: 448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !589, file: !92, line: 361, baseType: !105, size: 64, align: 64, offset: 512)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !92, line: 376, baseType: !597)
!597 = !DICompositeType(tag: DW_TAG_structure_type, file: !92, line: 368, size: 640, align: 64, elements: !598)
!598 = !{!599, !600}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !597, file: !92, line: 369, baseType: !588, size: 576, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !597, file: !92, line: 375, baseType: !601, size: 64, align: 64, offset: 576)
!601 = !DICompositeType(tag: DW_TAG_union_type, scope: !597, file: !92, line: 370, size: 64, align: 64, elements: !602)
!602 = !{!603, !604, !607, !610}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !601, file: !92, line: 371, baseType: !184, size: 64, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !601, file: !92, line: 372, baseType: !605, size: 64, align: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64, align: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !92, line: 134, baseType: !480)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !601, file: !92, line: 373, baseType: !608, size: 64, align: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !92, line: 129, baseType: !171)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !601, file: !92, line: 374, baseType: !611, size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !92, line: 121, baseType: !443)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64, align: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyByteArrayObject", file: !615, line: 30, baseType: !616)
!615 = !DIFile(filename: "./Include/bytearrayobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!616 = !DICompositeType(tag: DW_TAG_structure_type, file: !615, line: 23, size: 448, align: 64, elements: !617)
!617 = !{!618, !619, !620, !621, !622}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !616, file: !615, line: 24, baseType: !117, size: 192, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ob_alloc", scope: !616, file: !615, line: 25, baseType: !105, size: 64, align: 64, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ob_bytes", scope: !616, file: !615, line: 26, baseType: !146, size: 64, align: 64, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ob_start", scope: !616, file: !615, line: 27, baseType: !146, size: 64, align: 64, offset: 320)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ob_exports", scope: !616, file: !615, line: 29, baseType: !138, size: 32, align: 32, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !606)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !609)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !612)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !631, line: 33, baseType: !632)
!631 = !DIFile(filename: "./Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!632 = !DICompositeType(tag: DW_TAG_structure_type, file: !631, line: 25, size: 256, align: 64, elements: !633)
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !632, file: !631, line: 26, baseType: !117, size: 192, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !632, file: !631, line: 27, baseType: !636, size: 64, align: 64, offset: 192)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 64, align: 64, elements: !176)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySetObject", file: !639, line: 35, baseType: !640)
!639 = !DIFile(filename: "./Include/setobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "_setobject", file: !639, line: 36, size: 1600, align: 64, elements: !641)
!641 = !{!642, !643, !644, !645, !646, !653, !657, !658, !662}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !640, file: !639, line: 37, baseType: !100, size: 128, align: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !640, file: !639, line: 39, baseType: !105, size: 64, align: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !640, file: !639, line: 40, baseType: !105, size: 64, align: 64, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !640, file: !639, line: 46, baseType: !105, size: 64, align: 64, offset: 256)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !640, file: !639, line: 52, baseType: !647, size: 64, align: 64, offset: 320)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "setentry", file: !639, line: 28, baseType: !649)
!649 = !DICompositeType(tag: DW_TAG_structure_type, file: !639, line: 24, size: 128, align: 64, elements: !650)
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !649, file: !639, line: 26, baseType: !99, size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !649, file: !639, line: 27, baseType: !313, size: 64, align: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !640, file: !639, line: 53, baseType: !654, size: 64, align: 64, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64, align: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!647, !637, !99, !313}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !640, file: !639, line: 54, baseType: !313, size: 64, align: 64, offset: 448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "smalltable", scope: !640, file: !639, line: 55, baseType: !659, size: 1024, align: 64, offset: 512)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !648, size: 1024, align: 64, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 8)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !640, file: !639, line: 57, baseType: !99, size: 64, align: 64, offset: 1536)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !665, line: 40, baseType: !666)
!665 = !DIFile(filename: "./Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!666 = !DICompositeType(tag: DW_TAG_structure_type, file: !665, line: 23, size: 320, align: 64, elements: !667)
!667 = !{!668, !669, !671}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !666, file: !665, line: 24, baseType: !117, size: 192, align: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !666, file: !665, line: 26, baseType: !670, size: 64, align: 64, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !666, file: !665, line: 39, baseType: !105, size: 64, align: 64, offset: 256)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64, align: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "UnpicklerObject", file: !4, line: 596, baseType: !674)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnpicklerObject", file: !4, line: 560, size: 1984, align: 64, elements: !675)
!675 = !{!676, !677, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !674, file: !4, line: 561, baseType: !100, size: 128, align: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !674, file: !4, line: 562, baseType: !678, size: 64, align: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pdata", file: !4, line: 361, baseType: !680)
!680 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 357, size: 320, align: 64, elements: !681)
!681 = !{!682, !683, !684}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !680, file: !4, line: 358, baseType: !117, size: 192, align: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !680, file: !4, line: 359, baseType: !670, size: 64, align: 64, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !680, file: !4, line: 360, baseType: !105, size: 64, align: 64, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "memo", scope: !674, file: !4, line: 566, baseType: !670, size: 64, align: 64, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "memo_size", scope: !674, file: !4, line: 567, baseType: !105, size: 64, align: 64, offset: 256)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "memo_len", scope: !674, file: !4, line: 568, baseType: !105, size: 64, align: 64, offset: 320)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "pers_func", scope: !674, file: !4, line: 570, baseType: !99, size: 64, align: 64, offset: 384)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !674, file: !4, line: 572, baseType: !331, size: 640, align: 64, offset: 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "input_buffer", scope: !674, file: !4, line: 573, baseType: !146, size: 64, align: 64, offset: 1088)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "input_line", scope: !674, file: !4, line: 574, baseType: !146, size: 64, align: 64, offset: 1152)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "input_len", scope: !674, file: !4, line: 575, baseType: !105, size: 64, align: 64, offset: 1216)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "next_read_idx", scope: !674, file: !4, line: 576, baseType: !105, size: 64, align: 64, offset: 1280)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "prefetched_idx", scope: !674, file: !4, line: 577, baseType: !105, size: 64, align: 64, offset: 1344)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !674, file: !4, line: 579, baseType: !99, size: 64, align: 64, offset: 1408)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "readline", scope: !674, file: !4, line: 580, baseType: !99, size: 64, align: 64, offset: 1472)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "peek", scope: !674, file: !4, line: 581, baseType: !99, size: 64, align: 64, offset: 1536)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !674, file: !4, line: 583, baseType: !146, size: 64, align: 64, offset: 1600)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "errors", scope: !674, file: !4, line: 586, baseType: !146, size: 64, align: 64, offset: 1664)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "marks", scope: !674, file: !4, line: 589, baseType: !342, size: 64, align: 64, offset: 1728)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "num_marks", scope: !674, file: !4, line: 591, baseType: !105, size: 64, align: 64, offset: 1792)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "marks_size", scope: !674, file: !4, line: 592, baseType: !105, size: 64, align: 64, offset: 1856)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !674, file: !4, line: 593, baseType: !138, size: 32, align: 32, offset: 1920)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "fix_imports", scope: !674, file: !4, line: 594, baseType: !138, size: 32, align: 32, offset: 1952)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64, align: 64)
!706 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64, align: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !101, line: 422, baseType: !114)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64, align: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "UnpicklerMemoProxyObject", file: !4, line: 606, baseType: !713)
!713 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 603, size: 192, align: 64, elements: !714)
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !713, file: !4, line: 604, baseType: !100, size: 128, align: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "unpickler", scope: !713, file: !4, line: 605, baseType: !672, size: 64, align: 64, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64, align: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "PicklerMemoProxyObject", file: !4, line: 601, baseType: !719)
!719 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 598, size: 192, align: 64, elements: !720)
!720 = !{!721, !722}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !719, file: !4, line: 599, baseType: !100, size: 128, align: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "pickler", scope: !719, file: !4, line: 600, baseType: !445, size: 64, align: 64, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64, align: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "PickleState", file: !4, line: 155, baseType: !725)
!725 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 124, size: 768, align: 64, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "PickleError", scope: !725, file: !4, line: 126, baseType: !99, size: 64, align: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "PicklingError", scope: !725, file: !4, line: 127, baseType: !99, size: 64, align: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "UnpicklingError", scope: !725, file: !4, line: 128, baseType: !99, size: 64, align: 64, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch_table", scope: !725, file: !4, line: 131, baseType: !99, size: 64, align: 64, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "extension_registry", scope: !725, file: !4, line: 136, baseType: !99, size: 64, align: 64, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "extension_cache", scope: !725, file: !4, line: 138, baseType: !99, size: 64, align: 64, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "inverted_registry", scope: !725, file: !4, line: 140, baseType: !99, size: 64, align: 64, offset: 384)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "name_mapping_2to3", scope: !725, file: !4, line: 146, baseType: !99, size: 64, align: 64, offset: 448)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "import_mapping_2to3", scope: !725, file: !4, line: 148, baseType: !99, size: 64, align: 64, offset: 512)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "name_mapping_3to2", scope: !725, file: !4, line: 150, baseType: !99, size: 64, align: 64, offset: 576)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "import_mapping_3to2", scope: !725, file: !4, line: 151, baseType: !99, size: 64, align: 64, offset: 640)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_encode", scope: !725, file: !4, line: 154, baseType: !99, size: 64, align: 64, offset: 704)
!739 = !{!740, !746, !783, !800, !809, !814, !822, !828, !839, !854, !918, !924, !929, !936, !943, !952, !957, !960, !985, !990, !999, !1034, !1049, !1056, !1068, !1084, !1104, !1119, !1124, !1132, !1143, !1162, !1172, !1181, !1198, !1258, !1275, !1287, !1337, !1350, !1371, !1410, !1464, !1474, !1524, !1537, !1549, !1553, !1562, !1623, !1653, !1687, !1722, !1726, !1742, !1793, !1797, !1807, !1813, !1822, !1839, !1849, !1867, !1876, !1882, !1887, !1913, !1920, !1932, !1946, !1951, !1960, !1990, !1996, !2001, !2007, !2015, !2019, !2028, !2037, !2041, !2045, !2053, !2067, !2076, !2079, !2085, !2097, !2105, !2111, !2118, !2127, !2144, !2165, !2171, !2178, !2185, !2190, !2196, !2206, !2210, !2215, !2223, !2227, !2243, !2247, !2269, !2277, !2290, !2295, !2320, !2327, !2349, !2389, !2409, !2432, !2435, !2466, !2469, !2527, !2532, !2545, !2551, !2564, !2582, !2589, !2595, !2607, !2613, !2619, !2629, !2633, !2642, !2646, !2649, !2662, !2665, !2674, !2681, !2693, !2698, !2703, !2741, !2745, !2752, !2758, !2768, !2784, !2838, !2841, !2918, !2921, !2951, !2962, !2989, !3022, !3028, !3035, !3042, !3061, !3064, !3068, !3098, !3101, !3111, !3121, !3130, !3160, !3165, !3177, !3200, !3236, !3245, !3254, !3258, !3261, !3264, !3268, !3284, !3296, !3299, !3309, !3318, !3326, !3335, !3345, !3356, !3367, !3373, !3378, !3382, !3418, !3422, !3438, !3448, !3459, !3470, !3476, !3481, !3485, !3500, !3504, !3520, !3525}
!740 = !DISubprogram(name: "PyInit__pickle", scope: !4, file: !4, line: 7065, type: !741, isLocal: false, isDefinition: true, scopeLine: 7066, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__pickle, variables: !743)
!741 = !DISubroutineType(types: !742)
!742 = !{!99}
!743 = !{!744, !745}
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !740, file: !4, line: 7067, type: !99)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !740, file: !4, line: 7068, type: !723)
!746 = !DISubprogram(name: "_pickle_dump", scope: !747, file: !747, line: 329, type: !748, isLocal: true, isDefinition: true, scopeLine: 330, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyModuleDef*, %struct._object*, %struct._object*)* @_pickle_dump, variables: !774)
!747 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/clinic/_pickle.c.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!748 = !DISubroutineType(types: !749)
!749 = !{!99, !750, !99, !99}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef", file: !752, line: 57, baseType: !753)
!752 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !752, line: 47, size: 832, align: 64, elements: !754)
!754 = !{!755, !764, !765, !766, !767, !770, !771, !772, !773}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !753, file: !752, line: 48, baseType: !756, size: 320, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !752, line: 38, baseType: !757)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !752, line: 33, size: 320, align: 64, elements: !758)
!758 = !{!759, !760, !762, !763}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !757, file: !752, line: 34, baseType: !100, size: 128, align: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !757, file: !752, line: 35, baseType: !761, size: 64, align: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !757, file: !752, line: 36, baseType: !105, size: 64, align: 64, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !757, file: !752, line: 37, baseType: !99, size: 64, align: 64, offset: 256)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !753, file: !752, line: 49, baseType: !123, size: 64, align: 64, offset: 320)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !753, file: !752, line: 50, baseType: !123, size: 64, align: 64, offset: 384)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !753, file: !752, line: 51, baseType: !105, size: 64, align: 64, offset: 448)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !753, file: !752, line: 52, baseType: !768, size: 64, align: 64, offset: 512)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64, align: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !376, line: 47, baseType: !375)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !753, file: !752, line: 53, baseType: !237, size: 64, align: 64, offset: 576)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !753, file: !752, line: 54, baseType: !354, size: 64, align: 64, offset: 640)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !753, file: !752, line: 55, baseType: !237, size: 64, align: 64, offset: 704)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !753, file: !752, line: 56, baseType: !431, size: 64, align: 64, offset: 768)
!774 = !{!775, !776, !777, !778, !779, !780, !781, !782}
!775 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !746, file: !747, line: 329, type: !750)
!776 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !746, file: !747, line: 329, type: !99)
!777 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !746, file: !747, line: 329, type: !99)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "return_value", scope: !746, file: !747, line: 331, type: !99)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !746, file: !747, line: 333, type: !99)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file", scope: !746, file: !747, line: 334, type: !99)
!781 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "protocol", scope: !746, file: !747, line: 335, type: !99)
!782 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fix_imports", scope: !746, file: !747, line: 336, type: !138)
!783 = !DISubprogram(name: "_pickle_dump_impl", scope: !4, file: !4, line: 6820, type: !784, isLocal: true, isDefinition: true, scopeLine: 6822, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyModuleDef*, %struct._object*, %struct._object*, %struct._object*, i32)* @_pickle_dump_impl, variables: !786)
!784 = !DISubroutineType(types: !785)
!785 = !{!99, !750, !99, !99, !99, !138}
!786 = !{!787, !788, !789, !790, !791, !792, !793, !795, !797}
!787 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !783, file: !4, line: 6820, type: !750)
!788 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !783, file: !4, line: 6820, type: !99)
!789 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 3, scope: !783, file: !4, line: 6820, type: !99)
!790 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "protocol", arg: 4, scope: !783, file: !4, line: 6820, type: !99)
!791 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fix_imports", arg: 5, scope: !783, file: !4, line: 6820, type: !138)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pickler", scope: !783, file: !4, line: 6823, type: !445)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !794, file: !4, line: 6840, type: !99)
!794 = distinct !DILexicalBlock(scope: !783, file: !4, line: 6840, column: 8)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !796, file: !4, line: 6844, type: !99)
!796 = distinct !DILexicalBlock(scope: !783, file: !4, line: 6844, column: 8)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !798, file: !4, line: 6844, type: !99)
!798 = distinct !DILexicalBlock(scope: !799, file: !4, line: 6844, column: 99)
!799 = distinct !DILexicalBlock(scope: !796, file: !4, line: 6844, column: 65)
!800 = !DISubprogram(name: "_Pickler_New", scope: !4, file: !4, line: 986, type: !801, isLocal: true, isDefinition: true, scopeLine: 987, flags: DIFlagPrototyped, isOptimized: true, function: %struct.PicklerObject* ()* @_Pickler_New, variables: !803)
!801 = !DISubroutineType(types: !802)
!802 = !{!445}
!803 = !{!804, !805}
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !800, file: !4, line: 988, type: !445)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !806, file: !4, line: 1013, type: !99)
!806 = distinct !DILexicalBlock(scope: !807, file: !4, line: 1013, column: 12)
!807 = distinct !DILexicalBlock(scope: !808, file: !4, line: 1012, column: 72)
!808 = distinct !DILexicalBlock(scope: !800, file: !4, line: 1012, column: 9)
!809 = !DISubprogram(name: "PyMemoTable_New", scope: !4, file: !4, line: 627, type: !810, isLocal: true, isDefinition: true, scopeLine: 628, flags: DIFlagPrototyped, isOptimized: true, function: %struct.PyMemoTable* ()* @PyMemoTable_New, variables: !812)
!810 = !DISubroutineType(types: !811)
!811 = !{!451}
!812 = !{!813}
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "memo", scope: !809, file: !4, line: 629, type: !451)
!814 = !DISubprogram(name: "_Pickler_SetProtocol", scope: !4, file: !4, line: 1020, type: !815, isLocal: true, isDefinition: true, scopeLine: 1021, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PicklerObject*, %struct._object*, i32)* @_Pickler_SetProtocol, variables: !817)
!815 = !DISubroutineType(types: !816)
!816 = !{!138, !445, !99, !138}
!817 = !{!818, !819, !820, !821}
!818 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !814, file: !4, line: 1020, type: !445)
!819 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "protocol", arg: 2, scope: !814, file: !4, line: 1020, type: !99)
!820 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fix_imports", arg: 3, scope: !814, file: !4, line: 1020, type: !138)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "proto", scope: !814, file: !4, line: 1022, type: !111)
!822 = !DISubprogram(name: "_Pickler_SetOutputStream", scope: !4, file: !4, line: 1049, type: !823, isLocal: true, isDefinition: true, scopeLine: 1050, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PicklerObject*, %struct._object*)* @_Pickler_SetOutputStream, variables: !825)
!823 = !DISubroutineType(types: !824)
!824 = !{!138, !445, !99}
!825 = !{!826, !827}
!826 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !822, file: !4, line: 1049, type: !445)
!827 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 2, scope: !822, file: !4, line: 1049, type: !99)
!828 = !DISubprogram(name: "dump", scope: !4, file: !4, line: 3851, type: !823, isLocal: true, isDefinition: true, scopeLine: 3852, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PicklerObject*, %struct._object*)* @dump, variables: !829)
!829 = !{!830, !831, !832, !833}
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !828, file: !4, line: 3851, type: !445)
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !828, file: !4, line: 3851, type: !99)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stop_op", scope: !828, file: !4, line: 3853, type: !124)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "header", scope: !834, file: !4, line: 3856, type: !836)
!834 = distinct !DILexicalBlock(scope: !835, file: !4, line: 3855, column: 27)
!835 = distinct !DILexicalBlock(scope: !828, file: !4, line: 3855, column: 9)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 16, align: 8, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 2)
!839 = !DISubprogram(name: "_Pickler_Write", scope: !4, file: !4, line: 936, type: !840, isLocal: true, isDefinition: true, scopeLine: 937, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.PicklerObject*, i8*, i64)* @_Pickler_Write, variables: !842)
!840 = !DISubroutineType(types: !841)
!841 = !{!105, !445, !123, !105}
!842 = !{!843, !844, !845, !846, !847, !848, !849, !850, !851}
!843 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !839, file: !4, line: 936, type: !445)
!844 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 2, scope: !839, file: !4, line: 936, type: !123)
!845 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data_len", arg: 3, scope: !839, file: !4, line: 936, type: !105)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !839, file: !4, line: 938, type: !105)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !839, file: !4, line: 938, type: !105)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "required", scope: !839, file: !4, line: 938, type: !105)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !839, file: !4, line: 939, type: !146)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "need_new_frame", scope: !839, file: !4, line: 940, type: !138)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frame_start", scope: !852, file: !4, line: 964, type: !105)
!852 = distinct !DILexicalBlock(scope: !853, file: !4, line: 962, column: 25)
!853 = distinct !DILexicalBlock(scope: !839, file: !4, line: 962, column: 9)
!854 = !DISubprogram(name: "save", scope: !4, file: !4, line: 3637, type: !815, isLocal: true, isDefinition: true, scopeLine: 3638, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PicklerObject*, %struct._object*, i32)* @save, variables: !855)
!855 = !{!856, !857, !858, !859, !860, !861, !862, !863, !871, !872, !875, !877, !880, !886, !888, !891, !893, !896, !900, !901, !902, !903, !905, !906, !907, !908, !910, !913, !915}
!856 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !854, file: !4, line: 3637, type: !445)
!857 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !854, file: !4, line: 3637, type: !99)
!858 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pers_save", arg: 3, scope: !854, file: !4, line: 3637, type: !138)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !854, file: !4, line: 3639, type: !709)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reduce_func", scope: !854, file: !4, line: 3640, type: !99)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reduce_value", scope: !854, file: !4, line: 3641, type: !99)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "status", scope: !854, file: !4, line: 3642, type: !138)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !864, file: !4, line: 3647, type: !866)
!864 = distinct !DILexicalBlock(scope: !865, file: !4, line: 3647, column: 46)
!865 = distinct !DILexicalBlock(scope: !854, file: !4, line: 3647, column: 9)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64, align: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !84, line: 33, baseType: !868)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !84, line: 31, size: 64, align: 64, elements: !869)
!869 = !{!870}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !868, file: !84, line: 32, baseType: !184, size: 64, align: 64)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !864, file: !4, line: 3647, type: !184)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !864, file: !4, line: 3647, type: !873)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64, align: 64)
!874 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !184)
!875 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !864, file: !4, line: 3647, type: !876)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !84, line: 29, baseType: !83)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !878, file: !4, line: 3741, type: !723)
!878 = distinct !DILexicalBlock(scope: !879, file: !4, line: 3740, column: 45)
!879 = distinct !DILexicalBlock(scope: !854, file: !4, line: 3740, column: 9)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "proto", scope: !881, file: !4, line: 3788, type: !99)
!881 = distinct !DILexicalBlock(scope: !882, file: !4, line: 3787, column: 40)
!882 = distinct !DILexicalBlock(scope: !883, file: !4, line: 3787, column: 13)
!883 = distinct !DILexicalBlock(scope: !884, file: !4, line: 3772, column: 10)
!884 = distinct !DILexicalBlock(scope: !885, file: !4, line: 3768, column: 14)
!885 = distinct !DILexicalBlock(scope: !854, file: !4, line: 3764, column: 9)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !887, file: !4, line: 3795, type: !723)
!887 = distinct !DILexicalBlock(scope: !882, file: !4, line: 3794, column: 14)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "empty_tuple", scope: !889, file: !4, line: 3806, type: !99)
!889 = distinct !DILexicalBlock(scope: !890, file: !4, line: 3805, column: 44)
!890 = distinct !DILexicalBlock(scope: !887, file: !4, line: 3805, column: 17)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !892, file: !4, line: 3809, type: !99)
!892 = distinct !DILexicalBlock(scope: !889, file: !4, line: 3809, column: 20)
!893 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !894, file: !4, line: 3829, type: !723)
!894 = distinct !DILexicalBlock(scope: !895, file: !4, line: 3828, column: 87)
!895 = distinct !DILexicalBlock(scope: !854, file: !4, line: 3828, column: 9)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !897, file: !4, line: 3843, type: !866)
!897 = distinct !DILexicalBlock(scope: !898, file: !4, line: 3843, column: 48)
!898 = distinct !DILexicalBlock(scope: !899, file: !4, line: 3843, column: 12)
!899 = distinct !DILexicalBlock(scope: !854, file: !4, line: 3843, column: 7)
!900 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !897, file: !4, line: 3843, type: !184)
!901 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !897, file: !4, line: 3843, type: !873)
!902 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !897, file: !4, line: 3843, type: !876)
!903 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !904, file: !4, line: 3843, type: !866)
!904 = distinct !DILexicalBlock(scope: !898, file: !4, line: 3843, column: 897)
!905 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !904, file: !4, line: 3843, type: !184)
!906 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !904, file: !4, line: 3843, type: !873)
!907 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !904, file: !4, line: 3843, type: !876)
!908 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !909, file: !4, line: 3844, type: !99)
!909 = distinct !DILexicalBlock(scope: !854, file: !4, line: 3844, column: 8)
!910 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !911, file: !4, line: 3844, type: !99)
!911 = distinct !DILexicalBlock(scope: !912, file: !4, line: 3844, column: 103)
!912 = distinct !DILexicalBlock(scope: !909, file: !4, line: 3844, column: 69)
!913 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !914, file: !4, line: 3845, type: !99)
!914 = distinct !DILexicalBlock(scope: !854, file: !4, line: 3845, column: 8)
!915 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !916, file: !4, line: 3845, type: !99)
!916 = distinct !DILexicalBlock(scope: !917, file: !4, line: 3845, column: 104)
!917 = distinct !DILexicalBlock(scope: !914, file: !4, line: 3845, column: 70)
!918 = !DISubprogram(name: "_Pickler_OpcodeBoundary", scope: !4, file: !4, line: 888, type: !919, isLocal: true, isDefinition: true, scopeLine: 889, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PicklerObject*)* @_Pickler_OpcodeBoundary, variables: !921)
!919 = !DISubroutineType(types: !920)
!920 = !{!138, !445}
!921 = !{!922, !923}
!922 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !918, file: !4, line: 888, type: !445)
!923 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frame_len", scope: !918, file: !4, line: 890, type: !105)
!924 = !DISubprogram(name: "_Pickler_CommitFrame", scope: !4, file: !4, line: 873, type: !919, isLocal: true, isDefinition: true, scopeLine: 874, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PicklerObject*)* @_Pickler_CommitFrame, variables: !925)
!925 = !{!926, !927, !928}
!926 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !924, file: !4, line: 873, type: !445)
!927 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frame_len", scope: !924, file: !4, line: 875, type: !189)
!928 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qdata", scope: !924, file: !4, line: 876, type: !146)
!929 = !DISubprogram(name: "_Pickler_WriteFrameHeader", scope: !4, file: !4, line: 866, type: !930, isLocal: true, isDefinition: true, scopeLine: 867, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PicklerObject*, i8*, i64)* @_Pickler_WriteFrameHeader, variables: !932)
!930 = !DISubroutineType(types: !931)
!931 = !{null, !445, !146, !189}
!932 = !{!933, !934, !935}
!933 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !929, file: !4, line: 866, type: !445)
!934 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "qdata", arg: 2, scope: !929, file: !4, line: 866, type: !146)
!935 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frame_len", arg: 3, scope: !929, file: !4, line: 866, type: !189)
