; ModuleID = 'programs_new/Python-new/_posixsubprocess.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!147 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140)
!148 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141)
!149 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142)
!150 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143)
!151 = !DIEnumerator(name: "_SC_FIFO", value: 144)
!152 = !DIEnumerator(name: "_SC_PIPE", value: 145)
!153 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146)
!154 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147)
!155 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148)
!156 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149)
!157 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150)
!158 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151)
!159 = !DIEnumerator(name: "_SC_NETWORKING", value: 152)
!160 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153)
!161 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154)
!162 = !DIEnumerator(name: "_SC_REGEXP", value: 155)
!163 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156)
!164 = !DIEnumerator(name: "_SC_SHELL", value: 157)
!165 = !DIEnumerator(name: "_SC_SIGNALS", value: 158)
!166 = !DIEnumerator(name: "_SC_SPAWN", value: 159)
!167 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160)
!168 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161)
!169 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162)
!170 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163)
!171 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164)
!172 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165)
!173 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166)
!174 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167)
!175 = !DIEnumerator(name: "_SC_2_PBS", value: 168)
!176 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169)
!177 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170)
!178 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171)
!179 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172)
!180 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173)
!181 = !DIEnumerator(name: "_SC_STREAMS", value: 174)
!182 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175)
!183 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!184 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!185 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!186 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!187 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!188 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!189 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!190 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!191 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!192 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!193 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!194 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!195 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!196 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!197 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!198 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!199 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!200 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!201 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!202 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!203 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!204 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
!205 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198)
!206 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199)
!207 = !DIEnumerator(name: "_SC_IPV6", value: 235)
!208 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236)
!209 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237)
!210 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238)
!211 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!212 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!213 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!214 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!215 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!216 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!217 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!218 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!219 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!220 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!221 = !{!222, !223, !561, !562, !571, !262, !579}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !225, line: 109, baseType: !226)
!225 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !225, line: 105, size: 128, align: 64, elements: !227)
!227 = !{!228, !236}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !226, file: !225, line: 107, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !230, line: 177, baseType: !231)
!230 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !232, line: 102, baseType: !233)
!232 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !234, line: 181, baseType: !235)
!234 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!235 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !226, file: !225, line: 108, baseType: !237, size: 64, align: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !225, line: 334, size: 3200, align: 64, elements: !239)
!239 = !{!240, !246, !250, !251, !252, !257, !320, !325, !330, !331, !336, !388, !419, !431, !437, !438, !439, !441, !443, !474, !475, !476, !485, !486, !491, !492, !494, !496, !506, !509, !527, !528, !529, !531, !533, !534, !536, !541, !546, !551, !552, !553, !554, !555, !556, !557, !558, !560}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !238, file: !225, line: 335, baseType: !241, size: 192, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !225, line: 114, baseType: !242)
!242 = !DICompositeType(tag: DW_TAG_structure_type, file: !225, line: 111, size: 192, align: 64, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !242, file: !225, line: 112, baseType: !224, size: 128, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !242, file: !225, line: 113, baseType: !229, size: 64, align: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !238, file: !225, line: 336, baseType: !247, size: 64, align: 64, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!249 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !238, file: !225, line: 337, baseType: !229, size: 64, align: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !238, file: !225, line: 337, baseType: !229, size: 64, align: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !238, file: !225, line: 341, baseType: !253, size: 64, align: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !225, line: 308, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !223}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !238, file: !225, line: 342, baseType: !258, size: 64, align: 64, offset: 448)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !225, line: 314, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!262, !223, !263, !262}
!262 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !232, line: 48, baseType: !265)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !266, line: 246, size: 1728, align: 64, elements: !267)
!266 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!267 = !{!268, !269, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !289, !290, !291, !292, !294, !296, !298, !302, !305, !307, !308, !309, !310, !311, !315, !316}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !265, file: !266, line: 247, baseType: !262, size: 32, align: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !265, file: !266, line: 252, baseType: !270, size: 64, align: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !265, file: !266, line: 253, baseType: !270, size: 64, align: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !265, file: !266, line: 254, baseType: !270, size: 64, align: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !265, file: !266, line: 255, baseType: !270, size: 64, align: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !265, file: !266, line: 256, baseType: !270, size: 64, align: 64, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !265, file: !266, line: 257, baseType: !270, size: 64, align: 64, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !265, file: !266, line: 258, baseType: !270, size: 64, align: 64, offset: 448)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !265, file: !266, line: 259, baseType: !270, size: 64, align: 64, offset: 512)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !265, file: !266, line: 261, baseType: !270, size: 64, align: 64, offset: 576)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !265, file: !266, line: 262, baseType: !270, size: 64, align: 64, offset: 640)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !265, file: !266, line: 263, baseType: !270, size: 64, align: 64, offset: 704)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !265, file: !266, line: 265, baseType: !282, size: 64, align: 64, offset: 768)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !266, line: 161, size: 192, align: 64, elements: !284)
!284 = !{!285, !286, !288}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !283, file: !266, line: 162, baseType: !282, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !283, file: !266, line: 163, baseType: !287, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !283, file: !266, line: 167, baseType: !262, size: 32, align: 32, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !265, file: !266, line: 267, baseType: !287, size: 64, align: 64, offset: 832)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !265, file: !266, line: 269, baseType: !262, size: 32, align: 32, offset: 896)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !265, file: !266, line: 273, baseType: !262, size: 32, align: 32, offset: 928)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !265, file: !266, line: 275, baseType: !293, size: 64, align: 64, offset: 960)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !234, line: 140, baseType: !235)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !265, file: !266, line: 279, baseType: !295, size: 16, align: 16, offset: 1024)
!295 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !265, file: !266, line: 280, baseType: !297, size: 8, align: 8, offset: 1040)
!297 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !265, file: !266, line: 281, baseType: !299, size: 8, align: 8, offset: 1048)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 8, align: 8, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 1)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !265, file: !266, line: 285, baseType: !303, size: 64, align: 64, offset: 1088)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !266, line: 155, baseType: null)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !265, file: !266, line: 294, baseType: !306, size: 64, align: 64, offset: 1152)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !234, line: 141, baseType: !235)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !265, file: !266, line: 303, baseType: !222, size: 64, align: 64, offset: 1216)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !265, file: !266, line: 304, baseType: !222, size: 64, align: 64, offset: 1280)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !265, file: !266, line: 305, baseType: !222, size: 64, align: 64, offset: 1344)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !265, file: !266, line: 306, baseType: !222, size: 64, align: 64, offset: 1408)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !265, file: !266, line: 307, baseType: !312, size: 64, align: 64, offset: 1472)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !313, line: 62, baseType: !314)
!313 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!314 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !265, file: !266, line: 309, baseType: !262, size: 32, align: 32, offset: 1536)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !265, file: !266, line: 311, baseType: !317, size: 160, align: 8, offset: 1568)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 160, align: 8, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 20)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !238, file: !225, line: 343, baseType: !321, size: 64, align: 64, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !225, line: 316, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!223, !223, !270}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !238, file: !225, line: 344, baseType: !326, size: 64, align: 64, offset: 576)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !225, line: 318, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!262, !223, !270, !223}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !238, file: !225, line: 345, baseType: !222, size: 64, align: 64, offset: 640)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !238, file: !225, line: 346, baseType: !332, size: 64, align: 64, offset: 704)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !225, line: 320, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!223, !223}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !238, file: !225, line: 350, baseType: !337, size: 64, align: 64, offset: 768)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !225, line: 278, baseType: !339)
!339 = !DICompositeType(tag: DW_TAG_structure_type, file: !225, line: 236, size: 2176, align: 64, elements: !340)
!340 = !{!341, !346, !347, !348, !349, !350, !355, !357, !358, !359, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !339, file: !225, line: 241, baseType: !342, size: 64, align: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !225, line: 166, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!223, !223, !223}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !339, file: !225, line: 242, baseType: !342, size: 64, align: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !339, file: !225, line: 243, baseType: !342, size: 64, align: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !339, file: !225, line: 244, baseType: !342, size: 64, align: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !339, file: !225, line: 245, baseType: !342, size: 64, align: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !339, file: !225, line: 246, baseType: !351, size: 64, align: 64, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !225, line: 167, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!223, !223, !223, !223}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !339, file: !225, line: 247, baseType: !356, size: 64, align: 64, offset: 384)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !225, line: 165, baseType: !333)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !339, file: !225, line: 248, baseType: !356, size: 64, align: 64, offset: 448)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !339, file: !225, line: 249, baseType: !356, size: 64, align: 64, offset: 512)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !339, file: !225, line: 250, baseType: !360, size: 64, align: 64, offset: 576)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !225, line: 168, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!262, !223}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !339, file: !225, line: 251, baseType: !356, size: 64, align: 64, offset: 640)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !339, file: !225, line: 252, baseType: !342, size: 64, align: 64, offset: 704)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !339, file: !225, line: 253, baseType: !342, size: 64, align: 64, offset: 768)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !339, file: !225, line: 254, baseType: !342, size: 64, align: 64, offset: 832)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !339, file: !225, line: 255, baseType: !342, size: 64, align: 64, offset: 896)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !339, file: !225, line: 256, baseType: !342, size: 64, align: 64, offset: 960)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !339, file: !225, line: 257, baseType: !356, size: 64, align: 64, offset: 1024)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !339, file: !225, line: 258, baseType: !222, size: 64, align: 64, offset: 1088)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !339, file: !225, line: 259, baseType: !356, size: 64, align: 64, offset: 1152)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !339, file: !225, line: 261, baseType: !342, size: 64, align: 64, offset: 1216)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !339, file: !225, line: 262, baseType: !342, size: 64, align: 64, offset: 1280)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !339, file: !225, line: 263, baseType: !342, size: 64, align: 64, offset: 1344)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !339, file: !225, line: 264, baseType: !342, size: 64, align: 64, offset: 1408)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !339, file: !225, line: 265, baseType: !351, size: 64, align: 64, offset: 1472)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !339, file: !225, line: 266, baseType: !342, size: 64, align: 64, offset: 1536)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !339, file: !225, line: 267, baseType: !342, size: 64, align: 64, offset: 1600)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !339, file: !225, line: 268, baseType: !342, size: 64, align: 64, offset: 1664)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !339, file: !225, line: 269, baseType: !342, size: 64, align: 64, offset: 1728)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !339, file: !225, line: 270, baseType: !342, size: 64, align: 64, offset: 1792)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !339, file: !225, line: 272, baseType: !342, size: 64, align: 64, offset: 1856)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !339, file: !225, line: 273, baseType: !342, size: 64, align: 64, offset: 1920)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !339, file: !225, line: 274, baseType: !342, size: 64, align: 64, offset: 1984)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !339, file: !225, line: 275, baseType: !342, size: 64, align: 64, offset: 2048)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !339, file: !225, line: 277, baseType: !356, size: 64, align: 64, offset: 2112)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !238, file: !225, line: 351, baseType: !389, size: 64, align: 64, offset: 832)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !225, line: 292, baseType: !391)
!391 = !DICompositeType(tag: DW_TAG_structure_type, file: !225, line: 280, size: 640, align: 64, elements: !392)
!392 = !{!393, !398, !399, !404, !405, !406, !411, !412, !417, !418}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !391, file: !225, line: 281, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !225, line: 169, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!229, !223}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !391, file: !225, line: 282, baseType: !342, size: 64, align: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !391, file: !225, line: 283, baseType: !400, size: 64, align: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !225, line: 170, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!223, !223, !229}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !391, file: !225, line: 284, baseType: !400, size: 64, align: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !391, file: !225, line: 285, baseType: !222, size: 64, align: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !391, file: !225, line: 286, baseType: !407, size: 64, align: 64, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !225, line: 172, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!262, !223, !229, !223}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !391, file: !225, line: 287, baseType: !222, size: 64, align: 64, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !391, file: !225, line: 288, baseType: !413, size: 64, align: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !225, line: 231, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!262, !223, !223}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !391, file: !225, line: 290, baseType: !342, size: 64, align: 64, offset: 512)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !391, file: !225, line: 291, baseType: !400, size: 64, align: 64, offset: 576)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !238, file: !225, line: 352, baseType: !420, size: 64, align: 64, offset: 896)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !225, line: 298, baseType: !422)
!422 = !DICompositeType(tag: DW_TAG_structure_type, file: !225, line: 294, size: 192, align: 64, elements: !423)
!423 = !{!424, !425, !426}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !422, file: !225, line: 295, baseType: !394, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !422, file: !225, line: 296, baseType: !342, size: 64, align: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !422, file: !225, line: 297, baseType: !427, size: 64, align: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !225, line: 174, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!262, !223, !223, !223}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !238, file: !225, line: 356, baseType: !432, size: 64, align: 64, offset: 960)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !225, line: 321, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!436, !223}
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !230, line: 186, baseType: !229)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !238, file: !225, line: 357, baseType: !351, size: 64, align: 64, offset: 1024)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !238, file: !225, line: 358, baseType: !332, size: 64, align: 64, offset: 1088)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !238, file: !225, line: 359, baseType: !440, size: 64, align: 64, offset: 1152)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !225, line: 317, baseType: !343)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !238, file: !225, line: 360, baseType: !442, size: 64, align: 64, offset: 1216)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !225, line: 319, baseType: !428)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !238, file: !225, line: 363, baseType: !444, size: 64, align: 64, offset: 1280)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !225, line: 304, baseType: !446)
!446 = !DICompositeType(tag: DW_TAG_structure_type, file: !225, line: 301, size: 128, align: 64, elements: !447)
!447 = !{!448, !469}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !446, file: !225, line: 302, baseType: !449, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !225, line: 193, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!262, !223, !453, !262}
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !225, line: 191, baseType: !455)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !225, line: 178, size: 640, align: 64, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !462, !463, !464, !466, !467, !468}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !455, file: !225, line: 179, baseType: !222, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !455, file: !225, line: 180, baseType: !223, size: 64, align: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !455, file: !225, line: 181, baseType: !229, size: 64, align: 64, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !455, file: !225, line: 182, baseType: !229, size: 64, align: 64, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !455, file: !225, line: 184, baseType: !262, size: 32, align: 32, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !455, file: !225, line: 185, baseType: !262, size: 32, align: 32, offset: 288)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !455, file: !225, line: 186, baseType: !270, size: 64, align: 64, offset: 320)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !455, file: !225, line: 187, baseType: !465, size: 64, align: 64, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !455, file: !225, line: 188, baseType: !465, size: 64, align: 64, offset: 448)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !455, file: !225, line: 189, baseType: !465, size: 64, align: 64, offset: 512)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !455, file: !225, line: 190, baseType: !222, size: 64, align: 64, offset: 576)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !446, file: !225, line: 303, baseType: !470, size: 64, align: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !225, line: 194, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !223, !453}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !238, file: !225, line: 366, baseType: !314, size: 64, align: 64, offset: 1344)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !238, file: !225, line: 368, baseType: !247, size: 64, align: 64, offset: 1408)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !238, file: !225, line: 372, baseType: !477, size: 64, align: 64, offset: 1472)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !225, line: 233, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!262, !223, !481, !222}
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !225, line: 232, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!262, !223, !222}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !238, file: !225, line: 375, baseType: !360, size: 64, align: 64, offset: 1536)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !238, file: !225, line: 379, baseType: !487, size: 64, align: 64, offset: 1600)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !225, line: 322, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!223, !223, !223, !262}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !238, file: !225, line: 382, baseType: !229, size: 64, align: 64, offset: 1664)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !238, file: !225, line: 385, baseType: !493, size: 64, align: 64, offset: 1728)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !225, line: 323, baseType: !333)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !238, file: !225, line: 386, baseType: !495, size: 64, align: 64, offset: 1792)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !225, line: 324, baseType: !333)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !238, file: !225, line: 389, baseType: !497, size: 64, align: 64, offset: 1856)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !499, line: 40, size: 256, align: 64, elements: !500)
!499 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!500 = !{!501, !502, !504, !505}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !498, file: !499, line: 41, baseType: !247, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !498, file: !499, line: 42, baseType: !503, size: 64, align: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !499, line: 18, baseType: !343)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !498, file: !499, line: 43, baseType: !262, size: 32, align: 32, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !498, file: !499, line: 45, baseType: !247, size: 64, align: 64, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !238, file: !225, line: 390, baseType: !507, size: 64, align: 64, offset: 1920)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !225, line: 390, flags: DIFlagFwdDecl)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !238, file: !225, line: 391, baseType: !510, size: 64, align: 64, offset: 1984)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64, align: 64)
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !512, line: 11, size: 320, align: 64, elements: !513)
!512 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!513 = !{!514, !515, !520, !525, !526}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !511, file: !512, line: 12, baseType: !270, size: 64, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !511, file: !512, line: 13, baseType: !516, size: 64, align: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !512, line: 8, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{!223, !223, !222}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !511, file: !512, line: 14, baseType: !521, size: 64, align: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !512, line: 9, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64, align: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!262, !223, !223, !222}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !511, file: !512, line: 15, baseType: !270, size: 64, align: 64, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !511, file: !512, line: 16, baseType: !222, size: 64, align: 64, offset: 256)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !238, file: !225, line: 392, baseType: !237, size: 64, align: 64, offset: 2048)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !238, file: !225, line: 393, baseType: !223, size: 64, align: 64, offset: 2112)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !238, file: !225, line: 394, baseType: !530, size: 64, align: 64, offset: 2176)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !225, line: 325, baseType: !352)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !238, file: !225, line: 395, baseType: !532, size: 64, align: 64, offset: 2240)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !225, line: 326, baseType: !428)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !238, file: !225, line: 396, baseType: !229, size: 64, align: 64, offset: 2304)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !238, file: !225, line: 397, baseType: !535, size: 64, align: 64, offset: 2368)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !225, line: 327, baseType: !428)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !238, file: !225, line: 398, baseType: !537, size: 64, align: 64, offset: 2432)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !225, line: 329, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64, align: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!223, !237, !229}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !238, file: !225, line: 399, baseType: !542, size: 64, align: 64, offset: 2496)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !225, line: 328, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!223, !237, !223, !223}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !238, file: !225, line: 400, baseType: !547, size: 64, align: 64, offset: 2560)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !225, line: 307, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64, align: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{null, !222}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !238, file: !225, line: 401, baseType: !360, size: 64, align: 64, offset: 2624)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !238, file: !225, line: 402, baseType: !223, size: 64, align: 64, offset: 2688)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !238, file: !225, line: 403, baseType: !223, size: 64, align: 64, offset: 2752)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !238, file: !225, line: 404, baseType: !223, size: 64, align: 64, offset: 2816)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !238, file: !225, line: 405, baseType: !223, size: 64, align: 64, offset: 2880)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !238, file: !225, line: 406, baseType: !223, size: 64, align: 64, offset: 2944)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !238, file: !225, line: 407, baseType: !253, size: 64, align: 64, offset: 3008)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !238, file: !225, line: 410, baseType: !559, size: 32, align: 32, offset: 3072)
!559 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !238, file: !225, line: 412, baseType: !253, size: 64, align: 64, offset: 3136)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !564, line: 40, baseType: !565)
!564 = !DIFile(filename: "./Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!565 = !DICompositeType(tag: DW_TAG_structure_type, file: !564, line: 23, size: 320, align: 64, elements: !566)
!566 = !{!567, !568, !570}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !565, file: !564, line: 24, baseType: !241, size: 192, align: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !565, file: !564, line: 26, baseType: !569, size: 64, align: 64, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !565, file: !564, line: 39, baseType: !229, size: 64, align: 64, offset: 256)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !573, line: 33, baseType: !574)
!573 = !DIFile(filename: "./Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!574 = !DICompositeType(tag: DW_TAG_structure_type, file: !573, line: 25, size: 256, align: 64, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !574, file: !573, line: 26, baseType: !241, size: 192, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !574, file: !573, line: 27, baseType: !578, size: 64, align: 64, offset: 192)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 64, align: 64, elements: !300)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64, align: 64)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_dirent64", file: !581, line: 208, size: 2240, align: 64, elements: !582)
!581 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_posixsubprocess.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!582 = !{!583, !585, !587, !588, !590}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !580, file: !581, line: 209, baseType: !584, size: 64, align: 64)
!584 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !580, file: !581, line: 210, baseType: !586, size: 64, align: 64, offset: 64)
!586 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !580, file: !581, line: 211, baseType: !295, size: 16, align: 16, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !580, file: !581, line: 212, baseType: !589, size: 8, align: 8, offset: 144)
!589 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !580, file: !581, line: 213, baseType: !591, size: 2048, align: 8, offset: 152)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 2048, align: 8, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 256)
!594 = !{!595, !599, !725, !736, !778, !791, !813, !826, !832, !843}
!595 = !DISubprogram(name: "PyInit__posixsubprocess", scope: !581, file: !581, line: 760, type: !596, isLocal: false, isDefinition: true, scopeLine: 761, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__posixsubprocess, variables: !598)
!596 = !DISubroutineType(types: !597)
!597 = !{!223}
!598 = !{}
!599 = !DISubprogram(name: "subprocess_fork_exec", scope: !581, file: !581, line: 518, type: !344, isLocal: true, isDefinition: true, scopeLine: 519, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @subprocess_fork_exec, variables: !600)
!600 = !{!601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !630, !631, !634, !635, !636, !637, !640, !644, !646, !650, !654, !656, !660, !663, !666, !670, !671, !673, !677, !679, !683, !685, !688, !692, !695, !697, !700, !702, !705, !707, !710, !712, !715, !717, !720, !722}
!601 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !599, file: !581, line: 518, type: !223)
!602 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !599, file: !581, line: 518, type: !223)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gc_module", scope: !599, file: !581, line: 520, type: !223)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "executable_list", scope: !599, file: !581, line: 521, type: !223)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "py_fds_to_keep", scope: !599, file: !581, line: 521, type: !223)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "env_list", scope: !599, file: !581, line: 522, type: !223)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "preexec_fn", scope: !599, file: !581, line: 522, type: !223)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "process_args", scope: !599, file: !581, line: 523, type: !223)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "converted_args", scope: !599, file: !581, line: 523, type: !223)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fast_args", scope: !599, file: !581, line: 523, type: !223)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "preexec_fn_args_tuple", scope: !599, file: !581, line: 524, type: !223)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p2cread", scope: !599, file: !581, line: 525, type: !262)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p2cwrite", scope: !599, file: !581, line: 525, type: !262)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2pread", scope: !599, file: !581, line: 525, type: !262)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c2pwrite", scope: !599, file: !581, line: 525, type: !262)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errread", scope: !599, file: !581, line: 525, type: !262)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errwrite", scope: !599, file: !581, line: 525, type: !262)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errpipe_read", scope: !599, file: !581, line: 526, type: !262)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errpipe_write", scope: !599, file: !581, line: 526, type: !262)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "close_fds", scope: !599, file: !581, line: 526, type: !262)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "restore_signals", scope: !599, file: !581, line: 526, type: !262)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "call_setsid", scope: !599, file: !581, line: 527, type: !262)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cwd_obj", scope: !599, file: !581, line: 528, type: !223)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cwd_obj2", scope: !599, file: !581, line: 528, type: !223)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cwd", scope: !599, file: !581, line: 529, type: !247)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pid", scope: !599, file: !581, line: 530, type: !627)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !628, line: 98, baseType: !629)
!628 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !234, line: 142, baseType: !262)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "need_to_reenable_gc", scope: !599, file: !581, line: 531, type: !262)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exec_array", scope: !599, file: !581, line: 532, type: !632)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64, align: 64)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !270)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "argv", scope: !599, file: !581, line: 532, type: !632)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "envp", scope: !599, file: !581, line: 532, type: !632)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg_num", scope: !599, file: !581, line: 533, type: !229)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !638, file: !581, line: 559, type: !223)
!638 = distinct !DILexicalBlock(scope: !639, file: !581, line: 558, column: 42)
!639 = distinct !DILexicalBlock(scope: !599, file: !581, line: 558, column: 9)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !641, file: !581, line: 568, type: !223)
!641 = distinct !DILexicalBlock(scope: !642, file: !581, line: 568, column: 16)
!642 = distinct !DILexicalBlock(scope: !643, file: !581, line: 567, column: 35)
!643 = distinct !DILexicalBlock(scope: !638, file: !581, line: 567, column: 13)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !645, file: !581, line: 572, type: !223)
!645 = distinct !DILexicalBlock(scope: !638, file: !581, line: 572, column: 12)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !647, file: !581, line: 574, type: !223)
!647 = distinct !DILexicalBlock(scope: !648, file: !581, line: 574, column: 16)
!648 = distinct !DILexicalBlock(scope: !649, file: !581, line: 573, column: 40)
!649 = distinct !DILexicalBlock(scope: !638, file: !581, line: 573, column: 13)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !651, file: !581, line: 579, type: !223)
!651 = distinct !DILexicalBlock(scope: !652, file: !581, line: 579, column: 16)
!652 = distinct !DILexicalBlock(scope: !653, file: !581, line: 578, column: 35)
!653 = distinct !DILexicalBlock(scope: !638, file: !581, line: 578, column: 13)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !655, file: !581, line: 582, type: !223)
!655 = distinct !DILexicalBlock(scope: !638, file: !581, line: 582, column: 12)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !657, file: !581, line: 587, type: !223)
!657 = distinct !DILexicalBlock(scope: !658, file: !581, line: 587, column: 12)
!658 = distinct !DILexicalBlock(scope: !659, file: !581, line: 586, column: 22)
!659 = distinct !DILexicalBlock(scope: !599, file: !581, line: 586, column: 9)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !661, file: !581, line: 587, type: !223)
!661 = distinct !DILexicalBlock(scope: !662, file: !581, line: 587, column: 105)
!662 = distinct !DILexicalBlock(scope: !657, file: !581, line: 587, column: 71)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_args", scope: !664, file: !581, line: 595, type: !229)
!664 = distinct !DILexicalBlock(scope: !665, file: !581, line: 594, column: 44)
!665 = distinct !DILexicalBlock(scope: !599, file: !581, line: 594, column: 9)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "borrowed_arg", scope: !667, file: !581, line: 606, type: !223)
!667 = distinct !DILexicalBlock(scope: !668, file: !581, line: 605, column: 58)
!668 = distinct !DILexicalBlock(scope: !669, file: !581, line: 605, column: 9)
!669 = distinct !DILexicalBlock(scope: !664, file: !581, line: 605, column: 9)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "converted_arg", scope: !667, file: !581, line: 606, type: !223)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !672, file: !581, line: 614, type: !223)
!672 = distinct !DILexicalBlock(scope: !664, file: !581, line: 614, column: 12)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !674, file: !581, line: 614, type: !223)
!674 = distinct !DILexicalBlock(scope: !675, file: !581, line: 614, column: 127)
!675 = distinct !DILexicalBlock(scope: !676, file: !581, line: 614, column: 91)
!676 = distinct !DILexicalBlock(scope: !672, file: !581, line: 614, column: 68)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !678, file: !581, line: 615, type: !223)
!678 = distinct !DILexicalBlock(scope: !664, file: !581, line: 615, column: 12)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !680, file: !581, line: 615, type: !223)
!680 = distinct !DILexicalBlock(scope: !681, file: !581, line: 615, column: 117)
!681 = distinct !DILexicalBlock(scope: !682, file: !581, line: 615, column: 86)
!682 = distinct !DILexicalBlock(scope: !678, file: !581, line: 615, column: 63)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !684, file: !581, line: 667, type: !223)
!684 = distinct !DILexicalBlock(scope: !599, file: !581, line: 667, column: 8)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !686, file: !581, line: 667, type: !223)
!686 = distinct !DILexicalBlock(scope: !687, file: !581, line: 667, column: 100)
!687 = distinct !DILexicalBlock(scope: !684, file: !581, line: 667, column: 66)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !689, file: !581, line: 688, type: !223)
!689 = distinct !DILexicalBlock(scope: !690, file: !581, line: 688, column: 12)
!690 = distinct !DILexicalBlock(scope: !691, file: !581, line: 687, column: 55)
!691 = distinct !DILexicalBlock(scope: !599, file: !581, line: 687, column: 9)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !693, file: !581, line: 688, type: !223)
!693 = distinct !DILexicalBlock(scope: !694, file: !581, line: 688, column: 105)
!694 = distinct !DILexicalBlock(scope: !689, file: !581, line: 688, column: 71)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !696, file: !581, line: 691, type: !223)
!696 = distinct !DILexicalBlock(scope: !599, file: !581, line: 691, column: 8)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !698, file: !581, line: 691, type: !223)
!698 = distinct !DILexicalBlock(scope: !699, file: !581, line: 691, column: 113)
!699 = distinct !DILexicalBlock(scope: !696, file: !581, line: 691, column: 79)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !701, file: !581, line: 692, type: !223)
!701 = distinct !DILexicalBlock(scope: !599, file: !581, line: 692, column: 8)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !703, file: !581, line: 692, type: !223)
!703 = distinct !DILexicalBlock(scope: !704, file: !581, line: 692, column: 101)
!704 = distinct !DILexicalBlock(scope: !701, file: !581, line: 692, column: 67)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !706, file: !581, line: 705, type: !223)
!706 = distinct !DILexicalBlock(scope: !599, file: !581, line: 705, column: 8)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !708, file: !581, line: 705, type: !223)
!708 = distinct !DILexicalBlock(scope: !709, file: !581, line: 705, column: 106)
!709 = distinct !DILexicalBlock(scope: !706, file: !581, line: 705, column: 72)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !711, file: !581, line: 706, type: !223)
!711 = distinct !DILexicalBlock(scope: !599, file: !581, line: 706, column: 8)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !713, file: !581, line: 706, type: !223)
!713 = distinct !DILexicalBlock(scope: !714, file: !581, line: 706, column: 101)
!714 = distinct !DILexicalBlock(scope: !711, file: !581, line: 706, column: 67)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !716, file: !581, line: 707, type: !223)
!716 = distinct !DILexicalBlock(scope: !599, file: !581, line: 707, column: 8)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !718, file: !581, line: 707, type: !223)
!718 = distinct !DILexicalBlock(scope: !719, file: !581, line: 707, column: 113)
!719 = distinct !DILexicalBlock(scope: !716, file: !581, line: 707, column: 79)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !721, file: !581, line: 712, type: !223)
!721 = distinct !DILexicalBlock(scope: !599, file: !581, line: 712, column: 8)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !723, file: !581, line: 712, type: !223)
!723 = distinct !DILexicalBlock(scope: !724, file: !581, line: 712, column: 101)
!724 = distinct !DILexicalBlock(scope: !721, file: !581, line: 712, column: 67)
!725 = !DISubprogram(name: "_sanity_check_python_fd_sequence", scope: !581, file: !581, line: 106, type: !362, isLocal: true, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @_sanity_check_python_fd_sequence, variables: !726)
!726 = !{!727, !728, !729, !730, !731, !735}
!727 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd_sequence", arg: 1, scope: !725, file: !581, line: 106, type: !223)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seq_idx", scope: !725, file: !581, line: 108, type: !229)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seq_len", scope: !725, file: !581, line: 108, type: !229)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev_fd", scope: !725, file: !581, line: 109, type: !235)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "py_fd", scope: !732, file: !581, line: 111, type: !223)
!732 = distinct !DILexicalBlock(scope: !733, file: !581, line: 110, column: 53)
!733 = distinct !DILexicalBlock(scope: !734, file: !581, line: 110, column: 5)
!734 = distinct !DILexicalBlock(scope: !725, file: !581, line: 110, column: 5)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iter_fd", scope: !732, file: !581, line: 112, type: !235)
!736 = !DISubprogram(name: "child_exec", scope: !581, file: !581, line: 358, type: !737, isLocal: true, isDefinition: true, scopeLine: 371, flags: DIFlagPrototyped, isOptimized: true, function: void (i8**, i8**, i8**, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct._object*, %struct._object*, %struct._object*)* @child_exec, variables: !739)
!737 = !DISubroutineType(types: !738)
!738 = !{null, !632, !632, !632, !247, !262, !262, !262, !262, !262, !262, !262, !262, !262, !262, !262, !223, !223, !223}
!739 = !{!740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !768, !771, !775}
!740 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exec_array", arg: 1, scope: !736, file: !581, line: 358, type: !632)
!741 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 2, scope: !736, file: !581, line: 359, type: !632)
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "envp", arg: 3, scope: !736, file: !581, line: 360, type: !632)
!743 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cwd", arg: 4, scope: !736, file: !581, line: 361, type: !247)
!744 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p2cread", arg: 5, scope: !736, file: !581, line: 362, type: !262)
!745 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p2cwrite", arg: 6, scope: !736, file: !581, line: 362, type: !262)
!746 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c2pread", arg: 7, scope: !736, file: !581, line: 363, type: !262)
!747 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c2pwrite", arg: 8, scope: !736, file: !581, line: 363, type: !262)
!748 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errread", arg: 9, scope: !736, file: !581, line: 364, type: !262)
!749 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errwrite", arg: 10, scope: !736, file: !581, line: 364, type: !262)
!750 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errpipe_read", arg: 11, scope: !736, file: !581, line: 365, type: !262)
!751 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errpipe_write", arg: 12, scope: !736, file: !581, line: 365, type: !262)
!752 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "close_fds", arg: 13, scope: !736, file: !581, line: 366, type: !262)
!753 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "restore_signals", arg: 14, scope: !736, file: !581, line: 366, type: !262)
!754 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "call_setsid", arg: 15, scope: !736, file: !581, line: 367, type: !262)
!755 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "py_fds_to_keep", arg: 16, scope: !736, file: !581, line: 368, type: !223)
!756 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "preexec_fn", arg: 17, scope: !736, file: !581, line: 369, type: !223)
!757 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "preexec_fn_args_tuple", arg: 18, scope: !736, file: !581, line: 370, type: !223)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !736, file: !581, line: 372, type: !262)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "saved_errno", scope: !736, file: !581, line: 372, type: !262)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unused", scope: !736, file: !581, line: 372, type: !262)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reached_preexec", scope: !736, file: !581, line: 372, type: !262)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !736, file: !581, line: 373, type: !223)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err_msg", scope: !736, file: !581, line: 374, type: !247)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hex_errno", scope: !736, file: !581, line: 376, type: !765)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 72, align: 8, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 9)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "local_max_fd", scope: !769, file: !581, line: 460, type: !262)
!769 = distinct !DILexicalBlock(scope: !770, file: !581, line: 459, column: 20)
!770 = distinct !DILexicalBlock(scope: !736, file: !581, line: 459, column: 9)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "executable", scope: !772, file: !581, line: 474, type: !247)
!772 = distinct !DILexicalBlock(scope: !773, file: !581, line: 473, column: 51)
!773 = distinct !DILexicalBlock(scope: !774, file: !581, line: 473, column: 5)
!774 = distinct !DILexicalBlock(scope: !736, file: !581, line: 473, column: 5)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur", scope: !776, file: !581, line: 494, type: !270)
!776 = distinct !DILexicalBlock(scope: !777, file: !581, line: 493, column: 22)
!777 = distinct !DILexicalBlock(scope: !736, file: !581, line: 493, column: 9)
!778 = !DISubprogram(name: "make_inheritable", scope: !581, file: !581, line: 146, type: !779, isLocal: true, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i32)* @make_inheritable, variables: !781)
!779 = !DISubroutineType(types: !780)
!780 = !{!262, !223, !262}
!781 = !{!782, !783, !784, !785, !786, !790}
!782 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "py_fds_to_keep", arg: 1, scope: !778, file: !581, line: 146, type: !223)
!783 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errpipe_write", arg: 2, scope: !778, file: !581, line: 146, type: !262)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !778, file: !581, line: 148, type: !229)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !778, file: !581, line: 148, type: !229)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fdobj", scope: !787, file: !581, line: 152, type: !223)
!787 = distinct !DILexicalBlock(scope: !788, file: !581, line: 151, column: 31)
!788 = distinct !DILexicalBlock(scope: !789, file: !581, line: 151, column: 5)
!789 = distinct !DILexicalBlock(scope: !778, file: !581, line: 151, column: 5)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !787, file: !581, line: 153, type: !235)
!791 = !DISubprogram(name: "_close_open_fd_range_safe", scope: !581, file: !581, line: 232, type: !792, isLocal: true, isDefinition: true, scopeLine: 233, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, %struct._object*)* @_close_open_fd_range_safe, variables: !794)
!792 = !DISubroutineType(types: !793)
!793 = !{null, !262, !262, !223}
!794 = !{!795, !796, !797, !798, !799, !805, !806, !808, !809}
!795 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start_fd", arg: 1, scope: !791, file: !581, line: 232, type: !262)
!796 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end_fd", arg: 2, scope: !791, file: !581, line: 232, type: !262)
!797 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "py_fds_to_keep", arg: 3, scope: !791, file: !581, line: 232, type: !223)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd_dir_fd", scope: !791, file: !581, line: 234, type: !262)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !800, file: !581, line: 244, type: !802)
!800 = distinct !DILexicalBlock(scope: !801, file: !581, line: 243, column: 12)
!801 = distinct !DILexicalBlock(scope: !791, file: !581, line: 239, column: 9)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 2240, align: 8, elements: !803)
!803 = !{!804}
!804 = !DISubrange(count: 280)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !800, file: !581, line: 245, type: !262)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !807, file: !581, line: 249, type: !579)
!807 = distinct !DILexicalBlock(scope: !800, file: !581, line: 248, column: 55)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !807, file: !581, line: 250, type: !262)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !810, file: !581, line: 252, type: !262)
!810 = distinct !DILexicalBlock(scope: !811, file: !581, line: 251, column: 73)
!811 = distinct !DILexicalBlock(scope: !812, file: !581, line: 251, column: 13)
!812 = distinct !DILexicalBlock(scope: !807, file: !581, line: 251, column: 13)
!813 = !DISubprogram(name: "_close_fds_by_brute_force", scope: !581, file: !581, line: 175, type: !792, isLocal: true, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i32, %struct._object*)* @_close_fds_by_brute_force, variables: !814)
!814 = !{!815, !816, !817, !818, !819, !820, !821, !825}
!815 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start_fd", arg: 1, scope: !813, file: !581, line: 175, type: !262)
!816 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end_fd", arg: 2, scope: !813, file: !581, line: 175, type: !262)
!817 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "py_fds_to_keep", arg: 3, scope: !813, file: !581, line: 175, type: !223)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_fds_to_keep", scope: !813, file: !581, line: 177, type: !229)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "keep_seq_idx", scope: !813, file: !581, line: 178, type: !229)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd_num", scope: !813, file: !581, line: 179, type: !262)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "py_keep_fd", scope: !822, file: !581, line: 183, type: !223)
!822 = distinct !DILexicalBlock(scope: !823, file: !581, line: 182, column: 76)
!823 = distinct !DILexicalBlock(scope: !824, file: !581, line: 182, column: 5)
!824 = distinct !DILexicalBlock(scope: !813, file: !581, line: 182, column: 5)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "keep_fd", scope: !822, file: !581, line: 185, type: !262)
!826 = !DISubprogram(name: "_pos_int_from_ascii", scope: !581, file: !581, line: 68, type: !827, isLocal: true, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @_pos_int_from_ascii, variables: !829)
!827 = !DISubroutineType(types: !828)
!828 = !{!262, !270}
!829 = !{!830, !831}
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !826, file: !581, line: 68, type: !270)
!831 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num", scope: !826, file: !581, line: 70, type: !262)
!832 = !DISubprogram(name: "_is_fd_in_sorted_fd_sequence", scope: !581, file: !581, line: 124, type: !833, isLocal: true, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct._object*)* @_is_fd_in_sorted_fd_sequence, variables: !835)
!833 = !DISubroutineType(types: !834)
!834 = !{!262, !262, !223}
!835 = !{!836, !837, !838, !839, !840, !842}
!836 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !832, file: !581, line: 124, type: !262)
!837 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd_sequence", arg: 2, scope: !832, file: !581, line: 124, type: !223)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "search_min", scope: !832, file: !581, line: 127, type: !229)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "search_max", scope: !832, file: !581, line: 128, type: !229)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "middle", scope: !841, file: !581, line: 132, type: !235)
!841 = distinct !DILexicalBlock(scope: !832, file: !581, line: 131, column: 8)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "middle_fd", scope: !841, file: !581, line: 133, type: !235)
!843 = !DISubprogram(name: "_enable_gc", scope: !581, file: !581, line: 53, type: !362, isLocal: true, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @_enable_gc, variables: !844)
!844 = !{!845, !846, !847}
!845 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "gc_module", arg: 1, scope: !843, file: !581, line: 53, type: !223)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !843, file: !581, line: 55, type: !223)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !848, file: !581, line: 61, type: !223)
!848 = distinct !DILexicalBlock(scope: !843, file: !581, line: 61, column: 8)
!849 = !{!850, !851, !874, !878, !882, !890, !891, !892}
!850 = !DIGlobalVariable(name: "max_fd", scope: !0, file: !581, line: 48, type: !235, isLocal: true, isDefinition: true, variable: i64* @max_fd)
!851 = !DIGlobalVariable(name: "_posixsubprocessmodule", scope: !0, file: !581, line: 751, type: !852, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @_posixsubprocessmodule)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !853, line: 47, size: 832, align: 64, elements: !854)
!853 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!854 = !{!855, !864, !865, !866, !867, !870, !871, !872, !873}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !852, file: !853, line: 48, baseType: !856, size: 320, align: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !853, line: 38, baseType: !857)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !853, line: 33, size: 320, align: 64, elements: !858)
!858 = !{!859, !860, !862, !863}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !857, file: !853, line: 34, baseType: !224, size: 128, align: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !857, file: !853, line: 35, baseType: !861, size: 64, align: 64, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !857, file: !853, line: 36, baseType: !229, size: 64, align: 64, offset: 192)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !857, file: !853, line: 37, baseType: !223, size: 64, align: 64, offset: 256)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !852, file: !853, line: 49, baseType: !247, size: 64, align: 64, offset: 320)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !852, file: !853, line: 50, baseType: !247, size: 64, align: 64, offset: 384)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !852, file: !853, line: 51, baseType: !229, size: 64, align: 64, offset: 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !852, file: !853, line: 52, baseType: !868, size: 64, align: 64, offset: 512)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64, align: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !499, line: 47, baseType: !498)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !852, file: !853, line: 53, baseType: !360, size: 64, align: 64, offset: 576)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !852, file: !853, line: 54, baseType: !477, size: 64, align: 64, offset: 640)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !852, file: !853, line: 55, baseType: !360, size: 64, align: 64, offset: 704)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !852, file: !853, line: 56, baseType: !547, size: 64, align: 64, offset: 768)
!874 = !DIGlobalVariable(name: "module_doc", scope: !0, file: !581, line: 741, type: !875, isLocal: true, isDefinition: true, variable: [42 x i8]* @module_doc)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 336, align: 8, elements: !876)
!876 = !{!877}
!877 = !DISubrange(count: 42)
!878 = !DIGlobalVariable(name: "module_methods", scope: !0, file: !581, line: 745, type: !879, isLocal: true, isDefinition: true, variable: [2 x %struct.PyMethodDef]* @module_methods)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !869, size: 512, align: 64, elements: !880)
!880 = !{!881}
!881 = !DISubrange(count: 2)
!882 = !DIGlobalVariable(name: "PyId_isenabled", scope: !599, file: !581, line: 560, type: !883, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @subprocess_fork_exec.PyId_isenabled)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !225, line: 144, baseType: !884)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !225, line: 140, size: 192, align: 64, elements: !885)
!885 = !{!886, !888, !889}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !884, file: !225, line: 141, baseType: !887, size: 64, align: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64, align: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !884, file: !225, line: 142, baseType: !247, size: 64, align: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !884, file: !225, line: 143, baseType: !223, size: 64, align: 64, offset: 128)
!890 = !DIGlobalVariable(name: "PyId_disable", scope: !599, file: !581, line: 561, type: !883, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @subprocess_fork_exec.PyId_disable)
!891 = !DIGlobalVariable(name: "PyId_enable", scope: !843, file: !581, line: 56, type: !883, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @_enable_gc.PyId_enable)
!892 = !DIGlobalVariable(name: "subprocess_fork_exec_doc", scope: !0, file: !581, line: 717, type: !893, isLocal: true, isDefinition: true, variable: [789 x i8]* @subprocess_fork_exec_doc)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 6312, align: 8, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 789)
!896 = !{i32 2, !"Dwarf Version", i32 4}
!897 = !{i32 2, !"Debug Info Version", i32 3}
!898 = !{i32 1, !"PIC Level", i32 2}
!899 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!900 = !DILocation(line: 763, column: 14, scope: !595)
!901 = !DILocation(line: 763, column: 12, scope: !595)
!902 = !{!903, !903, i64 0}
!903 = !{!"long", !904, i64 0}
!904 = !{!"omnipotent char", !905, i64 0}
!905 = !{!"Simple C/C++ TBAA"}
!906 = !DILocation(line: 764, column: 9, scope: !907)
!907 = distinct !DILexicalBlock(scope: !595, file: !581, line: 764, column: 9)
!908 = !DILocation(line: 764, column: 16, scope: !907)
!909 = !DILocation(line: 764, column: 9, scope: !595)
!910 = !DILocation(line: 766, column: 16, scope: !907)
!911 = !DILocation(line: 766, column: 9, scope: !907)
!912 = !DILocation(line: 768, column: 12, scope: !595)
!913 = !DILocation(line: 768, column: 5, scope: !595)
!914 = !{!915, !915, i64 0}
!915 = !{!"any pointer", !904, i64 0}
!916 = !DIExpression()
!917 = !DILocation(line: 518, column: 32, scope: !599)
!918 = !DILocation(line: 518, column: 48, scope: !599)
!919 = !DILocation(line: 520, column: 5, scope: !599)
!920 = !DILocation(line: 520, column: 15, scope: !599)
!921 = !DILocation(line: 521, column: 5, scope: !599)
!922 = !DILocation(line: 521, column: 15, scope: !599)
!923 = !DILocation(line: 521, column: 33, scope: !599)
!924 = !DILocation(line: 522, column: 5, scope: !599)
!925 = !DILocation(line: 522, column: 15, scope: !599)
!926 = !DILocation(line: 522, column: 26, scope: !599)
!927 = !DILocation(line: 523, column: 5, scope: !599)
!928 = !DILocation(line: 523, column: 15, scope: !599)
!929 = !DILocation(line: 523, column: 30, scope: !599)
!930 = !DILocation(line: 523, column: 60, scope: !599)
!931 = !DILocation(line: 524, column: 5, scope: !599)
!932 = !DILocation(line: 524, column: 15, scope: !599)
!933 = !DILocation(line: 525, column: 5, scope: !599)
!934 = !DILocation(line: 525, column: 9, scope: !599)
!935 = !DILocation(line: 525, column: 18, scope: !599)
!936 = !DILocation(line: 525, column: 28, scope: !599)
!937 = !DILocation(line: 525, column: 37, scope: !599)
!938 = !DILocation(line: 525, column: 47, scope: !599)
!939 = !DILocation(line: 525, column: 56, scope: !599)
!940 = !DILocation(line: 526, column: 5, scope: !599)
!941 = !DILocation(line: 526, column: 9, scope: !599)
!942 = !DILocation(line: 526, column: 23, scope: !599)
!943 = !DILocation(line: 526, column: 38, scope: !599)
!944 = !DILocation(line: 526, column: 49, scope: !599)
!945 = !DILocation(line: 527, column: 5, scope: !599)
!946 = !DILocation(line: 527, column: 9, scope: !599)
!947 = !DILocation(line: 528, column: 5, scope: !599)
!948 = !DILocation(line: 528, column: 15, scope: !599)
!949 = !DILocation(line: 528, column: 25, scope: !599)
!950 = !DILocation(line: 529, column: 5, scope: !599)
!951 = !DILocation(line: 529, column: 17, scope: !599)
!952 = !DILocation(line: 530, column: 5, scope: !599)
!953 = !DILocation(line: 530, column: 11, scope: !599)
