; ModuleID = 'irs-onlybc/_stat.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !11, globals: !440)
!1 = !DIFile(filename: "_stat.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !10}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !6, line: 70, baseType: !7)
!6 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !8, line: 138, baseType: !9)
!8 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!9 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!10 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!11 = !{!12, !353, !358, !365, !370, !375, !380, !385, !390, !395, !400, !405, !410, !415, !420, !429, !434}
!12 = !DISubprogram(name: "PyInit__stat", scope: !13, file: !13, line: 492, type: !14, isLocal: false, isDefinition: true, scopeLine: 493, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__stat, variables: !351)
!13 = !DIFile(filename: "./Modules/_stat.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!14 = !DISubroutineType(types: !15)
!15 = !{!16}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !18, line: 109, baseType: !19)
!18 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !18, line: 105, size: 128, align: 64, elements: !20)
!20 = !{!21, !28}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !19, file: !18, line: 107, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !23, line: 177, baseType: !24)
!23 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !25, line: 102, baseType: !26)
!25 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !8, line: 181, baseType: !27)
!27 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !19, file: !18, line: 108, baseType: !29, size: 64, align: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !18, line: 334, size: 3200, align: 64, elements: !31)
!31 = !{!32, !38, !42, !43, !44, !49, !111, !116, !121, !122, !127, !179, !210, !222, !228, !229, !230, !232, !234, !265, !266, !267, !276, !277, !282, !283, !285, !287, !297, !300, !318, !319, !320, !322, !324, !325, !327, !332, !337, !342, !343, !344, !345, !346, !347, !348, !349, !350}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !30, file: !18, line: 335, baseType: !33, size: 192, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !18, line: 114, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 111, size: 192, align: 64, elements: !35)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !34, file: !18, line: 112, baseType: !17, size: 128, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !34, file: !18, line: 113, baseType: !22, size: 64, align: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !30, file: !18, line: 336, baseType: !39, size: 64, align: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !30, file: !18, line: 337, baseType: !22, size: 64, align: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !30, file: !18, line: 337, baseType: !22, size: 64, align: 64, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !30, file: !18, line: 341, baseType: !45, size: 64, align: 64, offset: 384)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !18, line: 308, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !16}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !30, file: !18, line: 342, baseType: !50, size: 64, align: 64, offset: 448)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !18, line: 314, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!54, !16, !55, !54}
!54 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !25, line: 48, baseType: !57)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !58, line: 246, size: 1728, align: 64, elements: !59)
!58 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!59 = !{!60, !61, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !81, !82, !83, !84, !86, !88, !90, !94, !97, !99, !100, !101, !102, !103, !106, !107}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !57, file: !58, line: 247, baseType: !54, size: 32, align: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !57, file: !58, line: 252, baseType: !62, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !57, file: !58, line: 253, baseType: !62, size: 64, align: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !57, file: !58, line: 254, baseType: !62, size: 64, align: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !57, file: !58, line: 255, baseType: !62, size: 64, align: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !57, file: !58, line: 256, baseType: !62, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !57, file: !58, line: 257, baseType: !62, size: 64, align: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !57, file: !58, line: 258, baseType: !62, size: 64, align: 64, offset: 448)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !57, file: !58, line: 259, baseType: !62, size: 64, align: 64, offset: 512)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !57, file: !58, line: 261, baseType: !62, size: 64, align: 64, offset: 576)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !57, file: !58, line: 262, baseType: !62, size: 64, align: 64, offset: 640)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !57, file: !58, line: 263, baseType: !62, size: 64, align: 64, offset: 704)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !57, file: !58, line: 265, baseType: !74, size: 64, align: 64, offset: 768)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !58, line: 161, size: 192, align: 64, elements: !76)
!76 = !{!77, !78, !80}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !75, file: !58, line: 162, baseType: !74, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !75, file: !58, line: 163, baseType: !79, size: 64, align: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !75, file: !58, line: 167, baseType: !54, size: 32, align: 32, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !57, file: !58, line: 267, baseType: !79, size: 64, align: 64, offset: 832)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !57, file: !58, line: 269, baseType: !54, size: 32, align: 32, offset: 896)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !57, file: !58, line: 273, baseType: !54, size: 32, align: 32, offset: 928)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !57, file: !58, line: 275, baseType: !85, size: 64, align: 64, offset: 960)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !8, line: 140, baseType: !27)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !57, file: !58, line: 279, baseType: !87, size: 16, align: 16, offset: 1024)
!87 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !57, file: !58, line: 280, baseType: !89, size: 8, align: 8, offset: 1040)
!89 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !57, file: !58, line: 281, baseType: !91, size: 8, align: 8, offset: 1048)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8, align: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 1)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !57, file: !58, line: 285, baseType: !95, size: 64, align: 64, offset: 1088)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !58, line: 155, baseType: null)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !57, file: !58, line: 294, baseType: !98, size: 64, align: 64, offset: 1152)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !8, line: 141, baseType: !27)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !57, file: !58, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !57, file: !58, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !57, file: !58, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !57, file: !58, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !57, file: !58, line: 307, baseType: !104, size: 64, align: 64, offset: 1472)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !105, line: 62, baseType: !10)
!105 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !57, file: !58, line: 309, baseType: !54, size: 32, align: 32, offset: 1536)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !57, file: !58, line: 311, baseType: !108, size: 160, align: 8, offset: 1568)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 160, align: 8, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 20)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !30, file: !18, line: 343, baseType: !112, size: 64, align: 64, offset: 512)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !18, line: 316, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!16, !16, !62}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !30, file: !18, line: 344, baseType: !117, size: 64, align: 64, offset: 576)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !18, line: 318, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!54, !16, !62, !16}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !30, file: !18, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !30, file: !18, line: 346, baseType: !123, size: 64, align: 64, offset: 704)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !18, line: 320, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!16, !16}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !30, file: !18, line: 350, baseType: !128, size: 64, align: 64, offset: 768)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !18, line: 278, baseType: !130)
!130 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 236, size: 2176, align: 64, elements: !131)
!131 = !{!132, !137, !138, !139, !140, !141, !146, !148, !149, !150, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !130, file: !18, line: 241, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !18, line: 166, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!16, !16, !16}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !130, file: !18, line: 242, baseType: !133, size: 64, align: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !130, file: !18, line: 243, baseType: !133, size: 64, align: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !130, file: !18, line: 244, baseType: !133, size: 64, align: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !130, file: !18, line: 245, baseType: !133, size: 64, align: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !130, file: !18, line: 246, baseType: !142, size: 64, align: 64, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !18, line: 167, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!16, !16, !16, !16}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !130, file: !18, line: 247, baseType: !147, size: 64, align: 64, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !18, line: 165, baseType: !124)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !130, file: !18, line: 248, baseType: !147, size: 64, align: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !130, file: !18, line: 249, baseType: !147, size: 64, align: 64, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !130, file: !18, line: 250, baseType: !151, size: 64, align: 64, offset: 576)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !18, line: 168, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!54, !16}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !130, file: !18, line: 251, baseType: !147, size: 64, align: 64, offset: 640)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !130, file: !18, line: 252, baseType: !133, size: 64, align: 64, offset: 704)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !130, file: !18, line: 253, baseType: !133, size: 64, align: 64, offset: 768)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !130, file: !18, line: 254, baseType: !133, size: 64, align: 64, offset: 832)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !130, file: !18, line: 255, baseType: !133, size: 64, align: 64, offset: 896)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !130, file: !18, line: 256, baseType: !133, size: 64, align: 64, offset: 960)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !130, file: !18, line: 257, baseType: !147, size: 64, align: 64, offset: 1024)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !130, file: !18, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !130, file: !18, line: 259, baseType: !147, size: 64, align: 64, offset: 1152)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !130, file: !18, line: 261, baseType: !133, size: 64, align: 64, offset: 1216)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !130, file: !18, line: 262, baseType: !133, size: 64, align: 64, offset: 1280)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !130, file: !18, line: 263, baseType: !133, size: 64, align: 64, offset: 1344)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !130, file: !18, line: 264, baseType: !133, size: 64, align: 64, offset: 1408)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !130, file: !18, line: 265, baseType: !142, size: 64, align: 64, offset: 1472)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !130, file: !18, line: 266, baseType: !133, size: 64, align: 64, offset: 1536)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !130, file: !18, line: 267, baseType: !133, size: 64, align: 64, offset: 1600)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !130, file: !18, line: 268, baseType: !133, size: 64, align: 64, offset: 1664)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !130, file: !18, line: 269, baseType: !133, size: 64, align: 64, offset: 1728)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !130, file: !18, line: 270, baseType: !133, size: 64, align: 64, offset: 1792)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !130, file: !18, line: 272, baseType: !133, size: 64, align: 64, offset: 1856)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !130, file: !18, line: 273, baseType: !133, size: 64, align: 64, offset: 1920)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !130, file: !18, line: 274, baseType: !133, size: 64, align: 64, offset: 1984)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !130, file: !18, line: 275, baseType: !133, size: 64, align: 64, offset: 2048)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !130, file: !18, line: 277, baseType: !147, size: 64, align: 64, offset: 2112)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !30, file: !18, line: 351, baseType: !180, size: 64, align: 64, offset: 832)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !18, line: 292, baseType: !182)
!182 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 280, size: 640, align: 64, elements: !183)
!183 = !{!184, !189, !190, !195, !196, !197, !202, !203, !208, !209}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !182, file: !18, line: 281, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !18, line: 169, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!22, !16}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !182, file: !18, line: 282, baseType: !133, size: 64, align: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !182, file: !18, line: 283, baseType: !191, size: 64, align: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !18, line: 170, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!16, !16, !22}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !182, file: !18, line: 284, baseType: !191, size: 64, align: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !182, file: !18, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !182, file: !18, line: 286, baseType: !198, size: 64, align: 64, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !18, line: 172, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!54, !16, !22, !16}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !182, file: !18, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !182, file: !18, line: 288, baseType: !204, size: 64, align: 64, offset: 448)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !18, line: 231, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!54, !16, !16}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !182, file: !18, line: 290, baseType: !133, size: 64, align: 64, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !182, file: !18, line: 291, baseType: !191, size: 64, align: 64, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !30, file: !18, line: 352, baseType: !211, size: 64, align: 64, offset: 896)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !18, line: 298, baseType: !213)
!213 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 294, size: 192, align: 64, elements: !214)
!214 = !{!215, !216, !217}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !213, file: !18, line: 295, baseType: !185, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !213, file: !18, line: 296, baseType: !133, size: 64, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !213, file: !18, line: 297, baseType: !218, size: 64, align: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !18, line: 174, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!54, !16, !16, !16}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !30, file: !18, line: 356, baseType: !223, size: 64, align: 64, offset: 960)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !18, line: 321, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!227, !16}
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !23, line: 186, baseType: !22)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !30, file: !18, line: 357, baseType: !142, size: 64, align: 64, offset: 1024)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !30, file: !18, line: 358, baseType: !123, size: 64, align: 64, offset: 1088)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !30, file: !18, line: 359, baseType: !231, size: 64, align: 64, offset: 1152)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !18, line: 317, baseType: !134)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !30, file: !18, line: 360, baseType: !233, size: 64, align: 64, offset: 1216)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !18, line: 319, baseType: !219)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !30, file: !18, line: 363, baseType: !235, size: 64, align: 64, offset: 1280)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !18, line: 304, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 301, size: 128, align: 64, elements: !238)
!238 = !{!239, !260}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !237, file: !18, line: 302, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !18, line: 193, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!54, !16, !244, !54}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !18, line: 191, baseType: !246)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !18, line: 178, size: 640, align: 64, elements: !247)
!247 = !{!248, !249, !250, !251, !252, !253, !254, !255, !257, !258, !259}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !246, file: !18, line: 179, baseType: !4, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !246, file: !18, line: 180, baseType: !16, size: 64, align: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !246, file: !18, line: 181, baseType: !22, size: 64, align: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !246, file: !18, line: 182, baseType: !22, size: 64, align: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !246, file: !18, line: 184, baseType: !54, size: 32, align: 32, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !246, file: !18, line: 185, baseType: !54, size: 32, align: 32, offset: 288)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !246, file: !18, line: 186, baseType: !62, size: 64, align: 64, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !246, file: !18, line: 187, baseType: !256, size: 64, align: 64, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !246, file: !18, line: 188, baseType: !256, size: 64, align: 64, offset: 448)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !246, file: !18, line: 189, baseType: !256, size: 64, align: 64, offset: 512)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !246, file: !18, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !237, file: !18, line: 303, baseType: !261, size: 64, align: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !18, line: 194, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{null, !16, !244}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !30, file: !18, line: 366, baseType: !10, size: 64, align: 64, offset: 1344)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !30, file: !18, line: 368, baseType: !39, size: 64, align: 64, offset: 1408)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !30, file: !18, line: 372, baseType: !268, size: 64, align: 64, offset: 1472)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !18, line: 233, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!54, !16, !272, !4}
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !18, line: 232, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!54, !16, !4}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !30, file: !18, line: 375, baseType: !151, size: 64, align: 64, offset: 1536)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !30, file: !18, line: 379, baseType: !278, size: 64, align: 64, offset: 1600)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !18, line: 322, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!16, !16, !16, !54}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !30, file: !18, line: 382, baseType: !22, size: 64, align: 64, offset: 1664)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !30, file: !18, line: 385, baseType: !284, size: 64, align: 64, offset: 1728)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !18, line: 323, baseType: !124)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !30, file: !18, line: 386, baseType: !286, size: 64, align: 64, offset: 1792)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !18, line: 324, baseType: !124)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !30, file: !18, line: 389, baseType: !288, size: 64, align: 64, offset: 1856)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !290, line: 40, size: 256, align: 64, elements: !291)
!290 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!291 = !{!292, !293, !295, !296}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !289, file: !290, line: 41, baseType: !39, size: 64, align: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !289, file: !290, line: 42, baseType: !294, size: 64, align: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !290, line: 18, baseType: !134)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !289, file: !290, line: 43, baseType: !54, size: 32, align: 32, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !289, file: !290, line: 45, baseType: !39, size: 64, align: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !30, file: !18, line: 390, baseType: !298, size: 64, align: 64, offset: 1920)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !18, line: 390, flags: DIFlagFwdDecl)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !30, file: !18, line: 391, baseType: !301, size: 64, align: 64, offset: 1984)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !303, line: 11, size: 320, align: 64, elements: !304)
!303 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!304 = !{!305, !306, !311, !316, !317}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !302, file: !303, line: 12, baseType: !62, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !302, file: !303, line: 13, baseType: !307, size: 64, align: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !303, line: 8, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!16, !16, !4}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !302, file: !303, line: 14, baseType: !312, size: 64, align: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !303, line: 9, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!54, !16, !16, !4}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !302, file: !303, line: 15, baseType: !62, size: 64, align: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !302, file: !303, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !30, file: !18, line: 392, baseType: !29, size: 64, align: 64, offset: 2048)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !30, file: !18, line: 393, baseType: !16, size: 64, align: 64, offset: 2112)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !30, file: !18, line: 394, baseType: !321, size: 64, align: 64, offset: 2176)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !18, line: 325, baseType: !143)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !30, file: !18, line: 395, baseType: !323, size: 64, align: 64, offset: 2240)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !18, line: 326, baseType: !219)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !30, file: !18, line: 396, baseType: !22, size: 64, align: 64, offset: 2304)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !30, file: !18, line: 397, baseType: !326, size: 64, align: 64, offset: 2368)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !18, line: 327, baseType: !219)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !30, file: !18, line: 398, baseType: !328, size: 64, align: 64, offset: 2432)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !18, line: 329, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!16, !29, !22}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !30, file: !18, line: 399, baseType: !333, size: 64, align: 64, offset: 2496)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !18, line: 328, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!16, !29, !16, !16}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !30, file: !18, line: 400, baseType: !338, size: 64, align: 64, offset: 2560)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !18, line: 307, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !4}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !30, file: !18, line: 401, baseType: !151, size: 64, align: 64, offset: 2624)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !30, file: !18, line: 402, baseType: !16, size: 64, align: 64, offset: 2688)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !30, file: !18, line: 403, baseType: !16, size: 64, align: 64, offset: 2752)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !30, file: !18, line: 404, baseType: !16, size: 64, align: 64, offset: 2816)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !30, file: !18, line: 405, baseType: !16, size: 64, align: 64, offset: 2880)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !30, file: !18, line: 406, baseType: !16, size: 64, align: 64, offset: 2944)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !30, file: !18, line: 407, baseType: !45, size: 64, align: 64, offset: 3008)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !30, file: !18, line: 410, baseType: !9, size: 32, align: 32, offset: 3072)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !30, file: !18, line: 412, baseType: !45, size: 64, align: 64, offset: 3136)
!351 = !{!352}
!352 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !12, file: !13, line: 494, type: !16)
!353 = !DISubprogram(name: "stat_S_ISDIR", scope: !13, file: !13, line: 265, type: !135, isLocal: true, isDefinition: true, scopeLine: 265, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_ISDIR, variables: !354)
!354 = !{!355, !356, !357}
!355 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !353, file: !13, line: 265, type: !16)
!356 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !353, file: !13, line: 265, type: !16)
!357 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !353, file: !13, line: 265, type: !5)
!358 = !DISubprogram(name: "_PyLong_AsMode_t", scope: !13, file: !13, line: 236, type: !359, isLocal: true, isDefinition: true, scopeLine: 237, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @_PyLong_AsMode_t, variables: !361)
!359 = !DISubroutineType(types: !360)
!360 = !{!5, !16}
!361 = !{!362, !363, !364}
!362 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !358, file: !13, line: 236, type: !16)
!363 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !358, file: !13, line: 238, type: !10)
!364 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !358, file: !13, line: 239, type: !5)
!365 = !DISubprogram(name: "stat_S_ISCHR", scope: !13, file: !13, line: 269, type: !135, isLocal: true, isDefinition: true, scopeLine: 269, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_ISCHR, variables: !366)
!366 = !{!367, !368, !369}
!367 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !365, file: !13, line: 269, type: !16)
!368 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !365, file: !13, line: 269, type: !16)
!369 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !365, file: !13, line: 269, type: !5)
!370 = !DISubprogram(name: "stat_S_ISBLK", scope: !13, file: !13, line: 273, type: !135, isLocal: true, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_ISBLK, variables: !371)
!371 = !{!372, !373, !374}
!372 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !370, file: !13, line: 273, type: !16)
!373 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !370, file: !13, line: 273, type: !16)
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !370, file: !13, line: 273, type: !5)
!375 = !DISubprogram(name: "stat_S_ISREG", scope: !13, file: !13, line: 277, type: !135, isLocal: true, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_ISREG, variables: !376)
!376 = !{!377, !378, !379}
!377 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !375, file: !13, line: 277, type: !16)
!378 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !375, file: !13, line: 277, type: !16)
!379 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !375, file: !13, line: 277, type: !5)
!380 = !DISubprogram(name: "stat_S_ISFIFO", scope: !13, file: !13, line: 281, type: !135, isLocal: true, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_ISFIFO, variables: !381)
!381 = !{!382, !383, !384}
!382 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !380, file: !13, line: 281, type: !16)
!383 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !380, file: !13, line: 281, type: !16)
!384 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !380, file: !13, line: 281, type: !5)
!385 = !DISubprogram(name: "stat_S_ISLNK", scope: !13, file: !13, line: 285, type: !135, isLocal: true, isDefinition: true, scopeLine: 285, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_ISLNK, variables: !386)
!386 = !{!387, !388, !389}
!387 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !385, file: !13, line: 285, type: !16)
!388 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !385, file: !13, line: 285, type: !16)
!389 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !385, file: !13, line: 285, type: !5)
!390 = !DISubprogram(name: "stat_S_ISSOCK", scope: !13, file: !13, line: 289, type: !135, isLocal: true, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_ISSOCK, variables: !391)
!391 = !{!392, !393, !394}
!392 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !390, file: !13, line: 289, type: !16)
!393 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !390, file: !13, line: 289, type: !16)
!394 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !390, file: !13, line: 289, type: !5)
!395 = !DISubprogram(name: "stat_S_ISDOOR", scope: !13, file: !13, line: 293, type: !135, isLocal: true, isDefinition: true, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_ISDOOR, variables: !396)
!396 = !{!397, !398, !399}
!397 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !395, file: !13, line: 293, type: !16)
!398 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !395, file: !13, line: 293, type: !16)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !395, file: !13, line: 293, type: !5)
!400 = !DISubprogram(name: "stat_S_ISPORT", scope: !13, file: !13, line: 297, type: !135, isLocal: true, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_ISPORT, variables: !401)
!401 = !{!402, !403, !404}
!402 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !400, file: !13, line: 297, type: !16)
!403 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !400, file: !13, line: 297, type: !16)
!404 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !400, file: !13, line: 297, type: !5)
!405 = !DISubprogram(name: "stat_S_ISWHT", scope: !13, file: !13, line: 301, type: !135, isLocal: true, isDefinition: true, scopeLine: 301, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_ISWHT, variables: !406)
!406 = !{!407, !408, !409}
!407 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !405, file: !13, line: 301, type: !16)
!408 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !405, file: !13, line: 301, type: !16)
!409 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !405, file: !13, line: 301, type: !5)
!410 = !DISubprogram(name: "stat_S_IMODE", scope: !13, file: !13, line: 310, type: !135, isLocal: true, isDefinition: true, scopeLine: 311, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_IMODE, variables: !411)
!411 = !{!412, !413, !414}
!412 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !410, file: !13, line: 310, type: !16)
!413 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !410, file: !13, line: 310, type: !16)
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !410, file: !13, line: 312, type: !5)
!415 = !DISubprogram(name: "stat_S_IFMT", scope: !13, file: !13, line: 323, type: !135, isLocal: true, isDefinition: true, scopeLine: 324, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_S_IFMT, variables: !416)
!416 = !{!417, !418, !419}
!417 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !415, file: !13, line: 323, type: !16)
!418 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !415, file: !13, line: 323, type: !16)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !415, file: !13, line: 325, type: !5)
!420 = !DISubprogram(name: "stat_filemode", scope: !13, file: !13, line: 384, type: !135, isLocal: true, isDefinition: true, scopeLine: 385, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stat_filemode, variables: !421)
!421 = !{!422, !423, !424, !428}
!422 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !420, file: !13, line: 384, type: !16)
!423 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "omode", arg: 2, scope: !420, file: !13, line: 384, type: !16)
!424 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !420, file: !13, line: 386, type: !425)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 80, align: 8, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 10)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !420, file: !13, line: 387, type: !5)
!429 = !DISubprogram(name: "filetype", scope: !13, file: !13, line: 335, type: !430, isLocal: true, isDefinition: true, scopeLine: 336, flags: DIFlagPrototyped, isOptimized: true, function: i8 (i32)* @filetype, variables: !432)
!430 = !DISubroutineType(types: !431)
!431 = !{!41, !5}
!432 = !{!433}
!433 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 1, scope: !429, file: !13, line: 335, type: !5)
!434 = !DISubprogram(name: "fileperm", scope: !13, file: !13, line: 355, type: !435, isLocal: true, isDefinition: true, scopeLine: 356, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8*)* @fileperm, variables: !437)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !5, !62}
!437 = !{!438, !439}
!438 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 1, scope: !434, file: !13, line: 355, type: !5)
!439 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 2, scope: !434, file: !13, line: 355, type: !62)
!440 = !{!441, !464, !468, !472, !476, !480, !484, !488, !492, !496, !500, !504, !505, !509, !513, !514}
!441 = !DIGlobalVariable(name: "statmodule", scope: !0, file: !13, line: 479, type: !442, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @statmodule)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !443, line: 47, size: 832, align: 64, elements: !444)
!443 = !DIFile(filename: "Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!444 = !{!445, !454, !455, !456, !457, !460, !461, !462, !463}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !442, file: !443, line: 48, baseType: !446, size: 320, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !443, line: 38, baseType: !447)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !443, line: 33, size: 320, align: 64, elements: !448)
!448 = !{!449, !450, !452, !453}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !447, file: !443, line: 34, baseType: !17, size: 128, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !447, file: !443, line: 35, baseType: !451, size: 64, align: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !447, file: !443, line: 36, baseType: !22, size: 64, align: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !447, file: !443, line: 37, baseType: !16, size: 64, align: 64, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !442, file: !443, line: 49, baseType: !39, size: 64, align: 64, offset: 320)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !442, file: !443, line: 50, baseType: !39, size: 64, align: 64, offset: 384)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !442, file: !443, line: 51, baseType: !22, size: 64, align: 64, offset: 448)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !442, file: !443, line: 52, baseType: !458, size: 64, align: 64, offset: 512)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !290, line: 47, baseType: !289)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !442, file: !443, line: 53, baseType: !151, size: 64, align: 64, offset: 576)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !442, file: !443, line: 54, baseType: !268, size: 64, align: 64, offset: 640)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !442, file: !443, line: 55, baseType: !151, size: 64, align: 64, offset: 704)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !442, file: !443, line: 56, baseType: !338, size: 64, align: 64, offset: 768)
!464 = !DIGlobalVariable(name: "module_doc", scope: !0, file: !13, line: 417, type: !465, isLocal: true, isDefinition: true, variable: [1383 x i8]* @module_doc)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 11064, align: 8, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 1383)
!468 = !DIGlobalVariable(name: "stat_methods", scope: !0, file: !13, line: 399, type: !469, isLocal: true, isDefinition: true, variable: [14 x %struct.PyMethodDef]* @stat_methods)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 3584, align: 64, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 14)
!472 = !DIGlobalVariable(name: "stat_S_ISDIR_doc", scope: !0, file: !13, line: 265, type: !473, isLocal: true, isDefinition: true, variable: [64 x i8]* @stat_S_ISDIR_doc)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 512, align: 8, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 64)
!476 = !DIGlobalVariable(name: "stat_S_ISCHR_doc", scope: !0, file: !13, line: 269, type: !477, isLocal: true, isDefinition: true, variable: [84 x i8]* @stat_S_ISCHR_doc)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 672, align: 8, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 84)
!480 = !DIGlobalVariable(name: "stat_S_ISBLK_doc", scope: !0, file: !13, line: 273, type: !481, isLocal: true, isDefinition: true, variable: [80 x i8]* @stat_S_ISBLK_doc)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 640, align: 8, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 80)
!484 = !DIGlobalVariable(name: "stat_S_ISREG_doc", scope: !0, file: !13, line: 277, type: !485, isLocal: true, isDefinition: true, variable: [67 x i8]* @stat_S_ISREG_doc)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 536, align: 8, elements: !486)
!486 = !{!487}
!487 = !DISubrange(count: 67)
!488 = !DIGlobalVariable(name: "stat_S_ISFIFO_doc", scope: !0, file: !13, line: 281, type: !489, isLocal: true, isDefinition: true, variable: [73 x i8]* @stat_S_ISFIFO_doc)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 584, align: 8, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: 73)
!492 = !DIGlobalVariable(name: "stat_S_ISLNK_doc", scope: !0, file: !13, line: 285, type: !493, isLocal: true, isDefinition: true, variable: [68 x i8]* @stat_S_ISLNK_doc)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 544, align: 8, elements: !494)
!494 = !{!495}
!495 = !DISubrange(count: 68)
!496 = !DIGlobalVariable(name: "stat_S_ISSOCK_doc", scope: !0, file: !13, line: 289, type: !497, isLocal: true, isDefinition: true, variable: [62 x i8]* @stat_S_ISSOCK_doc)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 496, align: 8, elements: !498)
!498 = !{!499}
!499 = !DISubrange(count: 62)
!500 = !DIGlobalVariable(name: "stat_S_ISDOOR_doc", scope: !0, file: !13, line: 293, type: !501, isLocal: true, isDefinition: true, variable: [60 x i8]* @stat_S_ISDOOR_doc)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 480, align: 8, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 60)
!504 = !DIGlobalVariable(name: "stat_S_ISPORT_doc", scope: !0, file: !13, line: 297, type: !485, isLocal: true, isDefinition: true, variable: [67 x i8]* @stat_S_ISPORT_doc)
!505 = !DIGlobalVariable(name: "stat_S_ISWHT_doc", scope: !0, file: !13, line: 301, type: !506, isLocal: true, isDefinition: true, variable: [63 x i8]* @stat_S_ISWHT_doc)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 504, align: 8, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: 63)
!509 = !DIGlobalVariable(name: "stat_S_IMODE_doc", scope: !0, file: !13, line: 306, type: !510, isLocal: true, isDefinition: true, variable: [69 x i8]* @stat_S_IMODE_doc)
