; ModuleID = 'programs_new/Python-new/_struct.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !443, globals: !1240)
!1 = !DIFile(filename: "_struct.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !350, !384, !52, !392, !394, !402, !403, !411, !393, !421, !422, !11, !94, !17, !423, !31, !424, !96, !426, !427, !439, !77, !44, !348, !440, !441, !442}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !7, line: 109, baseType: !8)
!7 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !7, line: 105, size: 128, align: 64, elements: !9)
!9 = !{!10, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !8, file: !7, line: 107, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !12, line: 177, baseType: !13)
!12 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !14, line: 102, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !16, line: 181, baseType: !17)
!16 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !8, file: !7, line: 108, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !7, line: 334, size: 3200, align: 64, elements: !21)
!21 = !{!22, !28, !32, !33, !34, !39, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !20, file: !7, line: 335, baseType: !23, size: 192, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !7, line: 114, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 111, size: 192, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !24, file: !7, line: 112, baseType: !6, size: 128, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !24, file: !7, line: 113, baseType: !11, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !20, file: !7, line: 336, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !20, file: !7, line: 341, baseType: !35, size: 64, align: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !7, line: 308, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !5}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !20, file: !7, line: 342, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !7, line: 314, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !5, !45, !44}
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !14, line: 48, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 246, size: 1728, align: 64, elements: !49)
!48 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!49 = !{!50, !51, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !71, !72, !73, !74, !76, !78, !80, !84, !87, !89, !90, !91, !92, !93, !97, !98}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !48, line: 247, baseType: !44, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !47, file: !48, line: 252, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !47, file: !48, line: 253, baseType: !52, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !47, file: !48, line: 254, baseType: !52, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !47, file: !48, line: 255, baseType: !52, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !47, file: !48, line: 256, baseType: !52, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !47, file: !48, line: 257, baseType: !52, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !47, file: !48, line: 258, baseType: !52, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !47, file: !48, line: 259, baseType: !52, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !47, file: !48, line: 261, baseType: !52, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !47, file: !48, line: 262, baseType: !52, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !47, file: !48, line: 263, baseType: !52, size: 64, align: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !47, file: !48, line: 265, baseType: !64, size: 64, align: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !48, line: 161, size: 192, align: 64, elements: !66)
!66 = !{!67, !68, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !65, file: !48, line: 162, baseType: !64, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !65, file: !48, line: 163, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !65, file: !48, line: 167, baseType: !44, size: 32, align: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !47, file: !48, line: 267, baseType: !69, size: 64, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !47, file: !48, line: 269, baseType: !44, size: 32, align: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !47, file: !48, line: 273, baseType: !44, size: 32, align: 32, offset: 928)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !47, file: !48, line: 275, baseType: !75, size: 64, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !16, line: 140, baseType: !17)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !47, file: !48, line: 279, baseType: !77, size: 16, align: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !47, file: !48, line: 280, baseType: !79, size: 8, align: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !47, file: !48, line: 281, baseType: !81, size: 8, align: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !47, file: !48, line: 285, baseType: !85, size: 64, align: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !48, line: 155, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !47, file: !48, line: 294, baseType: !88, size: 64, align: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !16, line: 141, baseType: !17)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !47, file: !48, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !47, file: !48, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !47, file: !48, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !47, file: !48, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !47, file: !48, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !47, file: !48, line: 309, baseType: !44, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !47, file: !48, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !20, file: !7, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !7, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!5, !5, !52}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !20, file: !7, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !7, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!44, !5, !52, !5}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !20, file: !7, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !20, file: !7, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !7, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!5, !5}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !20, file: !7, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !7, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !7, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !7, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!5, !5, !5}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !7, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !7, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !7, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !7, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !7, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !7, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!5, !5, !5, !5}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !7, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !7, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !7, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !7, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !7, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !7, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!44, !5}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !7, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !7, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !7, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !7, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !7, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !7, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !7, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !7, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !7, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !7, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !7, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !7, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !7, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !7, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !7, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !7, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !7, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !7, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !7, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !7, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !7, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !7, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !7, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !7, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !20, file: !7, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !7, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !7, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !7, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!11, !5}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !7, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !7, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !7, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!5, !5, !11}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !7, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !7, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !7, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !7, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!44, !5, !11, !5}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !7, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !7, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !7, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!44, !5, !5}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !7, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !7, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !20, file: !7, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !7, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !7, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !7, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !7, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !7, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!44, !5, !5, !5}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !20, file: !7, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !7, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !5}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !12, line: 186, baseType: !11)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !20, file: !7, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !20, file: !7, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !20, file: !7, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !7, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !20, file: !7, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !7, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !20, file: !7, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !7, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !7, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !7, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!44, !5, !235, !44}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !7, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !7, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !7, line: 179, baseType: !4, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !7, line: 180, baseType: !5, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !7, line: 181, baseType: !11, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !7, line: 182, baseType: !11, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !7, line: 184, baseType: !44, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !7, line: 185, baseType: !44, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !7, line: 186, baseType: !52, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !7, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !7, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !7, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !7, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !7, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !7, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !5, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !20, file: !7, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !20, file: !7, line: 368, baseType: !29, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !20, file: !7, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !7, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!44, !5, !263, !4}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !7, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!44, !5, !4}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !20, file: !7, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !20, file: !7, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !7, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!5, !5, !5, !44}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !20, file: !7, line: 382, baseType: !11, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !20, file: !7, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !7, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !20, file: !7, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !7, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !20, file: !7, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !29, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !44, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !29, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !20, file: !7, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !291, line: 18, size: 320, align: 64, elements: !292)
!291 = !DIFile(filename: "./Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!292 = !{!293, !294, !295, !296, !297}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !291, line: 19, baseType: !52, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !290, file: !291, line: 20, baseType: !44, size: 32, align: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !290, file: !291, line: 21, baseType: !11, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !290, file: !291, line: 22, baseType: !44, size: 32, align: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !290, file: !291, line: 23, baseType: !52, size: 64, align: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !20, file: !7, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !52, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!5, !5, !4}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!44, !5, !5, !4}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !52, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !20, file: !7, line: 392, baseType: !19, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !20, file: !7, line: 393, baseType: !5, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !20, file: !7, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !7, line: 325, baseType: !134)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !20, file: !7, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !7, line: 326, baseType: !210)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !20, file: !7, line: 396, baseType: !11, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !20, file: !7, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !7, line: 327, baseType: !210)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !20, file: !7, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !7, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!5, !19, !11}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !20, file: !7, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !7, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!5, !19, !5, !5}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !20, file: !7, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !7, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !4}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !20, file: !7, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !20, file: !7, line: 402, baseType: !5, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !20, file: !7, line: 403, baseType: !5, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !20, file: !7, line: 404, baseType: !5, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !20, file: !7, line: 405, baseType: !5, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !20, file: !7, line: 406, baseType: !5, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !20, file: !7, line: 407, baseType: !35, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !20, file: !7, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !20, file: !7, line: 412, baseType: !35, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyStructObject", file: !352, line: 41, baseType: !353)
!352 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_struct.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!353 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 34, size: 448, align: 64, elements: !354)
!354 = !{!355, !356, !357, !358, !382, !383}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !353, file: !352, line: 35, baseType: !6, size: 128, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "s_size", scope: !353, file: !352, line: 36, baseType: !11, size: 64, align: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "s_len", scope: !353, file: !352, line: 37, baseType: !11, size: 64, align: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "s_codes", scope: !353, file: !352, line: 38, baseType: !359, size: 64, align: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "formatcode", file: !352, line: 30, baseType: !361)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "_formatcode", file: !352, line: 25, size: 256, align: 64, elements: !362)
!362 = !{!363, !379, !380, !381}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "fmtdef", scope: !361, file: !352, line: 26, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "_formatdef", file: !352, line: 15, size: 320, align: 64, elements: !367)
!367 = !{!368, !369, !370, !371, !375}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !366, file: !352, line: 16, baseType: !31, size: 8, align: 8)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !366, file: !352, line: 17, baseType: !11, size: 64, align: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !366, file: !352, line: 18, baseType: !11, size: 64, align: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "unpack", scope: !366, file: !352, line: 19, baseType: !372, size: 64, align: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!5, !29, !364}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pack", scope: !366, file: !352, line: 21, baseType: !376, size: 64, align: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!44, !52, !5, !364}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !361, file: !352, line: 27, baseType: !11, size: 64, align: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !361, file: !352, line: 28, baseType: !11, size: 64, align: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !361, file: !352, line: 29, baseType: !11, size: 64, align: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "s_format", scope: !353, file: !352, line: 39, baseType: !5, size: 64, align: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !353, file: !352, line: 40, baseType: !5, size: 64, align: 64, offset: 384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "unpackiterobject", file: !352, line: 1576, baseType: !386)
!386 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 1571, size: 896, align: 64, elements: !387)
!387 = !{!388, !389, !390, !391}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !386, file: !352, line: 1572, baseType: !6, size: 128, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "so", scope: !386, file: !352, line: 1573, baseType: !350, size: 64, align: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !386, file: !352, line: 1574, baseType: !236, size: 640, align: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !386, file: !352, line: 1575, baseType: !11, size: 64, align: 64, offset: 832)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !396, line: 33, baseType: !397)
!396 = !DIFile(filename: "./Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!397 = !DICompositeType(tag: DW_TAG_structure_type, file: !396, line: 25, size: 256, align: 64, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !397, file: !396, line: 26, baseType: !23, size: 192, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !397, file: !396, line: 27, baseType: !401, size: 64, align: 64, offset: 192)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, align: 64, elements: !82)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !405, line: 41, baseType: !406)
!405 = !DIFile(filename: "./Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!406 = !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 31, size: 320, align: 64, elements: !407)
!407 = !{!408, !409, !410}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !406, file: !405, line: 32, baseType: !23, size: 192, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !406, file: !405, line: 33, baseType: !218, size: 64, align: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !406, file: !405, line: 34, baseType: !81, size: 8, align: 8, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyByteArrayObject", file: !413, line: 30, baseType: !414)
!413 = !DIFile(filename: "./Include/bytearrayobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!414 = !DICompositeType(tag: DW_TAG_structure_type, file: !413, line: 23, size: 448, align: 64, elements: !415)
!415 = !{!416, !417, !418, !419, !420}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !414, file: !413, line: 24, baseType: !23, size: 192, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ob_alloc", scope: !414, file: !413, line: 25, baseType: !11, size: 64, align: 64, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ob_bytes", scope: !414, file: !413, line: 26, baseType: !52, size: 64, align: 64, offset: 256)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ob_start", scope: !414, file: !413, line: 27, baseType: !52, size: 64, align: 64, offset: 320)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ob_exports", scope: !414, file: !413, line: 29, baseType: !44, size: 32, align: 32, offset: 384)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!426 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLongObject", file: !429, line: 10, baseType: !430)
!429 = !DIFile(filename: "./Include/longobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "_longobject", file: !431, line: 89, size: 256, align: 64, elements: !432)
!431 = !DIFile(filename: "./Include/longintrepr.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!432 = !{!433, !434}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !430, file: !431, line: 90, baseType: !23, size: 192, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ob_digit", scope: !430, file: !431, line: 91, baseType: !435, size: 32, align: 32, offset: 192)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 32, align: 32, elements: !82)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit", file: !431, line: 49, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !438, line: 51, baseType: !348)
!438 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!439 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!440 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!441 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!442 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!443 = !{!444, !455, !464, !472, !476, !486, !500, !510, !525, !539, !564, !568, !585, !595, !623, !640, !648, !658, !665, !683, !693, !703, !711, !715, !719, !737, !753, !759, !765, !773, !783, !786, !790, !796, !800, !805, !812, !819, !831, !838, !848, !858, !865, !873, !880, !888, !893, !899, !903, !910, !916, !920, !925, !931, !937, !945, !958, !963, !970, !975, !982, !987, !994, !999, !1006, !1011, !1017, !1022, !1028, !1033, !1039, !1048, !1053, !1059, !1069, !1074, !1080, !1090, !1095, !1101, !1111, !1117, !1124, !1129, !1135, !1140, !1146, !1151, !1159, !1166, !1173, !1180, !1190, !1197, !1205, !1212, !1220, !1224, !1230, !1234}
!444 = !DISubprogram(name: "PyInit__struct", scope: !352, file: !352, line: 2266, type: !445, isLocal: false, isDefinition: true, scopeLine: 2267, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__struct, variables: !447)
!445 = !DISubroutineType(types: !446)
!446 = !{!5}
!447 = !{!448, !449, !453, !454}
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !444, file: !352, line: 2268, type: !5)
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "native", scope: !450, file: !352, line: 2280, type: !451)
!450 = distinct !DILexicalBlock(scope: !444, file: !352, line: 2279, column: 5)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "formatdef", file: !352, line: 23, baseType: !366)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "other", scope: !450, file: !352, line: 2281, type: !451)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !450, file: !352, line: 2281, type: !451)
!455 = !DISubprogram(name: "clearcache", scope: !352, file: !352, line: 2038, type: !116, isLocal: true, isDefinition: true, scopeLine: 2039, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @clearcache, variables: !456)
!456 = !{!457, !458, !460}
!457 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !455, file: !352, line: 2038, type: !5)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !459, file: !352, line: 2040, type: !5)
!459 = distinct !DILexicalBlock(scope: !455, file: !352, line: 2040, column: 8)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !461, file: !352, line: 2040, type: !5)
!461 = distinct !DILexicalBlock(scope: !462, file: !352, line: 2040, column: 105)
!462 = distinct !DILexicalBlock(scope: !463, file: !352, line: 2040, column: 78)
!463 = distinct !DILexicalBlock(scope: !459, file: !352, line: 2040, column: 55)
!464 = !DISubprogram(name: "calcsize", scope: !352, file: !352, line: 2050, type: !126, isLocal: true, isDefinition: true, scopeLine: 2051, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @calcsize, variables: !465)
!465 = !{!466, !467, !468, !469, !470}
!466 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !464, file: !352, line: 2050, type: !5)
!467 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt", arg: 2, scope: !464, file: !352, line: 2050, type: !5)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !464, file: !352, line: 2052, type: !11)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s_object", scope: !464, file: !352, line: 2053, type: !5)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !471, file: !352, line: 2057, type: !5)
!471 = distinct !DILexicalBlock(scope: !464, file: !352, line: 2057, column: 8)
!472 = !DISubprogram(name: "cache_struct", scope: !352, file: !352, line: 2007, type: !116, isLocal: true, isDefinition: true, scopeLine: 2008, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @cache_struct, variables: !473)
!473 = !{!474, !475}
!474 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt", arg: 1, scope: !472, file: !352, line: 2007, type: !5)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s_object", scope: !472, file: !352, line: 2009, type: !5)
!476 = !DISubprogram(name: "iter_unpack", scope: !352, file: !352, line: 2192, type: !126, isLocal: true, isDefinition: true, scopeLine: 2193, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @iter_unpack, variables: !477)
!477 = !{!478, !479, !480, !481, !482, !483, !484}
!478 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !476, file: !352, line: 2192, type: !5)
!479 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !476, file: !352, line: 2192, type: !5)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s_object", scope: !476, file: !352, line: 2194, type: !5)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmt", scope: !476, file: !352, line: 2194, type: !5)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "input", scope: !476, file: !352, line: 2194, type: !5)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !476, file: !352, line: 2194, type: !5)
!484 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !485, file: !352, line: 2203, type: !5)
!485 = distinct !DILexicalBlock(scope: !476, file: !352, line: 2203, column: 8)
!486 = !DISubprogram(name: "s_iter_unpack", scope: !352, file: !352, line: 1668, type: !126, isLocal: true, isDefinition: true, scopeLine: 1669, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @s_iter_unpack, variables: !487)
!487 = !{!488, !489, !490, !491, !492, !496}
!488 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "_so", arg: 1, scope: !486, file: !352, line: 1668, type: !5)
!489 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 2, scope: !486, file: !352, line: 1668, type: !5)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "so", scope: !486, file: !352, line: 1670, type: !350)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !486, file: !352, line: 1671, type: !384)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !493, file: !352, line: 1687, type: !5)
!493 = distinct !DILexicalBlock(scope: !494, file: !352, line: 1687, column: 12)
!494 = distinct !DILexicalBlock(scope: !495, file: !352, line: 1686, column: 55)
!495 = distinct !DILexicalBlock(scope: !486, file: !352, line: 1686, column: 9)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !497, file: !352, line: 1695, type: !5)
!497 = distinct !DILexicalBlock(scope: !498, file: !352, line: 1695, column: 12)
!498 = distinct !DILexicalBlock(scope: !499, file: !352, line: 1690, column: 42)
!499 = distinct !DILexicalBlock(scope: !486, file: !352, line: 1690, column: 9)
!500 = !DISubprogram(name: "unpackiter_dealloc", scope: !352, file: !352, line: 1579, type: !501, isLocal: true, isDefinition: true, scopeLine: 1580, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.unpackiterobject*)* @unpackiter_dealloc, variables: !503)
!501 = !DISubroutineType(types: !502)
!502 = !{null, !384}
!503 = !{!504, !505, !507}
!504 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !500, file: !352, line: 1579, type: !384)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !506, file: !352, line: 1581, type: !5)
!506 = distinct !DILexicalBlock(scope: !500, file: !352, line: 1581, column: 8)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !508, file: !352, line: 1581, type: !5)
!508 = distinct !DILexicalBlock(scope: !509, file: !352, line: 1581, column: 100)
!509 = distinct !DILexicalBlock(scope: !506, file: !352, line: 1581, column: 66)
!510 = !DISubprogram(name: "unpackiter_traverse", scope: !352, file: !352, line: 1587, type: !511, isLocal: true, isDefinition: true, scopeLine: 1588, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.unpackiterobject*, i32 (%struct._object*, i8*)*, i8*)* @unpackiter_traverse, variables: !513)
!511 = !DISubroutineType(types: !512)
!512 = !{!44, !384, !263, !4}
!513 = !{!514, !515, !516, !517, !521}
!514 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !510, file: !352, line: 1587, type: !384)
!515 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !510, file: !352, line: 1587, type: !263)
!516 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !510, file: !352, line: 1587, type: !4)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !518, file: !352, line: 1589, type: !44)
!518 = distinct !DILexicalBlock(scope: !519, file: !352, line: 1589, column: 24)
!519 = distinct !DILexicalBlock(scope: !520, file: !352, line: 1589, column: 14)
!520 = distinct !DILexicalBlock(scope: !510, file: !352, line: 1589, column: 8)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !522, file: !352, line: 1590, type: !44)
!522 = distinct !DILexicalBlock(scope: !523, file: !352, line: 1590, column: 29)
!523 = distinct !DILexicalBlock(scope: !524, file: !352, line: 1590, column: 14)
!524 = distinct !DILexicalBlock(scope: !510, file: !352, line: 1590, column: 8)
!525 = !DISubprogram(name: "unpackiter_iternext", scope: !352, file: !352, line: 1611, type: !526, isLocal: true, isDefinition: true, scopeLine: 1612, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.unpackiterobject*)* @unpackiter_iternext, variables: !528)
!526 = !DISubroutineType(types: !527)
!527 = !{!5, !384}
!528 = !{!529, !530, !531, !535}
!529 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !525, file: !352, line: 1611, type: !384)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !525, file: !352, line: 1613, type: !5)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !532, file: !352, line: 1618, type: !5)
!532 = distinct !DILexicalBlock(scope: !533, file: !352, line: 1618, column: 12)
!533 = distinct !DILexicalBlock(scope: !534, file: !352, line: 1616, column: 39)
!534 = distinct !DILexicalBlock(scope: !525, file: !352, line: 1616, column: 9)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !536, file: !352, line: 1618, type: !5)
!536 = distinct !DILexicalBlock(scope: !537, file: !352, line: 1618, column: 115)
!537 = distinct !DILexicalBlock(scope: !538, file: !352, line: 1618, column: 85)
!538 = distinct !DILexicalBlock(scope: !532, file: !352, line: 1618, column: 62)
!539 = !DISubprogram(name: "s_unpack_internal", scope: !352, file: !352, line: 1460, type: !540, isLocal: true, isDefinition: true, scopeLine: 1460, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyStructObject*, i8*)* @s_unpack_internal, variables: !542)
!540 = !DISubroutineType(types: !541)
!541 = !{!5, !350, !52}
!542 = !{!543, !544, !545, !546, !547, !548, !554, !555, !556, !558, !562}
!543 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "soself", arg: 1, scope: !539, file: !352, line: 1460, type: !350)
!544 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "startfrom", arg: 2, scope: !539, file: !352, line: 1460, type: !52)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !539, file: !352, line: 1461, type: !359)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !539, file: !352, line: 1462, type: !11)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !539, file: !352, line: 1463, type: !5)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !549, file: !352, line: 1468, type: !552)
!549 = distinct !DILexicalBlock(scope: !550, file: !352, line: 1467, column: 70)
!550 = distinct !DILexicalBlock(scope: !551, file: !352, line: 1467, column: 5)
!551 = distinct !DILexicalBlock(scope: !539, file: !352, line: 1467, column: 5)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !549, file: !352, line: 1469, type: !29)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !549, file: !352, line: 1470, type: !11)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !557, file: !352, line: 1472, type: !5)
!557 = distinct !DILexicalBlock(scope: !549, file: !352, line: 1471, column: 21)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !559, file: !352, line: 1476, type: !11)
!559 = distinct !DILexicalBlock(scope: !560, file: !352, line: 1475, column: 42)
!560 = distinct !DILexicalBlock(scope: !561, file: !352, line: 1475, column: 24)
!561 = distinct !DILexicalBlock(scope: !557, file: !352, line: 1473, column: 17)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !563, file: !352, line: 1492, type: !5)
!563 = distinct !DILexicalBlock(scope: !539, file: !352, line: 1492, column: 8)
!564 = !DISubprogram(name: "unpackiter_len", scope: !352, file: !352, line: 1595, type: !526, isLocal: true, isDefinition: true, scopeLine: 1596, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.unpackiterobject*)* @unpackiter_len, variables: !565)
!565 = !{!566, !567}
!566 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !564, file: !352, line: 1595, type: !384)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !564, file: !352, line: 1597, type: !11)
!568 = !DISubprogram(name: "pack", scope: !352, file: !352, line: 2068, type: !126, isLocal: true, isDefinition: true, scopeLine: 2069, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @pack, variables: !569)
!569 = !{!570, !571, !572, !573, !574, !575, !576, !577, !581, !583}
!570 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !568, file: !352, line: 2068, type: !5)
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !568, file: !352, line: 2068, type: !5)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s_object", scope: !568, file: !352, line: 2070, type: !5)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmt", scope: !568, file: !352, line: 2070, type: !5)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newargs", scope: !568, file: !352, line: 2070, type: !5)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !568, file: !352, line: 2070, type: !5)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !568, file: !352, line: 2071, type: !11)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !578, file: !352, line: 2084, type: !5)
!578 = distinct !DILexicalBlock(scope: !579, file: !352, line: 2084, column: 12)
!579 = distinct !DILexicalBlock(scope: !580, file: !352, line: 2083, column: 33)
!580 = distinct !DILexicalBlock(scope: !568, file: !352, line: 2083, column: 9)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !582, file: !352, line: 2088, type: !5)
!582 = distinct !DILexicalBlock(scope: !568, file: !352, line: 2088, column: 8)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !584, file: !352, line: 2089, type: !5)
!584 = distinct !DILexicalBlock(scope: !568, file: !352, line: 2089, column: 8)
!585 = !DISubprogram(name: "s_pack", scope: !352, file: !352, line: 1803, type: !126, isLocal: true, isDefinition: true, scopeLine: 1804, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @s_pack, variables: !586)
!586 = !{!587, !588, !589, !590, !591}
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !585, file: !352, line: 1803, type: !5)
!588 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !585, file: !352, line: 1803, type: !5)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "soself", scope: !585, file: !352, line: 1805, type: !350)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !585, file: !352, line: 1806, type: !5)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !592, file: !352, line: 1826, type: !5)
!592 = distinct !DILexicalBlock(scope: !593, file: !352, line: 1826, column: 12)
!593 = distinct !DILexicalBlock(scope: !594, file: !352, line: 1825, column: 106)
!594 = distinct !DILexicalBlock(scope: !585, file: !352, line: 1825, column: 10)
!595 = !DISubprogram(name: "s_pack_internal", scope: !352, file: !352, line: 1716, type: !596, isLocal: true, isDefinition: true, scopeLine: 1717, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyStructObject*, %struct._object*, i32, i8*)* @s_pack_internal, variables: !598)
!596 = !DISubroutineType(types: !597)
!597 = !{!44, !350, !5, !44, !52}
!598 = !{!599, !600, !601, !602, !603, !604, !605, !609, !610, !611, !613, !616, !617, !618, !621, !622}
!599 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "soself", arg: 1, scope: !595, file: !352, line: 1716, type: !350)
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !595, file: !352, line: 1716, type: !5)
!601 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "offset", arg: 3, scope: !595, file: !352, line: 1716, type: !44)
!602 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 4, scope: !595, file: !352, line: 1716, type: !52)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !595, file: !352, line: 1718, type: !359)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !595, file: !352, line: 1721, type: !11)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !606, file: !352, line: 1726, type: !552)
!606 = distinct !DILexicalBlock(scope: !607, file: !352, line: 1725, column: 70)
!607 = distinct !DILexicalBlock(scope: !608, file: !352, line: 1725, column: 5)
!608 = distinct !DILexicalBlock(scope: !595, file: !352, line: 1725, column: 5)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !606, file: !352, line: 1727, type: !52)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !606, file: !352, line: 1728, type: !11)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !612, file: !352, line: 1730, type: !5)
!612 = distinct !DILexicalBlock(scope: !606, file: !352, line: 1729, column: 21)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !614, file: !352, line: 1732, type: !11)
!614 = distinct !DILexicalBlock(scope: !615, file: !352, line: 1731, column: 35)
!615 = distinct !DILexicalBlock(scope: !612, file: !352, line: 1731, column: 17)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "isstring", scope: !614, file: !352, line: 1733, type: !44)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !614, file: !352, line: 1734, type: !4)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !619, file: !352, line: 1754, type: !11)
!619 = distinct !DILexicalBlock(scope: !620, file: !352, line: 1753, column: 42)
!620 = distinct !DILexicalBlock(scope: !615, file: !352, line: 1753, column: 24)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "isstring", scope: !619, file: !352, line: 1755, type: !44)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !619, file: !352, line: 1756, type: !4)
!623 = !DISubprogram(name: "pack_into", scope: !352, file: !352, line: 2102, type: !126, isLocal: true, isDefinition: true, scopeLine: 2103, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @pack_into, variables: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !636, !638}
!625 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !623, file: !352, line: 2102, type: !5)
!626 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !623, file: !352, line: 2102, type: !5)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s_object", scope: !623, file: !352, line: 2104, type: !5)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmt", scope: !623, file: !352, line: 2104, type: !5)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newargs", scope: !623, file: !352, line: 2104, type: !5)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !623, file: !352, line: 2104, type: !5)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !623, file: !352, line: 2105, type: !11)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !633, file: !352, line: 2118, type: !5)
!633 = distinct !DILexicalBlock(scope: !634, file: !352, line: 2118, column: 12)
!634 = distinct !DILexicalBlock(scope: !635, file: !352, line: 2117, column: 33)
!635 = distinct !DILexicalBlock(scope: !623, file: !352, line: 2117, column: 9)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !637, file: !352, line: 2122, type: !5)
!637 = distinct !DILexicalBlock(scope: !623, file: !352, line: 2122, column: 8)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !639, file: !352, line: 2123, type: !5)
!639 = distinct !DILexicalBlock(scope: !623, file: !352, line: 2123, column: 8)
!640 = !DISubprogram(name: "s_pack_into", scope: !352, file: !352, line: 1842, type: !126, isLocal: true, isDefinition: true, scopeLine: 1843, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @s_pack_into, variables: !641)
!641 = !{!642, !643, !644, !645, !646, !647}
!642 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !640, file: !352, line: 1842, type: !5)
!643 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !640, file: !352, line: 1842, type: !5)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "soself", scope: !640, file: !352, line: 1844, type: !350)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !640, file: !352, line: 1845, type: !52)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer_len", scope: !640, file: !352, line: 1846, type: !11)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !640, file: !352, line: 1846, type: !11)
!648 = !DISubprogram(name: "unpack", scope: !352, file: !352, line: 2135, type: !126, isLocal: true, isDefinition: true, scopeLine: 2136, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @unpack, variables: !649)
!649 = !{!650, !651, !652, !653, !654, !655, !656}
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !648, file: !352, line: 2135, type: !5)
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !648, file: !352, line: 2135, type: !5)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s_object", scope: !648, file: !352, line: 2137, type: !5)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmt", scope: !648, file: !352, line: 2137, type: !5)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inputstr", scope: !648, file: !352, line: 2137, type: !5)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !648, file: !352, line: 2137, type: !5)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !657, file: !352, line: 2146, type: !5)
!657 = distinct !DILexicalBlock(scope: !648, file: !352, line: 2146, column: 8)
!658 = !DISubprogram(name: "s_unpack", scope: !352, file: !352, line: 1505, type: !126, isLocal: true, isDefinition: true, scopeLine: 1506, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @s_unpack, variables: !659)
!659 = !{!660, !661, !662, !663, !664}
!660 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !658, file: !352, line: 1505, type: !5)
!661 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 2, scope: !658, file: !352, line: 1505, type: !5)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vbuf", scope: !658, file: !352, line: 1507, type: !236)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !658, file: !352, line: 1508, type: !5)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "soself", scope: !658, file: !352, line: 1509, type: !350)
!665 = !DISubprogram(name: "unpack_from", scope: !352, file: !352, line: 2158, type: !135, isLocal: true, isDefinition: true, scopeLine: 2159, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @unpack_from, variables: !666)
!666 = !{!667, !668, !669, !670, !671, !672, !673, !674, !675, !679, !681}
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !665, file: !352, line: 2158, type: !5)
!668 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !665, file: !352, line: 2158, type: !5)
!669 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !665, file: !352, line: 2158, type: !5)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s_object", scope: !665, file: !352, line: 2160, type: !5)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmt", scope: !665, file: !352, line: 2160, type: !5)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newargs", scope: !665, file: !352, line: 2160, type: !5)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !665, file: !352, line: 2160, type: !5)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !665, file: !352, line: 2161, type: !11)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !676, file: !352, line: 2174, type: !5)
!676 = distinct !DILexicalBlock(scope: !677, file: !352, line: 2174, column: 12)
!677 = distinct !DILexicalBlock(scope: !678, file: !352, line: 2173, column: 33)
!678 = distinct !DILexicalBlock(scope: !665, file: !352, line: 2173, column: 9)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !680, file: !352, line: 2178, type: !5)
!680 = distinct !DILexicalBlock(scope: !665, file: !352, line: 2178, column: 8)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !682, file: !352, line: 2179, type: !5)
!682 = distinct !DILexicalBlock(scope: !665, file: !352, line: 2179, column: 8)
!683 = !DISubprogram(name: "s_unpack_from", scope: !352, file: !352, line: 1535, type: !135, isLocal: true, isDefinition: true, scopeLine: 1536, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @s_unpack_from, variables: !684)
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692}
!685 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !683, file: !352, line: 1535, type: !5)
!686 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !683, file: !352, line: 1535, type: !5)
!687 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !683, file: !352, line: 1535, type: !5)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "input", scope: !683, file: !352, line: 1539, type: !5)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !683, file: !352, line: 1540, type: !11)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vbuf", scope: !683, file: !352, line: 1541, type: !236)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !683, file: !352, line: 1542, type: !5)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "soself", scope: !683, file: !352, line: 1543, type: !350)
!693 = !DISubprogram(name: "s_dealloc", scope: !352, file: !352, line: 1448, type: !694, isLocal: true, isDefinition: true, scopeLine: 1449, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyStructObject*)* @s_dealloc, variables: !696)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !350}
!696 = !{!697, !698, !700}
!697 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !693, file: !352, line: 1448, type: !350)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !699, file: !352, line: 1455, type: !5)
!699 = distinct !DILexicalBlock(scope: !693, file: !352, line: 1455, column: 8)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !701, file: !352, line: 1455, type: !5)
!701 = distinct !DILexicalBlock(scope: !702, file: !352, line: 1455, column: 103)
!702 = distinct !DILexicalBlock(scope: !699, file: !352, line: 1455, column: 69)
!703 = !DISubprogram(name: "s_sizeof", scope: !352, file: !352, line: 1919, type: !704, isLocal: true, isDefinition: true, scopeLine: 1920, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyStructObject*, i8*)* @s_sizeof, variables: !706)
!704 = !DISubroutineType(types: !705)
!705 = !{!5, !350, !4}
!706 = !{!707, !708, !709, !710}
!707 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !703, file: !352, line: 1919, type: !350)
!708 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !703, file: !352, line: 1919, type: !4)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !703, file: !352, line: 1921, type: !11)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !703, file: !352, line: 1922, type: !359)
!711 = !DISubprogram(name: "s_get_format", scope: !352, file: !352, line: 1903, type: !704, isLocal: true, isDefinition: true, scopeLine: 1904, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyStructObject*, i8*)* @s_get_format, variables: !712)
!712 = !{!713, !714}
!713 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !711, file: !352, line: 1903, type: !350)
!714 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !711, file: !352, line: 1903, type: !4)
!715 = !DISubprogram(name: "s_get_size", scope: !352, file: !352, line: 1910, type: !704, isLocal: true, isDefinition: true, scopeLine: 1911, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyStructObject*, i8*)* @s_get_size, variables: !716)
!716 = !{!717, !718}
!717 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !715, file: !352, line: 1910, type: !350)
!718 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !715, file: !352, line: 1910, type: !4)
!719 = !DISubprogram(name: "s_init", scope: !352, file: !352, line: 1409, type: !211, isLocal: true, isDefinition: true, scopeLine: 1410, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, %struct._object*)* @s_init, variables: !720)
!720 = !{!721, !722, !723, !724, !725, !726, !727, !731, !733}
!721 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !719, file: !352, line: 1409, type: !5)
!722 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !719, file: !352, line: 1409, type: !5)
!723 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !719, file: !352, line: 1409, type: !5)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "soself", scope: !719, file: !352, line: 1411, type: !350)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o_format", scope: !719, file: !352, line: 1412, type: !5)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !719, file: !352, line: 1413, type: !44)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !728, file: !352, line: 1433, type: !5)
!728 = distinct !DILexicalBlock(scope: !729, file: !352, line: 1433, column: 12)
!729 = distinct !DILexicalBlock(scope: !730, file: !352, line: 1432, column: 83)
!730 = distinct !DILexicalBlock(scope: !719, file: !352, line: 1432, column: 9)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !732, file: !352, line: 1440, type: !5)
!732 = distinct !DILexicalBlock(scope: !719, file: !352, line: 1440, column: 8)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !734, file: !352, line: 1440, type: !5)
!734 = distinct !DILexicalBlock(scope: !735, file: !352, line: 1440, column: 127)
!735 = distinct !DILexicalBlock(scope: !736, file: !352, line: 1440, column: 89)
!736 = distinct !DILexicalBlock(scope: !732, file: !352, line: 1440, column: 66)
!737 = !DISubprogram(name: "prepare_s", scope: !352, file: !352, line: 1258, type: !738, isLocal: true, isDefinition: true, scopeLine: 1259, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyStructObject*)* @prepare_s, variables: !740)
!738 = !DISubroutineType(types: !739)
!739 = !{!44, !350}
!740 = !{!741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752}
!741 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !737, file: !352, line: 1258, type: !350)
!742 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !737, file: !352, line: 1260, type: !552)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !737, file: !352, line: 1261, type: !552)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codes", scope: !737, file: !352, line: 1262, type: !359)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !737, file: !352, line: 1264, type: !29)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmt", scope: !737, file: !352, line: 1265, type: !29)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !737, file: !352, line: 1266, type: !31)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !737, file: !352, line: 1267, type: !11)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !737, file: !352, line: 1267, type: !11)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncodes", scope: !737, file: !352, line: 1267, type: !11)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num", scope: !737, file: !352, line: 1267, type: !11)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemsize", scope: !737, file: !352, line: 1267, type: !11)
!753 = !DISubprogram(name: "whichtable", scope: !352, file: !352, line: 1193, type: !754, isLocal: true, isDefinition: true, scopeLine: 1194, flags: DIFlagPrototyped, isOptimized: true, function: %struct._formatdef* (i8**)* @whichtable, variables: !756)
!754 = !DISubroutineType(types: !755)
!755 = !{!552, !422}
!756 = !{!757, !758}
!757 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pfmt", arg: 1, scope: !753, file: !352, line: 1193, type: !422)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmt", scope: !753, file: !352, line: 1195, type: !29)
!759 = !DISubprogram(name: "nu_byte", scope: !352, file: !352, line: 354, type: !760, isLocal: true, isDefinition: true, scopeLine: 355, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct._formatdef*)* @nu_byte, variables: !762)
!760 = !DISubroutineType(types: !761)
!761 = !{!5, !29, !552}
!762 = !{!763, !764}
!763 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !759, file: !352, line: 354, type: !29)
!764 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 2, scope: !759, file: !352, line: 354, type: !552)
!765 = !DISubprogram(name: "np_byte", scope: !352, file: !352, line: 499, type: !766, isLocal: true, isDefinition: true, scopeLine: 500, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._object*, %struct._formatdef*)* @np_byte, variables: !768)
!766 = !DISubroutineType(types: !767)
!767 = !{!44, !52, !5, !552}
!768 = !{!769, !770, !771, !772}
!769 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !765, file: !352, line: 499, type: !52)
!770 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !765, file: !352, line: 499, type: !5)
!771 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 3, scope: !765, file: !352, line: 499, type: !552)
!772 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !765, file: !352, line: 501, type: !17)
!773 = !DISubprogram(name: "get_long", scope: !352, file: !352, line: 125, type: !774, isLocal: true, isDefinition: true, scopeLine: 126, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64*)* @get_long, variables: !777)
!774 = !DISubroutineType(types: !775)
!775 = !{!44, !5, !776}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!777 = !{!778, !779, !780, !781}
!778 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !773, file: !352, line: 125, type: !5)
!779 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !773, file: !352, line: 125, type: !776)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !773, file: !352, line: 127, type: !17)
!781 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !782, file: !352, line: 134, type: !5)
!782 = distinct !DILexicalBlock(scope: !773, file: !352, line: 134, column: 8)
!783 = !DISubprogram(name: "get_pylong", scope: !352, file: !352, line: 98, type: !116, isLocal: true, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @get_pylong, variables: !784)
!784 = !{!785}
!785 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !783, file: !352, line: 98, type: !5)
!786 = !DISubprogram(name: "nu_ubyte", scope: !352, file: !352, line: 360, type: !760, isLocal: true, isDefinition: true, scopeLine: 361, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct._formatdef*)* @nu_ubyte, variables: !787)
!787 = !{!788, !789}
!788 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !786, file: !352, line: 360, type: !29)
!789 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 2, scope: !786, file: !352, line: 360, type: !552)
!790 = !DISubprogram(name: "np_ubyte", scope: !352, file: !352, line: 514, type: !766, isLocal: true, isDefinition: true, scopeLine: 515, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._object*, %struct._formatdef*)* @np_ubyte, variables: !791)
!791 = !{!792, !793, !794, !795}
!792 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !790, file: !352, line: 514, type: !52)
!793 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !790, file: !352, line: 514, type: !5)
!794 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 3, scope: !790, file: !352, line: 514, type: !552)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !790, file: !352, line: 516, type: !17)
!796 = !DISubprogram(name: "nu_char", scope: !352, file: !352, line: 348, type: !760, isLocal: true, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct._formatdef*)* @nu_char, variables: !797)
!797 = !{!798, !799}
!798 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !796, file: !352, line: 348, type: !29)
!799 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 2, scope: !796, file: !352, line: 348, type: !552)
!800 = !DISubprogram(name: "np_char", scope: !352, file: !352, line: 529, type: !766, isLocal: true, isDefinition: true, scopeLine: 530, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._object*, %struct._formatdef*)* @np_char, variables: !801)
!801 = !{!802, !803, !804}
!802 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !800, file: !352, line: 529, type: !52)
!803 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !800, file: !352, line: 529, type: !5)
!804 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 3, scope: !800, file: !352, line: 529, type: !552)
!805 = !DISubprogram(name: "bu_int", scope: !352, file: !352, line: 756, type: !760, isLocal: true, isDefinition: true, scopeLine: 757, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct._formatdef*)* @bu_int, variables: !806)
!806 = !{!807, !808, !809, !810, !811}
!807 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !805, file: !352, line: 756, type: !29)
!808 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 2, scope: !805, file: !352, line: 756, type: !552)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !805, file: !352, line: 758, type: !17)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !805, file: !352, line: 759, type: !11)
!811 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !805, file: !352, line: 760, type: !424)
!812 = !DISubprogram(name: "bp_int", scope: !352, file: !352, line: 850, type: !766, isLocal: true, isDefinition: true, scopeLine: 851, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._object*, %struct._formatdef*)* @bp_int, variables: !813)
!813 = !{!814, !815, !816, !817, !818}
!814 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !812, file: !352, line: 850, type: !52)
!815 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !812, file: !352, line: 850, type: !5)
!816 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 3, scope: !812, file: !352, line: 850, type: !552)
!817 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !812, file: !352, line: 852, type: !17)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !812, file: !352, line: 853, type: !11)
!819 = !DISubprogram(name: "_range_error", scope: !352, file: !352, line: 297, type: !820, isLocal: true, isDefinition: true, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._formatdef*, i32)* @_range_error, variables: !822)
!820 = !DISubroutineType(types: !821)
!821 = !{!44, !552, !44}
!822 = !{!823, !824, !825, !827}
!823 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !819, file: !352, line: 297, type: !552)
!824 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "is_unsigned", arg: 2, scope: !819, file: !352, line: 297, type: !44)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ulargest", scope: !819, file: !352, line: 307, type: !826)
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!827 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "largest", scope: !828, file: !352, line: 315, type: !830)
!828 = distinct !DILexicalBlock(scope: !829, file: !352, line: 314, column: 10)
!829 = distinct !DILexicalBlock(scope: !819, file: !352, line: 309, column: 9)
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!831 = !DISubprogram(name: "bu_uint", scope: !352, file: !352, line: 771, type: !760, isLocal: true, isDefinition: true, scopeLine: 772, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct._formatdef*)* @bu_uint, variables: !832)
!832 = !{!833, !834, !835, !836, !837}
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !831, file: !352, line: 771, type: !29)
!834 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 2, scope: !831, file: !352, line: 771, type: !552)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !831, file: !352, line: 773, type: !96)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !831, file: !352, line: 774, type: !11)
!837 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !831, file: !352, line: 775, type: !424)
!838 = !DISubprogram(name: "bp_uint", scope: !352, file: !352, line: 873, type: !766, isLocal: true, isDefinition: true, scopeLine: 874, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._object*, %struct._formatdef*)* @bp_uint, variables: !839)
!839 = !{!840, !841, !842, !843, !844, !845}
!840 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !838, file: !352, line: 873, type: !52)
!841 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !838, file: !352, line: 873, type: !5)
!842 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 3, scope: !838, file: !352, line: 873, type: !552)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !838, file: !352, line: 875, type: !96)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !838, file: !352, line: 876, type: !11)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxint", scope: !846, file: !352, line: 881, type: !96)
!846 = distinct !DILexicalBlock(scope: !847, file: !352, line: 880, column: 17)
!847 = distinct !DILexicalBlock(scope: !838, file: !352, line: 880, column: 9)
!848 = !DISubprogram(name: "get_ulong", scope: !352, file: !352, line: 149, type: !849, isLocal: true, isDefinition: true, scopeLine: 150, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64*)* @get_ulong, variables: !852)
!849 = !DISubroutineType(types: !850)
!850 = !{!44, !5, !851}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!852 = !{!853, !854, !855, !856}
!853 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !848, file: !352, line: 149, type: !5)
!854 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !848, file: !352, line: 149, type: !851)
!855 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !848, file: !352, line: 151, type: !96)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !857, file: !352, line: 158, type: !5)
!857 = distinct !DILexicalBlock(scope: !848, file: !352, line: 158, column: 8)
!858 = !DISubprogram(name: "bu_longlong", scope: !352, file: !352, line: 785, type: !760, isLocal: true, isDefinition: true, scopeLine: 786, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct._formatdef*)* @bu_longlong, variables: !859)
!859 = !{!860, !861, !862, !863, !864}
!860 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !858, file: !352, line: 785, type: !29)
!861 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 2, scope: !858, file: !352, line: 785, type: !552)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !858, file: !352, line: 788, type: !426)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !858, file: !352, line: 789, type: !11)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !858, file: !352, line: 790, type: !424)
!865 = !DISubprogram(name: "bp_longlong", scope: !352, file: !352, line: 894, type: !766, isLocal: true, isDefinition: true, scopeLine: 895, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._object*, %struct._formatdef*)* @bp_longlong, variables: !866)
!866 = !{!867, !868, !869, !870, !871}
!867 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !865, file: !352, line: 894, type: !52)
!868 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !865, file: !352, line: 894, type: !5)
!869 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 3, scope: !865, file: !352, line: 894, type: !552)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !865, file: !352, line: 896, type: !44)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !872, file: !352, line: 905, type: !5)
!872 = distinct !DILexicalBlock(scope: !865, file: !352, line: 905, column: 8)
!873 = !DISubprogram(name: "bu_ulonglong", scope: !352, file: !352, line: 809, type: !760, isLocal: true, isDefinition: true, scopeLine: 810, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct._formatdef*)* @bu_ulonglong, variables: !874)
!874 = !{!875, !876, !877, !878, !879}
!875 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !873, file: !352, line: 809, type: !29)
!876 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 2, scope: !873, file: !352, line: 809, type: !552)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !873, file: !352, line: 812, type: !440)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !873, file: !352, line: 813, type: !11)
!879 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !873, file: !352, line: 814, type: !424)
!880 = !DISubprogram(name: "bp_ulonglong", scope: !352, file: !352, line: 910, type: !766, isLocal: true, isDefinition: true, scopeLine: 911, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._object*, %struct._formatdef*)* @bp_ulonglong, variables: !881)
!881 = !{!882, !883, !884, !885, !886}
!882 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !880, file: !352, line: 910, type: !52)
!883 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !880, file: !352, line: 910, type: !5)
!884 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 3, scope: !880, file: !352, line: 910, type: !552)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !880, file: !352, line: 912, type: !44)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !887, file: !352, line: 921, type: !5)
!887 = distinct !DILexicalBlock(scope: !880, file: !352, line: 921, column: 8)
!888 = !DISubprogram(name: "bu_bool", scope: !352, file: !352, line: 842, type: !760, isLocal: true, isDefinition: true, scopeLine: 843, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct._formatdef*)* @bu_bool, variables: !889)
!889 = !{!890, !891, !892}
!890 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !888, file: !352, line: 842, type: !29)
!891 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 2, scope: !888, file: !352, line: 842, type: !552)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !888, file: !352, line: 844, type: !31)
!893 = !DISubprogram(name: "bp_bool", scope: !352, file: !352, line: 950, type: !766, isLocal: true, isDefinition: true, scopeLine: 951, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._object*, %struct._formatdef*)* @bp_bool, variables: !894)
!894 = !{!895, !896, !897, !898}
!895 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !893, file: !352, line: 950, type: !52)
!896 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !893, file: !352, line: 950, type: !5)
!897 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 3, scope: !893, file: !352, line: 950, type: !552)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !893, file: !352, line: 952, type: !44)
!899 = !DISubprogram(name: "bu_float", scope: !352, file: !352, line: 830, type: !760, isLocal: true, isDefinition: true, scopeLine: 831, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct._formatdef*)* @bu_float, variables: !900)
!900 = !{!901, !902}
