; ModuleID = 'programs_new/Python-new/_testbuffer.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !410, globals: !1283)
!1 = !DIFile(filename: "_testbuffer.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !343, !351, !352, !44, !361, !52, !94, !369, !371, !29, !374, !396, !397, !11, !404}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !7, line: 109, baseType: !8)
!7 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !7, line: 105, size: 128, align: 64, elements: !9)
!9 = !{!10, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !8, file: !7, line: 107, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !12, line: 177, baseType: !13)
!12 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !14, line: 102, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !16, line: 181, baseType: !17)
!16 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !8, file: !7, line: 108, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !7, line: 334, size: 3200, align: 64, elements: !21)
!21 = !{!22, !28, !32, !33, !34, !39, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !291, !309, !310, !311, !313, !315, !316, !318, !323, !328, !333, !334, !335, !336, !337, !338, !339, !340, !342}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !20, file: !7, line: 335, baseType: !23, size: 192, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !7, line: 114, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 111, size: 192, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !24, file: !7, line: 112, baseType: !6, size: 128, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !24, file: !7, line: 113, baseType: !11, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !20, file: !7, line: 336, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !20, file: !7, line: 341, baseType: !35, size: 64, align: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !7, line: 308, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !5}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !20, file: !7, line: 342, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !7, line: 314, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !5, !45, !44}
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !14, line: 48, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 246, size: 1728, align: 64, elements: !49)
!48 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!49 = !{!50, !51, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !71, !72, !73, !74, !76, !78, !80, !84, !87, !89, !90, !91, !92, !93, !97, !98}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !48, line: 247, baseType: !44, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !47, file: !48, line: 252, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !47, file: !48, line: 253, baseType: !52, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !47, file: !48, line: 254, baseType: !52, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !47, file: !48, line: 255, baseType: !52, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !47, file: !48, line: 256, baseType: !52, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !47, file: !48, line: 257, baseType: !52, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !47, file: !48, line: 258, baseType: !52, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !47, file: !48, line: 259, baseType: !52, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !47, file: !48, line: 261, baseType: !52, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !47, file: !48, line: 262, baseType: !52, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !47, file: !48, line: 263, baseType: !52, size: 64, align: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !47, file: !48, line: 265, baseType: !64, size: 64, align: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !48, line: 161, size: 192, align: 64, elements: !66)
!66 = !{!67, !68, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !65, file: !48, line: 162, baseType: !64, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !65, file: !48, line: 163, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !65, file: !48, line: 167, baseType: !44, size: 32, align: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !47, file: !48, line: 267, baseType: !69, size: 64, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !47, file: !48, line: 269, baseType: !44, size: 32, align: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !47, file: !48, line: 273, baseType: !44, size: 32, align: 32, offset: 928)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !47, file: !48, line: 275, baseType: !75, size: 64, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !16, line: 140, baseType: !17)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !47, file: !48, line: 279, baseType: !77, size: 16, align: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !47, file: !48, line: 280, baseType: !79, size: 8, align: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !47, file: !48, line: 281, baseType: !81, size: 8, align: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !47, file: !48, line: 285, baseType: !85, size: 64, align: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !48, line: 155, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !47, file: !48, line: 294, baseType: !88, size: 64, align: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !16, line: 141, baseType: !17)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !47, file: !48, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !47, file: !48, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !47, file: !48, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !47, file: !48, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !47, file: !48, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !47, file: !48, line: 309, baseType: !44, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !47, file: !48, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !20, file: !7, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !7, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!5, !5, !52}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !20, file: !7, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !7, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!44, !5, !52, !5}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !20, file: !7, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !20, file: !7, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !7, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!5, !5}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !20, file: !7, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !7, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !7, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !7, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!5, !5, !5}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !7, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !7, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !7, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !7, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !7, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !7, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!5, !5, !5, !5}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !7, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !7, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !7, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !7, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !7, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !7, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!44, !5}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !7, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !7, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !7, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !7, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !7, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !7, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !7, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !7, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !7, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !7, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !7, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !7, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !7, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !7, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !7, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !7, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !7, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !7, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !7, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !7, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !7, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !7, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !7, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !7, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !20, file: !7, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !7, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !7, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !7, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!11, !5}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !7, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !7, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !7, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!5, !5, !11}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !7, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !7, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !7, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !7, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!44, !5, !11, !5}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !7, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !7, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !7, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!44, !5, !5}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !7, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !7, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !20, file: !7, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !7, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !7, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !7, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !7, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !7, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!44, !5, !5, !5}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !20, file: !7, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !7, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !5}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !12, line: 186, baseType: !11)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !20, file: !7, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !20, file: !7, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !20, file: !7, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !7, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !20, file: !7, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !7, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !20, file: !7, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !7, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !7, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !7, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!44, !5, !235, !44}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !7, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !7, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !7, line: 179, baseType: !4, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !7, line: 180, baseType: !5, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !7, line: 181, baseType: !11, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !7, line: 182, baseType: !11, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !7, line: 184, baseType: !44, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !7, line: 185, baseType: !44, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !7, line: 186, baseType: !52, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !7, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !7, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !7, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !7, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !7, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !7, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !5, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !20, file: !7, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !20, file: !7, line: 368, baseType: !29, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !20, file: !7, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !7, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!44, !5, !263, !4}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !7, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!44, !5, !4}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !20, file: !7, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !20, file: !7, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !7, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!5, !5, !5, !44}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !20, file: !7, line: 382, baseType: !11, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !20, file: !7, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !7, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !20, file: !7, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !7, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !20, file: !7, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !29, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !44, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !29, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !20, file: !7, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !7, line: 390, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !20, file: !7, line: 391, baseType: !292, size: 64, align: 64, offset: 1984)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !294, line: 11, size: 320, align: 64, elements: !295)
!294 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!295 = !{!296, !297, !302, !307, !308}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !293, file: !294, line: 12, baseType: !52, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !293, file: !294, line: 13, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !294, line: 8, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!5, !5, !4}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !293, file: !294, line: 14, baseType: !303, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !294, line: 9, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!44, !5, !5, !4}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !293, file: !294, line: 15, baseType: !52, size: 64, align: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !293, file: !294, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !20, file: !7, line: 392, baseType: !19, size: 64, align: 64, offset: 2048)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !20, file: !7, line: 393, baseType: !5, size: 64, align: 64, offset: 2112)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !20, file: !7, line: 394, baseType: !312, size: 64, align: 64, offset: 2176)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !7, line: 325, baseType: !134)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !20, file: !7, line: 395, baseType: !314, size: 64, align: 64, offset: 2240)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !7, line: 326, baseType: !210)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !20, file: !7, line: 396, baseType: !11, size: 64, align: 64, offset: 2304)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !20, file: !7, line: 397, baseType: !317, size: 64, align: 64, offset: 2368)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !7, line: 327, baseType: !210)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !20, file: !7, line: 398, baseType: !319, size: 64, align: 64, offset: 2432)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !7, line: 329, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!5, !19, !11}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !20, file: !7, line: 399, baseType: !324, size: 64, align: 64, offset: 2496)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !7, line: 328, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!5, !19, !5, !5}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !20, file: !7, line: 400, baseType: !329, size: 64, align: 64, offset: 2560)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !7, line: 307, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !4}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !20, file: !7, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !20, file: !7, line: 402, baseType: !5, size: 64, align: 64, offset: 2688)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !20, file: !7, line: 403, baseType: !5, size: 64, align: 64, offset: 2752)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !20, file: !7, line: 404, baseType: !5, size: 64, align: 64, offset: 2816)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !20, file: !7, line: 405, baseType: !5, size: 64, align: 64, offset: 2880)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !20, file: !7, line: 406, baseType: !5, size: 64, align: 64, offset: 2944)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !20, file: !7, line: 407, baseType: !35, size: 64, align: 64, offset: 3008)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !20, file: !7, line: 410, baseType: !341, size: 32, align: 32, offset: 3072)
!341 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !20, file: !7, line: 412, baseType: !35, size: 64, align: 64, offset: 3136)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !345, line: 33, baseType: !346)
!345 = !DIFile(filename: "./Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!346 = !DICompositeType(tag: DW_TAG_structure_type, file: !345, line: 25, size: 256, align: 64, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !346, file: !345, line: 26, baseType: !23, size: 192, align: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !346, file: !345, line: 27, baseType: !350, size: 64, align: 64, offset: 192)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, align: 64, elements: !82)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !354, line: 40, baseType: !355)
!354 = !DIFile(filename: "./Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!355 = !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 23, size: 320, align: 64, elements: !356)
!356 = !{!357, !358, !360}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !355, file: !354, line: 24, baseType: !23, size: 192, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !355, file: !354, line: 26, baseType: !359, size: 64, align: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !355, file: !354, line: 39, baseType: !11, size: 64, align: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !363, line: 41, baseType: !364)
!363 = !DIFile(filename: "./Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!364 = !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 31, size: 320, align: 64, elements: !365)
!365 = !{!366, !367, !368}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !364, file: !363, line: 32, baseType: !23, size: 192, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !364, file: !363, line: 33, baseType: !218, size: 64, align: 64, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !364, file: !363, line: 34, baseType: !81, size: 8, align: 8, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!373 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "NDArrayObject", file: !376, line: 105, baseType: !377)
!376 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_testbuffer.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!377 = !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 100, size: 1344, align: 64, elements: !378)
!378 = !{!379, !380, !381, !394}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !377, file: !376, line: 101, baseType: !6, size: 128, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !377, file: !376, line: 102, baseType: !44, size: 32, align: 32, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "staticbuf", scope: !377, file: !376, line: 103, baseType: !382, size: 1088, align: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "ndbuf_t", file: !376, line: 98, baseType: !383)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "ndbuf", file: !376, line: 89, size: 1088, align: 64, elements: !384)
!384 = !{!385, !387, !388, !389, !390, !391, !392, !393}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !383, file: !376, line: 90, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !383, file: !376, line: 91, baseType: !386, size: 64, align: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !383, file: !376, line: 92, baseType: !11, size: 64, align: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !383, file: !376, line: 93, baseType: !11, size: 64, align: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !383, file: !376, line: 94, baseType: !52, size: 64, align: 64, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !383, file: !376, line: 95, baseType: !44, size: 32, align: 32, offset: 320)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "exports", scope: !383, file: !376, line: 96, baseType: !11, size: 64, align: 64, offset: 384)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !383, file: !376, line: 97, baseType: !236, size: 640, align: 64, offset: 448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !377, file: !376, line: 104, baseType: !395, size: 64, align: 64, offset: 1280)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyPartialStructObject", file: !376, line: 289, baseType: !399)
!399 = !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 285, size: 256, align: 64, elements: !400)
!400 = !{!401, !402, !403}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !399, file: !376, line: 286, baseType: !6, size: 128, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "s_size", scope: !399, file: !376, line: 287, baseType: !11, size: 64, align: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "s_len", scope: !399, file: !376, line: 288, baseType: !11, size: 64, align: 64, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "StaticArrayObject", file: !376, line: 2674, baseType: !406)
!406 = !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 2671, size: 192, align: 64, elements: !407)
!407 = !{!408, !409}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !406, file: !376, line: 2672, baseType: !6, size: 128, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "legacy_mode", scope: !406, file: !376, line: 2673, baseType: !44, size: 32, align: 32, offset: 128)
!410 = !{!411, !416, !431, !449, !472, !475, !484, !493, !504, !513, !523, !548, !559, !569, !572, !578, !584, !601, !609, !617, !620, !648, !657, !671, !677, !694, !750, !753, !760, !769, !802, !815, !824, !835, !845, !854, !858, !893, !924, !936, !948, !974, !981, !992, !1005, !1055, !1068, !1075, !1089, !1102, !1121, !1125, !1130, !1137, !1145, !1151, !1156, !1161, !1166, !1171, !1176, !1182, !1187, !1192, !1208, !1213, !1218, !1224, !1230, !1236, !1249, !1259, !1264, !1271, !1278}
!411 = !DISubprogram(name: "PyInit__testbuffer", scope: !376, file: !376, line: 2811, type: !412, isLocal: false, isDefinition: true, scopeLine: 2812, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__testbuffer, variables: !414)
!412 = !DISubroutineType(types: !413)
!413 = !{!5}
!414 = !{!415}
!415 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !411, file: !376, line: 2813, type: !5)
!416 = !DISubprogram(name: "slice_indices", scope: !376, file: !376, line: 1910, type: !126, isLocal: true, isDefinition: true, scopeLine: 1911, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @slice_indices, variables: !417)
!417 = !{!418, !419, !420, !421, !422, !423, !427, !428, !429}
!418 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !416, file: !376, line: 1910, type: !5)
!419 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !416, file: !376, line: 1910, type: !5)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !416, file: !376, line: 1912, type: !5)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !416, file: !376, line: 1912, type: !5)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !416, file: !376, line: 1912, type: !5)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !416, file: !376, line: 1913, type: !424)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 256, align: 64, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 4)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !416, file: !376, line: 1914, type: !11)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !416, file: !376, line: 1914, type: !11)
!429 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !430, file: !376, line: 1942, type: !5)
!430 = distinct !DILexicalBlock(scope: !416, file: !376, line: 1942, column: 8)
!431 = !DISubprogram(name: "get_pointer", scope: !376, file: !376, line: 2291, type: !126, isLocal: true, isDefinition: true, scopeLine: 2292, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @get_pointer, variables: !432)
!432 = !{!433, !434, !435, !436, !437, !438, !439, !443, !444, !445}
!433 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !431, file: !376, line: 2291, type: !5)
!434 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !431, file: !376, line: 2291, type: !5)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !431, file: !376, line: 2293, type: !5)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bufobj", scope: !431, file: !376, line: 2293, type: !5)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seq", scope: !431, file: !376, line: 2293, type: !5)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view", scope: !431, file: !376, line: 2294, type: !236)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !431, file: !376, line: 2295, type: !440)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8192, align: 64, elements: !441)
!441 = !{!442}
!442 = !DISubrange(count: 128)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !431, file: !376, line: 2296, type: !11)
!444 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !431, file: !376, line: 2297, type: !4)
!445 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !446, file: !376, line: 2319, type: !5)
!446 = distinct !DILexicalBlock(scope: !447, file: !376, line: 2318, column: 37)
!447 = distinct !DILexicalBlock(scope: !448, file: !376, line: 2318, column: 5)
!448 = distinct !DILexicalBlock(scope: !431, file: !376, line: 2318, column: 5)
!449 = !DISubprogram(name: "unpack_single", scope: !376, file: !376, line: 572, type: !450, isLocal: true, isDefinition: true, scopeLine: 573, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i8*, i64)* @unpack_single, variables: !452)
!450 = !DISubroutineType(types: !451)
!451 = !{!5, !52, !29, !11}
!452 = !{!453, !454, !455, !456, !457, !458, !459, !463, !465, !467, !470}
!453 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !449, file: !376, line: 572, type: !52)
!454 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt", arg: 2, scope: !449, file: !376, line: 572, type: !29)
!455 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "itemsize", arg: 3, scope: !449, file: !376, line: 572, type: !11)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !449, file: !376, line: 574, type: !5)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unpack_from", scope: !449, file: !376, line: 574, type: !5)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mview", scope: !449, file: !376, line: 574, type: !5)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !460, file: !376, line: 587, type: !5)
!460 = distinct !DILexicalBlock(scope: !461, file: !376, line: 587, column: 12)
!461 = distinct !DILexicalBlock(scope: !462, file: !376, line: 586, column: 30)
!462 = distinct !DILexicalBlock(scope: !449, file: !376, line: 586, column: 9)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !464, file: !376, line: 592, type: !5)
!464 = distinct !DILexicalBlock(scope: !449, file: !376, line: 592, column: 8)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !466, file: !376, line: 593, type: !5)
!466 = distinct !DILexicalBlock(scope: !449, file: !376, line: 593, column: 8)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !468, file: !376, line: 598, type: !5)
!468 = distinct !DILexicalBlock(scope: !469, file: !376, line: 597, column: 46)
!469 = distinct !DILexicalBlock(scope: !449, file: !376, line: 597, column: 9)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !471, file: !376, line: 600, type: !5)
!471 = distinct !DILexicalBlock(scope: !468, file: !376, line: 600, column: 12)
!472 = !DISubprogram(name: "get_sizeof_void_p", scope: !376, file: !376, line: 2340, type: !116, isLocal: true, isDefinition: true, scopeLine: 2341, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @get_sizeof_void_p, variables: !473)
!473 = !{!474}
!474 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !472, file: !376, line: 2340, type: !5)
!475 = !DISubprogram(name: "get_contiguous", scope: !376, file: !376, line: 2376, type: !126, isLocal: true, isDefinition: true, scopeLine: 2377, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @get_contiguous, variables: !476)
!476 = !{!477, !478, !479, !480, !481, !482, !483}
!477 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !475, file: !376, line: 2376, type: !5)
!478 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !475, file: !376, line: 2376, type: !5)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !475, file: !376, line: 2378, type: !5)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffertype", scope: !475, file: !376, line: 2379, type: !5)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !475, file: !376, line: 2380, type: !5)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !475, file: !376, line: 2381, type: !17)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ord", scope: !475, file: !376, line: 2382, type: !31)
!484 = !DISubprogram(name: "get_ascii_order", scope: !376, file: !376, line: 2346, type: !485, isLocal: true, isDefinition: true, scopeLine: 2347, flags: DIFlagPrototyped, isOptimized: true, function: i8 (%struct._object*)* @get_ascii_order, variables: !487)
!485 = !DISubroutineType(types: !486)
!486 = !{!31, !5}
!487 = !{!488, !489, !490, !491}
!488 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !484, file: !376, line: 2346, type: !5)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ascii_order", scope: !484, file: !376, line: 2348, type: !5)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ord", scope: !484, file: !376, line: 2349, type: !31)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !492, file: !376, line: 2363, type: !5)
!492 = distinct !DILexicalBlock(scope: !484, file: !376, line: 2363, column: 8)
!493 = !DISubprogram(name: "py_buffer_to_contiguous", scope: !376, file: !376, line: 2413, type: !126, isLocal: true, isDefinition: true, scopeLine: 2414, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @py_buffer_to_contiguous, variables: !494)
!494 = !{!495, !496, !497, !498, !499, !500, !501, !502, !503}
!495 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !493, file: !376, line: 2413, type: !5)
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !493, file: !376, line: 2413, type: !5)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !493, file: !376, line: 2415, type: !5)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !493, file: !376, line: 2416, type: !5)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !493, file: !376, line: 2417, type: !5)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !493, file: !376, line: 2418, type: !44)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ord", scope: !493, file: !376, line: 2419, type: !31)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view", scope: !493, file: !376, line: 2420, type: !236)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !493, file: !376, line: 2421, type: !52)
!504 = !DISubprogram(name: "is_contiguous", scope: !376, file: !376, line: 2553, type: !126, isLocal: true, isDefinition: true, scopeLine: 2554, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @is_contiguous, variables: !505)
!505 = !{!506, !507, !508, !509, !510, !511, !512}
!506 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !504, file: !376, line: 2553, type: !5)
!507 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !504, file: !376, line: 2553, type: !5)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !504, file: !376, line: 2555, type: !5)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !504, file: !376, line: 2556, type: !5)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !504, file: !376, line: 2557, type: !5)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view", scope: !504, file: !376, line: 2558, type: !236)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ord", scope: !504, file: !376, line: 2559, type: !31)
!513 = !DISubprogram(name: "cmp_contig", scope: !376, file: !376, line: 2489, type: !126, isLocal: true, isDefinition: true, scopeLine: 2490, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmp_contig, variables: !514)
!514 = !{!515, !516, !517, !518, !519, !520, !521, !522}
!515 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !513, file: !376, line: 2489, type: !5)
!516 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !513, file: !376, line: 2489, type: !5)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b1", scope: !513, file: !376, line: 2491, type: !5)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b2", scope: !513, file: !376, line: 2491, type: !5)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v1", scope: !513, file: !376, line: 2492, type: !236)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v2", scope: !513, file: !376, line: 2492, type: !236)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !513, file: !376, line: 2493, type: !5)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "equal", scope: !513, file: !376, line: 2494, type: !44)
!523 = !DISubprogram(name: "fmtcmp", scope: !376, file: !376, line: 2455, type: !524, isLocal: true, isDefinition: true, scopeLine: 2456, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*)* @fmtcmp, variables: !526)
!524 = !DISubroutineType(types: !525)
!525 = !{!44, !29, !29}
!526 = !{!527, !528, !529, !533, !534, !536, !537, !541, !542, !544, !545, !547}
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt1", arg: 1, scope: !523, file: !376, line: 2455, type: !29)
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt2", arg: 2, scope: !523, file: !376, line: 2455, type: !29)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !530, file: !376, line: 2458, type: !94)
!530 = distinct !DILexicalBlock(scope: !531, file: !376, line: 2458, column: 53)
!531 = distinct !DILexicalBlock(scope: !532, file: !376, line: 2457, column: 29)
!532 = distinct !DILexicalBlock(scope: !523, file: !376, line: 2457, column: 9)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !530, file: !376, line: 2458, type: !94)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !535, file: !376, line: 2458, type: !371)
!535 = distinct !DILexicalBlock(scope: !530, file: !376, line: 2458, column: 1539)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !535, file: !376, line: 2458, type: !44)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !538, file: !376, line: 2461, type: !94)
!538 = distinct !DILexicalBlock(scope: !539, file: !376, line: 2461, column: 53)
!539 = distinct !DILexicalBlock(scope: !540, file: !376, line: 2460, column: 29)
!540 = distinct !DILexicalBlock(scope: !523, file: !376, line: 2460, column: 9)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !538, file: !376, line: 2461, type: !94)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !543, file: !376, line: 2461, type: !371)
!543 = distinct !DILexicalBlock(scope: !538, file: !376, line: 2461, column: 1539)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !543, file: !376, line: 2461, type: !44)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !546, file: !376, line: 2463, type: !94)
!546 = distinct !DILexicalBlock(scope: !523, file: !376, line: 2463, column: 27)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !546, file: !376, line: 2463, type: !94)
!548 = !DISubprogram(name: "arraycmp", scope: !376, file: !376, line: 2467, type: !549, isLocal: true, isDefinition: true, scopeLine: 2469, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i64*, i64*, i64*, i64)* @arraycmp, variables: !553)
!549 = !DISubroutineType(types: !550)
!550 = !{!44, !551, !551, !551, !11}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!553 = !{!554, !555, !556, !557, !558}
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a1", arg: 1, scope: !548, file: !376, line: 2467, type: !551)
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a2", arg: 2, scope: !548, file: !376, line: 2467, type: !551)
!556 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "shape", arg: 3, scope: !548, file: !376, line: 2467, type: !551)
!557 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndim", arg: 4, scope: !548, file: !376, line: 2468, type: !11)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !548, file: !376, line: 2470, type: !11)
!559 = !DISubprogram(name: "ndarray_dealloc", scope: !376, file: !376, line: 222, type: !560, isLocal: true, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.NDArrayObject*)* @ndarray_dealloc, variables: !562)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !374}
!562 = !{!563, !564}
!563 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !559, file: !376, line: 222, type: !374)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !565, file: !376, line: 226, type: !235)
!565 = distinct !DILexicalBlock(scope: !566, file: !376, line: 225, column: 85)
!566 = distinct !DILexicalBlock(scope: !567, file: !376, line: 225, column: 13)
!567 = distinct !DILexicalBlock(scope: !568, file: !376, line: 224, column: 21)
!568 = distinct !DILexicalBlock(scope: !559, file: !376, line: 224, column: 9)
!569 = !DISubprogram(name: "ndbuf_pop", scope: !376, file: !376, line: 201, type: !560, isLocal: true, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.NDArrayObject*)* @ndbuf_pop, variables: !570)
!570 = !{!571}
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nd", arg: 1, scope: !569, file: !376, line: 201, type: !374)
!572 = !DISubprogram(name: "ndbuf_delete", scope: !376, file: !376, line: 187, type: !573, isLocal: true, isDefinition: true, scopeLine: 188, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.NDArrayObject*, %struct.ndbuf*)* @ndbuf_delete, variables: !575)
!573 = !DISubroutineType(types: !574)
!574 = !{null, !374, !395}
!575 = !{!576, !577}
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nd", arg: 1, scope: !572, file: !376, line: 187, type: !374)
!577 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "elt", arg: 2, scope: !572, file: !376, line: 187, type: !395)
!578 = !DISubprogram(name: "ndbuf_free", scope: !376, file: !376, line: 164, type: !579, isLocal: true, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.ndbuf*)* @ndbuf_free, variables: !581)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !395}
!581 = !{!582, !583}
!582 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndbuf", arg: 1, scope: !578, file: !376, line: 164, type: !395)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !578, file: !376, line: 166, type: !235)
!584 = !DISubprogram(name: "ndarray_item", scope: !376, file: !376, line: 1576, type: !585, isLocal: true, isDefinition: true, scopeLine: 1577, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.NDArrayObject*, i64)* @ndarray_item, variables: !587)
!585 = !DISubroutineType(types: !586)
!586 = !{!5, !374, !11}
!587 = !{!588, !589, !590, !591, !592, !593, !596, !597}
!588 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !584, file: !376, line: 1576, type: !374)
!589 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 2, scope: !584, file: !376, line: 1576, type: !11)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndbuf", scope: !584, file: !376, line: 1578, type: !395)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !584, file: !376, line: 1579, type: !235)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !584, file: !376, line: 1580, type: !52)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nd", scope: !594, file: !376, line: 1595, type: !374)
!594 = distinct !DILexicalBlock(scope: !595, file: !376, line: 1594, column: 10)
!595 = distinct !DILexicalBlock(scope: !584, file: !376, line: 1591, column: 9)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "subview", scope: !594, file: !376, line: 1596, type: !235)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !598, file: !376, line: 1603, type: !5)
!598 = distinct !DILexicalBlock(scope: !599, file: !376, line: 1603, column: 16)
!599 = distinct !DILexicalBlock(scope: !600, file: !376, line: 1602, column: 104)
!600 = distinct !DILexicalBlock(scope: !594, file: !376, line: 1602, column: 13)
!601 = !DISubprogram(name: "ptr_from_index", scope: !376, file: !376, line: 1543, type: !602, isLocal: true, isDefinition: true, scopeLine: 1544, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.bufferinfo*, i64)* @ptr_from_index, variables: !604)
!602 = !DISubroutineType(types: !603)
!603 = !{!52, !235, !11}
!604 = !{!605, !606, !607, !608}
!605 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 1, scope: !601, file: !376, line: 1543, type: !235)
!606 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 2, scope: !601, file: !376, line: 1543, type: !11)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !601, file: !376, line: 1545, type: !52)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nitems", scope: !601, file: !376, line: 1546, type: !11)
!609 = !DISubprogram(name: "ndarray_init_staticbuf", scope: !376, file: !376, line: 243, type: !610, isLocal: true, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct.NDArrayObject*, i32)* @ndarray_init_staticbuf, variables: !612)
!610 = !DISubroutineType(types: !611)
!611 = !{!44, !5, !374, !44}
!612 = !{!613, !614, !615, !616}
!613 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exporter", arg: 1, scope: !609, file: !376, line: 243, type: !5)
!614 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nd", arg: 2, scope: !609, file: !376, line: 243, type: !374)
!615 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 3, scope: !609, file: !376, line: 243, type: !44)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !609, file: !376, line: 245, type: !235)
!617 = !DISubprogram(name: "init_flags", scope: !376, file: !376, line: 265, type: !579, isLocal: true, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.ndbuf*)* @init_flags, variables: !618)
!618 = !{!619}
!619 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndbuf", arg: 1, scope: !617, file: !376, line: 265, type: !395)
!620 = !DISubprogram(name: "ndarray_subscript", scope: !376, file: !376, line: 1768, type: !621, isLocal: true, isDefinition: true, scopeLine: 1769, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.NDArrayObject*, %struct._object*)* @ndarray_subscript, variables: !623)
!621 = !DISubroutineType(types: !622)
!622 = !{!5, !374, !5}
!623 = !{!624, !625, !626, !627, !628, !629, !632, !636, !640, !644, !645, !646}
!624 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !620, file: !376, line: 1768, type: !374)
!625 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !620, file: !376, line: 1768, type: !5)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nd", scope: !620, file: !376, line: 1770, type: !374)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndbuf", scope: !620, file: !376, line: 1771, type: !395)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !620, file: !376, line: 1772, type: !235)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !630, file: !376, line: 1788, type: !11)
!630 = distinct !DILexicalBlock(scope: !631, file: !376, line: 1787, column: 111)
!631 = distinct !DILexicalBlock(scope: !620, file: !376, line: 1787, column: 9)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !633, file: !376, line: 1800, type: !5)
!633 = distinct !DILexicalBlock(scope: !634, file: !376, line: 1800, column: 12)
!634 = distinct !DILexicalBlock(scope: !635, file: !376, line: 1799, column: 100)
!635 = distinct !DILexicalBlock(scope: !620, file: !376, line: 1799, column: 9)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !637, file: !376, line: 1808, type: !5)
!637 = distinct !DILexicalBlock(scope: !638, file: !376, line: 1808, column: 12)
!638 = distinct !DILexicalBlock(scope: !639, file: !376, line: 1807, column: 35)
!639 = distinct !DILexicalBlock(scope: !620, file: !376, line: 1807, column: 9)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tuple", scope: !641, file: !376, line: 1820, type: !5)
!641 = distinct !DILexicalBlock(scope: !642, file: !376, line: 1818, column: 82)
!642 = distinct !DILexicalBlock(scope: !643, file: !376, line: 1818, column: 14)
!643 = distinct !DILexicalBlock(scope: !620, file: !376, line: 1813, column: 9)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !641, file: !376, line: 1821, type: !11)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !641, file: !376, line: 1821, type: !11)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !647, file: !376, line: 1847, type: !5)
!647 = distinct !DILexicalBlock(scope: !620, file: !376, line: 1847, column: 8)
!648 = !DISubprogram(name: "copy_structure", scope: !376, file: !376, line: 1729, type: !649, isLocal: true, isDefinition: true, scopeLine: 1730, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.bufferinfo*)* @copy_structure, variables: !651)
!649 = !DISubroutineType(types: !650)
!650 = !{!44, !235}
!651 = !{!652, !653, !654, !655, !656}
!652 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 1, scope: !648, file: !376, line: 1729, type: !235)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shape", scope: !648, file: !376, line: 1731, type: !247)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "strides", scope: !648, file: !376, line: 1731, type: !247)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "suboffsets", scope: !648, file: !376, line: 1731, type: !247)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !648, file: !376, line: 1732, type: !11)
!657 = !DISubprogram(name: "init_slice", scope: !376, file: !376, line: 1700, type: !658, isLocal: true, isDefinition: true, scopeLine: 1701, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.bufferinfo*, %struct._object*, i32)* @init_slice, variables: !660)
!658 = !DISubroutineType(types: !659)
!659 = !{!44, !235, !5, !44}
!660 = !{!661, !662, !663, !664, !665, !666, !667, !668}
!661 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 1, scope: !657, file: !376, line: 1700, type: !235)
!662 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !657, file: !376, line: 1700, type: !5)
!663 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dim", arg: 3, scope: !657, file: !376, line: 1700, type: !44)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !657, file: !376, line: 1702, type: !11)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stop", scope: !657, file: !376, line: 1702, type: !11)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step", scope: !657, file: !376, line: 1702, type: !11)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slicelength", scope: !657, file: !376, line: 1702, type: !11)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !669, file: !376, line: 1715, type: !11)
!669 = distinct !DILexicalBlock(scope: !670, file: !376, line: 1714, column: 10)
!670 = distinct !DILexicalBlock(scope: !657, file: !376, line: 1710, column: 9)
!671 = !DISubprogram(name: "init_len", scope: !376, file: !376, line: 1108, type: !672, isLocal: true, isDefinition: true, scopeLine: 1109, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.bufferinfo*)* @init_len, variables: !674)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !235}
!674 = !{!675, !676}
!675 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 1, scope: !671, file: !376, line: 1108, type: !235)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !671, file: !376, line: 1110, type: !11)
!677 = !DISubprogram(name: "ndarray_ass_subscript", scope: !376, file: !376, line: 1853, type: !678, isLocal: true, isDefinition: true, scopeLine: 1854, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.NDArrayObject*, %struct._object*, %struct._object*)* @ndarray_ass_subscript, variables: !680)
!678 = !DISubroutineType(types: !679)
!679 = !{!44, !374, !5, !5}
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688, !689, !690}
!681 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !677, file: !376, line: 1853, type: !374)
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !677, file: !376, line: 1853, type: !5)
!683 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !677, file: !376, line: 1853, type: !5)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nd", scope: !677, file: !376, line: 1855, type: !374)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !677, file: !376, line: 1856, type: !235)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "src", scope: !677, file: !376, line: 1857, type: !236)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !677, file: !376, line: 1858, type: !52)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !677, file: !376, line: 1859, type: !11)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !677, file: !376, line: 1860, type: !44)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !691, file: !376, line: 1902, type: !5)
!691 = distinct !DILexicalBlock(scope: !692, file: !376, line: 1902, column: 12)
!692 = distinct !DILexicalBlock(scope: !693, file: !376, line: 1899, column: 27)
!693 = distinct !DILexicalBlock(scope: !677, file: !376, line: 1899, column: 9)
!694 = !DISubprogram(name: "pack_single", scope: !376, file: !376, line: 395, type: !695, isLocal: true, isDefinition: true, scopeLine: 396, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._object*, i8*, i64)* @pack_single, variables: !697)
!695 = !DISubroutineType(types: !696)
!696 = !{!44, !52, !5, !29, !11}
!697 = !{!698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !716, !720, !722, !725, !727, !730, !732, !735, !737, !740, !742, !745, !747}
!698 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !694, file: !376, line: 395, type: !52)
!699 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 2, scope: !694, file: !376, line: 395, type: !5)
!700 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt", arg: 3, scope: !694, file: !376, line: 395, type: !29)
!701 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "itemsize", arg: 4, scope: !694, file: !376, line: 395, type: !11)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "structobj", scope: !694, file: !376, line: 397, type: !5)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pack_into", scope: !694, file: !376, line: 397, type: !5)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !694, file: !376, line: 397, type: !5)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format", scope: !694, file: !376, line: 398, type: !5)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mview", scope: !694, file: !376, line: 398, type: !5)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zero", scope: !694, file: !376, line: 398, type: !5)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !694, file: !376, line: 399, type: !11)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nmemb", scope: !694, file: !376, line: 399, type: !11)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !694, file: !376, line: 400, type: !44)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !694, file: !376, line: 401, type: !5)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !713, file: !376, line: 454, type: !5)
!713 = distinct !DILexicalBlock(scope: !714, file: !376, line: 454, column: 12)
!714 = distinct !DILexicalBlock(scope: !715, file: !376, line: 453, column: 26)
!715 = distinct !DILexicalBlock(scope: !694, file: !376, line: 453, column: 9)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !717, file: !376, line: 461, type: !5)
!717 = distinct !DILexicalBlock(scope: !718, file: !376, line: 461, column: 12)
!718 = distinct !DILexicalBlock(scope: !719, file: !376, line: 460, column: 5)
!719 = distinct !DILexicalBlock(scope: !694, file: !376, line: 460, column: 5)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !721, file: !376, line: 462, type: !5)
!721 = distinct !DILexicalBlock(scope: !694, file: !376, line: 462, column: 8)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !723, file: !376, line: 462, type: !5)
!723 = distinct !DILexicalBlock(scope: !724, file: !376, line: 462, column: 96)
!724 = distinct !DILexicalBlock(scope: !721, file: !376, line: 462, column: 62)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !726, file: !376, line: 464, type: !5)
!726 = distinct !DILexicalBlock(scope: !694, file: !376, line: 464, column: 8)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !728, file: !376, line: 464, type: !5)
!728 = distinct !DILexicalBlock(scope: !729, file: !376, line: 464, column: 101)
!729 = distinct !DILexicalBlock(scope: !726, file: !376, line: 464, column: 67)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !731, file: !376, line: 465, type: !5)
!731 = distinct !DILexicalBlock(scope: !694, file: !376, line: 465, column: 8)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !733, file: !376, line: 465, type: !5)
!733 = distinct !DILexicalBlock(scope: !734, file: !376, line: 465, column: 96)
!734 = distinct !DILexicalBlock(scope: !731, file: !376, line: 465, column: 62)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !736, file: !376, line: 466, type: !5)
!736 = distinct !DILexicalBlock(scope: !694, file: !376, line: 466, column: 8)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !738, file: !376, line: 466, type: !5)
!738 = distinct !DILexicalBlock(scope: !739, file: !376, line: 466, column: 97)
!739 = distinct !DILexicalBlock(scope: !736, file: !376, line: 466, column: 63)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !741, file: !376, line: 467, type: !5)
!741 = distinct !DILexicalBlock(scope: !694, file: !376, line: 467, column: 8)
!742 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !743, file: !376, line: 467, type: !5)
!743 = distinct !DILexicalBlock(scope: !744, file: !376, line: 467, column: 101)
!744 = distinct !DILexicalBlock(scope: !741, file: !376, line: 467, column: 67)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !746, file: !376, line: 468, type: !5)
!746 = distinct !DILexicalBlock(scope: !694, file: !376, line: 468, column: 8)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !748, file: !376, line: 468, type: !5)
!748 = distinct !DILexicalBlock(scope: !749, file: !376, line: 468, column: 98)
!749 = distinct !DILexicalBlock(scope: !746, file: !376, line: 468, column: 64)
!750 = !DISubprogram(name: "get_nmemb", scope: !376, file: !376, line: 292, type: !178, isLocal: true, isDefinition: true, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @get_nmemb, variables: !751)
!751 = !{!752}
!752 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !750, file: !376, line: 292, type: !5)
!753 = !DISubprogram(name: "copy_buffer", scope: !376, file: !376, line: 537, type: !754, isLocal: true, isDefinition: true, scopeLine: 538, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.bufferinfo*, %struct.bufferinfo*)* @copy_buffer, variables: !756)
!754 = !DISubroutineType(types: !755)
!755 = !{!44, !235, !235}
!756 = !{!757, !758, !759}
!757 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !753, file: !376, line: 537, type: !235)
!758 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !753, file: !376, line: 537, type: !235)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mem", scope: !753, file: !376, line: 539, type: !52)
!760 = !DISubprogram(name: "cmp_structure", scope: !376, file: !376, line: 514, type: !754, isLocal: true, isDefinition: true, scopeLine: 515, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.bufferinfo*, %struct.bufferinfo*)* @cmp_structure, variables: !761)
!761 = !{!762, !763, !764, !765, !768}
!762 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !760, file: !376, line: 514, type: !235)
!763 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !760, file: !376, line: 514, type: !235)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !760, file: !376, line: 516, type: !11)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !766, file: !376, line: 518, type: !94)
!766 = distinct !DILexicalBlock(scope: !767, file: !376, line: 518, column: 24)
!767 = distinct !DILexicalBlock(scope: !760, file: !376, line: 518, column: 9)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !766, file: !376, line: 518, type: !94)
!769 = !DISubprogram(name: "copy_rec", scope: !376, file: !376, line: 473, type: !770, isLocal: true, isDefinition: true, scopeLine: 477, flags: DIFlagPrototyped, isOptimized: true, function: void (i64*, i64, i64, i8*, i64*, i64*, i8*, i64*, i64*, i8*)* @copy_rec, variables: !772)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !551, !11, !11, !52, !551, !551, !52, !551, !551, !52}
!772 = !{!773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !789, !793, !797, !801}
!773 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "shape", arg: 1, scope: !769, file: !376, line: 473, type: !551)
!774 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndim", arg: 2, scope: !769, file: !376, line: 473, type: !11)
!775 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "itemsize", arg: 3, scope: !769, file: !376, line: 473, type: !11)
!776 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dptr", arg: 4, scope: !769, file: !376, line: 474, type: !52)
!777 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dstrides", arg: 5, scope: !769, file: !376, line: 474, type: !551)
!778 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dsuboffsets", arg: 6, scope: !769, file: !376, line: 474, type: !551)
!779 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sptr", arg: 7, scope: !769, file: !376, line: 475, type: !52)
!780 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sstrides", arg: 8, scope: !769, file: !376, line: 475, type: !551)
!781 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ssuboffsets", arg: 9, scope: !769, file: !376, line: 475, type: !551)
!782 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mem", arg: 10, scope: !769, file: !376, line: 476, type: !52)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !769, file: !376, line: 478, type: !11)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !785, file: !376, line: 488, type: !52)
!785 = distinct !DILexicalBlock(scope: !786, file: !376, line: 487, column: 14)
!786 = distinct !DILexicalBlock(scope: !787, file: !376, line: 483, column: 13)
!787 = distinct !DILexicalBlock(scope: !788, file: !376, line: 482, column: 20)
!788 = distinct !DILexicalBlock(scope: !769, file: !376, line: 482, column: 9)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xsptr", scope: !790, file: !376, line: 491, type: !52)
!790 = distinct !DILexicalBlock(scope: !791, file: !376, line: 490, column: 79)
!791 = distinct !DILexicalBlock(scope: !792, file: !376, line: 490, column: 13)
!792 = distinct !DILexicalBlock(scope: !785, file: !376, line: 490, column: 13)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xdptr", scope: !794, file: !376, line: 495, type: !52)
!794 = distinct !DILexicalBlock(scope: !795, file: !376, line: 494, column: 79)
!795 = distinct !DILexicalBlock(scope: !796, file: !376, line: 494, column: 13)
!796 = distinct !DILexicalBlock(scope: !785, file: !376, line: 494, column: 13)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xdptr", scope: !798, file: !376, line: 503, type: !52)
!798 = distinct !DILexicalBlock(scope: !799, file: !376, line: 502, column: 74)
!799 = distinct !DILexicalBlock(scope: !800, file: !376, line: 502, column: 5)
!800 = distinct !DILexicalBlock(scope: !769, file: !376, line: 502, column: 5)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xsptr", scope: !798, file: !376, line: 504, type: !52)
!802 = !DISubprogram(name: "ndarray_hash", scope: !376, file: !376, line: 2586, type: !216, isLocal: true, isDefinition: true, scopeLine: 2587, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @ndarray_hash, variables: !803)
!803 = !{!804, !805, !808, !811, !812, !813}
!804 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !802, file: !376, line: 2586, type: !5)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nd", scope: !802, file: !376, line: 2588, type: !806)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64, align: 64)
!807 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !375)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view", scope: !802, file: !376, line: 2589, type: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!811 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !802, file: !376, line: 2590, type: !5)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hash", scope: !802, file: !376, line: 2591, type: !218)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !814, file: !376, line: 2608, type: !5)
!814 = distinct !DILexicalBlock(scope: !802, file: !376, line: 2608, column: 8)
!815 = !DISubprogram(name: "ndarray_tobytes", scope: !376, file: !376, line: 2143, type: !126, isLocal: true, isDefinition: true, scopeLine: 2144, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @ndarray_tobytes, variables: !816)
!816 = !{!817, !818, !819, !820, !821, !822, !823}
!817 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !815, file: !376, line: 2143, type: !5)
!818 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dummy", arg: 2, scope: !815, file: !376, line: 2143, type: !5)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndbuf", scope: !815, file: !376, line: 2145, type: !395)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "src", scope: !815, file: !376, line: 2146, type: !235)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !815, file: !376, line: 2147, type: !236)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !815, file: !376, line: 2148, type: !5)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mem", scope: !815, file: !376, line: 2149, type: !52)
!824 = !DISubprogram(name: "strides_from_shape", scope: !376, file: !376, line: 886, type: !825, isLocal: true, isDefinition: true, scopeLine: 887, flags: DIFlagPrototyped, isOptimized: true, function: i64* (%struct.ndbuf*, i32)* @strides_from_shape, variables: !829)
!825 = !DISubroutineType(types: !826)
!826 = !{!247, !827, !44}
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64, align: 64)
!828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !382)
!829 = !{!830, !831, !832, !833, !834}
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndbuf", arg: 1, scope: !824, file: !376, line: 886, type: !827)
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 2, scope: !824, file: !376, line: 886, type: !44)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !824, file: !376, line: 888, type: !809)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !824, file: !376, line: 889, type: !247)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !824, file: !376, line: 889, type: !11)
!835 = !DISubprogram(name: "ndarray_getbuf", scope: !376, file: !376, line: 1416, type: !836, isLocal: true, isDefinition: true, scopeLine: 1417, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.NDArrayObject*, %struct.bufferinfo*, i32)* @ndarray_getbuf, variables: !838)
!836 = !DISubroutineType(types: !837)
!837 = !{!44, !374, !235, !44}
!838 = !{!839, !840, !841, !842, !843, !844}
!839 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !835, file: !376, line: 1416, type: !374)
!840 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 2, scope: !835, file: !376, line: 1416, type: !235)
!841 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 3, scope: !835, file: !376, line: 1416, type: !44)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndbuf", scope: !835, file: !376, line: 1418, type: !395)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !835, file: !376, line: 1419, type: !235)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "baseflags", scope: !835, file: !376, line: 1420, type: !44)
!845 = !DISubprogram(name: "ndarray_releasebuf", scope: !376, file: !376, line: 1521, type: !846, isLocal: true, isDefinition: true, scopeLine: 1522, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.NDArrayObject*, %struct.bufferinfo*)* @ndarray_releasebuf, variables: !848)
!846 = !DISubroutineType(types: !847)
!847 = !{!44, !374, !235}
!848 = !{!849, !850, !851}
!849 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !845, file: !376, line: 1521, type: !374)
!850 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 2, scope: !845, file: !376, line: 1521, type: !235)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndbuf", scope: !852, file: !376, line: 1524, type: !395)
!852 = distinct !DILexicalBlock(scope: !853, file: !376, line: 1523, column: 82)
!853 = distinct !DILexicalBlock(scope: !845, file: !376, line: 1523, column: 9)
!854 = !DISubprogram(name: "ndarray_tolist", scope: !376, file: !376, line: 2137, type: !126, isLocal: true, isDefinition: true, scopeLine: 2138, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @ndarray_tolist, variables: !855)
!855 = !{!856, !857}
!856 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !854, file: !376, line: 2137, type: !5)
!857 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dummy", arg: 2, scope: !854, file: !376, line: 2137, type: !5)
!858 = !DISubprogram(name: "ndarray_as_list", scope: !376, file: !376, line: 658, type: !859, isLocal: true, isDefinition: true, scopeLine: 659, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.NDArrayObject*)* @ndarray_as_list, variables: !861)
!859 = !DISubroutineType(types: !860)
!860 = !{!5, !374}
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870, !872, !873, !874, !875, !876, !878, !880, !883, !885, !888, !890}
!862 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nd", arg: 1, scope: !858, file: !376, line: 658, type: !374)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "structobj", scope: !858, file: !376, line: 660, type: !5)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unpack_from", scope: !858, file: !376, line: 660, type: !5)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lst", scope: !858, file: !376, line: 661, type: !5)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mview", scope: !858, file: !376, line: 661, type: !5)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !858, file: !376, line: 662, type: !235)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shape", scope: !858, file: !376, line: 663, type: !247)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "strides", scope: !858, file: !376, line: 664, type: !247)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "simple_shape", scope: !858, file: !376, line: 665, type: !871)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 64, align: 64, elements: !82)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "simple_strides", scope: !858, file: !376, line: 666, type: !871)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !858, file: !376, line: 667, type: !52)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format", scope: !858, file: !376, line: 668, type: !5)
!875 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fmt", scope: !858, file: !376, line: 669, type: !52)
!876 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !877, file: !376, line: 700, type: !5)
!877 = distinct !DILexicalBlock(scope: !858, file: !376, line: 700, column: 8)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !879, file: !376, line: 723, type: !5)
!879 = distinct !DILexicalBlock(scope: !858, file: !376, line: 723, column: 8)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !881, file: !376, line: 723, type: !5)
!881 = distinct !DILexicalBlock(scope: !882, file: !376, line: 723, column: 97)
!882 = distinct !DILexicalBlock(scope: !879, file: !376, line: 723, column: 63)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !884, file: !376, line: 725, type: !5)
!884 = distinct !DILexicalBlock(scope: !858, file: !376, line: 725, column: 8)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !886, file: !376, line: 725, type: !5)
!886 = distinct !DILexicalBlock(scope: !887, file: !376, line: 725, column: 103)
!887 = distinct !DILexicalBlock(scope: !884, file: !376, line: 725, column: 69)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !889, file: !376, line: 726, type: !5)
!889 = distinct !DILexicalBlock(scope: !858, file: !376, line: 726, column: 8)
!890 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !891, file: !376, line: 726, type: !5)
!891 = distinct !DILexicalBlock(scope: !892, file: !376, line: 726, column: 101)
!892 = distinct !DILexicalBlock(scope: !889, file: !376, line: 726, column: 67)
!893 = !DISubprogram(name: "unpack_rec", scope: !376, file: !376, line: 610, type: !894, isLocal: true, isDefinition: true, scopeLine: 613, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*, %struct._object*, i8*, i64*, i64*, i64*, i64, i64)* @unpack_rec, variables: !896)
!894 = !DISubroutineType(types: !895)
!895 = !{!5, !5, !52, !5, !52, !551, !551, !551, !11, !11}
!896 = !{!897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !914, !916, !920}
!897 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unpack_from", arg: 1, scope: !893, file: !376, line: 610, type: !5)
!898 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 2, scope: !893, file: !376, line: 610, type: !52)
!899 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mview", arg: 3, scope: !893, file: !376, line: 610, type: !5)
!900 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 4, scope: !893, file: !376, line: 610, type: !52)
!901 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "shape", arg: 5, scope: !893, file: !376, line: 611, type: !551)
!902 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "strides", arg: 6, scope: !893, file: !376, line: 611, type: !551)
!903 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "suboffsets", arg: 7, scope: !893, file: !376, line: 612, type: !551)
!904 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndim", arg: 8, scope: !893, file: !376, line: 612, type: !11)
!905 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "itemsize", arg: 9, scope: !893, file: !376, line: 612, type: !11)
!906 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lst", scope: !893, file: !376, line: 614, type: !5)
!907 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !893, file: !376, line: 614, type: !5)
!908 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !893, file: !376, line: 615, type: !11)
!909 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !910, file: !376, line: 627, type: !5)
!910 = distinct !DILexicalBlock(scope: !911, file: !376, line: 626, column: 50)
!911 = distinct !DILexicalBlock(scope: !912, file: !376, line: 626, column: 13)
!912 = distinct !DILexicalBlock(scope: !913, file: !376, line: 621, column: 20)
!913 = distinct !DILexicalBlock(scope: !893, file: !376, line: 621, column: 9)
!914 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !915, file: !376, line: 629, type: !5)
!915 = distinct !DILexicalBlock(scope: !910, file: !376, line: 629, column: 16)
!916 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nextptr", scope: !917, file: !376, line: 640, type: !52)
!917 = distinct !DILexicalBlock(scope: !918, file: !376, line: 639, column: 53)
!918 = distinct !DILexicalBlock(scope: !919, file: !376, line: 639, column: 5)
!919 = distinct !DILexicalBlock(scope: !893, file: !376, line: 639, column: 5)
!920 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !921, file: !376, line: 646, type: !5)
!921 = distinct !DILexicalBlock(scope: !922, file: !376, line: 646, column: 16)
!922 = distinct !DILexicalBlock(scope: !923, file: !376, line: 645, column: 30)
!923 = distinct !DILexicalBlock(scope: !917, file: !376, line: 645, column: 13)
!924 = !DISubprogram(name: "ndarray_push", scope: !376, file: !376, line: 1345, type: !135, isLocal: true, isDefinition: true, scopeLine: 1346, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @ndarray_push, variables: !925)
!925 = !{!926, !927, !928, !929, !930, !931, !932, !933, !934, !935}
!926 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !924, file: !376, line: 1345, type: !5)
!927 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !924, file: !376, line: 1345, type: !5)
