; ModuleID = 'irs-onlybc/_testcapimodule.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._longobject = type { %struct.PyVarObject, [1 x i32] }
%struct.PyVarObject = type { %struct._object, i64 }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !19, subprograms: !508, globals: !1832)
!1 = !DIFile(filename: "_testcapimodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !8, !13}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 190, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "PyGILState_LOCKED", value: 0)
!7 = !DIEnumerator(name: "PyGILState_UNLOCKED", value: 1)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 57, size: 32, align: 32, elements: !10)
!9 = !DIFile(filename: "./Include/pytime.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "_PyTime_ROUND_DOWN", value: 0)
!12 = !DIEnumerator(name: "_PyTime_ROUND_UP", value: 1)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 117, size: 32, align: 32, elements: !15)
!14 = !DIFile(filename: "./Include/pymem.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !{!16, !17, !18}
!16 = !DIEnumerator(name: "PYMEM_DOMAIN_RAW", value: 0)
!17 = !DIEnumerator(name: "PYMEM_DOMAIN_MEM", value: 1)
!18 = !DIEnumerator(name: "PYMEM_DOMAIN_OBJ", value: 2)
!19 = !{!20, !105, !26, !110, !366, !374, !404, !112, !32, !413, !414, !59, !364, !422, !423, !424, !443, !380, !451, !477}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !22, line: 109, baseType: !23)
!22 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !22, line: 105, size: 128, align: 64, elements: !24)
!24 = !{!25, !33}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !23, file: !22, line: 107, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !27, line: 177, baseType: !28)
!27 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !29, line: 102, baseType: !30)
!29 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !31, line: 181, baseType: !32)
!31 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!32 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !23, file: !22, line: 108, baseType: !34, size: 64, align: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !22, line: 334, size: 3200, align: 64, elements: !36)
!36 = !{!37, !43, !47, !48, !49, !54, !118, !123, !128, !129, !134, !186, !217, !229, !235, !236, !237, !239, !241, !272, !273, !274, !283, !284, !289, !290, !292, !294, !304, !314, !332, !333, !334, !336, !338, !339, !341, !346, !351, !356, !357, !358, !359, !360, !361, !362, !363, !365}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !35, file: !22, line: 335, baseType: !38, size: 192, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !22, line: 114, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 111, size: 192, align: 64, elements: !40)
!40 = !{!41, !42}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !39, file: !22, line: 112, baseType: !21, size: 128, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !39, file: !22, line: 113, baseType: !26, size: 64, align: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !35, file: !22, line: 336, baseType: !44, size: 64, align: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !35, file: !22, line: 337, baseType: !26, size: 64, align: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !35, file: !22, line: 337, baseType: !26, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !35, file: !22, line: 341, baseType: !50, size: 64, align: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !22, line: 308, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !20}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !35, file: !22, line: 342, baseType: !55, size: 64, align: 64, offset: 448)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !22, line: 314, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !20, !60, !59}
!59 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !29, line: 48, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !63, line: 246, size: 1728, align: 64, elements: !64)
!63 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!64 = !{!65, !66, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !86, !87, !88, !89, !91, !93, !95, !99, !102, !104, !106, !107, !108, !109, !113, !114}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !62, file: !63, line: 247, baseType: !59, size: 32, align: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !62, file: !63, line: 252, baseType: !67, size: 64, align: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !62, file: !63, line: 253, baseType: !67, size: 64, align: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !62, file: !63, line: 254, baseType: !67, size: 64, align: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !62, file: !63, line: 255, baseType: !67, size: 64, align: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !62, file: !63, line: 256, baseType: !67, size: 64, align: 64, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !62, file: !63, line: 257, baseType: !67, size: 64, align: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !62, file: !63, line: 258, baseType: !67, size: 64, align: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !62, file: !63, line: 259, baseType: !67, size: 64, align: 64, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !62, file: !63, line: 261, baseType: !67, size: 64, align: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !62, file: !63, line: 262, baseType: !67, size: 64, align: 64, offset: 640)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !62, file: !63, line: 263, baseType: !67, size: 64, align: 64, offset: 704)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !62, file: !63, line: 265, baseType: !79, size: 64, align: 64, offset: 768)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !63, line: 161, size: 192, align: 64, elements: !81)
!81 = !{!82, !83, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !80, file: !63, line: 162, baseType: !79, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !80, file: !63, line: 163, baseType: !84, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !80, file: !63, line: 167, baseType: !59, size: 32, align: 32, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !62, file: !63, line: 267, baseType: !84, size: 64, align: 64, offset: 832)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !62, file: !63, line: 269, baseType: !59, size: 32, align: 32, offset: 896)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !62, file: !63, line: 273, baseType: !59, size: 32, align: 32, offset: 928)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !62, file: !63, line: 275, baseType: !90, size: 64, align: 64, offset: 960)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !31, line: 140, baseType: !32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !62, file: !63, line: 279, baseType: !92, size: 16, align: 16, offset: 1024)
!92 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !62, file: !63, line: 280, baseType: !94, size: 8, align: 8, offset: 1040)
!94 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !62, file: !63, line: 281, baseType: !96, size: 8, align: 8, offset: 1048)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 8, align: 8, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 1)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !62, file: !63, line: 285, baseType: !100, size: 64, align: 64, offset: 1088)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !63, line: 155, baseType: null)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !62, file: !63, line: 294, baseType: !103, size: 64, align: 64, offset: 1152)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !31, line: 141, baseType: !32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !62, file: !63, line: 303, baseType: !105, size: 64, align: 64, offset: 1216)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !62, file: !63, line: 304, baseType: !105, size: 64, align: 64, offset: 1280)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !62, file: !63, line: 305, baseType: !105, size: 64, align: 64, offset: 1344)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !62, file: !63, line: 306, baseType: !105, size: 64, align: 64, offset: 1408)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !62, file: !63, line: 307, baseType: !110, size: 64, align: 64, offset: 1472)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !111, line: 62, baseType: !112)
!111 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!112 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !62, file: !63, line: 309, baseType: !59, size: 32, align: 32, offset: 1536)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !62, file: !63, line: 311, baseType: !115, size: 160, align: 8, offset: 1568)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 160, align: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 20)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !35, file: !22, line: 343, baseType: !119, size: 64, align: 64, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !22, line: 316, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!20, !20, !67}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !35, file: !22, line: 344, baseType: !124, size: 64, align: 64, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !22, line: 318, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!59, !20, !67, !20}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !35, file: !22, line: 345, baseType: !105, size: 64, align: 64, offset: 640)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !35, file: !22, line: 346, baseType: !130, size: 64, align: 64, offset: 704)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !22, line: 320, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!20, !20}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !35, file: !22, line: 350, baseType: !135, size: 64, align: 64, offset: 768)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !22, line: 278, baseType: !137)
!137 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 236, size: 2176, align: 64, elements: !138)
!138 = !{!139, !144, !145, !146, !147, !148, !153, !155, !156, !157, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !137, file: !22, line: 241, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !22, line: 166, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!20, !20, !20}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !137, file: !22, line: 242, baseType: !140, size: 64, align: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !137, file: !22, line: 243, baseType: !140, size: 64, align: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !137, file: !22, line: 244, baseType: !140, size: 64, align: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !137, file: !22, line: 245, baseType: !140, size: 64, align: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !137, file: !22, line: 246, baseType: !149, size: 64, align: 64, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !22, line: 167, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!20, !20, !20, !20}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !137, file: !22, line: 247, baseType: !154, size: 64, align: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !22, line: 165, baseType: !131)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !137, file: !22, line: 248, baseType: !154, size: 64, align: 64, offset: 448)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !137, file: !22, line: 249, baseType: !154, size: 64, align: 64, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !137, file: !22, line: 250, baseType: !158, size: 64, align: 64, offset: 576)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !22, line: 168, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!59, !20}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !137, file: !22, line: 251, baseType: !154, size: 64, align: 64, offset: 640)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !137, file: !22, line: 252, baseType: !140, size: 64, align: 64, offset: 704)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !137, file: !22, line: 253, baseType: !140, size: 64, align: 64, offset: 768)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !137, file: !22, line: 254, baseType: !140, size: 64, align: 64, offset: 832)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !137, file: !22, line: 255, baseType: !140, size: 64, align: 64, offset: 896)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !137, file: !22, line: 256, baseType: !140, size: 64, align: 64, offset: 960)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !137, file: !22, line: 257, baseType: !154, size: 64, align: 64, offset: 1024)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !137, file: !22, line: 258, baseType: !105, size: 64, align: 64, offset: 1088)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !137, file: !22, line: 259, baseType: !154, size: 64, align: 64, offset: 1152)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !137, file: !22, line: 261, baseType: !140, size: 64, align: 64, offset: 1216)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !137, file: !22, line: 262, baseType: !140, size: 64, align: 64, offset: 1280)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !137, file: !22, line: 263, baseType: !140, size: 64, align: 64, offset: 1344)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !137, file: !22, line: 264, baseType: !140, size: 64, align: 64, offset: 1408)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !137, file: !22, line: 265, baseType: !149, size: 64, align: 64, offset: 1472)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !137, file: !22, line: 266, baseType: !140, size: 64, align: 64, offset: 1536)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !137, file: !22, line: 267, baseType: !140, size: 64, align: 64, offset: 1600)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !137, file: !22, line: 268, baseType: !140, size: 64, align: 64, offset: 1664)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !137, file: !22, line: 269, baseType: !140, size: 64, align: 64, offset: 1728)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !137, file: !22, line: 270, baseType: !140, size: 64, align: 64, offset: 1792)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !137, file: !22, line: 272, baseType: !140, size: 64, align: 64, offset: 1856)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !137, file: !22, line: 273, baseType: !140, size: 64, align: 64, offset: 1920)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !137, file: !22, line: 274, baseType: !140, size: 64, align: 64, offset: 1984)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !137, file: !22, line: 275, baseType: !140, size: 64, align: 64, offset: 2048)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !137, file: !22, line: 277, baseType: !154, size: 64, align: 64, offset: 2112)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !35, file: !22, line: 351, baseType: !187, size: 64, align: 64, offset: 832)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !22, line: 292, baseType: !189)
!189 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 280, size: 640, align: 64, elements: !190)
!190 = !{!191, !196, !197, !202, !203, !204, !209, !210, !215, !216}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !189, file: !22, line: 281, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !22, line: 169, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!26, !20}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !189, file: !22, line: 282, baseType: !140, size: 64, align: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !189, file: !22, line: 283, baseType: !198, size: 64, align: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !22, line: 170, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!20, !20, !26}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !189, file: !22, line: 284, baseType: !198, size: 64, align: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !189, file: !22, line: 285, baseType: !105, size: 64, align: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !189, file: !22, line: 286, baseType: !205, size: 64, align: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !22, line: 172, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!59, !20, !26, !20}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !189, file: !22, line: 287, baseType: !105, size: 64, align: 64, offset: 384)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !189, file: !22, line: 288, baseType: !211, size: 64, align: 64, offset: 448)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !22, line: 231, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!59, !20, !20}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !189, file: !22, line: 290, baseType: !140, size: 64, align: 64, offset: 512)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !189, file: !22, line: 291, baseType: !198, size: 64, align: 64, offset: 576)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !35, file: !22, line: 352, baseType: !218, size: 64, align: 64, offset: 896)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !22, line: 298, baseType: !220)
!220 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 294, size: 192, align: 64, elements: !221)
!221 = !{!222, !223, !224}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !220, file: !22, line: 295, baseType: !192, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !220, file: !22, line: 296, baseType: !140, size: 64, align: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !220, file: !22, line: 297, baseType: !225, size: 64, align: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !22, line: 174, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!59, !20, !20, !20}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !35, file: !22, line: 356, baseType: !230, size: 64, align: 64, offset: 960)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !22, line: 321, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!234, !20}
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !27, line: 186, baseType: !26)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !35, file: !22, line: 357, baseType: !149, size: 64, align: 64, offset: 1024)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !35, file: !22, line: 358, baseType: !130, size: 64, align: 64, offset: 1088)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !35, file: !22, line: 359, baseType: !238, size: 64, align: 64, offset: 1152)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !22, line: 317, baseType: !141)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !35, file: !22, line: 360, baseType: !240, size: 64, align: 64, offset: 1216)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !22, line: 319, baseType: !226)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !35, file: !22, line: 363, baseType: !242, size: 64, align: 64, offset: 1280)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !22, line: 304, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 301, size: 128, align: 64, elements: !245)
!245 = !{!246, !267}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !244, file: !22, line: 302, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !22, line: 193, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{!59, !20, !251, !59}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !22, line: 191, baseType: !253)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !22, line: 178, size: 640, align: 64, elements: !254)
!254 = !{!255, !256, !257, !258, !259, !260, !261, !262, !264, !265, !266}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !253, file: !22, line: 179, baseType: !105, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !253, file: !22, line: 180, baseType: !20, size: 64, align: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !253, file: !22, line: 181, baseType: !26, size: 64, align: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !253, file: !22, line: 182, baseType: !26, size: 64, align: 64, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !253, file: !22, line: 184, baseType: !59, size: 32, align: 32, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !253, file: !22, line: 185, baseType: !59, size: 32, align: 32, offset: 288)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !253, file: !22, line: 186, baseType: !67, size: 64, align: 64, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !253, file: !22, line: 187, baseType: !263, size: 64, align: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !253, file: !22, line: 188, baseType: !263, size: 64, align: 64, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !253, file: !22, line: 189, baseType: !263, size: 64, align: 64, offset: 512)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !253, file: !22, line: 190, baseType: !105, size: 64, align: 64, offset: 576)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !244, file: !22, line: 303, baseType: !268, size: 64, align: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !22, line: 194, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !20, !251}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !35, file: !22, line: 366, baseType: !112, size: 64, align: 64, offset: 1344)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !35, file: !22, line: 368, baseType: !44, size: 64, align: 64, offset: 1408)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !35, file: !22, line: 372, baseType: !275, size: 64, align: 64, offset: 1472)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !22, line: 233, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!59, !20, !279, !105}
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !22, line: 232, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!59, !20, !105}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !35, file: !22, line: 375, baseType: !158, size: 64, align: 64, offset: 1536)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !35, file: !22, line: 379, baseType: !285, size: 64, align: 64, offset: 1600)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !22, line: 322, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!20, !20, !20, !59}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !35, file: !22, line: 382, baseType: !26, size: 64, align: 64, offset: 1664)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !35, file: !22, line: 385, baseType: !291, size: 64, align: 64, offset: 1728)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !22, line: 323, baseType: !131)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !35, file: !22, line: 386, baseType: !293, size: 64, align: 64, offset: 1792)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !22, line: 324, baseType: !131)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !35, file: !22, line: 389, baseType: !295, size: 64, align: 64, offset: 1856)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !297, line: 40, size: 256, align: 64, elements: !298)
!297 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!298 = !{!299, !300, !302, !303}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !296, file: !297, line: 41, baseType: !44, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !296, file: !297, line: 42, baseType: !301, size: 64, align: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !297, line: 18, baseType: !141)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !296, file: !297, line: 43, baseType: !59, size: 32, align: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !296, file: !297, line: 45, baseType: !44, size: 64, align: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !35, file: !22, line: 390, baseType: !305, size: 64, align: 64, offset: 1920)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !307, line: 18, size: 320, align: 64, elements: !308)
!307 = !DIFile(filename: "./Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!308 = !{!309, !310, !311, !312, !313}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !307, line: 19, baseType: !67, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !306, file: !307, line: 20, baseType: !59, size: 32, align: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !306, file: !307, line: 21, baseType: !26, size: 64, align: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !306, file: !307, line: 22, baseType: !59, size: 32, align: 32, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !306, file: !307, line: 23, baseType: !67, size: 64, align: 64, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !35, file: !22, line: 391, baseType: !315, size: 64, align: 64, offset: 1984)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !317, line: 11, size: 320, align: 64, elements: !318)
!317 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!318 = !{!319, !320, !325, !330, !331}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !316, file: !317, line: 12, baseType: !67, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !316, file: !317, line: 13, baseType: !321, size: 64, align: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !317, line: 8, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!20, !20, !105}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !316, file: !317, line: 14, baseType: !326, size: 64, align: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !317, line: 9, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!59, !20, !20, !105}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !316, file: !317, line: 15, baseType: !67, size: 64, align: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !316, file: !317, line: 16, baseType: !105, size: 64, align: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !35, file: !22, line: 392, baseType: !34, size: 64, align: 64, offset: 2048)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !35, file: !22, line: 393, baseType: !20, size: 64, align: 64, offset: 2112)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !35, file: !22, line: 394, baseType: !335, size: 64, align: 64, offset: 2176)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !22, line: 325, baseType: !150)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !35, file: !22, line: 395, baseType: !337, size: 64, align: 64, offset: 2240)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !22, line: 326, baseType: !226)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !35, file: !22, line: 396, baseType: !26, size: 64, align: 64, offset: 2304)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !35, file: !22, line: 397, baseType: !340, size: 64, align: 64, offset: 2368)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !22, line: 327, baseType: !226)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !35, file: !22, line: 398, baseType: !342, size: 64, align: 64, offset: 2432)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !22, line: 329, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!20, !34, !26}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !35, file: !22, line: 399, baseType: !347, size: 64, align: 64, offset: 2496)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !22, line: 328, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!20, !34, !20, !20}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !35, file: !22, line: 400, baseType: !352, size: 64, align: 64, offset: 2560)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !22, line: 307, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !105}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !35, file: !22, line: 401, baseType: !158, size: 64, align: 64, offset: 2624)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !35, file: !22, line: 402, baseType: !20, size: 64, align: 64, offset: 2688)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !35, file: !22, line: 403, baseType: !20, size: 64, align: 64, offset: 2752)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !35, file: !22, line: 404, baseType: !20, size: 64, align: 64, offset: 2816)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !35, file: !22, line: 405, baseType: !20, size: 64, align: 64, offset: 2880)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !35, file: !22, line: 406, baseType: !20, size: 64, align: 64, offset: 2944)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !35, file: !22, line: 407, baseType: !50, size: 64, align: 64, offset: 3008)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !35, file: !22, line: 410, baseType: !364, size: 32, align: 32, offset: 3072)
!364 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !35, file: !22, line: 412, baseType: !50, size: 64, align: 64, offset: 3136)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !368, line: 33, baseType: !369)
!368 = !DIFile(filename: "./Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!369 = !DICompositeType(tag: DW_TAG_structure_type, file: !368, line: 25, size: 256, align: 64, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !369, file: !368, line: 26, baseType: !38, size: 192, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !369, file: !368, line: 27, baseType: !373, size: 64, align: 64, offset: 192)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 64, align: 64, elements: !97)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDateTime_CAPI", file: !376, line: 165, baseType: !377)
!376 = !DIFile(filename: "./Include/datetime.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!377 = !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 146, size: 704, align: 64, elements: !378)
!378 = !{!379, !382, !383, !384, !385, !386, !390, !394, !398, !402, !403}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "DateType", scope: !377, file: !376, line: 148, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !22, line: 422, baseType: !35)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "DateTimeType", scope: !377, file: !376, line: 149, baseType: !380, size: 64, align: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "TimeType", scope: !377, file: !376, line: 150, baseType: !380, size: 64, align: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "DeltaType", scope: !377, file: !376, line: 151, baseType: !380, size: 64, align: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "TZInfoType", scope: !377, file: !376, line: 152, baseType: !380, size: 64, align: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "Date_FromDate", scope: !377, file: !376, line: 155, baseType: !387, size: 64, align: 64, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!20, !59, !59, !59, !380}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "DateTime_FromDateAndTime", scope: !377, file: !376, line: 156, baseType: !391, size: 64, align: 64, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!20, !59, !59, !59, !59, !59, !59, !59, !20, !380}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Time_FromTime", scope: !377, file: !376, line: 158, baseType: !395, size: 64, align: 64, offset: 448)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!20, !59, !59, !59, !59, !20, !380}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "Delta_FromDelta", scope: !377, file: !376, line: 159, baseType: !399, size: 64, align: 64, offset: 512)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!20, !59, !59, !59, !59, !380}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "DateTime_FromTimestamp", scope: !377, file: !376, line: 162, baseType: !150, size: 64, align: 64, offset: 576)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Date_FromTimestamp", scope: !377, file: !376, line: 163, baseType: !141, size: 64, align: 64, offset: 640)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !406, line: 40, baseType: !407)
!406 = !DIFile(filename: "./Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!407 = !DICompositeType(tag: DW_TAG_structure_type, file: !406, line: 23, size: 320, align: 64, elements: !408)
!408 = !{!409, !410, !412}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !407, file: !406, line: 24, baseType: !38, size: 192, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !407, file: !406, line: 26, baseType: !411, size: 64, align: 64, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !407, file: !406, line: 39, baseType: !26, size: 64, align: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !416, line: 41, baseType: !417)
!416 = !DIFile(filename: "./Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!417 = !DICompositeType(tag: DW_TAG_structure_type, file: !416, line: 31, size: 320, align: 64, elements: !418)
!418 = !{!419, !420, !421}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !417, file: !416, line: 32, baseType: !38, size: 192, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !417, file: !416, line: 33, baseType: !234, size: 64, align: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !417, file: !416, line: 34, baseType: !96, size: 8, align: 8, offset: 256)
!422 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!423 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !426, line: 351, baseType: !427)
!426 = !DIFile(filename: "./Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!427 = !DICompositeType(tag: DW_TAG_structure_type, file: !426, line: 217, size: 384, align: 64, elements: !428)
!428 = !{!429, !430, !431, !432, !440}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !427, file: !426, line: 291, baseType: !21, size: 128, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !427, file: !426, line: 292, baseType: !26, size: 64, align: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !427, file: !426, line: 293, baseType: !234, size: 64, align: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !427, file: !426, line: 349, baseType: !433, size: 32, align: 32, offset: 256)
!433 = !DICompositeType(tag: DW_TAG_structure_type, scope: !427, file: !426, line: 294, size: 32, align: 32, elements: !434)
!434 = !{!435, !436, !437, !438, !439}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !433, file: !426, line: 303, baseType: !364, size: 2, align: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !433, file: !426, line: 331, baseType: !364, size: 3, align: 32, offset: 2)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !433, file: !426, line: 336, baseType: !364, size: 1, align: 32, offset: 5)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !433, file: !426, line: 340, baseType: !364, size: 1, align: 32, offset: 6)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !433, file: !426, line: 345, baseType: !364, size: 1, align: 32, offset: 7)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !427, file: !426, line: 350, baseType: !441, size: 64, align: 64, offset: 320)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !111, line: 90, baseType: !59)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !426, line: 363, baseType: !445)
!445 = !DICompositeType(tag: DW_TAG_structure_type, file: !426, line: 356, size: 576, align: 64, elements: !446)
!446 = !{!447, !448, !449, !450}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !445, file: !426, line: 357, baseType: !425, size: 384, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !445, file: !426, line: 358, baseType: !26, size: 64, align: 64, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !445, file: !426, line: 360, baseType: !67, size: 64, align: 64, offset: 448)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !445, file: !426, line: 361, baseType: !26, size: 64, align: 64, offset: 512)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_hook_t", file: !453, line: 2737, baseType: !454)
!453 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_testcapimodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!454 = !DICompositeType(tag: DW_TAG_structure_type, file: !453, line: 2730, size: 512, align: 64, elements: !455)
!455 = !{!456, !473, !474, !475, !476}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !454, file: !453, line: 2731, baseType: !457, size: 256, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemAllocator", file: !14, line: 140, baseType: !458)
!458 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 128, size: 256, align: 64, elements: !459)
!459 = !{!460, !461, !465, !469}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !458, file: !14, line: 130, baseType: !105, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !458, file: !14, line: 133, baseType: !462, size: 64, align: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!105, !105, !110}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !458, file: !14, line: 136, baseType: !466, size: 64, align: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!105, !105, !105, !110}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !458, file: !14, line: 139, baseType: !470, size: 64, align: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !105, !105}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_size", scope: !454, file: !453, line: 2733, baseType: !110, size: 64, align: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_ptr", scope: !454, file: !453, line: 2734, baseType: !105, size: 64, align: 64, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "realloc_new_size", scope: !454, file: !453, line: 2735, baseType: !110, size: 64, align: 64, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "free_ptr", scope: !454, file: !453, line: 2736, baseType: !105, size: 64, align: 64, offset: 448)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "test_structmembers", file: !453, line: 3170, baseType: !479)
!479 = !DICompositeType(tag: DW_TAG_structure_type, file: !453, line: 3167, size: 768, align: 64, elements: !480)
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !479, file: !453, line: 3168, baseType: !21, size: 128, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "structmembers", scope: !479, file: !453, line: 3169, baseType: !483, size: 640, align: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "all_structmembers", file: !453, line: 3165, baseType: !484)
!484 = !DICompositeType(tag: DW_TAG_structure_type, file: !453, line: 3147, size: 640, align: 64, elements: !485)
!485 = !{!486, !487, !488, !490, !492, !493, !494, !495, !496, !497, !498, !500, !502, !506, !507}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "bool_member", scope: !484, file: !453, line: 3148, baseType: !46, size: 8, align: 8)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "byte_member", scope: !484, file: !453, line: 3149, baseType: !46, size: 8, align: 8, offset: 8)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ubyte_member", scope: !484, file: !453, line: 3150, baseType: !489, size: 8, align: 8, offset: 16)
!489 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "short_member", scope: !484, file: !453, line: 3151, baseType: !491, size: 16, align: 16, offset: 32)
!491 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ushort_member", scope: !484, file: !453, line: 3152, baseType: !92, size: 16, align: 16, offset: 48)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "int_member", scope: !484, file: !453, line: 3153, baseType: !59, size: 32, align: 32, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "uint_member", scope: !484, file: !453, line: 3154, baseType: !364, size: 32, align: 32, offset: 96)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "long_member", scope: !484, file: !453, line: 3155, baseType: !32, size: 64, align: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ulong_member", scope: !484, file: !453, line: 3156, baseType: !112, size: 64, align: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pyssizet_member", scope: !484, file: !453, line: 3157, baseType: !26, size: 64, align: 64, offset: 256)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "float_member", scope: !484, file: !453, line: 3158, baseType: !499, size: 32, align: 32, offset: 320)
!499 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "double_member", scope: !484, file: !453, line: 3159, baseType: !501, size: 64, align: 64, offset: 384)
!501 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "inplace_member", scope: !484, file: !453, line: 3160, baseType: !503, size: 48, align: 8, offset: 448)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 48, align: 8, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 6)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "longlong_member", scope: !484, file: !453, line: 3162, baseType: !423, size: 64, align: 64, offset: 512)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ulonglong_member", scope: !484, file: !453, line: 3163, baseType: !422, size: 64, align: 64, offset: 576)
!508 = !{!509, !578, !583, !597, !615, !618, !621, !624, !628, !655, !659, !689, !713, !716, !780, !783, !789, !801, !804, !814, !822, !827, !831, !871, !875, !880, !901, !911, !924, !957, !973, !1000, !1003, !1008, !1015, !1068, !1071, !1078, !1087, !1095, !1100, !1105, !1110, !1115, !1120, !1125, !1130, !1135, !1140, !1145, !1150, !1155, !1159, !1216, !1219, !1259, !1269, !1274, !1279, !1285, !1291, !1296, !1302, !1308, !1313, !1319, !1325, !1333, !1339, !1345, !1351, !1358, !1364, !1370, !1378, !1387, !1400, !1433, !1442, !1450, !1465, !1471, !1478, !1488, !1491, !1503, !1577, !1585, !1592, !1603, !1629, !1638, !1642, !1649, !1658, !1662, !1667, !1675, !1684, !1687, !1695, !1703, !1709, !1726, !1730, !1733, !1747, !1752, !1758, !1763, !1766, !1769, !1792, !1809, !1812}
!509 = !DISubprogram(name: "pending_threadfunc", scope: !453, file: !453, line: 1932, type: !142, isLocal: false, isDefinition: true, scopeLine: 1933, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @pending_threadfunc, variables: !510)
!510 = !{!511, !512, !513, !514, !515, !574}
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !509, file: !453, line: 1932, type: !20)
!512 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !509, file: !453, line: 1932, type: !20)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "callable", scope: !509, file: !453, line: 1934, type: !20)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !509, file: !453, line: 1935, type: !59)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !516, file: !453, line: 1942, type: !517)
!516 = distinct !DILexicalBlock(scope: !509, file: !453, line: 1942, column: 5)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !4, line: 139, baseType: !519)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !4, line: 69, size: 1536, align: 64, elements: !520)
!520 = !{!521, !523, !524, !544, !547, !548, !549, !550, !551, !552, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !519, file: !4, line: 72, baseType: !522, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !519, file: !4, line: 73, baseType: !522, size: 64, align: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !519, file: !4, line: 74, baseType: !525, size: 64, align: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !4, line: 44, baseType: !527)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !4, line: 19, size: 832, align: 64, elements: !528)
!528 = !{!529, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !527, file: !4, line: 21, baseType: !530, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !527, file: !4, line: 22, baseType: !522, size: 64, align: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !527, file: !4, line: 24, baseType: !20, size: 64, align: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !527, file: !4, line: 25, baseType: !20, size: 64, align: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !527, file: !4, line: 26, baseType: !20, size: 64, align: 64, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !527, file: !4, line: 27, baseType: !20, size: 64, align: 64, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !527, file: !4, line: 28, baseType: !20, size: 64, align: 64, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !527, file: !4, line: 30, baseType: !20, size: 64, align: 64, offset: 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !527, file: !4, line: 31, baseType: !20, size: 64, align: 64, offset: 512)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !527, file: !4, line: 32, baseType: !20, size: 64, align: 64, offset: 576)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !527, file: !4, line: 33, baseType: !59, size: 32, align: 32, offset: 640)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !527, file: !4, line: 34, baseType: !59, size: 32, align: 32, offset: 672)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !527, file: !4, line: 37, baseType: !59, size: 32, align: 32, offset: 704)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !527, file: !4, line: 43, baseType: !20, size: 64, align: 64, offset: 768)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !519, file: !4, line: 76, baseType: !545, size: 64, align: 64, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64, align: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !4, line: 50, flags: DIFlagFwdDecl)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !519, file: !4, line: 77, baseType: !59, size: 32, align: 32, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !519, file: !4, line: 78, baseType: !46, size: 8, align: 8, offset: 288)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !519, file: !4, line: 80, baseType: !46, size: 8, align: 8, offset: 296)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !519, file: !4, line: 85, baseType: !59, size: 32, align: 32, offset: 320)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !519, file: !4, line: 86, baseType: !59, size: 32, align: 32, offset: 352)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !519, file: !4, line: 88, baseType: !553, size: 64, align: 64, offset: 384)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !4, line: 54, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64, align: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!59, !20, !545, !59, !20}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !519, file: !4, line: 89, baseType: !553, size: 64, align: 64, offset: 448)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !519, file: !4, line: 90, baseType: !20, size: 64, align: 64, offset: 512)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !519, file: !4, line: 91, baseType: !20, size: 64, align: 64, offset: 576)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !519, file: !4, line: 93, baseType: !20, size: 64, align: 64, offset: 640)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !519, file: !4, line: 94, baseType: !20, size: 64, align: 64, offset: 704)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !519, file: !4, line: 95, baseType: !20, size: 64, align: 64, offset: 768)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !519, file: !4, line: 97, baseType: !20, size: 64, align: 64, offset: 832)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !519, file: !4, line: 98, baseType: !20, size: 64, align: 64, offset: 896)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !519, file: !4, line: 99, baseType: !20, size: 64, align: 64, offset: 960)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !519, file: !4, line: 101, baseType: !20, size: 64, align: 64, offset: 1024)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !519, file: !4, line: 103, baseType: !59, size: 32, align: 32, offset: 1088)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !519, file: !4, line: 105, baseType: !20, size: 64, align: 64, offset: 1152)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !519, file: !4, line: 106, baseType: !32, size: 64, align: 64, offset: 1216)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !519, file: !4, line: 108, baseType: !59, size: 32, align: 32, offset: 1280)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !519, file: !4, line: 109, baseType: !20, size: 64, align: 64, offset: 1344)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !519, file: !4, line: 134, baseType: !353, size: 64, align: 64, offset: 1408)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !519, file: !4, line: 135, baseType: !105, size: 64, align: 64, offset: 1472)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !575, file: !453, line: 1947, type: !20)
!575 = distinct !DILexicalBlock(scope: !576, file: !453, line: 1947, column: 12)
!576 = distinct !DILexicalBlock(scope: !577, file: !453, line: 1946, column: 14)
!577 = distinct !DILexicalBlock(scope: !509, file: !453, line: 1946, column: 9)
!578 = !DISubprogram(name: "PyInit__testcapi", scope: !453, file: !453, line: 3315, type: !579, isLocal: false, isDefinition: true, scopeLine: 3316, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__testcapi, variables: !581)
!579 = !DISubroutineType(types: !580)
!580 = !{!20}
!581 = !{!582}
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !578, file: !453, line: 3317, type: !20)
!583 = !DISubprogram(name: "_pending_callback", scope: !453, file: !453, line: 1919, type: !584, isLocal: true, isDefinition: true, scopeLine: 1920, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @_pending_callback, variables: !586)
!584 = !DISubroutineType(types: !585)
!585 = !{!59, !105}
!586 = !{!587, !588, !589, !590, !592, !594}
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 1, scope: !583, file: !453, line: 1919, type: !105)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "callable", scope: !583, file: !453, line: 1922, type: !20)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !583, file: !453, line: 1923, type: !20)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !591, file: !453, line: 1924, type: !20)
!591 = distinct !DILexicalBlock(scope: !583, file: !453, line: 1924, column: 8)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !593, file: !453, line: 1925, type: !20)
!593 = distinct !DILexicalBlock(scope: !583, file: !453, line: 1925, column: 8)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !595, file: !453, line: 1925, type: !20)
!595 = distinct !DILexicalBlock(scope: !596, file: !453, line: 1925, column: 93)
!596 = distinct !DILexicalBlock(scope: !593, file: !453, line: 1925, column: 59)
!597 = !DISubprogram(name: "raise_exception", scope: !453, file: !453, line: 1759, type: !142, isLocal: true, isDefinition: true, scopeLine: 1760, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @raise_exception, variables: !598)
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606, !613}
!599 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !597, file: !453, line: 1759, type: !20)
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !597, file: !453, line: 1759, type: !20)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc", scope: !597, file: !453, line: 1761, type: !20)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc_args", scope: !597, file: !453, line: 1762, type: !20)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !597, file: !453, line: 1762, type: !20)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_args", scope: !597, file: !453, line: 1763, type: !59)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !597, file: !453, line: 1763, type: !59)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !607, file: !453, line: 1775, type: !20)
!607 = distinct !DILexicalBlock(scope: !608, file: !453, line: 1775, column: 16)
!608 = distinct !DILexicalBlock(scope: !609, file: !453, line: 1774, column: 30)
!609 = distinct !DILexicalBlock(scope: !610, file: !453, line: 1774, column: 13)
!610 = distinct !DILexicalBlock(scope: !611, file: !453, line: 1772, column: 36)
!611 = distinct !DILexicalBlock(scope: !612, file: !453, line: 1772, column: 5)
!612 = distinct !DILexicalBlock(scope: !597, file: !453, line: 1772, column: 5)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !614, file: !453, line: 1781, type: !20)
!614 = distinct !DILexicalBlock(scope: !597, file: !453, line: 1781, column: 8)
!615 = !DISubprogram(name: "raise_memoryerror", scope: !453, file: !453, line: 2390, type: !132, isLocal: true, isDefinition: true, scopeLine: 2391, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @raise_memoryerror, variables: !616)
!616 = !{!617}
!617 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !615, file: !453, line: 2390, type: !20)
!618 = !DISubprogram(name: "test_config", scope: !453, file: !453, line: 46, type: !132, isLocal: true, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @test_config, variables: !619)
!619 = !{!620}
!620 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !618, file: !453, line: 46, type: !20)
!621 = !DISubprogram(name: "test_sizeof_c_types", scope: !453, file: !453, line: 68, type: !132, isLocal: true, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @test_sizeof_c_types, variables: !622)
!622 = !{!623}
!623 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !621, file: !453, line: 68, type: !20)
!624 = !DISubprogram(name: "test_datetime_capi", scope: !453, file: !453, line: 1812, type: !142, isLocal: true, isDefinition: true, scopeLine: 1812, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @test_datetime_capi, variables: !625)
!625 = !{!626, !627}
!626 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !624, file: !453, line: 1812, type: !20)
!627 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !624, file: !453, line: 1812, type: !20)
!628 = !DISubprogram(name: "test_list_api", scope: !453, file: !453, line: 131, type: !132, isLocal: true, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @test_list_api, variables: !629)
!629 = !{!630, !631, !632, !633, !637, !641, !645, !649, !653}
!630 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !628, file: !453, line: 131, type: !20)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !628, file: !453, line: 133, type: !20)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !628, file: !453, line: 134, type: !59)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "anint", scope: !634, file: !453, line: 143, type: !20)
!634 = distinct !DILexicalBlock(scope: !635, file: !453, line: 142, column: 30)
!635 = distinct !DILexicalBlock(scope: !636, file: !453, line: 142, column: 5)
!636 = distinct !DILexicalBlock(scope: !628, file: !453, line: 142, column: 5)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !638, file: !453, line: 145, type: !20)
!638 = distinct !DILexicalBlock(scope: !639, file: !453, line: 145, column: 16)
!639 = distinct !DILexicalBlock(scope: !640, file: !453, line: 144, column: 45)
!640 = distinct !DILexicalBlock(scope: !634, file: !453, line: 144, column: 13)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !642, file: !453, line: 153, type: !20)
!642 = distinct !DILexicalBlock(scope: !643, file: !453, line: 153, column: 12)
!643 = distinct !DILexicalBlock(scope: !644, file: !453, line: 152, column: 17)
!644 = distinct !DILexicalBlock(scope: !628, file: !453, line: 152, column: 9)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "anint", scope: !646, file: !453, line: 158, type: !20)
!646 = distinct !DILexicalBlock(scope: !647, file: !453, line: 157, column: 30)
!647 = distinct !DILexicalBlock(scope: !648, file: !453, line: 157, column: 5)
!648 = distinct !DILexicalBlock(scope: !628, file: !453, line: 157, column: 5)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !650, file: !453, line: 162, type: !20)
!650 = distinct !DILexicalBlock(scope: !651, file: !453, line: 162, column: 16)
!651 = distinct !DILexicalBlock(scope: !652, file: !453, line: 159, column: 46)
!652 = distinct !DILexicalBlock(scope: !646, file: !453, line: 159, column: 13)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !654, file: !453, line: 166, type: !20)
!654 = distinct !DILexicalBlock(scope: !628, file: !453, line: 166, column: 8)
!655 = !DISubprogram(name: "test_dict_iteration", scope: !453, file: !453, line: 224, type: !132, isLocal: true, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @test_dict_iteration, variables: !656)
!656 = !{!657, !658}
!657 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !655, file: !453, line: 224, type: !20)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !655, file: !453, line: 226, type: !59)
!659 = !DISubprogram(name: "test_dict_inner", scope: !453, file: !453, line: 174, type: !660, isLocal: true, isDefinition: true, scopeLine: 175, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @test_dict_inner, variables: !662)
!660 = !DISubroutineType(types: !661)
!661 = !{!59, !59}
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !677, !679, !681, !685, !687}
!663 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "count", arg: 1, scope: !659, file: !453, line: 174, type: !59)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !659, file: !453, line: 176, type: !26)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iterations", scope: !659, file: !453, line: 176, type: !26)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !659, file: !453, line: 177, type: !59)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !659, file: !453, line: 178, type: !20)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !659, file: !453, line: 179, type: !20)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !659, file: !453, line: 179, type: !20)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !671, file: !453, line: 190, type: !20)
!671 = distinct !DILexicalBlock(scope: !672, file: !453, line: 190, column: 16)
!672 = distinct !DILexicalBlock(scope: !673, file: !453, line: 189, column: 45)
!673 = distinct !DILexicalBlock(scope: !674, file: !453, line: 189, column: 13)
!674 = distinct !DILexicalBlock(scope: !675, file: !453, line: 184, column: 33)
!675 = distinct !DILexicalBlock(scope: !676, file: !453, line: 184, column: 5)
!676 = distinct !DILexicalBlock(scope: !659, file: !453, line: 184, column: 5)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !678, file: !453, line: 193, type: !20)
!678 = distinct !DILexicalBlock(scope: !674, file: !453, line: 193, column: 12)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !680, file: !453, line: 197, type: !20)
!680 = distinct !DILexicalBlock(scope: !659, file: !453, line: 196, column: 45)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !682, file: !453, line: 205, type: !20)
!682 = distinct !DILexicalBlock(scope: !683, file: !453, line: 205, column: 16)
!683 = distinct !DILexicalBlock(scope: !684, file: !453, line: 204, column: 45)
!684 = distinct !DILexicalBlock(scope: !680, file: !453, line: 204, column: 13)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !686, file: !453, line: 208, type: !20)
!686 = distinct !DILexicalBlock(scope: !680, file: !453, line: 208, column: 12)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !688, file: !453, line: 211, type: !20)
!688 = distinct !DILexicalBlock(scope: !659, file: !453, line: 211, column: 8)
!689 = !DISubprogram(name: "test_lazy_hash_inheritance", scope: !453, file: !453, line: 284, type: !132, isLocal: true, isDefinition: true, scopeLine: 285, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @test_lazy_hash_inheritance, variables: !690)
!690 = !{!691, !692, !693, !694, !695, !699, !703, !707, !711}
!691 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !689, file: !453, line: 284, type: !20)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !689, file: !453, line: 286, type: !380)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !689, file: !453, line: 287, type: !20)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hash", scope: !689, file: !453, line: 288, type: !234)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !696, file: !453, line: 311, type: !20)
!696 = distinct !DILexicalBlock(scope: !697, file: !453, line: 311, column: 12)
!697 = distinct !DILexicalBlock(scope: !698, file: !453, line: 307, column: 38)
!698 = distinct !DILexicalBlock(scope: !689, file: !453, line: 307, column: 9)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !700, file: !453, line: 321, type: !20)
!700 = distinct !DILexicalBlock(scope: !701, file: !453, line: 321, column: 12)
!701 = distinct !DILexicalBlock(scope: !702, file: !453, line: 316, column: 43)
!702 = distinct !DILexicalBlock(scope: !689, file: !453, line: 316, column: 9)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !704, file: !453, line: 329, type: !20)
!704 = distinct !DILexicalBlock(scope: !705, file: !453, line: 329, column: 12)
!705 = distinct !DILexicalBlock(scope: !706, file: !453, line: 325, column: 38)
!706 = distinct !DILexicalBlock(scope: !689, file: !453, line: 325, column: 9)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !708, file: !453, line: 337, type: !20)
!708 = distinct !DILexicalBlock(scope: !709, file: !453, line: 337, column: 12)
!709 = distinct !DILexicalBlock(scope: !710, file: !453, line: 333, column: 47)
!710 = distinct !DILexicalBlock(scope: !689, file: !453, line: 333, column: 9)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !712, file: !453, line: 341, type: !20)
!712 = distinct !DILexicalBlock(scope: !689, file: !453, line: 341, column: 8)
!713 = !DISubprogram(name: "test_long_api", scope: !453, file: !453, line: 380, type: !132, isLocal: true, isDefinition: true, scopeLine: 381, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @test_long_api, variables: !714)
!714 = !{!715}
!715 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !713, file: !453, line: 380, type: !20)
!716 = !DISubprogram(name: "test_long_api_inner", scope: !717, file: !717, line: 11, type: !718, isLocal: true, isDefinition: true, scopeLine: 12, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object* (i8*)*)* @test_long_api_inner, variables: !723)
!717 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/testcapi_long.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!718 = !DISubroutineType(types: !719)
!719 = !{!20, !720}
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64, align: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!20, !44}
!723 = !{!724, !725, !727, !728, !729, !730, !734, !738, !739, !740, !741, !743, !745, !747, !748, !749, !750, !751, !753, !755, !757, !759, !761, !763, !765, !768, !770, !773, !775, !777, !778}
!724 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "error", arg: 1, scope: !716, file: !717, line: 11, type: !720)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "NBITS", scope: !716, file: !717, line: 13, type: !726)
!726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !716, file: !717, line: 14, type: !112)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pyresult", scope: !716, file: !717, line: 15, type: !20)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !716, file: !717, line: 16, type: !59)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !731, file: !717, line: 30, type: !59)
!731 = distinct !DILexicalBlock(scope: !732, file: !717, line: 29, column: 5)
!732 = distinct !DILexicalBlock(scope: !733, file: !717, line: 26, column: 5)
!733 = distinct !DILexicalBlock(scope: !716, file: !717, line: 26, column: 5)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !735, file: !717, line: 32, type: !32)
!735 = distinct !DILexicalBlock(scope: !736, file: !717, line: 31, column: 33)
!736 = distinct !DILexicalBlock(scope: !737, file: !717, line: 31, column: 9)
!737 = distinct !DILexicalBlock(scope: !731, file: !717, line: 31, column: 9)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !735, file: !717, line: 32, type: !32)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uin", scope: !735, file: !717, line: 33, type: !112)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uout", scope: !735, file: !717, line: 33, type: !112)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !742, file: !717, line: 56, type: !20)
!742 = distinct !DILexicalBlock(scope: !735, file: !717, line: 56, column: 16)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !744, file: !717, line: 71, type: !20)
!744 = distinct !DILexicalBlock(scope: !735, file: !717, line: 71, column: 16)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "one", scope: !746, file: !717, line: 80, type: !20)
!746 = distinct !DILexicalBlock(scope: !716, file: !717, line: 79, column: 5)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !746, file: !717, line: 80, type: !20)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !746, file: !717, line: 80, type: !20)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !746, file: !717, line: 81, type: !32)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uout", scope: !746, file: !717, line: 82, type: !112)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !752, file: !717, line: 104, type: !20)
!752 = distinct !DILexicalBlock(scope: !746, file: !717, line: 104, column: 12)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !754, file: !717, line: 113, type: !20)
!754 = distinct !DILexicalBlock(scope: !746, file: !717, line: 113, column: 12)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !756, file: !717, line: 132, type: !20)
!756 = distinct !DILexicalBlock(scope: !746, file: !717, line: 132, column: 12)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !758, file: !717, line: 151, type: !20)
!758 = distinct !DILexicalBlock(scope: !746, file: !717, line: 151, column: 12)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !760, file: !717, line: 157, type: !20)
!760 = distinct !DILexicalBlock(scope: !746, file: !717, line: 157, column: 12)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !762, file: !717, line: 172, type: !20)
!762 = distinct !DILexicalBlock(scope: !746, file: !717, line: 172, column: 12)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !764, file: !717, line: 174, type: !20)
!764 = distinct !DILexicalBlock(scope: !746, file: !717, line: 174, column: 12)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !766, file: !717, line: 174, type: !20)
!766 = distinct !DILexicalBlock(scope: !767, file: !717, line: 174, column: 97)
!767 = distinct !DILexicalBlock(scope: !764, file: !717, line: 174, column: 63)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !769, file: !717, line: 175, type: !20)
!769 = distinct !DILexicalBlock(scope: !746, file: !717, line: 175, column: 12)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !771, file: !717, line: 175, type: !20)
!771 = distinct !DILexicalBlock(scope: !772, file: !717, line: 175, column: 97)
!772 = distinct !DILexicalBlock(scope: !769, file: !717, line: 175, column: 63)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !774, file: !717, line: 176, type: !20)
!774 = distinct !DILexicalBlock(scope: !746, file: !717, line: 176, column: 12)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !776, file: !717, line: 181, type: !32)
!776 = distinct !DILexicalBlock(scope: !716, file: !717, line: 180, column: 5)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uout", scope: !776, file: !717, line: 182, type: !112)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !779, file: !717, line: 202, type: !20)
!779 = distinct !DILexicalBlock(scope: !776, file: !717, line: 202, column: 12)
!780 = !DISubprogram(name: "raise_test_long_error", scope: !453, file: !453, line: 365, type: !721, isLocal: true, isDefinition: true, scopeLine: 366, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @raise_test_long_error, variables: !781)
!781 = !{!782}
!782 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msg", arg: 1, scope: !780, file: !453, line: 365, type: !44)
!783 = !DISubprogram(name: "raiseTestError", scope: !453, file: !453, line: 23, type: !784, isLocal: true, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i8*)* @raiseTestError, variables: !786)
!784 = !DISubroutineType(types: !785)
!785 = !{!20, !44, !44}
!786 = !{!787, !788}
!787 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "test_name", arg: 1, scope: !783, file: !453, line: 23, type: !44)
!788 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msg", arg: 2, scope: !783, file: !453, line: 23, type: !44)
!789 = !DISubprogram(name: "test_xincref_doesnt_leak", scope: !453, file: !453, line: 2663, type: !132, isLocal: true, isDefinition: true, scopeLine: 2664, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @test_xincref_doesnt_leak, variables: !790)
!790 = !{!791, !792, !793, !795, !797, !799}
!791 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ob", arg: 1, scope: !789, file: !453, line: 2663, type: !20)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !789, file: !453, line: 2665, type: !20)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !794, file: !453, line: 2666, type: !20)
!794 = distinct !DILexicalBlock(scope: !789, file: !453, line: 2666, column: 8)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !796, file: !453, line: 2667, type: !20)
!796 = distinct !DILexicalBlock(scope: !789, file: !453, line: 2667, column: 8)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !798, file: !453, line: 2668, type: !20)
!798 = distinct !DILexicalBlock(scope: !789, file: !453, line: 2668, column: 8)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !800, file: !453, line: 2669, type: !20)
!800 = distinct !DILexicalBlock(scope: !789, file: !453, line: 2669, column: 8)
!801 = !DISubprogram(name: "_test_incref", scope: !453, file: !453, line: 2656, type: !132, isLocal: true, isDefinition: true, scopeLine: 2657, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @_test_incref, variables: !802)
!802 = !{!803}
!803 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ob", arg: 1, scope: !801, file: !453, line: 2656, type: !20)
!804 = !DISubprogram(name: "test_incref_doesnt_leak", scope: !453, file: !453, line: 2674, type: !132, isLocal: true, isDefinition: true, scopeLine: 2675, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @test_incref_doesnt_leak, variables: !805)
!805 = !{!806, !807, !808, !810, !812}
!806 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ob", arg: 1, scope: !804, file: !453, line: 2674, type: !20)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !804, file: !453, line: 2676, type: !20)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !809, file: !453, line: 2678, type: !20)
!809 = distinct !DILexicalBlock(scope: !804, file: !453, line: 2678, column: 8)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !811, file: !453, line: 2679, type: !20)
!811 = distinct !DILexicalBlock(scope: !804, file: !453, line: 2679, column: 8)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !813, file: !453, line: 2680, type: !20)
!813 = distinct !DILexicalBlock(scope: !804, file: !453, line: 2680, column: 8)
!814 = !DISubprogram(name: "test_xdecref_doesnt_leak", scope: !453, file: !453, line: 2685, type: !132, isLocal: true, isDefinition: true, scopeLine: 2686, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @test_xdecref_doesnt_leak, variables: !815)
!815 = !{!816, !817, !819}
!816 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ob", arg: 1, scope: !814, file: !453, line: 2685, type: !20)
!817 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !818, file: !453, line: 2687, type: !20)
!818 = distinct !DILexicalBlock(scope: !814, file: !453, line: 2687, column: 8)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !820, file: !453, line: 2687, type: !20)
!820 = distinct !DILexicalBlock(scope: !821, file: !453, line: 2687, column: 110)
!821 = distinct !DILexicalBlock(scope: !818, file: !453, line: 2687, column: 76)
!822 = !DISubprogram(name: "test_decref_doesnt_leak", scope: !453, file: !453, line: 2692, type: !132, isLocal: true, isDefinition: true, scopeLine: 2693, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @test_decref_doesnt_leak, variables: !823)
!823 = !{!824, !825}
!824 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ob", arg: 1, scope: !822, file: !453, line: 2692, type: !20)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !826, file: !453, line: 2694, type: !20)
!826 = distinct !DILexicalBlock(scope: !822, file: !453, line: 2694, column: 8)
!827 = !DISubprogram(name: "test_incref_decref_API", scope: !453, file: !453, line: 2699, type: !132, isLocal: true, isDefinition: true, scopeLine: 2700, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @test_incref_decref_API, variables: !828)
!828 = !{!829, !830}
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ob", arg: 1, scope: !827, file: !453, line: 2699, type: !20)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !827, file: !453, line: 2701, type: !20)
!831 = !DISubprogram(name: "test_long_and_overflow", scope: !453, file: !453, line: 428, type: !132, isLocal: true, isDefinition: true, scopeLine: 429, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @test_long_and_overflow, variables: !832)
!832 = !{!833, !834, !835, !836, !837, !838, !839, !841, !845, !847, !849, !851, !853, !857, !859, !861, !863, !865, !867, !869}
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !831, file: !453, line: 428, type: !20)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num", scope: !831, file: !453, line: 430, type: !20)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "one", scope: !831, file: !453, line: 430, type: !20)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !831, file: !453, line: 430, type: !20)
!837 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !831, file: !453, line: 431, type: !32)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overflow", scope: !831, file: !453, line: 432, type: !59)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !840, file: !453, line: 441, type: !20)
!840 = distinct !DILexicalBlock(scope: !831, file: !453, line: 441, column: 8)
!841 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !842, file: !453, line: 457, type: !20)
!842 = distinct !DILexicalBlock(scope: !843, file: !453, line: 457, column: 12)
!843 = distinct !DILexicalBlock(scope: !844, file: !453, line: 456, column: 28)
!844 = distinct !DILexicalBlock(scope: !831, file: !453, line: 456, column: 9)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !846, file: !453, line: 461, type: !20)
!846 = distinct !DILexicalBlock(scope: !831, file: !453, line: 461, column: 8)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !848, file: !453, line: 462, type: !20)
!848 = distinct !DILexicalBlock(scope: !831, file: !453, line: 462, column: 8)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !850, file: !453, line: 468, type: !20)
!850 = distinct !DILexicalBlock(scope: !831, file: !453, line: 468, column: 8)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !852, file: !453, line: 485, type: !20)
!852 = distinct !DILexicalBlock(scope: !831, file: !453, line: 485, column: 8)
!853 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !854, file: !453, line: 501, type: !20)
!854 = distinct !DILexicalBlock(scope: !855, file: !453, line: 501, column: 12)
!855 = distinct !DILexicalBlock(scope: !856, file: !453, line: 500, column: 28)
!856 = distinct !DILexicalBlock(scope: !831, file: !453, line: 500, column: 9)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !858, file: !453, line: 505, type: !20)
!858 = distinct !DILexicalBlock(scope: !831, file: !453, line: 505, column: 8)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !860, file: !453, line: 506, type: !20)
!860 = distinct !DILexicalBlock(scope: !831, file: !453, line: 506, column: 8)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !862, file: !453, line: 512, type: !20)
!862 = distinct !DILexicalBlock(scope: !831, file: !453, line: 512, column: 8)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !864, file: !453, line: 528, type: !20)
!864 = distinct !DILexicalBlock(scope: !831, file: !453, line: 528, column: 8)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !866, file: !453, line: 543, type: !20)
!866 = distinct !DILexicalBlock(scope: !831, file: !453, line: 543, column: 8)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !868, file: !453, line: 558, type: !20)
!868 = distinct !DILexicalBlock(scope: !831, file: !453, line: 558, column: 8)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !870, file: !453, line: 573, type: !20)
!870 = distinct !DILexicalBlock(scope: !831, file: !453, line: 573, column: 8)
!871 = !DISubprogram(name: "test_long_as_double", scope: !453, file: !453, line: 794, type: !132, isLocal: true, isDefinition: true, scopeLine: 795, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @test_long_as_double, variables: !872)
!872 = !{!873, !874}
!873 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !871, file: !453, line: 794, type: !20)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !871, file: !453, line: 796, type: !501)
!875 = !DISubprogram(name: "test_long_as_size_t", scope: !453, file: !453, line: 758, type: !132, isLocal: true, isDefinition: true, scopeLine: 759, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @test_long_as_size_t, variables: !876)
!876 = !{!877, !878, !879}
!877 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !875, file: !453, line: 758, type: !20)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_u", scope: !875, file: !453, line: 760, type: !110)
!879 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_s", scope: !875, file: !453, line: 761, type: !26)
!880 = !DISubprogram(name: "test_long_numbits", scope: !453, file: !453, line: 1700, type: !132, isLocal: true, isDefinition: true, scopeLine: 1701, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @test_long_numbits, variables: !881)
!881 = !{!882, !883, !892, !893, !897, !898, !899}
!882 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !880, file: !453, line: 1700, type: !20)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "testcases", scope: !880, file: !453, line: 1706, type: !884)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !885, size: 2880, align: 64, elements: !890)
!885 = !DICompositeType(tag: DW_TAG_structure_type, name: "triple", scope: !880, file: !453, line: 1702, size: 192, align: 64, elements: !886)
!886 = !{!887, !888, !889}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !885, file: !453, line: 1703, baseType: !32, size: 64, align: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !885, file: !453, line: 1704, baseType: !110, size: 64, align: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !885, file: !453, line: 1705, baseType: !59, size: 32, align: 32, offset: 128)
!890 = !{!891}
!891 = !DISubrange(count: 15)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !880, file: !453, line: 1721, type: !59)
!893 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbits", scope: !894, file: !453, line: 1724, type: !110)
!894 = distinct !DILexicalBlock(scope: !895, file: !453, line: 1723, column: 178)
!895 = distinct !DILexicalBlock(scope: !896, file: !453, line: 1723, column: 5)
!896 = distinct !DILexicalBlock(scope: !880, file: !453, line: 1723, column: 5)
!897 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !894, file: !453, line: 1725, type: !59)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "plong", scope: !894, file: !453, line: 1726, type: !20)
!899 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !900, file: !453, line: 1734, type: !20)
!900 = distinct !DILexicalBlock(scope: !894, file: !453, line: 1734, column: 12)
!901 = !DISubprogram(name: "test_k_code", scope: !453, file: !453, line: 1020, type: !132, isLocal: true, isDefinition: true, scopeLine: 1021, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @test_k_code, variables: !902)
!902 = !{!903, !904, !905, !906, !907, !909}
!903 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !901, file: !453, line: 1020, type: !20)
!904 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tuple", scope: !901, file: !453, line: 1022, type: !20)
!905 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num", scope: !901, file: !453, line: 1022, type: !20)
!906 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !901, file: !453, line: 1023, type: !112)
!907 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !908, file: !453, line: 1048, type: !20)
