; ModuleID = 'irs-onlybc/_tracemalloc.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !26, subprograms: !454, globals: !957)
!1 = !DIFile(filename: "_tracemalloc.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !15, !21}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !5, file: !4, line: 32, size: 32, align: 32, elements: !11)
!4 = !DIFile(filename: "./Modules/_tracemalloc.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 29, size: 96, align: 32, elements: !6)
!6 = !{!7, !8, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !5, file: !4, line: 36, baseType: !3, size: 32, align: 32)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !5, file: !4, line: 40, baseType: !9, size: 32, align: 32, offset: 32)
!9 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "max_nframe", scope: !5, file: !4, line: 44, baseType: !9, size: 32, align: 32, offset: 64)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "TRACEMALLOC_NOT_INITIALIZED", value: 0)
!13 = !DIEnumerator(name: "TRACEMALLOC_INITIALIZED", value: 1)
!14 = !DIEnumerator(name: "TRACEMALLOC_FINALIZED", value: 2)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 117, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "Include/pymem.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!17 = !{!18, !19, !20}
!18 = !DIEnumerator(name: "PYMEM_DOMAIN_RAW", value: 0)
!19 = !DIEnumerator(name: "PYMEM_DOMAIN_MEM", value: 1)
!20 = !DIEnumerator(name: "PYMEM_DOMAIN_OBJ", value: 2)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 190, size: 32, align: 32, elements: !23)
!22 = !DIFile(filename: "Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!23 = !{!24, !25}
!24 = !DIEnumerator(name: "PyGILState_LOCKED", value: 0)
!25 = !DIEnumerator(name: "PyGILState_UNLOCKED", value: 1)
!26 = !{!27, !9, !28, !365, !379, !74, !385, !393, !394, !401, !370, !418, !435}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !30, line: 109, baseType: !31)
!30 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !30, line: 105, size: 128, align: 64, elements: !32)
!32 = !{!33, !41}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !31, file: !30, line: 107, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !35, line: 177, baseType: !36)
!35 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !37, line: 102, baseType: !38)
!37 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !39, line: 181, baseType: !40)
!39 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!40 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !31, file: !30, line: 108, baseType: !42, size: 64, align: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !30, line: 334, size: 3200, align: 64, elements: !44)
!44 = !{!45, !51, !55, !56, !57, !62, !124, !129, !134, !135, !140, !192, !223, !235, !241, !242, !243, !245, !247, !278, !279, !280, !289, !290, !295, !296, !298, !300, !310, !313, !331, !332, !333, !335, !337, !338, !340, !345, !350, !355, !356, !357, !358, !359, !360, !361, !362, !364}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !43, file: !30, line: 335, baseType: !46, size: 192, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !30, line: 114, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, file: !30, line: 111, size: 192, align: 64, elements: !48)
!48 = !{!49, !50}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !47, file: !30, line: 112, baseType: !29, size: 128, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !47, file: !30, line: 113, baseType: !34, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !43, file: !30, line: 336, baseType: !52, size: 64, align: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !43, file: !30, line: 337, baseType: !34, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !43, file: !30, line: 337, baseType: !34, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !43, file: !30, line: 341, baseType: !58, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !30, line: 308, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !28}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !43, file: !30, line: 342, baseType: !63, size: 64, align: 64, offset: 448)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !30, line: 314, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!9, !28, !67, !9}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !37, line: 48, baseType: !69)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !70, line: 246, size: 1728, align: 64, elements: !71)
!70 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!71 = !{!72, !73, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !93, !94, !95, !96, !98, !100, !102, !106, !109, !111, !112, !113, !114, !115, !119, !120}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !69, file: !70, line: 247, baseType: !9, size: 32, align: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !69, file: !70, line: 252, baseType: !74, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !69, file: !70, line: 253, baseType: !74, size: 64, align: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !69, file: !70, line: 254, baseType: !74, size: 64, align: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !69, file: !70, line: 255, baseType: !74, size: 64, align: 64, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !69, file: !70, line: 256, baseType: !74, size: 64, align: 64, offset: 320)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !69, file: !70, line: 257, baseType: !74, size: 64, align: 64, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !69, file: !70, line: 258, baseType: !74, size: 64, align: 64, offset: 448)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !69, file: !70, line: 259, baseType: !74, size: 64, align: 64, offset: 512)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !69, file: !70, line: 261, baseType: !74, size: 64, align: 64, offset: 576)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !69, file: !70, line: 262, baseType: !74, size: 64, align: 64, offset: 640)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !69, file: !70, line: 263, baseType: !74, size: 64, align: 64, offset: 704)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !69, file: !70, line: 265, baseType: !86, size: 64, align: 64, offset: 768)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !70, line: 161, size: 192, align: 64, elements: !88)
!88 = !{!89, !90, !92}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !87, file: !70, line: 162, baseType: !86, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !87, file: !70, line: 163, baseType: !91, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !87, file: !70, line: 167, baseType: !9, size: 32, align: 32, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !69, file: !70, line: 267, baseType: !91, size: 64, align: 64, offset: 832)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !69, file: !70, line: 269, baseType: !9, size: 32, align: 32, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !69, file: !70, line: 273, baseType: !9, size: 32, align: 32, offset: 928)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !69, file: !70, line: 275, baseType: !97, size: 64, align: 64, offset: 960)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !39, line: 140, baseType: !40)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !69, file: !70, line: 279, baseType: !99, size: 16, align: 16, offset: 1024)
!99 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !69, file: !70, line: 280, baseType: !101, size: 8, align: 8, offset: 1040)
!101 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !69, file: !70, line: 281, baseType: !103, size: 8, align: 8, offset: 1048)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 8, align: 8, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 1)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !69, file: !70, line: 285, baseType: !107, size: 64, align: 64, offset: 1088)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !70, line: 155, baseType: null)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !69, file: !70, line: 294, baseType: !110, size: 64, align: 64, offset: 1152)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !39, line: 141, baseType: !40)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !69, file: !70, line: 303, baseType: !27, size: 64, align: 64, offset: 1216)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !69, file: !70, line: 304, baseType: !27, size: 64, align: 64, offset: 1280)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !69, file: !70, line: 305, baseType: !27, size: 64, align: 64, offset: 1344)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !69, file: !70, line: 306, baseType: !27, size: 64, align: 64, offset: 1408)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !69, file: !70, line: 307, baseType: !116, size: 64, align: 64, offset: 1472)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !117, line: 62, baseType: !118)
!117 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!118 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !69, file: !70, line: 309, baseType: !9, size: 32, align: 32, offset: 1536)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !69, file: !70, line: 311, baseType: !121, size: 160, align: 8, offset: 1568)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 160, align: 8, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 20)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !43, file: !30, line: 343, baseType: !125, size: 64, align: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !30, line: 316, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!28, !28, !74}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !43, file: !30, line: 344, baseType: !130, size: 64, align: 64, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !30, line: 318, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!9, !28, !74, !28}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !43, file: !30, line: 345, baseType: !27, size: 64, align: 64, offset: 640)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !43, file: !30, line: 346, baseType: !136, size: 64, align: 64, offset: 704)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !30, line: 320, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!28, !28}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !43, file: !30, line: 350, baseType: !141, size: 64, align: 64, offset: 768)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !30, line: 278, baseType: !143)
!143 = !DICompositeType(tag: DW_TAG_structure_type, file: !30, line: 236, size: 2176, align: 64, elements: !144)
!144 = !{!145, !150, !151, !152, !153, !154, !159, !161, !162, !163, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !143, file: !30, line: 241, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !30, line: 166, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!28, !28, !28}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !143, file: !30, line: 242, baseType: !146, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !143, file: !30, line: 243, baseType: !146, size: 64, align: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !143, file: !30, line: 244, baseType: !146, size: 64, align: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !143, file: !30, line: 245, baseType: !146, size: 64, align: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !143, file: !30, line: 246, baseType: !155, size: 64, align: 64, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !30, line: 167, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!28, !28, !28, !28}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !143, file: !30, line: 247, baseType: !160, size: 64, align: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !30, line: 165, baseType: !137)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !143, file: !30, line: 248, baseType: !160, size: 64, align: 64, offset: 448)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !143, file: !30, line: 249, baseType: !160, size: 64, align: 64, offset: 512)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !143, file: !30, line: 250, baseType: !164, size: 64, align: 64, offset: 576)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !30, line: 168, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!9, !28}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !143, file: !30, line: 251, baseType: !160, size: 64, align: 64, offset: 640)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !143, file: !30, line: 252, baseType: !146, size: 64, align: 64, offset: 704)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !143, file: !30, line: 253, baseType: !146, size: 64, align: 64, offset: 768)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !143, file: !30, line: 254, baseType: !146, size: 64, align: 64, offset: 832)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !143, file: !30, line: 255, baseType: !146, size: 64, align: 64, offset: 896)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !143, file: !30, line: 256, baseType: !146, size: 64, align: 64, offset: 960)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !143, file: !30, line: 257, baseType: !160, size: 64, align: 64, offset: 1024)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !143, file: !30, line: 258, baseType: !27, size: 64, align: 64, offset: 1088)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !143, file: !30, line: 259, baseType: !160, size: 64, align: 64, offset: 1152)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !143, file: !30, line: 261, baseType: !146, size: 64, align: 64, offset: 1216)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !143, file: !30, line: 262, baseType: !146, size: 64, align: 64, offset: 1280)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !143, file: !30, line: 263, baseType: !146, size: 64, align: 64, offset: 1344)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !143, file: !30, line: 264, baseType: !146, size: 64, align: 64, offset: 1408)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !143, file: !30, line: 265, baseType: !155, size: 64, align: 64, offset: 1472)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !143, file: !30, line: 266, baseType: !146, size: 64, align: 64, offset: 1536)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !143, file: !30, line: 267, baseType: !146, size: 64, align: 64, offset: 1600)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !143, file: !30, line: 268, baseType: !146, size: 64, align: 64, offset: 1664)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !143, file: !30, line: 269, baseType: !146, size: 64, align: 64, offset: 1728)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !143, file: !30, line: 270, baseType: !146, size: 64, align: 64, offset: 1792)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !143, file: !30, line: 272, baseType: !146, size: 64, align: 64, offset: 1856)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !143, file: !30, line: 273, baseType: !146, size: 64, align: 64, offset: 1920)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !143, file: !30, line: 274, baseType: !146, size: 64, align: 64, offset: 1984)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !143, file: !30, line: 275, baseType: !146, size: 64, align: 64, offset: 2048)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !143, file: !30, line: 277, baseType: !160, size: 64, align: 64, offset: 2112)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !43, file: !30, line: 351, baseType: !193, size: 64, align: 64, offset: 832)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !30, line: 292, baseType: !195)
!195 = !DICompositeType(tag: DW_TAG_structure_type, file: !30, line: 280, size: 640, align: 64, elements: !196)
!196 = !{!197, !202, !203, !208, !209, !210, !215, !216, !221, !222}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !195, file: !30, line: 281, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !30, line: 169, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!34, !28}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !195, file: !30, line: 282, baseType: !146, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !195, file: !30, line: 283, baseType: !204, size: 64, align: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !30, line: 170, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!28, !28, !34}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !195, file: !30, line: 284, baseType: !204, size: 64, align: 64, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !195, file: !30, line: 285, baseType: !27, size: 64, align: 64, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !195, file: !30, line: 286, baseType: !211, size: 64, align: 64, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !30, line: 172, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!9, !28, !34, !28}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !195, file: !30, line: 287, baseType: !27, size: 64, align: 64, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !195, file: !30, line: 288, baseType: !217, size: 64, align: 64, offset: 448)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !30, line: 231, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!9, !28, !28}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !195, file: !30, line: 290, baseType: !146, size: 64, align: 64, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !195, file: !30, line: 291, baseType: !204, size: 64, align: 64, offset: 576)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !43, file: !30, line: 352, baseType: !224, size: 64, align: 64, offset: 896)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !30, line: 298, baseType: !226)
!226 = !DICompositeType(tag: DW_TAG_structure_type, file: !30, line: 294, size: 192, align: 64, elements: !227)
!227 = !{!228, !229, !230}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !226, file: !30, line: 295, baseType: !198, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !226, file: !30, line: 296, baseType: !146, size: 64, align: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !226, file: !30, line: 297, baseType: !231, size: 64, align: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !30, line: 174, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!9, !28, !28, !28}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !43, file: !30, line: 356, baseType: !236, size: 64, align: 64, offset: 960)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !30, line: 321, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!240, !28}
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !35, line: 186, baseType: !34)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !43, file: !30, line: 357, baseType: !155, size: 64, align: 64, offset: 1024)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !43, file: !30, line: 358, baseType: !136, size: 64, align: 64, offset: 1088)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !43, file: !30, line: 359, baseType: !244, size: 64, align: 64, offset: 1152)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !30, line: 317, baseType: !147)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !43, file: !30, line: 360, baseType: !246, size: 64, align: 64, offset: 1216)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !30, line: 319, baseType: !232)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !43, file: !30, line: 363, baseType: !248, size: 64, align: 64, offset: 1280)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !30, line: 304, baseType: !250)
!250 = !DICompositeType(tag: DW_TAG_structure_type, file: !30, line: 301, size: 128, align: 64, elements: !251)
!251 = !{!252, !273}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !250, file: !30, line: 302, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !30, line: 193, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!9, !28, !257, !9}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !30, line: 191, baseType: !259)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !30, line: 178, size: 640, align: 64, elements: !260)
!260 = !{!261, !262, !263, !264, !265, !266, !267, !268, !270, !271, !272}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !259, file: !30, line: 179, baseType: !27, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !259, file: !30, line: 180, baseType: !28, size: 64, align: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !259, file: !30, line: 181, baseType: !34, size: 64, align: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !259, file: !30, line: 182, baseType: !34, size: 64, align: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !259, file: !30, line: 184, baseType: !9, size: 32, align: 32, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !259, file: !30, line: 185, baseType: !9, size: 32, align: 32, offset: 288)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !259, file: !30, line: 186, baseType: !74, size: 64, align: 64, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !259, file: !30, line: 187, baseType: !269, size: 64, align: 64, offset: 384)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !259, file: !30, line: 188, baseType: !269, size: 64, align: 64, offset: 448)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !259, file: !30, line: 189, baseType: !269, size: 64, align: 64, offset: 512)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !259, file: !30, line: 190, baseType: !27, size: 64, align: 64, offset: 576)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !250, file: !30, line: 303, baseType: !274, size: 64, align: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !30, line: 194, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !28, !257}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !43, file: !30, line: 366, baseType: !118, size: 64, align: 64, offset: 1344)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !43, file: !30, line: 368, baseType: !52, size: 64, align: 64, offset: 1408)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !43, file: !30, line: 372, baseType: !281, size: 64, align: 64, offset: 1472)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !30, line: 233, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!9, !28, !285, !27}
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !30, line: 232, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!9, !28, !27}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !43, file: !30, line: 375, baseType: !164, size: 64, align: 64, offset: 1536)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !43, file: !30, line: 379, baseType: !291, size: 64, align: 64, offset: 1600)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !30, line: 322, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!28, !28, !28, !9}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !43, file: !30, line: 382, baseType: !34, size: 64, align: 64, offset: 1664)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !43, file: !30, line: 385, baseType: !297, size: 64, align: 64, offset: 1728)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !30, line: 323, baseType: !137)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !43, file: !30, line: 386, baseType: !299, size: 64, align: 64, offset: 1792)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !30, line: 324, baseType: !137)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !43, file: !30, line: 389, baseType: !301, size: 64, align: 64, offset: 1856)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !303, line: 40, size: 256, align: 64, elements: !304)
!303 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!304 = !{!305, !306, !308, !309}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !302, file: !303, line: 41, baseType: !52, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !302, file: !303, line: 42, baseType: !307, size: 64, align: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !303, line: 18, baseType: !147)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !302, file: !303, line: 43, baseType: !9, size: 32, align: 32, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !302, file: !303, line: 45, baseType: !52, size: 64, align: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !43, file: !30, line: 390, baseType: !311, size: 64, align: 64, offset: 1920)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !30, line: 390, flags: DIFlagFwdDecl)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !43, file: !30, line: 391, baseType: !314, size: 64, align: 64, offset: 1984)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !316, line: 11, size: 320, align: 64, elements: !317)
!316 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!317 = !{!318, !319, !324, !329, !330}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !315, file: !316, line: 12, baseType: !74, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !315, file: !316, line: 13, baseType: !320, size: 64, align: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !316, line: 8, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!28, !28, !27}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !315, file: !316, line: 14, baseType: !325, size: 64, align: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !316, line: 9, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!327 = !DISubroutineType(types: !328)
!328 = !{!9, !28, !28, !27}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !315, file: !316, line: 15, baseType: !74, size: 64, align: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !315, file: !316, line: 16, baseType: !27, size: 64, align: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !43, file: !30, line: 392, baseType: !42, size: 64, align: 64, offset: 2048)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !43, file: !30, line: 393, baseType: !28, size: 64, align: 64, offset: 2112)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !43, file: !30, line: 394, baseType: !334, size: 64, align: 64, offset: 2176)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !30, line: 325, baseType: !156)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !43, file: !30, line: 395, baseType: !336, size: 64, align: 64, offset: 2240)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !30, line: 326, baseType: !232)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !43, file: !30, line: 396, baseType: !34, size: 64, align: 64, offset: 2304)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !43, file: !30, line: 397, baseType: !339, size: 64, align: 64, offset: 2368)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !30, line: 327, baseType: !232)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !43, file: !30, line: 398, baseType: !341, size: 64, align: 64, offset: 2432)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !30, line: 329, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!28, !42, !34}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !43, file: !30, line: 399, baseType: !346, size: 64, align: 64, offset: 2496)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !30, line: 328, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!28, !42, !28, !28}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !43, file: !30, line: 400, baseType: !351, size: 64, align: 64, offset: 2560)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !30, line: 307, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !27}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !43, file: !30, line: 401, baseType: !164, size: 64, align: 64, offset: 2624)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !43, file: !30, line: 402, baseType: !28, size: 64, align: 64, offset: 2688)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !43, file: !30, line: 403, baseType: !28, size: 64, align: 64, offset: 2752)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !43, file: !30, line: 404, baseType: !28, size: 64, align: 64, offset: 2816)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !43, file: !30, line: 405, baseType: !28, size: 64, align: 64, offset: 2880)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !43, file: !30, line: 406, baseType: !28, size: 64, align: 64, offset: 2944)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !43, file: !30, line: 407, baseType: !58, size: 64, align: 64, offset: 3008)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !43, file: !30, line: 410, baseType: !363, size: 32, align: 32, offset: 3072)
!363 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !43, file: !30, line: 412, baseType: !58, size: 64, align: 64, offset: 3136)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "traceback_t", file: !4, line: 79, baseType: !367)
!367 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 75, size: 192, align: 64, elements: !368)
!368 = !{!369, !371, !372}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !367, file: !4, line: 76, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_uhash_t", file: !35, line: 189, baseType: !116)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "nframe", scope: !367, file: !4, line: 77, baseType: !9, size: 32, align: 32, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !367, file: !4, line: 78, baseType: !373, size: 96, align: 8, offset: 96)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 96, align: 8, elements: !104)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "frame_t", file: !4, line: 73, baseType: !375)
!375 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 64, size: 96, align: 8, elements: !376)
!376 = !{!377, !378}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !375, file: !4, line: 71, baseType: !28, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !375, file: !4, line: 72, baseType: !9, size: 32, align: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "trace_t", file: !4, line: 97, baseType: !381)
!381 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 91, size: 128, align: 64, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !381, file: !4, line: 93, baseType: !116, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !381, file: !4, line: 96, baseType: !365, size: 64, align: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !387, line: 33, baseType: !388)
!387 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!388 = !DICompositeType(tag: DW_TAG_structure_type, file: !387, line: 25, size: 256, align: 64, elements: !389)
!389 = !{!390, !391}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !388, file: !387, line: 26, baseType: !46, size: 192, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !388, file: !387, line: 27, baseType: !392, size: 64, align: 64, offset: 192)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 64, align: 64, elements: !104)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_hash_func", file: !395, line: 41, baseType: !396)
!395 = !DIFile(filename: "./Modules/hashtable.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!370, !399}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_compare_func", file: !395, line: 42, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{!9, !399, !405}
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_entry_t", file: !395, line: 27, baseType: !408)
!408 = !DICompositeType(tag: DW_TAG_structure_type, file: !395, line: 19, size: 192, align: 64, elements: !409)
!409 = !{!410, !416, !417}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_Py_slist_item", scope: !408, file: !395, line: 21, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_slist_item_t", file: !395, line: 9, baseType: !412)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_slist_item_s", file: !395, line: 7, size: 64, align: 64, elements: !413)
!413 = !{!414}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !412, file: !395, line: 8, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !408, file: !395, line: 23, baseType: !399, size: 64, align: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "key_hash", scope: !408, file: !395, line: 24, baseType: !370, size: 64, align: 64, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemAllocator", file: !16, line: 140, baseType: !420)
!420 = !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 128, size: 256, align: 64, elements: !421)
!421 = !{!422, !423, !427, !431}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !420, file: !16, line: 130, baseType: !27, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !420, file: !16, line: 133, baseType: !424, size: 64, align: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!27, !27, !116}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "realloc", scope: !420, file: !16, line: 136, baseType: !428, size: 64, align: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!27, !27, !27, !116}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !420, file: !16, line: 139, baseType: !432, size: 64, align: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !27, !27}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !437, line: 351, baseType: !438)
!437 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!438 = !DICompositeType(tag: DW_TAG_structure_type, file: !437, line: 217, size: 384, align: 64, elements: !439)
!439 = !{!440, !441, !442, !443, !451}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !438, file: !437, line: 291, baseType: !29, size: 128, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !438, file: !437, line: 292, baseType: !34, size: 64, align: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !438, file: !437, line: 293, baseType: !240, size: 64, align: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !438, file: !437, line: 349, baseType: !444, size: 32, align: 32, offset: 256)
!444 = !DICompositeType(tag: DW_TAG_structure_type, scope: !438, file: !437, line: 294, size: 32, align: 32, elements: !445)
!445 = !{!446, !447, !448, !449, !450}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !444, file: !437, line: 303, baseType: !363, size: 2, align: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !444, file: !437, line: 331, baseType: !363, size: 3, align: 32, offset: 2)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !444, file: !437, line: 336, baseType: !363, size: 1, align: 32, offset: 5)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !444, file: !437, line: 340, baseType: !363, size: 1, align: 32, offset: 6)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !444, file: !437, line: 345, baseType: !363, size: 1, align: 32, offset: 7)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !438, file: !437, line: 350, baseType: !452, size: 64, align: 64, offset: 320)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !117, line: 90, baseType: !9)
!454 = !{!455, !460, !478, !482, !485, !488, !493, !494, !502, !505, !512, !567, !574, !585, !602, !624, !636, !641, !648, !658, !664, !667, !668, !671, !676, !683, !684, !688, !694, !706, !716, !723, !730, !733, !743, !746, !752, !761, !771, !892, !907, !917, !921, !928, !933, !941, !950}
!455 = !DISubprogram(name: "PyInit__tracemalloc", scope: !4, file: !4, line: 1322, type: !456, isLocal: false, isDefinition: true, scopeLine: 1323, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit__tracemalloc, variables: !458)
!456 = !DISubroutineType(types: !457)
!457 = !{!28}
!458 = !{!459}
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !455, file: !4, line: 1324, type: !28)
!460 = !DISubprogram(name: "_PyTraceMalloc_Init", scope: !4, file: !4, line: 1364, type: !461, isLocal: false, isDefinition: true, scopeLine: 1365, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @_PyTraceMalloc_Init, variables: !463)
!461 = !DISubroutineType(types: !462)
!462 = !{!9}
!463 = !{!464, !465, !466, !469, !470, !472, !473, !474, !476}
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !460, file: !4, line: 1366, type: !74)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nframe", scope: !460, file: !4, line: 1367, type: !9)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "endptr", scope: !467, file: !4, line: 1374, type: !74)
!467 = distinct !DILexicalBlock(scope: !468, file: !4, line: 1373, column: 100)
!468 = distinct !DILexicalBlock(scope: !460, file: !4, line: 1373, column: 9)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !467, file: !4, line: 1375, type: !40)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xoptions", scope: !471, file: !4, line: 1391, type: !28)
!471 = distinct !DILexicalBlock(scope: !468, file: !4, line: 1390, column: 10)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !471, file: !4, line: 1391, type: !28)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !471, file: !4, line: 1391, type: !28)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !475, file: !4, line: 1402, type: !28)
!475 = distinct !DILexicalBlock(scope: !471, file: !4, line: 1402, column: 12)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !477, file: !4, line: 1412, type: !28)
!477 = distinct !DILexicalBlock(scope: !471, file: !4, line: 1412, column: 12)
!478 = !DISubprogram(name: "_PyTraceMalloc_Fini", scope: !4, file: !4, line: 1422, type: !479, isLocal: false, isDefinition: true, scopeLine: 1423, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_PyTraceMalloc_Fini, variables: !481)
!479 = !DISubroutineType(types: !480)
!480 = !{null}
!481 = !{}
!482 = !DISubprogram(name: "py_tracemalloc_is_tracing", scope: !4, file: !4, line: 928, type: !138, isLocal: true, isDefinition: true, scopeLine: 929, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @py_tracemalloc_is_tracing, variables: !483)
!483 = !{!484}
!484 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !482, file: !4, line: 928, type: !28)
!485 = !DISubprogram(name: "py_tracemalloc_clear_traces", scope: !4, file: !4, line: 939, type: !138, isLocal: true, isDefinition: true, scopeLine: 940, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @py_tracemalloc_clear_traces, variables: !486)
!486 = !{!487}
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !485, file: !4, line: 939, type: !28)
!488 = !DISubprogram(name: "set_reentrant", scope: !4, file: !4, line: 167, type: !489, isLocal: true, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @set_reentrant, variables: !491)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !9}
!491 = !{!492}
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "reentrant", arg: 1, scope: !488, file: !4, line: 167, type: !9)
!493 = !DISubprogram(name: "tracemalloc_clear_traces", scope: !4, file: !4, line: 704, type: !479, isLocal: true, isDefinition: true, scopeLine: 705, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @tracemalloc_clear_traces, variables: !481)
!494 = !DISubprogram(name: "traceback_free_traceback", scope: !4, file: !4, line: 695, type: !495, isLocal: true, isDefinition: true, scopeLine: 696, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Py_hashtable_entry_t*, i8*)* @traceback_free_traceback, variables: !498)
!495 = !DISubroutineType(types: !496)
!496 = !{!9, !497, !27}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!498 = !{!499, !500, !501}
!499 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "entry", arg: 1, scope: !494, file: !4, line: 695, type: !497)
!500 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "user_data", arg: 2, scope: !494, file: !4, line: 695, type: !27)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "traceback", scope: !494, file: !4, line: 697, type: !365)
!502 = !DISubprogram(name: "raw_free", scope: !4, file: !4, line: 228, type: !353, isLocal: true, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @raw_free, variables: !503)
!503 = !{!504}
!504 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !502, file: !4, line: 228, type: !27)
!505 = !DISubprogram(name: "tracemalloc_clear_filename", scope: !4, file: !4, line: 687, type: !495, isLocal: true, isDefinition: true, scopeLine: 688, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Py_hashtable_entry_t*, i8*)* @tracemalloc_clear_filename, variables: !506)
!506 = !{!507, !508, !509, !510}
!507 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "entry", arg: 1, scope: !505, file: !4, line: 687, type: !497)
!508 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "user_data", arg: 2, scope: !505, file: !4, line: 687, type: !27)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filename", scope: !505, file: !4, line: 689, type: !28)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !511, file: !4, line: 690, type: !28)
!511 = distinct !DILexicalBlock(scope: !505, file: !4, line: 690, column: 8)
!512 = !DISubprogram(name: "py_tracemalloc_get_traces", scope: !4, file: !4, line: 1087, type: !148, isLocal: true, isDefinition: true, scopeLine: 1088, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @py_tracemalloc_get_traces, variables: !513)
!513 = !{!514, !515, !516, !560, !561, !563}
!514 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !512, file: !4, line: 1087, type: !28)
!515 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !512, file: !4, line: 1087, type: !28)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "get_traces", scope: !512, file: !4, line: 1089, type: !517)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "get_traces_t", file: !4, line: 1045, baseType: !518)
!518 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 1041, size: 192, align: 64, elements: !519)
!519 = !{!520, !558, !559}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "traces", scope: !518, file: !4, line: 1042, baseType: !521, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_t", file: !395, line: 67, baseType: !523)
!523 = !DICompositeType(tag: DW_TAG_structure_type, file: !395, line: 55, size: 704, align: 64, elements: !524)
!524 = !{!525, !526, !527, !534, !535, !536, !537, !542, !544, !549}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "num_buckets", scope: !523, file: !395, line: 56, baseType: !116, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !523, file: !395, line: 57, baseType: !116, size: 64, align: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !523, file: !395, line: 58, baseType: !528, size: 64, align: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_slist_t", file: !395, line: 13, baseType: !530)
!530 = !DICompositeType(tag: DW_TAG_structure_type, file: !395, line: 11, size: 64, align: 64, elements: !531)
!531 = !{!532}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !530, file: !395, line: 12, baseType: !533, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !523, file: !395, line: 59, baseType: !116, size: 64, align: 64, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "hash_func", scope: !523, file: !395, line: 61, baseType: !394, size: 64, align: 64, offset: 256)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "compare_func", scope: !523, file: !395, line: 62, baseType: !401, size: 64, align: 64, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "copy_data_func", scope: !523, file: !395, line: 63, baseType: !538, size: 64, align: 64, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_copy_data_func", file: !395, line: 43, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!27, !27}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "free_data_func", scope: !523, file: !395, line: 64, baseType: !543, size: 64, align: 64, offset: 448)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_free_data_func", file: !395, line: 44, baseType: !352)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "get_data_size_func", scope: !523, file: !395, line: 65, baseType: !545, size: 64, align: 64, offset: 512)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_get_data_size_func", file: !395, line: 45, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!116, !27}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !523, file: !395, line: 66, baseType: !550, size: 128, align: 64, offset: 576)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_allocator_t", file: !395, line: 53, baseType: !551)
!551 = !DICompositeType(tag: DW_TAG_structure_type, file: !395, line: 47, size: 128, align: 64, elements: !552)
!552 = !{!553, !557}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !551, file: !395, line: 49, baseType: !554, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64, align: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!27, !116}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !551, file: !395, line: 52, baseType: !352, size: 64, align: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "tracebacks", scope: !518, file: !4, line: 1043, baseType: !521, size: 64, align: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !518, file: !4, line: 1044, baseType: !28, size: 64, align: 64, offset: 128)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !512, file: !4, line: 1090, type: !9)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !562, file: !4, line: 1130, type: !28)
!562 = distinct !DILexicalBlock(scope: !512, file: !4, line: 1130, column: 8)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !564, file: !4, line: 1130, type: !28)
!564 = distinct !DILexicalBlock(scope: !565, file: !4, line: 1130, column: 125)
!565 = distinct !DILexicalBlock(scope: !566, file: !4, line: 1130, column: 88)
!566 = distinct !DILexicalBlock(scope: !562, file: !4, line: 1130, column: 65)
!567 = !DISubprogram(name: "hashtable_new", scope: !4, file: !4, line: 212, type: !568, isLocal: true, isDefinition: true, scopeLine: 215, flags: DIFlagPrototyped, isOptimized: true, function: %struct._Py_hashtable_t* (i64, i64 (i8*)*, i32 (i8*, %struct._Py_hashtable_entry_t*)*)* @hashtable_new, variables: !570)
!568 = !DISubroutineType(types: !569)
!569 = !{!521, !116, !394, !401}
!570 = !{!571, !572, !573}
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data_size", arg: 1, scope: !567, file: !4, line: 212, type: !116)
!572 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hash_func", arg: 2, scope: !567, file: !4, line: 213, type: !394)
!573 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "compare_func", arg: 3, scope: !567, file: !4, line: 214, type: !401)
!574 = !DISubprogram(name: "tracemalloc_get_traces_fill", scope: !4, file: !4, line: 1048, type: !495, isLocal: true, isDefinition: true, scopeLine: 1049, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Py_hashtable_entry_t*, i8*)* @tracemalloc_get_traces_fill, variables: !575)
!575 = !{!576, !577, !578, !580, !581, !582, !583}
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "entry", arg: 1, scope: !574, file: !4, line: 1048, type: !497)
!577 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "user_data", arg: 2, scope: !574, file: !4, line: 1048, type: !27)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "get_traces", scope: !574, file: !4, line: 1050, type: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64, align: 64)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "trace", scope: !574, file: !4, line: 1051, type: !379)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tracemalloc_obj", scope: !574, file: !4, line: 1052, type: !28)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !574, file: !4, line: 1053, type: !9)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !584, file: !4, line: 1062, type: !28)
!584 = distinct !DILexicalBlock(scope: !574, file: !4, line: 1062, column: 8)
!585 = !DISubprogram(name: "trace_to_pyobject", scope: !4, file: !4, line: 1015, type: !586, isLocal: true, isDefinition: true, scopeLine: 1016, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.trace_t*, %struct._Py_hashtable_t*)* @trace_to_pyobject, variables: !588)
!586 = !DISubroutineType(types: !587)
!587 = !{!28, !379, !521}
!588 = !{!589, !590, !591, !592, !593, !594, !598}
!589 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "trace", arg: 1, scope: !585, file: !4, line: 1015, type: !379)
!590 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "intern_tracebacks", arg: 2, scope: !585, file: !4, line: 1015, type: !521)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "trace_obj", scope: !585, file: !4, line: 1017, type: !28)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !585, file: !4, line: 1018, type: !28)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "traceback", scope: !585, file: !4, line: 1018, type: !28)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !595, file: !4, line: 1026, type: !28)
!595 = distinct !DILexicalBlock(scope: !596, file: !4, line: 1026, column: 12)
!596 = distinct !DILexicalBlock(scope: !597, file: !4, line: 1025, column: 29)
!597 = distinct !DILexicalBlock(scope: !585, file: !4, line: 1025, column: 9)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !599, file: !4, line: 1033, type: !28)
!599 = distinct !DILexicalBlock(scope: !600, file: !4, line: 1033, column: 12)
!600 = distinct !DILexicalBlock(scope: !601, file: !4, line: 1032, column: 34)
!601 = distinct !DILexicalBlock(scope: !585, file: !4, line: 1032, column: 9)
!602 = !DISubprogram(name: "traceback_to_pyobject", scope: !4, file: !4, line: 977, type: !603, isLocal: true, isDefinition: true, scopeLine: 978, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.traceback_t*, %struct._Py_hashtable_t*)* @traceback_to_pyobject, variables: !605)
!603 = !DISubroutineType(types: !604)
!604 = !{!28, !365, !521}
!605 = !{!606, !607, !608, !609, !610, !611, !618}
!606 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "traceback", arg: 1, scope: !602, file: !4, line: 977, type: !365)
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "intern_table", arg: 2, scope: !602, file: !4, line: 977, type: !521)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !602, file: !4, line: 979, type: !9)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frames", scope: !602, file: !4, line: 980, type: !28)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frame", scope: !602, file: !4, line: 980, type: !28)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !612, file: !4, line: 996, type: !28)
!612 = distinct !DILexicalBlock(scope: !613, file: !4, line: 996, column: 16)
!613 = distinct !DILexicalBlock(scope: !614, file: !4, line: 995, column: 34)
!614 = distinct !DILexicalBlock(scope: !615, file: !4, line: 995, column: 13)
!615 = distinct !DILexicalBlock(scope: !616, file: !4, line: 993, column: 43)
!616 = distinct !DILexicalBlock(scope: !617, file: !4, line: 993, column: 5)
!617 = distinct !DILexicalBlock(scope: !602, file: !4, line: 993, column: 5)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !619, file: !4, line: 1004, type: !28)
!619 = distinct !DILexicalBlock(scope: !620, file: !4, line: 1004, column: 16)
!620 = distinct !DILexicalBlock(scope: !621, file: !4, line: 1003, column: 88)
!621 = distinct !DILexicalBlock(scope: !622, file: !4, line: 1003, column: 13)
!622 = distinct !DILexicalBlock(scope: !623, file: !4, line: 1002, column: 37)
!623 = distinct !DILexicalBlock(scope: !602, file: !4, line: 1002, column: 9)
!624 = !DISubprogram(name: "frame_to_pyobject", scope: !4, file: !4, line: 952, type: !625, isLocal: true, isDefinition: true, scopeLine: 953, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.frame_t*)* @frame_to_pyobject, variables: !628)
!625 = !DISubroutineType(types: !626)
!626 = !{!28, !627}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!628 = !{!629, !630, !631, !632}
!629 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frame", arg: 1, scope: !624, file: !4, line: 952, type: !627)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frame_obj", scope: !624, file: !4, line: 954, type: !28)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lineno_obj", scope: !624, file: !4, line: 954, type: !28)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !633, file: !4, line: 968, type: !28)
!633 = distinct !DILexicalBlock(scope: !634, file: !4, line: 968, column: 12)
!634 = distinct !DILexicalBlock(scope: !635, file: !4, line: 967, column: 35)
!635 = distinct !DILexicalBlock(scope: !624, file: !4, line: 967, column: 9)
!636 = !DISubprogram(name: "lineno_as_obj", scope: !4, file: !4, line: 913, type: !637, isLocal: true, isDefinition: true, scopeLine: 914, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32)* @lineno_as_obj, variables: !639)
!637 = !DISubroutineType(types: !638)
!638 = !{!28, !9}
!639 = !{!640}
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 1, scope: !636, file: !4, line: 913, type: !9)
!641 = !DISubprogram(name: "tracemalloc_pyobject_decref_cb", scope: !4, file: !4, line: 1070, type: !495, isLocal: true, isDefinition: true, scopeLine: 1071, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._Py_hashtable_entry_t*, i8*)* @tracemalloc_pyobject_decref_cb, variables: !642)
!642 = !{!643, !644, !645, !646}
!643 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "entry", arg: 1, scope: !641, file: !4, line: 1070, type: !497)
!644 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "user_data", arg: 2, scope: !641, file: !4, line: 1070, type: !27)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !641, file: !4, line: 1072, type: !28)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !647, file: !4, line: 1073, type: !28)
!647 = distinct !DILexicalBlock(scope: !641, file: !4, line: 1073, column: 8)
!648 = !DISubprogram(name: "py_tracemalloc_get_object_traceback", scope: !4, file: !4, line: 1154, type: !148, isLocal: true, isDefinition: true, scopeLine: 1155, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @py_tracemalloc_get_object_traceback, variables: !649)
!649 = !{!650, !651, !652, !655, !656, !657}
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !648, file: !4, line: 1154, type: !28)
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !648, file: !4, line: 1154, type: !28)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !648, file: !4, line: 1156, type: !653)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !30, line: 422, baseType: !43)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !648, file: !4, line: 1157, type: !27)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "trace", scope: !648, file: !4, line: 1158, type: !380)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "found", scope: !648, file: !4, line: 1159, type: !9)
!658 = !DISubprogram(name: "py_tracemalloc_start", scope: !4, file: !4, line: 1187, type: !148, isLocal: true, isDefinition: true, scopeLine: 1188, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @py_tracemalloc_start, variables: !659)
!659 = !{!660, !661, !662, !663}
!660 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !658, file: !4, line: 1187, type: !28)
!661 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !658, file: !4, line: 1187, type: !28)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nframe", scope: !658, file: !4, line: 1189, type: !34)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nframe_int", scope: !658, file: !4, line: 1190, type: !9)
!664 = !DISubprogram(name: "py_tracemalloc_stop", scope: !4, file: !4, line: 1216, type: !138, isLocal: true, isDefinition: true, scopeLine: 1217, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @py_tracemalloc_stop, variables: !665)
!665 = !{!666}
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !664, file: !4, line: 1216, type: !28)
!667 = !DISubprogram(name: "tracemalloc_stop", scope: !4, file: !4, line: 887, type: !479, isLocal: true, isDefinition: true, scopeLine: 888, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @tracemalloc_stop, variables: !481)
!668 = !DISubprogram(name: "py_tracemalloc_get_traceback_limit", scope: !4, file: !4, line: 1232, type: !138, isLocal: true, isDefinition: true, scopeLine: 1233, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @py_tracemalloc_get_traceback_limit, variables: !669)
!669 = !{!670}
!670 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !668, file: !4, line: 1232, type: !28)
!671 = !DISubprogram(name: "tracemalloc_get_tracemalloc_memory", scope: !4, file: !4, line: 1244, type: !138, isLocal: true, isDefinition: true, scopeLine: 1245, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @tracemalloc_get_tracemalloc_memory, variables: !672)
!672 = !{!673, !674, !675}
!673 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !671, file: !4, line: 1244, type: !28)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !671, file: !4, line: 1246, type: !116)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size_obj", scope: !671, file: !4, line: 1247, type: !28)
!676 = !DISubprogram(name: "tracemalloc_get_traced_memory", scope: !4, file: !4, line: 1267, type: !138, isLocal: true, isDefinition: true, scopeLine: 1268, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @tracemalloc_get_traced_memory, variables: !677)
!677 = !{!678, !679, !680, !681, !682}
!678 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !676, file: !4, line: 1267, type: !28)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !676, file: !4, line: 1269, type: !34)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "peak_size", scope: !676, file: !4, line: 1269, type: !34)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size_obj", scope: !676, file: !4, line: 1270, type: !28)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "peak_size_obj", scope: !676, file: !4, line: 1270, type: !28)
!683 = !DISubprogram(name: "tracemalloc_init", scope: !4, file: !4, line: 729, type: !461, isLocal: true, isDefinition: true, scopeLine: 730, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @tracemalloc_init, variables: !481)
!684 = !DISubprogram(name: "hashtable_compare_unicode", scope: !4, file: !4, line: 201, type: !403, isLocal: true, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._Py_hashtable_entry_t*)* @hashtable_compare_unicode, variables: !685)
!685 = !{!686, !687}
!686 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !684, file: !4, line: 201, type: !399)
!687 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "entry", arg: 2, scope: !684, file: !4, line: 201, type: !405)
!688 = !DISubprogram(name: "hashtable_hash_traceback", scope: !4, file: !4, line: 234, type: !397, isLocal: true, isDefinition: true, scopeLine: 235, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8*)* @hashtable_hash_traceback, variables: !689)
!689 = !{!690, !691}
!690 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !688, file: !4, line: 234, type: !399)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "traceback", scope: !688, file: !4, line: 236, type: !692)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!694 = !DISubprogram(name: "hashtable_compare_traceback", scope: !4, file: !4, line: 241, type: !695, isLocal: true, isDefinition: true, scopeLine: 243, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.traceback_t*, %struct._Py_hashtable_entry_t*)* @hashtable_compare_traceback, variables: !697)
!695 = !DISubroutineType(types: !696)
!696 = !{!9, !692, !405}
!697 = !{!698, !699, !700, !701, !704, !705}
!698 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "traceback1", arg: 1, scope: !694, file: !4, line: 241, type: !692)
!699 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "he", arg: 2, scope: !694, file: !4, line: 242, type: !405)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "traceback2", scope: !694, file: !4, line: 244, type: !692)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frame1", scope: !694, file: !4, line: 245, type: !702)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !374)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frame2", scope: !694, file: !4, line: 245, type: !702)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !694, file: !4, line: 246, type: !9)
!706 = !DISubprogram(name: "traceback_hash", scope: !4, file: !4, line: 337, type: !707, isLocal: true, isDefinition: true, scopeLine: 338, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.traceback_t*)* @traceback_hash, variables: !709)
!707 = !DISubroutineType(types: !708)
!708 = !{!370, !365}
!709 = !{!710, !711, !712, !713, !714, !715}
!710 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "traceback", arg: 1, scope: !706, file: !4, line: 337, type: !365)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !706, file: !4, line: 340, type: !370)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !706, file: !4, line: 340, type: !370)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !706, file: !4, line: 341, type: !9)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mult", scope: !706, file: !4, line: 342, type: !370)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frame", scope: !706, file: !4, line: 343, type: !627)
!716 = !DISubprogram(name: "parse_sys_xoptions", scope: !4, file: !4, line: 1336, type: !166, isLocal: true, isDefinition: true, scopeLine: 1337, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @parse_sys_xoptions, variables: !717)
!717 = !{!718, !719, !720, !721}
!718 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 1, scope: !716, file: !4, line: 1336, type: !28)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "valuelong", scope: !716, file: !4, line: 1338, type: !28)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nframe", scope: !716, file: !4, line: 1339, type: !40)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !722, file: !4, line: 1353, type: !28)
!722 = distinct !DILexicalBlock(scope: !716, file: !4, line: 1353, column: 8)
!723 = !DISubprogram(name: "tracemalloc_start", scope: !4, file: !4, line: 832, type: !724, isLocal: true, isDefinition: true, scopeLine: 833, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @tracemalloc_start, variables: !726)
!724 = !DISubroutineType(types: !725)
!725 = !{!9, !9}
!726 = !{!727, !728, !729}
!727 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "max_nframe", arg: 1, scope: !723, file: !4, line: 832, type: !9)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alloc", scope: !723, file: !4, line: 834, type: !419)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !723, file: !4, line: 835, type: !116)
!730 = !DISubprogram(name: "raw_malloc", scope: !4, file: !4, line: 222, type: !555, isLocal: true, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i64)* @raw_malloc, variables: !731)
!731 = !{!732}
!732 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !730, file: !4, line: 222, type: !116)
!733 = !DISubprogram(name: "tracemalloc_raw_malloc", scope: !4, file: !4, line: 617, type: !425, isLocal: true, isDefinition: true, scopeLine: 618, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i64)* @tracemalloc_raw_malloc, variables: !734)
!734 = !{!735, !736, !737, !739, !740}
!735 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !733, file: !4, line: 617, type: !27)
!736 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !733, file: !4, line: 617, type: !116)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gil_state", scope: !733, file: !4, line: 620, type: !738)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGILState_STATE", file: !22, line: 191, baseType: !21)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !733, file: !4, line: 622, type: !27)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alloc", scope: !741, file: !4, line: 625, type: !418)
!741 = distinct !DILexicalBlock(scope: !742, file: !4, line: 624, column: 26)
!742 = distinct !DILexicalBlock(scope: !733, file: !4, line: 624, column: 9)
!743 = !DISubprogram(name: "get_reentrant", scope: !4, file: !4, line: 155, type: !461, isLocal: true, isDefinition: true, scopeLine: 156, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @get_reentrant, variables: !744)
!744 = !{!745}
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !743, file: !4, line: 157, type: !27)
!746 = !DISubprogram(name: "tracemalloc_malloc", scope: !4, file: !4, line: 479, type: !425, isLocal: true, isDefinition: true, scopeLine: 480, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i64)* @tracemalloc_malloc, variables: !747)
!747 = !{!748, !749, !750, !751}
!748 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !746, file: !4, line: 479, type: !27)
!749 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !746, file: !4, line: 479, type: !116)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alloc", scope: !746, file: !4, line: 481, type: !418)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !746, file: !4, line: 482, type: !27)
!752 = !DISubprogram(name: "tracemalloc_add_trace", scope: !4, file: !4, line: 439, type: !753, isLocal: true, isDefinition: true, scopeLine: 440, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i64)* @tracemalloc_add_trace, variables: !755)
!753 = !DISubroutineType(types: !754)
!754 = !{!9, !27, !116}
!755 = !{!756, !757, !758, !759, !760}
!756 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !752, file: !4, line: 439, type: !27)
!757 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !752, file: !4, line: 439, type: !116)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "traceback", scope: !752, file: !4, line: 441, type: !365)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "trace", scope: !752, file: !4, line: 442, type: !380)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !752, file: !4, line: 443, type: !9)
!761 = !DISubprogram(name: "traceback_new", scope: !4, file: !4, line: 389, type: !762, isLocal: true, isDefinition: true, scopeLine: 390, flags: DIFlagPrototyped, isOptimized: true, function: %struct.traceback_t* ()* @traceback_new, variables: !764)
!762 = !DISubroutineType(types: !763)
!763 = !{!365}
!764 = !{!765, !766, !767, !770}
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "traceback", scope: !761, file: !4, line: 391, type: !365)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !761, file: !4, line: 392, type: !497)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "copy", scope: !768, file: !4, line: 412, type: !365)
!768 = distinct !DILexicalBlock(scope: !769, file: !4, line: 411, column: 10)
!769 = distinct !DILexicalBlock(scope: !761, file: !4, line: 408, column: 9)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "traceback_size", scope: !768, file: !4, line: 413, type: !116)
!771 = !DISubprogram(name: "traceback_get_frames", scope: !4, file: !4, line: 361, type: !772, isLocal: true, isDefinition: true, scopeLine: 362, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.traceback_t*)* @traceback_get_frames, variables: !774)
!772 = !DISubroutineType(types: !773)
!773 = !{null, !365}
!774 = !{!775, !776, !889}
!775 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "traceback", arg: 1, scope: !771, file: !4, line: 361, type: !365)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !771, file: !4, line: 363, type: !777)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64, align: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !22, line: 139, baseType: !779)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !22, line: 69, size: 1536, align: 64, elements: !780)
!780 = !{!781, !783, !784, !804, !862, !863, !864, !865, !866, !867, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !779, file: !22, line: 72, baseType: !782, size: 64, align: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64, align: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !779, file: !22, line: 73, baseType: !782, size: 64, align: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !779, file: !22, line: 74, baseType: !785, size: 64, align: 64, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64, align: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !22, line: 44, baseType: !787)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !22, line: 19, size: 832, align: 64, elements: !788)
!788 = !{!789, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !787, file: !22, line: 21, baseType: !790, size: 64, align: 64)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !787, file: !22, line: 22, baseType: !782, size: 64, align: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !787, file: !22, line: 24, baseType: !28, size: 64, align: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !787, file: !22, line: 25, baseType: !28, size: 64, align: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !787, file: !22, line: 26, baseType: !28, size: 64, align: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !787, file: !22, line: 27, baseType: !28, size: 64, align: 64, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !787, file: !22, line: 28, baseType: !28, size: 64, align: 64, offset: 384)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !787, file: !22, line: 30, baseType: !28, size: 64, align: 64, offset: 448)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !787, file: !22, line: 31, baseType: !28, size: 64, align: 64, offset: 512)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !787, file: !22, line: 32, baseType: !28, size: 64, align: 64, offset: 576)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !787, file: !22, line: 33, baseType: !9, size: 32, align: 32, offset: 640)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !787, file: !22, line: 34, baseType: !9, size: 32, align: 32, offset: 672)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !787, file: !22, line: 37, baseType: !9, size: 32, align: 32, offset: 704)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !787, file: !22, line: 43, baseType: !28, size: 64, align: 64, offset: 768)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !779, file: !22, line: 76, baseType: !805, size: 64, align: 64, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64, align: 64)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !807, line: 17, size: 3072, align: 64, elements: !808)
!807 = !DIFile(filename: "Include/frameobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!808 = !{!809, !810, !811, !838, !839, !840, !841, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !861}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !806, file: !807, line: 18, baseType: !46, size: 192, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "f_back", scope: !806, file: !807, line: 19, baseType: !805, size: 64, align: 64, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "f_code", scope: !806, file: !807, line: 20, baseType: !812, size: 64, align: 64, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64, align: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !814, line: 33, baseType: !815)
!814 = !DIFile(filename: "Include/code.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!815 = !DICompositeType(tag: DW_TAG_structure_type, file: !814, line: 11, size: 1152, align: 64, elements: !816)
!816 = !{!817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !832, !833, !834, !835, !836, !837}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !815, file: !814, line: 12, baseType: !29, size: 128, align: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !815, file: !814, line: 13, baseType: !9, size: 32, align: 32, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !815, file: !814, line: 14, baseType: !9, size: 32, align: 32, offset: 160)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !815, file: !814, line: 15, baseType: !9, size: 32, align: 32, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !815, file: !814, line: 16, baseType: !9, size: 32, align: 32, offset: 224)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !815, file: !814, line: 17, baseType: !9, size: 32, align: 32, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "co_code", scope: !815, file: !814, line: 18, baseType: !28, size: 64, align: 64, offset: 320)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !815, file: !814, line: 19, baseType: !28, size: 64, align: 64, offset: 384)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !815, file: !814, line: 20, baseType: !28, size: 64, align: 64, offset: 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "co_varnames", scope: !815, file: !814, line: 21, baseType: !28, size: 64, align: 64, offset: 512)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "co_freevars", scope: !815, file: !814, line: 22, baseType: !28, size: 64, align: 64, offset: 576)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "co_cellvars", scope: !815, file: !814, line: 23, baseType: !28, size: 64, align: 64, offset: 640)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "co_cell2arg", scope: !815, file: !814, line: 25, baseType: !830, size: 64, align: 64, offset: 704)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64, align: 64)
!831 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !815, file: !814, line: 26, baseType: !28, size: 64, align: 64, offset: 768)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !815, file: !814, line: 27, baseType: !28, size: 64, align: 64, offset: 832)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !815, file: !814, line: 28, baseType: !9, size: 32, align: 32, offset: 896)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "co_lnotab", scope: !815, file: !814, line: 29, baseType: !28, size: 64, align: 64, offset: 960)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "co_zombieframe", scope: !815, file: !814, line: 31, baseType: !27, size: 64, align: 64, offset: 1024)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !815, file: !814, line: 32, baseType: !28, size: 64, align: 64, offset: 1088)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "f_builtins", scope: !806, file: !807, line: 21, baseType: !28, size: 64, align: 64, offset: 320)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "f_globals", scope: !806, file: !807, line: 22, baseType: !28, size: 64, align: 64, offset: 384)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "f_locals", scope: !806, file: !807, line: 23, baseType: !28, size: 64, align: 64, offset: 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "f_valuestack", scope: !806, file: !807, line: 24, baseType: !842, size: 64, align: 64, offset: 512)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "f_stacktop", scope: !806, file: !807, line: 28, baseType: !842, size: 64, align: 64, offset: 576)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "f_trace", scope: !806, file: !807, line: 29, baseType: !28, size: 64, align: 64, offset: 640)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_type", scope: !806, file: !807, line: 38, baseType: !28, size: 64, align: 64, offset: 704)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_value", scope: !806, file: !807, line: 38, baseType: !28, size: 64, align: 64, offset: 768)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_traceback", scope: !806, file: !807, line: 38, baseType: !28, size: 64, align: 64, offset: 832)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "f_gen", scope: !806, file: !807, line: 40, baseType: !28, size: 64, align: 64, offset: 896)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "f_lasti", scope: !806, file: !807, line: 42, baseType: !9, size: 32, align: 32, offset: 960)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "f_lineno", scope: !806, file: !807, line: 48, baseType: !9, size: 32, align: 32, offset: 992)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "f_iblock", scope: !806, file: !807, line: 49, baseType: !9, size: 32, align: 32, offset: 1024)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "f_executing", scope: !806, file: !807, line: 50, baseType: !54, size: 8, align: 8, offset: 1056)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "f_blockstack", scope: !806, file: !807, line: 51, baseType: !854, size: 1920, align: 32, offset: 1088)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !855, size: 1920, align: 32, elements: !122)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTryBlock", file: !807, line: 15, baseType: !856)
!856 = !DICompositeType(tag: DW_TAG_structure_type, file: !807, line: 11, size: 96, align: 32, elements: !857)
!857 = !{!858, !859, !860}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "b_type", scope: !856, file: !807, line: 12, baseType: !9, size: 32, align: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "b_handler", scope: !856, file: !807, line: 13, baseType: !9, size: 32, align: 32, offset: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "b_level", scope: !856, file: !807, line: 14, baseType: !9, size: 32, align: 32, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "f_localsplus", scope: !806, file: !807, line: 52, baseType: !392, size: 64, align: 64, offset: 3008)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !779, file: !22, line: 77, baseType: !9, size: 32, align: 32, offset: 256)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !779, file: !22, line: 78, baseType: !54, size: 8, align: 8, offset: 288)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !779, file: !22, line: 80, baseType: !54, size: 8, align: 8, offset: 296)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !779, file: !22, line: 85, baseType: !9, size: 32, align: 32, offset: 320)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !779, file: !22, line: 86, baseType: !9, size: 32, align: 32, offset: 352)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !779, file: !22, line: 88, baseType: !868, size: 64, align: 64, offset: 384)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !22, line: 54, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64, align: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!9, !28, !805, !9, !28}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !779, file: !22, line: 89, baseType: !868, size: 64, align: 64, offset: 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !779, file: !22, line: 90, baseType: !28, size: 64, align: 64, offset: 512)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !779, file: !22, line: 91, baseType: !28, size: 64, align: 64, offset: 576)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !779, file: !22, line: 93, baseType: !28, size: 64, align: 64, offset: 640)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !779, file: !22, line: 94, baseType: !28, size: 64, align: 64, offset: 704)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !779, file: !22, line: 95, baseType: !28, size: 64, align: 64, offset: 768)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !779, file: !22, line: 97, baseType: !28, size: 64, align: 64, offset: 832)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !779, file: !22, line: 98, baseType: !28, size: 64, align: 64, offset: 896)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !779, file: !22, line: 99, baseType: !28, size: 64, align: 64, offset: 960)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !779, file: !22, line: 101, baseType: !28, size: 64, align: 64, offset: 1024)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !779, file: !22, line: 103, baseType: !9, size: 32, align: 32, offset: 1088)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !779, file: !22, line: 105, baseType: !28, size: 64, align: 64, offset: 1152)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !779, file: !22, line: 106, baseType: !40, size: 64, align: 64, offset: 1216)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !779, file: !22, line: 108, baseType: !9, size: 32, align: 32, offset: 1280)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !779, file: !22, line: 109, baseType: !28, size: 64, align: 64, offset: 1344)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !779, file: !22, line: 134, baseType: !352, size: 64, align: 64, offset: 1408)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !779, file: !22, line: 135, baseType: !27, size: 64, align: 64, offset: 1472)
!889 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pyframe", scope: !771, file: !4, line: 364, type: !890)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64, align: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFrameObject", file: !807, line: 53, baseType: !806)
!892 = !DISubprogram(name: "tracemalloc_get_frame", scope: !4, file: !4, line: 267, type: !893, isLocal: true, isDefinition: true, scopeLine: 268, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._frame*, %struct.frame_t*)* @tracemalloc_get_frame, variables: !895)
!893 = !DISubroutineType(types: !894)
!894 = !{null, !890, !627}
!895 = !{!896, !897, !898, !899, !900, !901}
!896 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pyframe", arg: 1, scope: !892, file: !4, line: 267, type: !890)
!897 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "frame", arg: 2, scope: !892, file: !4, line: 267, type: !627)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !892, file: !4, line: 269, type: !812)
!899 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filename", scope: !892, file: !4, line: 270, type: !28)
!900 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !892, file: !4, line: 271, type: !497)
!901 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !902, file: !4, line: 324, type: !28)
!902 = distinct !DILexicalBlock(scope: !903, file: !4, line: 324, column: 16)
!903 = distinct !DILexicalBlock(scope: !904, file: !4, line: 323, column: 84)
