; ModuleID = 'programs_new/Python-new/abstract.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Py_Identifier = type { %struct._Py_Identifier*, i8*, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !11, subprograms: !455, globals: !1815)
!1 = !DIFile(filename: "abstract.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !4, line: 23, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!7 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!8 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!9 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!10 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!11 = !{!12, !13, !60, !358, !255, !19, !102, !359, !367, !368, !376, !384, !52, !393, !451, !453, !454}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !15, line: 109, baseType: !16)
!15 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !15, line: 105, size: 128, align: 64, elements: !17)
!17 = !{!18, !26}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !16, file: !15, line: 107, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !20, line: 177, baseType: !21)
!20 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !22, line: 102, baseType: !23)
!22 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !24, line: 181, baseType: !25)
!24 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!25 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !16, file: !15, line: 108, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !15, line: 334, size: 3200, align: 64, elements: !29)
!29 = !{!30, !36, !40, !41, !42, !47, !110, !115, !120, !121, !126, !178, !209, !221, !227, !228, !229, !231, !233, !264, !265, !266, !275, !276, !281, !282, !284, !286, !296, !306, !324, !325, !326, !328, !330, !331, !333, !338, !343, !348, !349, !350, !351, !352, !353, !354, !355, !357}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !28, file: !15, line: 335, baseType: !31, size: 192, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !15, line: 114, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 111, size: 192, align: 64, elements: !33)
!33 = !{!34, !35}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !32, file: !15, line: 112, baseType: !14, size: 128, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !32, file: !15, line: 113, baseType: !19, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !28, file: !15, line: 336, baseType: !37, size: 64, align: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !28, file: !15, line: 337, baseType: !19, size: 64, align: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !28, file: !15, line: 337, baseType: !19, size: 64, align: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !28, file: !15, line: 341, baseType: !43, size: 64, align: 64, offset: 384)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !15, line: 308, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !13}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !28, file: !15, line: 342, baseType: !48, size: 64, align: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !15, line: 314, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!52, !13, !53, !52}
!52 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !22, line: 48, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !56, line: 246, size: 1728, align: 64, elements: !57)
!56 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!57 = !{!58, !59, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !79, !80, !81, !82, !84, !86, !88, !92, !95, !97, !98, !99, !100, !101, !105, !106}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !55, file: !56, line: 247, baseType: !52, size: 32, align: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !55, file: !56, line: 252, baseType: !60, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !55, file: !56, line: 253, baseType: !60, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !55, file: !56, line: 254, baseType: !60, size: 64, align: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !55, file: !56, line: 255, baseType: !60, size: 64, align: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !55, file: !56, line: 256, baseType: !60, size: 64, align: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !55, file: !56, line: 257, baseType: !60, size: 64, align: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !55, file: !56, line: 258, baseType: !60, size: 64, align: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !55, file: !56, line: 259, baseType: !60, size: 64, align: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !55, file: !56, line: 261, baseType: !60, size: 64, align: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !55, file: !56, line: 262, baseType: !60, size: 64, align: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !55, file: !56, line: 263, baseType: !60, size: 64, align: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !55, file: !56, line: 265, baseType: !72, size: 64, align: 64, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !56, line: 161, size: 192, align: 64, elements: !74)
!74 = !{!75, !76, !78}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !73, file: !56, line: 162, baseType: !72, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !73, file: !56, line: 163, baseType: !77, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !73, file: !56, line: 167, baseType: !52, size: 32, align: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !55, file: !56, line: 267, baseType: !77, size: 64, align: 64, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !55, file: !56, line: 269, baseType: !52, size: 32, align: 32, offset: 896)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !55, file: !56, line: 273, baseType: !52, size: 32, align: 32, offset: 928)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !55, file: !56, line: 275, baseType: !83, size: 64, align: 64, offset: 960)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !24, line: 140, baseType: !25)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !55, file: !56, line: 279, baseType: !85, size: 16, align: 16, offset: 1024)
!85 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !55, file: !56, line: 280, baseType: !87, size: 8, align: 8, offset: 1040)
!87 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !55, file: !56, line: 281, baseType: !89, size: 8, align: 8, offset: 1048)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 8, align: 8, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 1)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !55, file: !56, line: 285, baseType: !93, size: 64, align: 64, offset: 1088)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !56, line: 155, baseType: null)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !55, file: !56, line: 294, baseType: !96, size: 64, align: 64, offset: 1152)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !24, line: 141, baseType: !25)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !55, file: !56, line: 303, baseType: !12, size: 64, align: 64, offset: 1216)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !55, file: !56, line: 304, baseType: !12, size: 64, align: 64, offset: 1280)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !55, file: !56, line: 305, baseType: !12, size: 64, align: 64, offset: 1344)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !55, file: !56, line: 306, baseType: !12, size: 64, align: 64, offset: 1408)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !55, file: !56, line: 307, baseType: !102, size: 64, align: 64, offset: 1472)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !103, line: 62, baseType: !104)
!103 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!104 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !55, file: !56, line: 309, baseType: !52, size: 32, align: 32, offset: 1536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !55, file: !56, line: 311, baseType: !107, size: 160, align: 8, offset: 1568)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 160, align: 8, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 20)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !28, file: !15, line: 343, baseType: !111, size: 64, align: 64, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !15, line: 316, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!13, !13, !60}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !28, file: !15, line: 344, baseType: !116, size: 64, align: 64, offset: 576)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !15, line: 318, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!52, !13, !60, !13}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !28, file: !15, line: 345, baseType: !12, size: 64, align: 64, offset: 640)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !28, file: !15, line: 346, baseType: !122, size: 64, align: 64, offset: 704)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !15, line: 320, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!13, !13}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !28, file: !15, line: 350, baseType: !127, size: 64, align: 64, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !15, line: 278, baseType: !129)
!129 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 236, size: 2176, align: 64, elements: !130)
!130 = !{!131, !136, !137, !138, !139, !140, !145, !147, !148, !149, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !129, file: !15, line: 241, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !15, line: 166, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!13, !13, !13}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !129, file: !15, line: 242, baseType: !132, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !129, file: !15, line: 243, baseType: !132, size: 64, align: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !129, file: !15, line: 244, baseType: !132, size: 64, align: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !129, file: !15, line: 245, baseType: !132, size: 64, align: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !129, file: !15, line: 246, baseType: !141, size: 64, align: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !15, line: 167, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!13, !13, !13, !13}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !129, file: !15, line: 247, baseType: !146, size: 64, align: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !15, line: 165, baseType: !123)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !129, file: !15, line: 248, baseType: !146, size: 64, align: 64, offset: 448)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !129, file: !15, line: 249, baseType: !146, size: 64, align: 64, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !129, file: !15, line: 250, baseType: !150, size: 64, align: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !15, line: 168, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!52, !13}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !129, file: !15, line: 251, baseType: !146, size: 64, align: 64, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !129, file: !15, line: 252, baseType: !132, size: 64, align: 64, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !129, file: !15, line: 253, baseType: !132, size: 64, align: 64, offset: 768)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !129, file: !15, line: 254, baseType: !132, size: 64, align: 64, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !129, file: !15, line: 255, baseType: !132, size: 64, align: 64, offset: 896)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !129, file: !15, line: 256, baseType: !132, size: 64, align: 64, offset: 960)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !129, file: !15, line: 257, baseType: !146, size: 64, align: 64, offset: 1024)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !129, file: !15, line: 258, baseType: !12, size: 64, align: 64, offset: 1088)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !129, file: !15, line: 259, baseType: !146, size: 64, align: 64, offset: 1152)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !129, file: !15, line: 261, baseType: !132, size: 64, align: 64, offset: 1216)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !129, file: !15, line: 262, baseType: !132, size: 64, align: 64, offset: 1280)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !129, file: !15, line: 263, baseType: !132, size: 64, align: 64, offset: 1344)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !129, file: !15, line: 264, baseType: !132, size: 64, align: 64, offset: 1408)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !129, file: !15, line: 265, baseType: !141, size: 64, align: 64, offset: 1472)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !129, file: !15, line: 266, baseType: !132, size: 64, align: 64, offset: 1536)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !129, file: !15, line: 267, baseType: !132, size: 64, align: 64, offset: 1600)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !129, file: !15, line: 268, baseType: !132, size: 64, align: 64, offset: 1664)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !129, file: !15, line: 269, baseType: !132, size: 64, align: 64, offset: 1728)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !129, file: !15, line: 270, baseType: !132, size: 64, align: 64, offset: 1792)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !129, file: !15, line: 272, baseType: !132, size: 64, align: 64, offset: 1856)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !129, file: !15, line: 273, baseType: !132, size: 64, align: 64, offset: 1920)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !129, file: !15, line: 274, baseType: !132, size: 64, align: 64, offset: 1984)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !129, file: !15, line: 275, baseType: !132, size: 64, align: 64, offset: 2048)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !129, file: !15, line: 277, baseType: !146, size: 64, align: 64, offset: 2112)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !28, file: !15, line: 351, baseType: !179, size: 64, align: 64, offset: 832)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !15, line: 292, baseType: !181)
!181 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 280, size: 640, align: 64, elements: !182)
!182 = !{!183, !188, !189, !194, !195, !196, !201, !202, !207, !208}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !181, file: !15, line: 281, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !15, line: 169, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!19, !13}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !181, file: !15, line: 282, baseType: !132, size: 64, align: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !181, file: !15, line: 283, baseType: !190, size: 64, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !15, line: 170, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!13, !13, !19}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !181, file: !15, line: 284, baseType: !190, size: 64, align: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !181, file: !15, line: 285, baseType: !12, size: 64, align: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !181, file: !15, line: 286, baseType: !197, size: 64, align: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !15, line: 172, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!52, !13, !19, !13}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !181, file: !15, line: 287, baseType: !12, size: 64, align: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !181, file: !15, line: 288, baseType: !203, size: 64, align: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !15, line: 231, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!52, !13, !13}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !181, file: !15, line: 290, baseType: !132, size: 64, align: 64, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !181, file: !15, line: 291, baseType: !190, size: 64, align: 64, offset: 576)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !28, file: !15, line: 352, baseType: !210, size: 64, align: 64, offset: 896)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !15, line: 298, baseType: !212)
!212 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 294, size: 192, align: 64, elements: !213)
!213 = !{!214, !215, !216}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !212, file: !15, line: 295, baseType: !184, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !212, file: !15, line: 296, baseType: !132, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !212, file: !15, line: 297, baseType: !217, size: 64, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !15, line: 174, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!52, !13, !13, !13}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !28, file: !15, line: 356, baseType: !222, size: 64, align: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !15, line: 321, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!226, !13}
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !20, line: 186, baseType: !19)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !28, file: !15, line: 357, baseType: !141, size: 64, align: 64, offset: 1024)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !28, file: !15, line: 358, baseType: !122, size: 64, align: 64, offset: 1088)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !28, file: !15, line: 359, baseType: !230, size: 64, align: 64, offset: 1152)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !15, line: 317, baseType: !133)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !28, file: !15, line: 360, baseType: !232, size: 64, align: 64, offset: 1216)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !15, line: 319, baseType: !218)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !28, file: !15, line: 363, baseType: !234, size: 64, align: 64, offset: 1280)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !15, line: 304, baseType: !236)
!236 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 301, size: 128, align: 64, elements: !237)
!237 = !{!238, !259}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !236, file: !15, line: 302, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !15, line: 193, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!52, !13, !243, !52}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !15, line: 191, baseType: !245)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !15, line: 178, size: 640, align: 64, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254, !256, !257, !258}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !245, file: !15, line: 179, baseType: !12, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !245, file: !15, line: 180, baseType: !13, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !245, file: !15, line: 181, baseType: !19, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !245, file: !15, line: 182, baseType: !19, size: 64, align: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !245, file: !15, line: 184, baseType: !52, size: 32, align: 32, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !245, file: !15, line: 185, baseType: !52, size: 32, align: 32, offset: 288)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !245, file: !15, line: 186, baseType: !60, size: 64, align: 64, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !245, file: !15, line: 187, baseType: !255, size: 64, align: 64, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !245, file: !15, line: 188, baseType: !255, size: 64, align: 64, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !245, file: !15, line: 189, baseType: !255, size: 64, align: 64, offset: 512)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !245, file: !15, line: 190, baseType: !12, size: 64, align: 64, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !236, file: !15, line: 303, baseType: !260, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !15, line: 194, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !13, !243}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !28, file: !15, line: 366, baseType: !104, size: 64, align: 64, offset: 1344)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !28, file: !15, line: 368, baseType: !37, size: 64, align: 64, offset: 1408)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !28, file: !15, line: 372, baseType: !267, size: 64, align: 64, offset: 1472)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !15, line: 233, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!52, !13, !271, !12}
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !15, line: 232, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!52, !13, !12}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !28, file: !15, line: 375, baseType: !150, size: 64, align: 64, offset: 1536)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !28, file: !15, line: 379, baseType: !277, size: 64, align: 64, offset: 1600)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !15, line: 322, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!13, !13, !13, !52}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !28, file: !15, line: 382, baseType: !19, size: 64, align: 64, offset: 1664)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !28, file: !15, line: 385, baseType: !283, size: 64, align: 64, offset: 1728)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !15, line: 323, baseType: !123)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !28, file: !15, line: 386, baseType: !285, size: 64, align: 64, offset: 1792)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !15, line: 324, baseType: !123)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !28, file: !15, line: 389, baseType: !287, size: 64, align: 64, offset: 1856)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !289, line: 40, size: 256, align: 64, elements: !290)
!289 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!290 = !{!291, !292, !294, !295}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !288, file: !289, line: 41, baseType: !37, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !288, file: !289, line: 42, baseType: !293, size: 64, align: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !289, line: 18, baseType: !133)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !288, file: !289, line: 43, baseType: !52, size: 32, align: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !288, file: !289, line: 45, baseType: !37, size: 64, align: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !28, file: !15, line: 390, baseType: !297, size: 64, align: 64, offset: 1920)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !299, line: 18, size: 320, align: 64, elements: !300)
!299 = !DIFile(filename: "Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!300 = !{!301, !302, !303, !304, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !298, file: !299, line: 19, baseType: !60, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !298, file: !299, line: 20, baseType: !52, size: 32, align: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !298, file: !299, line: 21, baseType: !19, size: 64, align: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !298, file: !299, line: 22, baseType: !52, size: 32, align: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !298, file: !299, line: 23, baseType: !60, size: 64, align: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !28, file: !15, line: 391, baseType: !307, size: 64, align: 64, offset: 1984)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !309, line: 11, size: 320, align: 64, elements: !310)
!309 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!310 = !{!311, !312, !317, !322, !323}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !308, file: !309, line: 12, baseType: !60, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !308, file: !309, line: 13, baseType: !313, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !309, line: 8, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!13, !13, !12}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !308, file: !309, line: 14, baseType: !318, size: 64, align: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !309, line: 9, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!52, !13, !13, !12}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !308, file: !309, line: 15, baseType: !60, size: 64, align: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !308, file: !309, line: 16, baseType: !12, size: 64, align: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !28, file: !15, line: 392, baseType: !27, size: 64, align: 64, offset: 2048)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !28, file: !15, line: 393, baseType: !13, size: 64, align: 64, offset: 2112)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !28, file: !15, line: 394, baseType: !327, size: 64, align: 64, offset: 2176)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !15, line: 325, baseType: !142)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !28, file: !15, line: 395, baseType: !329, size: 64, align: 64, offset: 2240)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !15, line: 326, baseType: !218)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !28, file: !15, line: 396, baseType: !19, size: 64, align: 64, offset: 2304)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !28, file: !15, line: 397, baseType: !332, size: 64, align: 64, offset: 2368)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !15, line: 327, baseType: !218)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !28, file: !15, line: 398, baseType: !334, size: 64, align: 64, offset: 2432)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !15, line: 329, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!13, !27, !19}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !28, file: !15, line: 399, baseType: !339, size: 64, align: 64, offset: 2496)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !15, line: 328, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!13, !27, !13, !13}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !28, file: !15, line: 400, baseType: !344, size: 64, align: 64, offset: 2560)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !15, line: 307, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !12}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !28, file: !15, line: 401, baseType: !150, size: 64, align: 64, offset: 2624)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !28, file: !15, line: 402, baseType: !13, size: 64, align: 64, offset: 2688)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !28, file: !15, line: 403, baseType: !13, size: 64, align: 64, offset: 2752)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !28, file: !15, line: 404, baseType: !13, size: 64, align: 64, offset: 2816)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !28, file: !15, line: 405, baseType: !13, size: 64, align: 64, offset: 2880)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !28, file: !15, line: 406, baseType: !13, size: 64, align: 64, offset: 2944)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !28, file: !15, line: 407, baseType: !43, size: 64, align: 64, offset: 3008)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !28, file: !15, line: 410, baseType: !356, size: 32, align: 32, offset: 3072)
!356 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !28, file: !15, line: 412, baseType: !43, size: 64, align: 64, offset: 3136)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !361, line: 41, baseType: !362)
!361 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!362 = !DICompositeType(tag: DW_TAG_structure_type, file: !361, line: 31, size: 320, align: 64, elements: !363)
!363 = !{!364, !365, !366}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !362, file: !361, line: 32, baseType: !31, size: 192, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !362, file: !361, line: 33, baseType: !226, size: 64, align: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !362, file: !361, line: 34, baseType: !89, size: 8, align: 8, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFloatObject", file: !370, line: 18, baseType: !371)
!370 = !DIFile(filename: "Include/floatobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!371 = !DICompositeType(tag: DW_TAG_structure_type, file: !370, line: 15, size: 192, align: 64, elements: !372)
!372 = !{!373, !374}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !371, file: !370, line: 16, baseType: !14, size: 128, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ob_fval", scope: !371, file: !370, line: 17, baseType: !375, size: 64, align: 64, offset: 128)
!375 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !378, line: 33, baseType: !379)
!378 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!379 = !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 25, size: 256, align: 64, elements: !380)
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !379, file: !378, line: 26, baseType: !31, size: 192, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !379, file: !378, line: 27, baseType: !383, size: 64, align: 64, offset: 192)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 64, align: 64, elements: !90)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !386, line: 40, baseType: !387)
!386 = !DIFile(filename: "Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!387 = !DICompositeType(tag: DW_TAG_structure_type, file: !386, line: 23, size: 320, align: 64, elements: !388)
!388 = !{!389, !390, !392}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !387, file: !386, line: 24, baseType: !31, size: 192, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !387, file: !386, line: 26, baseType: !391, size: 64, align: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !387, file: !386, line: 39, baseType: !19, size: 64, align: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !395, line: 139, baseType: !396)
!395 = !DIFile(filename: "Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !395, line: 69, size: 1536, align: 64, elements: !397)
!397 = !{!398, !400, !401, !421, !424, !425, !426, !427, !428, !429, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !396, file: !395, line: 72, baseType: !399, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !396, file: !395, line: 73, baseType: !399, size: 64, align: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !396, file: !395, line: 74, baseType: !402, size: 64, align: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !395, line: 44, baseType: !404)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !395, line: 19, size: 832, align: 64, elements: !405)
!405 = !{!406, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !404, file: !395, line: 21, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !404, file: !395, line: 22, baseType: !399, size: 64, align: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !404, file: !395, line: 24, baseType: !13, size: 64, align: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !404, file: !395, line: 25, baseType: !13, size: 64, align: 64, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !404, file: !395, line: 26, baseType: !13, size: 64, align: 64, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !404, file: !395, line: 27, baseType: !13, size: 64, align: 64, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !404, file: !395, line: 28, baseType: !13, size: 64, align: 64, offset: 384)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !404, file: !395, line: 30, baseType: !13, size: 64, align: 64, offset: 448)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !404, file: !395, line: 31, baseType: !13, size: 64, align: 64, offset: 512)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !404, file: !395, line: 32, baseType: !13, size: 64, align: 64, offset: 576)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !404, file: !395, line: 33, baseType: !52, size: 32, align: 32, offset: 640)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !404, file: !395, line: 34, baseType: !52, size: 32, align: 32, offset: 672)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !404, file: !395, line: 37, baseType: !52, size: 32, align: 32, offset: 704)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !404, file: !395, line: 43, baseType: !13, size: 64, align: 64, offset: 768)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !396, file: !395, line: 76, baseType: !422, size: 64, align: 64, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !395, line: 50, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !396, file: !395, line: 77, baseType: !52, size: 32, align: 32, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !396, file: !395, line: 78, baseType: !39, size: 8, align: 8, offset: 288)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !396, file: !395, line: 80, baseType: !39, size: 8, align: 8, offset: 296)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !396, file: !395, line: 85, baseType: !52, size: 32, align: 32, offset: 320)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !396, file: !395, line: 86, baseType: !52, size: 32, align: 32, offset: 352)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !396, file: !395, line: 88, baseType: !430, size: 64, align: 64, offset: 384)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !395, line: 54, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!52, !13, !422, !52, !13}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !396, file: !395, line: 89, baseType: !430, size: 64, align: 64, offset: 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !396, file: !395, line: 90, baseType: !13, size: 64, align: 64, offset: 512)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !396, file: !395, line: 91, baseType: !13, size: 64, align: 64, offset: 576)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !396, file: !395, line: 93, baseType: !13, size: 64, align: 64, offset: 640)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !396, file: !395, line: 94, baseType: !13, size: 64, align: 64, offset: 704)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !396, file: !395, line: 95, baseType: !13, size: 64, align: 64, offset: 768)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !396, file: !395, line: 97, baseType: !13, size: 64, align: 64, offset: 832)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !396, file: !395, line: 98, baseType: !13, size: 64, align: 64, offset: 896)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !396, file: !395, line: 99, baseType: !13, size: 64, align: 64, offset: 960)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !396, file: !395, line: 101, baseType: !13, size: 64, align: 64, offset: 1024)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !396, file: !395, line: 103, baseType: !52, size: 32, align: 32, offset: 1088)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !396, file: !395, line: 105, baseType: !13, size: 64, align: 64, offset: 1152)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !396, file: !395, line: 106, baseType: !25, size: 64, align: 64, offset: 1216)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !396, file: !395, line: 108, baseType: !52, size: 32, align: 32, offset: 1280)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !396, file: !395, line: 109, baseType: !13, size: 64, align: 64, offset: 1344)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !396, file: !395, line: 134, baseType: !345, size: 64, align: 64, offset: 1408)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !396, file: !395, line: 135, baseType: !12, size: 64, align: 64, offset: 1472)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !15, line: 422, baseType: !28)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!455 = !{!456, !461, !465, !468, !471, !493, !503, !514, !524, !534, !549, !554, !571, !586, !591, !599, !607, !617, !623, !638, !649, !660, !670, !681, !699, !702, !706, !710, !714, !718, !722, !726, !730, !740, !751, !755, !759, !763, !768, !772, !776, !780, !784, !788, !792, !796, !800, !813, !825, !829, !834, !838, !842, !846, !850, !862, !873, !892, !906, !916, !919, !923, !926, !936, !949, !959, !972, !984, !998, !1011, !1025, !1040, !1054, !1085, !1096, !1105, !1124, !1128, !1134, !1138, !1142, !1145, !1149, !1152, !1160, !1171, !1180, !1189, !1196, !1203, !1210, !1214, !1249, !1269, !1275, !1285, !1303, !1311, !1319, !1336, !1353, !1363, !1426, !1489, !1493, !1497, !1509, !1513, !1536, !1542, !1546, !1552, !1560, !1566, !1580, !1602, !1609, !1617, !1651, !1665, !1682, !1691, !1696, !1699, !1713, !1729, !1739, !1759, !1766, !1792, !1811}
!456 = !DISubprogram(name: "PyObject_Type", scope: !457, file: !457, line: 31, type: !124, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyObject_Type, variables: !458)
!457 = !DIFile(filename: "Objects/abstract.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!458 = !{!459, !460}
!459 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !456, file: !457, line: 31, type: !13)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !456, file: !457, line: 33, type: !13)
!461 = !DISubprogram(name: "PyObject_Size", scope: !457, file: !457, line: 43, type: !186, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyObject_Size, variables: !462)
!462 = !{!463, !464}
!463 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !461, file: !457, line: 43, type: !13)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !461, file: !457, line: 45, type: !179)
!465 = !DISubprogram(name: "PyObject_Length", scope: !457, file: !457, line: 61, type: !186, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyObject_Length, variables: !466)
!466 = !{!467}
!467 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !465, file: !457, line: 61, type: !13)
!468 = !DISubprogram(name: "_PyObject_HasLen", scope: !457, file: !457, line: 68, type: !152, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @_PyObject_HasLen, variables: !469)
!469 = !{!470}
!470 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !468, file: !457, line: 68, type: !13)
!471 = !DISubprogram(name: "PyObject_LengthHint", scope: !457, file: !457, line: 80, type: !472, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*, i64)* @PyObject_LengthHint, variables: !474)
!472 = !DISubroutineType(types: !473)
!473 = !{!19, !13, !19}
!474 = !{!475, !476, !477, !478, !479, !480, !482, !487, !491}
!475 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !471, file: !457, line: 80, type: !13)
!476 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "defaultvalue", arg: 2, scope: !471, file: !457, line: 80, type: !19)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hint", scope: !471, file: !457, line: 82, type: !13)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !471, file: !457, line: 82, type: !13)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !471, file: !457, line: 83, type: !19)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !481, file: !457, line: 105, type: !13)
!481 = distinct !DILexicalBlock(scope: !471, file: !457, line: 105, column: 8)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !483, file: !457, line: 114, type: !13)
!483 = distinct !DILexicalBlock(scope: !484, file: !457, line: 114, column: 12)
!484 = distinct !DILexicalBlock(scope: !485, file: !457, line: 113, column: 53)
!485 = distinct !DILexicalBlock(scope: !486, file: !457, line: 113, column: 14)
!486 = distinct !DILexicalBlock(scope: !471, file: !457, line: 106, column: 9)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !488, file: !457, line: 120, type: !13)
!488 = distinct !DILexicalBlock(scope: !489, file: !457, line: 120, column: 12)
!489 = distinct !DILexicalBlock(scope: !490, file: !457, line: 117, column: 81)
!490 = distinct !DILexicalBlock(scope: !471, file: !457, line: 117, column: 9)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !492, file: !457, line: 124, type: !13)
!492 = distinct !DILexicalBlock(scope: !471, file: !457, line: 124, column: 8)
!493 = !DISubprogram(name: "PyObject_GetItem", scope: !457, file: !457, line: 136, type: !134, isLocal: false, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyObject_GetItem, variables: !494)
!494 = !{!495, !496, !497, !498}
!495 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !493, file: !457, line: 136, type: !13)
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !493, file: !457, line: 136, type: !13)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !493, file: !457, line: 138, type: !210)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key_value", scope: !499, file: !457, line: 149, type: !19)
!499 = distinct !DILexicalBlock(scope: !500, file: !457, line: 148, column: 115)
!500 = distinct !DILexicalBlock(scope: !501, file: !457, line: 148, column: 13)
!501 = distinct !DILexicalBlock(scope: !502, file: !457, line: 147, column: 37)
!502 = distinct !DILexicalBlock(scope: !493, file: !457, line: 147, column: 9)
!503 = !DISubprogram(name: "PyObject_SetItem", scope: !457, file: !457, line: 164, type: !219, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, %struct._object*)* @PyObject_SetItem, variables: !504)
!504 = !{!505, !506, !507, !508, !509}
!505 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !503, file: !457, line: 164, type: !13)
!506 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !503, file: !457, line: 164, type: !13)
!507 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !503, file: !457, line: 164, type: !13)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !503, file: !457, line: 166, type: !210)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key_value", scope: !510, file: !457, line: 178, type: !19)
!510 = distinct !DILexicalBlock(scope: !511, file: !457, line: 177, column: 115)
!511 = distinct !DILexicalBlock(scope: !512, file: !457, line: 177, column: 13)
!512 = distinct !DILexicalBlock(scope: !513, file: !457, line: 176, column: 37)
!513 = distinct !DILexicalBlock(scope: !503, file: !457, line: 176, column: 9)
!514 = !DISubprogram(name: "PyObject_DelItem", scope: !457, file: !457, line: 196, type: !205, isLocal: false, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*)* @PyObject_DelItem, variables: !515)
!515 = !{!516, !517, !518, !519}
!516 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !514, file: !457, line: 196, type: !13)
!517 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !514, file: !457, line: 196, type: !13)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !514, file: !457, line: 198, type: !210)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key_value", scope: !520, file: !457, line: 210, type: !19)
!520 = distinct !DILexicalBlock(scope: !521, file: !457, line: 209, column: 115)
!521 = distinct !DILexicalBlock(scope: !522, file: !457, line: 209, column: 13)
!522 = distinct !DILexicalBlock(scope: !523, file: !457, line: 208, column: 37)
!523 = distinct !DILexicalBlock(scope: !514, file: !457, line: 208, column: 9)
!524 = !DISubprogram(name: "PyObject_DelItemString", scope: !457, file: !457, line: 228, type: !525, isLocal: false, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*)* @PyObject_DelItemString, variables: !527)
!525 = !DISubroutineType(types: !526)
!526 = !{!52, !13, !37}
!527 = !{!528, !529, !530, !531, !532}
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !524, file: !457, line: 228, type: !13)
!529 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !524, file: !457, line: 228, type: !37)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "okey", scope: !524, file: !457, line: 230, type: !13)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !524, file: !457, line: 231, type: !52)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !533, file: !457, line: 241, type: !13)
!533 = distinct !DILexicalBlock(scope: !524, file: !457, line: 241, column: 8)
!534 = !DISubprogram(name: "PyObject_AsCharBuffer", scope: !457, file: !457, line: 249, type: !535, isLocal: false, isDefinition: true, scopeLine: 252, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8**, i64*)* @PyObject_AsCharBuffer, variables: !538)
!535 = !DISubroutineType(types: !536)
!536 = !{!52, !13, !537, !255}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!538 = !{!539, !540, !541, !542, !543, !544, !546}
!539 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !534, file: !457, line: 249, type: !13)
!540 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buffer", arg: 2, scope: !534, file: !457, line: 250, type: !537)
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buffer_len", arg: 3, scope: !534, file: !457, line: 251, type: !255)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pb", scope: !534, file: !457, line: 253, type: !234)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view", scope: !534, file: !457, line: 254, type: !244)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !545, file: !457, line: 273, type: !13)
!545 = distinct !DILexicalBlock(scope: !534, file: !457, line: 273, column: 8)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !547, file: !457, line: 273, type: !13)
!547 = distinct !DILexicalBlock(scope: !548, file: !457, line: 273, column: 100)
!548 = distinct !DILexicalBlock(scope: !545, file: !457, line: 273, column: 66)
!549 = !DISubprogram(name: "PyObject_CheckReadBuffer", scope: !457, file: !457, line: 278, type: !152, isLocal: false, isDefinition: true, scopeLine: 279, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @PyObject_CheckReadBuffer, variables: !550)
!550 = !{!551, !552, !553}
!551 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !549, file: !457, line: 278, type: !13)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pb", scope: !549, file: !457, line: 280, type: !234)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view", scope: !549, file: !457, line: 281, type: !244)
!554 = !DISubprogram(name: "PyObject_AsReadBuffer", scope: !457, file: !457, line: 294, type: !555, isLocal: false, isDefinition: true, scopeLine: 297, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8**, i64*)* @PyObject_AsReadBuffer, variables: !560)
!555 = !DISubroutineType(types: !556)
!556 = !{!52, !13, !557, !255}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!560 = !{!561, !562, !563, !564, !565, !566, !568}
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !554, file: !457, line: 294, type: !13)
!562 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buffer", arg: 2, scope: !554, file: !457, line: 295, type: !557)
!563 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buffer_len", arg: 3, scope: !554, file: !457, line: 296, type: !255)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pb", scope: !554, file: !457, line: 298, type: !234)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view", scope: !554, file: !457, line: 299, type: !244)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !567, file: !457, line: 319, type: !13)
!567 = distinct !DILexicalBlock(scope: !554, file: !457, line: 319, column: 8)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !569, file: !457, line: 319, type: !13)
!569 = distinct !DILexicalBlock(scope: !570, file: !457, line: 319, column: 100)
!570 = distinct !DILexicalBlock(scope: !567, file: !457, line: 319, column: 66)
!571 = !DISubprogram(name: "PyObject_AsWriteBuffer", scope: !457, file: !457, line: 323, type: !572, isLocal: false, isDefinition: true, scopeLine: 326, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8**, i64*)* @PyObject_AsWriteBuffer, variables: !575)
!572 = !DISubroutineType(types: !573)
!573 = !{!52, !13, !574, !255}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!575 = !{!576, !577, !578, !579, !580, !581, !583}
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !571, file: !457, line: 323, type: !13)
!577 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buffer", arg: 2, scope: !571, file: !457, line: 324, type: !574)
!578 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buffer_len", arg: 3, scope: !571, file: !457, line: 325, type: !255)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pb", scope: !571, file: !457, line: 327, type: !234)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view", scope: !571, file: !457, line: 328, type: !244)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !582, file: !457, line: 347, type: !13)
!582 = distinct !DILexicalBlock(scope: !571, file: !457, line: 347, column: 8)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !584, file: !457, line: 347, type: !13)
!584 = distinct !DILexicalBlock(scope: !585, file: !457, line: 347, column: 100)
!585 = distinct !DILexicalBlock(scope: !582, file: !457, line: 347, column: 66)
!586 = !DISubprogram(name: "PyObject_GetBuffer", scope: !457, file: !457, line: 354, type: !241, isLocal: false, isDefinition: true, scopeLine: 355, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct.bufferinfo*, i32)* @PyObject_GetBuffer, variables: !587)
!587 = !{!588, !589, !590}
!588 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !586, file: !457, line: 354, type: !13)
!589 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 2, scope: !586, file: !457, line: 354, type: !243)
!590 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 3, scope: !586, file: !457, line: 354, type: !52)
!591 = !DISubprogram(name: "PyBuffer_IsContiguous", scope: !457, file: !457, line: 408, type: !592, isLocal: false, isDefinition: true, scopeLine: 409, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.bufferinfo*, i8)* @PyBuffer_IsContiguous, variables: !596)
!592 = !DISubroutineType(types: !593)
!593 = !{!52, !594, !39}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64, align: 64)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!596 = !{!597, !598}
!597 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 1, scope: !591, file: !457, line: 408, type: !594)
!598 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 2, scope: !591, file: !457, line: 408, type: !39)
!599 = !DISubprogram(name: "PyBuffer_GetPointer", scope: !457, file: !457, line: 424, type: !600, isLocal: false, isDefinition: true, scopeLine: 425, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.bufferinfo*, i64*)* @PyBuffer_GetPointer, variables: !602)
!600 = !DISubroutineType(types: !601)
!601 = !{!12, !243, !255}
!602 = !{!603, !604, !605, !606}
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 1, scope: !599, file: !457, line: 424, type: !243)
!604 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "indices", arg: 2, scope: !599, file: !457, line: 424, type: !255)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pointer", scope: !599, file: !457, line: 426, type: !60)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !599, file: !457, line: 427, type: !52)
!607 = !DISubprogram(name: "_Py_add_one_to_index_F", scope: !457, file: !457, line: 440, type: !608, isLocal: false, isDefinition: true, scopeLine: 441, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i64*, i64*)* @_Py_add_one_to_index_F, variables: !612)
!608 = !DISubroutineType(types: !609)
!609 = !{null, !52, !255, !610}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!612 = !{!613, !614, !615, !616}
!613 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nd", arg: 1, scope: !607, file: !457, line: 440, type: !52)
!614 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 2, scope: !607, file: !457, line: 440, type: !255)
!615 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "shape", arg: 3, scope: !607, file: !457, line: 440, type: !610)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !607, file: !457, line: 442, type: !52)
!617 = !DISubprogram(name: "_Py_add_one_to_index_C", scope: !457, file: !457, line: 456, type: !608, isLocal: false, isDefinition: true, scopeLine: 457, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i64*, i64*)* @_Py_add_one_to_index_C, variables: !618)
!618 = !{!619, !620, !621, !622}
!619 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nd", arg: 1, scope: !617, file: !457, line: 456, type: !52)
!620 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 2, scope: !617, file: !457, line: 456, type: !255)
!621 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "shape", arg: 3, scope: !617, file: !457, line: 456, type: !610)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !617, file: !457, line: 458, type: !52)
!623 = !DISubprogram(name: "PyBuffer_FromContiguous", scope: !457, file: !457, line: 472, type: !624, isLocal: false, isDefinition: true, scopeLine: 473, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.bufferinfo*, i8*, i64, i8)* @PyBuffer_FromContiguous, variables: !626)
!624 = !DISubroutineType(types: !625)
!625 = !{!52, !243, !12, !19, !39}
!626 = !{!627, !628, !629, !630, !631, !632, !634, !635, !636, !637}
!627 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 1, scope: !623, file: !457, line: 472, type: !243)
!628 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 2, scope: !623, file: !457, line: 472, type: !12)
!629 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 3, scope: !623, file: !457, line: 472, type: !19)
!630 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fort", arg: 4, scope: !623, file: !457, line: 472, type: !39)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !623, file: !457, line: 474, type: !52)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "addone", scope: !623, file: !457, line: 475, type: !633)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64, align: 64)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !623, file: !457, line: 476, type: !255)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "elements", scope: !623, file: !457, line: 476, type: !19)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "src", scope: !623, file: !457, line: 477, type: !60)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !623, file: !457, line: 477, type: !60)
!638 = !DISubprogram(name: "PyObject_CopyData", scope: !457, file: !457, line: 523, type: !205, isLocal: false, isDefinition: true, scopeLine: 524, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*)* @PyObject_CopyData, variables: !639)
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647, !648}
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !638, file: !457, line: 523, type: !13)
!641 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 2, scope: !638, file: !457, line: 523, type: !13)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view_dest", scope: !638, file: !457, line: 525, type: !244)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view_src", scope: !638, file: !457, line: 525, type: !244)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !638, file: !457, line: 526, type: !52)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !638, file: !457, line: 527, type: !255)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "elements", scope: !638, file: !457, line: 527, type: !19)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dptr", scope: !638, file: !457, line: 528, type: !60)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sptr", scope: !638, file: !457, line: 528, type: !60)
!649 = !DISubprogram(name: "PyBuffer_FillContiguousStrides", scope: !457, file: !457, line: 594, type: !650, isLocal: false, isDefinition: true, scopeLine: 597, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i64*, i64*, i32, i8)* @PyBuffer_FillContiguousStrides, variables: !652)
!650 = !DISubroutineType(types: !651)
!651 = !{null, !52, !255, !255, !52, !39}
!652 = !{!653, !654, !655, !656, !657, !658, !659}
!653 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nd", arg: 1, scope: !649, file: !457, line: 594, type: !52)
!654 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "shape", arg: 2, scope: !649, file: !457, line: 594, type: !255)
!655 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "strides", arg: 3, scope: !649, file: !457, line: 595, type: !255)
!656 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "itemsize", arg: 4, scope: !649, file: !457, line: 595, type: !52)
!657 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fort", arg: 5, scope: !649, file: !457, line: 596, type: !39)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !649, file: !457, line: 598, type: !52)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sd", scope: !649, file: !457, line: 599, type: !19)
!660 = !DISubprogram(name: "PyBuffer_FillInfo", scope: !457, file: !457, line: 618, type: !661, isLocal: false, isDefinition: true, scopeLine: 620, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.bufferinfo*, %struct._object*, i8*, i64, i32, i32)* @PyBuffer_FillInfo, variables: !663)
!661 = !DISubroutineType(types: !662)
!662 = !{!52, !243, !13, !12, !19, !52, !52}
!663 = !{!664, !665, !666, !667, !668, !669}
!664 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 1, scope: !660, file: !457, line: 618, type: !243)
!665 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !660, file: !457, line: 618, type: !13)
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 3, scope: !660, file: !457, line: 618, type: !12)
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 4, scope: !660, file: !457, line: 618, type: !19)
!668 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "readonly", arg: 5, scope: !660, file: !457, line: 619, type: !52)
!669 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 6, scope: !660, file: !457, line: 619, type: !52)
!670 = !DISubprogram(name: "PyBuffer_Release", scope: !457, file: !457, line: 652, type: !671, isLocal: false, isDefinition: true, scopeLine: 653, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.bufferinfo*)* @PyBuffer_Release, variables: !673)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !243}
!673 = !{!674, !675, !676, !678}
!674 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 1, scope: !670, file: !457, line: 652, type: !243)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !670, file: !457, line: 654, type: !13)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !677, file: !457, line: 657, type: !13)
!677 = distinct !DILexicalBlock(scope: !670, file: !457, line: 657, column: 8)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !679, file: !457, line: 657, type: !13)
!679 = distinct !DILexicalBlock(scope: !680, file: !457, line: 657, column: 95)
!680 = distinct !DILexicalBlock(scope: !677, file: !457, line: 657, column: 61)
!681 = !DISubprogram(name: "PyObject_Format", scope: !457, file: !457, line: 662, type: !134, isLocal: false, isDefinition: true, scopeLine: 663, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyObject_Format, variables: !682)
!682 = !{!683, !684, !685, !686, !687, !688, !690, !694, !696}
!683 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !681, file: !457, line: 662, type: !13)
!684 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format_spec", arg: 2, scope: !681, file: !457, line: 662, type: !13)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "meth", scope: !681, file: !457, line: 664, type: !13)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "empty", scope: !681, file: !457, line: 665, type: !13)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !681, file: !457, line: 666, type: !13)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !689, file: !457, line: 687, type: !13)
!689 = distinct !DILexicalBlock(scope: !681, file: !457, line: 687, column: 8)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !691, file: !457, line: 692, type: !13)
!691 = distinct !DILexicalBlock(scope: !692, file: !457, line: 692, column: 12)
!692 = distinct !DILexicalBlock(scope: !693, file: !457, line: 689, column: 91)
!693 = distinct !DILexicalBlock(scope: !681, file: !457, line: 689, column: 9)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !695, file: !457, line: 698, type: !13)
!695 = distinct !DILexicalBlock(scope: !681, file: !457, line: 698, column: 8)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !697, file: !457, line: 698, type: !13)
!697 = distinct !DILexicalBlock(scope: !698, file: !457, line: 698, column: 97)
!698 = distinct !DILexicalBlock(scope: !695, file: !457, line: 698, column: 63)
!699 = !DISubprogram(name: "PyNumber_Check", scope: !457, file: !457, line: 704, type: !152, isLocal: false, isDefinition: true, scopeLine: 705, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @PyNumber_Check, variables: !700)
!700 = !{!701}
!701 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !699, file: !457, line: 704, type: !13)
!702 = !DISubprogram(name: "PyNumber_Or", scope: !457, file: !457, line: 876, type: !134, isLocal: false, isDefinition: true, scopeLine: 876, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_Or, variables: !703)
!703 = !{!704, !705}
!704 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !702, file: !457, line: 876, type: !13)
!705 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !702, file: !457, line: 876, type: !13)
!706 = !DISubprogram(name: "PyNumber_Xor", scope: !457, file: !457, line: 877, type: !134, isLocal: false, isDefinition: true, scopeLine: 877, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_Xor, variables: !707)
!707 = !{!708, !709}
!708 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !706, file: !457, line: 877, type: !13)
!709 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !706, file: !457, line: 877, type: !13)
!710 = !DISubprogram(name: "PyNumber_And", scope: !457, file: !457, line: 878, type: !134, isLocal: false, isDefinition: true, scopeLine: 878, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_And, variables: !711)
!711 = !{!712, !713}
!712 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !710, file: !457, line: 878, type: !13)
!713 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !710, file: !457, line: 878, type: !13)
!714 = !DISubprogram(name: "PyNumber_Lshift", scope: !457, file: !457, line: 879, type: !134, isLocal: false, isDefinition: true, scopeLine: 879, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_Lshift, variables: !715)
!715 = !{!716, !717}
!716 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !714, file: !457, line: 879, type: !13)
!717 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !714, file: !457, line: 879, type: !13)
!718 = !DISubprogram(name: "PyNumber_Rshift", scope: !457, file: !457, line: 880, type: !134, isLocal: false, isDefinition: true, scopeLine: 880, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_Rshift, variables: !719)
!719 = !{!720, !721}
!720 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !718, file: !457, line: 880, type: !13)
!721 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !718, file: !457, line: 880, type: !13)
!722 = !DISubprogram(name: "PyNumber_Subtract", scope: !457, file: !457, line: 881, type: !134, isLocal: false, isDefinition: true, scopeLine: 881, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_Subtract, variables: !723)
!723 = !{!724, !725}
!724 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !722, file: !457, line: 881, type: !13)
!725 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !722, file: !457, line: 881, type: !13)
!726 = !DISubprogram(name: "PyNumber_Divmod", scope: !457, file: !457, line: 882, type: !134, isLocal: false, isDefinition: true, scopeLine: 882, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_Divmod, variables: !727)
!727 = !{!728, !729}
!728 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !726, file: !457, line: 882, type: !13)
!729 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !726, file: !457, line: 882, type: !13)
!730 = !DISubprogram(name: "PyNumber_Add", scope: !457, file: !457, line: 885, type: !134, isLocal: false, isDefinition: true, scopeLine: 886, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_Add, variables: !731)
!731 = !{!732, !733, !734, !735, !738}
!732 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !730, file: !457, line: 885, type: !13)
!733 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !730, file: !457, line: 885, type: !13)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !730, file: !457, line: 887, type: !13)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !736, file: !457, line: 889, type: !179)
!736 = distinct !DILexicalBlock(scope: !737, file: !457, line: 888, column: 48)
!737 = distinct !DILexicalBlock(scope: !730, file: !457, line: 888, column: 9)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !739, file: !457, line: 890, type: !13)
!739 = distinct !DILexicalBlock(scope: !736, file: !457, line: 890, column: 12)
!740 = !DISubprogram(name: "PyNumber_Multiply", scope: !457, file: !457, line: 916, type: !134, isLocal: false, isDefinition: true, scopeLine: 917, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_Multiply, variables: !741)
!741 = !{!742, !743, !744, !745, !748, !749}
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !740, file: !457, line: 916, type: !13)
!743 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !740, file: !457, line: 916, type: !13)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !740, file: !457, line: 918, type: !13)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv", scope: !746, file: !457, line: 920, type: !179)
!746 = distinct !DILexicalBlock(scope: !747, file: !457, line: 919, column: 48)
!747 = distinct !DILexicalBlock(scope: !740, file: !457, line: 919, column: 9)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mw", scope: !746, file: !457, line: 921, type: !179)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !750, file: !457, line: 922, type: !13)
!750 = distinct !DILexicalBlock(scope: !746, file: !457, line: 922, column: 12)
!751 = !DISubprogram(name: "PyNumber_FloorDivide", scope: !457, file: !457, line: 935, type: !134, isLocal: false, isDefinition: true, scopeLine: 936, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_FloorDivide, variables: !752)
!752 = !{!753, !754}
!753 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !751, file: !457, line: 935, type: !13)
!754 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !751, file: !457, line: 935, type: !13)
!755 = !DISubprogram(name: "PyNumber_TrueDivide", scope: !457, file: !457, line: 941, type: !134, isLocal: false, isDefinition: true, scopeLine: 942, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_TrueDivide, variables: !756)
!756 = !{!757, !758}
!757 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !755, file: !457, line: 941, type: !13)
!758 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !755, file: !457, line: 941, type: !13)
!759 = !DISubprogram(name: "PyNumber_Remainder", scope: !457, file: !457, line: 947, type: !134, isLocal: false, isDefinition: true, scopeLine: 948, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_Remainder, variables: !760)
!760 = !{!761, !762}
!761 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !759, file: !457, line: 947, type: !13)
!762 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !759, file: !457, line: 947, type: !13)
!763 = !DISubprogram(name: "PyNumber_Power", scope: !457, file: !457, line: 953, type: !143, isLocal: false, isDefinition: true, scopeLine: 954, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @PyNumber_Power, variables: !764)
!764 = !{!765, !766, !767}
!765 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !763, file: !457, line: 953, type: !13)
!766 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !763, file: !457, line: 953, type: !13)
!767 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 3, scope: !763, file: !457, line: 953, type: !13)
!768 = !DISubprogram(name: "PyNumber_InPlaceOr", scope: !457, file: !457, line: 1009, type: !134, isLocal: false, isDefinition: true, scopeLine: 1009, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_InPlaceOr, variables: !769)
!769 = !{!770, !771}
!770 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !768, file: !457, line: 1009, type: !13)
!771 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !768, file: !457, line: 1009, type: !13)
!772 = !DISubprogram(name: "PyNumber_InPlaceXor", scope: !457, file: !457, line: 1010, type: !134, isLocal: false, isDefinition: true, scopeLine: 1010, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_InPlaceXor, variables: !773)
!773 = !{!774, !775}
!774 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !772, file: !457, line: 1010, type: !13)
!775 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !772, file: !457, line: 1010, type: !13)
!776 = !DISubprogram(name: "PyNumber_InPlaceAnd", scope: !457, file: !457, line: 1011, type: !134, isLocal: false, isDefinition: true, scopeLine: 1011, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_InPlaceAnd, variables: !777)
!777 = !{!778, !779}
!778 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !776, file: !457, line: 1011, type: !13)
!779 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !776, file: !457, line: 1011, type: !13)
!780 = !DISubprogram(name: "PyNumber_InPlaceLshift", scope: !457, file: !457, line: 1012, type: !134, isLocal: false, isDefinition: true, scopeLine: 1012, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_InPlaceLshift, variables: !781)
!781 = !{!782, !783}
!782 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !780, file: !457, line: 1012, type: !13)
!783 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !780, file: !457, line: 1012, type: !13)
!784 = !DISubprogram(name: "PyNumber_InPlaceRshift", scope: !457, file: !457, line: 1013, type: !134, isLocal: false, isDefinition: true, scopeLine: 1013, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_InPlaceRshift, variables: !785)
!785 = !{!786, !787}
!786 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !784, file: !457, line: 1013, type: !13)
!787 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !784, file: !457, line: 1013, type: !13)
!788 = !DISubprogram(name: "PyNumber_InPlaceSubtract", scope: !457, file: !457, line: 1014, type: !134, isLocal: false, isDefinition: true, scopeLine: 1014, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_InPlaceSubtract, variables: !789)
!789 = !{!790, !791}
!790 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !788, file: !457, line: 1014, type: !13)
!791 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !788, file: !457, line: 1014, type: !13)
!792 = !DISubprogram(name: "PyNumber_InPlaceFloorDivide", scope: !457, file: !457, line: 1017, type: !134, isLocal: false, isDefinition: true, scopeLine: 1018, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_InPlaceFloorDivide, variables: !793)
!793 = !{!794, !795}
!794 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !792, file: !457, line: 1017, type: !13)
!795 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !792, file: !457, line: 1017, type: !13)
!796 = !DISubprogram(name: "PyNumber_InPlaceTrueDivide", scope: !457, file: !457, line: 1024, type: !134, isLocal: false, isDefinition: true, scopeLine: 1025, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_InPlaceTrueDivide, variables: !797)
!797 = !{!798, !799}
!798 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !796, file: !457, line: 1024, type: !13)
!799 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !796, file: !457, line: 1024, type: !13)
!800 = !DISubprogram(name: "PyNumber_InPlaceAdd", scope: !457, file: !457, line: 1031, type: !134, isLocal: false, isDefinition: true, scopeLine: 1032, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_InPlaceAdd, variables: !801)
!801 = !{!802, !803, !804, !805, !808, !810}
!802 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !800, file: !457, line: 1031, type: !13)
!803 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !800, file: !457, line: 1031, type: !13)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !800, file: !457, line: 1033, type: !13)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !806, file: !457, line: 1036, type: !179)
!806 = distinct !DILexicalBlock(scope: !807, file: !457, line: 1035, column: 48)
!807 = distinct !DILexicalBlock(scope: !800, file: !457, line: 1035, column: 9)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !809, file: !457, line: 1037, type: !13)
!809 = distinct !DILexicalBlock(scope: !806, file: !457, line: 1037, column: 12)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !811, file: !457, line: 1039, type: !132)
!811 = distinct !DILexicalBlock(scope: !812, file: !457, line: 1038, column: 30)
!812 = distinct !DILexicalBlock(scope: !806, file: !457, line: 1038, column: 13)
!813 = !DISubprogram(name: "PyNumber_InPlaceMultiply", scope: !457, file: !457, line: 1052, type: !134, isLocal: false, isDefinition: true, scopeLine: 1053, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_InPlaceMultiply, variables: !814)
!814 = !{!815, !816, !817, !818, !821, !822, !823}
!815 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !813, file: !457, line: 1052, type: !13)
!816 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !813, file: !457, line: 1052, type: !13)
!817 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !813, file: !457, line: 1054, type: !13)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !819, file: !457, line: 1057, type: !190)
!819 = distinct !DILexicalBlock(scope: !820, file: !457, line: 1056, column: 48)
!820 = distinct !DILexicalBlock(scope: !813, file: !457, line: 1056, column: 9)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mv", scope: !819, file: !457, line: 1058, type: !179)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mw", scope: !819, file: !457, line: 1059, type: !179)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !824, file: !457, line: 1060, type: !13)
!824 = distinct !DILexicalBlock(scope: !819, file: !457, line: 1060, column: 12)
!825 = !DISubprogram(name: "PyNumber_InPlaceRemainder", scope: !457, file: !457, line: 1081, type: !134, isLocal: false, isDefinition: true, scopeLine: 1082, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyNumber_InPlaceRemainder, variables: !826)
!826 = !{!827, !828}
!827 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !825, file: !457, line: 1081, type: !13)
!828 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !825, file: !457, line: 1081, type: !13)
!829 = !DISubprogram(name: "PyNumber_InPlacePower", scope: !457, file: !457, line: 1088, type: !143, isLocal: false, isDefinition: true, scopeLine: 1089, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @PyNumber_InPlacePower, variables: !830)
!830 = !{!831, !832, !833}
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !829, file: !457, line: 1088, type: !13)
!832 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !829, file: !457, line: 1088, type: !13)
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 3, scope: !829, file: !457, line: 1088, type: !13)
!834 = !DISubprogram(name: "PyNumber_Negative", scope: !457, file: !457, line: 1103, type: !124, isLocal: false, isDefinition: true, scopeLine: 1104, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyNumber_Negative, variables: !835)
!835 = !{!836, !837}
!836 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !834, file: !457, line: 1103, type: !13)
!837 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !834, file: !457, line: 1105, type: !127)
!838 = !DISubprogram(name: "PyNumber_Positive", scope: !457, file: !457, line: 1117, type: !124, isLocal: false, isDefinition: true, scopeLine: 1118, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyNumber_Positive, variables: !839)
!839 = !{!840, !841}
!840 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !838, file: !457, line: 1117, type: !13)
!841 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !838, file: !457, line: 1119, type: !127)
!842 = !DISubprogram(name: "PyNumber_Invert", scope: !457, file: !457, line: 1131, type: !124, isLocal: false, isDefinition: true, scopeLine: 1132, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyNumber_Invert, variables: !843)
!843 = !{!844, !845}
!844 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !842, file: !457, line: 1131, type: !13)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !842, file: !457, line: 1133, type: !127)
!846 = !DISubprogram(name: "PyNumber_Absolute", scope: !457, file: !457, line: 1145, type: !124, isLocal: false, isDefinition: true, scopeLine: 1146, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyNumber_Absolute, variables: !847)
!847 = !{!848, !849}
!848 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !846, file: !457, line: 1145, type: !13)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !846, file: !457, line: 1147, type: !127)
!850 = !DISubprogram(name: "PyNumber_Index", scope: !457, file: !457, line: 1163, type: !124, isLocal: false, isDefinition: true, scopeLine: 1164, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyNumber_Index, variables: !851)
!851 = !{!852, !853, !854, !858}
!852 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 1, scope: !850, file: !457, line: 1163, type: !13)
!853 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !850, file: !457, line: 1165, type: !13)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !855, file: !457, line: 1185, type: !13)
!855 = distinct !DILexicalBlock(scope: !856, file: !457, line: 1185, column: 12)
!856 = distinct !DILexicalBlock(scope: !857, file: !457, line: 1181, column: 81)
!857 = distinct !DILexicalBlock(scope: !850, file: !457, line: 1181, column: 9)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !859, file: !457, line: 1194, type: !13)
!859 = distinct !DILexicalBlock(scope: !860, file: !457, line: 1194, column: 12)
!860 = distinct !DILexicalBlock(scope: !861, file: !457, line: 1193, column: 40)
!861 = distinct !DILexicalBlock(scope: !850, file: !457, line: 1189, column: 9)
!862 = !DISubprogram(name: "PyNumber_AsSsize_t", scope: !457, file: !457, line: 1203, type: !863, isLocal: false, isDefinition: true, scopeLine: 1204, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*, %struct._object*)* @PyNumber_AsSsize_t, variables: !865)
!863 = !DISubroutineType(types: !864)
!864 = !{!19, !13, !13}
!865 = !{!866, !867, !868, !869, !870, !871}
!866 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 1, scope: !862, file: !457, line: 1203, type: !13)
!867 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "err", arg: 2, scope: !862, file: !457, line: 1203, type: !13)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !862, file: !457, line: 1205, type: !19)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "runerr", scope: !862, file: !457, line: 1206, type: !13)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !862, file: !457, line: 1207, type: !13)
