; ModuleID = 'irs-onlybc/acceler.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.grammar = type { i32, %struct.dfa*, %struct.labellist, i32, i32 }
%struct.dfa = type { i32, i8*, i32, i32, %struct.state*, i8* }
%struct.state = type { i32, %struct.arc*, i32, i32, i32*, i32 }
%struct.arc = type { i16, i16 }
%struct.labellist = type { i32, %struct.label* }
%struct.label = type { i32, i8* }

@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [37 x i8] c"no mem to build parser accelerators\0A\00", align 1
@.str.1 = private unnamed_addr constant [22 x i8] c"XXX too many states!\0A\00", align 1
@.str.2 = private unnamed_addr constant [34 x i8] c"XXX too high nonterminal number!\0A\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"XXX ambiguity!\0A\00", align 1
@.str.4 = private unnamed_addr constant [35 x i8] c"no mem to add parser accelerators\0A\00", align 1

; Function Attrs: nounwind uwtable
define void @PyGrammar_AddAccelerators(%struct.grammar* %g) #0 {
entry:
  %g.addr = alloca %struct.grammar*, align 8
  %d = alloca %struct.dfa*, align 8
  %i = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !7)
!1 = !DIFile(filename: "acceler.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !6}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!7 = !{!8, !68, !78, !86}
!8 = !DISubprogram(name: "PyGrammar_AddAccelerators", scope: !9, file: !9, line: 24, type: !10, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.grammar*)* @PyGrammar_AddAccelerators, variables: !64)
!9 = !DIFile(filename: "Parser/acceler.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!10 = !DISubroutineType(types: !11)
!11 = !{null, !12}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "grammar", file: !14, line: 67, baseType: !15)
!14 = !DIFile(filename: "Include/grammar.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 61, size: 320, align: 64, elements: !16)
!16 = !{!17, !18, !50, !62, !63}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "g_ndfas", scope: !15, file: !14, line: 62, baseType: !5, size: 32, align: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "g_dfa", scope: !15, file: !14, line: 63, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "dfa", file: !14, line: 57, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 50, size: 320, align: 64, elements: !22)
!22 = !{!23, !24, !27, !28, !29, !47}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !21, file: !14, line: 51, baseType: !5, size: 32, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !21, file: !14, line: 52, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "d_initial", scope: !21, file: !14, line: 53, baseType: !5, size: 32, align: 32, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "d_nstates", scope: !21, file: !14, line: 54, baseType: !5, size: 32, align: 32, offset: 160)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "d_state", scope: !21, file: !14, line: 55, baseType: !30, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "state", file: !14, line: 46, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 37, size: 320, align: 64, elements: !33)
!33 = !{!34, !35, !43, !44, !45, !46}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "s_narcs", scope: !32, file: !14, line: 38, baseType: !5, size: 32, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "s_arc", scope: !32, file: !14, line: 39, baseType: !36, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc", file: !14, line: 33, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 30, size: 32, align: 16, elements: !39)
!39 = !{!40, !42}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "a_lbl", scope: !38, file: !14, line: 31, baseType: !41, size: 16, align: 16)
!41 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "a_arrow", scope: !38, file: !14, line: 32, baseType: !41, size: 16, align: 16, offset: 16)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "s_lower", scope: !32, file: !14, line: 42, baseType: !5, size: 32, align: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "s_upper", scope: !32, file: !14, line: 43, baseType: !5, size: 32, align: 32, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "s_accel", scope: !32, file: !14, line: 44, baseType: !4, size: 64, align: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "s_accept", scope: !32, file: !14, line: 45, baseType: !5, size: 32, align: 32, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "d_first", scope: !21, file: !14, line: 56, baseType: !48, size: 64, align: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitset", file: !49, line: 12, baseType: !25)
!49 = !DIFile(filename: "Include/bitset.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!50 = !DIDerivedType(tag: DW_TAG_member, name: "g_ll", scope: !15, file: !14, line: 64, baseType: !51, size: 128, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "labellist", file: !14, line: 26, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 23, size: 128, align: 64, elements: !53)
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ll_nlabels", scope: !52, file: !14, line: 24, baseType: !5, size: 32, align: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ll_label", scope: !52, file: !14, line: 25, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "label", file: !14, line: 17, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 14, size: 128, align: 64, elements: !59)
!59 = !{!60, !61}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !58, file: !14, line: 15, baseType: !5, size: 32, align: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "lb_str", scope: !58, file: !14, line: 16, baseType: !25, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "g_start", scope: !15, file: !14, line: 65, baseType: !5, size: 32, align: 32, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "g_accel", scope: !15, file: !14, line: 66, baseType: !5, size: 32, align: 32, offset: 288)
!64 = !{!65, !66, !67}
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !8, file: !9, line: 24, type: !12)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !8, file: !9, line: 26, type: !19)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !8, file: !9, line: 27, type: !5)
!68 = !DISubprogram(name: "PyGrammar_RemoveAccelerators", scope: !9, file: !9, line: 35, type: !10, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.grammar*)* @PyGrammar_RemoveAccelerators, variables: !69)
!69 = !{!70, !71, !72, !73, !77}
!70 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !68, file: !9, line: 35, type: !12)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !68, file: !9, line: 37, type: !19)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !68, file: !9, line: 38, type: !5)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !74, file: !9, line: 42, type: !30)
!74 = distinct !DILexicalBlock(scope: !75, file: !9, line: 41, column: 41)
!75 = distinct !DILexicalBlock(scope: !76, file: !9, line: 41, column: 5)
!76 = distinct !DILexicalBlock(scope: !68, file: !9, line: 41, column: 5)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !74, file: !9, line: 43, type: !5)
!78 = !DISubprogram(name: "fixdfa", scope: !9, file: !9, line: 54, type: !79, isLocal: true, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.grammar*, %struct.dfa*)* @fixdfa, variables: !81)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !12, !19}
!81 = !{!82, !83, !84, !85}
!82 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !78, file: !9, line: 54, type: !12)
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 2, scope: !78, file: !9, line: 54, type: !19)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !78, file: !9, line: 56, type: !30)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !78, file: !9, line: 57, type: !5)
!86 = !DISubprogram(name: "fixstate", scope: !9, file: !9, line: 64, type: !87, isLocal: true, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.grammar*, %struct.state*)* @fixstate, variables: !89)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !12, !30}
!89 = !{!90, !91, !92, !93, !94, !95, !96, !100, !101, !102, !105, !106}
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !86, file: !9, line: 64, type: !12)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 2, scope: !86, file: !9, line: 64, type: !30)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !86, file: !9, line: 66, type: !36)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !86, file: !9, line: 67, type: !5)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "accel", scope: !86, file: !9, line: 68, type: !4)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nl", scope: !86, file: !9, line: 69, type: !5)
!96 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lbl", scope: !97, file: !9, line: 80, type: !5)
!97 = distinct !DILexicalBlock(scope: !98, file: !9, line: 79, column: 41)
!98 = distinct !DILexicalBlock(scope: !99, file: !9, line: 79, column: 5)
!99 = distinct !DILexicalBlock(scope: !86, file: !9, line: 79, column: 5)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !97, file: !9, line: 81, type: !56)
!101 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !97, file: !9, line: 82, type: !5)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d1", scope: !103, file: !9, line: 88, type: !19)
