; ModuleID = 'irs-onlybc/arraymodule.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !29, subprograms: !483, globals: !1427)
!1 = !DIFile(filename: "arraymodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "machine_format_code", file: !4, line: 1624, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/arraymodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!6 = !DIEnumerator(name: "UNKNOWN_FORMAT", value: -1)
!7 = !DIEnumerator(name: "UNSIGNED_INT8", value: 0)
!8 = !DIEnumerator(name: "SIGNED_INT8", value: 1)
!9 = !DIEnumerator(name: "UNSIGNED_INT16_LE", value: 2)
!10 = !DIEnumerator(name: "UNSIGNED_INT16_BE", value: 3)
!11 = !DIEnumerator(name: "SIGNED_INT16_LE", value: 4)
!12 = !DIEnumerator(name: "SIGNED_INT16_BE", value: 5)
!13 = !DIEnumerator(name: "UNSIGNED_INT32_LE", value: 6)
!14 = !DIEnumerator(name: "UNSIGNED_INT32_BE", value: 7)
!15 = !DIEnumerator(name: "SIGNED_INT32_LE", value: 8)
!16 = !DIEnumerator(name: "SIGNED_INT32_BE", value: 9)
!17 = !DIEnumerator(name: "UNSIGNED_INT64_LE", value: 10)
!18 = !DIEnumerator(name: "UNSIGNED_INT64_BE", value: 11)
!19 = !DIEnumerator(name: "SIGNED_INT64_LE", value: 12)
!20 = !DIEnumerator(name: "SIGNED_INT64_BE", value: 13)
!21 = !DIEnumerator(name: "IEEE_754_FLOAT_LE", value: 14)
!22 = !DIEnumerator(name: "IEEE_754_FLOAT_BE", value: 15)
!23 = !DIEnumerator(name: "IEEE_754_DOUBLE_LE", value: 16)
!24 = !DIEnumerator(name: "IEEE_754_DOUBLE_BE", value: 17)
!25 = !DIEnumerator(name: "UTF16_LE", value: 18)
!26 = !DIEnumerator(name: "UTF16_BE", value: 19)
!27 = !DIEnumerator(name: "UTF32_LE", value: 20)
!28 = !DIEnumerator(name: "UTF32_BE", value: 21)
!29 = !{!30, !115, !56, !376, !69, !377, !381, !36, !120, !77, !408, !416, !42, !424, !441, !449, !451, !459, !468, !470, !469, !471, !122, !472, !374, !473, !474, !475, !477, !478, !479, !480, !482}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !32, line: 109, baseType: !33)
!32 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !32, line: 105, size: 128, align: 64, elements: !34)
!34 = !{!35, !43}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !33, file: !32, line: 107, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !37, line: 177, baseType: !38)
!37 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !39, line: 102, baseType: !40)
!39 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !41, line: 181, baseType: !42)
!41 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!42 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !33, file: !32, line: 108, baseType: !44, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !32, line: 334, size: 3200, align: 64, elements: !46)
!46 = !{!47, !53, !57, !58, !59, !64, !128, !133, !138, !139, !144, !196, !227, !239, !245, !246, !247, !249, !251, !282, !283, !284, !293, !294, !299, !300, !302, !304, !314, !324, !342, !343, !344, !346, !348, !349, !351, !356, !361, !366, !367, !368, !369, !370, !371, !372, !373, !375}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !45, file: !32, line: 335, baseType: !48, size: 192, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !32, line: 114, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 111, size: 192, align: 64, elements: !50)
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !49, file: !32, line: 112, baseType: !31, size: 128, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !49, file: !32, line: 113, baseType: !36, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !45, file: !32, line: 336, baseType: !54, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!56 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !45, file: !32, line: 337, baseType: !36, size: 64, align: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !45, file: !32, line: 337, baseType: !36, size: 64, align: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !45, file: !32, line: 341, baseType: !60, size: 64, align: 64, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !32, line: 308, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !30}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !45, file: !32, line: 342, baseType: !65, size: 64, align: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !32, line: 314, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !30, !70, !69}
!69 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !39, line: 48, baseType: !72)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !73, line: 246, size: 1728, align: 64, elements: !74)
!73 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!74 = !{!75, !76, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !96, !97, !98, !99, !101, !103, !105, !109, !112, !114, !116, !117, !118, !119, !123, !124}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !72, file: !73, line: 247, baseType: !69, size: 32, align: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !72, file: !73, line: 252, baseType: !77, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !72, file: !73, line: 253, baseType: !77, size: 64, align: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !72, file: !73, line: 254, baseType: !77, size: 64, align: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !72, file: !73, line: 255, baseType: !77, size: 64, align: 64, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !72, file: !73, line: 256, baseType: !77, size: 64, align: 64, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !72, file: !73, line: 257, baseType: !77, size: 64, align: 64, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !72, file: !73, line: 258, baseType: !77, size: 64, align: 64, offset: 448)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !72, file: !73, line: 259, baseType: !77, size: 64, align: 64, offset: 512)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !72, file: !73, line: 261, baseType: !77, size: 64, align: 64, offset: 576)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !72, file: !73, line: 262, baseType: !77, size: 64, align: 64, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !72, file: !73, line: 263, baseType: !77, size: 64, align: 64, offset: 704)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !72, file: !73, line: 265, baseType: !89, size: 64, align: 64, offset: 768)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !73, line: 161, size: 192, align: 64, elements: !91)
!91 = !{!92, !93, !95}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !90, file: !73, line: 162, baseType: !89, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !90, file: !73, line: 163, baseType: !94, size: 64, align: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !90, file: !73, line: 167, baseType: !69, size: 32, align: 32, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !72, file: !73, line: 267, baseType: !94, size: 64, align: 64, offset: 832)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !72, file: !73, line: 269, baseType: !69, size: 32, align: 32, offset: 896)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !72, file: !73, line: 273, baseType: !69, size: 32, align: 32, offset: 928)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !72, file: !73, line: 275, baseType: !100, size: 64, align: 64, offset: 960)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !41, line: 140, baseType: !42)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !72, file: !73, line: 279, baseType: !102, size: 16, align: 16, offset: 1024)
!102 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !72, file: !73, line: 280, baseType: !104, size: 8, align: 8, offset: 1040)
!104 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !72, file: !73, line: 281, baseType: !106, size: 8, align: 8, offset: 1048)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 1)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !72, file: !73, line: 285, baseType: !110, size: 64, align: 64, offset: 1088)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !73, line: 155, baseType: null)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !72, file: !73, line: 294, baseType: !113, size: 64, align: 64, offset: 1152)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !41, line: 141, baseType: !42)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !72, file: !73, line: 303, baseType: !115, size: 64, align: 64, offset: 1216)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !72, file: !73, line: 304, baseType: !115, size: 64, align: 64, offset: 1280)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !72, file: !73, line: 305, baseType: !115, size: 64, align: 64, offset: 1344)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !72, file: !73, line: 306, baseType: !115, size: 64, align: 64, offset: 1408)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !72, file: !73, line: 307, baseType: !120, size: 64, align: 64, offset: 1472)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !121, line: 62, baseType: !122)
!121 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!122 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !72, file: !73, line: 309, baseType: !69, size: 32, align: 32, offset: 1536)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !72, file: !73, line: 311, baseType: !125, size: 160, align: 8, offset: 1568)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 160, align: 8, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 20)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !45, file: !32, line: 343, baseType: !129, size: 64, align: 64, offset: 512)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !32, line: 316, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!30, !30, !77}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !45, file: !32, line: 344, baseType: !134, size: 64, align: 64, offset: 576)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !32, line: 318, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!69, !30, !77, !30}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !45, file: !32, line: 345, baseType: !115, size: 64, align: 64, offset: 640)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !45, file: !32, line: 346, baseType: !140, size: 64, align: 64, offset: 704)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !32, line: 320, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!30, !30}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !45, file: !32, line: 350, baseType: !145, size: 64, align: 64, offset: 768)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !32, line: 278, baseType: !147)
!147 = !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 236, size: 2176, align: 64, elements: !148)
!148 = !{!149, !154, !155, !156, !157, !158, !163, !165, !166, !167, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !147, file: !32, line: 241, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !32, line: 166, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!30, !30, !30}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !147, file: !32, line: 242, baseType: !150, size: 64, align: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !147, file: !32, line: 243, baseType: !150, size: 64, align: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !147, file: !32, line: 244, baseType: !150, size: 64, align: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !147, file: !32, line: 245, baseType: !150, size: 64, align: 64, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !147, file: !32, line: 246, baseType: !159, size: 64, align: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !32, line: 167, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!30, !30, !30, !30}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !147, file: !32, line: 247, baseType: !164, size: 64, align: 64, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !32, line: 165, baseType: !141)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !147, file: !32, line: 248, baseType: !164, size: 64, align: 64, offset: 448)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !147, file: !32, line: 249, baseType: !164, size: 64, align: 64, offset: 512)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !147, file: !32, line: 250, baseType: !168, size: 64, align: 64, offset: 576)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !32, line: 168, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!69, !30}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !147, file: !32, line: 251, baseType: !164, size: 64, align: 64, offset: 640)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !147, file: !32, line: 252, baseType: !150, size: 64, align: 64, offset: 704)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !147, file: !32, line: 253, baseType: !150, size: 64, align: 64, offset: 768)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !147, file: !32, line: 254, baseType: !150, size: 64, align: 64, offset: 832)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !147, file: !32, line: 255, baseType: !150, size: 64, align: 64, offset: 896)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !147, file: !32, line: 256, baseType: !150, size: 64, align: 64, offset: 960)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !147, file: !32, line: 257, baseType: !164, size: 64, align: 64, offset: 1024)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !147, file: !32, line: 258, baseType: !115, size: 64, align: 64, offset: 1088)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !147, file: !32, line: 259, baseType: !164, size: 64, align: 64, offset: 1152)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !147, file: !32, line: 261, baseType: !150, size: 64, align: 64, offset: 1216)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !147, file: !32, line: 262, baseType: !150, size: 64, align: 64, offset: 1280)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !147, file: !32, line: 263, baseType: !150, size: 64, align: 64, offset: 1344)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !147, file: !32, line: 264, baseType: !150, size: 64, align: 64, offset: 1408)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !147, file: !32, line: 265, baseType: !159, size: 64, align: 64, offset: 1472)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !147, file: !32, line: 266, baseType: !150, size: 64, align: 64, offset: 1536)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !147, file: !32, line: 267, baseType: !150, size: 64, align: 64, offset: 1600)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !147, file: !32, line: 268, baseType: !150, size: 64, align: 64, offset: 1664)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !147, file: !32, line: 269, baseType: !150, size: 64, align: 64, offset: 1728)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !147, file: !32, line: 270, baseType: !150, size: 64, align: 64, offset: 1792)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !147, file: !32, line: 272, baseType: !150, size: 64, align: 64, offset: 1856)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !147, file: !32, line: 273, baseType: !150, size: 64, align: 64, offset: 1920)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !147, file: !32, line: 274, baseType: !150, size: 64, align: 64, offset: 1984)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !147, file: !32, line: 275, baseType: !150, size: 64, align: 64, offset: 2048)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !147, file: !32, line: 277, baseType: !164, size: 64, align: 64, offset: 2112)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !45, file: !32, line: 351, baseType: !197, size: 64, align: 64, offset: 832)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !32, line: 292, baseType: !199)
!199 = !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 280, size: 640, align: 64, elements: !200)
!200 = !{!201, !206, !207, !212, !213, !214, !219, !220, !225, !226}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !199, file: !32, line: 281, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !32, line: 169, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!36, !30}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !199, file: !32, line: 282, baseType: !150, size: 64, align: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !199, file: !32, line: 283, baseType: !208, size: 64, align: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !32, line: 170, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!30, !30, !36}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !199, file: !32, line: 284, baseType: !208, size: 64, align: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !199, file: !32, line: 285, baseType: !115, size: 64, align: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !199, file: !32, line: 286, baseType: !215, size: 64, align: 64, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !32, line: 172, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!69, !30, !36, !30}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !199, file: !32, line: 287, baseType: !115, size: 64, align: 64, offset: 384)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !199, file: !32, line: 288, baseType: !221, size: 64, align: 64, offset: 448)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !32, line: 231, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!69, !30, !30}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !199, file: !32, line: 290, baseType: !150, size: 64, align: 64, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !199, file: !32, line: 291, baseType: !208, size: 64, align: 64, offset: 576)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !45, file: !32, line: 352, baseType: !228, size: 64, align: 64, offset: 896)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !32, line: 298, baseType: !230)
!230 = !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 294, size: 192, align: 64, elements: !231)
!231 = !{!232, !233, !234}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !230, file: !32, line: 295, baseType: !202, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !230, file: !32, line: 296, baseType: !150, size: 64, align: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !230, file: !32, line: 297, baseType: !235, size: 64, align: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !32, line: 174, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!69, !30, !30, !30}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !45, file: !32, line: 356, baseType: !240, size: 64, align: 64, offset: 960)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !32, line: 321, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!244, !30}
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !37, line: 186, baseType: !36)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !45, file: !32, line: 357, baseType: !159, size: 64, align: 64, offset: 1024)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !45, file: !32, line: 358, baseType: !140, size: 64, align: 64, offset: 1088)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !45, file: !32, line: 359, baseType: !248, size: 64, align: 64, offset: 1152)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !32, line: 317, baseType: !151)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !45, file: !32, line: 360, baseType: !250, size: 64, align: 64, offset: 1216)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !32, line: 319, baseType: !236)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !45, file: !32, line: 363, baseType: !252, size: 64, align: 64, offset: 1280)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !32, line: 304, baseType: !254)
!254 = !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 301, size: 128, align: 64, elements: !255)
!255 = !{!256, !277}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !254, file: !32, line: 302, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !32, line: 193, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!69, !30, !261, !69}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !32, line: 191, baseType: !263)
!263 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !32, line: 178, size: 640, align: 64, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272, !274, !275, !276}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !263, file: !32, line: 179, baseType: !115, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !263, file: !32, line: 180, baseType: !30, size: 64, align: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !263, file: !32, line: 181, baseType: !36, size: 64, align: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !263, file: !32, line: 182, baseType: !36, size: 64, align: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !263, file: !32, line: 184, baseType: !69, size: 32, align: 32, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !263, file: !32, line: 185, baseType: !69, size: 32, align: 32, offset: 288)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !263, file: !32, line: 186, baseType: !77, size: 64, align: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !263, file: !32, line: 187, baseType: !273, size: 64, align: 64, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !263, file: !32, line: 188, baseType: !273, size: 64, align: 64, offset: 448)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !263, file: !32, line: 189, baseType: !273, size: 64, align: 64, offset: 512)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !263, file: !32, line: 190, baseType: !115, size: 64, align: 64, offset: 576)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !254, file: !32, line: 303, baseType: !278, size: 64, align: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !32, line: 194, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{null, !30, !261}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !45, file: !32, line: 366, baseType: !122, size: 64, align: 64, offset: 1344)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !45, file: !32, line: 368, baseType: !54, size: 64, align: 64, offset: 1408)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !45, file: !32, line: 372, baseType: !285, size: 64, align: 64, offset: 1472)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !32, line: 233, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!69, !30, !289, !115}
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !32, line: 232, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!69, !30, !115}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !45, file: !32, line: 375, baseType: !168, size: 64, align: 64, offset: 1536)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !45, file: !32, line: 379, baseType: !295, size: 64, align: 64, offset: 1600)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !32, line: 322, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!30, !30, !30, !69}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !45, file: !32, line: 382, baseType: !36, size: 64, align: 64, offset: 1664)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !45, file: !32, line: 385, baseType: !301, size: 64, align: 64, offset: 1728)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !32, line: 323, baseType: !141)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !45, file: !32, line: 386, baseType: !303, size: 64, align: 64, offset: 1792)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !32, line: 324, baseType: !141)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !45, file: !32, line: 389, baseType: !305, size: 64, align: 64, offset: 1856)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !307, line: 40, size: 256, align: 64, elements: !308)
!307 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!308 = !{!309, !310, !312, !313}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !306, file: !307, line: 41, baseType: !54, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !306, file: !307, line: 42, baseType: !311, size: 64, align: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !307, line: 18, baseType: !151)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !306, file: !307, line: 43, baseType: !69, size: 32, align: 32, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !306, file: !307, line: 45, baseType: !54, size: 64, align: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !45, file: !32, line: 390, baseType: !315, size: 64, align: 64, offset: 1920)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !317, line: 18, size: 320, align: 64, elements: !318)
!317 = !DIFile(filename: "./Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!318 = !{!319, !320, !321, !322, !323}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !316, file: !317, line: 19, baseType: !77, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !316, file: !317, line: 20, baseType: !69, size: 32, align: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !316, file: !317, line: 21, baseType: !36, size: 64, align: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !316, file: !317, line: 22, baseType: !69, size: 32, align: 32, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !316, file: !317, line: 23, baseType: !77, size: 64, align: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !45, file: !32, line: 391, baseType: !325, size: 64, align: 64, offset: 1984)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !327, line: 11, size: 320, align: 64, elements: !328)
!327 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!328 = !{!329, !330, !335, !340, !341}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !326, file: !327, line: 12, baseType: !77, size: 64, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !326, file: !327, line: 13, baseType: !331, size: 64, align: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !327, line: 8, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!30, !30, !115}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !326, file: !327, line: 14, baseType: !336, size: 64, align: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !327, line: 9, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!69, !30, !30, !115}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !326, file: !327, line: 15, baseType: !77, size: 64, align: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !326, file: !327, line: 16, baseType: !115, size: 64, align: 64, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !45, file: !32, line: 392, baseType: !44, size: 64, align: 64, offset: 2048)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !45, file: !32, line: 393, baseType: !30, size: 64, align: 64, offset: 2112)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !45, file: !32, line: 394, baseType: !345, size: 64, align: 64, offset: 2176)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !32, line: 325, baseType: !160)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !45, file: !32, line: 395, baseType: !347, size: 64, align: 64, offset: 2240)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !32, line: 326, baseType: !236)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !45, file: !32, line: 396, baseType: !36, size: 64, align: 64, offset: 2304)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !45, file: !32, line: 397, baseType: !350, size: 64, align: 64, offset: 2368)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !32, line: 327, baseType: !236)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !45, file: !32, line: 398, baseType: !352, size: 64, align: 64, offset: 2432)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !32, line: 329, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!30, !44, !36}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !45, file: !32, line: 399, baseType: !357, size: 64, align: 64, offset: 2496)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !32, line: 328, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!30, !44, !30, !30}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !45, file: !32, line: 400, baseType: !362, size: 64, align: 64, offset: 2560)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !32, line: 307, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !115}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !45, file: !32, line: 401, baseType: !168, size: 64, align: 64, offset: 2624)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !45, file: !32, line: 402, baseType: !30, size: 64, align: 64, offset: 2688)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !45, file: !32, line: 403, baseType: !30, size: 64, align: 64, offset: 2752)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !45, file: !32, line: 404, baseType: !30, size: 64, align: 64, offset: 2816)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !45, file: !32, line: 405, baseType: !30, size: 64, align: 64, offset: 2880)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !45, file: !32, line: 406, baseType: !30, size: 64, align: 64, offset: 2944)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !45, file: !32, line: 407, baseType: !60, size: 64, align: 64, offset: 3008)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !45, file: !32, line: 410, baseType: !374, size: 32, align: 32, offset: 3072)
!374 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !45, file: !32, line: 412, baseType: !60, size: 64, align: 64, offset: 3136)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UNICODE", file: !379, line: 93, baseType: !380)
!379 = !DIFile(filename: "./Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !121, line: 90, baseType: !69)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "arrayobject", file: !4, line: 41, baseType: !383)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "arrayobject", file: !4, line: 34, size: 512, align: 64, elements: !384)
!384 = !{!385, !386, !387, !388, !406, !407}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !383, file: !4, line: 35, baseType: !48, size: 192, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !383, file: !4, line: 36, baseType: !77, size: 64, align: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !383, file: !4, line: 37, baseType: !36, size: 64, align: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ob_descr", scope: !383, file: !4, line: 38, baseType: !389, size: 64, align: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "arraydescr", file: !4, line: 24, size: 320, align: 64, elements: !391)
!391 = !{!392, !393, !394, !399, !403, !404, !405}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "typecode", scope: !390, file: !4, line: 25, baseType: !56, size: 8, align: 8)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !390, file: !4, line: 26, baseType: !69, size: 32, align: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "getitem", scope: !390, file: !4, line: 27, baseType: !395, size: 64, align: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!30, !398, !36}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "setitem", scope: !390, file: !4, line: 28, baseType: !400, size: 64, align: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!69, !398, !36, !30}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !390, file: !4, line: 29, baseType: !77, size: 64, align: 64, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "is_integer_type", scope: !390, file: !4, line: 30, baseType: !69, size: 32, align: 32, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "is_signed", scope: !390, file: !4, line: 31, baseType: !69, size: 32, align: 32, offset: 288)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !383, file: !4, line: 39, baseType: !30, size: 64, align: 64, offset: 384)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ob_exports", scope: !383, file: !4, line: 40, baseType: !69, size: 32, align: 32, offset: 448)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "arrayiterobject", file: !4, line: 2774, baseType: !410)
!410 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 2769, size: 320, align: 64, elements: !411)
!411 = !{!412, !413, !414, !415}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !410, file: !4, line: 2770, baseType: !31, size: 128, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !410, file: !4, line: 2771, baseType: !36, size: 64, align: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ao", scope: !410, file: !4, line: 2772, baseType: !381, size: 64, align: 64, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "getitem", scope: !410, file: !4, line: 2773, baseType: !395, size: 64, align: 64, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !418, line: 33, baseType: !419)
!418 = !DIFile(filename: "./Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!419 = !DICompositeType(tag: DW_TAG_structure_type, file: !418, line: 25, size: 256, align: 64, elements: !420)
!420 = !{!421, !422}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !419, file: !418, line: 26, baseType: !48, size: 192, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !419, file: !418, line: 27, baseType: !423, size: 64, align: 64, offset: 192)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 64, align: 64, elements: !107)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !379, line: 351, baseType: !426)
!426 = !DICompositeType(tag: DW_TAG_structure_type, file: !379, line: 217, size: 384, align: 64, elements: !427)
!427 = !{!428, !429, !430, !431, !439}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !426, file: !379, line: 291, baseType: !31, size: 128, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !426, file: !379, line: 292, baseType: !36, size: 64, align: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !426, file: !379, line: 293, baseType: !244, size: 64, align: 64, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !426, file: !379, line: 349, baseType: !432, size: 32, align: 32, offset: 256)
!432 = !DICompositeType(tag: DW_TAG_structure_type, scope: !426, file: !379, line: 294, size: 32, align: 32, elements: !433)
!433 = !{!434, !435, !436, !437, !438}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !432, file: !379, line: 303, baseType: !374, size: 2, align: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !432, file: !379, line: 331, baseType: !374, size: 3, align: 32, offset: 2)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !432, file: !379, line: 336, baseType: !374, size: 1, align: 32, offset: 5)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !432, file: !379, line: 340, baseType: !374, size: 1, align: 32, offset: 6)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !432, file: !379, line: 345, baseType: !374, size: 1, align: 32, offset: 7)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !426, file: !379, line: 350, baseType: !440, size: 64, align: 64, offset: 320)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !379, line: 363, baseType: !443)
!443 = !DICompositeType(tag: DW_TAG_structure_type, file: !379, line: 356, size: 576, align: 64, elements: !444)
!444 = !{!445, !446, !447, !448}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !443, file: !379, line: 357, baseType: !425, size: 384, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !443, file: !379, line: 358, baseType: !36, size: 64, align: 64, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !443, file: !379, line: 360, baseType: !77, size: 64, align: 64, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !443, file: !379, line: 361, baseType: !36, size: 64, align: 64, offset: 512)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !453, line: 41, baseType: !454)
!453 = !DIFile(filename: "./Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!454 = !DICompositeType(tag: DW_TAG_structure_type, file: !453, line: 31, size: 320, align: 64, elements: !455)
!455 = !{!456, !457, !458}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !454, file: !453, line: 32, baseType: !48, size: 192, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !454, file: !453, line: 33, baseType: !244, size: 64, align: 64, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !454, file: !453, line: 34, baseType: !106, size: 8, align: 8, offset: 256)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !461, line: 40, baseType: !462)
!461 = !DIFile(filename: "./Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!462 = !DICompositeType(tag: DW_TAG_structure_type, file: !461, line: 23, size: 320, align: 64, elements: !463)
!463 = !{!464, !465, !467}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !462, file: !461, line: 24, baseType: !48, size: 192, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !462, file: !461, line: 26, baseType: !466, size: 64, align: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !462, file: !461, line: 39, baseType: !36, size: 64, align: 64, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!476 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!479 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!483 = !{!484, !501, !506, !517, !524, !536, !541, !546, !552, !569, !584, !588, !595, !614, !622, !630, !644, !648, !655, !672, !679, !687, !709, !746, !753, !759, !799, !803, !807, !814, !828, !851, !855, !868, !872, !895, !908, !913, !924, !929, !939, !951, !957, !967, !999, !1017, !1029, !1040, !1059, !1063, !1067, !1072, !1079, !1083, !1166, !1171, !1181, !1192, !1197, !1200, !1207, !1273, !1285, !1290, !1296, !1301, !1307, !1311, !1318, !1322, !1328, !1332, !1338, !1342, !1348, !1352, !1361, !1365, !1371, !1375, !1384, !1388, !1394, !1398, !1407, !1411, !1417, !1421}
!484 = !DISubprogram(name: "PyInit_array", scope: !4, file: !4, line: 2912, type: !485, isLocal: false, isDefinition: true, scopeLine: 2913, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_array, variables: !487)
!485 = !DISubroutineType(types: !486)
!486 = !{!30}
!487 = !{!488, !489, !493, !494, !495, !496, !497}
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !484, file: !4, line: 2914, type: !30)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !484, file: !4, line: 2915, type: !490)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 112, align: 8, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 14)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !484, file: !4, line: 2915, type: !77)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typecodes", scope: !484, file: !4, line: 2916, type: !30)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !484, file: !4, line: 2917, type: !36)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "descr", scope: !484, file: !4, line: 2918, type: !389)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !498, file: !4, line: 2945, type: !30)
!498 = distinct !DILexicalBlock(scope: !499, file: !4, line: 2945, column: 12)
!499 = distinct !DILexicalBlock(scope: !500, file: !4, line: 2944, column: 27)
!500 = distinct !DILexicalBlock(scope: !484, file: !4, line: 2944, column: 9)
!501 = !DISubprogram(name: "array_dealloc", scope: !4, file: !4, line: 556, type: !502, isLocal: true, isDefinition: true, scopeLine: 557, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.arrayobject*)* @array_dealloc, variables: !504)
!502 = !DISubroutineType(types: !503)
!503 = !{null, !381}
!504 = !{!505}
!505 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !501, file: !4, line: 556, type: !381)
!506 = !DISubprogram(name: "array_repr", scope: !4, file: !4, line: 2198, type: !507, isLocal: true, isDefinition: true, scopeLine: 2199, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*)* @array_repr, variables: !509)
!507 = !DISubroutineType(types: !508)
!508 = !{!30, !381}
!509 = !{!510, !511, !512, !513, !514, !515}
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !506, file: !4, line: 2198, type: !381)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typecode", scope: !506, file: !4, line: 2200, type: !56)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !506, file: !4, line: 2201, type: !30)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !506, file: !4, line: 2201, type: !30)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !506, file: !4, line: 2202, type: !36)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !516, file: !4, line: 2218, type: !30)
!516 = distinct !DILexicalBlock(scope: !506, file: !4, line: 2218, column: 8)
!517 = !DISubprogram(name: "array_tounicode", scope: !4, file: !4, line: 1587, type: !518, isLocal: true, isDefinition: true, scopeLine: 1588, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*, %struct._object*)* @array_tounicode, variables: !520)
!518 = !DISubroutineType(types: !519)
!519 = !{!30, !381, !30}
!520 = !{!521, !522, !523}
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !517, file: !4, line: 1587, type: !381)
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !517, file: !4, line: 1587, type: !30)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typecode", scope: !517, file: !4, line: 1589, type: !56)
!524 = !DISubprogram(name: "array_tolist", scope: !4, file: !4, line: 1411, type: !518, isLocal: true, isDefinition: true, scopeLine: 1412, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*, %struct._object*)* @array_tolist, variables: !525)
!525 = !{!526, !527, !528, !529, !530, !534}
!526 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !524, file: !4, line: 1411, type: !381)
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !524, file: !4, line: 1411, type: !30)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !524, file: !4, line: 1413, type: !30)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !524, file: !4, line: 1414, type: !36)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !531, file: !4, line: 1419, type: !30)
!531 = distinct !DILexicalBlock(scope: !532, file: !4, line: 1418, column: 61)
!532 = distinct !DILexicalBlock(scope: !533, file: !4, line: 1418, column: 5)
!533 = distinct !DILexicalBlock(scope: !524, file: !4, line: 1418, column: 5)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !535, file: !4, line: 1428, type: !30)
!535 = distinct !DILexicalBlock(scope: !524, file: !4, line: 1428, column: 8)
!536 = !DISubprogram(name: "getarrayitem", scope: !4, file: !4, line: 514, type: !210, isLocal: true, isDefinition: true, scopeLine: 515, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i64)* @getarrayitem, variables: !537)
!537 = !{!538, !539, !540}
!538 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !536, file: !4, line: 514, type: !30)
!539 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !536, file: !4, line: 514, type: !36)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ap", scope: !536, file: !4, line: 516, type: !381)
!541 = !DISubprogram(name: "array_length", scope: !4, file: !4, line: 650, type: !542, isLocal: true, isDefinition: true, scopeLine: 651, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.arrayobject*)* @array_length, variables: !544)
!542 = !DISubroutineType(types: !543)
!543 = !{!36, !381}
!544 = !{!545}
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !541, file: !4, line: 650, type: !381)
!546 = !DISubprogram(name: "array_concat", scope: !4, file: !4, line: 699, type: !518, isLocal: true, isDefinition: true, scopeLine: 700, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*, %struct._object*)* @array_concat, variables: !547)
!547 = !{!548, !549, !550, !551}
!548 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !546, file: !4, line: 699, type: !381)
!549 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bb", arg: 2, scope: !546, file: !4, line: 699, type: !30)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !546, file: !4, line: 701, type: !36)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "np", scope: !546, file: !4, line: 702, type: !381)
!552 = !DISubprogram(name: "newarrayobject", scope: !4, file: !4, line: 476, type: !553, isLocal: true, isDefinition: true, scopeLine: 477, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, i64, %struct.arraydescr*)* @newarrayobject, variables: !557)
!553 = !DISubroutineType(types: !554)
!554 = !{!30, !555, !36, !389}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !32, line: 422, baseType: !45)
!557 = !{!558, !559, !560, !561, !562, !563}
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !552, file: !4, line: 476, type: !555)
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !552, file: !4, line: 476, type: !36)
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 3, scope: !552, file: !4, line: 476, type: !389)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !552, file: !4, line: 478, type: !381)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes", scope: !552, file: !4, line: 479, type: !120)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !564, file: !4, line: 505, type: !30)
!564 = distinct !DILexicalBlock(scope: !565, file: !4, line: 505, column: 16)
!565 = distinct !DILexicalBlock(scope: !566, file: !4, line: 504, column: 40)
!566 = distinct !DILexicalBlock(scope: !567, file: !4, line: 504, column: 13)
!567 = distinct !DILexicalBlock(scope: !568, file: !4, line: 502, column: 10)
!568 = distinct !DILexicalBlock(scope: !552, file: !4, line: 499, column: 9)
!569 = !DISubprogram(name: "array_repeat", scope: !4, file: !4, line: 730, type: !570, isLocal: true, isDefinition: true, scopeLine: 731, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*, i64)* @array_repeat, variables: !572)
!570 = !DISubroutineType(types: !571)
!571 = !{!30, !381, !36}
!572 = !{!573, !574, !575, !576, !577, !578, !579, !582}
!573 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !569, file: !4, line: 730, type: !381)
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !569, file: !4, line: 730, type: !36)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !569, file: !4, line: 732, type: !36)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "np", scope: !569, file: !4, line: 733, type: !381)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldbytes", scope: !569, file: !4, line: 734, type: !36)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newbytes", scope: !569, file: !4, line: 734, type: !36)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "done", scope: !580, file: !4, line: 752, type: !36)
!580 = distinct !DILexicalBlock(scope: !581, file: !4, line: 751, column: 12)
!581 = distinct !DILexicalBlock(scope: !569, file: !4, line: 749, column: 9)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncopy", scope: !583, file: !4, line: 755, type: !36)
!583 = distinct !DILexicalBlock(scope: !580, file: !4, line: 754, column: 33)
!584 = !DISubprogram(name: "array_item", scope: !4, file: !4, line: 656, type: !570, isLocal: true, isDefinition: true, scopeLine: 657, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*, i64)* @array_item, variables: !585)
!585 = !{!586, !587}
!586 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !584, file: !4, line: 656, type: !381)
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !584, file: !4, line: 656, type: !36)
!588 = !DISubprogram(name: "array_ass_item", scope: !4, file: !4, line: 837, type: !589, isLocal: true, isDefinition: true, scopeLine: 838, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.arrayobject*, i64, %struct._object*)* @array_ass_item, variables: !591)
!589 = !DISubroutineType(types: !590)
!590 = !{!69, !381, !36, !30}
!591 = !{!592, !593, !594}
!592 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !588, file: !4, line: 837, type: !381)
!593 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !588, file: !4, line: 837, type: !36)
!594 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 3, scope: !588, file: !4, line: 837, type: !30)
!595 = !DISubprogram(name: "array_ass_slice", scope: !4, file: !4, line: 764, type: !596, isLocal: true, isDefinition: true, scopeLine: 765, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.arrayobject*, i64, i64, %struct._object*)* @array_ass_slice, variables: !598)
!596 = !DISubroutineType(types: !597)
!597 = !{!69, !381, !36, !36, !30}
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606, !612}
!599 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !595, file: !4, line: 764, type: !381)
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ilow", arg: 2, scope: !595, file: !4, line: 764, type: !36)
!601 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ihigh", arg: 3, scope: !595, file: !4, line: 764, type: !36)
!602 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 4, scope: !595, file: !4, line: 764, type: !30)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !595, file: !4, line: 766, type: !77)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !595, file: !4, line: 767, type: !36)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !595, file: !4, line: 768, type: !36)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !607, file: !4, line: 776, type: !69)
!607 = distinct !DILexicalBlock(scope: !608, file: !4, line: 774, column: 38)
!608 = distinct !DILexicalBlock(scope: !609, file: !4, line: 774, column: 13)
!609 = distinct !DILexicalBlock(scope: !610, file: !4, line: 772, column: 124)
!610 = distinct !DILexicalBlock(scope: !611, file: !4, line: 772, column: 14)
!611 = distinct !DILexicalBlock(scope: !595, file: !4, line: 770, column: 9)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !613, file: !4, line: 781, type: !30)
!613 = distinct !DILexicalBlock(scope: !607, file: !4, line: 781, column: 16)
!614 = !DISubprogram(name: "array_slice", scope: !4, file: !4, line: 666, type: !615, isLocal: true, isDefinition: true, scopeLine: 667, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*, i64, i64)* @array_slice, variables: !617)
!615 = !DISubroutineType(types: !616)
!616 = !{!30, !381, !36, !36}
!617 = !{!618, !619, !620, !621}
!618 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !614, file: !4, line: 666, type: !381)
!619 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ilow", arg: 2, scope: !614, file: !4, line: 666, type: !36)
!620 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ihigh", arg: 3, scope: !614, file: !4, line: 666, type: !36)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "np", scope: !614, file: !4, line: 668, type: !381)
!622 = !DISubprogram(name: "array_resize", scope: !4, file: !4, line: 49, type: !623, isLocal: true, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.arrayobject*, i64)* @array_resize, variables: !625)
!623 = !DISubroutineType(types: !624)
!624 = !{!69, !381, !36}
!625 = !{!626, !627, !628, !629}
!626 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !622, file: !4, line: 49, type: !381)
!627 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newsize", arg: 2, scope: !622, file: !4, line: 49, type: !36)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "items", scope: !622, file: !4, line: 51, type: !77)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_new_size", scope: !622, file: !4, line: 52, type: !120)
!630 = !DISubprogram(name: "array_contains", scope: !4, file: !4, line: 1022, type: !631, isLocal: true, isDefinition: true, scopeLine: 1023, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.arrayobject*, %struct._object*)* @array_contains, variables: !633)
!631 = !DISubroutineType(types: !632)
!632 = !{!69, !381, !30}
!633 = !{!634, !635, !636, !637, !638, !642}
!634 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !630, file: !4, line: 1022, type: !381)
!635 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !630, file: !4, line: 1022, type: !30)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !630, file: !4, line: 1024, type: !36)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmp", scope: !630, file: !4, line: 1025, type: !69)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "selfi", scope: !639, file: !4, line: 1028, type: !30)
!639 = distinct !DILexicalBlock(scope: !640, file: !4, line: 1027, column: 83)
!640 = distinct !DILexicalBlock(scope: !641, file: !4, line: 1027, column: 5)
!641 = distinct !DILexicalBlock(scope: !630, file: !4, line: 1027, column: 5)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !643, file: !4, line: 1032, type: !30)
!643 = distinct !DILexicalBlock(scope: !639, file: !4, line: 1032, column: 12)
!644 = !DISubprogram(name: "array_inplace_concat", scope: !4, file: !4, line: 911, type: !518, isLocal: true, isDefinition: true, scopeLine: 912, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*, %struct._object*)* @array_inplace_concat, variables: !645)
!645 = !{!646, !647}
!646 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !644, file: !4, line: 911, type: !381)
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bb", arg: 2, scope: !644, file: !4, line: 911, type: !30)
!648 = !DISubprogram(name: "array_do_extend", scope: !4, file: !4, line: 880, type: !631, isLocal: true, isDefinition: true, scopeLine: 881, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.arrayobject*, %struct._object*)* @array_do_extend, variables: !649)
!649 = !{!650, !651, !652, !653, !654}
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !648, file: !4, line: 880, type: !381)
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bb", arg: 2, scope: !648, file: !4, line: 880, type: !30)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !648, file: !4, line: 882, type: !36)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldsize", scope: !648, file: !4, line: 882, type: !36)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bbsize", scope: !648, file: !4, line: 882, type: !36)
!655 = !DISubprogram(name: "array_iter_extend", scope: !4, file: !4, line: 857, type: !631, isLocal: true, isDefinition: true, scopeLine: 858, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.arrayobject*, %struct._object*)* @array_iter_extend, variables: !656)
!656 = !{!657, !658, !659, !660, !661, !666, !668, !670}
!657 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !655, file: !4, line: 857, type: !381)
!658 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bb", arg: 2, scope: !655, file: !4, line: 857, type: !30)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !655, file: !4, line: 859, type: !30)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !655, file: !4, line: 859, type: !30)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !662, file: !4, line: 867, type: !30)
!662 = distinct !DILexicalBlock(scope: !663, file: !4, line: 867, column: 16)
!663 = distinct !DILexicalBlock(scope: !664, file: !4, line: 866, column: 68)
!664 = distinct !DILexicalBlock(scope: !665, file: !4, line: 866, column: 13)
!665 = distinct !DILexicalBlock(scope: !655, file: !4, line: 865, column: 49)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !667, file: !4, line: 868, type: !30)
!667 = distinct !DILexicalBlock(scope: !663, file: !4, line: 868, column: 16)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !669, file: !4, line: 871, type: !30)
!669 = distinct !DILexicalBlock(scope: !665, file: !4, line: 871, column: 12)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !671, file: !4, line: 873, type: !30)
!671 = distinct !DILexicalBlock(scope: !655, file: !4, line: 873, column: 8)
!672 = !DISubprogram(name: "ins1", scope: !4, file: !4, line: 524, type: !589, isLocal: true, isDefinition: true, scopeLine: 525, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.arrayobject*, i64, %struct._object*)* @ins1, variables: !673)
!673 = !{!674, !675, !676, !677, !678}
!674 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !672, file: !4, line: 524, type: !381)
!675 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "where", arg: 2, scope: !672, file: !4, line: 524, type: !36)
!676 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 3, scope: !672, file: !4, line: 524, type: !30)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "items", scope: !672, file: !4, line: 526, type: !77)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !672, file: !4, line: 527, type: !36)
!679 = !DISubprogram(name: "array_inplace_repeat", scope: !4, file: !4, line: 926, type: !570, isLocal: true, isDefinition: true, scopeLine: 927, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*, i64)* @array_inplace_repeat, variables: !680)
!680 = !{!681, !682, !683, !684, !685, !686}
!681 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !679, file: !4, line: 926, type: !381)
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !679, file: !4, line: 926, type: !36)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "items", scope: !679, file: !4, line: 928, type: !77)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !679, file: !4, line: 928, type: !77)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !679, file: !4, line: 929, type: !36)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !679, file: !4, line: 929, type: !36)
!687 = !DISubprogram(name: "array_subscr", scope: !4, file: !4, line: 2223, type: !518, isLocal: true, isDefinition: true, scopeLine: 2224, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*, %struct._object*)* @array_subscr, variables: !688)
!688 = !{!689, !690, !691, !694, !697, !698, !699, !700, !701, !702, !703, !704, !705}
!689 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !687, file: !4, line: 2223, type: !381)
!690 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 2, scope: !687, file: !4, line: 2223, type: !30)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !692, file: !4, line: 2226, type: !36)
!692 = distinct !DILexicalBlock(scope: !693, file: !4, line: 2225, column: 113)
!693 = distinct !DILexicalBlock(scope: !687, file: !4, line: 2225, column: 9)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !695, file: !4, line: 2235, type: !36)
!695 = distinct !DILexicalBlock(scope: !696, file: !4, line: 2234, column: 65)
!696 = distinct !DILexicalBlock(scope: !693, file: !4, line: 2234, column: 14)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stop", scope: !695, file: !4, line: 2235, type: !36)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step", scope: !695, file: !4, line: 2235, type: !36)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slicelength", scope: !695, file: !4, line: 2235, type: !36)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur", scope: !695, file: !4, line: 2235, type: !36)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !695, file: !4, line: 2235, type: !36)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !695, file: !4, line: 2236, type: !30)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ar", scope: !695, file: !4, line: 2237, type: !381)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemsize", scope: !695, file: !4, line: 2238, type: !69)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !706, file: !4, line: 2249, type: !30)
!706 = distinct !DILexicalBlock(scope: !707, file: !4, line: 2248, column: 29)
!707 = distinct !DILexicalBlock(scope: !708, file: !4, line: 2248, column: 18)
!708 = distinct !DILexicalBlock(scope: !695, file: !4, line: 2245, column: 13)
!709 = !DISubprogram(name: "array_ass_subscr", scope: !4, file: !4, line: 2282, type: !710, isLocal: true, isDefinition: true, scopeLine: 2283, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.arrayobject*, %struct._object*, %struct._object*)* @array_ass_subscr, variables: !712)
!710 = !DISubroutineType(types: !711)
!711 = !{!69, !381, !30, !30}
!712 = !{!713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !726, !732, !734, !738, !739, !743, !745}
!713 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !709, file: !4, line: 2282, type: !381)
!714 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 2, scope: !709, file: !4, line: 2282, type: !30)
!715 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !709, file: !4, line: 2282, type: !30)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !709, file: !4, line: 2284, type: !36)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stop", scope: !709, file: !4, line: 2284, type: !36)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step", scope: !709, file: !4, line: 2284, type: !36)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slicelength", scope: !709, file: !4, line: 2284, type: !36)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "needed", scope: !709, file: !4, line: 2284, type: !36)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "other", scope: !709, file: !4, line: 2285, type: !381)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemsize", scope: !709, file: !4, line: 2286, type: !69)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !724, file: !4, line: 2289, type: !36)
!724 = distinct !DILexicalBlock(scope: !725, file: !4, line: 2288, column: 113)
!725 = distinct !DILexicalBlock(scope: !709, file: !4, line: 2288, column: 9)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !727, file: !4, line: 2331, type: !69)
!727 = distinct !DILexicalBlock(scope: !728, file: !4, line: 2329, column: 28)
!728 = distinct !DILexicalBlock(scope: !729, file: !4, line: 2329, column: 13)
!729 = distinct !DILexicalBlock(scope: !730, file: !4, line: 2326, column: 132)
!730 = distinct !DILexicalBlock(scope: !731, file: !4, line: 2326, column: 14)
!731 = distinct !DILexicalBlock(scope: !709, file: !4, line: 2322, column: 9)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !733, file: !4, line: 2336, type: !30)
!733 = distinct !DILexicalBlock(scope: !727, file: !4, line: 2336, column: 16)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur", scope: !735, file: !4, line: 2389, type: !120)
!735 = distinct !DILexicalBlock(scope: !736, file: !4, line: 2387, column: 27)
!736 = distinct !DILexicalBlock(scope: !737, file: !4, line: 2387, column: 14)
!737 = distinct !DILexicalBlock(scope: !709, file: !4, line: 2365, column: 9)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !735, file: !4, line: 2390, type: !36)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lim", scope: !740, file: !4, line: 2399, type: !36)
!740 = distinct !DILexicalBlock(scope: !741, file: !4, line: 2398, column: 32)
!741 = distinct !DILexicalBlock(scope: !742, file: !4, line: 2397, column: 9)
!742 = distinct !DILexicalBlock(scope: !735, file: !4, line: 2397, column: 9)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur", scope: !744, file: !4, line: 2418, type: !36)
!744 = distinct !DILexicalBlock(scope: !736, file: !4, line: 2417, column: 10)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !744, file: !4, line: 2418, type: !36)
!746 = !DISubprogram(name: "array_buffer_getbuf", scope: !4, file: !4, line: 2447, type: !747, isLocal: true, isDefinition: true, scopeLine: 2448, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.arrayobject*, %struct.bufferinfo*, i32)* @array_buffer_getbuf, variables: !749)
!747 = !DISubroutineType(types: !748)
!748 = !{!69, !381, !261, !69}
!749 = !{!750, !751, !752}
!750 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !746, file: !4, line: 2447, type: !381)
!751 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 2, scope: !746, file: !4, line: 2447, type: !261)
!752 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 3, scope: !746, file: !4, line: 2447, type: !69)
!753 = !DISubprogram(name: "array_buffer_relbuf", scope: !4, file: !4, line: 2485, type: !754, isLocal: true, isDefinition: true, scopeLine: 2486, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.arrayobject*, %struct.bufferinfo*)* @array_buffer_relbuf, variables: !756)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !381, !261}
!756 = !{!757, !758}
!757 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !753, file: !4, line: 2485, type: !381)
!758 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 2, scope: !753, file: !4, line: 2485, type: !261)
!759 = !DISubprogram(name: "array_richcompare", scope: !4, file: !4, line: 566, type: !297, isLocal: true, isDefinition: true, scopeLine: 567, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @array_richcompare, variables: !760)
!760 = !{!761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !778, !781, !783, !786, !788, !790, !793, !794, !795, !797}
!761 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !759, file: !4, line: 566, type: !30)
!762 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !759, file: !4, line: 566, type: !30)
!763 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !759, file: !4, line: 566, type: !69)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "va", scope: !759, file: !4, line: 568, type: !381)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wa", scope: !759, file: !4, line: 568, type: !381)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vi", scope: !759, file: !4, line: 569, type: !30)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wi", scope: !759, file: !4, line: 570, type: !30)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !759, file: !4, line: 571, type: !36)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !759, file: !4, line: 571, type: !36)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !759, file: !4, line: 572, type: !30)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !772, file: !4, line: 596, type: !30)
!772 = distinct !DILexicalBlock(scope: !773, file: !4, line: 596, column: 16)
!773 = distinct !DILexicalBlock(scope: !774, file: !4, line: 595, column: 51)
!774 = distinct !DILexicalBlock(scope: !775, file: !4, line: 595, column: 13)
!775 = distinct !DILexicalBlock(scope: !776, file: !4, line: 592, column: 98)
!776 = distinct !DILexicalBlock(scope: !777, file: !4, line: 592, column: 5)
!777 = distinct !DILexicalBlock(scope: !759, file: !4, line: 592, column: 5)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !779, file: !4, line: 596, type: !30)
!779 = distinct !DILexicalBlock(scope: !780, file: !4, line: 596, column: 102)
!780 = distinct !DILexicalBlock(scope: !772, file: !4, line: 596, column: 68)
!781 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !782, file: !4, line: 597, type: !30)
!782 = distinct !DILexicalBlock(scope: !773, file: !4, line: 597, column: 16)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !784, file: !4, line: 597, type: !30)
!784 = distinct !DILexicalBlock(scope: !785, file: !4, line: 597, column: 102)
!785 = distinct !DILexicalBlock(scope: !782, file: !4, line: 597, column: 68)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !787, file: !4, line: 603, type: !30)
!787 = distinct !DILexicalBlock(scope: !775, file: !4, line: 603, column: 12)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !789, file: !4, line: 604, type: !30)
!789 = distinct !DILexicalBlock(scope: !775, file: !4, line: 604, column: 12)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vs", scope: !791, file: !4, line: 611, type: !36)
!791 = distinct !DILexicalBlock(scope: !792, file: !4, line: 609, column: 12)
!792 = distinct !DILexicalBlock(scope: !759, file: !4, line: 609, column: 9)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ws", scope: !791, file: !4, line: 612, type: !36)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmp", scope: !791, file: !4, line: 613, type: !69)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !796, file: !4, line: 644, type: !30)
!796 = distinct !DILexicalBlock(scope: !759, file: !4, line: 644, column: 8)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !798, file: !4, line: 645, type: !30)
!798 = distinct !DILexicalBlock(scope: !759, file: !4, line: 645, column: 8)
!799 = !DISubprogram(name: "array_iter", scope: !4, file: !4, line: 2781, type: !507, isLocal: true, isDefinition: true, scopeLine: 2782, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*)* @array_iter, variables: !800)
!800 = !{!801, !802}
!801 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ao", arg: 1, scope: !799, file: !4, line: 2781, type: !381)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !799, file: !4, line: 2783, type: !408)
!803 = !DISubprogram(name: "array_append", scope: !4, file: !4, line: 1169, type: !518, isLocal: true, isDefinition: true, scopeLine: 1170, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*, %struct._object*)* @array_append, variables: !804)
!804 = !{!805, !806}
!805 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !803, file: !4, line: 1169, type: !381)
!806 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !803, file: !4, line: 1169, type: !30)
!807 = !DISubprogram(name: "ins", scope: !4, file: !4, line: 956, type: !808, isLocal: true, isDefinition: true, scopeLine: 957, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*, i64, %struct._object*)* @ins, variables: !810)
!808 = !DISubroutineType(types: !809)
!809 = !{!30, !381, !36, !30}
!810 = !{!811, !812, !813}
!811 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !807, file: !4, line: 956, type: !381)
!812 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "where", arg: 2, scope: !807, file: !4, line: 956, type: !36)
!813 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 3, scope: !807, file: !4, line: 956, type: !30)
!814 = !DISubprogram(name: "array_buffer_info", scope: !4, file: !4, line: 1134, type: !518, isLocal: true, isDefinition: true, scopeLine: 1135, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*, %struct._object*)* @array_buffer_info, variables: !815)
!815 = !{!816, !817, !818, !819, !820, !824}
!816 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !814, file: !4, line: 1134, type: !381)
!817 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !814, file: !4, line: 1134, type: !30)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !814, file: !4, line: 1136, type: !30)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !814, file: !4, line: 1136, type: !30)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !821, file: !4, line: 1144, type: !30)
!821 = distinct !DILexicalBlock(scope: !822, file: !4, line: 1144, column: 12)
!822 = distinct !DILexicalBlock(scope: !823, file: !4, line: 1143, column: 26)
!823 = distinct !DILexicalBlock(scope: !814, file: !4, line: 1143, column: 9)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !825, file: !4, line: 1151, type: !30)
!825 = distinct !DILexicalBlock(scope: !826, file: !4, line: 1151, column: 12)
!826 = distinct !DILexicalBlock(scope: !827, file: !4, line: 1150, column: 26)
!827 = distinct !DILexicalBlock(scope: !814, file: !4, line: 1150, column: 9)
!828 = !DISubprogram(name: "array_byteswap", scope: !4, file: !4, line: 1181, type: !518, isLocal: true, isDefinition: true, scopeLine: 1182, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*, %struct._object*)* @array_byteswap, variables: !829)
!829 = !{!830, !831, !832, !833, !834, !839, !843, !844, !848, !849, !850}
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !828, file: !4, line: 1181, type: !381)
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !828, file: !4, line: 1181, type: !30)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !828, file: !4, line: 1183, type: !77)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !828, file: !4, line: 1184, type: !36)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p0", scope: !835, file: !4, line: 1191, type: !56)
!835 = distinct !DILexicalBlock(scope: !836, file: !4, line: 1190, column: 90)
!836 = distinct !DILexicalBlock(scope: !837, file: !4, line: 1190, column: 9)
!837 = distinct !DILexicalBlock(scope: !838, file: !4, line: 1190, column: 9)
!838 = distinct !DILexicalBlock(scope: !828, file: !4, line: 1186, column: 39)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p0", scope: !840, file: !4, line: 1198, type: !56)
!840 = distinct !DILexicalBlock(scope: !841, file: !4, line: 1197, column: 90)
!841 = distinct !DILexicalBlock(scope: !842, file: !4, line: 1197, column: 9)
!842 = distinct !DILexicalBlock(scope: !838, file: !4, line: 1197, column: 9)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p1", scope: !840, file: !4, line: 1199, type: !56)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p0", scope: !845, file: !4, line: 1208, type: !56)
!845 = distinct !DILexicalBlock(scope: !846, file: !4, line: 1207, column: 90)
!846 = distinct !DILexicalBlock(scope: !847, file: !4, line: 1207, column: 9)
!847 = distinct !DILexicalBlock(scope: !838, file: !4, line: 1207, column: 9)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p1", scope: !845, file: !4, line: 1209, type: !56)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p2", scope: !845, file: !4, line: 1210, type: !56)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p3", scope: !845, file: !4, line: 1211, type: !56)
!851 = !DISubprogram(name: "array_copy", scope: !4, file: !4, line: 688, type: !518, isLocal: true, isDefinition: true, scopeLine: 689, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*, %struct._object*)* @array_copy, variables: !852)
!852 = !{!853, !854}
!853 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !851, file: !4, line: 688, type: !381)
!854 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !851, file: !4, line: 688, type: !30)
!855 = !DISubprogram(name: "array_count", scope: !4, file: !4, line: 965, type: !518, isLocal: true, isDefinition: true, scopeLine: 966, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*, %struct._object*)* @array_count, variables: !856)
!856 = !{!857, !858, !859, !860, !861, !865, !866}
!857 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !855, file: !4, line: 965, type: !381)
!858 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !855, file: !4, line: 965, type: !30)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !855, file: !4, line: 967, type: !36)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !855, file: !4, line: 968, type: !36)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "selfi", scope: !862, file: !4, line: 971, type: !30)
!862 = distinct !DILexicalBlock(scope: !863, file: !4, line: 970, column: 61)
!863 = distinct !DILexicalBlock(scope: !864, file: !4, line: 970, column: 5)
!864 = distinct !DILexicalBlock(scope: !855, file: !4, line: 970, column: 5)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmp", scope: !862, file: !4, line: 972, type: !69)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !867, file: !4, line: 978, type: !30)
!867 = distinct !DILexicalBlock(scope: !862, file: !4, line: 978, column: 12)
!868 = !DISubprogram(name: "array_extend", scope: !4, file: !4, line: 1104, type: !518, isLocal: true, isDefinition: true, scopeLine: 1105, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*, %struct._object*)* @array_extend, variables: !869)
!869 = !{!870, !871}
!870 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !868, file: !4, line: 1104, type: !381)
!871 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bb", arg: 2, scope: !868, file: !4, line: 1104, type: !30)
!872 = !DISubprogram(name: "array_fromfile", scope: !4, file: !4, line: 1274, type: !518, isLocal: true, isDefinition: true, scopeLine: 1275, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*, %struct._object*)* @array_fromfile, variables: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !887, !889, !891}
!874 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !872, file: !4, line: 1274, type: !381)
!875 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !872, file: !4, line: 1274, type: !30)
!876 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !872, file: !4, line: 1276, type: !30)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !872, file: !4, line: 1276, type: !30)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !872, file: !4, line: 1276, type: !30)
!879 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemsize", scope: !872, file: !4, line: 1277, type: !36)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !872, file: !4, line: 1278, type: !36)
!881 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes", scope: !872, file: !4, line: 1278, type: !36)
!882 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "not_enough_bytes", scope: !872, file: !4, line: 1280, type: !69)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !884, file: !4, line: 1302, type: !30)
!884 = distinct !DILexicalBlock(scope: !885, file: !4, line: 1302, column: 12)
!885 = distinct !DILexicalBlock(scope: !886, file: !4, line: 1299, column: 76)
!886 = distinct !DILexicalBlock(scope: !872, file: !4, line: 1299, column: 9)
!887 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !888, file: !4, line: 1309, type: !30)
!888 = distinct !DILexicalBlock(scope: !872, file: !4, line: 1309, column: 8)
!889 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !890, file: !4, line: 1314, type: !30)
!890 = distinct !DILexicalBlock(scope: !872, file: !4, line: 1314, column: 8)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !892, file: !4, line: 1321, type: !30)
!892 = distinct !DILexicalBlock(scope: !893, file: !4, line: 1321, column: 12)
!893 = distinct !DILexicalBlock(scope: !894, file: !4, line: 1318, column: 27)
!894 = distinct !DILexicalBlock(scope: !872, file: !4, line: 1318, column: 9)
!895 = !DISubprogram(name: "array_fromlist", scope: !4, file: !4, line: 1378, type: !518, isLocal: true, isDefinition: true, scopeLine: 1379, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*, %struct._object*)* @array_fromlist, variables: !896)
!896 = !{!897, !898, !899, !900, !903, !904}
!897 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !895, file: !4, line: 1378, type: !381)
!898 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list", arg: 2, scope: !895, file: !4, line: 1378, type: !30)
!899 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !895, file: !4, line: 1380, type: !36)
!900 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !901, file: !4, line: 1388, type: !36)
!901 = distinct !DILexicalBlock(scope: !902, file: !4, line: 1387, column: 16)
!902 = distinct !DILexicalBlock(scope: !895, file: !4, line: 1387, column: 9)
!903 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_size", scope: !901, file: !4, line: 1388, type: !36)
!904 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !905, file: !4, line: 1393, type: !30)
!905 = distinct !DILexicalBlock(scope: !906, file: !4, line: 1392, column: 33)
!906 = distinct !DILexicalBlock(scope: !907, file: !4, line: 1392, column: 9)
!907 = distinct !DILexicalBlock(scope: !901, file: !4, line: 1392, column: 9)
!908 = !DISubprogram(name: "array_fromstring", scope: !4, file: !4, line: 1475, type: !518, isLocal: true, isDefinition: true, scopeLine: 1476, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*, %struct._object*)* @array_fromstring, variables: !909)
!909 = !{!910, !911, !912}
!910 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !908, file: !4, line: 1475, type: !381)
!911 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !908, file: !4, line: 1475, type: !30)
!912 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !908, file: !4, line: 1477, type: !262)
!913 = !DISubprogram(name: "frombytes", scope: !4, file: !4, line: 1438, type: !914, isLocal: true, isDefinition: true, scopeLine: 1439, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*, %struct.bufferinfo*)* @frombytes, variables: !916)
!914 = !DISubroutineType(types: !915)
!915 = !{!30, !381, !261}
!916 = !{!917, !918, !919, !920, !921}
!917 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !913, file: !4, line: 1438, type: !381)
!918 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buffer", arg: 2, scope: !913, file: !4, line: 1438, type: !261)
!919 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemsize", scope: !913, file: !4, line: 1440, type: !69)
!920 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !913, file: !4, line: 1441, type: !36)
!921 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_size", scope: !922, file: !4, line: 1456, type: !36)
!922 = distinct !DILexicalBlock(scope: !923, file: !4, line: 1455, column: 16)
!923 = distinct !DILexicalBlock(scope: !913, file: !4, line: 1455, column: 9)
!924 = !DISubprogram(name: "array_frombytes", scope: !4, file: !4, line: 1497, type: !518, isLocal: true, isDefinition: true, scopeLine: 1498, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*, %struct._object*)* @array_frombytes, variables: !925)
!925 = !{!926, !927, !928}
!926 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !924, file: !4, line: 1497, type: !381)
!927 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !924, file: !4, line: 1497, type: !30)
!928 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !924, file: !4, line: 1499, type: !262)
!929 = !DISubprogram(name: "array_fromunicode", scope: !4, file: !4, line: 1550, type: !518, isLocal: true, isDefinition: true, scopeLine: 1551, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.arrayobject*, %struct._object*)* @array_fromunicode, variables: !930)
!930 = !{!931, !932, !933, !934, !935, !936}
!931 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !929, file: !4, line: 1550, type: !381)
