; ModuleID = 'programs_new/Python-new/atexitmodule.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !368, globals: !499)
!1 = !DIFile(filename: "atexitmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !106, !23, !11, !359, !360, !17}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "atexitmodule_state", file: !7, line: 29, baseType: !8)
!7 = !DIFile(filename: "./Modules/atexitmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!8 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 25, size: 128, align: 64, elements: !9)
!9 = !{!10, !357, !358}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "atexit_callbacks", scope: !8, file: !7, line: 26, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "atexit_callback", file: !7, line: 23, baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 19, size: 192, align: 64, elements: !15)
!15 = !{!16, !355, !356}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !14, file: !7, line: 20, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !19, line: 109, baseType: !20)
!19 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !19, line: 105, size: 128, align: 64, elements: !21)
!21 = !{!22, !30}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !20, file: !19, line: 107, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !24, line: 177, baseType: !25)
!24 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !26, line: 102, baseType: !27)
!26 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !28, line: 181, baseType: !29)
!28 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!29 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !20, file: !19, line: 108, baseType: !31, size: 64, align: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !19, line: 334, size: 3200, align: 64, elements: !33)
!33 = !{!34, !40, !44, !45, !46, !51, !114, !119, !124, !125, !130, !182, !213, !225, !231, !232, !233, !235, !237, !268, !269, !270, !279, !280, !285, !286, !288, !290, !300, !303, !321, !322, !323, !325, !327, !328, !330, !335, !340, !345, !346, !347, !348, !349, !350, !351, !352, !354}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !32, file: !19, line: 335, baseType: !35, size: 192, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !19, line: 114, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 111, size: 192, align: 64, elements: !37)
!37 = !{!38, !39}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !36, file: !19, line: 112, baseType: !18, size: 128, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !36, file: !19, line: 113, baseType: !23, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !32, file: !19, line: 336, baseType: !41, size: 64, align: 64, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!43 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !32, file: !19, line: 337, baseType: !23, size: 64, align: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !32, file: !19, line: 337, baseType: !23, size: 64, align: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !32, file: !19, line: 341, baseType: !47, size: 64, align: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !19, line: 308, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !17}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !32, file: !19, line: 342, baseType: !52, size: 64, align: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !19, line: 314, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !17, !57, !56}
!56 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !26, line: 48, baseType: !59)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 246, size: 1728, align: 64, elements: !61)
!60 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!61 = !{!62, !63, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !83, !84, !85, !86, !88, !90, !92, !96, !99, !101, !102, !103, !104, !105, !109, !110}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !59, file: !60, line: 247, baseType: !56, size: 32, align: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !59, file: !60, line: 252, baseType: !64, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !59, file: !60, line: 253, baseType: !64, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !59, file: !60, line: 254, baseType: !64, size: 64, align: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !59, file: !60, line: 255, baseType: !64, size: 64, align: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !59, file: !60, line: 256, baseType: !64, size: 64, align: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !59, file: !60, line: 257, baseType: !64, size: 64, align: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !59, file: !60, line: 258, baseType: !64, size: 64, align: 64, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !59, file: !60, line: 259, baseType: !64, size: 64, align: 64, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !59, file: !60, line: 261, baseType: !64, size: 64, align: 64, offset: 576)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !59, file: !60, line: 262, baseType: !64, size: 64, align: 64, offset: 640)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !59, file: !60, line: 263, baseType: !64, size: 64, align: 64, offset: 704)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !59, file: !60, line: 265, baseType: !76, size: 64, align: 64, offset: 768)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !60, line: 161, size: 192, align: 64, elements: !78)
!78 = !{!79, !80, !82}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !77, file: !60, line: 162, baseType: !76, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !77, file: !60, line: 163, baseType: !81, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !77, file: !60, line: 167, baseType: !56, size: 32, align: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !59, file: !60, line: 267, baseType: !81, size: 64, align: 64, offset: 832)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !59, file: !60, line: 269, baseType: !56, size: 32, align: 32, offset: 896)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !59, file: !60, line: 273, baseType: !56, size: 32, align: 32, offset: 928)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !59, file: !60, line: 275, baseType: !87, size: 64, align: 64, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !28, line: 140, baseType: !29)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !59, file: !60, line: 279, baseType: !89, size: 16, align: 16, offset: 1024)
!89 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !59, file: !60, line: 280, baseType: !91, size: 8, align: 8, offset: 1040)
!91 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !59, file: !60, line: 281, baseType: !93, size: 8, align: 8, offset: 1048)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, align: 8, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 1)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !59, file: !60, line: 285, baseType: !97, size: 64, align: 64, offset: 1088)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !60, line: 155, baseType: null)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !59, file: !60, line: 294, baseType: !100, size: 64, align: 64, offset: 1152)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !28, line: 141, baseType: !29)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !59, file: !60, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !59, file: !60, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !59, file: !60, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !59, file: !60, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !59, file: !60, line: 307, baseType: !106, size: 64, align: 64, offset: 1472)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !107, line: 62, baseType: !108)
!107 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!108 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !59, file: !60, line: 309, baseType: !56, size: 32, align: 32, offset: 1536)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !59, file: !60, line: 311, baseType: !111, size: 160, align: 8, offset: 1568)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, align: 8, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 20)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !32, file: !19, line: 343, baseType: !115, size: 64, align: 64, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !19, line: 316, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!17, !17, !64}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !32, file: !19, line: 344, baseType: !120, size: 64, align: 64, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !19, line: 318, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!56, !17, !64, !17}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !32, file: !19, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !32, file: !19, line: 346, baseType: !126, size: 64, align: 64, offset: 704)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !19, line: 320, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!17, !17}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !32, file: !19, line: 350, baseType: !131, size: 64, align: 64, offset: 768)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !19, line: 278, baseType: !133)
!133 = !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 236, size: 2176, align: 64, elements: !134)
!134 = !{!135, !140, !141, !142, !143, !144, !149, !151, !152, !153, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !133, file: !19, line: 241, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !19, line: 166, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!17, !17, !17}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !133, file: !19, line: 242, baseType: !136, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !133, file: !19, line: 243, baseType: !136, size: 64, align: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !133, file: !19, line: 244, baseType: !136, size: 64, align: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !133, file: !19, line: 245, baseType: !136, size: 64, align: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !133, file: !19, line: 246, baseType: !145, size: 64, align: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !19, line: 167, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!17, !17, !17, !17}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !133, file: !19, line: 247, baseType: !150, size: 64, align: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !19, line: 165, baseType: !127)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !133, file: !19, line: 248, baseType: !150, size: 64, align: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !133, file: !19, line: 249, baseType: !150, size: 64, align: 64, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !133, file: !19, line: 250, baseType: !154, size: 64, align: 64, offset: 576)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !19, line: 168, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!56, !17}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !133, file: !19, line: 251, baseType: !150, size: 64, align: 64, offset: 640)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !133, file: !19, line: 252, baseType: !136, size: 64, align: 64, offset: 704)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !133, file: !19, line: 253, baseType: !136, size: 64, align: 64, offset: 768)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !133, file: !19, line: 254, baseType: !136, size: 64, align: 64, offset: 832)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !133, file: !19, line: 255, baseType: !136, size: 64, align: 64, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !133, file: !19, line: 256, baseType: !136, size: 64, align: 64, offset: 960)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !133, file: !19, line: 257, baseType: !150, size: 64, align: 64, offset: 1024)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !133, file: !19, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !133, file: !19, line: 259, baseType: !150, size: 64, align: 64, offset: 1152)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !133, file: !19, line: 261, baseType: !136, size: 64, align: 64, offset: 1216)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !133, file: !19, line: 262, baseType: !136, size: 64, align: 64, offset: 1280)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !133, file: !19, line: 263, baseType: !136, size: 64, align: 64, offset: 1344)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !133, file: !19, line: 264, baseType: !136, size: 64, align: 64, offset: 1408)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !133, file: !19, line: 265, baseType: !145, size: 64, align: 64, offset: 1472)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !133, file: !19, line: 266, baseType: !136, size: 64, align: 64, offset: 1536)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !133, file: !19, line: 267, baseType: !136, size: 64, align: 64, offset: 1600)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !133, file: !19, line: 268, baseType: !136, size: 64, align: 64, offset: 1664)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !133, file: !19, line: 269, baseType: !136, size: 64, align: 64, offset: 1728)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !133, file: !19, line: 270, baseType: !136, size: 64, align: 64, offset: 1792)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !133, file: !19, line: 272, baseType: !136, size: 64, align: 64, offset: 1856)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !133, file: !19, line: 273, baseType: !136, size: 64, align: 64, offset: 1920)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !133, file: !19, line: 274, baseType: !136, size: 64, align: 64, offset: 1984)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !133, file: !19, line: 275, baseType: !136, size: 64, align: 64, offset: 2048)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !133, file: !19, line: 277, baseType: !150, size: 64, align: 64, offset: 2112)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !32, file: !19, line: 351, baseType: !183, size: 64, align: 64, offset: 832)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !19, line: 292, baseType: !185)
!185 = !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 280, size: 640, align: 64, elements: !186)
!186 = !{!187, !192, !193, !198, !199, !200, !205, !206, !211, !212}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !185, file: !19, line: 281, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !19, line: 169, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!23, !17}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !185, file: !19, line: 282, baseType: !136, size: 64, align: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !185, file: !19, line: 283, baseType: !194, size: 64, align: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !19, line: 170, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!17, !17, !23}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !185, file: !19, line: 284, baseType: !194, size: 64, align: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !185, file: !19, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !185, file: !19, line: 286, baseType: !201, size: 64, align: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !19, line: 172, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!56, !17, !23, !17}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !185, file: !19, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !185, file: !19, line: 288, baseType: !207, size: 64, align: 64, offset: 448)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !19, line: 231, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!56, !17, !17}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !185, file: !19, line: 290, baseType: !136, size: 64, align: 64, offset: 512)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !185, file: !19, line: 291, baseType: !194, size: 64, align: 64, offset: 576)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !32, file: !19, line: 352, baseType: !214, size: 64, align: 64, offset: 896)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !19, line: 298, baseType: !216)
!216 = !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 294, size: 192, align: 64, elements: !217)
!217 = !{!218, !219, !220}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !216, file: !19, line: 295, baseType: !188, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !216, file: !19, line: 296, baseType: !136, size: 64, align: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !216, file: !19, line: 297, baseType: !221, size: 64, align: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !19, line: 174, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!56, !17, !17, !17}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !32, file: !19, line: 356, baseType: !226, size: 64, align: 64, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !19, line: 321, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!230, !17}
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !24, line: 186, baseType: !23)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !32, file: !19, line: 357, baseType: !145, size: 64, align: 64, offset: 1024)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !32, file: !19, line: 358, baseType: !126, size: 64, align: 64, offset: 1088)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !32, file: !19, line: 359, baseType: !234, size: 64, align: 64, offset: 1152)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !19, line: 317, baseType: !137)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !32, file: !19, line: 360, baseType: !236, size: 64, align: 64, offset: 1216)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !19, line: 319, baseType: !222)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !32, file: !19, line: 363, baseType: !238, size: 64, align: 64, offset: 1280)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !19, line: 304, baseType: !240)
!240 = !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 301, size: 128, align: 64, elements: !241)
!241 = !{!242, !263}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !240, file: !19, line: 302, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !19, line: 193, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!56, !17, !247, !56}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !19, line: 191, baseType: !249)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !19, line: 178, size: 640, align: 64, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258, !260, !261, !262}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !249, file: !19, line: 179, baseType: !4, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !249, file: !19, line: 180, baseType: !17, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !249, file: !19, line: 181, baseType: !23, size: 64, align: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !249, file: !19, line: 182, baseType: !23, size: 64, align: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !249, file: !19, line: 184, baseType: !56, size: 32, align: 32, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !249, file: !19, line: 185, baseType: !56, size: 32, align: 32, offset: 288)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !249, file: !19, line: 186, baseType: !64, size: 64, align: 64, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !249, file: !19, line: 187, baseType: !259, size: 64, align: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !249, file: !19, line: 188, baseType: !259, size: 64, align: 64, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !249, file: !19, line: 189, baseType: !259, size: 64, align: 64, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !249, file: !19, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !240, file: !19, line: 303, baseType: !264, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !19, line: 194, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !17, !247}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !32, file: !19, line: 366, baseType: !108, size: 64, align: 64, offset: 1344)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !32, file: !19, line: 368, baseType: !41, size: 64, align: 64, offset: 1408)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !32, file: !19, line: 372, baseType: !271, size: 64, align: 64, offset: 1472)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !19, line: 233, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!56, !17, !275, !4}
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !19, line: 232, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!56, !17, !4}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !32, file: !19, line: 375, baseType: !154, size: 64, align: 64, offset: 1536)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !32, file: !19, line: 379, baseType: !281, size: 64, align: 64, offset: 1600)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !19, line: 322, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!17, !17, !17, !56}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !32, file: !19, line: 382, baseType: !23, size: 64, align: 64, offset: 1664)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !32, file: !19, line: 385, baseType: !287, size: 64, align: 64, offset: 1728)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !19, line: 323, baseType: !127)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !32, file: !19, line: 386, baseType: !289, size: 64, align: 64, offset: 1792)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !19, line: 324, baseType: !127)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !32, file: !19, line: 389, baseType: !291, size: 64, align: 64, offset: 1856)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !293, line: 40, size: 256, align: 64, elements: !294)
!293 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!294 = !{!295, !296, !298, !299}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !292, file: !293, line: 41, baseType: !41, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !292, file: !293, line: 42, baseType: !297, size: 64, align: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !293, line: 18, baseType: !137)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !292, file: !293, line: 43, baseType: !56, size: 32, align: 32, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !292, file: !293, line: 45, baseType: !41, size: 64, align: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !32, file: !19, line: 390, baseType: !301, size: 64, align: 64, offset: 1920)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !19, line: 390, flags: DIFlagFwdDecl)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !32, file: !19, line: 391, baseType: !304, size: 64, align: 64, offset: 1984)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !306, line: 11, size: 320, align: 64, elements: !307)
!306 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!307 = !{!308, !309, !314, !319, !320}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !305, file: !306, line: 12, baseType: !64, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !305, file: !306, line: 13, baseType: !310, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !306, line: 8, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!17, !17, !4}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !305, file: !306, line: 14, baseType: !315, size: 64, align: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !306, line: 9, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!56, !17, !17, !4}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !305, file: !306, line: 15, baseType: !64, size: 64, align: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !305, file: !306, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !32, file: !19, line: 392, baseType: !31, size: 64, align: 64, offset: 2048)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !32, file: !19, line: 393, baseType: !17, size: 64, align: 64, offset: 2112)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !32, file: !19, line: 394, baseType: !324, size: 64, align: 64, offset: 2176)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !19, line: 325, baseType: !146)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !32, file: !19, line: 395, baseType: !326, size: 64, align: 64, offset: 2240)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !19, line: 326, baseType: !222)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !32, file: !19, line: 396, baseType: !23, size: 64, align: 64, offset: 2304)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !32, file: !19, line: 397, baseType: !329, size: 64, align: 64, offset: 2368)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !19, line: 327, baseType: !222)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !32, file: !19, line: 398, baseType: !331, size: 64, align: 64, offset: 2432)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !19, line: 329, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!17, !31, !23}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !32, file: !19, line: 399, baseType: !336, size: 64, align: 64, offset: 2496)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !19, line: 328, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!17, !31, !17, !17}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !32, file: !19, line: 400, baseType: !341, size: 64, align: 64, offset: 2560)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !19, line: 307, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{null, !4}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !32, file: !19, line: 401, baseType: !154, size: 64, align: 64, offset: 2624)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !32, file: !19, line: 402, baseType: !17, size: 64, align: 64, offset: 2688)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !32, file: !19, line: 403, baseType: !17, size: 64, align: 64, offset: 2752)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !32, file: !19, line: 404, baseType: !17, size: 64, align: 64, offset: 2816)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !32, file: !19, line: 405, baseType: !17, size: 64, align: 64, offset: 2880)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !32, file: !19, line: 406, baseType: !17, size: 64, align: 64, offset: 2944)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !32, file: !19, line: 407, baseType: !47, size: 64, align: 64, offset: 3008)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !32, file: !19, line: 410, baseType: !353, size: 32, align: 32, offset: 3072)
!353 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !32, file: !19, line: 412, baseType: !47, size: 64, align: 64, offset: 3136)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !14, file: !7, line: 21, baseType: !17, size: 64, align: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "kwargs", scope: !14, file: !7, line: 22, baseType: !17, size: 64, align: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ncallbacks", scope: !8, file: !7, line: 27, baseType: !56, size: 32, align: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "callback_len", scope: !8, file: !7, line: 28, baseType: !56, size: 32, align: 32, offset: 96)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !362, line: 33, baseType: !363)
!362 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!363 = !DICompositeType(tag: DW_TAG_structure_type, file: !362, line: 25, size: 256, align: 64, elements: !364)
!364 = !{!365, !366}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !363, file: !362, line: 26, baseType: !35, size: 192, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !363, file: !362, line: 27, baseType: !367, size: 64, align: 64, offset: 192)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 64, align: 64, elements: !94)
!368 = !{!369, !375, !388, !392, !399, !415, !423, !427, !432, !455, !459, !463}
!369 = !DISubprogram(name: "PyInit_atexit", scope: !7, file: !7, line: 327, type: !370, isLocal: false, isDefinition: true, scopeLine: 328, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_atexit, variables: !372)
!370 = !DISubroutineType(types: !371)
!371 = !{!17}
!372 = !{!373, !374}
!373 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !369, file: !7, line: 329, type: !17)
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modstate", scope: !369, file: !7, line: 330, type: !5)
!375 = !DISubprogram(name: "atexit_register", scope: !7, file: !7, line: 129, type: !147, isLocal: true, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @atexit_register, variables: !376)
!376 = !{!377, !378, !379, !380, !381, !382, !383, !386}
!377 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !375, file: !7, line: 129, type: !17)
!378 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !375, file: !7, line: 129, type: !17)
!379 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !375, file: !7, line: 129, type: !17)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modstate", scope: !375, file: !7, line: 131, type: !5)
!381 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_callback", scope: !375, file: !7, line: 132, type: !12)
!382 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !375, file: !7, line: 133, type: !17)
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !384, file: !7, line: 138, type: !11)
!384 = distinct !DILexicalBlock(scope: !385, file: !7, line: 137, column: 57)
!385 = distinct !DILexicalBlock(scope: !375, file: !7, line: 137, column: 9)
!386 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !387, file: !7, line: 172, type: !17)
!387 = distinct !DILexicalBlock(scope: !375, file: !7, line: 172, column: 8)
!388 = !DISubprogram(name: "atexit_clear", scope: !7, file: !7, line: 200, type: !138, isLocal: true, isDefinition: true, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @atexit_clear, variables: !389)
!389 = !{!390, !391}
!390 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !388, file: !7, line: 200, type: !17)
!391 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !388, file: !7, line: 200, type: !17)
!392 = !DISubprogram(name: "atexit_cleanup", scope: !7, file: !7, line: 49, type: !393, isLocal: true, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.atexitmodule_state*)* @atexit_cleanup, variables: !395)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !5}
!395 = !{!396, !397, !398}
!396 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "modstate", arg: 1, scope: !392, file: !7, line: 49, type: !5)
!397 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cb", scope: !392, file: !7, line: 51, type: !12)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !392, file: !7, line: 52, type: !56)
!399 = !DISubprogram(name: "atexit_delete_cb", scope: !7, file: !7, line: 35, type: !400, isLocal: true, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.atexitmodule_state*, i32)* @atexit_delete_cb, variables: !402)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !5, !56}
!402 = !{!403, !404, !405, !406, !408, !410, !412}
!403 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "modstate", arg: 1, scope: !399, file: !7, line: 35, type: !5)
!404 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !399, file: !7, line: 35, type: !56)
!405 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cb", scope: !399, file: !7, line: 37, type: !12)
!406 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !407, file: !7, line: 41, type: !17)
!407 = distinct !DILexicalBlock(scope: !399, file: !7, line: 41, column: 8)
!408 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !409, file: !7, line: 42, type: !17)
!409 = distinct !DILexicalBlock(scope: !399, file: !7, line: 42, column: 8)
!410 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !411, file: !7, line: 43, type: !17)
!411 = distinct !DILexicalBlock(scope: !399, file: !7, line: 43, column: 8)
!412 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !413, file: !7, line: 43, type: !17)
!413 = distinct !DILexicalBlock(scope: !414, file: !7, line: 43, column: 102)
!414 = distinct !DILexicalBlock(scope: !411, file: !7, line: 43, column: 68)
!415 = !DISubprogram(name: "atexit_unregister", scope: !7, file: !7, line: 266, type: !138, isLocal: true, isDefinition: true, scopeLine: 267, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @atexit_unregister, variables: !416)
!416 = !{!417, !418, !419, !420, !421, !422}
!417 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !415, file: !7, line: 266, type: !17)
!418 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 2, scope: !415, file: !7, line: 266, type: !17)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modstate", scope: !415, file: !7, line: 268, type: !5)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cb", scope: !415, file: !7, line: 269, type: !12)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !415, file: !7, line: 270, type: !56)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "eq", scope: !415, file: !7, line: 270, type: !56)
!423 = !DISubprogram(name: "atexit_run_exitfuncs", scope: !7, file: !7, line: 186, type: !138, isLocal: true, isDefinition: true, scopeLine: 187, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @atexit_run_exitfuncs, variables: !424)
!424 = !{!425, !426}
!425 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !423, file: !7, line: 186, type: !17)
!426 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !423, file: !7, line: 186, type: !17)
!427 = !DISubprogram(name: "atexit_ncallbacks", scope: !7, file: !7, line: 212, type: !138, isLocal: true, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @atexit_ncallbacks, variables: !428)
!428 = !{!429, !430, !431}
!429 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !427, file: !7, line: 212, type: !17)
!430 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !427, file: !7, line: 212, type: !17)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modstate", scope: !427, file: !7, line: 214, type: !5)
!432 = !DISubprogram(name: "atexit_m_traverse", scope: !7, file: !7, line: 222, type: !273, isLocal: true, isDefinition: true, scopeLine: 223, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)* @atexit_m_traverse, variables: !433)
!433 = !{!434, !435, !436, !437, !438, !439, !443, !447, !451}
!434 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !432, file: !7, line: 222, type: !17)
!435 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !432, file: !7, line: 222, type: !275)
!436 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !432, file: !7, line: 222, type: !4)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !432, file: !7, line: 224, type: !56)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modstate", scope: !432, file: !7, line: 225, type: !5)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cb", scope: !440, file: !7, line: 229, type: !12)
!440 = distinct !DILexicalBlock(scope: !441, file: !7, line: 228, column: 48)
!441 = distinct !DILexicalBlock(scope: !442, file: !7, line: 228, column: 5)
!442 = distinct !DILexicalBlock(scope: !432, file: !7, line: 228, column: 5)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !444, file: !7, line: 232, type: !56)
!444 = distinct !DILexicalBlock(scope: !445, file: !7, line: 232, column: 28)
!445 = distinct !DILexicalBlock(scope: !446, file: !7, line: 232, column: 18)
!446 = distinct !DILexicalBlock(scope: !440, file: !7, line: 232, column: 12)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !448, file: !7, line: 233, type: !56)
!448 = distinct !DILexicalBlock(scope: !449, file: !7, line: 233, column: 28)
!449 = distinct !DILexicalBlock(scope: !450, file: !7, line: 233, column: 18)
!450 = distinct !DILexicalBlock(scope: !440, file: !7, line: 233, column: 12)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !452, file: !7, line: 234, type: !56)
!452 = distinct !DILexicalBlock(scope: !453, file: !7, line: 234, column: 30)
!453 = distinct !DILexicalBlock(scope: !454, file: !7, line: 234, column: 18)
!454 = distinct !DILexicalBlock(scope: !440, file: !7, line: 234, column: 12)
!455 = !DISubprogram(name: "atexit_m_clear", scope: !7, file: !7, line: 240, type: !156, isLocal: true, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @atexit_m_clear, variables: !456)
!456 = !{!457, !458}
!457 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !455, file: !7, line: 240, type: !17)
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modstate", scope: !455, file: !7, line: 242, type: !5)
!459 = !DISubprogram(name: "atexit_free", scope: !7, file: !7, line: 249, type: !49, isLocal: true, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @atexit_free, variables: !460)
!460 = !{!461, !462}
!461 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !459, file: !7, line: 249, type: !17)
!462 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modstate", scope: !459, file: !7, line: 251, type: !5)
!463 = !DISubprogram(name: "atexit_callfuncs", scope: !7, file: !7, line: 66, type: !464, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @atexit_callfuncs, variables: !466)
!464 = !DISubroutineType(types: !465)
!465 = !{null}
!466 = !{!467, !468, !469, !470, !471, !472, !473, !474, !475, !480, !483, !489, !491, !494, !496}
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc_type", scope: !463, file: !7, line: 68, type: !17)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc_value", scope: !463, file: !7, line: 68, type: !17)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc_tb", scope: !463, file: !7, line: 68, type: !17)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !463, file: !7, line: 68, type: !17)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cb", scope: !463, file: !7, line: 69, type: !12)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "module", scope: !463, file: !7, line: 70, type: !17)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modstate", scope: !463, file: !7, line: 71, type: !5)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !463, file: !7, line: 72, type: !56)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !476, file: !7, line: 90, type: !17)
!476 = distinct !DILexicalBlock(scope: !477, file: !7, line: 90, column: 12)
!477 = distinct !DILexicalBlock(scope: !478, file: !7, line: 84, column: 5)
!478 = distinct !DILexicalBlock(scope: !479, file: !7, line: 83, column: 5)
!479 = distinct !DILexicalBlock(scope: !463, file: !7, line: 83, column: 5)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !481, file: !7, line: 90, type: !17)
!481 = distinct !DILexicalBlock(scope: !482, file: !7, line: 90, column: 97)
!482 = distinct !DILexicalBlock(scope: !476, file: !7, line: 90, column: 63)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !484, file: !7, line: 95, type: !17)
!484 = distinct !DILexicalBlock(scope: !485, file: !7, line: 95, column: 20)
!485 = distinct !DILexicalBlock(scope: !486, file: !7, line: 94, column: 27)
!486 = distinct !DILexicalBlock(scope: !487, file: !7, line: 94, column: 17)
!487 = distinct !DILexicalBlock(scope: !488, file: !7, line: 91, column: 30)
!488 = distinct !DILexicalBlock(scope: !477, file: !7, line: 91, column: 13)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !490, file: !7, line: 96, type: !17)
!490 = distinct !DILexicalBlock(scope: !485, file: !7, line: 96, column: 20)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !492, file: !7, line: 96, type: !17)
!492 = distinct !DILexicalBlock(scope: !493, file: !7, line: 96, column: 113)
!493 = distinct !DILexicalBlock(scope: !490, file: !7, line: 96, column: 79)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !495, file: !7, line: 97, type: !17)
!495 = distinct !DILexicalBlock(scope: !485, file: !7, line: 97, column: 20)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !497, file: !7, line: 97, type: !17)
!497 = distinct !DILexicalBlock(scope: !498, file: !7, line: 97, column: 110)
!498 = distinct !DILexicalBlock(scope: !495, file: !7, line: 97, column: 76)
!499 = !{!500, !523, !527, !531, !535, !539, !543, !547}
!500 = !DIGlobalVariable(name: "atexitmodule", scope: !0, file: !7, line: 314, type: !501, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @atexitmodule)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !502, line: 47, size: 832, align: 64, elements: !503)
!502 = !DIFile(filename: "Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!503 = !{!504, !513, !514, !515, !516, !519, !520, !521, !522}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !501, file: !502, line: 48, baseType: !505, size: 320, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !502, line: 38, baseType: !506)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !502, line: 33, size: 320, align: 64, elements: !507)
!507 = !{!508, !509, !511, !512}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !506, file: !502, line: 34, baseType: !18, size: 128, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !506, file: !502, line: 35, baseType: !510, size: 64, align: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !506, file: !502, line: 36, baseType: !23, size: 64, align: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !506, file: !502, line: 37, baseType: !17, size: 64, align: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !501, file: !502, line: 49, baseType: !41, size: 64, align: 64, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !501, file: !502, line: 50, baseType: !41, size: 64, align: 64, offset: 384)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !501, file: !502, line: 51, baseType: !23, size: 64, align: 64, offset: 448)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !501, file: !502, line: 52, baseType: !517, size: 64, align: 64, offset: 512)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !293, line: 47, baseType: !292)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !501, file: !502, line: 53, baseType: !154, size: 64, align: 64, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !501, file: !502, line: 54, baseType: !271, size: 64, align: 64, offset: 640)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !501, file: !502, line: 55, baseType: !154, size: 64, align: 64, offset: 704)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !501, file: !502, line: 56, baseType: !341, size: 64, align: 64, offset: 768)
!523 = !DIGlobalVariable(name: "atexit__doc__", scope: !0, file: !7, line: 306, type: !524, isLocal: true, isDefinition: true, variable: [160 x i8]* @atexit__doc__)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 1280, align: 8, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 160)
!527 = !DIGlobalVariable(name: "atexit_methods", scope: !0, file: !7, line: 289, type: !528, isLocal: true, isDefinition: true, variable: [6 x %struct.PyMethodDef]* @atexit_methods)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 1536, align: 64, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 6)
!531 = !DIGlobalVariable(name: "atexit_register__doc__", scope: !0, file: !7, line: 117, type: !532, isLocal: true, isDefinition: true, variable: [310 x i8]* @atexit_register__doc__)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 2480, align: 8, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 310)
!535 = !DIGlobalVariable(name: "atexit_clear__doc__", scope: !0, file: !7, line: 194, type: !536, isLocal: true, isDefinition: true, variable: [74 x i8]* @atexit_clear__doc__)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 592, align: 8, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 74)
!539 = !DIGlobalVariable(name: "atexit_unregister__doc__", scope: !0, file: !7, line: 257, type: !540, isLocal: true, isDefinition: true, variable: [147 x i8]* @atexit_unregister__doc__)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 1176, align: 8, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 147)
!543 = !DIGlobalVariable(name: "atexit_run_exitfuncs__doc__", scope: !0, file: !7, line: 180, type: !544, isLocal: true, isDefinition: true, variable: [61 x i8]* @atexit_run_exitfuncs__doc__)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 488, align: 8, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 61)
!547 = !DIGlobalVariable(name: "atexit_ncallbacks__doc__", scope: !0, file: !7, line: 206, type: !548, isLocal: true, isDefinition: true, variable: [70 x i8]* @atexit_ncallbacks__doc__)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 560, align: 8, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 70)
!551 = !{i32 2, !"Dwarf Version", i32 4}
!552 = !{i32 2, !"Debug Info Version", i32 3}
!553 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!554 = !DILocation(line: 329, column: 5, scope: !369)
!555 = !DIExpression()
!556 = !DILocation(line: 329, column: 15, scope: !369)
!557 = !DILocation(line: 330, column: 5, scope: !369)
!558 = !DILocation(line: 330, column: 25, scope: !369)
!559 = !DILocation(line: 332, column: 9, scope: !369)
!560 = !DILocation(line: 332, column: 7, scope: !369)
!561 = !{!562, !562, i64 0}
!562 = !{!"any pointer", !563, i64 0}
!563 = !{!"omnipotent char", !564, i64 0}
!564 = !{!"Simple C/C++ TBAA"}
!565 = !DILocation(line: 333, column: 9, scope: !566)
!566 = distinct !DILexicalBlock(scope: !369, file: !7, line: 333, column: 9)
!567 = !DILocation(line: 333, column: 11, scope: !566)
!568 = !DILocation(line: 333, column: 9, scope: !369)
!569 = !DILocation(line: 334, column: 9, scope: !566)
!570 = !DILocation(line: 336, column: 56, scope: !369)
!571 = !DILocation(line: 336, column: 38, scope: !369)
!572 = !DILocation(line: 336, column: 17, scope: !369)
!573 = !DILocation(line: 336, column: 14, scope: !369)
!574 = !DILocation(line: 337, column: 5, scope: !369)
!575 = !DILocation(line: 337, column: 15, scope: !369)
!576 = !DILocation(line: 337, column: 28, scope: !369)
!577 = !{!578, !579, i64 12}
!578 = !{!"", !562, i64 0, !579, i64 8, !579, i64 12}
!579 = !{!"int", !563, i64 0}
