; ModuleID = 'programs_new/Python-new/bltinmodule.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!4 = !DIFile(filename: "Include/Python-ast.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "Module_kind", value: 1)
!7 = !DIEnumerator(name: "Interactive_kind", value: 2)
!8 = !DIEnumerator(name: "Expression_kind", value: 3)
!9 = !DIEnumerator(name: "Suite_kind", value: 4)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_expr_kind", file: !4, line: 180, size: 32, align: 32, elements: !11)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!12 = !DIEnumerator(name: "BoolOp_kind", value: 1)
!13 = !DIEnumerator(name: "BinOp_kind", value: 2)
!14 = !DIEnumerator(name: "UnaryOp_kind", value: 3)
!15 = !DIEnumerator(name: "Lambda_kind", value: 4)
!16 = !DIEnumerator(name: "IfExp_kind", value: 5)
!17 = !DIEnumerator(name: "Dict_kind", value: 6)
!18 = !DIEnumerator(name: "Set_kind", value: 7)
!19 = !DIEnumerator(name: "ListComp_kind", value: 8)
!20 = !DIEnumerator(name: "SetComp_kind", value: 9)
!21 = !DIEnumerator(name: "DictComp_kind", value: 10)
!22 = !DIEnumerator(name: "GeneratorExp_kind", value: 11)
!23 = !DIEnumerator(name: "Yield_kind", value: 12)
!24 = !DIEnumerator(name: "YieldFrom_kind", value: 13)
!25 = !DIEnumerator(name: "Compare_kind", value: 14)
!26 = !DIEnumerator(name: "Call_kind", value: 15)
!27 = !DIEnumerator(name: "Num_kind", value: 16)
!28 = !DIEnumerator(name: "Str_kind", value: 17)
!29 = !DIEnumerator(name: "Bytes_kind", value: 18)
!30 = !DIEnumerator(name: "NameConstant_kind", value: 19)
!31 = !DIEnumerator(name: "Ellipsis_kind", value: 20)
!32 = !DIEnumerator(name: "Attribute_kind", value: 21)
!33 = !DIEnumerator(name: "Subscript_kind", value: 22)
!34 = !DIEnumerator(name: "Starred_kind", value: 23)
!35 = !DIEnumerator(name: "Name_kind", value: 24)
!36 = !DIEnumerator(name: "List_kind", value: 25)
!37 = !DIEnumerator(name: "Tuple_kind", value: 26)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_boolop", file: !4, line: 16, size: 32, align: 32, elements: !39)
!39 = !{!40, !41}
!40 = !DIEnumerator(name: "And", value: 1)
!41 = !DIEnumerator(name: "Or", value: 2)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_operator", file: !4, line: 18, size: 32, align: 32, elements: !43)
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55}
!44 = !DIEnumerator(name: "Add", value: 1)
!45 = !DIEnumerator(name: "Sub", value: 2)
!46 = !DIEnumerator(name: "Mult", value: 3)
!47 = !DIEnumerator(name: "Div", value: 4)
!48 = !DIEnumerator(name: "Mod", value: 5)
!49 = !DIEnumerator(name: "Pow", value: 6)
!50 = !DIEnumerator(name: "LShift", value: 7)
!51 = !DIEnumerator(name: "RShift", value: 8)
!52 = !DIEnumerator(name: "BitOr", value: 9)
!53 = !DIEnumerator(name: "BitXor", value: 10)
!54 = !DIEnumerator(name: "BitAnd", value: 11)
!55 = !DIEnumerator(name: "FloorDiv", value: 12)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_unaryop", file: !4, line: 22, size: 32, align: 32, elements: !57)
!57 = !{!58, !59, !60, !61}
!58 = !DIEnumerator(name: "Invert", value: 1)
!59 = !DIEnumerator(name: "Not", value: 2)
!60 = !DIEnumerator(name: "UAdd", value: 3)
!61 = !DIEnumerator(name: "USub", value: 4)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_expr_context", file: !4, line: 11, size: 32, align: 32, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69}
!64 = !DIEnumerator(name: "Load", value: 1)
!65 = !DIEnumerator(name: "Store", value: 2)
!66 = !DIEnumerator(name: "Del", value: 3)
!67 = !DIEnumerator(name: "AugLoad", value: 4)
!68 = !DIEnumerator(name: "AugStore", value: 5)
!69 = !DIEnumerator(name: "Param", value: 6)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_slice_kind", file: !4, line: 323, size: 32, align: 32, elements: !71)
!71 = !{!72, !73, !74}
!72 = !DIEnumerator(name: "Slice_kind", value: 1)
!73 = !DIEnumerator(name: "ExtSlice_kind", value: 2)
!74 = !DIEnumerator(name: "Index_kind", value: 3)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !76, line: 451, size: 32, align: 32, elements: !77)
!76 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!77 = !{!78, !79, !80, !81}
!78 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!79 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!80 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!81 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!82 = !{!83, !84, !422, !430, !438, !439, !446, !454, !456, !96, !173, !474, !476, !108, !479, !480, !90, !478, !505, !513, !531, !532, !535, !543, !559, !561, !563, !573, !580}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !86, line: 109, baseType: !87)
!86 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !86, line: 105, size: 128, align: 64, elements: !88)
!88 = !{!89, !97}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !87, file: !86, line: 107, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !91, line: 177, baseType: !92)
!91 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !93, line: 102, baseType: !94)
!93 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !95, line: 181, baseType: !96)
!95 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!96 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !87, file: !86, line: 108, baseType: !98, size: 64, align: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !86, line: 334, size: 3200, align: 64, elements: !100)
!100 = !{!101, !107, !111, !112, !113, !118, !181, !186, !191, !192, !197, !249, !280, !292, !298, !299, !300, !302, !304, !335, !336, !337, !346, !347, !352, !353, !355, !357, !367, !370, !388, !389, !390, !392, !394, !395, !397, !402, !407, !412, !413, !414, !415, !416, !417, !418, !419, !421}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !99, file: !86, line: 335, baseType: !102, size: 192, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !86, line: 114, baseType: !103)
!103 = !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 111, size: 192, align: 64, elements: !104)
!104 = !{!105, !106}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !103, file: !86, line: 112, baseType: !85, size: 128, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !103, file: !86, line: 113, baseType: !90, size: 64, align: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !99, file: !86, line: 336, baseType: !108, size: 64, align: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !99, file: !86, line: 337, baseType: !90, size: 64, align: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !99, file: !86, line: 337, baseType: !90, size: 64, align: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !99, file: !86, line: 341, baseType: !114, size: 64, align: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !86, line: 308, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !84}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !99, file: !86, line: 342, baseType: !119, size: 64, align: 64, offset: 448)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !86, line: 314, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!123, !84, !124, !123}
!123 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !93, line: 48, baseType: !126)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !127, line: 246, size: 1728, align: 64, elements: !128)
!127 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!128 = !{!129, !130, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !150, !151, !152, !153, !155, !157, !159, !163, !166, !168, !169, !170, !171, !172, !176, !177}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !126, file: !127, line: 247, baseType: !123, size: 32, align: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !126, file: !127, line: 252, baseType: !131, size: 64, align: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !126, file: !127, line: 253, baseType: !131, size: 64, align: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !126, file: !127, line: 254, baseType: !131, size: 64, align: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !126, file: !127, line: 255, baseType: !131, size: 64, align: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !126, file: !127, line: 256, baseType: !131, size: 64, align: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !126, file: !127, line: 257, baseType: !131, size: 64, align: 64, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !126, file: !127, line: 258, baseType: !131, size: 64, align: 64, offset: 448)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !126, file: !127, line: 259, baseType: !131, size: 64, align: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !126, file: !127, line: 261, baseType: !131, size: 64, align: 64, offset: 576)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !126, file: !127, line: 262, baseType: !131, size: 64, align: 64, offset: 640)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !126, file: !127, line: 263, baseType: !131, size: 64, align: 64, offset: 704)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !126, file: !127, line: 265, baseType: !143, size: 64, align: 64, offset: 768)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !127, line: 161, size: 192, align: 64, elements: !145)
!145 = !{!146, !147, !149}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !144, file: !127, line: 162, baseType: !143, size: 64, align: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !144, file: !127, line: 163, baseType: !148, size: 64, align: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !144, file: !127, line: 167, baseType: !123, size: 32, align: 32, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !126, file: !127, line: 267, baseType: !148, size: 64, align: 64, offset: 832)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !126, file: !127, line: 269, baseType: !123, size: 32, align: 32, offset: 896)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !126, file: !127, line: 273, baseType: !123, size: 32, align: 32, offset: 928)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !126, file: !127, line: 275, baseType: !154, size: 64, align: 64, offset: 960)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !95, line: 140, baseType: !96)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !126, file: !127, line: 279, baseType: !156, size: 16, align: 16, offset: 1024)
!156 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !126, file: !127, line: 280, baseType: !158, size: 8, align: 8, offset: 1040)
!158 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !126, file: !127, line: 281, baseType: !160, size: 8, align: 8, offset: 1048)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 8, align: 8, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 1)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !126, file: !127, line: 285, baseType: !164, size: 64, align: 64, offset: 1088)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !127, line: 155, baseType: null)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !126, file: !127, line: 294, baseType: !167, size: 64, align: 64, offset: 1152)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !95, line: 141, baseType: !96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !126, file: !127, line: 303, baseType: !83, size: 64, align: 64, offset: 1216)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !126, file: !127, line: 304, baseType: !83, size: 64, align: 64, offset: 1280)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !126, file: !127, line: 305, baseType: !83, size: 64, align: 64, offset: 1344)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !126, file: !127, line: 306, baseType: !83, size: 64, align: 64, offset: 1408)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !126, file: !127, line: 307, baseType: !173, size: 64, align: 64, offset: 1472)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !174, line: 62, baseType: !175)
!174 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!175 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !126, file: !127, line: 309, baseType: !123, size: 32, align: 32, offset: 1536)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !126, file: !127, line: 311, baseType: !178, size: 160, align: 8, offset: 1568)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 160, align: 8, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 20)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !99, file: !86, line: 343, baseType: !182, size: 64, align: 64, offset: 512)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !86, line: 316, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!84, !84, !131}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !99, file: !86, line: 344, baseType: !187, size: 64, align: 64, offset: 576)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !86, line: 318, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!123, !84, !131, !84}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !99, file: !86, line: 345, baseType: !83, size: 64, align: 64, offset: 640)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !99, file: !86, line: 346, baseType: !193, size: 64, align: 64, offset: 704)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !86, line: 320, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64, align: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!84, !84}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !99, file: !86, line: 350, baseType: !198, size: 64, align: 64, offset: 768)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !86, line: 278, baseType: !200)
!200 = !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 236, size: 2176, align: 64, elements: !201)
!201 = !{!202, !207, !208, !209, !210, !211, !216, !218, !219, !220, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !200, file: !86, line: 241, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !86, line: 166, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!84, !84, !84}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !200, file: !86, line: 242, baseType: !203, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !200, file: !86, line: 243, baseType: !203, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !200, file: !86, line: 244, baseType: !203, size: 64, align: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !200, file: !86, line: 245, baseType: !203, size: 64, align: 64, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !200, file: !86, line: 246, baseType: !212, size: 64, align: 64, offset: 320)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !86, line: 167, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!84, !84, !84, !84}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !200, file: !86, line: 247, baseType: !217, size: 64, align: 64, offset: 384)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !86, line: 165, baseType: !194)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !200, file: !86, line: 248, baseType: !217, size: 64, align: 64, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !200, file: !86, line: 249, baseType: !217, size: 64, align: 64, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !200, file: !86, line: 250, baseType: !221, size: 64, align: 64, offset: 576)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !86, line: 168, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!123, !84}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !200, file: !86, line: 251, baseType: !217, size: 64, align: 64, offset: 640)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !200, file: !86, line: 252, baseType: !203, size: 64, align: 64, offset: 704)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !200, file: !86, line: 253, baseType: !203, size: 64, align: 64, offset: 768)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !200, file: !86, line: 254, baseType: !203, size: 64, align: 64, offset: 832)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !200, file: !86, line: 255, baseType: !203, size: 64, align: 64, offset: 896)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !200, file: !86, line: 256, baseType: !203, size: 64, align: 64, offset: 960)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !200, file: !86, line: 257, baseType: !217, size: 64, align: 64, offset: 1024)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !200, file: !86, line: 258, baseType: !83, size: 64, align: 64, offset: 1088)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !200, file: !86, line: 259, baseType: !217, size: 64, align: 64, offset: 1152)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !200, file: !86, line: 261, baseType: !203, size: 64, align: 64, offset: 1216)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !200, file: !86, line: 262, baseType: !203, size: 64, align: 64, offset: 1280)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !200, file: !86, line: 263, baseType: !203, size: 64, align: 64, offset: 1344)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !200, file: !86, line: 264, baseType: !203, size: 64, align: 64, offset: 1408)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !200, file: !86, line: 265, baseType: !212, size: 64, align: 64, offset: 1472)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !200, file: !86, line: 266, baseType: !203, size: 64, align: 64, offset: 1536)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !200, file: !86, line: 267, baseType: !203, size: 64, align: 64, offset: 1600)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !200, file: !86, line: 268, baseType: !203, size: 64, align: 64, offset: 1664)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !200, file: !86, line: 269, baseType: !203, size: 64, align: 64, offset: 1728)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !200, file: !86, line: 270, baseType: !203, size: 64, align: 64, offset: 1792)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !200, file: !86, line: 272, baseType: !203, size: 64, align: 64, offset: 1856)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !200, file: !86, line: 273, baseType: !203, size: 64, align: 64, offset: 1920)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !200, file: !86, line: 274, baseType: !203, size: 64, align: 64, offset: 1984)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !200, file: !86, line: 275, baseType: !203, size: 64, align: 64, offset: 2048)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !200, file: !86, line: 277, baseType: !217, size: 64, align: 64, offset: 2112)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !99, file: !86, line: 351, baseType: !250, size: 64, align: 64, offset: 832)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !86, line: 292, baseType: !252)
!252 = !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 280, size: 640, align: 64, elements: !253)
!253 = !{!254, !259, !260, !265, !266, !267, !272, !273, !278, !279}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !252, file: !86, line: 281, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !86, line: 169, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!90, !84}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !252, file: !86, line: 282, baseType: !203, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !252, file: !86, line: 283, baseType: !261, size: 64, align: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !86, line: 170, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!84, !84, !90}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !252, file: !86, line: 284, baseType: !261, size: 64, align: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !252, file: !86, line: 285, baseType: !83, size: 64, align: 64, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !252, file: !86, line: 286, baseType: !268, size: 64, align: 64, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !86, line: 172, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64, align: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!123, !84, !90, !84}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !252, file: !86, line: 287, baseType: !83, size: 64, align: 64, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !252, file: !86, line: 288, baseType: !274, size: 64, align: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !86, line: 231, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!123, !84, !84}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !252, file: !86, line: 290, baseType: !203, size: 64, align: 64, offset: 512)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !252, file: !86, line: 291, baseType: !261, size: 64, align: 64, offset: 576)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !99, file: !86, line: 352, baseType: !281, size: 64, align: 64, offset: 896)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !86, line: 298, baseType: !283)
!283 = !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 294, size: 192, align: 64, elements: !284)
!284 = !{!285, !286, !287}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !283, file: !86, line: 295, baseType: !255, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !283, file: !86, line: 296, baseType: !203, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !283, file: !86, line: 297, baseType: !288, size: 64, align: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !86, line: 174, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!123, !84, !84, !84}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !99, file: !86, line: 356, baseType: !293, size: 64, align: 64, offset: 960)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !86, line: 321, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!297, !84}
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !91, line: 186, baseType: !90)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !99, file: !86, line: 357, baseType: !212, size: 64, align: 64, offset: 1024)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !99, file: !86, line: 358, baseType: !193, size: 64, align: 64, offset: 1088)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !99, file: !86, line: 359, baseType: !301, size: 64, align: 64, offset: 1152)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !86, line: 317, baseType: !204)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !99, file: !86, line: 360, baseType: !303, size: 64, align: 64, offset: 1216)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !86, line: 319, baseType: !289)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !99, file: !86, line: 363, baseType: !305, size: 64, align: 64, offset: 1280)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !86, line: 304, baseType: !307)
!307 = !DICompositeType(tag: DW_TAG_structure_type, file: !86, line: 301, size: 128, align: 64, elements: !308)
!308 = !{!309, !330}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !307, file: !86, line: 302, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !86, line: 193, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!123, !84, !314, !123}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !86, line: 191, baseType: !316)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !86, line: 178, size: 640, align: 64, elements: !317)
!317 = !{!318, !319, !320, !321, !322, !323, !324, !325, !327, !328, !329}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !316, file: !86, line: 179, baseType: !83, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !316, file: !86, line: 180, baseType: !84, size: 64, align: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !316, file: !86, line: 181, baseType: !90, size: 64, align: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !316, file: !86, line: 182, baseType: !90, size: 64, align: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !316, file: !86, line: 184, baseType: !123, size: 32, align: 32, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !316, file: !86, line: 185, baseType: !123, size: 32, align: 32, offset: 288)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !316, file: !86, line: 186, baseType: !131, size: 64, align: 64, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !316, file: !86, line: 187, baseType: !326, size: 64, align: 64, offset: 384)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !316, file: !86, line: 188, baseType: !326, size: 64, align: 64, offset: 448)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !316, file: !86, line: 189, baseType: !326, size: 64, align: 64, offset: 512)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !316, file: !86, line: 190, baseType: !83, size: 64, align: 64, offset: 576)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !307, file: !86, line: 303, baseType: !331, size: 64, align: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !86, line: 194, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{null, !84, !314}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !99, file: !86, line: 366, baseType: !175, size: 64, align: 64, offset: 1344)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !99, file: !86, line: 368, baseType: !108, size: 64, align: 64, offset: 1408)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !99, file: !86, line: 372, baseType: !338, size: 64, align: 64, offset: 1472)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !86, line: 233, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!123, !84, !342, !83}
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !86, line: 232, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!123, !84, !83}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !99, file: !86, line: 375, baseType: !221, size: 64, align: 64, offset: 1536)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !99, file: !86, line: 379, baseType: !348, size: 64, align: 64, offset: 1600)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !86, line: 322, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!84, !84, !84, !123}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !99, file: !86, line: 382, baseType: !90, size: 64, align: 64, offset: 1664)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !99, file: !86, line: 385, baseType: !354, size: 64, align: 64, offset: 1728)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !86, line: 323, baseType: !194)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !99, file: !86, line: 386, baseType: !356, size: 64, align: 64, offset: 1792)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !86, line: 324, baseType: !194)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !99, file: !86, line: 389, baseType: !358, size: 64, align: 64, offset: 1856)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !360, line: 40, size: 256, align: 64, elements: !361)
!360 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!361 = !{!362, !363, !365, !366}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !359, file: !360, line: 41, baseType: !108, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !359, file: !360, line: 42, baseType: !364, size: 64, align: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !360, line: 18, baseType: !204)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !359, file: !360, line: 43, baseType: !123, size: 32, align: 32, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !359, file: !360, line: 45, baseType: !108, size: 64, align: 64, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !99, file: !86, line: 390, baseType: !368, size: 64, align: 64, offset: 1920)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !86, line: 390, flags: DIFlagFwdDecl)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !99, file: !86, line: 391, baseType: !371, size: 64, align: 64, offset: 1984)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !373, line: 11, size: 320, align: 64, elements: !374)
!373 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!374 = !{!375, !376, !381, !386, !387}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !372, file: !373, line: 12, baseType: !131, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !372, file: !373, line: 13, baseType: !377, size: 64, align: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !373, line: 8, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!84, !84, !83}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !372, file: !373, line: 14, baseType: !382, size: 64, align: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !373, line: 9, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!123, !84, !84, !83}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !372, file: !373, line: 15, baseType: !131, size: 64, align: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !372, file: !373, line: 16, baseType: !83, size: 64, align: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !99, file: !86, line: 392, baseType: !98, size: 64, align: 64, offset: 2048)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !99, file: !86, line: 393, baseType: !84, size: 64, align: 64, offset: 2112)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !99, file: !86, line: 394, baseType: !391, size: 64, align: 64, offset: 2176)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !86, line: 325, baseType: !213)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !99, file: !86, line: 395, baseType: !393, size: 64, align: 64, offset: 2240)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !86, line: 326, baseType: !289)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !99, file: !86, line: 396, baseType: !90, size: 64, align: 64, offset: 2304)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !99, file: !86, line: 397, baseType: !396, size: 64, align: 64, offset: 2368)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !86, line: 327, baseType: !289)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !99, file: !86, line: 398, baseType: !398, size: 64, align: 64, offset: 2432)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !86, line: 329, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!84, !98, !90}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !99, file: !86, line: 399, baseType: !403, size: 64, align: 64, offset: 2496)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !86, line: 328, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DISubroutineType(types: !406)
!406 = !{!84, !98, !84, !84}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !99, file: !86, line: 400, baseType: !408, size: 64, align: 64, offset: 2560)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !86, line: 307, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !83}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !99, file: !86, line: 401, baseType: !221, size: 64, align: 64, offset: 2624)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !99, file: !86, line: 402, baseType: !84, size: 64, align: 64, offset: 2688)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !99, file: !86, line: 403, baseType: !84, size: 64, align: 64, offset: 2752)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !99, file: !86, line: 404, baseType: !84, size: 64, align: 64, offset: 2816)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !99, file: !86, line: 405, baseType: !84, size: 64, align: 64, offset: 2880)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !99, file: !86, line: 406, baseType: !84, size: 64, align: 64, offset: 2944)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !99, file: !86, line: 407, baseType: !114, size: 64, align: 64, offset: 3008)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !99, file: !86, line: 410, baseType: !420, size: 32, align: 32, offset: 3072)
!420 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !99, file: !86, line: 412, baseType: !114, size: 64, align: 64, offset: 3136)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "filterobject", file: !424, line: 378, baseType: !425)
!424 = !DIFile(filename: "Python/bltinmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!425 = !DICompositeType(tag: DW_TAG_structure_type, file: !424, line: 374, size: 256, align: 64, elements: !426)
!426 = !{!427, !428, !429}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !425, file: !424, line: 375, baseType: !85, size: 128, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !425, file: !424, line: 376, baseType: !84, size: 64, align: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !425, file: !424, line: 377, baseType: !84, size: 64, align: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !432, line: 33, baseType: !433)
!432 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!433 = !DICompositeType(tag: DW_TAG_structure_type, file: !432, line: 25, size: 256, align: 64, elements: !434)
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !433, file: !432, line: 26, baseType: !102, size: 192, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !433, file: !432, line: 27, baseType: !437, size: 64, align: 64, offset: 192)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 64, align: 64, elements: !161)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "mapobject", file: !424, line: 1007, baseType: !441)
!441 = !DICompositeType(tag: DW_TAG_structure_type, file: !424, line: 1003, size: 256, align: 64, elements: !442)
!442 = !{!443, !444, !445}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !441, file: !424, line: 1004, baseType: !85, size: 128, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "iters", scope: !441, file: !424, line: 1005, baseType: !84, size: 64, align: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !441, file: !424, line: 1006, baseType: !84, size: 64, align: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "zipobject", file: !424, line: 2201, baseType: !448)
!448 = !DICompositeType(tag: DW_TAG_structure_type, file: !424, line: 2196, size: 320, align: 64, elements: !449)
!449 = !{!450, !451, !452, !453}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !448, file: !424, line: 2197, baseType: !85, size: 128, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "tuplesize", scope: !448, file: !424, line: 2198, baseType: !90, size: 64, align: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ittuple", scope: !448, file: !424, line: 2199, baseType: !84, size: 64, align: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !448, file: !424, line: 2200, baseType: !84, size: 64, align: 64, offset: 256)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !86, line: 422, baseType: !99)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFunctionObject", file: !458, line: 41, baseType: !459)
!458 = !DIFile(filename: "Include/funcobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!459 = !DICompositeType(tag: DW_TAG_structure_type, file: !458, line: 21, size: 896, align: 64, elements: !460)
!460 = !{!461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !459, file: !458, line: 22, baseType: !85, size: 128, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "func_code", scope: !459, file: !458, line: 23, baseType: !84, size: 64, align: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "func_globals", scope: !459, file: !458, line: 24, baseType: !84, size: 64, align: 64, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "func_defaults", scope: !459, file: !458, line: 25, baseType: !84, size: 64, align: 64, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "func_kwdefaults", scope: !459, file: !458, line: 26, baseType: !84, size: 64, align: 64, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "func_closure", scope: !459, file: !458, line: 27, baseType: !84, size: 64, align: 64, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "func_doc", scope: !459, file: !458, line: 28, baseType: !84, size: 64, align: 64, offset: 448)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "func_name", scope: !459, file: !458, line: 29, baseType: !84, size: 64, align: 64, offset: 512)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "func_dict", scope: !459, file: !458, line: 30, baseType: !84, size: 64, align: 64, offset: 576)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "func_weakreflist", scope: !459, file: !458, line: 31, baseType: !84, size: 64, align: 64, offset: 640)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "func_module", scope: !459, file: !458, line: 32, baseType: !84, size: 64, align: 64, offset: 704)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "func_annotations", scope: !459, file: !458, line: 33, baseType: !84, size: 64, align: 64, offset: 768)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "func_qualname", scope: !459, file: !458, line: 34, baseType: !84, size: 64, align: 64, offset: 832)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!478 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !482, line: 33, baseType: !483)
!482 = !DIFile(filename: "Include/code.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!483 = !DICompositeType(tag: DW_TAG_structure_type, file: !482, line: 11, size: 1152, align: 64, elements: !484)
!484 = !{!485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !499, !500, !501, !502, !503, !504}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !483, file: !482, line: 12, baseType: !85, size: 128, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !483, file: !482, line: 13, baseType: !123, size: 32, align: 32, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !483, file: !482, line: 14, baseType: !123, size: 32, align: 32, offset: 160)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !483, file: !482, line: 15, baseType: !123, size: 32, align: 32, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !483, file: !482, line: 16, baseType: !123, size: 32, align: 32, offset: 224)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !483, file: !482, line: 17, baseType: !123, size: 32, align: 32, offset: 256)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "co_code", scope: !483, file: !482, line: 18, baseType: !84, size: 64, align: 64, offset: 320)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !483, file: !482, line: 19, baseType: !84, size: 64, align: 64, offset: 384)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !483, file: !482, line: 20, baseType: !84, size: 64, align: 64, offset: 448)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "co_varnames", scope: !483, file: !482, line: 21, baseType: !84, size: 64, align: 64, offset: 512)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "co_freevars", scope: !483, file: !482, line: 22, baseType: !84, size: 64, align: 64, offset: 576)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "co_cellvars", scope: !483, file: !482, line: 23, baseType: !84, size: 64, align: 64, offset: 640)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "co_cell2arg", scope: !483, file: !482, line: 25, baseType: !498, size: 64, align: 64, offset: 704)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !483, file: !482, line: 26, baseType: !84, size: 64, align: 64, offset: 768)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !483, file: !482, line: 27, baseType: !84, size: 64, align: 64, offset: 832)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !483, file: !482, line: 28, baseType: !123, size: 32, align: 32, offset: 896)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "co_lnotab", scope: !483, file: !482, line: 29, baseType: !84, size: 64, align: 64, offset: 960)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "co_zombieframe", scope: !483, file: !482, line: 31, baseType: !83, size: 64, align: 64, offset: 1024)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !483, file: !482, line: 32, baseType: !84, size: 64, align: 64, offset: 1088)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64, align: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !507, line: 41, baseType: !508)
!507 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!508 = !DICompositeType(tag: DW_TAG_structure_type, file: !507, line: 31, size: 320, align: 64, elements: !509)
!509 = !{!510, !511, !512}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !508, file: !507, line: 32, baseType: !102, size: 192, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !508, file: !507, line: 33, baseType: !297, size: 64, align: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !508, file: !507, line: 34, baseType: !160, size: 8, align: 8, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !76, line: 351, baseType: !515)
!515 = !DICompositeType(tag: DW_TAG_structure_type, file: !76, line: 217, size: 384, align: 64, elements: !516)
!516 = !{!517, !518, !519, !520, !528}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !515, file: !76, line: 291, baseType: !85, size: 128, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !515, file: !76, line: 292, baseType: !90, size: 64, align: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !515, file: !76, line: 293, baseType: !297, size: 64, align: 64, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !515, file: !76, line: 349, baseType: !521, size: 32, align: 32, offset: 256)
!521 = !DICompositeType(tag: DW_TAG_structure_type, scope: !515, file: !76, line: 294, size: 32, align: 32, elements: !522)
!522 = !{!523, !524, !525, !526, !527}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !521, file: !76, line: 303, baseType: !420, size: 2, align: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !521, file: !76, line: 331, baseType: !420, size: 3, align: 32, offset: 2)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !521, file: !76, line: 336, baseType: !420, size: 1, align: 32, offset: 5)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !521, file: !76, line: 340, baseType: !420, size: 1, align: 32, offset: 6)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !521, file: !76, line: 345, baseType: !420, size: 1, align: 32, offset: 7)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !515, file: !76, line: 350, baseType: !529, size: 64, align: 64, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !174, line: 90, baseType: !123)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !76, line: 121, baseType: !420)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !76, line: 134, baseType: !478)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !76, line: 363, baseType: !537)
!537 = !DICompositeType(tag: DW_TAG_structure_type, file: !76, line: 356, size: 576, align: 64, elements: !538)
!538 = !{!539, !540, !541, !542}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !537, file: !76, line: 357, baseType: !514, size: 384, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !537, file: !76, line: 358, baseType: !90, size: 64, align: 64, offset: 384)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !537, file: !76, line: 360, baseType: !131, size: 64, align: 64, offset: 448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !537, file: !76, line: 361, baseType: !90, size: 64, align: 64, offset: 512)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !76, line: 376, baseType: !545)
!545 = !DICompositeType(tag: DW_TAG_structure_type, file: !76, line: 368, size: 640, align: 64, elements: !546)
!546 = !{!547, !548}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !545, file: !76, line: 369, baseType: !536, size: 576, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !545, file: !76, line: 375, baseType: !549, size: 64, align: 64, offset: 576)
!549 = !DICompositeType(tag: DW_TAG_union_type, scope: !545, file: !76, line: 370, size: 64, align: 64, elements: !550)
!550 = !{!551, !552, !554, !557}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !549, file: !76, line: 371, baseType: !83, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !549, file: !76, line: 372, baseType: !553, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !549, file: !76, line: 373, baseType: !555, size: 64, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !76, line: 129, baseType: !156)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !549, file: !76, line: 374, baseType: !558, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !556)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !531)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64, align: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyByteArrayObject", file: !565, line: 30, baseType: !566)
!565 = !DIFile(filename: "Include/bytearrayobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!566 = !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 23, size: 448, align: 64, elements: !567)
!567 = !{!568, !569, !570, !571, !572}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !566, file: !565, line: 24, baseType: !102, size: 192, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ob_alloc", scope: !566, file: !565, line: 25, baseType: !90, size: 64, align: 64, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ob_bytes", scope: !566, file: !565, line: 26, baseType: !131, size: 64, align: 64, offset: 256)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ob_start", scope: !566, file: !565, line: 27, baseType: !131, size: 64, align: 64, offset: 320)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ob_exports", scope: !566, file: !565, line: 29, baseType: !123, size: 32, align: 32, offset: 384)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFloatObject", file: !575, line: 18, baseType: !576)
!575 = !DIFile(filename: "Include/floatobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!576 = !DICompositeType(tag: DW_TAG_structure_type, file: !575, line: 15, size: 192, align: 64, elements: !577)
!577 = !{!578, !579}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !576, file: !575, line: 16, baseType: !85, size: 128, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ob_fval", scope: !576, file: !575, line: 17, baseType: !580, size: 64, align: 64, offset: 128)
!580 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!581 = !{!582, !601, !616, !631, !654, !657, !672, !687, !702, !721, !731, !753, !768, !783, !813, !816, !845, !963, !973, !977, !1000, !1023, !1027, !1031, !1035, !1040, !1323, !1334, !1340, !1345, !1351, !1367, !1381, !1387, !1395, !1401, !1409, !1414, !1418, !1422, !1522, !1529, !1536, !1542, !1547, !1553, !1558, !1615, !1620, !1627, !1631, !1637, !1644, !1665, !1669, !1680, !1687, !1719, !1827}
!582 = !DISubprogram(name: "_PyBuiltin_Init", scope: !424, file: !424, line: 2450, type: !583, isLocal: false, isDefinition: true, scopeLine: 2451, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @_PyBuiltin_Init, variables: !585)
!583 = !DISubroutineType(types: !584)
!584 = !{!84}
!585 = !{!586, !587, !588, !589, !593, !596, !598}
!586 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !582, file: !424, line: 2452, type: !84)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !582, file: !424, line: 2452, type: !84)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "debug", scope: !582, file: !424, line: 2452, type: !84)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !590, file: !424, line: 2514, type: !84)
!590 = distinct !DILexicalBlock(scope: !591, file: !424, line: 2514, column: 12)
!591 = distinct !DILexicalBlock(scope: !592, file: !424, line: 2513, column: 61)
!592 = distinct !DILexicalBlock(scope: !582, file: !424, line: 2513, column: 9)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !594, file: !424, line: 2514, type: !84)
!594 = distinct !DILexicalBlock(scope: !595, file: !424, line: 2514, column: 101)
!595 = distinct !DILexicalBlock(scope: !590, file: !424, line: 2514, column: 67)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !597, file: !424, line: 2517, type: !84)
!597 = distinct !DILexicalBlock(scope: !582, file: !424, line: 2517, column: 8)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !599, file: !424, line: 2517, type: !84)
!599 = distinct !DILexicalBlock(scope: !600, file: !424, line: 2517, column: 97)
!600 = distinct !DILexicalBlock(scope: !597, file: !424, line: 2517, column: 63)
!601 = !DISubprogram(name: "filter_dealloc", scope: !424, file: !424, line: 412, type: !602, isLocal: true, isDefinition: true, scopeLine: 413, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.filterobject*)* @filter_dealloc, variables: !604)
!602 = !DISubroutineType(types: !603)
!603 = !{null, !422}
!604 = !{!605, !606, !608, !611, !613}
!605 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !601, file: !424, line: 412, type: !422)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !607, file: !424, line: 415, type: !84)
!607 = distinct !DILexicalBlock(scope: !601, file: !424, line: 415, column: 8)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !609, file: !424, line: 415, type: !84)
!609 = distinct !DILexicalBlock(scope: !610, file: !424, line: 415, column: 100)
!610 = distinct !DILexicalBlock(scope: !607, file: !424, line: 415, column: 66)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !612, file: !424, line: 416, type: !84)
!612 = distinct !DILexicalBlock(scope: !601, file: !424, line: 416, column: 8)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !614, file: !424, line: 416, type: !84)
!614 = distinct !DILexicalBlock(scope: !615, file: !424, line: 416, column: 98)
!615 = distinct !DILexicalBlock(scope: !612, file: !424, line: 416, column: 64)
!616 = !DISubprogram(name: "filter_traverse", scope: !424, file: !424, line: 421, type: !617, isLocal: true, isDefinition: true, scopeLine: 422, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.filterobject*, i32 (%struct._object*, i8*)*, i8*)* @filter_traverse, variables: !619)
!617 = !DISubroutineType(types: !618)
!618 = !{!123, !422, !342, !83}
!619 = !{!620, !621, !622, !623, !627}
!620 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !616, file: !424, line: 421, type: !422)
!621 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !616, file: !424, line: 421, type: !342)
!622 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !616, file: !424, line: 421, type: !83)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !624, file: !424, line: 423, type: !123)
!624 = distinct !DILexicalBlock(scope: !625, file: !424, line: 423, column: 22)
!625 = distinct !DILexicalBlock(scope: !626, file: !424, line: 423, column: 14)
!626 = distinct !DILexicalBlock(scope: !616, file: !424, line: 423, column: 8)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !628, file: !424, line: 424, type: !123)
!628 = distinct !DILexicalBlock(scope: !629, file: !424, line: 424, column: 24)
!629 = distinct !DILexicalBlock(scope: !630, file: !424, line: 424, column: 14)
!630 = distinct !DILexicalBlock(scope: !616, file: !424, line: 424, column: 8)
!631 = !DISubprogram(name: "filter_next", scope: !424, file: !424, line: 429, type: !632, isLocal: true, isDefinition: true, scopeLine: 430, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.filterobject*)* @filter_next, variables: !634)
!632 = !DISubroutineType(types: !633)
!633 = !{!84, !422}
!634 = !{!635, !636, !637, !638, !639, !640, !646, !650, !652}
!635 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !631, file: !424, line: 429, type: !422)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !631, file: !424, line: 431, type: !84)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !631, file: !424, line: 432, type: !84)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ok", scope: !631, file: !424, line: 433, type: !96)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iternext", scope: !631, file: !424, line: 434, type: !194)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "good", scope: !641, file: !424, line: 445, type: !84)
!641 = distinct !DILexicalBlock(scope: !642, file: !424, line: 444, column: 16)
!642 = distinct !DILexicalBlock(scope: !643, file: !424, line: 442, column: 13)
!643 = distinct !DILexicalBlock(scope: !644, file: !424, line: 437, column: 14)
!644 = distinct !DILexicalBlock(scope: !645, file: !424, line: 437, column: 5)
!645 = distinct !DILexicalBlock(scope: !631, file: !424, line: 437, column: 5)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !647, file: !424, line: 449, type: !84)
!647 = distinct !DILexicalBlock(scope: !648, file: !424, line: 449, column: 20)
!648 = distinct !DILexicalBlock(scope: !649, file: !424, line: 448, column: 37)
!649 = distinct !DILexicalBlock(scope: !641, file: !424, line: 448, column: 17)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !651, file: !424, line: 453, type: !84)
!651 = distinct !DILexicalBlock(scope: !641, file: !424, line: 453, column: 16)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !653, file: !424, line: 457, type: !84)
!653 = distinct !DILexicalBlock(scope: !643, file: !424, line: 457, column: 12)
!654 = !DISubprogram(name: "filter_reduce", scope: !424, file: !424, line: 464, type: !632, isLocal: true, isDefinition: true, scopeLine: 465, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.filterobject*)* @filter_reduce, variables: !655)
!655 = !{!656}
!656 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !654, file: !424, line: 464, type: !422)
!657 = !DISubprogram(name: "filter_new", scope: !424, file: !424, line: 381, type: !658, isLocal: true, isDefinition: true, scopeLine: 382, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @filter_new, variables: !660)
!658 = !DISubroutineType(types: !659)
!659 = !{!84, !454, !84, !84}
!660 = !{!661, !662, !663, !664, !665, !666, !667, !668}
!661 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !657, file: !424, line: 381, type: !454)
!662 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !657, file: !424, line: 381, type: !84)
!663 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !657, file: !424, line: 381, type: !84)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !657, file: !424, line: 383, type: !84)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seq", scope: !657, file: !424, line: 383, type: !84)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !657, file: !424, line: 384, type: !84)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lz", scope: !657, file: !424, line: 385, type: !422)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !669, file: !424, line: 401, type: !84)
!669 = distinct !DILexicalBlock(scope: !670, file: !424, line: 401, column: 12)
!670 = distinct !DILexicalBlock(scope: !671, file: !424, line: 400, column: 27)
!671 = distinct !DILexicalBlock(scope: !657, file: !424, line: 400, column: 9)
!672 = !DISubprogram(name: "map_dealloc", scope: !424, file: !424, line: 1055, type: !673, isLocal: true, isDefinition: true, scopeLine: 1056, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.mapobject*)* @map_dealloc, variables: !675)
!673 = !DISubroutineType(types: !674)
!674 = !{null, !439}
!675 = !{!676, !677, !679, !682, !684}
!676 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !672, file: !424, line: 1055, type: !439)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !678, file: !424, line: 1058, type: !84)
!678 = distinct !DILexicalBlock(scope: !672, file: !424, line: 1058, column: 8)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !680, file: !424, line: 1058, type: !84)
!680 = distinct !DILexicalBlock(scope: !681, file: !424, line: 1058, column: 101)
!681 = distinct !DILexicalBlock(scope: !678, file: !424, line: 1058, column: 67)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !683, file: !424, line: 1059, type: !84)
!683 = distinct !DILexicalBlock(scope: !672, file: !424, line: 1059, column: 8)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !685, file: !424, line: 1059, type: !84)
!685 = distinct !DILexicalBlock(scope: !686, file: !424, line: 1059, column: 100)
!686 = distinct !DILexicalBlock(scope: !683, file: !424, line: 1059, column: 66)
!687 = !DISubprogram(name: "map_traverse", scope: !424, file: !424, line: 1064, type: !688, isLocal: true, isDefinition: true, scopeLine: 1065, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.mapobject*, i32 (%struct._object*, i8*)*, i8*)* @map_traverse, variables: !690)
!688 = !DISubroutineType(types: !689)
!689 = !{!123, !439, !342, !83}
!690 = !{!691, !692, !693, !694, !698}
!691 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !687, file: !424, line: 1064, type: !439)
!692 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !687, file: !424, line: 1064, type: !342)
!693 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !687, file: !424, line: 1064, type: !83)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !695, file: !424, line: 1066, type: !123)
!695 = distinct !DILexicalBlock(scope: !696, file: !424, line: 1066, column: 25)
!696 = distinct !DILexicalBlock(scope: !697, file: !424, line: 1066, column: 14)
!697 = distinct !DILexicalBlock(scope: !687, file: !424, line: 1066, column: 8)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !699, file: !424, line: 1067, type: !123)
!699 = distinct !DILexicalBlock(scope: !700, file: !424, line: 1067, column: 24)
!700 = distinct !DILexicalBlock(scope: !701, file: !424, line: 1067, column: 14)
!701 = distinct !DILexicalBlock(scope: !687, file: !424, line: 1067, column: 8)
!702 = !DISubprogram(name: "map_next", scope: !424, file: !424, line: 1072, type: !703, isLocal: true, isDefinition: true, scopeLine: 1073, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mapobject*)* @map_next, variables: !705)
!703 = !DISubroutineType(types: !704)
!704 = !{!84, !439}
!705 = !{!706, !707, !708, !709, !710, !711, !712, !719}
!706 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !702, file: !424, line: 1072, type: !439)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !702, file: !424, line: 1074, type: !84)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "argtuple", scope: !702, file: !424, line: 1075, type: !84)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !702, file: !424, line: 1076, type: !84)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numargs", scope: !702, file: !424, line: 1077, type: !90)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !702, file: !424, line: 1077, type: !90)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !713, file: !424, line: 1087, type: !84)
!713 = distinct !DILexicalBlock(scope: !714, file: !424, line: 1087, column: 16)
!714 = distinct !DILexicalBlock(scope: !715, file: !424, line: 1086, column: 32)
!715 = distinct !DILexicalBlock(scope: !716, file: !424, line: 1086, column: 13)
!716 = distinct !DILexicalBlock(scope: !717, file: !424, line: 1084, column: 33)
!717 = distinct !DILexicalBlock(scope: !718, file: !424, line: 1084, column: 5)
!718 = distinct !DILexicalBlock(scope: !702, file: !424, line: 1084, column: 5)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !720, file: !424, line: 1093, type: !84)
!720 = distinct !DILexicalBlock(scope: !702, file: !424, line: 1093, column: 8)
!721 = !DISubprogram(name: "map_reduce", scope: !424, file: !424, line: 1098, type: !703, isLocal: true, isDefinition: true, scopeLine: 1099, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mapobject*)* @map_reduce, variables: !722)
!722 = !{!723, !724, !725, !726, !727}
!723 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !721, file: !424, line: 1098, type: !439)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numargs", scope: !721, file: !424, line: 1100, type: !90)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !721, file: !424, line: 1101, type: !84)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !721, file: !424, line: 1102, type: !90)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !728, file: !424, line: 1108, type: !84)
!728 = distinct !DILexicalBlock(scope: !729, file: !424, line: 1107, column: 32)
!729 = distinct !DILexicalBlock(scope: !730, file: !424, line: 1107, column: 5)
!730 = distinct !DILexicalBlock(scope: !721, file: !424, line: 1107, column: 5)
!731 = !DISubprogram(name: "map_new", scope: !424, file: !424, line: 1010, type: !658, isLocal: true, isDefinition: true, scopeLine: 1011, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @map_new, variables: !732)
!732 = !{!733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !749}
!733 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !731, file: !424, line: 1010, type: !454)
!734 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !731, file: !424, line: 1010, type: !84)
!735 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !731, file: !424, line: 1010, type: !84)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !731, file: !424, line: 1012, type: !84)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iters", scope: !731, file: !424, line: 1012, type: !84)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !731, file: !424, line: 1012, type: !84)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lz", scope: !731, file: !424, line: 1013, type: !439)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numargs", scope: !731, file: !424, line: 1014, type: !90)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !731, file: !424, line: 1014, type: !90)
!742 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !743, file: !424, line: 1034, type: !84)
!743 = distinct !DILexicalBlock(scope: !744, file: !424, line: 1034, column: 16)
!744 = distinct !DILexicalBlock(scope: !745, file: !424, line: 1033, column: 31)
!745 = distinct !DILexicalBlock(scope: !746, file: !424, line: 1033, column: 13)
!746 = distinct !DILexicalBlock(scope: !747, file: !424, line: 1030, column: 33)
!747 = distinct !DILexicalBlock(scope: !748, file: !424, line: 1030, column: 5)
!748 = distinct !DILexicalBlock(scope: !731, file: !424, line: 1030, column: 5)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !750, file: !424, line: 1043, type: !84)
!750 = distinct !DILexicalBlock(scope: !751, file: !424, line: 1043, column: 12)
!751 = distinct !DILexicalBlock(scope: !752, file: !424, line: 1042, column: 27)
!752 = distinct !DILexicalBlock(scope: !731, file: !424, line: 1042, column: 9)
!753 = !DISubprogram(name: "zip_dealloc", scope: !424, file: !424, line: 2262, type: !754, isLocal: true, isDefinition: true, scopeLine: 2263, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.zipobject*)* @zip_dealloc, variables: !756)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !446}
!756 = !{!757, !758, !760, !763, !765}
!757 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !753, file: !424, line: 2262, type: !446)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !759, file: !424, line: 2265, type: !84)
!759 = distinct !DILexicalBlock(scope: !753, file: !424, line: 2265, column: 8)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !761, file: !424, line: 2265, type: !84)
!761 = distinct !DILexicalBlock(scope: !762, file: !424, line: 2265, column: 103)
!762 = distinct !DILexicalBlock(scope: !759, file: !424, line: 2265, column: 69)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !764, file: !424, line: 2266, type: !84)
!764 = distinct !DILexicalBlock(scope: !753, file: !424, line: 2266, column: 8)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !766, file: !424, line: 2266, type: !84)
!766 = distinct !DILexicalBlock(scope: !767, file: !424, line: 2266, column: 102)
!767 = distinct !DILexicalBlock(scope: !764, file: !424, line: 2266, column: 68)
!768 = !DISubprogram(name: "zip_traverse", scope: !424, file: !424, line: 2271, type: !769, isLocal: true, isDefinition: true, scopeLine: 2272, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.zipobject*, i32 (%struct._object*, i8*)*, i8*)* @zip_traverse, variables: !771)
!769 = !DISubroutineType(types: !770)
!770 = !{!123, !446, !342, !83}
!771 = !{!772, !773, !774, !775, !779}
!772 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !768, file: !424, line: 2271, type: !446)
!773 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !768, file: !424, line: 2271, type: !342)
!774 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !768, file: !424, line: 2271, type: !83)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !776, file: !424, line: 2273, type: !123)
!776 = distinct !DILexicalBlock(scope: !777, file: !424, line: 2273, column: 27)
!777 = distinct !DILexicalBlock(scope: !778, file: !424, line: 2273, column: 14)
!778 = distinct !DILexicalBlock(scope: !768, file: !424, line: 2273, column: 8)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !780, file: !424, line: 2274, type: !123)
!780 = distinct !DILexicalBlock(scope: !781, file: !424, line: 2274, column: 26)
!781 = distinct !DILexicalBlock(scope: !782, file: !424, line: 2274, column: 14)
!782 = distinct !DILexicalBlock(scope: !768, file: !424, line: 2274, column: 8)
!783 = !DISubprogram(name: "zip_next", scope: !424, file: !424, line: 2279, type: !784, isLocal: true, isDefinition: true, scopeLine: 2280, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.zipobject*)* @zip_next, variables: !786)
!784 = !DISubroutineType(types: !785)
!785 = !{!84, !446}
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794, !803, !805}
!787 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !783, file: !424, line: 2279, type: !446)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !783, file: !424, line: 2281, type: !90)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tuplesize", scope: !783, file: !424, line: 2282, type: !90)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !783, file: !424, line: 2283, type: !84)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !783, file: !424, line: 2284, type: !84)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !783, file: !424, line: 2285, type: !84)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "olditem", scope: !783, file: !424, line: 2286, type: !84)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !795, file: !424, line: 2296, type: !84)
!795 = distinct !DILexicalBlock(scope: !796, file: !424, line: 2296, column: 20)
!796 = distinct !DILexicalBlock(scope: !797, file: !424, line: 2295, column: 37)
!797 = distinct !DILexicalBlock(scope: !798, file: !424, line: 2295, column: 17)
!798 = distinct !DILexicalBlock(scope: !799, file: !424, line: 2292, column: 41)
!799 = distinct !DILexicalBlock(scope: !800, file: !424, line: 2292, column: 9)
!800 = distinct !DILexicalBlock(scope: !801, file: !424, line: 2292, column: 9)
!801 = distinct !DILexicalBlock(scope: !802, file: !424, line: 2290, column: 50)
!802 = distinct !DILexicalBlock(scope: !783, file: !424, line: 2290, column: 9)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !804, file: !424, line: 2301, type: !84)
!804 = distinct !DILexicalBlock(scope: !798, file: !424, line: 2301, column: 16)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !806, file: !424, line: 2311, type: !84)
!806 = distinct !DILexicalBlock(scope: !807, file: !424, line: 2311, column: 20)
!807 = distinct !DILexicalBlock(scope: !808, file: !424, line: 2310, column: 37)
!808 = distinct !DILexicalBlock(scope: !809, file: !424, line: 2310, column: 17)
!809 = distinct !DILexicalBlock(scope: !810, file: !424, line: 2307, column: 41)
!810 = distinct !DILexicalBlock(scope: !811, file: !424, line: 2307, column: 9)
!811 = distinct !DILexicalBlock(scope: !812, file: !424, line: 2307, column: 9)
!812 = distinct !DILexicalBlock(scope: !802, file: !424, line: 2303, column: 12)
!813 = !DISubprogram(name: "zip_reduce", scope: !424, file: !424, line: 2321, type: !784, isLocal: true, isDefinition: true, scopeLine: 2322, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.zipobject*)* @zip_reduce, variables: !814)
!814 = !{!815}
!815 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !813, file: !424, line: 2321, type: !446)
!816 = !DISubprogram(name: "zip_new", scope: !424, file: !424, line: 2204, type: !658, isLocal: true, isDefinition: true, scopeLine: 2205, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @zip_new, variables: !817)
!817 = !{!818, !819, !820, !821, !822, !823, !824, !825, !826, !830, !831, !835, !839, !843}
!818 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !816, file: !424, line: 2204, type: !454)
!819 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !816, file: !424, line: 2204, type: !84)
!820 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !816, file: !424, line: 2204, type: !84)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lz", scope: !816, file: !424, line: 2206, type: !446)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !816, file: !424, line: 2207, type: !90)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ittuple", scope: !816, file: !424, line: 2208, type: !84)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !816, file: !424, line: 2209, type: !84)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tuplesize", scope: !816, file: !424, line: 2210, type: !90)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !827, file: !424, line: 2223, type: !84)
!827 = distinct !DILexicalBlock(scope: !828, file: !424, line: 2222, column: 35)
!828 = distinct !DILexicalBlock(scope: !829, file: !424, line: 2222, column: 5)
!829 = distinct !DILexicalBlock(scope: !816, file: !424, line: 2222, column: 5)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !827, file: !424, line: 2224, type: !84)
!831 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !832, file: !424, line: 2230, type: !84)
!832 = distinct !DILexicalBlock(scope: !833, file: !424, line: 2230, column: 16)
!833 = distinct !DILexicalBlock(scope: !834, file: !424, line: 2225, column: 31)
!834 = distinct !DILexicalBlock(scope: !827, file: !424, line: 2225, column: 13)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !836, file: !424, line: 2239, type: !84)
!836 = distinct !DILexicalBlock(scope: !837, file: !424, line: 2239, column: 12)
!837 = distinct !DILexicalBlock(scope: !838, file: !424, line: 2238, column: 31)
!838 = distinct !DILexicalBlock(scope: !816, file: !424, line: 2238, column: 9)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !840, file: !424, line: 2250, type: !84)
!840 = distinct !DILexicalBlock(scope: !841, file: !424, line: 2250, column: 12)
!841 = distinct !DILexicalBlock(scope: !842, file: !424, line: 2249, column: 27)
!842 = distinct !DILexicalBlock(scope: !816, file: !424, line: 2249, column: 9)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !844, file: !424, line: 2251, type: !84)
!844 = distinct !DILexicalBlock(scope: !841, file: !424, line: 2251, column: 12)
!845 = !DISubprogram(name: "builtin___build_class__", scope: !424, file: !424, line: 50, type: !214, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @builtin___build_class__, variables: !846)
!846 = !{!847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !868, !874, !876, !878, !883, !889, !891, !894, !896, !900, !906, !908, !911, !913, !915, !919, !921, !923, !926, !928, !930, !932, !936, !938, !941, !943, !946, !950, !952, !954, !956, !958, !961}
!847 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !845, file: !424, line: 50, type: !84)
!848 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !845, file: !424, line: 50, type: !84)
!849 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !845, file: !424, line: 50, type: !84)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !845, file: !424, line: 52, type: !84)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !845, file: !424, line: 52, type: !84)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bases", scope: !845, file: !424, line: 52, type: !84)
!853 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mkw", scope: !845, file: !424, line: 52, type: !84)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "meta", scope: !845, file: !424, line: 52, type: !84)
!855 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "winner", scope: !845, file: !424, line: 52, type: !84)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prep", scope: !845, file: !424, line: 52, type: !84)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ns", scope: !845, file: !424, line: 52, type: !84)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cell", scope: !845, file: !424, line: 52, type: !84)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cls", scope: !845, file: !424, line: 53, type: !84)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nargs", scope: !845, file: !424, line: 54, type: !90)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "isclass", scope: !845, file: !424, line: 55, type: !123)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !863, file: !424, line: 92, type: !84)
!863 = distinct !DILexicalBlock(scope: !864, file: !424, line: 92, column: 16)
!864 = distinct !DILexicalBlock(scope: !865, file: !424, line: 91, column: 32)
!865 = distinct !DILexicalBlock(scope: !866, file: !424, line: 91, column: 13)
!866 = distinct !DILexicalBlock(scope: !867, file: !424, line: 89, column: 10)
!867 = distinct !DILexicalBlock(scope: !845, file: !424, line: 85, column: 9)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !869, file: !424, line: 99, type: !84)
!869 = distinct !DILexicalBlock(scope: !870, file: !424, line: 99, column: 20)
!870 = distinct !DILexicalBlock(scope: !871, file: !424, line: 98, column: 62)
!871 = distinct !DILexicalBlock(scope: !872, file: !424, line: 98, column: 17)
!872 = distinct !DILexicalBlock(scope: !873, file: !424, line: 96, column: 33)
!873 = distinct !DILexicalBlock(scope: !866, file: !424, line: 96, column: 13)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !875, file: !424, line: 100, type: !84)
!875 = distinct !DILexicalBlock(scope: !870, file: !424, line: 100, column: 20)
!876 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !877, file: !424, line: 101, type: !84)
!877 = distinct !DILexicalBlock(scope: !870, file: !424, line: 101, column: 20)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base0", scope: !879, file: !424, line: 115, type: !84)
!879 = distinct !DILexicalBlock(scope: !880, file: !424, line: 114, column: 14)
!880 = distinct !DILexicalBlock(scope: !881, file: !424, line: 110, column: 13)
!881 = distinct !DILexicalBlock(scope: !882, file: !424, line: 108, column: 29)
!882 = distinct !DILexicalBlock(scope: !845, file: !424, line: 108, column: 9)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !884, file: !424, line: 128, type: !84)
!884 = distinct !DILexicalBlock(scope: !885, file: !424, line: 128, column: 16)
!885 = distinct !DILexicalBlock(scope: !886, file: !424, line: 127, column: 35)
!886 = distinct !DILexicalBlock(scope: !887, file: !424, line: 127, column: 13)
!887 = distinct !DILexicalBlock(scope: !888, file: !424, line: 122, column: 18)
!888 = distinct !DILexicalBlock(scope: !845, file: !424, line: 122, column: 9)
!889 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !890, file: !424, line: 129, type: !84)
!890 = distinct !DILexicalBlock(scope: !885, file: !424, line: 129, column: 16)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !892, file: !424, line: 129, type: !84)
!892 = distinct !DILexicalBlock(scope: !893, file: !424, line: 129, column: 103)
!893 = distinct !DILexicalBlock(scope: !890, file: !424, line: 129, column: 69)
!894 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !895, file: !424, line: 130, type: !84)
!895 = distinct !DILexicalBlock(scope: !885, file: !424, line: 130, column: 16)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !897, file: !424, line: 134, type: !84)
!897 = distinct !DILexicalBlock(scope: !898, file: !424, line: 134, column: 16)
!898 = distinct !DILexicalBlock(scope: !899, file: !424, line: 133, column: 29)
!899 = distinct !DILexicalBlock(scope: !887, file: !424, line: 133, column: 13)
!900 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !901, file: !424, line: 148, type: !84)
!901 = distinct !DILexicalBlock(scope: !902, file: !424, line: 148, column: 16)
!902 = distinct !DILexicalBlock(scope: !903, file: !424, line: 147, column: 14)
!903 = distinct !DILexicalBlock(scope: !904, file: !424, line: 143, column: 13)
!904 = distinct !DILexicalBlock(scope: !905, file: !424, line: 142, column: 29)
!905 = distinct !DILexicalBlock(scope: !845, file: !424, line: 142, column: 9)
!906 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !907, file: !424, line: 149, type: !84)
!907 = distinct !DILexicalBlock(scope: !902, file: !424, line: 149, column: 16)
!908 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !909, file: !424, line: 149, type: !84)
!909 = distinct !DILexicalBlock(scope: !910, file: !424, line: 149, column: 103)
!910 = distinct !DILexicalBlock(scope: !907, file: !424, line: 149, column: 69)
!911 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !912, file: !424, line: 150, type: !84)
!912 = distinct !DILexicalBlock(scope: !902, file: !424, line: 150, column: 16)
!913 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pargs", scope: !914, file: !424, line: 155, type: !84)
!914 = distinct !DILexicalBlock(scope: !905, file: !424, line: 154, column: 10)
!915 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !916, file: !424, line: 157, type: !84)
!916 = distinct !DILexicalBlock(scope: !917, file: !424, line: 157, column: 16)
!917 = distinct !DILexicalBlock(scope: !918, file: !424, line: 156, column: 34)
!918 = distinct !DILexicalBlock(scope: !914, file: !424, line: 156, column: 13)
!919 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !920, file: !424, line: 158, type: !84)
!920 = distinct !DILexicalBlock(scope: !917, file: !424, line: 158, column: 16)
!921 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !922, file: !424, line: 159, type: !84)
!922 = distinct !DILexicalBlock(scope: !917, file: !424, line: 159, column: 16)
!923 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !924, file: !424, line: 159, type: !84)
!924 = distinct !DILexicalBlock(scope: !925, file: !424, line: 159, column: 103)
!925 = distinct !DILexicalBlock(scope: !922, file: !424, line: 159, column: 69)
!926 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !927, file: !424, line: 160, type: !84)
!927 = distinct !DILexicalBlock(scope: !917, file: !424, line: 160, column: 16)
!928 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !929, file: !424, line: 164, type: !84)
!929 = distinct !DILexicalBlock(scope: !914, file: !424, line: 164, column: 12)
!930 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !931, file: !424, line: 165, type: !84)
!931 = distinct !DILexicalBlock(scope: !914, file: !424, line: 165, column: 12)
!932 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !933, file: !424, line: 168, type: !84)
!933 = distinct !DILexicalBlock(scope: !934, file: !424, line: 168, column: 12)
!934 = distinct !DILexicalBlock(scope: !935, file: !424, line: 167, column: 27)
!935 = distinct !DILexicalBlock(scope: !845, file: !424, line: 167, column: 9)
!936 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !937, file: !424, line: 169, type: !84)
!937 = distinct !DILexicalBlock(scope: !934, file: !424, line: 169, column: 12)
!938 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !939, file: !424, line: 169, type: !84)
!939 = distinct !DILexicalBlock(scope: !940, file: !424, line: 169, column: 99)
!940 = distinct !DILexicalBlock(scope: !937, file: !424, line: 169, column: 65)
!941 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !942, file: !424, line: 170, type: !84)
!942 = distinct !DILexicalBlock(scope: !934, file: !424, line: 170, column: 12)
!943 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "margs", scope: !944, file: !424, line: 177, type: !84)
!944 = distinct !DILexicalBlock(scope: !945, file: !424, line: 176, column: 29)
!945 = distinct !DILexicalBlock(scope: !845, file: !424, line: 176, column: 9)
!946 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !947, file: !424, line: 181, type: !84)
!947 = distinct !DILexicalBlock(scope: !948, file: !424, line: 181, column: 16)
!948 = distinct !DILexicalBlock(scope: !949, file: !424, line: 179, column: 34)
!949 = distinct !DILexicalBlock(scope: !944, file: !424, line: 179, column: 13)
!950 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !951, file: !424, line: 185, type: !84)
!951 = distinct !DILexicalBlock(scope: !944, file: !424, line: 185, column: 12)
!952 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !953, file: !424, line: 187, type: !84)
!953 = distinct !DILexicalBlock(scope: !845, file: !424, line: 187, column: 8)
!954 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !955, file: !424, line: 188, type: !84)
!955 = distinct !DILexicalBlock(scope: !845, file: !424, line: 188, column: 8)
!956 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !957, file: !424, line: 189, type: !84)
!957 = distinct !DILexicalBlock(scope: !845, file: !424, line: 189, column: 8)
!958 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !959, file: !424, line: 189, type: !84)
!959 = distinct !DILexicalBlock(scope: !960, file: !424, line: 189, column: 95)
!960 = distinct !DILexicalBlock(scope: !957, file: !424, line: 189, column: 61)
!961 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !962, file: !424, line: 190, type: !84)
!962 = distinct !DILexicalBlock(scope: !845, file: !424, line: 190, column: 8)
!963 = !DISubprogram(name: "builtin___import__", scope: !424, file: !424, line: 200, type: !214, isLocal: true, isDefinition: true, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @builtin___import__, variables: !964)
!964 = !{!965, !966, !967, !968, !969, !970, !971, !972}
!965 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !963, file: !424, line: 200, type: !84)
!966 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !963, file: !424, line: 200, type: !84)
!967 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !963, file: !424, line: 200, type: !84)
!968 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !963, file: !424, line: 204, type: !84)
!969 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "globals", scope: !963, file: !424, line: 204, type: !84)
!970 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "locals", scope: !963, file: !424, line: 204, type: !84)
!971 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fromlist", scope: !963, file: !424, line: 204, type: !84)
!972 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "level", scope: !963, file: !424, line: 205, type: !123)
