; ModuleID = 'programs_new/Python-new/bufferedio.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyMethodDef = type { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !424, globals: !1355)
!1 = !DIFile(filename: "bufferedio.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !45, !368, !369, !377, !101, !17, !59, !391, !392}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyEnvironmentErrorObject", file: !7, line: 69, baseType: !8)
!7 = !DIFile(filename: "Include/pyerrors.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyOSErrorObject", file: !7, line: 61, baseType: !9)
!9 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 51, size: 832, align: 64, elements: !10)
!10 = !{!11, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !9, file: !7, line: 52, baseType: !12, size: 128, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !13, line: 109, baseType: !14)
!13 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !13, line: 105, size: 128, align: 64, elements: !15)
!15 = !{!16, !24}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !14, file: !13, line: 107, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !18, line: 177, baseType: !19)
!18 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !20, line: 102, baseType: !21)
!20 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !22, line: 181, baseType: !23)
!22 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!23 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !14, file: !13, line: 108, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !13, line: 334, size: 3200, align: 64, elements: !27)
!27 = !{!28, !34, !38, !39, !40, !46, !109, !114, !119, !120, !125, !177, !208, !220, !226, !227, !228, !230, !232, !263, !264, !265, !274, !275, !280, !281, !283, !285, !295, !305, !323, !324, !325, !327, !329, !330, !332, !337, !342, !347, !348, !349, !350, !351, !352, !353, !354, !356}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !26, file: !13, line: 335, baseType: !29, size: 192, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !13, line: 114, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 111, size: 192, align: 64, elements: !31)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !30, file: !13, line: 112, baseType: !12, size: 128, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !30, file: !13, line: 113, baseType: !17, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !26, file: !13, line: 336, baseType: !35, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!37 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !26, file: !13, line: 337, baseType: !17, size: 64, align: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !26, file: !13, line: 337, baseType: !17, size: 64, align: 64, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !26, file: !13, line: 341, baseType: !41, size: 64, align: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !13, line: 308, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !45}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !26, file: !13, line: 342, baseType: !47, size: 64, align: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !13, line: 314, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !45, !52, !51}
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !20, line: 48, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !55, line: 246, size: 1728, align: 64, elements: !56)
!55 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!56 = !{!57, !58, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !78, !79, !80, !81, !83, !85, !87, !91, !94, !96, !97, !98, !99, !100, !104, !105}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !54, file: !55, line: 247, baseType: !51, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !54, file: !55, line: 252, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !54, file: !55, line: 253, baseType: !59, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !54, file: !55, line: 254, baseType: !59, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !54, file: !55, line: 255, baseType: !59, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !54, file: !55, line: 256, baseType: !59, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !54, file: !55, line: 257, baseType: !59, size: 64, align: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !54, file: !55, line: 258, baseType: !59, size: 64, align: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !54, file: !55, line: 259, baseType: !59, size: 64, align: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !54, file: !55, line: 261, baseType: !59, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !54, file: !55, line: 262, baseType: !59, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !54, file: !55, line: 263, baseType: !59, size: 64, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !54, file: !55, line: 265, baseType: !71, size: 64, align: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !55, line: 161, size: 192, align: 64, elements: !73)
!73 = !{!74, !75, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !72, file: !55, line: 162, baseType: !71, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !72, file: !55, line: 163, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !72, file: !55, line: 167, baseType: !51, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !54, file: !55, line: 267, baseType: !76, size: 64, align: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !54, file: !55, line: 269, baseType: !51, size: 32, align: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !54, file: !55, line: 273, baseType: !51, size: 32, align: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !54, file: !55, line: 275, baseType: !82, size: 64, align: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !22, line: 140, baseType: !23)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !54, file: !55, line: 279, baseType: !84, size: 16, align: 16, offset: 1024)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !54, file: !55, line: 280, baseType: !86, size: 8, align: 8, offset: 1040)
!86 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !54, file: !55, line: 281, baseType: !88, size: 8, align: 8, offset: 1048)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !54, file: !55, line: 285, baseType: !92, size: 64, align: 64, offset: 1088)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !55, line: 155, baseType: null)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !54, file: !55, line: 294, baseType: !95, size: 64, align: 64, offset: 1152)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !22, line: 141, baseType: !23)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !54, file: !55, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !54, file: !55, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !54, file: !55, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !54, file: !55, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !54, file: !55, line: 307, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !54, file: !55, line: 309, baseType: !51, size: 32, align: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !54, file: !55, line: 311, baseType: !106, size: 160, align: 8, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 160, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !26, file: !13, line: 343, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !13, line: 316, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!45, !45, !59}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !26, file: !13, line: 344, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !13, line: 318, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!51, !45, !59, !45}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !26, file: !13, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !26, file: !13, line: 346, baseType: !121, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !13, line: 320, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!45, !45}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !26, file: !13, line: 350, baseType: !126, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !13, line: 278, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 236, size: 2176, align: 64, elements: !129)
!129 = !{!130, !135, !136, !137, !138, !139, !144, !146, !147, !148, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !128, file: !13, line: 241, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !13, line: 166, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!45, !45, !45}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !128, file: !13, line: 242, baseType: !131, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !128, file: !13, line: 243, baseType: !131, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !128, file: !13, line: 244, baseType: !131, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !128, file: !13, line: 245, baseType: !131, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !128, file: !13, line: 246, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !13, line: 167, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!45, !45, !45, !45}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !128, file: !13, line: 247, baseType: !145, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !13, line: 165, baseType: !122)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !128, file: !13, line: 248, baseType: !145, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !128, file: !13, line: 249, baseType: !145, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !128, file: !13, line: 250, baseType: !149, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !13, line: 168, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!51, !45}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !128, file: !13, line: 251, baseType: !145, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !128, file: !13, line: 252, baseType: !131, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !128, file: !13, line: 253, baseType: !131, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !128, file: !13, line: 254, baseType: !131, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !128, file: !13, line: 255, baseType: !131, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !128, file: !13, line: 256, baseType: !131, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !128, file: !13, line: 257, baseType: !145, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !128, file: !13, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !128, file: !13, line: 259, baseType: !145, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !128, file: !13, line: 261, baseType: !131, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !128, file: !13, line: 262, baseType: !131, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !128, file: !13, line: 263, baseType: !131, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !128, file: !13, line: 264, baseType: !131, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !128, file: !13, line: 265, baseType: !140, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !128, file: !13, line: 266, baseType: !131, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !128, file: !13, line: 267, baseType: !131, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !128, file: !13, line: 268, baseType: !131, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !128, file: !13, line: 269, baseType: !131, size: 64, align: 64, offset: 1728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !128, file: !13, line: 270, baseType: !131, size: 64, align: 64, offset: 1792)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !128, file: !13, line: 272, baseType: !131, size: 64, align: 64, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !128, file: !13, line: 273, baseType: !131, size: 64, align: 64, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !128, file: !13, line: 274, baseType: !131, size: 64, align: 64, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !128, file: !13, line: 275, baseType: !131, size: 64, align: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !128, file: !13, line: 277, baseType: !145, size: 64, align: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !26, file: !13, line: 351, baseType: !178, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !13, line: 292, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 280, size: 640, align: 64, elements: !181)
!181 = !{!182, !187, !188, !193, !194, !195, !200, !201, !206, !207}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !180, file: !13, line: 281, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !13, line: 169, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!17, !45}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !180, file: !13, line: 282, baseType: !131, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !180, file: !13, line: 283, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !13, line: 170, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!45, !45, !17}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !180, file: !13, line: 284, baseType: !189, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !180, file: !13, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !180, file: !13, line: 286, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !13, line: 172, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!51, !45, !17, !45}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !180, file: !13, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !180, file: !13, line: 288, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !13, line: 231, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!51, !45, !45}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !180, file: !13, line: 290, baseType: !131, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !180, file: !13, line: 291, baseType: !189, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !26, file: !13, line: 352, baseType: !209, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !13, line: 298, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 294, size: 192, align: 64, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !211, file: !13, line: 295, baseType: !183, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !211, file: !13, line: 296, baseType: !131, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !211, file: !13, line: 297, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !13, line: 174, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!51, !45, !45, !45}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !26, file: !13, line: 356, baseType: !221, size: 64, align: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !13, line: 321, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !45}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !18, line: 186, baseType: !17)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !26, file: !13, line: 357, baseType: !140, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !26, file: !13, line: 358, baseType: !121, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !26, file: !13, line: 359, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !13, line: 317, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !26, file: !13, line: 360, baseType: !231, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !13, line: 319, baseType: !217)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !26, file: !13, line: 363, baseType: !233, size: 64, align: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !13, line: 304, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 301, size: 128, align: 64, elements: !236)
!236 = !{!237, !258}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !235, file: !13, line: 302, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !13, line: 193, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!51, !45, !242, !51}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !13, line: 191, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !13, line: 178, size: 640, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !255, !256, !257}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !244, file: !13, line: 179, baseType: !4, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !244, file: !13, line: 180, baseType: !45, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !13, line: 181, baseType: !17, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !244, file: !13, line: 182, baseType: !17, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !244, file: !13, line: 184, baseType: !51, size: 32, align: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !244, file: !13, line: 185, baseType: !51, size: 32, align: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !244, file: !13, line: 186, baseType: !59, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !244, file: !13, line: 187, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !244, file: !13, line: 188, baseType: !254, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !244, file: !13, line: 189, baseType: !254, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !244, file: !13, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !235, file: !13, line: 303, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !13, line: 194, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !45, !242}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !26, file: !13, line: 366, baseType: !103, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !26, file: !13, line: 368, baseType: !35, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !26, file: !13, line: 372, baseType: !266, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !13, line: 233, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!51, !45, !270, !4}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !13, line: 232, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!51, !45, !4}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !26, file: !13, line: 375, baseType: !149, size: 64, align: 64, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !26, file: !13, line: 379, baseType: !276, size: 64, align: 64, offset: 1600)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !13, line: 322, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!45, !45, !45, !51}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !26, file: !13, line: 382, baseType: !17, size: 64, align: 64, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !26, file: !13, line: 385, baseType: !282, size: 64, align: 64, offset: 1728)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !13, line: 323, baseType: !122)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !26, file: !13, line: 386, baseType: !284, size: 64, align: 64, offset: 1792)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !13, line: 324, baseType: !122)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !26, file: !13, line: 389, baseType: !286, size: 64, align: 64, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 40, size: 256, align: 64, elements: !289)
!288 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 41, baseType: !35, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 18, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 43, baseType: !51, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 45, baseType: !35, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !26, file: !13, line: 390, baseType: !296, size: 64, align: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !298, line: 18, size: 320, align: 64, elements: !299)
!298 = !DIFile(filename: "Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!299 = !{!300, !301, !302, !303, !304}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !297, file: !298, line: 19, baseType: !59, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !297, file: !298, line: 20, baseType: !51, size: 32, align: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !297, file: !298, line: 21, baseType: !17, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !297, file: !298, line: 22, baseType: !51, size: 32, align: 32, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !297, file: !298, line: 23, baseType: !59, size: 64, align: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !26, file: !13, line: 391, baseType: !306, size: 64, align: 64, offset: 1984)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !308, line: 11, size: 320, align: 64, elements: !309)
!308 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!309 = !{!310, !311, !316, !321, !322}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !307, file: !308, line: 12, baseType: !59, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !307, file: !308, line: 13, baseType: !312, size: 64, align: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !308, line: 8, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!45, !45, !4}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !307, file: !308, line: 14, baseType: !317, size: 64, align: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !308, line: 9, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!51, !45, !45, !4}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !307, file: !308, line: 15, baseType: !59, size: 64, align: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !307, file: !308, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !26, file: !13, line: 392, baseType: !25, size: 64, align: 64, offset: 2048)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !26, file: !13, line: 393, baseType: !45, size: 64, align: 64, offset: 2112)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !26, file: !13, line: 394, baseType: !326, size: 64, align: 64, offset: 2176)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !13, line: 325, baseType: !141)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !26, file: !13, line: 395, baseType: !328, size: 64, align: 64, offset: 2240)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !13, line: 326, baseType: !217)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !26, file: !13, line: 396, baseType: !17, size: 64, align: 64, offset: 2304)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !26, file: !13, line: 397, baseType: !331, size: 64, align: 64, offset: 2368)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !13, line: 327, baseType: !217)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !26, file: !13, line: 398, baseType: !333, size: 64, align: 64, offset: 2432)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !13, line: 329, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!45, !25, !17}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !26, file: !13, line: 399, baseType: !338, size: 64, align: 64, offset: 2496)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !13, line: 328, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!45, !25, !45, !45}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !26, file: !13, line: 400, baseType: !343, size: 64, align: 64, offset: 2560)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !13, line: 307, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !4}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !26, file: !13, line: 401, baseType: !149, size: 64, align: 64, offset: 2624)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !26, file: !13, line: 402, baseType: !45, size: 64, align: 64, offset: 2688)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !26, file: !13, line: 403, baseType: !45, size: 64, align: 64, offset: 2752)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !26, file: !13, line: 404, baseType: !45, size: 64, align: 64, offset: 2816)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !26, file: !13, line: 405, baseType: !45, size: 64, align: 64, offset: 2880)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !26, file: !13, line: 406, baseType: !45, size: 64, align: 64, offset: 2944)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !26, file: !13, line: 407, baseType: !41, size: 64, align: 64, offset: 3008)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !26, file: !13, line: 410, baseType: !355, size: 32, align: 32, offset: 3072)
!355 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !26, file: !13, line: 412, baseType: !41, size: 64, align: 64, offset: 3136)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !9, file: !7, line: 52, baseType: !45, size: 64, align: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !9, file: !7, line: 52, baseType: !45, size: 64, align: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !9, file: !7, line: 52, baseType: !45, size: 64, align: 64, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !9, file: !7, line: 52, baseType: !45, size: 64, align: 64, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !9, file: !7, line: 52, baseType: !45, size: 64, align: 64, offset: 384)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !9, file: !7, line: 52, baseType: !37, size: 8, align: 8, offset: 448)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "myerrno", scope: !9, file: !7, line: 53, baseType: !45, size: 64, align: 64, offset: 512)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "strerror", scope: !9, file: !7, line: 54, baseType: !45, size: 64, align: 64, offset: 576)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !9, file: !7, line: 55, baseType: !45, size: 64, align: 64, offset: 640)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "filename2", scope: !9, file: !7, line: 56, baseType: !45, size: 64, align: 64, offset: 704)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !9, file: !7, line: 60, baseType: !17, size: 64, align: 64, offset: 768)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !371, line: 41, baseType: !372)
!371 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!372 = !DICompositeType(tag: DW_TAG_structure_type, file: !371, line: 31, size: 320, align: 64, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !372, file: !371, line: 32, baseType: !29, size: 192, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !372, file: !371, line: 33, baseType: !225, size: 64, align: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !372, file: !371, line: 34, baseType: !88, size: 8, align: 8, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !379, line: 253, baseType: !380)
!379 = !DIFile(filename: "Include/objimpl.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!380 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !379, line: 246, size: 192, align: 64, elements: !381)
!381 = !{!382, !389}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !380, file: !379, line: 251, baseType: !383, size: 192, align: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, scope: !380, file: !379, line: 247, size: 192, align: 64, elements: !384)
!384 = !{!385, !387, !388}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !383, file: !379, line: 248, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !383, file: !379, line: 249, baseType: !386, size: 64, align: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !383, file: !379, line: 250, baseType: !17, size: 64, align: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !380, file: !379, line: 252, baseType: !390, size: 64, align: 64)
!390 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "buffered", file: !394, line: 271, baseType: !395)
!394 = !DIFile(filename: "./Modules/_io/bufferedio.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!395 = !DICompositeType(tag: DW_TAG_structure_type, file: !394, line: 227, size: 1216, align: 64, elements: !396)
!396 = !{!397, !398, !399, !400, !401, !402, !403, !404, !405, !409, !410, !411, !412, !413, !414, !415, !418, !420, !421, !422, !423}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !395, file: !394, line: 228, baseType: !12, size: 128, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !395, file: !394, line: 230, baseType: !45, size: 64, align: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !395, file: !394, line: 231, baseType: !51, size: 32, align: 32, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !395, file: !394, line: 232, baseType: !51, size: 32, align: 32, offset: 224)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "readable", scope: !395, file: !394, line: 233, baseType: !51, size: 32, align: 32, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "writable", scope: !395, file: !394, line: 234, baseType: !51, size: 32, align: 32, offset: 288)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "finalizing", scope: !395, file: !394, line: 235, baseType: !37, size: 8, align: 8, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "fast_closed_checks", scope: !395, file: !394, line: 239, baseType: !51, size: 32, align: 32, offset: 352)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "abs_pos", scope: !395, file: !394, line: 242, baseType: !406, size: 64, align: 64, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_off_t", file: !407, line: 94, baseType: !408)
!407 = !DIFile(filename: "./Modules/_io/_iomodule.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !20, line: 92, baseType: !95)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !395, file: !394, line: 245, baseType: !59, size: 64, align: 64, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !395, file: !394, line: 247, baseType: !406, size: 64, align: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "raw_pos", scope: !395, file: !394, line: 249, baseType: !406, size: 64, align: 64, offset: 576)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "read_end", scope: !395, file: !394, line: 253, baseType: !406, size: 64, align: 64, offset: 640)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !395, file: !394, line: 256, baseType: !406, size: 64, align: 64, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "write_end", scope: !395, file: !394, line: 259, baseType: !406, size: 64, align: 64, offset: 768)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !395, file: !394, line: 262, baseType: !416, size: 64, align: 64, offset: 832)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThread_type_lock", file: !417, line: 5, baseType: !4)
!417 = !DIFile(filename: "Include/pythread.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!418 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !395, file: !394, line: 263, baseType: !419, size: 64, align: 64, offset: 896)
!419 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !23)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !395, file: !394, line: 266, baseType: !17, size: 64, align: 64, offset: 960)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_mask", scope: !395, file: !394, line: 267, baseType: !17, size: 64, align: 64, offset: 1024)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !395, file: !394, line: 269, baseType: !45, size: 64, align: 64, offset: 1088)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !395, file: !394, line: 270, baseType: !45, size: 64, align: 64, offset: 1152)
!424 = !{!425, !444, !447, !460, !464, !468, !485, !489, !508, !519, !534, !551, !568, !638, !645, !708, !717, !723, !743, !755, !758, !779, !782, !790, !807, !817, !821, !858, !862, !866, !870, !874, !878, !888, !892, !902, !944, !952, !983, !997, !1002, !1018, !1035, !1040, !1064, !1073, !1078, !1092, !1099, !1103, !1107, !1111, !1130, !1134, !1155, !1163, !1168, !1182, !1216, !1227, !1250, !1256, !1275, !1279, !1283, !1287, !1291, !1295, !1299, !1303, !1310, !1317, !1323, !1341}
!425 = !DISubprogram(name: "_PyIO_trap_eintr", scope: !394, file: !394, line: 805, type: !426, isLocal: false, isDefinition: true, scopeLine: 806, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @_PyIO_trap_eintr, variables: !428)
!426 = !DISubroutineType(types: !427)
!427 = !{!51}
!428 = !{!429, !430, !431, !432, !433, !437, !439, !441}
!429 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typ", scope: !425, file: !394, line: 808, type: !45)
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !425, file: !394, line: 808, type: !45)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !425, file: !394, line: 808, type: !45)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "env_err", scope: !425, file: !394, line: 809, type: !5)
!433 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !434, file: !394, line: 823, type: !45)
!434 = distinct !DILexicalBlock(scope: !435, file: !394, line: 823, column: 12)
!435 = distinct !DILexicalBlock(scope: !436, file: !394, line: 822, column: 71)
!436 = distinct !DILexicalBlock(scope: !425, file: !394, line: 821, column: 9)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !438, file: !394, line: 824, type: !45)
!438 = distinct !DILexicalBlock(scope: !435, file: !394, line: 824, column: 12)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !440, file: !394, line: 825, type: !45)
!440 = distinct !DILexicalBlock(scope: !435, file: !394, line: 825, column: 12)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !442, file: !394, line: 825, type: !45)
!442 = distinct !DILexicalBlock(scope: !443, file: !394, line: 825, column: 98)
!443 = distinct !DILexicalBlock(scope: !440, file: !394, line: 825, column: 64)
!444 = !DISubprogram(name: "bufferediobase_detach", scope: !394, file: !394, line: 107, type: !123, isLocal: true, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @bufferediobase_detach, variables: !445)
!445 = !{!446}
!446 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !444, file: !394, line: 107, type: !45)
!447 = !DISubprogram(name: "bufferediobase_unsupported", scope: !394, file: !394, line: 92, type: !448, isLocal: true, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @bufferediobase_unsupported, variables: !450)
!448 = !DISubroutineType(types: !449)
!449 = !{!45, !35}
!450 = !{!451, !452}
!451 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "message", arg: 1, scope: !447, file: !394, line: 92, type: !35)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !447, file: !394, line: 94, type: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyIO_State", file: !407, line: 135, baseType: !455)
!455 = !DICompositeType(tag: DW_TAG_structure_type, file: !407, line: 130, size: 192, align: 64, elements: !456)
!456 = !{!457, !458, !459}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !455, file: !407, line: 131, baseType: !51, size: 32, align: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "locale_module", scope: !455, file: !407, line: 132, baseType: !45, size: 64, align: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "unsupported_operation", scope: !455, file: !407, line: 134, baseType: !45, size: 64, align: 64, offset: 128)
!460 = !DISubprogram(name: "bufferediobase_read", scope: !394, file: !394, line: 131, type: !133, isLocal: true, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @bufferediobase_read, variables: !461)
!461 = !{!462, !463}
!462 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !460, file: !394, line: 131, type: !45)
!463 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !460, file: !394, line: 131, type: !45)
!464 = !DISubprogram(name: "bufferediobase_read1", scope: !394, file: !394, line: 144, type: !133, isLocal: true, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @bufferediobase_read1, variables: !465)
!465 = !{!466, !467}
!466 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !464, file: !394, line: 144, type: !45)
!467 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !464, file: !394, line: 144, type: !45)
!468 = !DISubprogram(name: "bufferediobase_readinto", scope: !394, file: !394, line: 50, type: !133, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @bufferediobase_readinto, variables: !469)
!469 = !{!470, !471, !472, !473, !474, !475, !479, !483}
!470 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !468, file: !394, line: 50, type: !45)
!471 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !468, file: !394, line: 50, type: !45)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !468, file: !394, line: 52, type: !243)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !468, file: !394, line: 53, type: !17)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !468, file: !394, line: 54, type: !45)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !476, file: !394, line: 65, type: !45)
!476 = distinct !DILexicalBlock(scope: !477, file: !394, line: 65, column: 12)
!477 = distinct !DILexicalBlock(scope: !478, file: !394, line: 64, column: 79)
!478 = distinct !DILexicalBlock(scope: !468, file: !394, line: 64, column: 9)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !480, file: !394, line: 76, type: !45)
!480 = distinct !DILexicalBlock(scope: !481, file: !394, line: 76, column: 12)
!481 = distinct !DILexicalBlock(scope: !482, file: !394, line: 71, column: 24)
!482 = distinct !DILexicalBlock(scope: !468, file: !394, line: 71, column: 9)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !484, file: !394, line: 82, type: !45)
!484 = distinct !DILexicalBlock(scope: !468, file: !394, line: 82, column: 8)
!485 = !DISubprogram(name: "bufferediobase_write", scope: !394, file: !394, line: 159, type: !133, isLocal: true, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @bufferediobase_write, variables: !486)
!486 = !{!487, !488}
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !485, file: !394, line: 159, type: !45)
!488 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !485, file: !394, line: 159, type: !45)
!489 = !DISubprogram(name: "buffered_dealloc", scope: !394, file: !394, line: 397, type: !490, isLocal: true, isDefinition: true, scopeLine: 398, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.buffered*)* @buffered_dealloc, variables: !492)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !392}
!492 = !{!493, !494, !496, !498, !502, !504}
!493 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !489, file: !394, line: 397, type: !392)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !495, file: !394, line: 402, type: !377)
!495 = distinct !DILexicalBlock(scope: !489, file: !394, line: 402, column: 8)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !497, file: !394, line: 406, type: !45)
!497 = distinct !DILexicalBlock(scope: !489, file: !394, line: 406, column: 8)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !499, file: !394, line: 406, type: !45)
!499 = distinct !DILexicalBlock(scope: !500, file: !394, line: 406, column: 113)
!500 = distinct !DILexicalBlock(scope: !501, file: !394, line: 406, column: 82)
!501 = distinct !DILexicalBlock(scope: !497, file: !394, line: 406, column: 59)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !503, file: !394, line: 417, type: !45)
!503 = distinct !DILexicalBlock(scope: !489, file: !394, line: 417, column: 8)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !505, file: !394, line: 417, type: !45)
!505 = distinct !DILexicalBlock(scope: !506, file: !394, line: 417, column: 115)
!506 = distinct !DILexicalBlock(scope: !507, file: !394, line: 417, column: 83)
!507 = distinct !DILexicalBlock(scope: !503, file: !394, line: 417, column: 60)
!508 = !DISubprogram(name: "buffered_repr", scope: !394, file: !394, line: 1367, type: !509, isLocal: true, isDefinition: true, scopeLine: 1368, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*)* @buffered_repr, variables: !511)
!509 = !DISubroutineType(types: !510)
!510 = !{!45, !392}
!511 = !{!512, !513, !514, !515}
!512 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !508, file: !394, line: 1367, type: !392)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nameobj", scope: !508, file: !394, line: 1369, type: !45)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !508, file: !394, line: 1369, type: !45)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !516, file: !394, line: 1382, type: !45)
!516 = distinct !DILexicalBlock(scope: !517, file: !394, line: 1382, column: 12)
!517 = distinct !DILexicalBlock(scope: !518, file: !394, line: 1379, column: 10)
!518 = distinct !DILexicalBlock(scope: !508, file: !394, line: 1372, column: 9)
!519 = !DISubprogram(name: "buffered_traverse", scope: !394, file: !394, line: 433, type: !520, isLocal: true, isDefinition: true, scopeLine: 434, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.buffered*, i32 (%struct._object*, i8*)*, i8*)* @buffered_traverse, variables: !522)
!520 = !DISubroutineType(types: !521)
!521 = !{!51, !392, !270, !4}
!522 = !{!523, !524, !525, !526, !530}
!523 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !519, file: !394, line: 433, type: !392)
!524 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !519, file: !394, line: 433, type: !270)
!525 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !519, file: !394, line: 433, type: !4)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !527, file: !394, line: 435, type: !51)
!527 = distinct !DILexicalBlock(scope: !528, file: !394, line: 435, column: 25)
!528 = distinct !DILexicalBlock(scope: !529, file: !394, line: 435, column: 14)
!529 = distinct !DILexicalBlock(scope: !519, file: !394, line: 435, column: 8)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !531, file: !394, line: 436, type: !51)
!531 = distinct !DILexicalBlock(scope: !532, file: !394, line: 436, column: 26)
!532 = distinct !DILexicalBlock(scope: !533, file: !394, line: 436, column: 14)
!533 = distinct !DILexicalBlock(scope: !519, file: !394, line: 436, column: 8)
!534 = !DISubprogram(name: "buffered_clear", scope: !394, file: !394, line: 441, type: !535, isLocal: true, isDefinition: true, scopeLine: 442, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.buffered*)* @buffered_clear, variables: !537)
!535 = !DISubroutineType(types: !536)
!536 = !{!51, !392}
!537 = !{!538, !539, !541, !545, !547}
!538 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !534, file: !394, line: 441, type: !392)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !540, file: !394, line: 444, type: !45)
!540 = distinct !DILexicalBlock(scope: !534, file: !394, line: 444, column: 8)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !542, file: !394, line: 444, type: !45)
!542 = distinct !DILexicalBlock(scope: !543, file: !394, line: 444, column: 113)
!543 = distinct !DILexicalBlock(scope: !544, file: !394, line: 444, column: 82)
!544 = distinct !DILexicalBlock(scope: !540, file: !394, line: 444, column: 59)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !546, file: !394, line: 445, type: !45)
!546 = distinct !DILexicalBlock(scope: !534, file: !394, line: 445, column: 8)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !548, file: !394, line: 445, type: !45)
!548 = distinct !DILexicalBlock(scope: !549, file: !394, line: 445, column: 115)
!549 = distinct !DILexicalBlock(scope: !550, file: !394, line: 445, column: 83)
!550 = distinct !DILexicalBlock(scope: !546, file: !394, line: 445, column: 60)
!551 = !DISubprogram(name: "buffered_iternext", scope: !394, file: !394, line: 1329, type: !509, isLocal: true, isDefinition: true, scopeLine: 1330, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*)* @buffered_iternext, variables: !552)
!552 = !{!553, !554, !555, !558, !564}
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !551, file: !394, line: 1329, type: !392)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !551, file: !394, line: 1331, type: !45)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tp", scope: !551, file: !394, line: 1332, type: !556)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !13, line: 422, baseType: !26)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !559, file: !394, line: 1349, type: !45)
!559 = distinct !DILexicalBlock(scope: !560, file: !394, line: 1349, column: 16)
!560 = distinct !DILexicalBlock(scope: !561, file: !394, line: 1345, column: 91)
!561 = distinct !DILexicalBlock(scope: !562, file: !394, line: 1345, column: 13)
!562 = distinct !DILexicalBlock(scope: !563, file: !394, line: 1342, column: 10)
!563 = distinct !DILexicalBlock(scope: !551, file: !394, line: 1337, column: 9)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !565, file: !394, line: 1359, type: !45)
!565 = distinct !DILexicalBlock(scope: !566, file: !394, line: 1359, column: 12)
!566 = distinct !DILexicalBlock(scope: !567, file: !394, line: 1357, column: 64)
!567 = distinct !DILexicalBlock(scope: !551, file: !394, line: 1357, column: 9)
!568 = !DISubprogram(name: "_buffered_readline", scope: !394, file: !394, line: 1068, type: !569, isLocal: true, isDefinition: true, scopeLine: 1069, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, i64)* @_buffered_readline, variables: !571)
!569 = !DISubroutineType(types: !570)
!570 = !{!45, !392, !17}
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !587, !591, !593, !597, !600, !602, !609, !613, !615, !619, !623, !627, !629, !633, !635}
!572 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !568, file: !394, line: 1068, type: !392)
!573 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "limit", arg: 2, scope: !568, file: !394, line: 1068, type: !17)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !568, file: !394, line: 1070, type: !45)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chunks", scope: !568, file: !394, line: 1071, type: !45)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !568, file: !394, line: 1072, type: !17)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "written", scope: !568, file: !394, line: 1072, type: !17)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !568, file: !394, line: 1073, type: !35)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !568, file: !394, line: 1073, type: !35)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !568, file: !394, line: 1073, type: !35)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !582, file: !394, line: 1110, type: !45)
!582 = distinct !DILexicalBlock(scope: !583, file: !394, line: 1110, column: 16)
!583 = distinct !DILexicalBlock(scope: !584, file: !394, line: 1109, column: 45)
!584 = distinct !DILexicalBlock(scope: !585, file: !394, line: 1109, column: 13)
!585 = distinct !DILexicalBlock(scope: !586, file: !394, line: 1105, column: 16)
!586 = distinct !DILexicalBlock(scope: !568, file: !394, line: 1105, column: 9)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !588, file: !394, line: 1110, type: !45)
!588 = distinct !DILexicalBlock(scope: !589, file: !394, line: 1110, column: 109)
!589 = distinct !DILexicalBlock(scope: !590, file: !394, line: 1110, column: 84)
!590 = distinct !DILexicalBlock(scope: !582, file: !394, line: 1110, column: 61)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !592, file: !394, line: 1113, type: !45)
!592 = distinct !DILexicalBlock(scope: !585, file: !394, line: 1113, column: 12)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !594, file: !394, line: 1113, type: !45)
!594 = distinct !DILexicalBlock(scope: !595, file: !394, line: 1113, column: 105)
!595 = distinct !DILexicalBlock(scope: !596, file: !394, line: 1113, column: 80)
!596 = distinct !DILexicalBlock(scope: !592, file: !394, line: 1113, column: 57)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !598, file: !394, line: 1120, type: !45)
!598 = distinct !DILexicalBlock(scope: !599, file: !394, line: 1119, column: 25)
!599 = distinct !DILexicalBlock(scope: !568, file: !394, line: 1119, column: 9)
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !601, file: !394, line: 1123, type: !45)
!601 = distinct !DILexicalBlock(scope: !598, file: !394, line: 1123, column: 12)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !603, file: !394, line: 1155, type: !45)
!603 = distinct !DILexicalBlock(scope: !604, file: !394, line: 1155, column: 16)
!604 = distinct !DILexicalBlock(scope: !605, file: !394, line: 1154, column: 45)
!605 = distinct !DILexicalBlock(scope: !606, file: !394, line: 1154, column: 13)
!606 = distinct !DILexicalBlock(scope: !607, file: !394, line: 1126, column: 14)
!607 = distinct !DILexicalBlock(scope: !608, file: !394, line: 1126, column: 5)
!608 = distinct !DILexicalBlock(scope: !568, file: !394, line: 1126, column: 5)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !610, file: !394, line: 1155, type: !45)
!610 = distinct !DILexicalBlock(scope: !611, file: !394, line: 1155, column: 109)
!611 = distinct !DILexicalBlock(scope: !612, file: !394, line: 1155, column: 84)
!612 = distinct !DILexicalBlock(scope: !603, file: !394, line: 1155, column: 61)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !614, file: !394, line: 1158, type: !45)
!614 = distinct !DILexicalBlock(scope: !606, file: !394, line: 1158, column: 12)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !616, file: !394, line: 1158, type: !45)
!616 = distinct !DILexicalBlock(scope: !617, file: !394, line: 1158, column: 105)
!617 = distinct !DILexicalBlock(scope: !618, file: !394, line: 1158, column: 80)
!618 = distinct !DILexicalBlock(scope: !614, file: !394, line: 1158, column: 57)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !620, file: !394, line: 1165, type: !45)
!620 = distinct !DILexicalBlock(scope: !621, file: !394, line: 1165, column: 12)
!621 = distinct !DILexicalBlock(scope: !622, file: !394, line: 1164, column: 62)
!622 = distinct !DILexicalBlock(scope: !568, file: !394, line: 1164, column: 9)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !624, file: !394, line: 1165, type: !45)
!624 = distinct !DILexicalBlock(scope: !625, file: !394, line: 1165, column: 105)
!625 = distinct !DILexicalBlock(scope: !626, file: !394, line: 1165, column: 80)
!626 = distinct !DILexicalBlock(scope: !620, file: !394, line: 1165, column: 57)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !628, file: !394, line: 1168, type: !45)
!628 = distinct !DILexicalBlock(scope: !568, file: !394, line: 1168, column: 8)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !630, file: !394, line: 1168, type: !45)
!630 = distinct !DILexicalBlock(scope: !631, file: !394, line: 1168, column: 101)
!631 = distinct !DILexicalBlock(scope: !632, file: !394, line: 1168, column: 76)
!632 = distinct !DILexicalBlock(scope: !628, file: !394, line: 1168, column: 53)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !634, file: !394, line: 1174, type: !45)
!634 = distinct !DILexicalBlock(scope: !568, file: !394, line: 1174, column: 8)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !636, file: !394, line: 1174, type: !45)
!636 = distinct !DILexicalBlock(scope: !637, file: !394, line: 1174, column: 98)
!637 = distinct !DILexicalBlock(scope: !634, file: !394, line: 1174, column: 64)
!638 = !DISubprogram(name: "buffered_closed", scope: !394, file: !394, line: 482, type: !535, isLocal: true, isDefinition: true, scopeLine: 483, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.buffered*)* @buffered_closed, variables: !639)
!639 = !{!640, !641, !642, !643}
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !638, file: !394, line: 482, type: !392)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "closed", scope: !638, file: !394, line: 484, type: !51)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !638, file: !394, line: 485, type: !45)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !644, file: !394, line: 491, type: !45)
!644 = distinct !DILexicalBlock(scope: !638, file: !394, line: 491, column: 8)
!645 = !DISubprogram(name: "_enter_buffered_busy", scope: !394, file: !394, line: 301, type: !535, isLocal: true, isDefinition: true, scopeLine: 302, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.buffered*)* @_enter_buffered_busy, variables: !646)
!646 = !{!647, !648}
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !645, file: !394, line: 301, type: !392)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !649, file: !394, line: 308, type: !650)
!649 = distinct !DILexicalBlock(scope: !645, file: !394, line: 308, column: 5)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64, align: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !652, line: 139, baseType: !653)
!652 = !DIFile(filename: "Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !652, line: 69, size: 1536, align: 64, elements: !654)
!654 = !{!655, !657, !658, !678, !681, !682, !683, !684, !685, !686, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !653, file: !652, line: 72, baseType: !656, size: 64, align: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64, align: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !653, file: !652, line: 73, baseType: !656, size: 64, align: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !653, file: !652, line: 74, baseType: !659, size: 64, align: 64, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !652, line: 44, baseType: !661)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !652, line: 19, size: 832, align: 64, elements: !662)
!662 = !{!663, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !661, file: !652, line: 21, baseType: !664, size: 64, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64, align: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !661, file: !652, line: 22, baseType: !656, size: 64, align: 64, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !661, file: !652, line: 24, baseType: !45, size: 64, align: 64, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !661, file: !652, line: 25, baseType: !45, size: 64, align: 64, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !661, file: !652, line: 26, baseType: !45, size: 64, align: 64, offset: 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !661, file: !652, line: 27, baseType: !45, size: 64, align: 64, offset: 320)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !661, file: !652, line: 28, baseType: !45, size: 64, align: 64, offset: 384)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !661, file: !652, line: 30, baseType: !45, size: 64, align: 64, offset: 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !661, file: !652, line: 31, baseType: !45, size: 64, align: 64, offset: 512)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !661, file: !652, line: 32, baseType: !45, size: 64, align: 64, offset: 576)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !661, file: !652, line: 33, baseType: !51, size: 32, align: 32, offset: 640)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !661, file: !652, line: 34, baseType: !51, size: 32, align: 32, offset: 672)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !661, file: !652, line: 37, baseType: !51, size: 32, align: 32, offset: 704)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !661, file: !652, line: 43, baseType: !45, size: 64, align: 64, offset: 768)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !653, file: !652, line: 76, baseType: !679, size: 64, align: 64, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64, align: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !652, line: 50, flags: DIFlagFwdDecl)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !653, file: !652, line: 77, baseType: !51, size: 32, align: 32, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !653, file: !652, line: 78, baseType: !37, size: 8, align: 8, offset: 288)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !653, file: !652, line: 80, baseType: !37, size: 8, align: 8, offset: 296)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !653, file: !652, line: 85, baseType: !51, size: 32, align: 32, offset: 320)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !653, file: !652, line: 86, baseType: !51, size: 32, align: 32, offset: 352)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !653, file: !652, line: 88, baseType: !687, size: 64, align: 64, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !652, line: 54, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64, align: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!51, !45, !679, !51, !45}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !653, file: !652, line: 89, baseType: !687, size: 64, align: 64, offset: 448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !653, file: !652, line: 90, baseType: !45, size: 64, align: 64, offset: 512)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !653, file: !652, line: 91, baseType: !45, size: 64, align: 64, offset: 576)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !653, file: !652, line: 93, baseType: !45, size: 64, align: 64, offset: 640)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !653, file: !652, line: 94, baseType: !45, size: 64, align: 64, offset: 704)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !653, file: !652, line: 95, baseType: !45, size: 64, align: 64, offset: 768)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !653, file: !652, line: 97, baseType: !45, size: 64, align: 64, offset: 832)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !653, file: !652, line: 98, baseType: !45, size: 64, align: 64, offset: 896)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !653, file: !652, line: 99, baseType: !45, size: 64, align: 64, offset: 960)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !653, file: !652, line: 101, baseType: !45, size: 64, align: 64, offset: 1024)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !653, file: !652, line: 103, baseType: !51, size: 32, align: 32, offset: 1088)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !653, file: !652, line: 105, baseType: !45, size: 64, align: 64, offset: 1152)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !653, file: !652, line: 106, baseType: !23, size: 64, align: 64, offset: 1216)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !653, file: !652, line: 108, baseType: !51, size: 32, align: 32, offset: 1280)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !653, file: !652, line: 109, baseType: !45, size: 64, align: 64, offset: 1344)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !653, file: !652, line: 134, baseType: !344, size: 64, align: 64, offset: 1408)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !653, file: !652, line: 135, baseType: !4, size: 64, align: 64, offset: 1472)
!708 = !DISubprogram(name: "buffered_flush_and_rewind_unlocked", scope: !394, file: !394, line: 838, type: !509, isLocal: true, isDefinition: true, scopeLine: 839, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*)* @buffered_flush_and_rewind_unlocked, variables: !709)
!709 = !{!710, !711, !712, !714}
!710 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !708, file: !394, line: 838, type: !392)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !708, file: !394, line: 840, type: !45)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !713, file: !394, line: 845, type: !45)
!713 = distinct !DILexicalBlock(scope: !708, file: !394, line: 845, column: 8)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !715, file: !394, line: 850, type: !406)
!715 = distinct !DILexicalBlock(scope: !716, file: !394, line: 847, column: 25)
!716 = distinct !DILexicalBlock(scope: !708, file: !394, line: 847, column: 9)
!717 = !DISubprogram(name: "_bufferedwriter_flush_unlocked", scope: !394, file: !394, line: 1933, type: !509, isLocal: true, isDefinition: true, scopeLine: 1934, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*)* @_bufferedwriter_flush_unlocked, variables: !718)
!718 = !{!719, !720, !721, !722}
!719 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !717, file: !394, line: 1933, type: !392)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "written", scope: !717, file: !394, line: 1935, type: !17)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !717, file: !394, line: 1936, type: !406)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rewind", scope: !717, file: !394, line: 1936, type: !406)
!723 = !DISubprogram(name: "_bufferedwriter_raw_write", scope: !394, file: !394, line: 1884, type: !724, isLocal: true, isDefinition: true, scopeLine: 1885, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.buffered*, i8*, i64)* @_bufferedwriter_raw_write, variables: !726)
!724 = !DISubroutineType(types: !725)
!725 = !{!17, !392, !59, !17}
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !735, !737, !741}
!727 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !723, file: !394, line: 1884, type: !392)
!728 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !723, file: !394, line: 1884, type: !59)
!729 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 3, scope: !723, file: !394, line: 1884, type: !17)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !723, file: !394, line: 1886, type: !243)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "memobj", scope: !723, file: !394, line: 1887, type: !45)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !723, file: !394, line: 1887, type: !45)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !723, file: !394, line: 1888, type: !17)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errnum", scope: !723, file: !394, line: 1889, type: !51)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !736, file: !394, line: 1906, type: !45)
!736 = distinct !DILexicalBlock(scope: !723, file: !394, line: 1906, column: 8)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !738, file: !394, line: 1913, type: !45)
!738 = distinct !DILexicalBlock(scope: !739, file: !394, line: 1913, column: 12)
!739 = distinct !DILexicalBlock(scope: !740, file: !394, line: 1909, column: 35)
!740 = distinct !DILexicalBlock(scope: !723, file: !394, line: 1909, column: 9)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !742, file: !394, line: 1918, type: !45)
!742 = distinct !DILexicalBlock(scope: !723, file: !394, line: 1918, column: 8)
!743 = !DISubprogram(name: "_set_BlockingIOError", scope: !394, file: !394, line: 673, type: !744, isLocal: true, isDefinition: true, scopeLine: 674, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i64)* @_set_BlockingIOError, variables: !746)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !59, !17}
!746 = !{!747, !748, !749, !750, !752}
!747 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msg", arg: 1, scope: !743, file: !394, line: 673, type: !59)
!748 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "written", arg: 2, scope: !743, file: !394, line: 673, type: !17)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !743, file: !394, line: 675, type: !45)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !751, file: !394, line: 685, type: !45)
!751 = distinct !DILexicalBlock(scope: !743, file: !394, line: 685, column: 8)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !753, file: !394, line: 685, type: !45)
!753 = distinct !DILexicalBlock(scope: !754, file: !394, line: 685, column: 95)
!754 = distinct !DILexicalBlock(scope: !751, file: !394, line: 685, column: 61)
!755 = !DISubprogram(name: "_bufferedwriter_reset_buf", scope: !394, file: !394, line: 1840, type: !490, isLocal: true, isDefinition: true, scopeLine: 1841, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.buffered*)* @_bufferedwriter_reset_buf, variables: !756)
!756 = !{!757}
!757 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !755, file: !394, line: 1840, type: !392)
!758 = !DISubprogram(name: "_buffered_raw_seek", scope: !394, file: !394, line: 729, type: !759, isLocal: true, isDefinition: true, scopeLine: 730, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.buffered*, i64, i32)* @_buffered_raw_seek, variables: !761)
!759 = !DISubroutineType(types: !760)
!760 = !{!406, !392, !406, !51}
!761 = !{!762, !763, !764, !765, !766, !767, !768, !769, !773, !775, !777}
!762 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !758, file: !394, line: 729, type: !392)
!763 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "target", arg: 2, scope: !758, file: !394, line: 729, type: !406)
!764 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "whence", arg: 3, scope: !758, file: !394, line: 729, type: !51)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !758, file: !394, line: 731, type: !45)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "posobj", scope: !758, file: !394, line: 731, type: !45)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "whenceobj", scope: !758, file: !394, line: 731, type: !45)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !758, file: !394, line: 732, type: !406)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !770, file: !394, line: 739, type: !45)
!770 = distinct !DILexicalBlock(scope: !771, file: !394, line: 739, column: 12)
!771 = distinct !DILexicalBlock(scope: !772, file: !394, line: 738, column: 34)
!772 = distinct !DILexicalBlock(scope: !758, file: !394, line: 738, column: 9)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !774, file: !394, line: 744, type: !45)
!774 = distinct !DILexicalBlock(scope: !758, file: !394, line: 744, column: 8)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !776, file: !394, line: 745, type: !45)
!776 = distinct !DILexicalBlock(scope: !758, file: !394, line: 745, column: 8)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !778, file: !394, line: 749, type: !45)
!778 = distinct !DILexicalBlock(scope: !758, file: !394, line: 749, column: 8)
!779 = !DISubprogram(name: "_bufferedreader_reset_buf", scope: !394, file: !394, line: 1394, type: !490, isLocal: true, isDefinition: true, scopeLine: 1395, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.buffered*)* @_bufferedreader_reset_buf, variables: !780)
!780 = !{!781}
!781 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !779, file: !394, line: 1394, type: !392)
!782 = !DISubprogram(name: "_bufferedreader_fill_buffer", scope: !394, file: !394, line: 1477, type: !783, isLocal: true, isDefinition: true, scopeLine: 1478, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.buffered*)* @_bufferedreader_fill_buffer, variables: !785)
!783 = !DISubroutineType(types: !784)
!784 = !{!17, !392}
!785 = !{!786, !787, !788, !789}
!786 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !782, file: !394, line: 1477, type: !392)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !782, file: !394, line: 1479, type: !17)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !782, file: !394, line: 1479, type: !17)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !782, file: !394, line: 1479, type: !17)
!790 = !DISubprogram(name: "_bufferedreader_raw_read", scope: !394, file: !394, line: 1436, type: !724, isLocal: true, isDefinition: true, scopeLine: 1437, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.buffered*, i8*, i64)* @_bufferedreader_raw_read, variables: !791)
!791 = !{!792, !793, !794, !795, !796, !797, !798, !799, !801, !805}
!792 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !790, file: !394, line: 1436, type: !392)
!793 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !790, file: !394, line: 1436, type: !59)
!794 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 3, scope: !790, file: !394, line: 1436, type: !17)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !790, file: !394, line: 1438, type: !243)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "memobj", scope: !790, file: !394, line: 1439, type: !45)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !790, file: !394, line: 1439, type: !45)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !790, file: !394, line: 1440, type: !17)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !800, file: !394, line: 1455, type: !45)
!800 = distinct !DILexicalBlock(scope: !790, file: !394, line: 1455, column: 8)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !802, file: !394, line: 1460, type: !45)
!802 = distinct !DILexicalBlock(scope: !803, file: !394, line: 1460, column: 12)
!803 = distinct !DILexicalBlock(scope: !804, file: !394, line: 1458, column: 35)
!804 = distinct !DILexicalBlock(scope: !790, file: !394, line: 1458, column: 9)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !806, file: !394, line: 1464, type: !45)
!806 = distinct !DILexicalBlock(scope: !790, file: !394, line: 1464, column: 8)
!807 = !DISubprogram(name: "buffered_detach", scope: !394, file: !394, line: 569, type: !808, isLocal: true, isDefinition: true, scopeLine: 570, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, %struct._object*)* @buffered_detach, variables: !810)
!808 = !DISubroutineType(types: !809)
!809 = !{!45, !392, !45}
!810 = !{!811, !812, !813, !814, !815}
!811 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !807, file: !394, line: 569, type: !392)
!812 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !807, file: !394, line: 569, type: !45)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "raw", scope: !807, file: !394, line: 571, type: !45)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !807, file: !394, line: 571, type: !45)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !816, file: !394, line: 576, type: !45)
!816 = distinct !DILexicalBlock(scope: !807, file: !394, line: 576, column: 8)
!817 = !DISubprogram(name: "buffered_simple_flush", scope: !394, file: !394, line: 475, type: !808, isLocal: true, isDefinition: true, scopeLine: 476, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, %struct._object*)* @buffered_simple_flush, variables: !818)
!818 = !{!819, !820}
!819 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !817, file: !394, line: 475, type: !392)
!820 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !817, file: !394, line: 475, type: !45)
!821 = !DISubprogram(name: "buffered_close", scope: !394, file: !394, line: 503, type: !808, isLocal: true, isDefinition: true, scopeLine: 504, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, %struct._object*)* @buffered_close, variables: !822)
!822 = !{!823, !824, !825, !826, !827, !828, !829, !830, !833, !836, !839, !845, !849, !851, !853, !855}
!823 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !821, file: !394, line: 503, type: !392)
!824 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !821, file: !394, line: 503, type: !45)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !821, file: !394, line: 505, type: !45)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc", scope: !821, file: !394, line: 505, type: !45)
!827 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !821, file: !394, line: 505, type: !45)
!828 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !821, file: !394, line: 505, type: !45)
!829 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !821, file: !394, line: 506, type: !51)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !831, file: !394, line: 522, type: !45)
!831 = distinct !DILexicalBlock(scope: !832, file: !394, line: 521, column: 27)
!832 = distinct !DILexicalBlock(scope: !821, file: !394, line: 521, column: 9)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !834, file: !394, line: 524, type: !45)
!834 = distinct !DILexicalBlock(scope: !835, file: !394, line: 524, column: 16)
!835 = distinct !DILexicalBlock(scope: !831, file: !394, line: 523, column: 13)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !837, file: !394, line: 536, type: !45)
!837 = distinct !DILexicalBlock(scope: !838, file: !394, line: 536, column: 12)
!838 = distinct !DILexicalBlock(scope: !821, file: !394, line: 533, column: 9)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !840, file: !394, line: 547, type: !45)
!840 = distinct !DILexicalBlock(scope: !841, file: !394, line: 547, column: 16)
!841 = distinct !DILexicalBlock(scope: !842, file: !394, line: 546, column: 32)
!842 = distinct !DILexicalBlock(scope: !843, file: !394, line: 546, column: 13)
!843 = distinct !DILexicalBlock(scope: !844, file: !394, line: 545, column: 28)
!844 = distinct !DILexicalBlock(scope: !821, file: !394, line: 545, column: 9)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !846, file: !394, line: 547, type: !45)
!846 = distinct !DILexicalBlock(scope: !847, file: !394, line: 547, column: 109)
!847 = distinct !DILexicalBlock(scope: !848, file: !394, line: 547, column: 84)
!848 = distinct !DILexicalBlock(scope: !840, file: !394, line: 547, column: 61)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val2", scope: !850, file: !394, line: 551, type: !45)
!850 = distinct !DILexicalBlock(scope: !842, file: !394, line: 550, column: 14)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !852, file: !394, line: 552, type: !45)
!852 = distinct !DILexicalBlock(scope: !850, file: !394, line: 552, column: 16)
!853 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !854, file: !394, line: 553, type: !45)
!854 = distinct !DILexicalBlock(scope: !850, file: !394, line: 553, column: 16)
!855 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !856, file: !394, line: 553, type: !45)
!856 = distinct !DILexicalBlock(scope: !857, file: !394, line: 553, column: 102)
!857 = distinct !DILexicalBlock(scope: !854, file: !394, line: 553, column: 68)
!858 = !DISubprogram(name: "buffered_seekable", scope: !394, file: !394, line: 587, type: !808, isLocal: true, isDefinition: true, scopeLine: 588, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, %struct._object*)* @buffered_seekable, variables: !859)
!859 = !{!860, !861}
!860 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !858, file: !394, line: 587, type: !392)
!861 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !858, file: !394, line: 587, type: !45)
!862 = !DISubprogram(name: "buffered_readable", scope: !394, file: !394, line: 594, type: !808, isLocal: true, isDefinition: true, scopeLine: 595, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, %struct._object*)* @buffered_readable, variables: !863)
!863 = !{!864, !865}
!864 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !862, file: !394, line: 594, type: !392)
!865 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !862, file: !394, line: 594, type: !45)
!866 = !DISubprogram(name: "buffered_writable", scope: !394, file: !394, line: 601, type: !808, isLocal: true, isDefinition: true, scopeLine: 602, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, %struct._object*)* @buffered_writable, variables: !867)
!867 = !{!868, !869}
!868 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !866, file: !394, line: 601, type: !392)
!869 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !866, file: !394, line: 601, type: !45)
!870 = !DISubprogram(name: "buffered_fileno", scope: !394, file: !394, line: 624, type: !808, isLocal: true, isDefinition: true, scopeLine: 625, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, %struct._object*)* @buffered_fileno, variables: !871)
!871 = !{!872, !873}
!872 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !870, file: !394, line: 624, type: !392)
!873 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !870, file: !394, line: 624, type: !45)
!874 = !DISubprogram(name: "buffered_isatty", scope: !394, file: !394, line: 631, type: !808, isLocal: true, isDefinition: true, scopeLine: 632, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, %struct._object*)* @buffered_isatty, variables: !875)
!875 = !{!876, !877}
!876 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !874, file: !394, line: 631, type: !392)
!877 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !874, file: !394, line: 631, type: !45)
!878 = !DISubprogram(name: "buffered_dealloc_warn", scope: !394, file: !394, line: 453, type: !808, isLocal: true, isDefinition: true, scopeLine: 454, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, %struct._object*)* @buffered_dealloc_warn, variables: !879)
!879 = !{!880, !881, !882, !885}
!880 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !878, file: !394, line: 453, type: !392)
!881 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "source", arg: 2, scope: !878, file: !394, line: 453, type: !45)
!882 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !883, file: !394, line: 456, type: !45)
!883 = distinct !DILexicalBlock(scope: !884, file: !394, line: 455, column: 32)
!884 = distinct !DILexicalBlock(scope: !878, file: !394, line: 455, column: 9)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !886, file: !394, line: 459, type: !45)
!886 = distinct !DILexicalBlock(scope: !887, file: !394, line: 459, column: 16)
!887 = distinct !DILexicalBlock(scope: !883, file: !394, line: 458, column: 13)
!888 = !DISubprogram(name: "buffered_getstate", scope: !394, file: !394, line: 640, type: !808, isLocal: true, isDefinition: true, scopeLine: 641, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, %struct._object*)* @buffered_getstate, variables: !889)
!889 = !{!890, !891}
!890 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !888, file: !394, line: 640, type: !392)
!891 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !888, file: !394, line: 640, type: !45)
!892 = !DISubprogram(name: "buffered_read", scope: !394, file: !394, line: 903, type: !808, isLocal: true, isDefinition: true, scopeLine: 904, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.buffered*, %struct._object*)* @buffered_read, variables: !893)
!893 = !{!894, !895, !896, !897, !898}
!894 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !892, file: !394, line: 903, type: !392)
!895 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !892, file: !394, line: 903, type: !45)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !892, file: !394, line: 905, type: !17)
