; ModuleID = 'irs-onlybc/bytesobject.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !457, globals: !1906)
!1 = !DIFile(filename: "bytesobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !12, !18, !101, !350, !358, !359, !59, !360, !362, !36, !364, !365, !367, !385, !393, !409, !38, !418, !242, !51, !426, !408, !429, !431, !433, !435, !449}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !14, line: 109, baseType: !15)
!14 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !14, line: 105, size: 128, align: 64, elements: !16)
!16 = !{!17, !25}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !15, file: !14, line: 107, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !19, line: 177, baseType: !20)
!19 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !21, line: 102, baseType: !22)
!21 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !23, line: 181, baseType: !24)
!23 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!24 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !15, file: !14, line: 108, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !14, line: 334, size: 3200, align: 64, elements: !28)
!28 = !{!29, !35, !39, !40, !41, !46, !109, !114, !119, !120, !125, !177, !208, !220, !226, !227, !228, !230, !232, !263, !264, !265, !274, !275, !280, !281, !283, !285, !295, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !27, file: !14, line: 335, baseType: !30, size: 192, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !14, line: 114, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 111, size: 192, align: 64, elements: !32)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !14, line: 112, baseType: !13, size: 128, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !31, file: !14, line: 113, baseType: !18, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !27, file: !14, line: 336, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !27, file: !14, line: 341, baseType: !42, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !14, line: 308, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !12}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !27, file: !14, line: 342, baseType: !47, size: 64, align: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !14, line: 314, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !12, !52, !51}
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !21, line: 48, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !55, line: 246, size: 1728, align: 64, elements: !56)
!55 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!56 = !{!57, !58, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !78, !79, !80, !81, !83, !85, !87, !91, !94, !96, !97, !98, !99, !100, !104, !105}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !54, file: !55, line: 247, baseType: !51, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !54, file: !55, line: 252, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !54, file: !55, line: 253, baseType: !59, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !54, file: !55, line: 254, baseType: !59, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !54, file: !55, line: 255, baseType: !59, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !54, file: !55, line: 256, baseType: !59, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !54, file: !55, line: 257, baseType: !59, size: 64, align: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !54, file: !55, line: 258, baseType: !59, size: 64, align: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !54, file: !55, line: 259, baseType: !59, size: 64, align: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !54, file: !55, line: 261, baseType: !59, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !54, file: !55, line: 262, baseType: !59, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !54, file: !55, line: 263, baseType: !59, size: 64, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !54, file: !55, line: 265, baseType: !71, size: 64, align: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !55, line: 161, size: 192, align: 64, elements: !73)
!73 = !{!74, !75, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !72, file: !55, line: 162, baseType: !71, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !72, file: !55, line: 163, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !72, file: !55, line: 167, baseType: !51, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !54, file: !55, line: 267, baseType: !76, size: 64, align: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !54, file: !55, line: 269, baseType: !51, size: 32, align: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !54, file: !55, line: 273, baseType: !51, size: 32, align: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !54, file: !55, line: 275, baseType: !82, size: 64, align: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !23, line: 140, baseType: !24)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !54, file: !55, line: 279, baseType: !84, size: 16, align: 16, offset: 1024)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !54, file: !55, line: 280, baseType: !86, size: 8, align: 8, offset: 1040)
!86 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !54, file: !55, line: 281, baseType: !88, size: 8, align: 8, offset: 1048)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !54, file: !55, line: 285, baseType: !92, size: 64, align: 64, offset: 1088)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !55, line: 155, baseType: null)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !54, file: !55, line: 294, baseType: !95, size: 64, align: 64, offset: 1152)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !23, line: 141, baseType: !24)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !54, file: !55, line: 303, baseType: !11, size: 64, align: 64, offset: 1216)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !54, file: !55, line: 304, baseType: !11, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !54, file: !55, line: 305, baseType: !11, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !54, file: !55, line: 306, baseType: !11, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !54, file: !55, line: 307, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !54, file: !55, line: 309, baseType: !51, size: 32, align: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !54, file: !55, line: 311, baseType: !106, size: 160, align: 8, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !27, file: !14, line: 343, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !14, line: 316, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!12, !12, !59}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !27, file: !14, line: 344, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !14, line: 318, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!51, !12, !59, !12}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !27, file: !14, line: 345, baseType: !11, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !27, file: !14, line: 346, baseType: !121, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !14, line: 320, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!12, !12}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !27, file: !14, line: 350, baseType: !126, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !14, line: 278, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 236, size: 2176, align: 64, elements: !129)
!129 = !{!130, !135, !136, !137, !138, !139, !144, !146, !147, !148, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !128, file: !14, line: 241, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !14, line: 166, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!12, !12, !12}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !128, file: !14, line: 242, baseType: !131, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !128, file: !14, line: 243, baseType: !131, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !128, file: !14, line: 244, baseType: !131, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !128, file: !14, line: 245, baseType: !131, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !128, file: !14, line: 246, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !14, line: 167, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!12, !12, !12, !12}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !128, file: !14, line: 247, baseType: !145, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !14, line: 165, baseType: !122)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !128, file: !14, line: 248, baseType: !145, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !128, file: !14, line: 249, baseType: !145, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !128, file: !14, line: 250, baseType: !149, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !14, line: 168, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!51, !12}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !128, file: !14, line: 251, baseType: !145, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !128, file: !14, line: 252, baseType: !131, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !128, file: !14, line: 253, baseType: !131, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !128, file: !14, line: 254, baseType: !131, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !128, file: !14, line: 255, baseType: !131, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !128, file: !14, line: 256, baseType: !131, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !128, file: !14, line: 257, baseType: !145, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !128, file: !14, line: 258, baseType: !11, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !128, file: !14, line: 259, baseType: !145, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !128, file: !14, line: 261, baseType: !131, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !128, file: !14, line: 262, baseType: !131, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !128, file: !14, line: 263, baseType: !131, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !128, file: !14, line: 264, baseType: !131, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !128, file: !14, line: 265, baseType: !140, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !128, file: !14, line: 266, baseType: !131, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !128, file: !14, line: 267, baseType: !131, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !128, file: !14, line: 268, baseType: !131, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !128, file: !14, line: 269, baseType: !131, size: 64, align: 64, offset: 1728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !128, file: !14, line: 270, baseType: !131, size: 64, align: 64, offset: 1792)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !128, file: !14, line: 272, baseType: !131, size: 64, align: 64, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !128, file: !14, line: 273, baseType: !131, size: 64, align: 64, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !128, file: !14, line: 274, baseType: !131, size: 64, align: 64, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !128, file: !14, line: 275, baseType: !131, size: 64, align: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !128, file: !14, line: 277, baseType: !145, size: 64, align: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !27, file: !14, line: 351, baseType: !178, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !14, line: 292, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 280, size: 640, align: 64, elements: !181)
!181 = !{!182, !187, !188, !193, !194, !195, !200, !201, !206, !207}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !180, file: !14, line: 281, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !14, line: 169, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!18, !12}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !180, file: !14, line: 282, baseType: !131, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !180, file: !14, line: 283, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !14, line: 170, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!12, !12, !18}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !180, file: !14, line: 284, baseType: !189, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !180, file: !14, line: 285, baseType: !11, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !180, file: !14, line: 286, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !14, line: 172, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!51, !12, !18, !12}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !180, file: !14, line: 287, baseType: !11, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !180, file: !14, line: 288, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !14, line: 231, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!51, !12, !12}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !180, file: !14, line: 290, baseType: !131, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !180, file: !14, line: 291, baseType: !189, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !27, file: !14, line: 352, baseType: !209, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !14, line: 298, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 294, size: 192, align: 64, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !211, file: !14, line: 295, baseType: !183, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !211, file: !14, line: 296, baseType: !131, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !211, file: !14, line: 297, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !14, line: 174, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!51, !12, !12, !12}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !27, file: !14, line: 356, baseType: !221, size: 64, align: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !14, line: 321, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !12}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !19, line: 186, baseType: !18)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !27, file: !14, line: 357, baseType: !140, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !27, file: !14, line: 358, baseType: !121, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !27, file: !14, line: 359, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !14, line: 317, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !27, file: !14, line: 360, baseType: !231, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !14, line: 319, baseType: !217)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !27, file: !14, line: 363, baseType: !233, size: 64, align: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !14, line: 304, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 301, size: 128, align: 64, elements: !236)
!236 = !{!237, !258}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !235, file: !14, line: 302, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !14, line: 193, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!51, !12, !242, !51}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !14, line: 191, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !14, line: 178, size: 640, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !255, !256, !257}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !244, file: !14, line: 179, baseType: !11, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !244, file: !14, line: 180, baseType: !12, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !14, line: 181, baseType: !18, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !244, file: !14, line: 182, baseType: !18, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !244, file: !14, line: 184, baseType: !51, size: 32, align: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !244, file: !14, line: 185, baseType: !51, size: 32, align: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !244, file: !14, line: 186, baseType: !59, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !244, file: !14, line: 187, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !244, file: !14, line: 188, baseType: !254, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !244, file: !14, line: 189, baseType: !254, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !244, file: !14, line: 190, baseType: !11, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !235, file: !14, line: 303, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !14, line: 194, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !12, !242}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !27, file: !14, line: 366, baseType: !103, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !27, file: !14, line: 368, baseType: !36, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !27, file: !14, line: 372, baseType: !266, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !14, line: 233, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!51, !12, !270, !11}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !14, line: 232, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!51, !12, !11}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !27, file: !14, line: 375, baseType: !149, size: 64, align: 64, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !27, file: !14, line: 379, baseType: !276, size: 64, align: 64, offset: 1600)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !14, line: 322, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!12, !12, !12, !51}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !27, file: !14, line: 382, baseType: !18, size: 64, align: 64, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !27, file: !14, line: 385, baseType: !282, size: 64, align: 64, offset: 1728)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !14, line: 323, baseType: !122)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !27, file: !14, line: 386, baseType: !284, size: 64, align: 64, offset: 1792)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !14, line: 324, baseType: !122)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !27, file: !14, line: 389, baseType: !286, size: 64, align: 64, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 40, size: 256, align: 64, elements: !289)
!288 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 41, baseType: !36, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 18, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 43, baseType: !51, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 45, baseType: !36, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !27, file: !14, line: 390, baseType: !296, size: 64, align: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !14, line: 390, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !27, file: !14, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !59, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!12, !12, !11}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!51, !12, !12, !11}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !59, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !11, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !27, file: !14, line: 392, baseType: !26, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !27, file: !14, line: 393, baseType: !12, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !27, file: !14, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !14, line: 325, baseType: !141)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !27, file: !14, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !14, line: 326, baseType: !217)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !27, file: !14, line: 396, baseType: !18, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !27, file: !14, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !14, line: 327, baseType: !217)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !27, file: !14, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !14, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!12, !26, !18}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !27, file: !14, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !14, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!12, !26, !12, !12}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !27, file: !14, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !14, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !11}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !27, file: !14, line: 401, baseType: !149, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !27, file: !14, line: 402, baseType: !12, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !27, file: !14, line: 403, baseType: !12, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !27, file: !14, line: 404, baseType: !12, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !27, file: !14, line: 405, baseType: !12, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !27, file: !14, line: 406, baseType: !12, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !27, file: !14, line: 407, baseType: !42, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !27, file: !14, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !27, file: !14, line: 412, baseType: !42, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !352, line: 41, baseType: !353)
!352 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!353 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 31, size: 320, align: 64, elements: !354)
!354 = !{!355, !356, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !353, file: !352, line: 32, baseType: !30, size: 192, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !353, file: !352, line: 33, baseType: !225, size: 64, align: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !353, file: !352, line: 34, baseType: !88, size: 8, align: 8, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!359 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !359)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !359)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !369)
!369 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !370)
!370 = !{!371, !372, !373, !374, !382}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !369, file: !4, line: 291, baseType: !13, size: 128, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !369, file: !4, line: 292, baseType: !18, size: 64, align: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !369, file: !4, line: 293, baseType: !225, size: 64, align: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !369, file: !4, line: 349, baseType: !375, size: 32, align: 32, offset: 256)
!375 = !DICompositeType(tag: DW_TAG_structure_type, scope: !369, file: !4, line: 294, size: 32, align: 32, elements: !376)
!376 = !{!377, !378, !379, !380, !381}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !375, file: !4, line: 303, baseType: !348, size: 2, align: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !375, file: !4, line: 331, baseType: !348, size: 3, align: 32, offset: 2)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !375, file: !4, line: 336, baseType: !348, size: 1, align: 32, offset: 5)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !375, file: !4, line: 340, baseType: !348, size: 1, align: 32, offset: 6)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !375, file: !4, line: 345, baseType: !348, size: 1, align: 32, offset: 7)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !369, file: !4, line: 350, baseType: !383, size: 64, align: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !102, line: 90, baseType: !51)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !387)
!387 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !388)
!388 = !{!389, !390, !391, !392}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !387, file: !4, line: 357, baseType: !368, size: 384, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !387, file: !4, line: 358, baseType: !18, size: 64, align: 64, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !387, file: !4, line: 360, baseType: !59, size: 64, align: 64, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !387, file: !4, line: 361, baseType: !18, size: 64, align: 64, offset: 512)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !395)
!395 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !396)
!396 = !{!397, !398}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !395, file: !4, line: 369, baseType: !386, size: 576, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !395, file: !4, line: 375, baseType: !399, size: 64, align: 64, offset: 576)
!399 = !DICompositeType(tag: DW_TAG_union_type, scope: !395, file: !4, line: 370, size: 64, align: 64, elements: !400)
!400 = !{!401, !402, !403, !406}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !399, file: !4, line: 371, baseType: !11, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !399, file: !4, line: 372, baseType: !365, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !399, file: !4, line: 373, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !84)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !399, file: !4, line: 374, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !348)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !411, line: 40, baseType: !412)
!411 = !DIFile(filename: "Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!412 = !DICompositeType(tag: DW_TAG_structure_type, file: !411, line: 23, size: 320, align: 64, elements: !413)
!413 = !{!414, !415, !417}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !412, file: !411, line: 24, baseType: !30, size: 192, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !412, file: !411, line: 26, baseType: !416, size: 64, align: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !412, file: !411, line: 39, baseType: !18, size: 64, align: 64, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !420, line: 33, baseType: !421)
!420 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!421 = !DICompositeType(tag: DW_TAG_structure_type, file: !420, line: 25, size: 256, align: 64, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !421, file: !420, line: 26, baseType: !30, size: 192, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !421, file: !420, line: 27, baseType: !425, size: 64, align: 64, offset: 192)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, align: 64, elements: !89)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_uintptr_t", file: !19, line: 153, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !428, line: 122, baseType: !103)
!428 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !437, line: 253, baseType: !438)
!437 = !DIFile(filename: "Include/objimpl.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!438 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !437, line: 246, size: 192, align: 64, elements: !439)
!439 = !{!440, !447}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !438, file: !437, line: 251, baseType: !441, size: 192, align: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, scope: !438, file: !437, line: 247, size: 192, align: 64, elements: !442)
!442 = !{!443, !445, !446}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !441, file: !437, line: 248, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !441, file: !437, line: 249, baseType: !444, size: 64, align: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !441, file: !437, line: 250, baseType: !18, size: 64, align: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !438, file: !437, line: 252, baseType: !448, size: 64, align: 64)
!448 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "striterobject", file: !451, line: 2864, baseType: !452)
!451 = !DIFile(filename: "Objects/bytesobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!452 = !DICompositeType(tag: DW_TAG_structure_type, file: !451, line: 2860, size: 256, align: 64, elements: !453)
!453 = !{!454, !455, !456}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !452, file: !451, line: 2861, baseType: !13, size: 128, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "it_index", scope: !452, file: !451, line: 2862, baseType: !18, size: 64, align: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "it_seq", scope: !452, file: !451, line: 2863, baseType: !350, size: 64, align: 64, offset: 192)
!457 = !{!458, !465, !472, !517, !524, !580, !583, !588, !596, !616, !620, !682, !699, !708, !720, !739, !743, !798, !805, !808, !811, !816, !827, !831, !840, !851, !878, !899, !919, !924, !927, !934, !951, !959, !964, !969, !978, !987, !1000, !1013, !1032, !1041, !1048, !1059, !1072, !1092, !1097, !1112, !1122, !1130, !1138, !1158, !1163, !1168, !1171, !1174, !1177, !1180, !1183, !1186, !1189, !1195, !1199, !1203, !1213, !1221, !1233, !1237, !1243, !1260, !1271, !1281, !1286, !1301, !1317, !1328, !1344, !1359, !1374, !1392, !1410, !1415, !1420, !1426, !1432, !1446, !1461, !1499, !1537, !1580, !1584, !1597, !1632, !1669, !1710, !1716, !1740, !1751, !1755, !1759, !1763, !1794, !1798, !1806, !1810, !1833, !1843, !1851, !1863, !1874, !1883, !1887, !1893, !1900}
!458 = !DISubprogram(name: "PyBytes_FromStringAndSize", scope: !451, file: !451, line: 75, type: !459, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i64)* @PyBytes_FromStringAndSize, variables: !461)
!459 = !DISubroutineType(types: !460)
!460 = !{!12, !36, !18}
!461 = !{!462, !463, !464}
!462 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !458, file: !451, line: 75, type: !36)
!463 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !458, file: !451, line: 75, type: !18)
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !458, file: !451, line: 77, type: !350)
!465 = !DISubprogram(name: "PyBytes_FromString", scope: !451, file: !451, line: 127, type: !466, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @PyBytes_FromString, variables: !468)
!466 = !DISubroutineType(types: !467)
!467 = !{!12, !36}
!468 = !{!469, !470, !471}
!469 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !465, file: !451, line: 127, type: !36)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !465, file: !451, line: 129, type: !101)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !465, file: !451, line: 130, type: !350)
!472 = !DISubprogram(name: "PyBytes_FromFormatV", scope: !451, file: !451, line: 173, type: !473, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct.__va_list_tag*)* @PyBytes_FromFormatV, variables: !483)
!473 = !DISubroutineType(types: !474)
!474 = !{!12, !36, !475}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "__va_list_tag", file: !1, line: 170, baseType: !477)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 170, size: 192, align: 64, elements: !478)
!478 = !{!479, !480, !481, !482}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !477, file: !1, line: 170, baseType: !348, size: 32, align: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !477, file: !1, line: 170, baseType: !348, size: 32, align: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !477, file: !1, line: 170, baseType: !11, size: 64, align: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !477, file: !1, line: 170, baseType: !11, size: 64, align: 64, offset: 128)
!483 = !{!484, !485, !486, !492, !493, !494, !495, !496, !502, !505, !511, !512, !513, !514}
!484 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 1, scope: !472, file: !451, line: 173, type: !36)
!485 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vargs", arg: 2, scope: !472, file: !451, line: 173, type: !475)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !472, file: !451, line: 175, type: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !21, line: 79, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !489, line: 50, baseType: !490)
!489 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stdarg.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 175, baseType: !491)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 192, align: 64, elements: !89)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !472, file: !451, line: 176, type: !18)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !472, file: !451, line: 177, type: !36)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !472, file: !451, line: 178, type: !59)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "string", scope: !472, file: !451, line: 179, type: !12)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !497, file: !451, line: 185, type: !36)
!497 = distinct !DILexicalBlock(scope: !498, file: !451, line: 184, column: 24)
!498 = distinct !DILexicalBlock(scope: !499, file: !451, line: 184, column: 13)
!499 = distinct !DILexicalBlock(scope: !500, file: !451, line: 183, column: 31)
!500 = distinct !DILexicalBlock(scope: !501, file: !451, line: 183, column: 5)
!501 = distinct !DILexicalBlock(scope: !472, file: !451, line: 183, column: 5)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !503, file: !451, line: 199, type: !51)
!503 = distinct !DILexicalBlock(scope: !504, file: !451, line: 198, column: 13)
!504 = distinct !DILexicalBlock(scope: !497, file: !451, line: 196, column: 25)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !506, file: !451, line: 257, type: !36)
!506 = distinct !DILexicalBlock(scope: !507, file: !451, line: 256, column: 24)
!507 = distinct !DILexicalBlock(scope: !508, file: !451, line: 256, column: 13)
!508 = distinct !DILexicalBlock(scope: !509, file: !451, line: 255, column: 31)
!509 = distinct !DILexicalBlock(scope: !510, file: !451, line: 255, column: 5)
!510 = distinct !DILexicalBlock(scope: !472, file: !451, line: 255, column: 5)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !506, file: !451, line: 258, type: !18)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "longflag", scope: !506, file: !451, line: 259, type: !51)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size_tflag", scope: !506, file: !451, line: 260, type: !51)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !515, file: !451, line: 289, type: !51)
!515 = distinct !DILexicalBlock(scope: !516, file: !451, line: 288, column: 13)
!516 = distinct !DILexicalBlock(scope: !506, file: !451, line: 286, column: 25)
!517 = !DISubprogram(name: "PyBytes_FromFormat", scope: !451, file: !451, line: 362, type: !518, isLocal: false, isDefinition: true, scopeLine: 363, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, ...)* @PyBytes_FromFormat, variables: !520)
!518 = !DISubroutineType(types: !519)
!519 = !{!12, !36, null}
!520 = !{!521, !522, !523}
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 1, scope: !517, file: !451, line: 362, type: !36)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !517, file: !451, line: 364, type: !12)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vargs", scope: !517, file: !451, line: 365, type: !487)
!524 = !DISubprogram(name: "PyBytes_DecodeEscape", scope: !451, file: !451, line: 388, type: !525, isLocal: false, isDefinition: true, scopeLine: 393, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i64, i8*, i64, i8*)* @PyBytes_DecodeEscape, variables: !527)
!525 = !DISubroutineType(types: !526)
!526 = !{!12, !36, !18, !36, !18, !36}
!527 = !{!528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !545, !546, !547, !548, !549, !551, !553, !557, !560, !561, !563, !564, !567, !568, !570, !571, !574, !575, !577, !578}
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !524, file: !451, line: 388, type: !36)
!529 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !524, file: !451, line: 389, type: !18)
!530 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 3, scope: !524, file: !451, line: 390, type: !36)
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unicode", arg: 4, scope: !524, file: !451, line: 391, type: !18)
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "recode_encoding", arg: 5, scope: !524, file: !451, line: 392, type: !36)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !524, file: !451, line: 394, type: !51)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !524, file: !451, line: 395, type: !59)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !524, file: !451, line: 395, type: !59)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !524, file: !451, line: 396, type: !36)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !524, file: !451, line: 397, type: !12)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newlen", scope: !524, file: !451, line: 398, type: !18)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !540, file: !451, line: 408, type: !12)
!540 = distinct !DILexicalBlock(scope: !541, file: !451, line: 407, column: 49)
!541 = distinct !DILexicalBlock(scope: !542, file: !451, line: 407, column: 17)
!542 = distinct !DILexicalBlock(scope: !543, file: !451, line: 405, column: 25)
!543 = distinct !DILexicalBlock(scope: !544, file: !451, line: 405, column: 13)
!544 = distinct !DILexicalBlock(scope: !524, file: !451, line: 404, column: 21)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !540, file: !451, line: 408, type: !12)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !540, file: !451, line: 409, type: !59)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !540, file: !451, line: 410, type: !36)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rn", scope: !540, file: !451, line: 411, type: !18)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !550, file: !451, line: 421, type: !12)
!550 = distinct !DILexicalBlock(scope: !540, file: !451, line: 421, column: 20)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !552, file: !451, line: 430, type: !12)
!552 = distinct !DILexicalBlock(scope: !540, file: !451, line: 430, column: 20)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !554, file: !451, line: 468, type: !348)
!554 = distinct !DILexicalBlock(scope: !555, file: !451, line: 467, column: 152)
!555 = distinct !DILexicalBlock(scope: !556, file: !451, line: 467, column: 17)
!556 = distinct !DILexicalBlock(scope: !544, file: !451, line: 443, column: 23)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !558, file: !451, line: 489, type: !101)
!558 = distinct !DILexicalBlock(scope: !559, file: !451, line: 489, column: 43)
!559 = distinct !DILexicalBlock(scope: !556, file: !451, line: 489, column: 17)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !558, file: !451, line: 489, type: !101)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !562, file: !451, line: 489, type: !362)
!562 = distinct !DILexicalBlock(scope: !558, file: !451, line: 489, column: 1640)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !562, file: !451, line: 489, type: !51)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !565, file: !451, line: 495, type: !101)
!565 = distinct !DILexicalBlock(scope: !566, file: !451, line: 495, column: 32)
!566 = distinct !DILexicalBlock(scope: !556, file: !451, line: 495, column: 17)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !565, file: !451, line: 495, type: !101)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !569, file: !451, line: 495, type: !362)
!569 = distinct !DILexicalBlock(scope: !565, file: !451, line: 495, column: 1644)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !569, file: !451, line: 495, type: !51)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !572, file: !451, line: 497, type: !101)
!572 = distinct !DILexicalBlock(scope: !573, file: !451, line: 497, column: 39)
!573 = distinct !DILexicalBlock(scope: !566, file: !451, line: 497, column: 24)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !572, file: !451, line: 497, type: !101)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !576, file: !451, line: 497, type: !362)
!576 = distinct !DILexicalBlock(scope: !572, file: !451, line: 497, column: 1636)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !576, file: !451, line: 497, type: !51)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !579, file: !451, line: 521, type: !12)
!579 = distinct !DILexicalBlock(scope: !524, file: !451, line: 521, column: 8)
!580 = !DISubprogram(name: "PyBytes_Size", scope: !451, file: !451, line: 529, type: !185, isLocal: false, isDefinition: true, scopeLine: 530, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyBytes_Size, variables: !581)
!581 = !{!582}
!582 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !580, file: !451, line: 529, type: !12)
!583 = !DISubprogram(name: "PyBytes_AsString", scope: !451, file: !451, line: 540, type: !584, isLocal: false, isDefinition: true, scopeLine: 541, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct._object*)* @PyBytes_AsString, variables: !586)
!584 = !DISubroutineType(types: !585)
!585 = !{!59, !12}
!586 = !{!587}
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !583, file: !451, line: 540, type: !12)
!588 = !DISubprogram(name: "PyBytes_AsStringAndSize", scope: !451, file: !451, line: 551, type: !589, isLocal: false, isDefinition: true, scopeLine: 554, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8**, i64*)* @PyBytes_AsStringAndSize, variables: !592)
!589 = !DISubroutineType(types: !590)
!590 = !{!51, !12, !591, !254}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!592 = !{!593, !594, !595}
!593 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !588, file: !451, line: 551, type: !12)
!594 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 2, scope: !588, file: !451, line: 552, type: !591)
!595 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 3, scope: !588, file: !451, line: 553, type: !254)
!596 = !DISubprogram(name: "PyBytes_Repr", scope: !451, file: !451, line: 593, type: !597, isLocal: false, isDefinition: true, scopeLine: 594, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i32)* @PyBytes_Repr, variables: !599)
!597 = !DISubroutineType(types: !598)
!598 = !{!12, !12, !51}
!599 = !{!600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612}
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !596, file: !451, line: 593, type: !12)
!601 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "smartquotes", arg: 2, scope: !596, file: !451, line: 593, type: !51)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !596, file: !451, line: 595, type: !350)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !596, file: !451, line: 596, type: !18)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !596, file: !451, line: 596, type: !18)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newsize", scope: !596, file: !451, line: 597, type: !101)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "squotes", scope: !596, file: !451, line: 597, type: !101)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dquotes", scope: !596, file: !451, line: 597, type: !101)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !596, file: !451, line: 598, type: !12)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "quote", scope: !596, file: !451, line: 599, type: !359)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !596, file: !451, line: 599, type: !364)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !596, file: !451, line: 599, type: !364)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !613, file: !451, line: 638, type: !359)
!613 = distinct !DILexicalBlock(scope: !614, file: !451, line: 637, column: 34)
!614 = distinct !DILexicalBlock(scope: !615, file: !451, line: 637, column: 5)
!615 = distinct !DILexicalBlock(scope: !596, file: !451, line: 637, column: 5)
!616 = !DISubprogram(name: "_PyBytes_Join", scope: !451, file: !451, line: 1163, type: !133, isLocal: false, isDefinition: true, scopeLine: 1164, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @_PyBytes_Join, variables: !617)
!617 = !{!618, !619}
!618 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sep", arg: 1, scope: !616, file: !451, line: 1163, type: !12)
!619 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !616, file: !451, line: 1163, type: !12)
!620 = !DISubprogram(name: "PyBytes_FromObject", scope: !451, file: !451, line: 2554, type: !123, isLocal: false, isDefinition: true, scopeLine: 2555, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyBytes_FromObject, variables: !621)
!621 = !{!622, !623, !624, !625, !626, !627, !630, !632, !635, !641, !645, !649, !655, !659, !663, !667, !668, !670, !672, !674, !677, !679}
!622 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !620, file: !451, line: 2554, type: !12)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new", scope: !620, file: !451, line: 2556, type: !12)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !620, file: !451, line: 2556, type: !12)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !620, file: !451, line: 2557, type: !18)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !620, file: !451, line: 2557, type: !18)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view", scope: !628, file: !451, line: 2571, type: !243)
!628 = distinct !DILexicalBlock(scope: !629, file: !451, line: 2570, column: 115)
!629 = distinct !DILexicalBlock(scope: !620, file: !451, line: 2570, column: 9)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !631, file: !451, line: 2583, type: !12)
!631 = distinct !DILexicalBlock(scope: !628, file: !451, line: 2583, column: 12)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !633, file: !451, line: 2583, type: !12)
!633 = distinct !DILexicalBlock(scope: !634, file: !451, line: 2583, column: 99)
!634 = distinct !DILexicalBlock(scope: !631, file: !451, line: 2583, column: 65)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !636, file: !451, line: 2598, type: !18)
!636 = distinct !DILexicalBlock(scope: !637, file: !451, line: 2597, column: 62)
!637 = distinct !DILexicalBlock(scope: !638, file: !451, line: 2597, column: 9)
!638 = distinct !DILexicalBlock(scope: !639, file: !451, line: 2597, column: 9)
!639 = distinct !DILexicalBlock(scope: !640, file: !451, line: 2593, column: 56)
!640 = distinct !DILexicalBlock(scope: !620, file: !451, line: 2593, column: 9)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !642, file: !451, line: 2601, type: !12)
!642 = distinct !DILexicalBlock(scope: !643, file: !451, line: 2601, column: 20)
!643 = distinct !DILexicalBlock(scope: !644, file: !451, line: 2600, column: 50)
!644 = distinct !DILexicalBlock(scope: !636, file: !451, line: 2600, column: 17)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !646, file: !451, line: 2607, type: !12)
!646 = distinct !DILexicalBlock(scope: !647, file: !451, line: 2607, column: 20)
!647 = distinct !DILexicalBlock(scope: !648, file: !451, line: 2604, column: 44)
!648 = distinct !DILexicalBlock(scope: !636, file: !451, line: 2604, column: 17)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !650, file: !451, line: 2619, type: !18)
!650 = distinct !DILexicalBlock(scope: !651, file: !451, line: 2618, column: 62)
!651 = distinct !DILexicalBlock(scope: !652, file: !451, line: 2618, column: 9)
!652 = distinct !DILexicalBlock(scope: !653, file: !451, line: 2618, column: 9)
!653 = distinct !DILexicalBlock(scope: !654, file: !451, line: 2614, column: 57)
!654 = distinct !DILexicalBlock(scope: !620, file: !451, line: 2614, column: 9)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !656, file: !451, line: 2622, type: !12)
!656 = distinct !DILexicalBlock(scope: !657, file: !451, line: 2622, column: 20)
!657 = distinct !DILexicalBlock(scope: !658, file: !451, line: 2621, column: 50)
!658 = distinct !DILexicalBlock(scope: !650, file: !451, line: 2621, column: 17)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !660, file: !451, line: 2628, type: !12)
!660 = distinct !DILexicalBlock(scope: !661, file: !451, line: 2628, column: 20)
!661 = distinct !DILexicalBlock(scope: !662, file: !451, line: 2625, column: 44)
!662 = distinct !DILexicalBlock(scope: !650, file: !451, line: 2625, column: 17)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !664, file: !451, line: 2656, type: !12)
!664 = distinct !DILexicalBlock(scope: !665, file: !451, line: 2655, column: 24)
!665 = distinct !DILexicalBlock(scope: !666, file: !451, line: 2655, column: 5)
!666 = distinct !DILexicalBlock(scope: !620, file: !451, line: 2655, column: 5)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !664, file: !451, line: 2657, type: !18)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !669, file: !451, line: 2669, type: !12)
!669 = distinct !DILexicalBlock(scope: !664, file: !451, line: 2669, column: 12)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !671, file: !451, line: 2691, type: !12)
!671 = distinct !DILexicalBlock(scope: !620, file: !451, line: 2691, column: 8)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !673, file: !451, line: 2695, type: !12)
!673 = distinct !DILexicalBlock(scope: !620, file: !451, line: 2695, column: 8)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !675, file: !451, line: 2695, type: !12)
!675 = distinct !DILexicalBlock(scope: !676, file: !451, line: 2695, column: 94)
!676 = distinct !DILexicalBlock(scope: !673, file: !451, line: 2695, column: 60)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !678, file: !451, line: 2696, type: !12)
!678 = distinct !DILexicalBlock(scope: !620, file: !451, line: 2696, column: 8)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !680, file: !451, line: 2696, type: !12)
!680 = distinct !DILexicalBlock(scope: !681, file: !451, line: 2696, column: 95)
!681 = distinct !DILexicalBlock(scope: !678, file: !451, line: 2696, column: 61)
!682 = !DISubprogram(name: "PyBytes_Concat", scope: !451, file: !451, line: 2782, type: !683, isLocal: false, isDefinition: true, scopeLine: 2783, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object**, %struct._object*)* @PyBytes_Concat, variables: !685)
!683 = !DISubroutineType(types: !684)
!684 = !{null, !416, !12}
!685 = !{!686, !687, !688, !689, !693, !697}
!686 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pv", arg: 1, scope: !682, file: !451, line: 2782, type: !416)
!687 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !682, file: !451, line: 2782, type: !12)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !682, file: !451, line: 2784, type: !12)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !690, file: !451, line: 2789, type: !12)
!690 = distinct !DILexicalBlock(scope: !691, file: !451, line: 2789, column: 12)
!691 = distinct !DILexicalBlock(scope: !692, file: !451, line: 2788, column: 26)
!692 = distinct !DILexicalBlock(scope: !682, file: !451, line: 2788, column: 9)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !694, file: !451, line: 2789, type: !12)
!694 = distinct !DILexicalBlock(scope: !695, file: !451, line: 2789, column: 105)
!695 = distinct !DILexicalBlock(scope: !696, file: !451, line: 2789, column: 80)
!696 = distinct !DILexicalBlock(scope: !690, file: !451, line: 2789, column: 57)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !698, file: !451, line: 2793, type: !12)
!698 = distinct !DILexicalBlock(scope: !682, file: !451, line: 2793, column: 8)
!699 = !DISubprogram(name: "PyBytes_ConcatAndDel", scope: !451, file: !451, line: 2798, type: !683, isLocal: false, isDefinition: true, scopeLine: 2799, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object**, %struct._object*)* @PyBytes_ConcatAndDel, variables: !700)
!700 = !{!701, !702, !703, !705}
!701 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pv", arg: 1, scope: !699, file: !451, line: 2798, type: !416)
!702 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !699, file: !451, line: 2798, type: !12)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !704, file: !451, line: 2801, type: !12)
!704 = distinct !DILexicalBlock(scope: !699, file: !451, line: 2801, column: 8)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !706, file: !451, line: 2801, type: !12)
!706 = distinct !DILexicalBlock(scope: !707, file: !451, line: 2801, column: 93)
!707 = distinct !DILexicalBlock(scope: !704, file: !451, line: 2801, column: 59)
!708 = !DISubprogram(name: "_PyBytes_Resize", scope: !451, file: !451, line: 2820, type: !709, isLocal: false, isDefinition: true, scopeLine: 2821, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object**, i64)* @_PyBytes_Resize, variables: !711)
!709 = !DISubroutineType(types: !710)
!710 = !{!51, !416, !18}
!711 = !{!712, !713, !714, !715, !716}
!712 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pv", arg: 1, scope: !708, file: !451, line: 2820, type: !416)
!713 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newsize", arg: 2, scope: !708, file: !451, line: 2820, type: !18)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !708, file: !451, line: 2822, type: !12)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sv", scope: !708, file: !451, line: 2823, type: !350)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !717, file: !451, line: 2827, type: !12)
!717 = distinct !DILexicalBlock(scope: !718, file: !451, line: 2827, column: 12)
!718 = distinct !DILexicalBlock(scope: !719, file: !451, line: 2825, column: 129)
!719 = distinct !DILexicalBlock(scope: !708, file: !451, line: 2825, column: 9)
!720 = !DISubprogram(name: "PyBytes_Fini", scope: !451, file: !451, line: 2850, type: !721, isLocal: false, isDefinition: true, scopeLine: 2851, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyBytes_Fini, variables: !723)
!721 = !DISubroutineType(types: !722)
!722 = !{null}
!723 = !{!724, !725, !729, !733, !735}
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !720, file: !451, line: 2852, type: !51)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !726, file: !451, line: 2854, type: !12)
!726 = distinct !DILexicalBlock(scope: !727, file: !451, line: 2854, column: 12)
!727 = distinct !DILexicalBlock(scope: !728, file: !451, line: 2853, column: 5)
!728 = distinct !DILexicalBlock(scope: !720, file: !451, line: 2853, column: 5)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !730, file: !451, line: 2854, type: !12)
!730 = distinct !DILexicalBlock(scope: !731, file: !451, line: 2854, column: 125)
!731 = distinct !DILexicalBlock(scope: !732, file: !451, line: 2854, column: 90)
!732 = distinct !DILexicalBlock(scope: !726, file: !451, line: 2854, column: 67)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !734, file: !451, line: 2855, type: !12)
!734 = distinct !DILexicalBlock(scope: !720, file: !451, line: 2855, column: 8)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !736, file: !451, line: 2855, type: !12)
!736 = distinct !DILexicalBlock(scope: !737, file: !451, line: 2855, column: 115)
!737 = distinct !DILexicalBlock(scope: !738, file: !451, line: 2855, column: 83)
!738 = distinct !DILexicalBlock(scope: !734, file: !451, line: 2855, column: 60)
!739 = !DISubprogram(name: "bytes_join", scope: !451, file: !451, line: 1157, type: !133, isLocal: true, isDefinition: true, scopeLine: 1158, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @bytes_join, variables: !740)
!740 = !{!741, !742}
!741 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !739, file: !451, line: 1157, type: !12)
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iterable", arg: 2, scope: !739, file: !451, line: 1157, type: !12)
!743 = !DISubprogram(name: "stringlib_bytes_join", scope: !744, file: !744, line: 8, type: !133, isLocal: true, isDefinition: true, scopeLine: 9, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @stringlib_bytes_join, variables: !745)
!744 = !DIFile(filename: "Objects/stringlib/join.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!745 = !{!746, !747, !748, !749, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !764, !768, !774, !780, !784, !790, !791, !795, !796}
!746 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sep", arg: 1, scope: !743, file: !744, line: 8, type: !12)
!747 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "iterable", arg: 2, scope: !743, file: !744, line: 8, type: !12)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sepstr", scope: !743, file: !744, line: 10, type: !59)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seplen", scope: !743, file: !744, line: 11, type: !750)
!750 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !743, file: !744, line: 12, type: !12)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !743, file: !744, line: 13, type: !59)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seqlen", scope: !743, file: !744, line: 14, type: !18)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sz", scope: !743, file: !744, line: 15, type: !18)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !743, file: !744, line: 16, type: !18)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbufs", scope: !743, file: !744, line: 16, type: !18)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "seq", scope: !743, file: !744, line: 17, type: !12)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !743, file: !744, line: 17, type: !12)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffers", scope: !743, file: !744, line: 18, type: !242)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "static_buffers", scope: !743, file: !744, line: 20, type: !761)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 6400, align: 64, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 10)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !765, file: !744, line: 29, type: !12)
!765 = distinct !DILexicalBlock(scope: !766, file: !744, line: 29, column: 12)
!766 = distinct !DILexicalBlock(scope: !767, file: !744, line: 28, column: 22)
!767 = distinct !DILexicalBlock(scope: !743, file: !744, line: 28, column: 9)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !769, file: !744, line: 37, type: !12)
!769 = distinct !DILexicalBlock(scope: !770, file: !744, line: 37, column: 16)
!770 = distinct !DILexicalBlock(scope: !771, file: !744, line: 35, column: 64)
!771 = distinct !DILexicalBlock(scope: !772, file: !744, line: 35, column: 13)
!772 = distinct !DILexicalBlock(scope: !773, file: !744, line: 33, column: 22)
!773 = distinct !DILexicalBlock(scope: !743, file: !744, line: 33, column: 9)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !775, file: !744, line: 45, type: !12)
!775 = distinct !DILexicalBlock(scope: !776, file: !744, line: 45, column: 16)
!776 = distinct !DILexicalBlock(scope: !777, file: !744, line: 44, column: 36)
!777 = distinct !DILexicalBlock(scope: !778, file: !744, line: 44, column: 13)
!778 = distinct !DILexicalBlock(scope: !779, file: !744, line: 42, column: 22)
!779 = distinct !DILexicalBlock(scope: !743, file: !744, line: 42, column: 9)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "itemlen", scope: !781, file: !744, line: 59, type: !18)
!781 = distinct !DILexicalBlock(scope: !782, file: !744, line: 58, column: 45)
!782 = distinct !DILexicalBlock(scope: !783, file: !744, line: 58, column: 5)
!783 = distinct !DILexicalBlock(scope: !743, file: !744, line: 58, column: 5)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !785, file: !744, line: 101, type: !18)
!785 = distinct !DILexicalBlock(scope: !786, file: !744, line: 100, column: 37)
!786 = distinct !DILexicalBlock(scope: !787, file: !744, line: 100, column: 9)
!787 = distinct !DILexicalBlock(scope: !788, file: !744, line: 100, column: 9)
!788 = distinct !DILexicalBlock(scope: !789, file: !744, line: 98, column: 18)
!789 = distinct !DILexicalBlock(scope: !743, file: !744, line: 98, column: 9)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !785, file: !744, line: 102, type: !59)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !792, file: !744, line: 109, type: !18)
!792 = distinct !DILexicalBlock(scope: !793, file: !744, line: 108, column: 33)
!793 = distinct !DILexicalBlock(scope: !794, file: !744, line: 108, column: 5)
!794 = distinct !DILexicalBlock(scope: !743, file: !744, line: 108, column: 5)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !792, file: !744, line: 110, type: !59)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !797, file: !744, line: 125, type: !12)
!797 = distinct !DILexicalBlock(scope: !743, file: !744, line: 125, column: 8)
!798 = !DISubprogram(name: "_getbuffer", scope: !451, file: !451, line: 11, type: !799, isLocal: true, isDefinition: true, scopeLine: 12, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*, %struct.bufferinfo*)* @_getbuffer, variables: !801)
!799 = !DISubroutineType(types: !800)
!800 = !{!18, !12, !242}
!801 = !{!802, !803, !804}
!802 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !798, file: !451, line: 11, type: !12)
!803 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 2, scope: !798, file: !451, line: 11, type: !242)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bufferprocs", scope: !798, file: !451, line: 13, type: !233)
!805 = !DISubprogram(name: "bytes_dealloc", scope: !451, file: !451, line: 378, type: !44, isLocal: true, isDefinition: true, scopeLine: 379, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @bytes_dealloc, variables: !806)
!806 = !{!807}
!807 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !805, file: !451, line: 378, type: !12)
!808 = !DISubprogram(name: "bytes_repr", scope: !451, file: !451, line: 662, type: !123, isLocal: true, isDefinition: true, scopeLine: 663, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @bytes_repr, variables: !809)
!809 = !{!810}
!810 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !808, file: !451, line: 662, type: !12)
!811 = !DISubprogram(name: "bytes_length", scope: !451, file: !451, line: 679, type: !812, isLocal: true, isDefinition: true, scopeLine: 680, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.PyBytesObject*)* @bytes_length, variables: !814)
!812 = !DISubroutineType(types: !813)
!813 = !{!18, !350}
!814 = !{!815}
!815 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !811, file: !451, line: 679, type: !350)
!816 = !DISubprogram(name: "bytes_repeat", scope: !451, file: !451, line: 734, type: !817, isLocal: true, isDefinition: true, scopeLine: 735, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyBytesObject*, i64)* @bytes_repeat, variables: !819)
!817 = !DISubroutineType(types: !818)
!818 = !{!12, !350, !18}
!819 = !{!820, !821, !822, !823, !824, !825, !826}
!820 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !816, file: !451, line: 734, type: !350)
!821 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !816, file: !451, line: 734, type: !18)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !816, file: !451, line: 736, type: !18)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !816, file: !451, line: 737, type: !18)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !816, file: !451, line: 738, type: !18)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !816, file: !451, line: 739, type: !350)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes", scope: !816, file: !451, line: 740, type: !101)
!827 = !DISubprogram(name: "bytes_item", scope: !451, file: !451, line: 809, type: !817, isLocal: true, isDefinition: true, scopeLine: 810, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyBytesObject*, i64)* @bytes_item, variables: !828)
!828 = !{!829, !830}
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !827, file: !451, line: 809, type: !350)
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !827, file: !451, line: 809, type: !18)
!831 = !DISubprogram(name: "bytes_contains", scope: !451, file: !451, line: 786, type: !204, isLocal: true, isDefinition: true, scopeLine: 787, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*)* @bytes_contains, variables: !832)
!832 = !{!833, !834, !835, !836, !839}
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !831, file: !451, line: 786, type: !12)
!834 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !831, file: !451, line: 786, type: !12)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ival", scope: !831, file: !451, line: 788, type: !18)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "varg", scope: !837, file: !451, line: 790, type: !243)
!837 = distinct !DILexicalBlock(scope: !838, file: !451, line: 789, column: 41)
!838 = distinct !DILexicalBlock(scope: !831, file: !451, line: 789, column: 9)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !837, file: !451, line: 791, type: !18)
!840 = !DISubprogram(name: "stringlib_find", scope: !841, file: !841, line: 8, type: !842, isLocal: true, isDefinition: true, scopeLine: 11, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8*, i64, i8*, i64, i64)* @stringlib_find, variables: !844)
!841 = !DIFile(filename: "Objects/stringlib/find.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!842 = !DISubroutineType(types: !843)
!843 = !{!18, !36, !18, !36, !18, !18}
!844 = !{!845, !846, !847, !848, !849, !850}
!845 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !840, file: !841, line: 8, type: !36)
!846 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str_len", arg: 2, scope: !840, file: !841, line: 8, type: !18)
!847 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sub", arg: 3, scope: !840, file: !841, line: 9, type: !36)
!848 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sub_len", arg: 4, scope: !840, file: !841, line: 9, type: !18)
!849 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "offset", arg: 5, scope: !840, file: !841, line: 10, type: !18)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !840, file: !841, line: 12, type: !18)
!851 = !DISubprogram(name: "fastsearch", scope: !852, file: !852, line: 84, type: !853, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8*, i64, i8*, i64, i64, i32)* @fastsearch, variables: !855)
!852 = !DIFile(filename: "Objects/stringlib/fastsearch.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!853 = !DISubroutineType(types: !854)
!854 = !{!18, !36, !18, !36, !18, !18, !51}
!855 = !{!856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !874, !877}
!856 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !851, file: !852, line: 84, type: !36)
!857 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !851, file: !852, line: 84, type: !18)
!858 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 3, scope: !851, file: !852, line: 85, type: !36)
!859 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 4, scope: !851, file: !852, line: 85, type: !18)
!860 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxcount", arg: 5, scope: !851, file: !852, line: 86, type: !18)
!861 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 6, scope: !851, file: !852, line: 86, type: !51)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mask", scope: !851, file: !852, line: 88, type: !103)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "skip", scope: !851, file: !852, line: 89, type: !18)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !851, file: !852, line: 89, type: !18)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !851, file: !852, line: 90, type: !18)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !851, file: !852, line: 90, type: !18)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mlast", scope: !851, file: !852, line: 90, type: !18)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !851, file: !852, line: 90, type: !18)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "needle", scope: !870, file: !852, line: 109, type: !359)
!870 = distinct !DILexicalBlock(scope: !871, file: !852, line: 106, column: 24)
!871 = distinct !DILexicalBlock(scope: !872, file: !852, line: 102, column: 13)
!872 = distinct !DILexicalBlock(scope: !873, file: !852, line: 98, column: 17)
!873 = distinct !DILexicalBlock(scope: !851, file: !852, line: 98, column: 9)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ss", scope: !875, file: !852, line: 145, type: !36)
!875 = distinct !DILexicalBlock(scope: !876, file: !852, line: 144, column: 20)
!876 = distinct !DILexicalBlock(scope: !851, file: !852, line: 144, column: 9)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pp", scope: !875, file: !852, line: 146, type: !36)
!878 = !DISubprogram(name: "stringlib_fastsearch_memchr_1char", scope: !852, file: !852, line: 37, type: !879, isLocal: true, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8*, i64, i8, i8, i64, i32)* @stringlib_fastsearch_memchr_1char, variables: !881)
!879 = !DISubroutineType(types: !880)
!880 = !{!18, !36, !18, !38, !359, !18, !51}
!881 = !{!882, !883, !884, !885, !886, !887, !888, !891, !892, !894, !898}
!882 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !878, file: !852, line: 37, type: !36)
!883 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !878, file: !852, line: 37, type: !18)
!884 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ch", arg: 3, scope: !878, file: !852, line: 38, type: !38)
!885 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "needle", arg: 4, scope: !878, file: !852, line: 38, type: !359)
!886 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "maxcount", arg: 5, scope: !878, file: !852, line: 39, type: !18)
!887 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 6, scope: !878, file: !852, line: 39, type: !51)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !889, file: !852, line: 42, type: !36)
!889 = distinct !DILexicalBlock(scope: !890, file: !852, line: 41, column: 20)
!890 = distinct !DILexicalBlock(scope: !878, file: !852, line: 41, column: 9)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !889, file: !852, line: 43, type: !36)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "candidate", scope: !893, file: !852, line: 45, type: !11)
!893 = distinct !DILexicalBlock(scope: !889, file: !852, line: 44, column: 25)
!894 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "found", scope: !895, file: !852, line: 62, type: !36)
!895 = distinct !DILexicalBlock(scope: !896, file: !852, line: 61, column: 23)
!896 = distinct !DILexicalBlock(scope: !897, file: !852, line: 60, column: 25)
!897 = distinct !DILexicalBlock(scope: !890, file: !852, line: 60, column: 14)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "candidate", scope: !895, file: !852, line: 63, type: !11)
!899 = !DISubprogram(name: "bytes_subscript", scope: !451, file: !451, line: 919, type: !900, isLocal: true, isDefinition: true, scopeLine: 920, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyBytesObject*, %struct._object*)* @bytes_subscript, variables: !902)
!900 = !DISubroutineType(types: !901)
!901 = !{!12, !350, !12}
!902 = !{!903, !904, !905, !908, !911, !912, !913, !914, !915, !916, !917, !918}
!903 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !899, file: !451, line: 919, type: !350)
!904 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "item", arg: 2, scope: !899, file: !451, line: 919, type: !12)
!905 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !906, file: !451, line: 922, type: !18)
!906 = distinct !DILexicalBlock(scope: !907, file: !451, line: 921, column: 113)
!907 = distinct !DILexicalBlock(scope: !899, file: !451, line: 921, column: 9)
!908 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !909, file: !451, line: 935, type: !18)
!909 = distinct !DILexicalBlock(scope: !910, file: !451, line: 934, column: 65)
!910 = distinct !DILexicalBlock(scope: !907, file: !451, line: 934, column: 14)
!911 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stop", scope: !909, file: !451, line: 935, type: !18)
!912 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "step", scope: !909, file: !451, line: 935, type: !18)
!913 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slicelength", scope: !909, file: !451, line: 935, type: !18)
!914 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur", scope: !909, file: !451, line: 935, type: !18)
!915 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !909, file: !451, line: 935, type: !18)
!916 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "source_buf", scope: !909, file: !451, line: 936, type: !59)
!917 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result_buf", scope: !909, file: !451, line: 937, type: !59)
!918 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !909, file: !451, line: 938, type: !12)
!919 = !DISubprogram(name: "bytes_hash", scope: !451, file: !451, line: 909, type: !920, isLocal: true, isDefinition: true, scopeLine: 910, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.PyBytesObject*)* @bytes_hash, variables: !922)
!920 = !DISubroutineType(types: !921)
!921 = !{!225, !350}
!922 = !{!923}
!923 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !919, file: !451, line: 909, type: !350)
!924 = !DISubprogram(name: "bytes_str", scope: !451, file: !451, line: 668, type: !123, isLocal: true, isDefinition: true, scopeLine: 669, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @bytes_str, variables: !925)
!925 = !{!926}
!926 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !924, file: !451, line: 668, type: !12)
!927 = !DISubprogram(name: "bytes_buffer_getbuffer", scope: !451, file: !451, line: 984, type: !928, isLocal: true, isDefinition: true, scopeLine: 985, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyBytesObject*, %struct.bufferinfo*, i32)* @bytes_buffer_getbuffer, variables: !930)
!928 = !DISubroutineType(types: !929)
!929 = !{!51, !350, !242, !51}
!930 = !{!931, !932, !933}
!931 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !927, file: !451, line: 984, type: !350)
!932 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "view", arg: 2, scope: !927, file: !451, line: 984, type: !242)
!933 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 3, scope: !927, file: !451, line: 984, type: !51)
!934 = !DISubprogram(name: "bytes_richcompare", scope: !451, file: !451, line: 836, type: !935, isLocal: true, isDefinition: true, scopeLine: 837, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyBytesObject*, %struct.PyBytesObject*, i32)* @bytes_richcompare, variables: !937)
!935 = !DISubroutineType(types: !936)
!936 = !{!12, !350, !350, !51}
!937 = !{!938, !939, !940, !941, !942, !943, !944, !945, !946}
!938 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !934, file: !451, line: 836, type: !350)
!939 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !934, file: !451, line: 836, type: !350)
!940 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !934, file: !451, line: 836, type: !51)
