; ModuleID = 'irs-onlybc/callbacks.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !22, subprograms: !459, globals: !819)
!1 = !DIFile(filename: "callbacks.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !11, !17}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ffi_abi", file: !4, line: 75, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "build/temp.linux-x86_64-3.4/libffi/include/ffitarget.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "FFI_FIRST_ABI", value: 0)
!7 = !DIEnumerator(name: "FFI_SYSV", value: 1)
!8 = !DIEnumerator(name: "FFI_UNIX64", value: 2)
!9 = !DIEnumerator(name: "FFI_LAST_ABI", value: 3)
!10 = !DIEnumerator(name: "FFI_DEFAULT_ABI", value: 2)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 204, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "build/temp.linux-x86_64-3.4/libffi/include/ffi.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "FFI_OK", value: 0)
!15 = !DIEnumerator(name: "FFI_BAD_TYPEDEF", value: 1)
!16 = !DIEnumerator(name: "FFI_BAD_ABI", value: 2)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !18, line: 190, size: 32, align: 32, elements: !19)
!18 = !DIFile(filename: "./Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!19 = !{!20, !21}
!20 = !DIEnumerator(name: "PyGILState_LOCKED", value: 0)
!21 = !DIEnumerator(name: "PyGILState_UNLOCKED", value: 1)
!22 = !{!23, !108, !62, !362, !420, !428}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !25, line: 109, baseType: !26)
!25 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !25, line: 105, size: 128, align: 64, elements: !27)
!27 = !{!28, !36}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !26, file: !25, line: 107, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !30, line: 177, baseType: !31)
!30 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !32, line: 102, baseType: !33)
!32 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !34, line: 181, baseType: !35)
!34 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!35 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !26, file: !25, line: 108, baseType: !37, size: 64, align: 64, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !25, line: 334, size: 3200, align: 64, elements: !39)
!39 = !{!40, !46, !50, !51, !52, !57, !121, !126, !131, !132, !137, !189, !220, !232, !238, !239, !240, !242, !244, !275, !276, !277, !286, !287, !292, !293, !295, !297, !307, !310, !328, !329, !330, !332, !334, !335, !337, !342, !347, !352, !353, !354, !355, !356, !357, !358, !359, !361}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !38, file: !25, line: 335, baseType: !41, size: 192, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !25, line: 114, baseType: !42)
!42 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 111, size: 192, align: 64, elements: !43)
!43 = !{!44, !45}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !42, file: !25, line: 112, baseType: !24, size: 128, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !42, file: !25, line: 113, baseType: !29, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !38, file: !25, line: 336, baseType: !47, size: 64, align: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!49 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !38, file: !25, line: 337, baseType: !29, size: 64, align: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !38, file: !25, line: 337, baseType: !29, size: 64, align: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !38, file: !25, line: 341, baseType: !53, size: 64, align: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !25, line: 308, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !23}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !38, file: !25, line: 342, baseType: !58, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !25, line: 314, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !23, !63, !62}
!62 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !32, line: 48, baseType: !65)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !66, line: 246, size: 1728, align: 64, elements: !67)
!66 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!67 = !{!68, !69, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !89, !90, !91, !92, !94, !96, !98, !102, !105, !107, !109, !110, !111, !112, !116, !117}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !65, file: !66, line: 247, baseType: !62, size: 32, align: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !65, file: !66, line: 252, baseType: !70, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !65, file: !66, line: 253, baseType: !70, size: 64, align: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !65, file: !66, line: 254, baseType: !70, size: 64, align: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !65, file: !66, line: 255, baseType: !70, size: 64, align: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !65, file: !66, line: 256, baseType: !70, size: 64, align: 64, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !65, file: !66, line: 257, baseType: !70, size: 64, align: 64, offset: 384)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !65, file: !66, line: 258, baseType: !70, size: 64, align: 64, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !65, file: !66, line: 259, baseType: !70, size: 64, align: 64, offset: 512)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !65, file: !66, line: 261, baseType: !70, size: 64, align: 64, offset: 576)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !65, file: !66, line: 262, baseType: !70, size: 64, align: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !65, file: !66, line: 263, baseType: !70, size: 64, align: 64, offset: 704)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !65, file: !66, line: 265, baseType: !82, size: 64, align: 64, offset: 768)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !66, line: 161, size: 192, align: 64, elements: !84)
!84 = !{!85, !86, !88}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !83, file: !66, line: 162, baseType: !82, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !83, file: !66, line: 163, baseType: !87, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !83, file: !66, line: 167, baseType: !62, size: 32, align: 32, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !65, file: !66, line: 267, baseType: !87, size: 64, align: 64, offset: 832)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !65, file: !66, line: 269, baseType: !62, size: 32, align: 32, offset: 896)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !65, file: !66, line: 273, baseType: !62, size: 32, align: 32, offset: 928)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !65, file: !66, line: 275, baseType: !93, size: 64, align: 64, offset: 960)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !34, line: 140, baseType: !35)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !65, file: !66, line: 279, baseType: !95, size: 16, align: 16, offset: 1024)
!95 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !65, file: !66, line: 280, baseType: !97, size: 8, align: 8, offset: 1040)
!97 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !65, file: !66, line: 281, baseType: !99, size: 8, align: 8, offset: 1048)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 8, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 1)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !65, file: !66, line: 285, baseType: !103, size: 64, align: 64, offset: 1088)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !66, line: 155, baseType: null)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !65, file: !66, line: 294, baseType: !106, size: 64, align: 64, offset: 1152)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !34, line: 141, baseType: !35)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !65, file: !66, line: 303, baseType: !108, size: 64, align: 64, offset: 1216)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !65, file: !66, line: 304, baseType: !108, size: 64, align: 64, offset: 1280)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !65, file: !66, line: 305, baseType: !108, size: 64, align: 64, offset: 1344)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !65, file: !66, line: 306, baseType: !108, size: 64, align: 64, offset: 1408)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !65, file: !66, line: 307, baseType: !113, size: 64, align: 64, offset: 1472)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !114, line: 62, baseType: !115)
!114 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!115 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !65, file: !66, line: 309, baseType: !62, size: 32, align: 32, offset: 1536)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !65, file: !66, line: 311, baseType: !118, size: 160, align: 8, offset: 1568)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 160, align: 8, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 20)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !38, file: !25, line: 343, baseType: !122, size: 64, align: 64, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !25, line: 316, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!23, !23, !70}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !38, file: !25, line: 344, baseType: !127, size: 64, align: 64, offset: 576)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !25, line: 318, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!62, !23, !70, !23}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !38, file: !25, line: 345, baseType: !108, size: 64, align: 64, offset: 640)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !38, file: !25, line: 346, baseType: !133, size: 64, align: 64, offset: 704)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !25, line: 320, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!23, !23}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !38, file: !25, line: 350, baseType: !138, size: 64, align: 64, offset: 768)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !25, line: 278, baseType: !140)
!140 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 236, size: 2176, align: 64, elements: !141)
!141 = !{!142, !147, !148, !149, !150, !151, !156, !158, !159, !160, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !140, file: !25, line: 241, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !25, line: 166, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!23, !23, !23}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !140, file: !25, line: 242, baseType: !143, size: 64, align: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !140, file: !25, line: 243, baseType: !143, size: 64, align: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !140, file: !25, line: 244, baseType: !143, size: 64, align: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !140, file: !25, line: 245, baseType: !143, size: 64, align: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !140, file: !25, line: 246, baseType: !152, size: 64, align: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !25, line: 167, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!23, !23, !23, !23}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !140, file: !25, line: 247, baseType: !157, size: 64, align: 64, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !25, line: 165, baseType: !134)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !140, file: !25, line: 248, baseType: !157, size: 64, align: 64, offset: 448)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !140, file: !25, line: 249, baseType: !157, size: 64, align: 64, offset: 512)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !140, file: !25, line: 250, baseType: !161, size: 64, align: 64, offset: 576)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !25, line: 168, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!62, !23}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !140, file: !25, line: 251, baseType: !157, size: 64, align: 64, offset: 640)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !140, file: !25, line: 252, baseType: !143, size: 64, align: 64, offset: 704)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !140, file: !25, line: 253, baseType: !143, size: 64, align: 64, offset: 768)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !140, file: !25, line: 254, baseType: !143, size: 64, align: 64, offset: 832)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !140, file: !25, line: 255, baseType: !143, size: 64, align: 64, offset: 896)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !140, file: !25, line: 256, baseType: !143, size: 64, align: 64, offset: 960)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !140, file: !25, line: 257, baseType: !157, size: 64, align: 64, offset: 1024)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !140, file: !25, line: 258, baseType: !108, size: 64, align: 64, offset: 1088)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !140, file: !25, line: 259, baseType: !157, size: 64, align: 64, offset: 1152)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !140, file: !25, line: 261, baseType: !143, size: 64, align: 64, offset: 1216)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !140, file: !25, line: 262, baseType: !143, size: 64, align: 64, offset: 1280)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !140, file: !25, line: 263, baseType: !143, size: 64, align: 64, offset: 1344)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !140, file: !25, line: 264, baseType: !143, size: 64, align: 64, offset: 1408)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !140, file: !25, line: 265, baseType: !152, size: 64, align: 64, offset: 1472)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !140, file: !25, line: 266, baseType: !143, size: 64, align: 64, offset: 1536)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !140, file: !25, line: 267, baseType: !143, size: 64, align: 64, offset: 1600)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !140, file: !25, line: 268, baseType: !143, size: 64, align: 64, offset: 1664)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !140, file: !25, line: 269, baseType: !143, size: 64, align: 64, offset: 1728)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !140, file: !25, line: 270, baseType: !143, size: 64, align: 64, offset: 1792)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !140, file: !25, line: 272, baseType: !143, size: 64, align: 64, offset: 1856)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !140, file: !25, line: 273, baseType: !143, size: 64, align: 64, offset: 1920)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !140, file: !25, line: 274, baseType: !143, size: 64, align: 64, offset: 1984)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !140, file: !25, line: 275, baseType: !143, size: 64, align: 64, offset: 2048)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !140, file: !25, line: 277, baseType: !157, size: 64, align: 64, offset: 2112)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !38, file: !25, line: 351, baseType: !190, size: 64, align: 64, offset: 832)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !25, line: 292, baseType: !192)
!192 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 280, size: 640, align: 64, elements: !193)
!193 = !{!194, !199, !200, !205, !206, !207, !212, !213, !218, !219}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !192, file: !25, line: 281, baseType: !195, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !25, line: 169, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!29, !23}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !192, file: !25, line: 282, baseType: !143, size: 64, align: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !192, file: !25, line: 283, baseType: !201, size: 64, align: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !25, line: 170, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!23, !23, !29}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !192, file: !25, line: 284, baseType: !201, size: 64, align: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !192, file: !25, line: 285, baseType: !108, size: 64, align: 64, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !192, file: !25, line: 286, baseType: !208, size: 64, align: 64, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !25, line: 172, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!62, !23, !29, !23}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !192, file: !25, line: 287, baseType: !108, size: 64, align: 64, offset: 384)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !192, file: !25, line: 288, baseType: !214, size: 64, align: 64, offset: 448)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !25, line: 231, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!62, !23, !23}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !192, file: !25, line: 290, baseType: !143, size: 64, align: 64, offset: 512)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !192, file: !25, line: 291, baseType: !201, size: 64, align: 64, offset: 576)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !38, file: !25, line: 352, baseType: !221, size: 64, align: 64, offset: 896)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !25, line: 298, baseType: !223)
!223 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 294, size: 192, align: 64, elements: !224)
!224 = !{!225, !226, !227}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !223, file: !25, line: 295, baseType: !195, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !223, file: !25, line: 296, baseType: !143, size: 64, align: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !223, file: !25, line: 297, baseType: !228, size: 64, align: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !25, line: 174, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!62, !23, !23, !23}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !38, file: !25, line: 356, baseType: !233, size: 64, align: 64, offset: 960)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !25, line: 321, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!237, !23}
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !30, line: 186, baseType: !29)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !38, file: !25, line: 357, baseType: !152, size: 64, align: 64, offset: 1024)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !38, file: !25, line: 358, baseType: !133, size: 64, align: 64, offset: 1088)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !38, file: !25, line: 359, baseType: !241, size: 64, align: 64, offset: 1152)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !25, line: 317, baseType: !144)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !38, file: !25, line: 360, baseType: !243, size: 64, align: 64, offset: 1216)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !25, line: 319, baseType: !229)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !38, file: !25, line: 363, baseType: !245, size: 64, align: 64, offset: 1280)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !25, line: 304, baseType: !247)
!247 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 301, size: 128, align: 64, elements: !248)
!248 = !{!249, !270}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !247, file: !25, line: 302, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !25, line: 193, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!62, !23, !254, !62}
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !25, line: 191, baseType: !256)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !25, line: 178, size: 640, align: 64, elements: !257)
!257 = !{!258, !259, !260, !261, !262, !263, !264, !265, !267, !268, !269}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !256, file: !25, line: 179, baseType: !108, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !256, file: !25, line: 180, baseType: !23, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !256, file: !25, line: 181, baseType: !29, size: 64, align: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !256, file: !25, line: 182, baseType: !29, size: 64, align: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !256, file: !25, line: 184, baseType: !62, size: 32, align: 32, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !256, file: !25, line: 185, baseType: !62, size: 32, align: 32, offset: 288)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !256, file: !25, line: 186, baseType: !70, size: 64, align: 64, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !256, file: !25, line: 187, baseType: !266, size: 64, align: 64, offset: 384)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !256, file: !25, line: 188, baseType: !266, size: 64, align: 64, offset: 448)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !256, file: !25, line: 189, baseType: !266, size: 64, align: 64, offset: 512)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !256, file: !25, line: 190, baseType: !108, size: 64, align: 64, offset: 576)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !247, file: !25, line: 303, baseType: !271, size: 64, align: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !25, line: 194, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{null, !23, !254}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !38, file: !25, line: 366, baseType: !115, size: 64, align: 64, offset: 1344)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !38, file: !25, line: 368, baseType: !47, size: 64, align: 64, offset: 1408)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !38, file: !25, line: 372, baseType: !278, size: 64, align: 64, offset: 1472)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !25, line: 233, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!62, !23, !282, !108}
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !25, line: 232, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!62, !23, !108}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !38, file: !25, line: 375, baseType: !161, size: 64, align: 64, offset: 1536)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !38, file: !25, line: 379, baseType: !288, size: 64, align: 64, offset: 1600)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !25, line: 322, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!23, !23, !23, !62}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !38, file: !25, line: 382, baseType: !29, size: 64, align: 64, offset: 1664)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !38, file: !25, line: 385, baseType: !294, size: 64, align: 64, offset: 1728)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !25, line: 323, baseType: !134)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !38, file: !25, line: 386, baseType: !296, size: 64, align: 64, offset: 1792)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !25, line: 324, baseType: !134)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !38, file: !25, line: 389, baseType: !298, size: 64, align: 64, offset: 1856)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !300, line: 40, size: 256, align: 64, elements: !301)
!300 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!301 = !{!302, !303, !305, !306}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !299, file: !300, line: 41, baseType: !47, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !299, file: !300, line: 42, baseType: !304, size: 64, align: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !300, line: 18, baseType: !144)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !299, file: !300, line: 43, baseType: !62, size: 32, align: 32, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !299, file: !300, line: 45, baseType: !47, size: 64, align: 64, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !38, file: !25, line: 390, baseType: !308, size: 64, align: 64, offset: 1920)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !25, line: 390, flags: DIFlagFwdDecl)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !38, file: !25, line: 391, baseType: !311, size: 64, align: 64, offset: 1984)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !313, line: 11, size: 320, align: 64, elements: !314)
!313 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!314 = !{!315, !316, !321, !326, !327}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !312, file: !313, line: 12, baseType: !70, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !312, file: !313, line: 13, baseType: !317, size: 64, align: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !313, line: 8, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!23, !23, !108}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !312, file: !313, line: 14, baseType: !322, size: 64, align: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !313, line: 9, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!62, !23, !23, !108}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !312, file: !313, line: 15, baseType: !70, size: 64, align: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !312, file: !313, line: 16, baseType: !108, size: 64, align: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !38, file: !25, line: 392, baseType: !37, size: 64, align: 64, offset: 2048)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !38, file: !25, line: 393, baseType: !23, size: 64, align: 64, offset: 2112)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !38, file: !25, line: 394, baseType: !331, size: 64, align: 64, offset: 2176)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !25, line: 325, baseType: !153)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !38, file: !25, line: 395, baseType: !333, size: 64, align: 64, offset: 2240)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !25, line: 326, baseType: !229)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !38, file: !25, line: 396, baseType: !29, size: 64, align: 64, offset: 2304)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !38, file: !25, line: 397, baseType: !336, size: 64, align: 64, offset: 2368)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !25, line: 327, baseType: !229)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !38, file: !25, line: 398, baseType: !338, size: 64, align: 64, offset: 2432)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !25, line: 329, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!23, !37, !29}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !38, file: !25, line: 399, baseType: !343, size: 64, align: 64, offset: 2496)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !25, line: 328, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!23, !37, !23, !23}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !38, file: !25, line: 400, baseType: !348, size: 64, align: 64, offset: 2560)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !25, line: 307, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !108}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !38, file: !25, line: 401, baseType: !161, size: 64, align: 64, offset: 2624)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !38, file: !25, line: 402, baseType: !23, size: 64, align: 64, offset: 2688)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !38, file: !25, line: 403, baseType: !23, size: 64, align: 64, offset: 2752)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !38, file: !25, line: 404, baseType: !23, size: 64, align: 64, offset: 2816)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !38, file: !25, line: 405, baseType: !23, size: 64, align: 64, offset: 2880)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !38, file: !25, line: 406, baseType: !23, size: 64, align: 64, offset: 2944)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !38, file: !25, line: 407, baseType: !53, size: 64, align: 64, offset: 3008)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !38, file: !25, line: 410, baseType: !360, size: 32, align: 32, offset: 3072)
!360 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !38, file: !25, line: 412, baseType: !53, size: 64, align: 64, offset: 3136)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "CThunkObject", file: !364, line: 71, baseType: !365)
!364 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_ctypes/ctypes.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!365 = !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 59, size: 1024, align: 64, elements: !366)
!366 = !{!367, !368, !406, !407, !408, !409, !410, !411, !412, !417, !418}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !365, file: !364, line: 60, baseType: !41, size: 192, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pcl_write", scope: !365, file: !364, line: 61, baseType: !369, size: 64, align: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "ffi_closure", file: !12, line: 310, baseType: !371)
!371 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 299, size: 384, align: 64, elements: !372)
!372 = !{!373, !377, !400, !405}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tramp", scope: !371, file: !12, line: 304, baseType: !374, size: 192, align: 8)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 192, align: 8, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 24)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "cif", scope: !371, file: !12, line: 306, baseType: !378, size: 64, align: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "ffi_cif", file: !12, line: 222, baseType: !380)
!380 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 212, size: 256, align: 64, elements: !381)
!381 = !{!382, !384, !385, !397, !398, !399}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "abi", scope: !380, file: !12, line: 213, baseType: !383, size: 32, align: 32)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "ffi_abi", file: !4, line: 108, baseType: !3)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !380, file: !12, line: 214, baseType: !360, size: 32, align: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !380, file: !12, line: 215, baseType: !386, size: 64, align: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "ffi_type", file: !12, line: 118, baseType: !389)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ffi_type", file: !12, line: 112, size: 192, align: 64, elements: !390)
!390 = !{!391, !392, !393, !394}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !389, file: !12, line: 114, baseType: !113, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !389, file: !12, line: 115, baseType: !95, size: 16, align: 16, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !389, file: !12, line: 116, baseType: !95, size: 16, align: 16, offset: 80)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !389, file: !12, line: 117, baseType: !395, size: 64, align: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "rtype", scope: !380, file: !12, line: 216, baseType: !387, size: 64, align: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !380, file: !12, line: 217, baseType: !360, size: 32, align: 32, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !380, file: !12, line: 218, baseType: !360, size: 32, align: 32, offset: 224)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !371, file: !12, line: 307, baseType: !401, size: 64, align: 64, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{null, !378, !108, !404, !108}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !371, file: !12, line: 308, baseType: !108, size: 64, align: 64, offset: 320)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pcl_exec", scope: !365, file: !364, line: 62, baseType: !108, size: 64, align: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "cif", scope: !365, file: !364, line: 63, baseType: !379, size: 256, align: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !365, file: !364, line: 64, baseType: !62, size: 32, align: 32, offset: 576)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "converters", scope: !365, file: !364, line: 65, baseType: !23, size: 64, align: 64, offset: 640)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "callable", scope: !365, file: !364, line: 66, baseType: !23, size: 64, align: 64, offset: 704)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "restype", scope: !365, file: !364, line: 67, baseType: !23, size: 64, align: 64, offset: 768)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "setfunc", scope: !365, file: !364, line: 68, baseType: !413, size: 64, align: 64, offset: 832)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "SETFUNC", file: !364, line: 17, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!23, !108, !23, !29}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ffi_restype", scope: !365, file: !364, line: 69, baseType: !387, size: 64, align: 64, offset: 896)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "atypes", scope: !365, file: !364, line: 70, baseType: !419, size: 64, align: 64, offset: 960)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 64, align: 64, elements: !100)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !422, line: 33, baseType: !423)
!422 = !DIFile(filename: "./Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!423 = !DICompositeType(tag: DW_TAG_structure_type, file: !422, line: 25, size: 256, align: 64, elements: !424)
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !423, file: !422, line: 26, baseType: !41, size: 192, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !423, file: !422, line: 27, baseType: !427, size: 64, align: 64, offset: 192)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 64, align: 64, elements: !100)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "CDataObject", file: !364, line: 15, baseType: !430)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "tagCDataObject", file: !364, line: 46, size: 768, align: 128, elements: !431)
!431 = !{!432, !433, !434, !435, !436, !437, !438, !439, !440}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !430, file: !364, line: 47, baseType: !24, size: 128, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "b_ptr", scope: !430, file: !364, line: 48, baseType: !70, size: 64, align: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "b_needsfree", scope: !430, file: !364, line: 49, baseType: !62, size: 32, align: 32, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "b_base", scope: !430, file: !364, line: 50, baseType: !428, size: 64, align: 64, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "b_size", scope: !430, file: !364, line: 51, baseType: !29, size: 64, align: 64, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "b_length", scope: !430, file: !364, line: 52, baseType: !29, size: 64, align: 64, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "b_index", scope: !430, file: !364, line: 53, baseType: !29, size: 64, align: 64, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "b_objects", scope: !430, file: !364, line: 55, baseType: !23, size: 64, align: 64, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "b_value", scope: !430, file: !364, line: 56, baseType: !441, size: 128, align: 128, offset: 640)
!441 = !DICompositeType(tag: DW_TAG_union_type, name: "value", file: !364, line: 27, size: 128, align: 128, elements: !442)
!442 = !{!443, !447, !449, !450, !451, !453, !455, !457}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !441, file: !364, line: 28, baseType: !444, size: 128, align: 8)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 128, align: 8, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 16)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !441, file: !364, line: 29, baseType: !448, size: 16, align: 16)
!448 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !441, file: !364, line: 30, baseType: !62, size: 32, align: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !441, file: !364, line: 31, baseType: !35, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !441, file: !364, line: 32, baseType: !452, size: 32, align: 32)
!452 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !441, file: !364, line: 33, baseType: !454, size: 64, align: 64)
!454 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ll", scope: !441, file: !364, line: 35, baseType: !456, size: 64, align: 64)
!456 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !441, file: !364, line: 37, baseType: !458, size: 128, align: 128)
!458 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!459 = !{!460, !554, !643, !662, !680, !702, !709, !716, !796}
!460 = !DISubprogram(name: "_ctypes_add_traceback", scope: !461, file: !461, line: 96, type: !462, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i8*, i32)* @_ctypes_add_traceback, variables: !464)
!461 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_ctypes/callbacks.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!462 = !DISubroutineType(types: !463)
!463 = !{null, !70, !70, !62}
!464 = !{!465, !466, !467, !468, !469, !496, !530, !531, !532, !533, !535, !537, !539, !541, !544, !546, !549, !551}
!465 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "funcname", arg: 1, scope: !460, file: !461, line: 96, type: !70)
!466 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 2, scope: !460, file: !461, line: 96, type: !70)
!467 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 3, scope: !460, file: !461, line: 96, type: !62)
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "py_globals", scope: !460, file: !461, line: 98, type: !23)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "py_code", scope: !460, file: !461, line: 99, type: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !472, line: 33, baseType: !473)
!472 = !DIFile(filename: "./Include/code.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!473 = !DICompositeType(tag: DW_TAG_structure_type, file: !472, line: 11, size: 1152, align: 64, elements: !474)
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !490, !491, !492, !493, !494, !495}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !473, file: !472, line: 12, baseType: !24, size: 128, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !473, file: !472, line: 13, baseType: !62, size: 32, align: 32, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !473, file: !472, line: 14, baseType: !62, size: 32, align: 32, offset: 160)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !473, file: !472, line: 15, baseType: !62, size: 32, align: 32, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !473, file: !472, line: 16, baseType: !62, size: 32, align: 32, offset: 224)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !473, file: !472, line: 17, baseType: !62, size: 32, align: 32, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "co_code", scope: !473, file: !472, line: 18, baseType: !23, size: 64, align: 64, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !473, file: !472, line: 19, baseType: !23, size: 64, align: 64, offset: 384)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !473, file: !472, line: 20, baseType: !23, size: 64, align: 64, offset: 448)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "co_varnames", scope: !473, file: !472, line: 21, baseType: !23, size: 64, align: 64, offset: 512)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "co_freevars", scope: !473, file: !472, line: 22, baseType: !23, size: 64, align: 64, offset: 576)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "co_cellvars", scope: !473, file: !472, line: 23, baseType: !23, size: 64, align: 64, offset: 640)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "co_cell2arg", scope: !473, file: !472, line: 25, baseType: !488, size: 64, align: 64, offset: 704)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !473, file: !472, line: 26, baseType: !23, size: 64, align: 64, offset: 768)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !473, file: !472, line: 27, baseType: !23, size: 64, align: 64, offset: 832)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !473, file: !472, line: 28, baseType: !62, size: 32, align: 32, offset: 896)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "co_lnotab", scope: !473, file: !472, line: 29, baseType: !23, size: 64, align: 64, offset: 960)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "co_zombieframe", scope: !473, file: !472, line: 31, baseType: !108, size: 64, align: 64, offset: 1024)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !473, file: !472, line: 32, baseType: !23, size: 64, align: 64, offset: 1088)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "py_frame", scope: !460, file: !461, line: 100, type: !497)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFrameObject", file: !499, line: 53, baseType: !500)
!499 = !DIFile(filename: "./Include/frameobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !499, line: 17, size: 3072, align: 64, elements: !501)
!501 = !{!502, !503, !505, !506, !507, !508, !509, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !529}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !500, file: !499, line: 18, baseType: !41, size: 192, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "f_back", scope: !500, file: !499, line: 19, baseType: !504, size: 64, align: 64, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "f_code", scope: !500, file: !499, line: 20, baseType: !470, size: 64, align: 64, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "f_builtins", scope: !500, file: !499, line: 21, baseType: !23, size: 64, align: 64, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "f_globals", scope: !500, file: !499, line: 22, baseType: !23, size: 64, align: 64, offset: 384)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "f_locals", scope: !500, file: !499, line: 23, baseType: !23, size: 64, align: 64, offset: 448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "f_valuestack", scope: !500, file: !499, line: 24, baseType: !510, size: 64, align: 64, offset: 512)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "f_stacktop", scope: !500, file: !499, line: 28, baseType: !510, size: 64, align: 64, offset: 576)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "f_trace", scope: !500, file: !499, line: 29, baseType: !23, size: 64, align: 64, offset: 640)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_type", scope: !500, file: !499, line: 38, baseType: !23, size: 64, align: 64, offset: 704)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_value", scope: !500, file: !499, line: 38, baseType: !23, size: 64, align: 64, offset: 768)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_traceback", scope: !500, file: !499, line: 38, baseType: !23, size: 64, align: 64, offset: 832)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "f_gen", scope: !500, file: !499, line: 40, baseType: !23, size: 64, align: 64, offset: 896)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "f_lasti", scope: !500, file: !499, line: 42, baseType: !62, size: 32, align: 32, offset: 960)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "f_lineno", scope: !500, file: !499, line: 48, baseType: !62, size: 32, align: 32, offset: 992)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "f_iblock", scope: !500, file: !499, line: 49, baseType: !62, size: 32, align: 32, offset: 1024)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "f_executing", scope: !500, file: !499, line: 50, baseType: !49, size: 8, align: 8, offset: 1056)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "f_blockstack", scope: !500, file: !499, line: 51, baseType: !522, size: 1920, align: 32, offset: 1088)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 1920, align: 32, elements: !119)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTryBlock", file: !499, line: 15, baseType: !524)
!524 = !DICompositeType(tag: DW_TAG_structure_type, file: !499, line: 11, size: 96, align: 32, elements: !525)
!525 = !{!526, !527, !528}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "b_type", scope: !524, file: !499, line: 12, baseType: !62, size: 32, align: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "b_handler", scope: !524, file: !499, line: 13, baseType: !62, size: 32, align: 32, offset: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "b_level", scope: !524, file: !499, line: 14, baseType: !62, size: 32, align: 32, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "f_localsplus", scope: !500, file: !499, line: 52, baseType: !427, size: 64, align: 64, offset: 3008)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exception", scope: !460, file: !461, line: 101, type: !23)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !460, file: !461, line: 101, type: !23)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !460, file: !461, line: 101, type: !23)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !534, file: !461, line: 127, type: !23)
!534 = distinct !DILexicalBlock(scope: !460, file: !461, line: 127, column: 8)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !536, file: !461, line: 128, type: !23)
!536 = distinct !DILexicalBlock(scope: !460, file: !461, line: 128, column: 8)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !538, file: !461, line: 129, type: !23)
!538 = distinct !DILexicalBlock(scope: !460, file: !461, line: 129, column: 8)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !540, file: !461, line: 133, type: !23)
!540 = distinct !DILexicalBlock(scope: !460, file: !461, line: 133, column: 8)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !542, file: !461, line: 133, type: !23)
!542 = distinct !DILexicalBlock(scope: !543, file: !461, line: 133, column: 102)
!543 = distinct !DILexicalBlock(scope: !540, file: !461, line: 133, column: 68)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !545, file: !461, line: 134, type: !23)
!545 = distinct !DILexicalBlock(scope: !460, file: !461, line: 134, column: 8)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !547, file: !461, line: 134, type: !23)
!547 = distinct !DILexicalBlock(scope: !548, file: !461, line: 134, column: 99)
!548 = distinct !DILexicalBlock(scope: !545, file: !461, line: 134, column: 65)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !550, file: !461, line: 135, type: !23)
!550 = distinct !DILexicalBlock(scope: !460, file: !461, line: 135, column: 8)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !552, file: !461, line: 135, type: !23)
!552 = distinct !DILexicalBlock(scope: !553, file: !461, line: 135, column: 100)
!553 = distinct !DILexicalBlock(scope: !550, file: !461, line: 135, column: 66)
!554 = !DISubprogram(name: "_ctypes_alloc_callback", scope: !461, file: !461, line: 373, type: !555, isLocal: false, isDefinition: true, scopeLine: 377, flags: DIFlagPrototyped, isOptimized: true, function: %struct.CThunkObject* (%struct._object*, %struct._object*, %struct._object*, i32)* @_ctypes_alloc_callback, variables: !557)
!555 = !DISubroutineType(types: !556)
!556 = !{!362, !23, !23, !23, !62}
!557 = !{!558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !571, !573, !638, !640}
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "callable", arg: 1, scope: !554, file: !461, line: 373, type: !23)
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "converters", arg: 2, scope: !554, file: !461, line: 374, type: !23)
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "restype", arg: 3, scope: !554, file: !461, line: 375, type: !23)
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 4, scope: !554, file: !461, line: 376, type: !62)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !554, file: !461, line: 378, type: !62)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !554, file: !461, line: 379, type: !362)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nArgs", scope: !554, file: !461, line: 380, type: !29)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !554, file: !461, line: 380, type: !29)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cc", scope: !554, file: !461, line: 381, type: !383)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cnv", scope: !568, file: !461, line: 399, type: !23)
!568 = distinct !DILexicalBlock(scope: !569, file: !461, line: 398, column: 33)
!569 = distinct !DILexicalBlock(scope: !570, file: !461, line: 398, column: 5)
!570 = distinct !DILexicalBlock(scope: !554, file: !461, line: 398, column: 5)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !572, file: !461, line: 403, type: !23)
!572 = distinct !DILexicalBlock(scope: !568, file: !461, line: 403, column: 12)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !574, file: !461, line: 413, type: !576)
!574 = distinct !DILexicalBlock(scope: !575, file: !461, line: 412, column: 12)
!575 = distinct !DILexicalBlock(scope: !554, file: !461, line: 409, column: 9)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "StgDictObject", file: !364, line: 220, baseType: !578)
!578 = !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 187, size: 1472, align: 64, elements: !579)
!579 = !{!580, !592, !593, !594, !595, !596, !597, !598, !603, !630, !631, !632, !633, !634, !635, !636, !637}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !578, file: !364, line: 188, baseType: !581, size: 320, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictObject", file: !582, line: 28, baseType: !583)
!582 = !DIFile(filename: "./Include/dictobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!583 = !DICompositeType(tag: DW_TAG_structure_type, file: !582, line: 23, size: 320, align: 64, elements: !584)
!584 = !{!585, !586, !587, !591}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !583, file: !582, line: 24, baseType: !24, size: 128, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ma_used", scope: !583, file: !582, line: 25, baseType: !29, size: 64, align: 64, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ma_keys", scope: !583, file: !582, line: 26, baseType: !588, size: 64, align: 64, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64, align: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictKeysObject", file: !582, line: 18, baseType: !590)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "_dictkeysobject", file: !25, line: 461, flags: DIFlagFwdDecl)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ma_values", scope: !583, file: !582, line: 27, baseType: !510, size: 64, align: 64, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !578, file: !364, line: 197, baseType: !29, size: 64, align: 64, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !578, file: !364, line: 198, baseType: !29, size: 64, align: 64, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !578, file: !364, line: 199, baseType: !29, size: 64, align: 64, offset: 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ffi_type_pointer", scope: !578, file: !364, line: 200, baseType: !388, size: 192, align: 64, offset: 512)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !578, file: !364, line: 201, baseType: !23, size: 64, align: 64, offset: 704)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "setfunc", scope: !578, file: !364, line: 202, baseType: !413, size: 64, align: 64, offset: 768)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "getfunc", scope: !578, file: !364, line: 203, baseType: !599, size: 64, align: 64, offset: 832)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "GETFUNC", file: !364, line: 16, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64, align: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!23, !108, !29}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "paramfunc", scope: !578, file: !364, line: 204, baseType: !604, size: 64, align: 64, offset: 896)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "PARAMFUNC", file: !364, line: 18, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64, align: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!608, !428}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCArgObject", file: !364, line: 14, baseType: !610)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "tagPyCArgObject", file: !364, line: 296, size: 512, align: 128, elements: !611)
!611 = !{!612, !613, !614, !615, !628, !629}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !610, file: !364, line: 297, baseType: !24, size: 128, align: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "pffi_type", scope: !610, file: !364, line: 298, baseType: !387, size: 64, align: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !610, file: !364, line: 299, baseType: !49, size: 8, align: 8, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !610, file: !364, line: 313, baseType: !616, size: 128, align: 128, offset: 256)
!616 = !DICompositeType(tag: DW_TAG_union_type, scope: !610, file: !364, line: 300, size: 128, align: 128, elements: !617)
!617 = !{!618, !619, !620, !621, !622, !623, !624, !625, !626, !627}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !616, file: !364, line: 301, baseType: !49, size: 8, align: 8)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !616, file: !364, line: 302, baseType: !49, size: 8, align: 8)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !616, file: !364, line: 303, baseType: !448, size: 16, align: 16)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !616, file: !364, line: 304, baseType: !62, size: 32, align: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !616, file: !364, line: 305, baseType: !35, size: 64, align: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !616, file: !364, line: 307, baseType: !456, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !616, file: !364, line: 309, baseType: !458, size: 128, align: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !616, file: !364, line: 310, baseType: !454, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !616, file: !364, line: 311, baseType: !452, size: 32, align: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !616, file: !364, line: 312, baseType: !108, size: 64, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !610, file: !364, line: 314, baseType: !23, size: 64, align: 64, offset: 384)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !610, file: !364, line: 315, baseType: !29, size: 64, align: 64, offset: 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "argtypes", scope: !578, file: !364, line: 207, baseType: !23, size: 64, align: 64, offset: 960)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "converters", scope: !578, file: !364, line: 208, baseType: !23, size: 64, align: 64, offset: 1024)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "restype", scope: !578, file: !364, line: 209, baseType: !23, size: 64, align: 64, offset: 1088)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "checker", scope: !578, file: !364, line: 210, baseType: !23, size: 64, align: 64, offset: 1152)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !578, file: !364, line: 211, baseType: !62, size: 32, align: 32, offset: 1216)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !578, file: !364, line: 214, baseType: !70, size: 64, align: 64, offset: 1280)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !578, file: !364, line: 215, baseType: !62, size: 32, align: 32, offset: 1344)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !578, file: !364, line: 216, baseType: !266, size: 64, align: 64, offset: 1408)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !639, file: !461, line: 457, type: !23)
!639 = distinct !DILexicalBlock(scope: !554, file: !461, line: 457, column: 8)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !641, file: !461, line: 457, type: !23)
!641 = distinct !DILexicalBlock(scope: !642, file: !461, line: 457, column: 93)
!642 = distinct !DILexicalBlock(scope: !639, file: !461, line: 457, column: 59)
!643 = !DISubprogram(name: "CThunkObject_dealloc", scope: !461, file: !461, line: 13, type: !55, isLocal: true, isDefinition: true, scopeLine: 14, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @CThunkObject_dealloc, variables: !644)
!644 = !{!645, !646, !647, !649, !652, !654, !657, !659}
!645 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "myself", arg: 1, scope: !643, file: !461, line: 13, type: !23)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !643, file: !461, line: 15, type: !362)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !648, file: !461, line: 17, type: !23)
!648 = distinct !DILexicalBlock(scope: !643, file: !461, line: 17, column: 8)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !650, file: !461, line: 17, type: !23)
!650 = distinct !DILexicalBlock(scope: !651, file: !461, line: 17, column: 108)
!651 = distinct !DILexicalBlock(scope: !648, file: !461, line: 17, column: 74)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !653, file: !461, line: 18, type: !23)
!653 = distinct !DILexicalBlock(scope: !643, file: !461, line: 18, column: 8)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !655, file: !461, line: 18, type: !23)
!655 = distinct !DILexicalBlock(scope: !656, file: !461, line: 18, column: 106)
!656 = distinct !DILexicalBlock(scope: !653, file: !461, line: 18, column: 72)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !658, file: !461, line: 19, type: !23)
!658 = distinct !DILexicalBlock(scope: !643, file: !461, line: 19, column: 8)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !660, file: !461, line: 19, type: !23)
!660 = distinct !DILexicalBlock(scope: !661, file: !461, line: 19, column: 105)
!661 = distinct !DILexicalBlock(scope: !658, file: !461, line: 19, column: 71)
!662 = !DISubprogram(name: "CThunkObject_traverse", scope: !461, file: !461, line: 26, type: !280, isLocal: true, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)* @CThunkObject_traverse, variables: !663)
!663 = !{!664, !665, !666, !667, !668, !672, !676}
!664 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "myself", arg: 1, scope: !662, file: !461, line: 26, type: !23)
!665 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !662, file: !461, line: 26, type: !282)
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !662, file: !461, line: 26, type: !108)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !662, file: !461, line: 28, type: !362)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !669, file: !461, line: 29, type: !62)
!669 = distinct !DILexicalBlock(scope: !670, file: !461, line: 29, column: 32)
!670 = distinct !DILexicalBlock(scope: !671, file: !461, line: 29, column: 14)
!671 = distinct !DILexicalBlock(scope: !662, file: !461, line: 29, column: 8)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !673, file: !461, line: 30, type: !62)
!673 = distinct !DILexicalBlock(scope: !674, file: !461, line: 30, column: 30)
!674 = distinct !DILexicalBlock(scope: !675, file: !461, line: 30, column: 14)
!675 = distinct !DILexicalBlock(scope: !662, file: !461, line: 30, column: 8)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !677, file: !461, line: 31, type: !62)
!677 = distinct !DILexicalBlock(scope: !678, file: !461, line: 31, column: 29)
!678 = distinct !DILexicalBlock(scope: !679, file: !461, line: 31, column: 14)
!679 = distinct !DILexicalBlock(scope: !662, file: !461, line: 31, column: 8)
!680 = !DISubprogram(name: "CThunkObject_clear", scope: !461, file: !461, line: 36, type: !163, isLocal: true, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @CThunkObject_clear, variables: !681)
!681 = !{!682, !683, !684, !686, !690, !692, !696, !698}
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "myself", arg: 1, scope: !680, file: !461, line: 36, type: !23)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !680, file: !461, line: 38, type: !362)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !685, file: !461, line: 39, type: !23)
!685 = distinct !DILexicalBlock(scope: !680, file: !461, line: 39, column: 8)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !687, file: !461, line: 39, type: !23)
!687 = distinct !DILexicalBlock(scope: !688, file: !461, line: 39, column: 127)
!688 = distinct !DILexicalBlock(scope: !689, file: !461, line: 39, column: 89)
!689 = distinct !DILexicalBlock(scope: !685, file: !461, line: 39, column: 66)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !691, file: !461, line: 40, type: !23)
!691 = distinct !DILexicalBlock(scope: !680, file: !461, line: 40, column: 8)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !693, file: !461, line: 40, type: !23)
!693 = distinct !DILexicalBlock(scope: !694, file: !461, line: 40, column: 123)
!694 = distinct !DILexicalBlock(scope: !695, file: !461, line: 40, column: 87)
!695 = distinct !DILexicalBlock(scope: !691, file: !461, line: 40, column: 64)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !697, file: !461, line: 41, type: !23)
!697 = distinct !DILexicalBlock(scope: !680, file: !461, line: 41, column: 8)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !699, file: !461, line: 41, type: !23)
!699 = distinct !DILexicalBlock(scope: !700, file: !461, line: 41, column: 121)
!700 = distinct !DILexicalBlock(scope: !701, file: !461, line: 41, column: 86)
!701 = distinct !DILexicalBlock(scope: !697, file: !461, line: 41, column: 63)
!702 = !DISubprogram(name: "CThunkObject_new", scope: !461, file: !461, line: 348, type: !703, isLocal: true, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: true, function: %struct.CThunkObject* (i64)* @CThunkObject_new, variables: !705)
!703 = !DISubroutineType(types: !704)
!704 = !{!362, !29}
!705 = !{!706, !707, !708}
!706 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nArgs", arg: 1, scope: !702, file: !461, line: 348, type: !29)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !702, file: !461, line: 350, type: !362)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !702, file: !461, line: 351, type: !62)
!709 = !DISubprogram(name: "closure_fcn", scope: !461, file: !461, line: 332, type: !402, isLocal: true, isDefinition: true, scopeLine: 336, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.ffi_cif*, i8*, i8**, i8*)* @closure_fcn, variables: !710)
!710 = !{!711, !712, !713, !714, !715}
!711 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cif", arg: 1, scope: !709, file: !461, line: 332, type: !378)
!712 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "resp", arg: 2, scope: !709, file: !461, line: 333, type: !108)
!713 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 3, scope: !709, file: !461, line: 334, type: !404)
!714 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "userdata", arg: 4, scope: !709, file: !461, line: 335, type: !108)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !709, file: !461, line: 337, type: !362)
!716 = !DISubprogram(name: "_CallPythonObject", scope: !461, file: !461, line: 169, type: !717, isLocal: true, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, %struct._ffi_type*, %struct._object* (i8*, %struct._object*, i64)*, %struct._object*, %struct._object*, i32, i8**)* @_CallPythonObject, variables: !719)
!717 = !DISubroutineType(types: !718)
!718 = !{null, !108, !387, !413, !23, !23, !62, !404}
!719 = !{!720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !734, !736, !740, !741, !744, !748, !751, !755, !759, !761, !764, !766, !771, !774, !776, !779, !782, !786, !788, !791, !793}
!720 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mem", arg: 1, scope: !716, file: !461, line: 169, type: !108)
!721 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "restype", arg: 2, scope: !716, file: !461, line: 170, type: !387)
!722 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "setfunc", arg: 3, scope: !716, file: !461, line: 171, type: !413)
!723 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "callable", arg: 4, scope: !716, file: !461, line: 172, type: !23)
!724 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "converters", arg: 5, scope: !716, file: !461, line: 173, type: !23)
!725 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 6, scope: !716, file: !461, line: 174, type: !62)
!726 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pArgs", arg: 7, scope: !716, file: !461, line: 175, type: !404)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !716, file: !461, line: 177, type: !29)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !716, file: !461, line: 178, type: !23)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arglist", scope: !716, file: !461, line: 179, type: !23)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nArgs", scope: !716, file: !461, line: 180, type: !29)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error_object", scope: !716, file: !461, line: 181, type: !23)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "space", scope: !716, file: !461, line: 182, type: !733)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !716, file: !461, line: 184, type: !735)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGILState_STATE", file: !18, line: 191, baseType: !17)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cnv", scope: !737, file: !461, line: 203, type: !23)
!737 = distinct !DILexicalBlock(scope: !738, file: !461, line: 201, column: 33)
!738 = distinct !DILexicalBlock(scope: !739, file: !461, line: 201, column: 5)
!739 = distinct !DILexicalBlock(scope: !716, file: !461, line: 201, column: 5)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !737, file: !461, line: 204, type: !576)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !742, file: !461, line: 213, type: !23)
!742 = distinct !DILexicalBlock(scope: !743, file: !461, line: 212, column: 69)
!743 = distinct !DILexicalBlock(scope: !737, file: !461, line: 212, column: 13)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !745, file: !461, line: 216, type: !23)
!745 = distinct !DILexicalBlock(scope: !746, file: !461, line: 216, column: 20)
!746 = distinct !DILexicalBlock(scope: !747, file: !461, line: 214, column: 21)
!747 = distinct !DILexicalBlock(scope: !742, file: !461, line: 214, column: 17)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !749, file: !461, line: 227, type: !428)
!749 = distinct !DILexicalBlock(scope: !750, file: !461, line: 225, column: 26)
!750 = distinct !DILexicalBlock(scope: !743, file: !461, line: 225, column: 20)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !752, file: !461, line: 230, type: !23)
!752 = distinct !DILexicalBlock(scope: !753, file: !461, line: 230, column: 20)
!753 = distinct !DILexicalBlock(scope: !754, file: !461, line: 228, column: 23)
!754 = distinct !DILexicalBlock(scope: !749, file: !461, line: 228, column: 17)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !756, file: !461, line: 234, type: !23)
!756 = distinct !DILexicalBlock(scope: !757, file: !461, line: 234, column: 20)
!757 = distinct !DILexicalBlock(scope: !758, file: !461, line: 233, column: 138)
!758 = distinct !DILexicalBlock(scope: !749, file: !461, line: 233, column: 17)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !760, file: !461, line: 235, type: !23)
!760 = distinct !DILexicalBlock(scope: !757, file: !461, line: 235, column: 20)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !762, file: !461, line: 248, type: !23)
!762 = distinct !DILexicalBlock(scope: !763, file: !461, line: 248, column: 16)
!763 = distinct !DILexicalBlock(scope: !750, file: !461, line: 244, column: 16)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !765, file: !461, line: 251, type: !23)
!765 = distinct !DILexicalBlock(scope: !737, file: !461, line: 251, column: 12)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !767, file: !461, line: 264, type: !62)
!767 = distinct !DILexicalBlock(scope: !768, file: !461, line: 263, column: 26)
!768 = distinct !DILexicalBlock(scope: !769, file: !461, line: 263, column: 13)
!769 = distinct !DILexicalBlock(scope: !770, file: !461, line: 259, column: 31)
!770 = distinct !DILexicalBlock(scope: !716, file: !461, line: 259, column: 9)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !772, file: !461, line: 288, type: !62)
!772 = distinct !DILexicalBlock(scope: !773, file: !461, line: 287, column: 22)
!773 = distinct !DILexicalBlock(scope: !716, file: !461, line: 287, column: 9)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !775, file: !461, line: 292, type: !23)
!775 = distinct !DILexicalBlock(scope: !716, file: !461, line: 292, column: 8)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !777, file: !461, line: 292, type: !23)
!777 = distinct !DILexicalBlock(scope: !778, file: !461, line: 292, column: 104)
!778 = distinct !DILexicalBlock(scope: !775, file: !461, line: 292, column: 70)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "keep", scope: !780, file: !461, line: 295, type: !23)
!780 = distinct !DILexicalBlock(scope: !781, file: !461, line: 294, column: 48)
!781 = distinct !DILexicalBlock(scope: !716, file: !461, line: 294, column: 9)
!782 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !783, file: !461, line: 316, type: !23)
!783 = distinct !DILexicalBlock(scope: !784, file: !461, line: 316, column: 16)
!784 = distinct !DILexicalBlock(scope: !785, file: !461, line: 315, column: 18)
!785 = distinct !DILexicalBlock(scope: !780, file: !461, line: 313, column: 13)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !787, file: !461, line: 324, type: !23)
!787 = distinct !DILexicalBlock(scope: !716, file: !461, line: 324, column: 8)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !789, file: !461, line: 324, type: !23)
!789 = distinct !DILexicalBlock(scope: !790, file: !461, line: 324, column: 98)
!790 = distinct !DILexicalBlock(scope: !787, file: !461, line: 324, column: 64)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !792, file: !461, line: 326, type: !23)
!792 = distinct !DILexicalBlock(scope: !716, file: !461, line: 326, column: 8)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !794, file: !461, line: 326, type: !23)
!794 = distinct !DILexicalBlock(scope: !795, file: !461, line: 326, column: 99)
!795 = distinct !DILexicalBlock(scope: !792, file: !461, line: 326, column: 65)
!796 = !DISubprogram(name: "PrintError", scope: !461, file: !461, line: 80, type: !797, isLocal: true, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, ...)* @PrintError, variables: !799)
!797 = !DISubroutineType(types: !798)
!798 = !{null, !70, null}
!799 = !{!800, !801, !805, !806}
!800 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msg", arg: 1, scope: !796, file: !461, line: 80, type: !70)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !796, file: !461, line: 82, type: !802)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 4096, align: 8, elements: !803)
!803 = !{!804}
!804 = !DISubrange(count: 512)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !796, file: !461, line: 83, type: !23)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "marker", scope: !796, file: !461, line: 84, type: !807)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !32, line: 79, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !809, line: 50, baseType: !810)
!809 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stdarg.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 84, baseType: !811)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !812, size: 192, align: 64, elements: !100)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "__va_list_tag", file: !1, line: 84, baseType: !813)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 84, size: 192, align: 64, elements: !814)
!814 = !{!815, !816, !817, !818}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !813, file: !1, line: 84, baseType: !360, size: 32, align: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !813, file: !1, line: 84, baseType: !360, size: 32, align: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !813, file: !1, line: 84, baseType: !108, size: 64, align: 64, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !813, file: !1, line: 84, baseType: !108, size: 64, align: 64, offset: 128)
!819 = !{!820}
!820 = !DIGlobalVariable(name: "PyCThunk_Type", scope: !0, file: !461, line: 45, type: !821, isLocal: false, isDefinition: true, variable: %struct._typeobject* @PyCThunk_Type)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !25, line: 422, baseType: !38)
!822 = !{i32 2, !"Dwarf Version", i32 4}
!823 = !{i32 2, !"Debug Info Version", i32 3}
!824 = !{i32 1, !"PIC Level", i32 2}
!825 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!826 = !{!827, !827, i64 0}
!827 = !{!"any pointer", !828, i64 0}
!828 = !{!"omnipotent char", !829, i64 0}
!829 = !{!"Simple C/C++ TBAA"}
!830 = !DIExpression()
!831 = !DILocation(line: 13, column: 32, scope: !643)
!832 = !DILocation(line: 15, column: 5, scope: !643)
!833 = !DILocation(line: 15, column: 19, scope: !643)
!834 = !DILocation(line: 15, column: 42, scope: !643)
!835 = !DILocation(line: 15, column: 26, scope: !643)
!836 = !DILocation(line: 16, column: 25, scope: !643)
!837 = !DILocation(line: 16, column: 5, scope: !643)
!838 = !DILocation(line: 17, column: 5, scope: !643)
!839 = !DILocation(line: 17, column: 10, scope: !840)
!840 = !DILexicalBlockFile(scope: !648, file: !461, discriminator: 1)
!841 = !DILocation(line: 17, column: 20, scope: !648)
!842 = !DILocation(line: 17, column: 51, scope: !648)
!843 = !DILocation(line: 17, column: 57, scope: !648)
!844 = !{!845, !827, i64 80}
!845 = !{!"", !846, i64 0, !827, i64 24, !827, i64 32, !849, i64 40, !850, i64 72, !827, i64 80, !827, i64 88, !827, i64 96, !827, i64 104, !827, i64 112, !828, i64 120}
!846 = !{!"", !847, i64 0, !848, i64 16}
!847 = !{!"_object", !848, i64 0, !827, i64 8}
!848 = !{!"long", !828, i64 0}
!849 = !{!"", !828, i64 0, !850, i64 4, !827, i64 8, !827, i64 16, !850, i64 24, !850, i64 28}
!850 = !{!"int", !828, i64 0}
!851 = !DILocation(line: 17, column: 74, scope: !651)
!852 = !DILocation(line: 17, column: 90, scope: !651)
!853 = !DILocation(line: 17, column: 74, scope: !648)
!854 = !DILocation(line: 17, column: 105, scope: !855)
!855 = !DILexicalBlockFile(scope: !651, file: !461, discriminator: 2)
!856 = !DILocation(line: 17, column: 110, scope: !857)
!857 = !DILexicalBlockFile(scope: !650, file: !461, discriminator: 4)
!858 = !DILocation(line: 17, column: 120, scope: !650)
!859 = !DILocation(line: 17, column: 150, scope: !650)
!860 = !DILocation(line: 17, column: 176, scope: !861)
!861 = distinct !DILexicalBlock(scope: !650, file: !461, line: 17, column: 173)
!862 = !DILocation(line: 17, column: 193, scope: !861)
!863 = !DILocation(line: 17, column: 173, scope: !861)
!864 = !{!847, !848, i64 0}
!865 = !DILocation(line: 17, column: 203, scope: !861)
!866 = !DILocation(line: 17, column: 173, scope: !650)
!867 = !DILocation(line: 17, column: 173, scope: !868)
!868 = !DILexicalBlockFile(scope: !650, file: !461, discriminator: 5)
!869 = !DILocation(line: 17, column: 234, scope: !870)
!870 = !DILexicalBlockFile(scope: !861, file: !461, discriminator: 6)
!871 = !DILocation(line: 17, column: 252, scope: !861)
!872 = !{!847, !827, i64 8}
!873 = !DILocation(line: 17, column: 262, scope: !861)
!874 = !{!875, !827, i64 48}
