; ModuleID = 'irs-onlybc/callproc.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !17, subprograms: !483, globals: !979)
!1 = !DIFile(filename: "callproc.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !11}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ffi_abi", file: !4, line: 75, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "build/temp.linux-x86_64-3.4/libffi/include/ffitarget.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "FFI_FIRST_ABI", value: 0)
!7 = !DIEnumerator(name: "FFI_SYSV", value: 1)
!8 = !DIEnumerator(name: "FFI_UNIX64", value: 2)
!9 = !DIEnumerator(name: "FFI_LAST_ABI", value: 3)
!10 = !DIEnumerator(name: "FFI_DEFAULT_ABI", value: 2)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 204, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "build/temp.linux-x86_64-3.4/libffi/include/ffi.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "FFI_OK", value: 0)
!15 = !DIEnumerator(name: "FFI_BAD_TYPEDEF", value: 1)
!16 = !DIEnumerator(name: "FFI_BAD_ABI", value: 2)
!17 = !{!18, !19, !364, !365, !403, !404, !423, !431, !432, !58, !433, !31, !459, !66, !461, !469, !479}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !21, line: 109, baseType: !22)
!21 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !21, line: 105, size: 128, align: 64, elements: !23)
!23 = !{!24, !32}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !22, file: !21, line: 107, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !26, line: 177, baseType: !27)
!26 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !28, line: 102, baseType: !29)
!28 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !30, line: 181, baseType: !31)
!30 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!31 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !22, file: !21, line: 108, baseType: !33, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !21, line: 334, size: 3200, align: 64, elements: !35)
!35 = !{!36, !42, !46, !47, !48, !53, !116, !121, !126, !127, !132, !184, !215, !227, !233, !234, !235, !237, !239, !270, !271, !272, !281, !282, !287, !288, !290, !292, !302, !312, !330, !331, !332, !334, !336, !337, !339, !344, !349, !354, !355, !356, !357, !358, !359, !360, !361, !363}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !34, file: !21, line: 335, baseType: !37, size: 192, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !21, line: 114, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 111, size: 192, align: 64, elements: !39)
!39 = !{!40, !41}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !38, file: !21, line: 112, baseType: !20, size: 128, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !38, file: !21, line: 113, baseType: !25, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !34, file: !21, line: 336, baseType: !43, size: 64, align: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !34, file: !21, line: 337, baseType: !25, size: 64, align: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !34, file: !21, line: 337, baseType: !25, size: 64, align: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !34, file: !21, line: 341, baseType: !49, size: 64, align: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !21, line: 308, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{null, !19}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !34, file: !21, line: 342, baseType: !54, size: 64, align: 64, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !21, line: 314, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !19, !59, !58}
!58 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !28, line: 48, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 246, size: 1728, align: 64, elements: !63)
!62 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!63 = !{!64, !65, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !85, !86, !87, !88, !90, !92, !94, !98, !101, !103, !104, !105, !106, !107, !111, !112}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !61, file: !62, line: 247, baseType: !58, size: 32, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !61, file: !62, line: 252, baseType: !66, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !61, file: !62, line: 253, baseType: !66, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !61, file: !62, line: 254, baseType: !66, size: 64, align: 64, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !61, file: !62, line: 255, baseType: !66, size: 64, align: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !61, file: !62, line: 256, baseType: !66, size: 64, align: 64, offset: 320)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !61, file: !62, line: 257, baseType: !66, size: 64, align: 64, offset: 384)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !61, file: !62, line: 258, baseType: !66, size: 64, align: 64, offset: 448)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !61, file: !62, line: 259, baseType: !66, size: 64, align: 64, offset: 512)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !61, file: !62, line: 261, baseType: !66, size: 64, align: 64, offset: 576)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !61, file: !62, line: 262, baseType: !66, size: 64, align: 64, offset: 640)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !61, file: !62, line: 263, baseType: !66, size: 64, align: 64, offset: 704)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !61, file: !62, line: 265, baseType: !78, size: 64, align: 64, offset: 768)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !62, line: 161, size: 192, align: 64, elements: !80)
!80 = !{!81, !82, !84}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !79, file: !62, line: 162, baseType: !78, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !79, file: !62, line: 163, baseType: !83, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !79, file: !62, line: 167, baseType: !58, size: 32, align: 32, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !61, file: !62, line: 267, baseType: !83, size: 64, align: 64, offset: 832)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !61, file: !62, line: 269, baseType: !58, size: 32, align: 32, offset: 896)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !61, file: !62, line: 273, baseType: !58, size: 32, align: 32, offset: 928)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !61, file: !62, line: 275, baseType: !89, size: 64, align: 64, offset: 960)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !30, line: 140, baseType: !31)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !61, file: !62, line: 279, baseType: !91, size: 16, align: 16, offset: 1024)
!91 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !61, file: !62, line: 280, baseType: !93, size: 8, align: 8, offset: 1040)
!93 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !61, file: !62, line: 281, baseType: !95, size: 8, align: 8, offset: 1048)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8, align: 8, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 1)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !61, file: !62, line: 285, baseType: !99, size: 64, align: 64, offset: 1088)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !62, line: 155, baseType: null)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !61, file: !62, line: 294, baseType: !102, size: 64, align: 64, offset: 1152)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !30, line: 141, baseType: !31)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !61, file: !62, line: 303, baseType: !18, size: 64, align: 64, offset: 1216)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !61, file: !62, line: 304, baseType: !18, size: 64, align: 64, offset: 1280)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !61, file: !62, line: 305, baseType: !18, size: 64, align: 64, offset: 1344)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !61, file: !62, line: 306, baseType: !18, size: 64, align: 64, offset: 1408)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !61, file: !62, line: 307, baseType: !108, size: 64, align: 64, offset: 1472)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !109, line: 62, baseType: !110)
!109 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!110 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !61, file: !62, line: 309, baseType: !58, size: 32, align: 32, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !61, file: !62, line: 311, baseType: !113, size: 160, align: 8, offset: 1568)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 160, align: 8, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 20)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !34, file: !21, line: 343, baseType: !117, size: 64, align: 64, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !21, line: 316, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!19, !19, !66}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !34, file: !21, line: 344, baseType: !122, size: 64, align: 64, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !21, line: 318, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!58, !19, !66, !19}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !34, file: !21, line: 345, baseType: !18, size: 64, align: 64, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !34, file: !21, line: 346, baseType: !128, size: 64, align: 64, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !21, line: 320, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!19, !19}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !34, file: !21, line: 350, baseType: !133, size: 64, align: 64, offset: 768)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !21, line: 278, baseType: !135)
!135 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 236, size: 2176, align: 64, elements: !136)
!136 = !{!137, !142, !143, !144, !145, !146, !151, !153, !154, !155, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !135, file: !21, line: 241, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !21, line: 166, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!19, !19, !19}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !135, file: !21, line: 242, baseType: !138, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !135, file: !21, line: 243, baseType: !138, size: 64, align: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !135, file: !21, line: 244, baseType: !138, size: 64, align: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !135, file: !21, line: 245, baseType: !138, size: 64, align: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !135, file: !21, line: 246, baseType: !147, size: 64, align: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !21, line: 167, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!19, !19, !19, !19}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !135, file: !21, line: 247, baseType: !152, size: 64, align: 64, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !21, line: 165, baseType: !129)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !135, file: !21, line: 248, baseType: !152, size: 64, align: 64, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !135, file: !21, line: 249, baseType: !152, size: 64, align: 64, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !135, file: !21, line: 250, baseType: !156, size: 64, align: 64, offset: 576)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !21, line: 168, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!58, !19}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !135, file: !21, line: 251, baseType: !152, size: 64, align: 64, offset: 640)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !135, file: !21, line: 252, baseType: !138, size: 64, align: 64, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !135, file: !21, line: 253, baseType: !138, size: 64, align: 64, offset: 768)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !135, file: !21, line: 254, baseType: !138, size: 64, align: 64, offset: 832)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !135, file: !21, line: 255, baseType: !138, size: 64, align: 64, offset: 896)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !135, file: !21, line: 256, baseType: !138, size: 64, align: 64, offset: 960)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !135, file: !21, line: 257, baseType: !152, size: 64, align: 64, offset: 1024)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !135, file: !21, line: 258, baseType: !18, size: 64, align: 64, offset: 1088)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !135, file: !21, line: 259, baseType: !152, size: 64, align: 64, offset: 1152)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !135, file: !21, line: 261, baseType: !138, size: 64, align: 64, offset: 1216)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !135, file: !21, line: 262, baseType: !138, size: 64, align: 64, offset: 1280)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !135, file: !21, line: 263, baseType: !138, size: 64, align: 64, offset: 1344)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !135, file: !21, line: 264, baseType: !138, size: 64, align: 64, offset: 1408)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !135, file: !21, line: 265, baseType: !147, size: 64, align: 64, offset: 1472)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !135, file: !21, line: 266, baseType: !138, size: 64, align: 64, offset: 1536)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !135, file: !21, line: 267, baseType: !138, size: 64, align: 64, offset: 1600)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !135, file: !21, line: 268, baseType: !138, size: 64, align: 64, offset: 1664)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !135, file: !21, line: 269, baseType: !138, size: 64, align: 64, offset: 1728)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !135, file: !21, line: 270, baseType: !138, size: 64, align: 64, offset: 1792)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !135, file: !21, line: 272, baseType: !138, size: 64, align: 64, offset: 1856)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !135, file: !21, line: 273, baseType: !138, size: 64, align: 64, offset: 1920)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !135, file: !21, line: 274, baseType: !138, size: 64, align: 64, offset: 1984)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !135, file: !21, line: 275, baseType: !138, size: 64, align: 64, offset: 2048)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !135, file: !21, line: 277, baseType: !152, size: 64, align: 64, offset: 2112)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !34, file: !21, line: 351, baseType: !185, size: 64, align: 64, offset: 832)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !21, line: 292, baseType: !187)
!187 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 280, size: 640, align: 64, elements: !188)
!188 = !{!189, !194, !195, !200, !201, !202, !207, !208, !213, !214}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !187, file: !21, line: 281, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !21, line: 169, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!25, !19}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !187, file: !21, line: 282, baseType: !138, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !187, file: !21, line: 283, baseType: !196, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !21, line: 170, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!19, !19, !25}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !187, file: !21, line: 284, baseType: !196, size: 64, align: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !187, file: !21, line: 285, baseType: !18, size: 64, align: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !187, file: !21, line: 286, baseType: !203, size: 64, align: 64, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !21, line: 172, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!58, !19, !25, !19}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !187, file: !21, line: 287, baseType: !18, size: 64, align: 64, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !187, file: !21, line: 288, baseType: !209, size: 64, align: 64, offset: 448)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !21, line: 231, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!58, !19, !19}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !187, file: !21, line: 290, baseType: !138, size: 64, align: 64, offset: 512)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !187, file: !21, line: 291, baseType: !196, size: 64, align: 64, offset: 576)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !34, file: !21, line: 352, baseType: !216, size: 64, align: 64, offset: 896)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !21, line: 298, baseType: !218)
!218 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 294, size: 192, align: 64, elements: !219)
!219 = !{!220, !221, !222}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !218, file: !21, line: 295, baseType: !190, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !218, file: !21, line: 296, baseType: !138, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !218, file: !21, line: 297, baseType: !223, size: 64, align: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !21, line: 174, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!58, !19, !19, !19}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !34, file: !21, line: 356, baseType: !228, size: 64, align: 64, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !21, line: 321, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!232, !19}
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !26, line: 186, baseType: !25)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !34, file: !21, line: 357, baseType: !147, size: 64, align: 64, offset: 1024)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !34, file: !21, line: 358, baseType: !128, size: 64, align: 64, offset: 1088)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !34, file: !21, line: 359, baseType: !236, size: 64, align: 64, offset: 1152)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !21, line: 317, baseType: !139)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !34, file: !21, line: 360, baseType: !238, size: 64, align: 64, offset: 1216)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !21, line: 319, baseType: !224)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !34, file: !21, line: 363, baseType: !240, size: 64, align: 64, offset: 1280)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !21, line: 304, baseType: !242)
!242 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 301, size: 128, align: 64, elements: !243)
!243 = !{!244, !265}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !242, file: !21, line: 302, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !21, line: 193, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!58, !19, !249, !58}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !21, line: 191, baseType: !251)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !21, line: 178, size: 640, align: 64, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260, !262, !263, !264}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !251, file: !21, line: 179, baseType: !18, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !251, file: !21, line: 180, baseType: !19, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !251, file: !21, line: 181, baseType: !25, size: 64, align: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !251, file: !21, line: 182, baseType: !25, size: 64, align: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !251, file: !21, line: 184, baseType: !58, size: 32, align: 32, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !251, file: !21, line: 185, baseType: !58, size: 32, align: 32, offset: 288)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !251, file: !21, line: 186, baseType: !66, size: 64, align: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !251, file: !21, line: 187, baseType: !261, size: 64, align: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !251, file: !21, line: 188, baseType: !261, size: 64, align: 64, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !251, file: !21, line: 189, baseType: !261, size: 64, align: 64, offset: 512)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !251, file: !21, line: 190, baseType: !18, size: 64, align: 64, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !242, file: !21, line: 303, baseType: !266, size: 64, align: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !21, line: 194, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !19, !249}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !34, file: !21, line: 366, baseType: !110, size: 64, align: 64, offset: 1344)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !34, file: !21, line: 368, baseType: !43, size: 64, align: 64, offset: 1408)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !34, file: !21, line: 372, baseType: !273, size: 64, align: 64, offset: 1472)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !21, line: 233, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!58, !19, !277, !18}
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !21, line: 232, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!58, !19, !18}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !34, file: !21, line: 375, baseType: !156, size: 64, align: 64, offset: 1536)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !34, file: !21, line: 379, baseType: !283, size: 64, align: 64, offset: 1600)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !21, line: 322, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!19, !19, !19, !58}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !34, file: !21, line: 382, baseType: !25, size: 64, align: 64, offset: 1664)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !34, file: !21, line: 385, baseType: !289, size: 64, align: 64, offset: 1728)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !21, line: 323, baseType: !129)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !34, file: !21, line: 386, baseType: !291, size: 64, align: 64, offset: 1792)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !21, line: 324, baseType: !129)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !34, file: !21, line: 389, baseType: !293, size: 64, align: 64, offset: 1856)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !295, line: 40, size: 256, align: 64, elements: !296)
!295 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!296 = !{!297, !298, !300, !301}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !294, file: !295, line: 41, baseType: !43, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !294, file: !295, line: 42, baseType: !299, size: 64, align: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !295, line: 18, baseType: !139)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !294, file: !295, line: 43, baseType: !58, size: 32, align: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !294, file: !295, line: 45, baseType: !43, size: 64, align: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !34, file: !21, line: 390, baseType: !303, size: 64, align: 64, offset: 1920)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !305, line: 18, size: 320, align: 64, elements: !306)
!305 = !DIFile(filename: "./Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!306 = !{!307, !308, !309, !310, !311}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !304, file: !305, line: 19, baseType: !66, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !304, file: !305, line: 20, baseType: !58, size: 32, align: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !304, file: !305, line: 21, baseType: !25, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !304, file: !305, line: 22, baseType: !58, size: 32, align: 32, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !304, file: !305, line: 23, baseType: !66, size: 64, align: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !34, file: !21, line: 391, baseType: !313, size: 64, align: 64, offset: 1984)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !315, line: 11, size: 320, align: 64, elements: !316)
!315 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!316 = !{!317, !318, !323, !328, !329}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !314, file: !315, line: 12, baseType: !66, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !314, file: !315, line: 13, baseType: !319, size: 64, align: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !315, line: 8, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!19, !19, !18}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !314, file: !315, line: 14, baseType: !324, size: 64, align: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !315, line: 9, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!58, !19, !19, !18}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !314, file: !315, line: 15, baseType: !66, size: 64, align: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !314, file: !315, line: 16, baseType: !18, size: 64, align: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !34, file: !21, line: 392, baseType: !33, size: 64, align: 64, offset: 2048)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !34, file: !21, line: 393, baseType: !19, size: 64, align: 64, offset: 2112)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !34, file: !21, line: 394, baseType: !333, size: 64, align: 64, offset: 2176)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !21, line: 325, baseType: !148)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !34, file: !21, line: 395, baseType: !335, size: 64, align: 64, offset: 2240)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !21, line: 326, baseType: !224)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !34, file: !21, line: 396, baseType: !25, size: 64, align: 64, offset: 2304)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !34, file: !21, line: 397, baseType: !338, size: 64, align: 64, offset: 2368)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !21, line: 327, baseType: !224)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !34, file: !21, line: 398, baseType: !340, size: 64, align: 64, offset: 2432)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !21, line: 329, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!19, !33, !25}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !34, file: !21, line: 399, baseType: !345, size: 64, align: 64, offset: 2496)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !21, line: 328, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!19, !33, !19, !19}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !34, file: !21, line: 400, baseType: !350, size: 64, align: 64, offset: 2560)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !21, line: 307, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !18}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !34, file: !21, line: 401, baseType: !156, size: 64, align: 64, offset: 2624)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !34, file: !21, line: 402, baseType: !19, size: 64, align: 64, offset: 2688)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !34, file: !21, line: 403, baseType: !19, size: 64, align: 64, offset: 2752)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !34, file: !21, line: 404, baseType: !19, size: 64, align: 64, offset: 2816)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !34, file: !21, line: 405, baseType: !19, size: 64, align: 64, offset: 2880)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !34, file: !21, line: 406, baseType: !19, size: 64, align: 64, offset: 2944)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !34, file: !21, line: 407, baseType: !49, size: 64, align: 64, offset: 3008)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !34, file: !21, line: 410, baseType: !362, size: 32, align: 32, offset: 3072)
!362 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !34, file: !21, line: 412, baseType: !49, size: 64, align: 64, offset: 3136)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCArgObject", file: !367, line: 14, baseType: !368)
!367 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_ctypes/ctypes.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "tagPyCArgObject", file: !367, line: 296, size: 512, align: 128, elements: !369)
!369 = !{!370, !371, !382, !383, !401, !402}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !368, file: !367, line: 297, baseType: !20, size: 128, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pffi_type", scope: !368, file: !367, line: 298, baseType: !372, size: 64, align: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "ffi_type", file: !12, line: 118, baseType: !374)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ffi_type", file: !12, line: 112, size: 192, align: 64, elements: !375)
!375 = !{!376, !377, !378, !379}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !374, file: !12, line: 114, baseType: !108, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !374, file: !12, line: 115, baseType: !91, size: 16, align: 16, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !374, file: !12, line: 116, baseType: !91, size: 16, align: 16, offset: 80)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !374, file: !12, line: 117, baseType: !380, size: 64, align: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !368, file: !367, line: 299, baseType: !45, size: 8, align: 8, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !368, file: !367, line: 313, baseType: !384, size: 128, align: 128, offset: 256)
!384 = !DICompositeType(tag: DW_TAG_union_type, scope: !368, file: !367, line: 300, size: 128, align: 128, elements: !385)
!385 = !{!386, !387, !388, !390, !391, !392, !394, !396, !398, !400}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !384, file: !367, line: 301, baseType: !45, size: 8, align: 8)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !384, file: !367, line: 302, baseType: !45, size: 8, align: 8)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !384, file: !367, line: 303, baseType: !389, size: 16, align: 16)
!389 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !384, file: !367, line: 304, baseType: !58, size: 32, align: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !384, file: !367, line: 305, baseType: !31, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !384, file: !367, line: 307, baseType: !393, size: 64, align: 64)
!393 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !384, file: !367, line: 309, baseType: !395, size: 128, align: 128)
!395 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !384, file: !367, line: 310, baseType: !397, size: 64, align: 64)
!397 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !384, file: !367, line: 311, baseType: !399, size: 32, align: 32)
!399 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !384, file: !367, line: 312, baseType: !18, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !368, file: !367, line: 314, baseType: !19, size: 64, align: 64, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !368, file: !367, line: 315, baseType: !25, size: 64, align: 64, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "argument", file: !406, line: 603, size: 256, align: 128, elements: !407)
!406 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_ctypes/callproc.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!407 = !{!408, !409, !410}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ffi_type", scope: !405, file: !406, line: 604, baseType: !372, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "keep", scope: !405, file: !406, line: 605, baseType: !19, size: 64, align: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !405, file: !406, line: 606, baseType: !411, size: 128, align: 128, offset: 128)
!411 = !DICompositeType(tag: DW_TAG_union_type, name: "result", file: !406, line: 588, size: 128, align: 128, elements: !412)
!412 = !{!413, !414, !415, !416, !417, !418, !419, !420, !421, !422}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !411, file: !406, line: 589, baseType: !45, size: 8, align: 8)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !411, file: !406, line: 590, baseType: !45, size: 8, align: 8)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !411, file: !406, line: 591, baseType: !389, size: 16, align: 16)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !411, file: !406, line: 592, baseType: !58, size: 32, align: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !411, file: !406, line: 593, baseType: !31, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !411, file: !406, line: 595, baseType: !393, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !411, file: !406, line: 597, baseType: !395, size: 128, align: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !411, file: !406, line: 598, baseType: !397, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !411, file: !406, line: 599, baseType: !399, size: 32, align: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !411, file: !406, line: 600, baseType: !18, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !425, line: 33, baseType: !426)
!425 = !DIFile(filename: "./Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!426 = !DICompositeType(tag: DW_TAG_structure_type, file: !425, line: 25, size: 256, align: 64, elements: !427)
!427 = !{!428, !429}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !426, file: !425, line: 26, baseType: !37, size: 192, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !426, file: !425, line: 27, baseType: !430, size: 64, align: 64, offset: 192)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 64, align: 64, elements: !96)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "CDataObject", file: !367, line: 15, baseType: !435)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "tagCDataObject", file: !367, line: 46, size: 768, align: 128, elements: !436)
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444, !445}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !435, file: !367, line: 47, baseType: !20, size: 128, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "b_ptr", scope: !435, file: !367, line: 48, baseType: !66, size: 64, align: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "b_needsfree", scope: !435, file: !367, line: 49, baseType: !58, size: 32, align: 32, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "b_base", scope: !435, file: !367, line: 50, baseType: !433, size: 64, align: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "b_size", scope: !435, file: !367, line: 51, baseType: !25, size: 64, align: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "b_length", scope: !435, file: !367, line: 52, baseType: !25, size: 64, align: 64, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "b_index", scope: !435, file: !367, line: 53, baseType: !25, size: 64, align: 64, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "b_objects", scope: !435, file: !367, line: 55, baseType: !19, size: 64, align: 64, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "b_value", scope: !435, file: !367, line: 56, baseType: !446, size: 128, align: 128, offset: 640)
!446 = !DICompositeType(tag: DW_TAG_union_type, name: "value", file: !367, line: 27, size: 128, align: 128, elements: !447)
!447 = !{!448, !452, !453, !454, !455, !456, !457, !458}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !446, file: !367, line: 28, baseType: !449, size: 128, align: 8)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 128, align: 8, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 16)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !446, file: !367, line: 29, baseType: !389, size: 16, align: 16)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !446, file: !367, line: 30, baseType: !58, size: 32, align: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !446, file: !367, line: 31, baseType: !31, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !446, file: !367, line: 32, baseType: !399, size: 32, align: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !446, file: !367, line: 33, baseType: !397, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ll", scope: !446, file: !367, line: 35, baseType: !393, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !446, file: !367, line: 37, baseType: !395, size: 128, align: 128)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !21, line: 422, baseType: !34)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !463, line: 41, baseType: !464)
!463 = !DIFile(filename: "./Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!464 = !DICompositeType(tag: DW_TAG_structure_type, file: !463, line: 31, size: 320, align: 64, elements: !465)
!465 = !{!466, !467, !468}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !464, file: !463, line: 32, baseType: !37, size: 192, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !464, file: !463, line: 33, baseType: !232, size: 64, align: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !464, file: !463, line: 34, baseType: !95, size: 8, align: 8, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyByteArrayObject", file: !471, line: 30, baseType: !472)
!471 = !DIFile(filename: "./Include/bytearrayobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!472 = !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 23, size: 448, align: 64, elements: !473)
!473 = !{!474, !475, !476, !477, !478}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !472, file: !471, line: 24, baseType: !37, size: 192, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ob_alloc", scope: !472, file: !471, line: 25, baseType: !25, size: 64, align: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ob_bytes", scope: !472, file: !471, line: 26, baseType: !66, size: 64, align: 64, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ob_start", scope: !472, file: !471, line: 27, baseType: !66, size: 64, align: 64, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ob_exports", scope: !472, file: !471, line: 29, baseType: !58, size: 32, align: 32, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "PPROC", file: !367, line: 270, baseType: !480)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!58}
!483 = !{!484, !499, !504, !555, !600, !639, !643, !653, !662, !683, !778, !796, !800, !810, !814, !825, !844, !852, !866, !877, !889, !906, !911, !917, !924, !929, !934, !942, !946, !953, !960, !965, !969, !973}
!484 = !DISubprogram(name: "_ctypes_get_errobj", scope: !406, file: !406, line: 130, type: !485, isLocal: false, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32**)* @_ctypes_get_errobj, variables: !488)
!485 = !DISubroutineType(types: !486)
!486 = !{!19, !487}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!488 = !{!489, !490, !491, !492, !495}
!489 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pspace", arg: 1, scope: !484, file: !406, line: 130, type: !487)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !484, file: !406, line: 132, type: !19)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errobj", scope: !484, file: !406, line: 133, type: !19)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "space", scope: !493, file: !406, line: 155, type: !18)
!493 = distinct !DILexicalBlock(scope: !494, file: !406, line: 154, column: 10)
!494 = distinct !DILexicalBlock(scope: !484, file: !406, line: 146, column: 9)
!495 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !496, file: !406, line: 164, type: !19)
!496 = distinct !DILexicalBlock(scope: !497, file: !406, line: 164, column: 16)
!497 = distinct !DILexicalBlock(scope: !498, file: !406, line: 163, column: 43)
!498 = distinct !DILexicalBlock(scope: !493, file: !406, line: 162, column: 13)
!499 = !DISubprogram(name: "PyCArgObject_new", scope: !406, file: !406, line: 429, type: !500, isLocal: false, isDefinition: true, scopeLine: 430, flags: DIFlagPrototyped, isOptimized: true, function: %struct.tagPyCArgObject* ()* @PyCArgObject_new, variables: !502)
!500 = !DISubroutineType(types: !501)
!501 = !{!365}
!502 = !{!503}
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !499, file: !406, line: 431, type: !365)
!504 = !DISubprogram(name: "_ctypes_get_ffi_type", scope: !406, file: !406, line: 707, type: !505, isLocal: false, isDefinition: true, scopeLine: 708, flags: DIFlagPrototyped, isOptimized: true, function: %struct._ffi_type* (%struct._object*)* @_ctypes_get_ffi_type, variables: !507)
!505 = !DISubroutineType(types: !506)
!506 = !{!372, !19}
!507 = !{!508, !509}
!508 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !504, file: !406, line: 707, type: !19)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !504, file: !406, line: 709, type: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "StgDictObject", file: !367, line: 220, baseType: !512)
!512 = !DICompositeType(tag: DW_TAG_structure_type, file: !367, line: 187, size: 1472, align: 64, elements: !513)
!513 = !{!514, !527, !528, !529, !530, !531, !532, !537, !542, !547, !548, !549, !550, !551, !552, !553, !554}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !512, file: !367, line: 188, baseType: !515, size: 320, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictObject", file: !516, line: 28, baseType: !517)
!516 = !DIFile(filename: "./Include/dictobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!517 = !DICompositeType(tag: DW_TAG_structure_type, file: !516, line: 23, size: 320, align: 64, elements: !518)
!518 = !{!519, !520, !521, !525}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !517, file: !516, line: 24, baseType: !20, size: 128, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ma_used", scope: !517, file: !516, line: 25, baseType: !25, size: 64, align: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ma_keys", scope: !517, file: !516, line: 26, baseType: !522, size: 64, align: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64, align: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictKeysObject", file: !516, line: 18, baseType: !524)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "_dictkeysobject", file: !21, line: 461, flags: DIFlagFwdDecl)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ma_values", scope: !517, file: !516, line: 27, baseType: !526, size: 64, align: 64, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !512, file: !367, line: 197, baseType: !25, size: 64, align: 64, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !512, file: !367, line: 198, baseType: !25, size: 64, align: 64, offset: 384)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !512, file: !367, line: 199, baseType: !25, size: 64, align: 64, offset: 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ffi_type_pointer", scope: !512, file: !367, line: 200, baseType: !373, size: 192, align: 64, offset: 512)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "proto", scope: !512, file: !367, line: 201, baseType: !19, size: 64, align: 64, offset: 704)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "setfunc", scope: !512, file: !367, line: 202, baseType: !533, size: 64, align: 64, offset: 768)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "SETFUNC", file: !367, line: 17, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!19, !18, !19, !25}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "getfunc", scope: !512, file: !367, line: 203, baseType: !538, size: 64, align: 64, offset: 832)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "GETFUNC", file: !367, line: 16, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!19, !18, !25}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "paramfunc", scope: !512, file: !367, line: 204, baseType: !543, size: 64, align: 64, offset: 896)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "PARAMFUNC", file: !367, line: 18, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!365, !433}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "argtypes", scope: !512, file: !367, line: 207, baseType: !19, size: 64, align: 64, offset: 960)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "converters", scope: !512, file: !367, line: 208, baseType: !19, size: 64, align: 64, offset: 1024)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "restype", scope: !512, file: !367, line: 209, baseType: !19, size: 64, align: 64, offset: 1088)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "checker", scope: !512, file: !367, line: 210, baseType: !19, size: 64, align: 64, offset: 1152)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !512, file: !367, line: 211, baseType: !58, size: 32, align: 32, offset: 1216)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !512, file: !367, line: 214, baseType: !66, size: 64, align: 64, offset: 1280)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !512, file: !367, line: 215, baseType: !58, size: 32, align: 32, offset: 1344)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !512, file: !367, line: 216, baseType: !261, size: 64, align: 64, offset: 1408)
!555 = !DISubprogram(name: "_ctypes_extend_error", scope: !406, file: !406, line: 931, type: !556, isLocal: false, isDefinition: true, scopeLine: 932, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, i8*, ...)* @_ctypes_extend_error, variables: !558)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !19, !66, null}
!558 = !{!559, !560, !561, !574, !575, !576, !577, !578, !579, !580, !582, !585, !587, !590, !592, !595, !597}
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc_class", arg: 1, scope: !555, file: !406, line: 931, type: !19)
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt", arg: 2, scope: !555, file: !406, line: 931, type: !66)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vargs", scope: !555, file: !406, line: 933, type: !562)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !28, line: 79, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !564, line: 50, baseType: !565)
!564 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stdarg.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 933, baseType: !566)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 192, align: 64, elements: !96)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "__va_list_tag", file: !1, line: 933, baseType: !568)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 933, size: 192, align: 64, elements: !569)
!569 = !{!570, !571, !572, !573}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !568, file: !1, line: 933, baseType: !362, size: 32, align: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !568, file: !1, line: 933, baseType: !362, size: 32, align: 32, offset: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !568, file: !1, line: 933, baseType: !18, size: 64, align: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !568, file: !1, line: 933, baseType: !18, size: 64, align: 64, offset: 128)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tp", scope: !555, file: !406, line: 934, type: !19)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !555, file: !406, line: 934, type: !19)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !555, file: !406, line: 934, type: !19)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !555, file: !406, line: 934, type: !19)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cls_str", scope: !555, file: !406, line: 934, type: !19)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msg_str", scope: !555, file: !406, line: 934, type: !19)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !581, file: !406, line: 963, type: !19)
!581 = distinct !DILexicalBlock(scope: !555, file: !406, line: 963, column: 8)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !583, file: !406, line: 963, type: !19)
!583 = distinct !DILexicalBlock(scope: !584, file: !406, line: 963, column: 94)
!584 = distinct !DILexicalBlock(scope: !581, file: !406, line: 963, column: 60)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !586, file: !406, line: 964, type: !19)
!586 = distinct !DILexicalBlock(scope: !555, file: !406, line: 964, column: 8)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !588, file: !406, line: 964, type: !19)
!588 = distinct !DILexicalBlock(scope: !589, file: !406, line: 964, column: 93)
!589 = distinct !DILexicalBlock(scope: !586, file: !406, line: 964, column: 59)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !591, file: !406, line: 965, type: !19)
!591 = distinct !DILexicalBlock(scope: !555, file: !406, line: 965, column: 8)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !593, file: !406, line: 965, type: !19)
!593 = distinct !DILexicalBlock(scope: !594, file: !406, line: 965, column: 94)
!594 = distinct !DILexicalBlock(scope: !591, file: !406, line: 965, column: 60)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !596, file: !406, line: 966, type: !19)
!596 = distinct !DILexicalBlock(scope: !555, file: !406, line: 966, column: 8)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !598, file: !406, line: 966, type: !19)
!598 = distinct !DILexicalBlock(scope: !599, file: !406, line: 966, column: 93)
!599 = distinct !DILexicalBlock(scope: !596, file: !406, line: 966, column: 59)
!600 = !DISubprogram(name: "_ctypes_callproc", scope: !406, file: !406, line: 1052, type: !601, isLocal: false, isDefinition: true, scopeLine: 1064, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32 ()*, %struct._object*, i32, %struct._object*, %struct._object*, %struct._object*)* @_ctypes_callproc, variables: !603)
!601 = !DISubroutineType(types: !602)
!602 = !{!19, !479, !19, !58, !19, !19, !19}
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !625, !626, !627, !630, !632, !636}
!604 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pProc", arg: 1, scope: !600, file: !406, line: 1052, type: !479)
!605 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argtuple", arg: 2, scope: !600, file: !406, line: 1053, type: !19)
!606 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 3, scope: !600, file: !406, line: 1058, type: !58)
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argtypes", arg: 4, scope: !600, file: !406, line: 1059, type: !19)
!608 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "restype", arg: 5, scope: !600, file: !406, line: 1062, type: !19)
!609 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "checker", arg: 6, scope: !600, file: !406, line: 1063, type: !19)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !600, file: !406, line: 1065, type: !25)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !600, file: !406, line: 1065, type: !25)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "argcount", scope: !600, file: !406, line: 1065, type: !25)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "argtype_count", scope: !600, file: !406, line: 1065, type: !25)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "resbuf", scope: !600, file: !406, line: 1066, type: !18)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !600, file: !406, line: 1067, type: !404)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pa", scope: !600, file: !406, line: 1067, type: !404)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atypes", scope: !600, file: !406, line: 1068, type: !432)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rtype", scope: !600, file: !406, line: 1069, type: !372)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "avalues", scope: !600, file: !406, line: 1070, type: !431)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !600, file: !406, line: 1071, type: !19)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "converter", scope: !622, file: !406, line: 1098, type: !19)
!622 = distinct !DILexicalBlock(scope: !623, file: !406, line: 1097, column: 35)
!623 = distinct !DILexicalBlock(scope: !624, file: !406, line: 1097, column: 5)
!624 = distinct !DILexicalBlock(scope: !600, file: !406, line: 1097, column: 5)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg", scope: !622, file: !406, line: 1099, type: !19)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !622, file: !406, line: 1100, type: !58)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !628, file: !406, line: 1108, type: !19)
!628 = distinct !DILexicalBlock(scope: !629, file: !406, line: 1107, column: 44)
!629 = distinct !DILexicalBlock(scope: !622, file: !406, line: 1107, column: 13)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !631, file: !406, line: 1117, type: !19)
!631 = distinct !DILexicalBlock(scope: !628, file: !406, line: 1117, column: 16)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !633, file: !406, line: 1192, type: !19)
!633 = distinct !DILexicalBlock(scope: !634, file: !406, line: 1192, column: 12)
!634 = distinct !DILexicalBlock(scope: !635, file: !406, line: 1191, column: 5)
!635 = distinct !DILexicalBlock(scope: !600, file: !406, line: 1191, column: 5)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !637, file: !406, line: 1192, type: !19)
!637 = distinct !DILexicalBlock(scope: !638, file: !406, line: 1192, column: 108)
!638 = distinct !DILexicalBlock(scope: !633, file: !406, line: 1192, column: 74)
!639 = !DISubprogram(name: "pymem_destructor", scope: !406, file: !406, line: 87, type: !51, isLocal: true, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @pymem_destructor, variables: !640)
!640 = !{!641, !642}
!641 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !639, file: !406, line: 87, type: !19)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !639, file: !406, line: 89, type: !18)
!643 = !DISubprogram(name: "PyCArg_dealloc", scope: !406, file: !406, line: 443, type: !644, isLocal: true, isDefinition: true, scopeLine: 444, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.tagPyCArgObject*)* @PyCArg_dealloc, variables: !646)
!644 = !DISubroutineType(types: !645)
!645 = !{null, !365}
!646 = !{!647, !648, !650}
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !643, file: !406, line: 443, type: !365)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !649, file: !406, line: 445, type: !19)
!649 = distinct !DILexicalBlock(scope: !643, file: !406, line: 445, column: 8)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !651, file: !406, line: 445, type: !19)
!651 = distinct !DILexicalBlock(scope: !652, file: !406, line: 445, column: 101)
!652 = distinct !DILexicalBlock(scope: !649, file: !406, line: 445, column: 67)
!653 = !DISubprogram(name: "PyCArg_repr", scope: !406, file: !406, line: 450, type: !654, isLocal: true, isDefinition: true, scopeLine: 451, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.tagPyCArgObject*)* @PyCArg_repr, variables: !656)
!654 = !DISubroutineType(types: !655)
!655 = !{!19, !365}
!656 = !{!657, !658}
!657 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !653, file: !406, line: 450, type: !365)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !653, file: !406, line: 452, type: !659)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 2048, align: 8, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 256)
!662 = !DISubprogram(name: "ConvParam", scope: !406, file: !406, line: 612, type: !663, isLocal: true, isDefinition: true, scopeLine: 613, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64, %struct.argument*)* @ConvParam, variables: !665)
!663 = !DISubroutineType(types: !664)
!664 = !{!58, !19, !25, !404}
!665 = !{!666, !667, !668, !669, !670, !673, !676, !678, !681}
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !662, file: !406, line: 612, type: !19)
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 2, scope: !662, file: !406, line: 612, type: !25)
!668 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pa", arg: 3, scope: !662, file: !406, line: 612, type: !404)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !662, file: !406, line: 614, type: !510)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "carg", scope: !671, file: !406, line: 619, type: !365)
!671 = distinct !DILexicalBlock(scope: !672, file: !406, line: 618, column: 15)
!672 = distinct !DILexicalBlock(scope: !662, file: !406, line: 618, column: 9)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "carg", scope: !674, file: !406, line: 632, type: !365)
!674 = distinct !DILexicalBlock(scope: !675, file: !406, line: 631, column: 43)
!675 = distinct !DILexicalBlock(scope: !662, file: !406, line: 631, column: 9)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg", scope: !677, file: !406, line: 686, type: !19)
!677 = distinct !DILexicalBlock(scope: !662, file: !406, line: 685, column: 5)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !679, file: !406, line: 694, type: !58)
!679 = distinct !DILexicalBlock(scope: !680, file: !406, line: 693, column: 18)
!680 = distinct !DILexicalBlock(scope: !677, file: !406, line: 693, column: 13)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !682, file: !406, line: 696, type: !19)
!682 = distinct !DILexicalBlock(scope: !679, file: !406, line: 696, column: 16)
!683 = !DISubprogram(name: "_call_function_pointer", scope: !406, file: !406, line: 742, type: !684, isLocal: true, isDefinition: true, scopeLine: 749, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32 ()*, i8**, %struct._ffi_type**, %struct._ffi_type*, i8*, i32)* @_call_function_pointer, variables: !686)
!684 = !DISubroutineType(types: !685)
!685 = !{!58, !58, !479, !431, !432, !372, !18, !58}
!686 = !{!687, !688, !689, !690, !691, !692, !693, !694, !753, !754, !755, !766, !767, !770, !773, !775}
!687 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 1, scope: !683, file: !406, line: 742, type: !58)
!688 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pProc", arg: 2, scope: !683, file: !406, line: 743, type: !479)
!689 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "avalues", arg: 3, scope: !683, file: !406, line: 744, type: !431)
!690 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atypes", arg: 4, scope: !683, file: !406, line: 745, type: !432)
!691 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "restype", arg: 5, scope: !683, file: !406, line: 746, type: !372)
!692 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "resmem", arg: 6, scope: !683, file: !406, line: 747, type: !18)
!693 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argcount", arg: 7, scope: !683, file: !406, line: 748, type: !58)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !683, file: !406, line: 751, type: !695)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !697, line: 139, baseType: !698)
!697 = !DIFile(filename: "./Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !697, line: 69, size: 1536, align: 64, elements: !699)
!699 = !{!700, !702, !703, !723, !726, !727, !728, !729, !730, !731, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !698, file: !697, line: 72, baseType: !701, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64, align: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !698, file: !697, line: 73, baseType: !701, size: 64, align: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !698, file: !697, line: 74, baseType: !704, size: 64, align: 64, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64, align: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !697, line: 44, baseType: !706)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !697, line: 19, size: 832, align: 64, elements: !707)
!707 = !{!708, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !706, file: !697, line: 21, baseType: !709, size: 64, align: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64, align: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !706, file: !697, line: 22, baseType: !701, size: 64, align: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !706, file: !697, line: 24, baseType: !19, size: 64, align: 64, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !706, file: !697, line: 25, baseType: !19, size: 64, align: 64, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !706, file: !697, line: 26, baseType: !19, size: 64, align: 64, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !706, file: !697, line: 27, baseType: !19, size: 64, align: 64, offset: 320)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !706, file: !697, line: 28, baseType: !19, size: 64, align: 64, offset: 384)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !706, file: !697, line: 30, baseType: !19, size: 64, align: 64, offset: 448)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !706, file: !697, line: 31, baseType: !19, size: 64, align: 64, offset: 512)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !706, file: !697, line: 32, baseType: !19, size: 64, align: 64, offset: 576)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !706, file: !697, line: 33, baseType: !58, size: 32, align: 32, offset: 640)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !706, file: !697, line: 34, baseType: !58, size: 32, align: 32, offset: 672)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !706, file: !697, line: 37, baseType: !58, size: 32, align: 32, offset: 704)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !706, file: !697, line: 43, baseType: !19, size: 64, align: 64, offset: 768)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !698, file: !697, line: 76, baseType: !724, size: 64, align: 64, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64, align: 64)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !697, line: 50, flags: DIFlagFwdDecl)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !698, file: !697, line: 77, baseType: !58, size: 32, align: 32, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !698, file: !697, line: 78, baseType: !45, size: 8, align: 8, offset: 288)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !698, file: !697, line: 80, baseType: !45, size: 8, align: 8, offset: 296)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !698, file: !697, line: 85, baseType: !58, size: 32, align: 32, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !698, file: !697, line: 86, baseType: !58, size: 32, align: 32, offset: 352)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !698, file: !697, line: 88, baseType: !732, size: 64, align: 64, offset: 384)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !697, line: 54, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64, align: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!58, !19, !724, !58, !19}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !698, file: !697, line: 89, baseType: !732, size: 64, align: 64, offset: 448)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !698, file: !697, line: 90, baseType: !19, size: 64, align: 64, offset: 512)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !698, file: !697, line: 91, baseType: !19, size: 64, align: 64, offset: 576)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !698, file: !697, line: 93, baseType: !19, size: 64, align: 64, offset: 640)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !698, file: !697, line: 94, baseType: !19, size: 64, align: 64, offset: 704)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !698, file: !697, line: 95, baseType: !19, size: 64, align: 64, offset: 768)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !698, file: !697, line: 97, baseType: !19, size: 64, align: 64, offset: 832)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !698, file: !697, line: 98, baseType: !19, size: 64, align: 64, offset: 896)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !698, file: !697, line: 99, baseType: !19, size: 64, align: 64, offset: 960)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !698, file: !697, line: 101, baseType: !19, size: 64, align: 64, offset: 1024)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !698, file: !697, line: 103, baseType: !58, size: 32, align: 32, offset: 1088)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !698, file: !697, line: 105, baseType: !19, size: 64, align: 64, offset: 1152)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !698, file: !697, line: 106, baseType: !31, size: 64, align: 64, offset: 1216)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !698, file: !697, line: 108, baseType: !58, size: 32, align: 32, offset: 1280)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !698, file: !697, line: 109, baseType: !19, size: 64, align: 64, offset: 1344)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !698, file: !697, line: 134, baseType: !351, size: 64, align: 64, offset: 1408)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !698, file: !697, line: 135, baseType: !18, size: 64, align: 64, offset: 1472)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error_object", scope: !683, file: !406, line: 753, type: !19)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "space", scope: !683, file: !406, line: 754, type: !364)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cif", scope: !683, file: !406, line: 755, type: !756)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "ffi_cif", file: !12, line: 222, baseType: !757)
!757 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 212, size: 256, align: 64, elements: !758)
!758 = !{!759, !761, !762, !763, !764, !765}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "abi", scope: !757, file: !12, line: 213, baseType: !760, size: 32, align: 32)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "ffi_abi", file: !4, line: 108, baseType: !3)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !757, file: !12, line: 214, baseType: !362, size: 32, align: 32, offset: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !757, file: !12, line: 215, baseType: !432, size: 64, align: 64, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "rtype", scope: !757, file: !12, line: 216, baseType: !372, size: 64, align: 64, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !757, file: !12, line: 217, baseType: !362, size: 32, align: 32, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !757, file: !12, line: 218, baseType: !362, size: 32, align: 32, offset: 224)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cc", scope: !683, file: !406, line: 756, type: !58)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !768, file: !406, line: 796, type: !58)
!768 = distinct !DILexicalBlock(scope: !769, file: !406, line: 795, column: 22)
!769 = distinct !DILexicalBlock(scope: !683, file: !406, line: 795, column: 9)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !771, file: !406, line: 827, type: !58)
!771 = distinct !DILexicalBlock(scope: !772, file: !406, line: 826, column: 22)
!772 = distinct !DILexicalBlock(scope: !683, file: !406, line: 826, column: 9)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !774, file: !406, line: 835, type: !19)
!774 = distinct !DILexicalBlock(scope: !683, file: !406, line: 835, column: 8)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !776, file: !406, line: 835, type: !19)
!776 = distinct !DILexicalBlock(scope: !777, file: !406, line: 835, column: 104)
!777 = distinct !DILexicalBlock(scope: !774, file: !406, line: 835, column: 70)
!778 = !DISubprogram(name: "GetResult", scope: !406, file: !406, line: 888, type: !779, isLocal: true, isDefinition: true, scopeLine: 889, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*, %struct._object*)* @GetResult, variables: !781)
!779 = !DISubroutineType(types: !780)
!780 = !{!19, !19, !18, !19}
!781 = !{!782, !783, !784, !785, !786, !787, !788, !794}
!782 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "restype", arg: 1, scope: !778, file: !406, line: 888, type: !19)
!783 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "result", arg: 2, scope: !778, file: !406, line: 888, type: !18)
!784 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "checker", arg: 3, scope: !778, file: !406, line: 888, type: !19)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !778, file: !406, line: 890, type: !510)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !778, file: !406, line: 891, type: !19)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !778, file: !406, line: 891, type: !19)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !789, file: !406, line: 912, type: !19)
!789 = distinct !DILexicalBlock(scope: !790, file: !406, line: 912, column: 16)
!790 = distinct !DILexicalBlock(scope: !791, file: !406, line: 911, column: 67)
!791 = distinct !DILexicalBlock(scope: !792, file: !406, line: 911, column: 13)
!792 = distinct !DILexicalBlock(scope: !793, file: !406, line: 905, column: 61)
!793 = distinct !DILexicalBlock(scope: !778, file: !406, line: 905, column: 9)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !795, file: !406, line: 923, type: !19)
!795 = distinct !DILexicalBlock(scope: !778, file: !406, line: 923, column: 8)
!796 = !DISubprogram(name: "get_errno", scope: !406, file: !406, line: 205, type: !140, isLocal: true, isDefinition: true, scopeLine: 206, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @get_errno, variables: !797)
!797 = !{!798, !799}
!798 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !796, file: !406, line: 205, type: !19)
!799 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !796, file: !406, line: 205, type: !19)
!800 = !DISubprogram(name: "get_error_internal", scope: !406, file: !406, line: 173, type: !285, isLocal: true, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @get_error_internal, variables: !801)
!801 = !{!802, !803, !804, !805, !806, !807, !808}
!802 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !800, file: !406, line: 173, type: !19)
!803 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !800, file: !406, line: 173, type: !19)
!804 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !800, file: !406, line: 173, type: !58)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "space", scope: !800, file: !406, line: 175, type: !364)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errobj", scope: !800, file: !406, line: 176, type: !19)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !800, file: !406, line: 177, type: !19)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !809, file: !406, line: 182, type: !19)
!809 = distinct !DILexicalBlock(scope: !800, file: !406, line: 182, column: 8)
!810 = !DISubprogram(name: "set_errno", scope: !406, file: !406, line: 211, type: !140, isLocal: true, isDefinition: true, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @set_errno, variables: !811)
!811 = !{!812, !813}
!812 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !810, file: !406, line: 211, type: !19)
!813 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !810, file: !406, line: 211, type: !19)
!814 = !DISubprogram(name: "set_error_internal", scope: !406, file: !406, line: 187, type: !285, isLocal: true, isDefinition: true, scopeLine: 188, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @set_error_internal, variables: !815)
!815 = !{!816, !817, !818, !819, !820, !821, !822, !823}
!816 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !814, file: !406, line: 187, type: !19)
!817 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !814, file: !406, line: 187, type: !19)
!818 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !814, file: !406, line: 187, type: !58)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_errno", scope: !814, file: !406, line: 189, type: !58)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_errno", scope: !814, file: !406, line: 189, type: !58)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errobj", scope: !814, file: !406, line: 190, type: !19)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "space", scope: !814, file: !406, line: 191, type: !364)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !824, file: !406, line: 200, type: !19)
!824 = distinct !DILexicalBlock(scope: !814, file: !406, line: 200, column: 8)
!825 = !DISubprogram(name: "POINTER", scope: !406, file: !406, line: 1661, type: !140, isLocal: true, isDefinition: true, scopeLine: 1662, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @POINTER, variables: !826)
!826 = !{!827, !828, !829, !830, !831, !832, !833, !836, !840, !842}
!827 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !825, file: !406, line: 1661, type: !19)
!828 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cls", arg: 2, scope: !825, file: !406, line: 1661, type: !19)
!829 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !825, file: !406, line: 1663, type: !19)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typ", scope: !825, file: !406, line: 1664, type: !459)
!831 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !825, file: !406, line: 1665, type: !19)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !825, file: !406, line: 1666, type: !66)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !834, file: !406, line: 1674, type: !66)
!834 = distinct !DILexicalBlock(scope: !835, file: !406, line: 1673, column: 61)
!835 = distinct !DILexicalBlock(scope: !825, file: !406, line: 1673, column: 9)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !837, file: !406, line: 1702, type: !19)
!837 = distinct !DILexicalBlock(scope: !838, file: !406, line: 1702, column: 12)
!838 = distinct !DILexicalBlock(scope: !839, file: !406, line: 1701, column: 67)
!839 = distinct !DILexicalBlock(scope: !825, file: !406, line: 1701, column: 9)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !841, file: !406, line: 1703, type: !19)
!841 = distinct !DILexicalBlock(scope: !838, file: !406, line: 1703, column: 12)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !843, file: !406, line: 1706, type: !19)
!843 = distinct !DILexicalBlock(scope: !825, file: !406, line: 1706, column: 8)
!844 = !DISubprogram(name: "pointer", scope: !406, file: !406, line: 1711, type: !140, isLocal: true, isDefinition: true, scopeLine: 1712, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @pointer, variables: !845)
!845 = !{!846, !847, !848, !849, !850}
!846 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !844, file: !406, line: 1711, type: !19)
!847 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !844, file: !406, line: 1711, type: !19)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !844, file: !406, line: 1713, type: !19)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typ", scope: !844, file: !406, line: 1714, type: !19)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !851, file: !406, line: 1723, type: !19)
!851 = distinct !DILexicalBlock(scope: !844, file: !406, line: 1723, column: 8)
!852 = !DISubprogram(name: "unpickle", scope: !406, file: !406, line: 1637, type: !140, isLocal: true, isDefinition: true, scopeLine: 1638, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @unpickle, variables: !853)
!853 = !{!854, !855, !856, !857, !858, !859, !860, !864}
!854 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !852, file: !406, line: 1637, type: !19)
!855 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !852, file: !406, line: 1637, type: !19)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typ", scope: !852, file: !406, line: 1639, type: !19)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !852, file: !406, line: 1640, type: !19)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !852, file: !406, line: 1641, type: !19)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !852, file: !406, line: 1642, type: !19)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !861, file: !406, line: 1653, type: !19)
!861 = distinct !DILexicalBlock(scope: !862, file: !406, line: 1653, column: 12)
!862 = distinct !DILexicalBlock(scope: !863, file: !406, line: 1652, column: 28)
!863 = distinct !DILexicalBlock(scope: !852, file: !406, line: 1652, column: 9)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !865, file: !406, line: 1656, type: !19)
!865 = distinct !DILexicalBlock(scope: !852, file: !406, line: 1656, column: 8)
!866 = !DISubprogram(name: "buffer_info", scope: !406, file: !406, line: 1728, type: !140, isLocal: true, isDefinition: true, scopeLine: 1729, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @buffer_info, variables: !867)
!867 = !{!868, !869, !870, !871, !872, !873}
!868 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !866, file: !406, line: 1728, type: !19)
!869 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !866, file: !406, line: 1728, type: !19)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !866, file: !406, line: 1730, type: !510)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shape", scope: !866, file: !406, line: 1731, type: !19)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !866, file: !406, line: 1732, type: !25)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !874, file: !406, line: 1748, type: !19)
!874 = distinct !DILexicalBlock(scope: !875, file: !406, line: 1748, column: 12)
!875 = distinct !DILexicalBlock(scope: !876, file: !406, line: 1747, column: 27)
!876 = distinct !DILexicalBlock(scope: !866, file: !406, line: 1747, column: 9)
!877 = !DISubprogram(name: "resize", scope: !406, file: !406, line: 1581, type: !140, isLocal: true, isDefinition: true, scopeLine: 1582, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @resize, variables: !878)
!878 = !{!879, !880, !881, !882, !883, !884, !887}
!879 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !877, file: !406, line: 1581, type: !19)
!880 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !877, file: !406, line: 1581, type: !19)
!881 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !877, file: !406, line: 1583, type: !433)
!882 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !877, file: !406, line: 1584, type: !510)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !877, file: !406, line: 1585, type: !25)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !885, file: !406, line: 1617, type: !18)
!885 = distinct !DILexicalBlock(scope: !886, file: !406, line: 1614, column: 53)
!886 = distinct !DILexicalBlock(scope: !877, file: !406, line: 1614, column: 9)
!887 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !888, file: !406, line: 1625, type: !18)
!888 = distinct !DILexicalBlock(scope: !886, file: !406, line: 1624, column: 12)
!889 = !DISubprogram(name: "py_dl_open", scope: !406, file: !406, line: 1308, type: !140, isLocal: true, isDefinition: true, scopeLine: 1309, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @py_dl_open, variables: !890)
!890 = !{!891, !892, !893, !894, !895, !896, !897, !898, !900, !903}
!891 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !889, file: !406, line: 1308, type: !19)
!892 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !889, file: !406, line: 1308, type: !19)
!893 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !889, file: !406, line: 1310, type: !19)
!894 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name2", scope: !889, file: !406, line: 1310, type: !19)
!895 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name_str", scope: !889, file: !406, line: 1311, type: !66)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handle", scope: !889, file: !406, line: 1312, type: !18)
!897 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !889, file: !406, line: 1314, type: !58)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !899, file: !406, line: 1334, type: !19)
!899 = distinct !DILexicalBlock(scope: !889, file: !406, line: 1334, column: 8)
!900 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !901, file: !406, line: 1334, type: !19)
!901 = distinct !DILexicalBlock(scope: !902, file: !406, line: 1334, column: 97)
!902 = distinct !DILexicalBlock(scope: !899, file: !406, line: 1334, column: 63)
