; ModuleID = 'programs_new/Python-new/cmathmodule.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !13, subprograms: !362, globals: !608)
!1 = !DIFile(filename: "cmathmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "special_types", file: !4, line: 65, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/cmathmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10, !11, !12}
!6 = !DIEnumerator(name: "ST_NINF", value: 0)
!7 = !DIEnumerator(name: "ST_NEG", value: 1)
!8 = !DIEnumerator(name: "ST_NZERO", value: 2)
!9 = !DIEnumerator(name: "ST_PZERO", value: 3)
!10 = !DIEnumerator(name: "ST_POS", value: 4)
!11 = !DIEnumerator(name: "ST_PINF", value: 5)
!12 = !DIEnumerator(name: "ST_NAN", value: 6)
!13 = !{!14, !15, !23}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_complex", file: !17, line: 13, baseType: !18)
!17 = !DIFile(filename: "./Include/complexobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!18 = !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 10, size: 128, align: 64, elements: !19)
!19 = !{!20, !22}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !18, file: !17, line: 11, baseType: !21, size: 64, align: 64)
!21 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !18, file: !17, line: 12, baseType: !21, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !25, line: 114, baseType: !26)
!25 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!26 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 111, size: 192, align: 64, elements: !27)
!27 = !{!28, !361}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !26, file: !25, line: 112, baseType: !29, size: 128, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !25, line: 109, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !25, line: 105, size: 128, align: 64, elements: !31)
!31 = !{!32, !40}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !30, file: !25, line: 107, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !34, line: 177, baseType: !35)
!34 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !36, line: 102, baseType: !37)
!36 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !38, line: 181, baseType: !39)
!38 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!39 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !30, file: !25, line: 108, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !25, line: 334, size: 3200, align: 64, elements: !43)
!43 = !{!44, !45, !49, !50, !51, !57, !120, !125, !130, !131, !136, !188, !219, !231, !237, !238, !239, !241, !243, !274, !275, !276, !285, !286, !291, !292, !294, !296, !306, !309, !327, !328, !329, !331, !333, !334, !336, !341, !346, !351, !352, !353, !354, !355, !356, !357, !358, !360}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !42, file: !25, line: 335, baseType: !24, size: 192, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !42, file: !25, line: 336, baseType: !46, size: 64, align: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !42, file: !25, line: 337, baseType: !33, size: 64, align: 64, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !42, file: !25, line: 337, baseType: !33, size: 64, align: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !42, file: !25, line: 341, baseType: !52, size: 64, align: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !25, line: 308, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{null, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !42, file: !25, line: 342, baseType: !58, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !25, line: 314, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !56, !63, !62}
!62 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !36, line: 48, baseType: !65)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !66, line: 246, size: 1728, align: 64, elements: !67)
!66 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!67 = !{!68, !69, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !89, !90, !91, !92, !94, !96, !98, !102, !105, !107, !108, !109, !110, !111, !115, !116}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !65, file: !66, line: 247, baseType: !62, size: 32, align: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !65, file: !66, line: 252, baseType: !70, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !65, file: !66, line: 253, baseType: !70, size: 64, align: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !65, file: !66, line: 254, baseType: !70, size: 64, align: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !65, file: !66, line: 255, baseType: !70, size: 64, align: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !65, file: !66, line: 256, baseType: !70, size: 64, align: 64, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !65, file: !66, line: 257, baseType: !70, size: 64, align: 64, offset: 384)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !65, file: !66, line: 258, baseType: !70, size: 64, align: 64, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !65, file: !66, line: 259, baseType: !70, size: 64, align: 64, offset: 512)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !65, file: !66, line: 261, baseType: !70, size: 64, align: 64, offset: 576)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !65, file: !66, line: 262, baseType: !70, size: 64, align: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !65, file: !66, line: 263, baseType: !70, size: 64, align: 64, offset: 704)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !65, file: !66, line: 265, baseType: !82, size: 64, align: 64, offset: 768)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !66, line: 161, size: 192, align: 64, elements: !84)
!84 = !{!85, !86, !88}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !83, file: !66, line: 162, baseType: !82, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !83, file: !66, line: 163, baseType: !87, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !83, file: !66, line: 167, baseType: !62, size: 32, align: 32, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !65, file: !66, line: 267, baseType: !87, size: 64, align: 64, offset: 832)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !65, file: !66, line: 269, baseType: !62, size: 32, align: 32, offset: 896)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !65, file: !66, line: 273, baseType: !62, size: 32, align: 32, offset: 928)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !65, file: !66, line: 275, baseType: !93, size: 64, align: 64, offset: 960)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !38, line: 140, baseType: !39)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !65, file: !66, line: 279, baseType: !95, size: 16, align: 16, offset: 1024)
!95 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !65, file: !66, line: 280, baseType: !97, size: 8, align: 8, offset: 1040)
!97 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !65, file: !66, line: 281, baseType: !99, size: 8, align: 8, offset: 1048)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 1)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !65, file: !66, line: 285, baseType: !103, size: 64, align: 64, offset: 1088)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !66, line: 155, baseType: null)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !65, file: !66, line: 294, baseType: !106, size: 64, align: 64, offset: 1152)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !38, line: 141, baseType: !39)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !65, file: !66, line: 303, baseType: !14, size: 64, align: 64, offset: 1216)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !65, file: !66, line: 304, baseType: !14, size: 64, align: 64, offset: 1280)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !65, file: !66, line: 305, baseType: !14, size: 64, align: 64, offset: 1344)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !65, file: !66, line: 306, baseType: !14, size: 64, align: 64, offset: 1408)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !65, file: !66, line: 307, baseType: !112, size: 64, align: 64, offset: 1472)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !113, line: 62, baseType: !114)
!113 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!114 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !65, file: !66, line: 309, baseType: !62, size: 32, align: 32, offset: 1536)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !65, file: !66, line: 311, baseType: !117, size: 160, align: 8, offset: 1568)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 160, align: 8, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 20)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !42, file: !25, line: 343, baseType: !121, size: 64, align: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !25, line: 316, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!56, !56, !70}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !42, file: !25, line: 344, baseType: !126, size: 64, align: 64, offset: 576)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !25, line: 318, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!62, !56, !70, !56}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !42, file: !25, line: 345, baseType: !14, size: 64, align: 64, offset: 640)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !42, file: !25, line: 346, baseType: !132, size: 64, align: 64, offset: 704)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !25, line: 320, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!56, !56}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !42, file: !25, line: 350, baseType: !137, size: 64, align: 64, offset: 768)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !25, line: 278, baseType: !139)
!139 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 236, size: 2176, align: 64, elements: !140)
!140 = !{!141, !146, !147, !148, !149, !150, !155, !157, !158, !159, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !139, file: !25, line: 241, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !25, line: 166, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!56, !56, !56}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !139, file: !25, line: 242, baseType: !142, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !139, file: !25, line: 243, baseType: !142, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !139, file: !25, line: 244, baseType: !142, size: 64, align: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !139, file: !25, line: 245, baseType: !142, size: 64, align: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !139, file: !25, line: 246, baseType: !151, size: 64, align: 64, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !25, line: 167, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!56, !56, !56, !56}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !139, file: !25, line: 247, baseType: !156, size: 64, align: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !25, line: 165, baseType: !133)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !139, file: !25, line: 248, baseType: !156, size: 64, align: 64, offset: 448)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !139, file: !25, line: 249, baseType: !156, size: 64, align: 64, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !139, file: !25, line: 250, baseType: !160, size: 64, align: 64, offset: 576)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !25, line: 168, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!62, !56}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !139, file: !25, line: 251, baseType: !156, size: 64, align: 64, offset: 640)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !139, file: !25, line: 252, baseType: !142, size: 64, align: 64, offset: 704)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !139, file: !25, line: 253, baseType: !142, size: 64, align: 64, offset: 768)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !139, file: !25, line: 254, baseType: !142, size: 64, align: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !139, file: !25, line: 255, baseType: !142, size: 64, align: 64, offset: 896)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !139, file: !25, line: 256, baseType: !142, size: 64, align: 64, offset: 960)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !139, file: !25, line: 257, baseType: !156, size: 64, align: 64, offset: 1024)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !139, file: !25, line: 258, baseType: !14, size: 64, align: 64, offset: 1088)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !139, file: !25, line: 259, baseType: !156, size: 64, align: 64, offset: 1152)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !139, file: !25, line: 261, baseType: !142, size: 64, align: 64, offset: 1216)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !139, file: !25, line: 262, baseType: !142, size: 64, align: 64, offset: 1280)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !139, file: !25, line: 263, baseType: !142, size: 64, align: 64, offset: 1344)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !139, file: !25, line: 264, baseType: !142, size: 64, align: 64, offset: 1408)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !139, file: !25, line: 265, baseType: !151, size: 64, align: 64, offset: 1472)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !139, file: !25, line: 266, baseType: !142, size: 64, align: 64, offset: 1536)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !139, file: !25, line: 267, baseType: !142, size: 64, align: 64, offset: 1600)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !139, file: !25, line: 268, baseType: !142, size: 64, align: 64, offset: 1664)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !139, file: !25, line: 269, baseType: !142, size: 64, align: 64, offset: 1728)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !139, file: !25, line: 270, baseType: !142, size: 64, align: 64, offset: 1792)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !139, file: !25, line: 272, baseType: !142, size: 64, align: 64, offset: 1856)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !139, file: !25, line: 273, baseType: !142, size: 64, align: 64, offset: 1920)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !139, file: !25, line: 274, baseType: !142, size: 64, align: 64, offset: 1984)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !139, file: !25, line: 275, baseType: !142, size: 64, align: 64, offset: 2048)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !139, file: !25, line: 277, baseType: !156, size: 64, align: 64, offset: 2112)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !42, file: !25, line: 351, baseType: !189, size: 64, align: 64, offset: 832)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !25, line: 292, baseType: !191)
!191 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 280, size: 640, align: 64, elements: !192)
!192 = !{!193, !198, !199, !204, !205, !206, !211, !212, !217, !218}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !191, file: !25, line: 281, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !25, line: 169, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!33, !56}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !191, file: !25, line: 282, baseType: !142, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !191, file: !25, line: 283, baseType: !200, size: 64, align: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !25, line: 170, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!56, !56, !33}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !191, file: !25, line: 284, baseType: !200, size: 64, align: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !191, file: !25, line: 285, baseType: !14, size: 64, align: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !191, file: !25, line: 286, baseType: !207, size: 64, align: 64, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !25, line: 172, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!62, !56, !33, !56}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !191, file: !25, line: 287, baseType: !14, size: 64, align: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !191, file: !25, line: 288, baseType: !213, size: 64, align: 64, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !25, line: 231, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!62, !56, !56}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !191, file: !25, line: 290, baseType: !142, size: 64, align: 64, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !191, file: !25, line: 291, baseType: !200, size: 64, align: 64, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !42, file: !25, line: 352, baseType: !220, size: 64, align: 64, offset: 896)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !25, line: 298, baseType: !222)
!222 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 294, size: 192, align: 64, elements: !223)
!223 = !{!224, !225, !226}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !222, file: !25, line: 295, baseType: !194, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !222, file: !25, line: 296, baseType: !142, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !222, file: !25, line: 297, baseType: !227, size: 64, align: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !25, line: 174, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!62, !56, !56, !56}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !42, file: !25, line: 356, baseType: !232, size: 64, align: 64, offset: 960)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !25, line: 321, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!236, !56}
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !34, line: 186, baseType: !33)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !42, file: !25, line: 357, baseType: !151, size: 64, align: 64, offset: 1024)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !42, file: !25, line: 358, baseType: !132, size: 64, align: 64, offset: 1088)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !42, file: !25, line: 359, baseType: !240, size: 64, align: 64, offset: 1152)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !25, line: 317, baseType: !143)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !42, file: !25, line: 360, baseType: !242, size: 64, align: 64, offset: 1216)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !25, line: 319, baseType: !228)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !42, file: !25, line: 363, baseType: !244, size: 64, align: 64, offset: 1280)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !25, line: 304, baseType: !246)
!246 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 301, size: 128, align: 64, elements: !247)
!247 = !{!248, !269}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !246, file: !25, line: 302, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !25, line: 193, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!62, !56, !253, !62}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !25, line: 191, baseType: !255)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !25, line: 178, size: 640, align: 64, elements: !256)
!256 = !{!257, !258, !259, !260, !261, !262, !263, !264, !266, !267, !268}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !255, file: !25, line: 179, baseType: !14, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !255, file: !25, line: 180, baseType: !56, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !255, file: !25, line: 181, baseType: !33, size: 64, align: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !255, file: !25, line: 182, baseType: !33, size: 64, align: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !255, file: !25, line: 184, baseType: !62, size: 32, align: 32, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !255, file: !25, line: 185, baseType: !62, size: 32, align: 32, offset: 288)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !255, file: !25, line: 186, baseType: !70, size: 64, align: 64, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !255, file: !25, line: 187, baseType: !265, size: 64, align: 64, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !255, file: !25, line: 188, baseType: !265, size: 64, align: 64, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !255, file: !25, line: 189, baseType: !265, size: 64, align: 64, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !255, file: !25, line: 190, baseType: !14, size: 64, align: 64, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !246, file: !25, line: 303, baseType: !270, size: 64, align: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !25, line: 194, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !56, !253}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !42, file: !25, line: 366, baseType: !114, size: 64, align: 64, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !42, file: !25, line: 368, baseType: !46, size: 64, align: 64, offset: 1408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !42, file: !25, line: 372, baseType: !277, size: 64, align: 64, offset: 1472)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !25, line: 233, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!62, !56, !281, !14}
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !25, line: 232, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!62, !56, !14}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !42, file: !25, line: 375, baseType: !160, size: 64, align: 64, offset: 1536)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !42, file: !25, line: 379, baseType: !287, size: 64, align: 64, offset: 1600)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !25, line: 322, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!56, !56, !56, !62}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !42, file: !25, line: 382, baseType: !33, size: 64, align: 64, offset: 1664)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !42, file: !25, line: 385, baseType: !293, size: 64, align: 64, offset: 1728)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !25, line: 323, baseType: !133)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !42, file: !25, line: 386, baseType: !295, size: 64, align: 64, offset: 1792)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !25, line: 324, baseType: !133)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !42, file: !25, line: 389, baseType: !297, size: 64, align: 64, offset: 1856)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !299, line: 40, size: 256, align: 64, elements: !300)
!299 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!300 = !{!301, !302, !304, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !298, file: !299, line: 41, baseType: !46, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !298, file: !299, line: 42, baseType: !303, size: 64, align: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !299, line: 18, baseType: !143)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !298, file: !299, line: 43, baseType: !62, size: 32, align: 32, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !298, file: !299, line: 45, baseType: !46, size: 64, align: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !42, file: !25, line: 390, baseType: !307, size: 64, align: 64, offset: 1920)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !25, line: 390, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !42, file: !25, line: 391, baseType: !310, size: 64, align: 64, offset: 1984)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !312, line: 11, size: 320, align: 64, elements: !313)
!312 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!313 = !{!314, !315, !320, !325, !326}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !311, file: !312, line: 12, baseType: !70, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !311, file: !312, line: 13, baseType: !316, size: 64, align: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !312, line: 8, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!56, !56, !14}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !311, file: !312, line: 14, baseType: !321, size: 64, align: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !312, line: 9, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!62, !56, !56, !14}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !311, file: !312, line: 15, baseType: !70, size: 64, align: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !311, file: !312, line: 16, baseType: !14, size: 64, align: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !42, file: !25, line: 392, baseType: !41, size: 64, align: 64, offset: 2048)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !42, file: !25, line: 393, baseType: !56, size: 64, align: 64, offset: 2112)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !42, file: !25, line: 394, baseType: !330, size: 64, align: 64, offset: 2176)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !25, line: 325, baseType: !152)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !42, file: !25, line: 395, baseType: !332, size: 64, align: 64, offset: 2240)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !25, line: 326, baseType: !228)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !42, file: !25, line: 396, baseType: !33, size: 64, align: 64, offset: 2304)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !42, file: !25, line: 397, baseType: !335, size: 64, align: 64, offset: 2368)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !25, line: 327, baseType: !228)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !42, file: !25, line: 398, baseType: !337, size: 64, align: 64, offset: 2432)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !25, line: 329, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!56, !41, !33}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !42, file: !25, line: 399, baseType: !342, size: 64, align: 64, offset: 2496)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !25, line: 328, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!56, !41, !56, !56}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !42, file: !25, line: 400, baseType: !347, size: 64, align: 64, offset: 2560)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !25, line: 307, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !14}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !42, file: !25, line: 401, baseType: !160, size: 64, align: 64, offset: 2624)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !42, file: !25, line: 402, baseType: !56, size: 64, align: 64, offset: 2688)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !42, file: !25, line: 403, baseType: !56, size: 64, align: 64, offset: 2752)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !42, file: !25, line: 404, baseType: !56, size: 64, align: 64, offset: 2816)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !42, file: !25, line: 405, baseType: !56, size: 64, align: 64, offset: 2880)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !42, file: !25, line: 406, baseType: !56, size: 64, align: 64, offset: 2944)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !42, file: !25, line: 407, baseType: !52, size: 64, align: 64, offset: 3008)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !42, file: !25, line: 410, baseType: !359, size: 32, align: 32, offset: 3072)
!359 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !42, file: !25, line: 412, baseType: !52, size: 64, align: 64, offset: 3136)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !26, file: !25, line: 113, baseType: !33, size: 64, align: 64, offset: 128)
!362 = !{!363, !390, !394, !405, !411, !416, !424, !428, !434, !438, !443, !449, !453, !457, !462, !468, !472, !476, !480, !485, !489, !493, !498, !503, !508, !513, !519, !528, !530, !534, !539, !545, !550, !557, !564, !568, !573, !578, !582, !586, !590, !595, !604}
!363 = !DISubprogram(name: "PyInit_cmath", scope: !4, file: !4, line: 1118, type: !364, isLocal: false, isDefinition: true, scopeLine: 1119, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_cmath, variables: !366)
!364 = !DISubroutineType(types: !365)
!365 = !{!56}
!366 = !{!367, !368, !370, !372, !374, !376, !378, !380, !382, !384, !386, !388}
!367 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !363, file: !4, line: 1120, type: !56)
!368 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !369, file: !4, line: 1135, type: !15)
!369 = distinct !DILexicalBlock(scope: !363, file: !4, line: 1135, column: 5)
!370 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !371, file: !4, line: 1145, type: !15)
!371 = distinct !DILexicalBlock(scope: !363, file: !4, line: 1145, column: 5)
!372 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !373, file: !4, line: 1155, type: !15)
!373 = distinct !DILexicalBlock(scope: !363, file: !4, line: 1155, column: 5)
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !375, file: !4, line: 1165, type: !15)
!375 = distinct !DILexicalBlock(scope: !363, file: !4, line: 1165, column: 5)
!376 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !377, file: !4, line: 1175, type: !15)
!377 = distinct !DILexicalBlock(scope: !363, file: !4, line: 1175, column: 5)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !379, file: !4, line: 1185, type: !15)
!379 = distinct !DILexicalBlock(scope: !363, file: !4, line: 1185, column: 5)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !381, file: !4, line: 1195, type: !15)
!381 = distinct !DILexicalBlock(scope: !363, file: !4, line: 1195, column: 5)
!382 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !383, file: !4, line: 1205, type: !15)
!383 = distinct !DILexicalBlock(scope: !363, file: !4, line: 1205, column: 5)
!384 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !385, file: !4, line: 1215, type: !15)
!385 = distinct !DILexicalBlock(scope: !363, file: !4, line: 1215, column: 5)
!386 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !387, file: !4, line: 1225, type: !15)
!387 = distinct !DILexicalBlock(scope: !363, file: !4, line: 1225, column: 5)
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !389, file: !4, line: 1235, type: !15)
!389 = distinct !DILexicalBlock(scope: !363, file: !4, line: 1235, column: 5)
!390 = !DISubprogram(name: "cmath_acos", scope: !4, file: !4, line: 900, type: !144, isLocal: true, isDefinition: true, scopeLine: 900, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmath_acos, variables: !391)
!391 = !{!392, !393}
!392 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !390, file: !4, line: 900, type: !56)
!393 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !390, file: !4, line: 900, type: !56)
!394 = !DISubprogram(name: "math_1", scope: !4, file: !4, line: 873, type: !395, isLocal: true, isDefinition: true, scopeLine: 874, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, { double, double } (double, double)*)* @math_1, variables: !400)
!395 = !DISubroutineType(types: !396)
!396 = !{!56, !56, !397}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!16, !16}
!400 = !{!401, !402, !403, !404}
!401 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 1, scope: !394, file: !4, line: 873, type: !56)
!402 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 2, scope: !394, file: !4, line: 873, type: !397)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !394, file: !4, line: 875, type: !16)
!404 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !394, file: !4, line: 875, type: !16)
!405 = !DISubprogram(name: "c_acos", scope: !4, file: !4, line: 127, type: !398, isLocal: true, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double)* @c_acos, variables: !406)
!406 = !{!407, !408, !409, !410}
!407 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 1, scope: !405, file: !4, line: 127, type: !16)
!408 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s1", scope: !405, file: !4, line: 129, type: !16)
!409 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s2", scope: !405, file: !4, line: 129, type: !16)
!410 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !405, file: !4, line: 129, type: !16)
!411 = !DISubprogram(name: "special_type", scope: !4, file: !4, line: 76, type: !412, isLocal: true, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @special_type, variables: !414)
!412 = !DISubroutineType(types: !413)
!413 = !{!3, !21}
!414 = !{!415}
!415 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 1, scope: !411, file: !4, line: 76, type: !21)
!416 = !DISubprogram(name: "c_sqrt", scope: !4, file: !4, line: 667, type: !398, isLocal: true, isDefinition: true, scopeLine: 668, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double)* @c_sqrt, variables: !417)
!417 = !{!418, !419, !420, !421, !422, !423}
!418 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 1, scope: !416, file: !4, line: 667, type: !16)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !416, file: !4, line: 696, type: !16)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !416, file: !4, line: 697, type: !21)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !416, file: !4, line: 697, type: !21)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ax", scope: !416, file: !4, line: 698, type: !21)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ay", scope: !416, file: !4, line: 698, type: !21)
!424 = !DISubprogram(name: "cmath_acosh", scope: !4, file: !4, line: 901, type: !144, isLocal: true, isDefinition: true, scopeLine: 901, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmath_acosh, variables: !425)
!425 = !{!426, !427}
!426 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !424, file: !4, line: 901, type: !56)
!427 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !424, file: !4, line: 901, type: !56)
!428 = !DISubprogram(name: "c_acosh", scope: !4, file: !4, line: 168, type: !398, isLocal: true, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double)* @c_acosh, variables: !429)
!429 = !{!430, !431, !432, !433}
!430 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 1, scope: !428, file: !4, line: 168, type: !16)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s1", scope: !428, file: !4, line: 170, type: !16)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s2", scope: !428, file: !4, line: 170, type: !16)
!433 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !428, file: !4, line: 170, type: !16)
!434 = !DISubprogram(name: "cmath_asin", scope: !4, file: !4, line: 902, type: !144, isLocal: true, isDefinition: true, scopeLine: 902, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmath_asin, variables: !435)
!435 = !{!436, !437}
!436 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !434, file: !4, line: 902, type: !56)
!437 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !434, file: !4, line: 902, type: !56)
!438 = !DISubprogram(name: "c_asin", scope: !4, file: !4, line: 199, type: !398, isLocal: true, isDefinition: true, scopeLine: 200, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double)* @c_asin, variables: !439)
!439 = !{!440, !441, !442}
!440 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 1, scope: !438, file: !4, line: 199, type: !16)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !438, file: !4, line: 202, type: !16)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !438, file: !4, line: 202, type: !16)
!443 = !DISubprogram(name: "c_asinh", scope: !4, file: !4, line: 220, type: !398, isLocal: true, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double)* @c_asinh, variables: !444)
!444 = !{!445, !446, !447, !448}
!445 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 1, scope: !443, file: !4, line: 220, type: !16)
!446 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s1", scope: !443, file: !4, line: 222, type: !16)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s2", scope: !443, file: !4, line: 222, type: !16)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !443, file: !4, line: 222, type: !16)
!449 = !DISubprogram(name: "cmath_asinh", scope: !4, file: !4, line: 903, type: !144, isLocal: true, isDefinition: true, scopeLine: 903, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmath_asinh, variables: !450)
!450 = !{!451, !452}
!451 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !449, file: !4, line: 903, type: !56)
!452 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !449, file: !4, line: 903, type: !56)
!453 = !DISubprogram(name: "cmath_atan", scope: !4, file: !4, line: 904, type: !144, isLocal: true, isDefinition: true, scopeLine: 904, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmath_atan, variables: !454)
!454 = !{!455, !456}
!455 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !453, file: !4, line: 904, type: !56)
!456 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !453, file: !4, line: 904, type: !56)
!457 = !DISubprogram(name: "c_atan", scope: !4, file: !4, line: 256, type: !398, isLocal: true, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double)* @c_atan, variables: !458)
!458 = !{!459, !460, !461}
!459 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 1, scope: !457, file: !4, line: 256, type: !16)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !457, file: !4, line: 259, type: !16)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !457, file: !4, line: 259, type: !16)
!462 = !DISubprogram(name: "c_atanh", scope: !4, file: !4, line: 307, type: !398, isLocal: true, isDefinition: true, scopeLine: 308, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double)* @c_atanh, variables: !463)
!463 = !{!464, !465, !466, !467}
!464 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 1, scope: !462, file: !4, line: 307, type: !16)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !462, file: !4, line: 309, type: !16)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ay", scope: !462, file: !4, line: 310, type: !21)
!467 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "h", scope: !462, file: !4, line: 310, type: !21)
!468 = !DISubprogram(name: "cmath_atanh", scope: !4, file: !4, line: 905, type: !144, isLocal: true, isDefinition: true, scopeLine: 905, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmath_atanh, variables: !469)
!469 = !{!470, !471}
!470 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !468, file: !4, line: 905, type: !56)
!471 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !468, file: !4, line: 905, type: !56)
!472 = !DISubprogram(name: "cmath_cos", scope: !4, file: !4, line: 906, type: !144, isLocal: true, isDefinition: true, scopeLine: 906, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmath_cos, variables: !473)
!473 = !{!474, !475}
!474 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !472, file: !4, line: 906, type: !56)
!475 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !472, file: !4, line: 906, type: !56)
!476 = !DISubprogram(name: "c_cos", scope: !4, file: !4, line: 360, type: !398, isLocal: true, isDefinition: true, scopeLine: 361, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double)* @c_cos, variables: !477)
!477 = !{!478, !479}
!478 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 1, scope: !476, file: !4, line: 360, type: !16)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !476, file: !4, line: 363, type: !16)
!480 = !DISubprogram(name: "c_cosh", scope: !4, file: !4, line: 380, type: !398, isLocal: true, isDefinition: true, scopeLine: 381, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double)* @c_cosh, variables: !481)
!481 = !{!482, !483, !484}
!482 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 1, scope: !480, file: !4, line: 380, type: !16)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !480, file: !4, line: 382, type: !16)
!484 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x_minus_one", scope: !480, file: !4, line: 383, type: !21)
!485 = !DISubprogram(name: "cmath_cosh", scope: !4, file: !4, line: 907, type: !144, isLocal: true, isDefinition: true, scopeLine: 907, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmath_cosh, variables: !486)
!486 = !{!487, !488}
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !485, file: !4, line: 907, type: !56)
!488 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !485, file: !4, line: 907, type: !56)
!489 = !DISubprogram(name: "cmath_exp", scope: !4, file: !4, line: 908, type: !144, isLocal: true, isDefinition: true, scopeLine: 908, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmath_exp, variables: !490)
!490 = !{!491, !492}
!491 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !489, file: !4, line: 908, type: !56)
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !489, file: !4, line: 908, type: !56)
!493 = !DISubprogram(name: "c_exp", scope: !4, file: !4, line: 440, type: !398, isLocal: true, isDefinition: true, scopeLine: 441, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double)* @c_exp, variables: !494)
!494 = !{!495, !496, !497}
!495 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 1, scope: !493, file: !4, line: 440, type: !16)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !493, file: !4, line: 442, type: !16)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !493, file: !4, line: 443, type: !21)
!498 = !DISubprogram(name: "cmath_isfinite", scope: !4, file: !4, line: 1034, type: !144, isLocal: true, isDefinition: true, scopeLine: 1035, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmath_isfinite, variables: !499)
!499 = !{!500, !501, !502}
!500 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !498, file: !4, line: 1034, type: !56)
!501 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !498, file: !4, line: 1034, type: !56)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !498, file: !4, line: 1036, type: !16)
!503 = !DISubprogram(name: "cmath_isinf", scope: !4, file: !4, line: 1060, type: !144, isLocal: true, isDefinition: true, scopeLine: 1061, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmath_isinf, variables: !504)
!504 = !{!505, !506, !507}
!505 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !503, file: !4, line: 1060, type: !56)
!506 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !503, file: !4, line: 1060, type: !56)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !503, file: !4, line: 1062, type: !16)
!508 = !DISubprogram(name: "cmath_isnan", scope: !4, file: !4, line: 1047, type: !144, isLocal: true, isDefinition: true, scopeLine: 1048, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmath_isnan, variables: !509)
!509 = !{!510, !511, !512}
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !508, file: !4, line: 1047, type: !56)
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !508, file: !4, line: 1047, type: !56)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !508, file: !4, line: 1049, type: !16)
!513 = !DISubprogram(name: "cmath_log", scope: !4, file: !4, line: 832, type: !144, isLocal: true, isDefinition: true, scopeLine: 833, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmath_log, variables: !514)
!514 = !{!515, !516, !517, !518}
!515 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !513, file: !4, line: 832, type: !56)
!516 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !513, file: !4, line: 832, type: !56)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !513, file: !4, line: 834, type: !16)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !513, file: !4, line: 835, type: !16)
!519 = !DISubprogram(name: "c_log", scope: !4, file: !4, line: 498, type: !398, isLocal: true, isDefinition: true, scopeLine: 499, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double)* @c_log, variables: !520)
!520 = !{!521, !522, !523, !524, !525, !526, !527}
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 1, scope: !519, file: !4, line: 498, type: !16)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !519, file: !4, line: 528, type: !16)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ax", scope: !519, file: !4, line: 529, type: !21)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ay", scope: !519, file: !4, line: 529, type: !21)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "am", scope: !519, file: !4, line: 529, type: !21)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "an", scope: !519, file: !4, line: 529, type: !21)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "h", scope: !519, file: !4, line: 529, type: !21)
!528 = !DISubprogram(name: "math_error", scope: !4, file: !4, line: 861, type: !364, isLocal: true, isDefinition: true, scopeLine: 862, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @math_error, variables: !529)
!529 = !{}
!530 = !DISubprogram(name: "cmath_log10", scope: !4, file: !4, line: 909, type: !144, isLocal: true, isDefinition: true, scopeLine: 909, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmath_log10, variables: !531)
!531 = !{!532, !533}
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !530, file: !4, line: 909, type: !56)
!533 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !530, file: !4, line: 909, type: !56)
!534 = !DISubprogram(name: "c_log10", scope: !4, file: !4, line: 568, type: !398, isLocal: true, isDefinition: true, scopeLine: 569, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double)* @c_log10, variables: !535)
!535 = !{!536, !537, !538}
!536 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 1, scope: !534, file: !4, line: 568, type: !16)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !534, file: !4, line: 570, type: !16)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errno_save", scope: !534, file: !4, line: 571, type: !62)
!539 = !DISubprogram(name: "cmath_phase", scope: !4, file: !4, line: 917, type: !144, isLocal: true, isDefinition: true, scopeLine: 918, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmath_phase, variables: !540)
!540 = !{!541, !542, !543, !544}
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !539, file: !4, line: 917, type: !56)
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !539, file: !4, line: 917, type: !56)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !539, file: !4, line: 919, type: !16)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "phi", scope: !539, file: !4, line: 920, type: !21)
!545 = !DISubprogram(name: "c_atan2", scope: !4, file: !4, line: 271, type: !546, isLocal: true, isDefinition: true, scopeLine: 272, flags: DIFlagPrototyped, isOptimized: true, function: double (double, double)* @c_atan2, variables: !548)
!546 = !DISubroutineType(types: !547)
!547 = !{!21, !16}
!548 = !{!549}
!549 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 1, scope: !545, file: !4, line: 271, type: !16)
!550 = !DISubprogram(name: "cmath_polar", scope: !4, file: !4, line: 938, type: !144, isLocal: true, isDefinition: true, scopeLine: 939, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmath_polar, variables: !551)
!551 = !{!552, !553, !554, !555, !556}
!552 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !550, file: !4, line: 938, type: !56)
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !550, file: !4, line: 938, type: !56)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !550, file: !4, line: 940, type: !16)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !550, file: !4, line: 941, type: !21)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "phi", scope: !550, file: !4, line: 941, type: !21)
!557 = !DISubprogram(name: "cmath_rect", scope: !4, file: !4, line: 973, type: !144, isLocal: true, isDefinition: true, scopeLine: 974, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmath_rect, variables: !558)
!558 = !{!559, !560, !561, !562, !563}
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !557, file: !4, line: 973, type: !56)
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !557, file: !4, line: 973, type: !56)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !557, file: !4, line: 975, type: !16)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !557, file: !4, line: 976, type: !21)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "phi", scope: !557, file: !4, line: 976, type: !21)
!564 = !DISubprogram(name: "cmath_sin", scope: !4, file: !4, line: 910, type: !144, isLocal: true, isDefinition: true, scopeLine: 910, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmath_sin, variables: !565)
!565 = !{!566, !567}
!566 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !564, file: !4, line: 910, type: !56)
!567 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !564, file: !4, line: 910, type: !56)
!568 = !DISubprogram(name: "c_sin", scope: !4, file: !4, line: 588, type: !398, isLocal: true, isDefinition: true, scopeLine: 589, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double)* @c_sin, variables: !569)
!569 = !{!570, !571, !572}
!570 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 1, scope: !568, file: !4, line: 588, type: !16)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !568, file: !4, line: 591, type: !16)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !568, file: !4, line: 591, type: !16)
!573 = !DISubprogram(name: "c_sinh", scope: !4, file: !4, line: 610, type: !398, isLocal: true, isDefinition: true, scopeLine: 611, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double)* @c_sinh, variables: !574)
!574 = !{!575, !576, !577}
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 1, scope: !573, file: !4, line: 610, type: !16)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !573, file: !4, line: 612, type: !16)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x_minus_one", scope: !573, file: !4, line: 613, type: !21)
!578 = !DISubprogram(name: "cmath_sinh", scope: !4, file: !4, line: 911, type: !144, isLocal: true, isDefinition: true, scopeLine: 911, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmath_sinh, variables: !579)
!579 = !{!580, !581}
!580 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !578, file: !4, line: 911, type: !56)
!581 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !578, file: !4, line: 911, type: !56)
!582 = !DISubprogram(name: "cmath_sqrt", scope: !4, file: !4, line: 912, type: !144, isLocal: true, isDefinition: true, scopeLine: 912, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmath_sqrt, variables: !583)
!583 = !{!584, !585}
!584 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !582, file: !4, line: 912, type: !56)
!585 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !582, file: !4, line: 912, type: !56)
!586 = !DISubprogram(name: "cmath_tan", scope: !4, file: !4, line: 913, type: !144, isLocal: true, isDefinition: true, scopeLine: 913, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmath_tan, variables: !587)
!587 = !{!588, !589}
!588 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !586, file: !4, line: 913, type: !56)
!589 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !586, file: !4, line: 913, type: !56)
!590 = !DISubprogram(name: "c_tan", scope: !4, file: !4, line: 740, type: !398, isLocal: true, isDefinition: true, scopeLine: 741, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double)* @c_tan, variables: !591)
!591 = !{!592, !593, !594}
!592 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 1, scope: !590, file: !4, line: 740, type: !16)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !590, file: !4, line: 743, type: !16)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !590, file: !4, line: 743, type: !16)
!595 = !DISubprogram(name: "c_tanh", scope: !4, file: !4, line: 762, type: !398, isLocal: true, isDefinition: true, scopeLine: 763, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double)* @c_tanh, variables: !596)
!596 = !{!597, !598, !599, !600, !601, !602, !603}
!597 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 1, scope: !595, file: !4, line: 762, type: !16)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !595, file: !4, line: 776, type: !16)
!599 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tx", scope: !595, file: !4, line: 777, type: !21)
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ty", scope: !595, file: !4, line: 777, type: !21)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cx", scope: !595, file: !4, line: 777, type: !21)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "txty", scope: !595, file: !4, line: 777, type: !21)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "denom", scope: !595, file: !4, line: 777, type: !21)
!604 = !DISubprogram(name: "cmath_tanh", scope: !4, file: !4, line: 914, type: !144, isLocal: true, isDefinition: true, scopeLine: 914, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @cmath_tanh, variables: !605)
!605 = !{!606, !607}
!606 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !604, file: !4, line: 914, type: !56)
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !604, file: !4, line: 914, type: !56)
!608 = !{!609, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !646, !650, !654, !658, !662, !666, !670, !674, !678, !682, !686, !690, !694, !698, !702, !706, !710, !714, !718, !722, !726, !730, !731, !735}
!609 = !DIGlobalVariable(name: "acos_special_values", scope: !0, file: !4, line: 124, type: !610, isLocal: true, isDefinition: true, variable: [7 x [7 x %struct.Py_complex]]* @acos_special_values)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 6272, align: 64, elements: !611)
!611 = !{!612, !612}
!612 = !DISubrange(count: 7)
!613 = !DIGlobalVariable(name: "acosh_special_values", scope: !0, file: !4, line: 165, type: !610, isLocal: true, isDefinition: true, variable: [7 x [7 x %struct.Py_complex]]* @acosh_special_values)
!614 = !DIGlobalVariable(name: "asinh_special_values", scope: !0, file: !4, line: 217, type: !610, isLocal: true, isDefinition: true, variable: [7 x [7 x %struct.Py_complex]]* @asinh_special_values)
!615 = !DIGlobalVariable(name: "atanh_special_values", scope: !0, file: !4, line: 304, type: !610, isLocal: true, isDefinition: true, variable: [7 x [7 x %struct.Py_complex]]* @atanh_special_values)
!616 = !DIGlobalVariable(name: "cosh_special_values", scope: !0, file: !4, line: 377, type: !610, isLocal: true, isDefinition: true, variable: [7 x [7 x %struct.Py_complex]]* @cosh_special_values)
!617 = !DIGlobalVariable(name: "exp_special_values", scope: !0, file: !4, line: 437, type: !610, isLocal: true, isDefinition: true, variable: [7 x [7 x %struct.Py_complex]]* @exp_special_values)
!618 = !DIGlobalVariable(name: "log_special_values", scope: !0, file: !4, line: 495, type: !610, isLocal: true, isDefinition: true, variable: [7 x [7 x %struct.Py_complex]]* @log_special_values)
!619 = !DIGlobalVariable(name: "sinh_special_values", scope: !0, file: !4, line: 607, type: !610, isLocal: true, isDefinition: true, variable: [7 x [7 x %struct.Py_complex]]* @sinh_special_values)
!620 = !DIGlobalVariable(name: "sqrt_special_values", scope: !0, file: !4, line: 664, type: !610, isLocal: true, isDefinition: true, variable: [7 x [7 x %struct.Py_complex]]* @sqrt_special_values)
!621 = !DIGlobalVariable(name: "tanh_special_values", scope: !0, file: !4, line: 759, type: !610, isLocal: true, isDefinition: true, variable: [7 x [7 x %struct.Py_complex]]* @tanh_special_values)
!622 = !DIGlobalVariable(name: "rect_special_values", scope: !0, file: !4, line: 970, type: !610, isLocal: true, isDefinition: true, variable: [7 x [7 x %struct.Py_complex]]* @rect_special_values)
!623 = !DIGlobalVariable(name: "cmathmodule", scope: !0, file: !4, line: 1105, type: !624, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @cmathmodule)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !625, line: 47, size: 832, align: 64, elements: !626)
!625 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!626 = !{!627, !636, !637, !638, !639, !642, !643, !644, !645}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !624, file: !625, line: 48, baseType: !628, size: 320, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !625, line: 38, baseType: !629)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !625, line: 33, size: 320, align: 64, elements: !630)
!630 = !{!631, !632, !634, !635}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !629, file: !625, line: 34, baseType: !29, size: 128, align: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !629, file: !625, line: 35, baseType: !633, size: 64, align: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !629, file: !625, line: 36, baseType: !33, size: 64, align: 64, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !629, file: !625, line: 37, baseType: !56, size: 64, align: 64, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !624, file: !625, line: 49, baseType: !46, size: 64, align: 64, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !624, file: !625, line: 50, baseType: !46, size: 64, align: 64, offset: 384)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !624, file: !625, line: 51, baseType: !33, size: 64, align: 64, offset: 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !624, file: !625, line: 52, baseType: !640, size: 64, align: 64, offset: 512)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !299, line: 47, baseType: !298)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !624, file: !625, line: 53, baseType: !160, size: 64, align: 64, offset: 576)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !624, file: !625, line: 54, baseType: !277, size: 64, align: 64, offset: 640)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !624, file: !625, line: 55, baseType: !160, size: 64, align: 64, offset: 704)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !624, file: !625, line: 56, baseType: !347, size: 64, align: 64, offset: 768)
!646 = !DIGlobalVariable(name: "module_doc", scope: !0, file: !4, line: 1074, type: !647, isLocal: true, isDefinition: true, variable: [99 x i8]* @module_doc)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 792, align: 8, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 99)
!650 = !DIGlobalVariable(name: "cmath_methods", scope: !0, file: !4, line: 1078, type: !651, isLocal: true, isDefinition: true, variable: [23 x %struct.PyMethodDef]* @cmath_methods)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !641, size: 5888, align: 64, elements: !652)
!652 = !{!653}
!653 = !DISubrange(count: 23)
!654 = !DIGlobalVariable(name: "c_acos_doc", scope: !0, file: !4, line: 159, type: !655, isLocal: true, isDefinition: true, variable: [37 x i8]* @c_acos_doc)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 296, align: 8, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 37)
!658 = !DIGlobalVariable(name: "c_acosh_doc", scope: !0, file: !4, line: 192, type: !659, isLocal: true, isDefinition: true, variable: [48 x i8]* @c_acosh_doc)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 384, align: 8, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 48)
!662 = !DIGlobalVariable(name: "c_asin_doc", scope: !0, file: !4, line: 211, type: !663, isLocal: true, isDefinition: true, variable: [35 x i8]* @c_asin_doc)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 280, align: 8, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 35)
!666 = !DIGlobalVariable(name: "c_asinh_doc", scope: !0, file: !4, line: 249, type: !667, isLocal: true, isDefinition: true, variable: [47 x i8]* @c_asinh_doc)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 376, align: 8, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 47)
!670 = !DIGlobalVariable(name: "c_atan_doc", scope: !0, file: !4, line: 298, type: !671, isLocal: true, isDefinition: true, variable: [38 x i8]* @c_atan_doc)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 304, align: 8, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 38)
!674 = !DIGlobalVariable(name: "c_atanh_doc", scope: !0, file: !4, line: 353, type: !675, isLocal: true, isDefinition: true, variable: [50 x i8]* @c_atanh_doc)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 400, align: 8, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 50)
!678 = !DIGlobalVariable(name: "c_cos_doc", scope: !0, file: !4, line: 370, type: !679, isLocal: true, isDefinition: true, variable: [32 x i8]* @c_cos_doc)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 256, align: 8, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 32)
!682 = !DIGlobalVariable(name: "c_cosh_doc", scope: !0, file: !4, line: 429, type: !683, isLocal: true, isDefinition: true, variable: [44 x i8]* @c_cosh_doc)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 352, align: 8, elements: !684)
!684 = !{!685}
!685 = !DISubrange(count: 44)
!686 = !DIGlobalVariable(name: "c_exp_doc", scope: !0, file: !4, line: 489, type: !687, isLocal: true, isDefinition: true, variable: [43 x i8]* @c_exp_doc)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 344, align: 8, elements: !688)
!688 = !{!689}
!689 = !DISubrange(count: 43)
!690 = !DIGlobalVariable(name: "cmath_isfinite_doc", scope: !0, file: !4, line: 1042, type: !691, isLocal: true, isDefinition: true, variable: [98 x i8]* @cmath_isfinite_doc)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 784, align: 8, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 98)
!694 = !DIGlobalVariable(name: "cmath_isinf_doc", scope: !0, file: !4, line: 1069, type: !695, isLocal: true, isDefinition: true, variable: [72 x i8]* @cmath_isinf_doc)
