; ModuleID = 'irs-onlybc/codecs.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Py_atomic_address = type { i8* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !477, globals: !1076)
!1 = !DIFile(filename: "codecs.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !11}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !4, line: 23, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!7 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!8 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!9 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!10 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !12, line: 451, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!15 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!16 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!17 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!18 = !{!19, !121, !36, !416, !424, !425, !443, !451, !462, !461, !466, !465, !469, !468, !75, !470, !472, !474, !42, !126, !463, !476}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !21, line: 139, baseType: !22)
!21 = !DIFile(filename: "Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !21, line: 69, size: 1536, align: 64, elements: !23)
!23 = !{!24, !26, !27, !386, !389, !390, !391, !392, !393, !394, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !22, file: !21, line: 72, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !22, file: !21, line: 73, baseType: !25, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !22, file: !21, line: 74, baseType: !28, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !21, line: 44, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !21, line: 19, size: 832, align: 64, elements: !31)
!31 = !{!32, !34, !35, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !30, file: !21, line: 21, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !30, file: !21, line: 22, baseType: !25, size: 64, align: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !30, file: !21, line: 24, baseType: !36, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !38, line: 109, baseType: !39)
!38 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !38, line: 105, size: 128, align: 64, elements: !40)
!40 = !{!41, !49}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !39, file: !38, line: 107, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !43, line: 177, baseType: !44)
!43 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !45, line: 102, baseType: !46)
!45 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !47, line: 181, baseType: !48)
!47 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!48 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !39, file: !38, line: 108, baseType: !50, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !38, line: 334, size: 3200, align: 64, elements: !52)
!52 = !{!53, !59, !63, !64, !65, !70, !134, !139, !144, !145, !150, !202, !233, !245, !251, !252, !253, !255, !257, !288, !289, !290, !299, !300, !305, !306, !308, !310, !320, !323, !341, !342, !343, !345, !347, !348, !350, !355, !360, !365, !366, !367, !368, !369, !370, !371, !372, !374}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !51, file: !38, line: 335, baseType: !54, size: 192, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !38, line: 114, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 111, size: 192, align: 64, elements: !56)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !55, file: !38, line: 112, baseType: !37, size: 128, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !55, file: !38, line: 113, baseType: !42, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !51, file: !38, line: 336, baseType: !60, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !51, file: !38, line: 337, baseType: !42, size: 64, align: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !51, file: !38, line: 337, baseType: !42, size: 64, align: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !51, file: !38, line: 341, baseType: !66, size: 64, align: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !38, line: 308, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !36}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !51, file: !38, line: 342, baseType: !71, size: 64, align: 64, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !38, line: 314, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!75, !36, !76, !75}
!75 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !45, line: 48, baseType: !78)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !79, line: 246, size: 1728, align: 64, elements: !80)
!79 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!80 = !{!81, !82, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !102, !103, !104, !105, !107, !109, !111, !115, !118, !120, !122, !123, !124, !125, !129, !130}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !78, file: !79, line: 247, baseType: !75, size: 32, align: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !78, file: !79, line: 252, baseType: !83, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !78, file: !79, line: 253, baseType: !83, size: 64, align: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !78, file: !79, line: 254, baseType: !83, size: 64, align: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !78, file: !79, line: 255, baseType: !83, size: 64, align: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !78, file: !79, line: 256, baseType: !83, size: 64, align: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !78, file: !79, line: 257, baseType: !83, size: 64, align: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !78, file: !79, line: 258, baseType: !83, size: 64, align: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !78, file: !79, line: 259, baseType: !83, size: 64, align: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !78, file: !79, line: 261, baseType: !83, size: 64, align: 64, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !78, file: !79, line: 262, baseType: !83, size: 64, align: 64, offset: 640)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !78, file: !79, line: 263, baseType: !83, size: 64, align: 64, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !78, file: !79, line: 265, baseType: !95, size: 64, align: 64, offset: 768)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !79, line: 161, size: 192, align: 64, elements: !97)
!97 = !{!98, !99, !101}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !96, file: !79, line: 162, baseType: !95, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !96, file: !79, line: 163, baseType: !100, size: 64, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !96, file: !79, line: 167, baseType: !75, size: 32, align: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !78, file: !79, line: 267, baseType: !100, size: 64, align: 64, offset: 832)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !78, file: !79, line: 269, baseType: !75, size: 32, align: 32, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !78, file: !79, line: 273, baseType: !75, size: 32, align: 32, offset: 928)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !78, file: !79, line: 275, baseType: !106, size: 64, align: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !47, line: 140, baseType: !48)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !78, file: !79, line: 279, baseType: !108, size: 16, align: 16, offset: 1024)
!108 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !78, file: !79, line: 280, baseType: !110, size: 8, align: 8, offset: 1040)
!110 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !78, file: !79, line: 281, baseType: !112, size: 8, align: 8, offset: 1048)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 8, align: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 1)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !78, file: !79, line: 285, baseType: !116, size: 64, align: 64, offset: 1088)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !79, line: 155, baseType: null)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !78, file: !79, line: 294, baseType: !119, size: 64, align: 64, offset: 1152)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !47, line: 141, baseType: !48)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !78, file: !79, line: 303, baseType: !121, size: 64, align: 64, offset: 1216)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !78, file: !79, line: 304, baseType: !121, size: 64, align: 64, offset: 1280)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !78, file: !79, line: 305, baseType: !121, size: 64, align: 64, offset: 1344)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !78, file: !79, line: 306, baseType: !121, size: 64, align: 64, offset: 1408)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !78, file: !79, line: 307, baseType: !126, size: 64, align: 64, offset: 1472)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !127, line: 62, baseType: !128)
!127 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!128 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !78, file: !79, line: 309, baseType: !75, size: 32, align: 32, offset: 1536)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !78, file: !79, line: 311, baseType: !131, size: 160, align: 8, offset: 1568)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 160, align: 8, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 20)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !51, file: !38, line: 343, baseType: !135, size: 64, align: 64, offset: 512)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !38, line: 316, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!36, !36, !83}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !51, file: !38, line: 344, baseType: !140, size: 64, align: 64, offset: 576)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !38, line: 318, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!75, !36, !83, !36}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !51, file: !38, line: 345, baseType: !121, size: 64, align: 64, offset: 640)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !51, file: !38, line: 346, baseType: !146, size: 64, align: 64, offset: 704)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !38, line: 320, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!36, !36}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !51, file: !38, line: 350, baseType: !151, size: 64, align: 64, offset: 768)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !38, line: 278, baseType: !153)
!153 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 236, size: 2176, align: 64, elements: !154)
!154 = !{!155, !160, !161, !162, !163, !164, !169, !171, !172, !173, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !153, file: !38, line: 241, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !38, line: 166, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!36, !36, !36}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !153, file: !38, line: 242, baseType: !156, size: 64, align: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !153, file: !38, line: 243, baseType: !156, size: 64, align: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !153, file: !38, line: 244, baseType: !156, size: 64, align: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !153, file: !38, line: 245, baseType: !156, size: 64, align: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !153, file: !38, line: 246, baseType: !165, size: 64, align: 64, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !38, line: 167, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!36, !36, !36, !36}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !153, file: !38, line: 247, baseType: !170, size: 64, align: 64, offset: 384)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !38, line: 165, baseType: !147)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !153, file: !38, line: 248, baseType: !170, size: 64, align: 64, offset: 448)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !153, file: !38, line: 249, baseType: !170, size: 64, align: 64, offset: 512)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !153, file: !38, line: 250, baseType: !174, size: 64, align: 64, offset: 576)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !38, line: 168, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!75, !36}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !153, file: !38, line: 251, baseType: !170, size: 64, align: 64, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !153, file: !38, line: 252, baseType: !156, size: 64, align: 64, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !153, file: !38, line: 253, baseType: !156, size: 64, align: 64, offset: 768)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !153, file: !38, line: 254, baseType: !156, size: 64, align: 64, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !153, file: !38, line: 255, baseType: !156, size: 64, align: 64, offset: 896)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !153, file: !38, line: 256, baseType: !156, size: 64, align: 64, offset: 960)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !153, file: !38, line: 257, baseType: !170, size: 64, align: 64, offset: 1024)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !153, file: !38, line: 258, baseType: !121, size: 64, align: 64, offset: 1088)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !153, file: !38, line: 259, baseType: !170, size: 64, align: 64, offset: 1152)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !153, file: !38, line: 261, baseType: !156, size: 64, align: 64, offset: 1216)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !153, file: !38, line: 262, baseType: !156, size: 64, align: 64, offset: 1280)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !153, file: !38, line: 263, baseType: !156, size: 64, align: 64, offset: 1344)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !153, file: !38, line: 264, baseType: !156, size: 64, align: 64, offset: 1408)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !153, file: !38, line: 265, baseType: !165, size: 64, align: 64, offset: 1472)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !153, file: !38, line: 266, baseType: !156, size: 64, align: 64, offset: 1536)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !153, file: !38, line: 267, baseType: !156, size: 64, align: 64, offset: 1600)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !153, file: !38, line: 268, baseType: !156, size: 64, align: 64, offset: 1664)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !153, file: !38, line: 269, baseType: !156, size: 64, align: 64, offset: 1728)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !153, file: !38, line: 270, baseType: !156, size: 64, align: 64, offset: 1792)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !153, file: !38, line: 272, baseType: !156, size: 64, align: 64, offset: 1856)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !153, file: !38, line: 273, baseType: !156, size: 64, align: 64, offset: 1920)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !153, file: !38, line: 274, baseType: !156, size: 64, align: 64, offset: 1984)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !153, file: !38, line: 275, baseType: !156, size: 64, align: 64, offset: 2048)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !153, file: !38, line: 277, baseType: !170, size: 64, align: 64, offset: 2112)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !51, file: !38, line: 351, baseType: !203, size: 64, align: 64, offset: 832)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !38, line: 292, baseType: !205)
!205 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 280, size: 640, align: 64, elements: !206)
!206 = !{!207, !212, !213, !218, !219, !220, !225, !226, !231, !232}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !205, file: !38, line: 281, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !38, line: 169, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!42, !36}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !205, file: !38, line: 282, baseType: !156, size: 64, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !205, file: !38, line: 283, baseType: !214, size: 64, align: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !38, line: 170, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!36, !36, !42}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !205, file: !38, line: 284, baseType: !214, size: 64, align: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !205, file: !38, line: 285, baseType: !121, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !205, file: !38, line: 286, baseType: !221, size: 64, align: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !38, line: 172, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!75, !36, !42, !36}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !205, file: !38, line: 287, baseType: !121, size: 64, align: 64, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !205, file: !38, line: 288, baseType: !227, size: 64, align: 64, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !38, line: 231, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!75, !36, !36}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !205, file: !38, line: 290, baseType: !156, size: 64, align: 64, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !205, file: !38, line: 291, baseType: !214, size: 64, align: 64, offset: 576)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !51, file: !38, line: 352, baseType: !234, size: 64, align: 64, offset: 896)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !38, line: 298, baseType: !236)
!236 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 294, size: 192, align: 64, elements: !237)
!237 = !{!238, !239, !240}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !236, file: !38, line: 295, baseType: !208, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !236, file: !38, line: 296, baseType: !156, size: 64, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !236, file: !38, line: 297, baseType: !241, size: 64, align: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !38, line: 174, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!75, !36, !36, !36}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !51, file: !38, line: 356, baseType: !246, size: 64, align: 64, offset: 960)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !38, line: 321, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!250, !36}
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !43, line: 186, baseType: !42)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !51, file: !38, line: 357, baseType: !165, size: 64, align: 64, offset: 1024)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !51, file: !38, line: 358, baseType: !146, size: 64, align: 64, offset: 1088)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !51, file: !38, line: 359, baseType: !254, size: 64, align: 64, offset: 1152)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !38, line: 317, baseType: !157)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !51, file: !38, line: 360, baseType: !256, size: 64, align: 64, offset: 1216)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !38, line: 319, baseType: !242)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !51, file: !38, line: 363, baseType: !258, size: 64, align: 64, offset: 1280)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !38, line: 304, baseType: !260)
!260 = !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 301, size: 128, align: 64, elements: !261)
!261 = !{!262, !283}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !260, file: !38, line: 302, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !38, line: 193, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!75, !36, !267, !75}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !38, line: 191, baseType: !269)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !38, line: 178, size: 640, align: 64, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !276, !277, !278, !280, !281, !282}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !269, file: !38, line: 179, baseType: !121, size: 64, align: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !269, file: !38, line: 180, baseType: !36, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !269, file: !38, line: 181, baseType: !42, size: 64, align: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !269, file: !38, line: 182, baseType: !42, size: 64, align: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !269, file: !38, line: 184, baseType: !75, size: 32, align: 32, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !269, file: !38, line: 185, baseType: !75, size: 32, align: 32, offset: 288)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !269, file: !38, line: 186, baseType: !83, size: 64, align: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !269, file: !38, line: 187, baseType: !279, size: 64, align: 64, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !269, file: !38, line: 188, baseType: !279, size: 64, align: 64, offset: 448)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !269, file: !38, line: 189, baseType: !279, size: 64, align: 64, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !269, file: !38, line: 190, baseType: !121, size: 64, align: 64, offset: 576)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !260, file: !38, line: 303, baseType: !284, size: 64, align: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !38, line: 194, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !36, !267}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !51, file: !38, line: 366, baseType: !128, size: 64, align: 64, offset: 1344)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !51, file: !38, line: 368, baseType: !60, size: 64, align: 64, offset: 1408)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !51, file: !38, line: 372, baseType: !291, size: 64, align: 64, offset: 1472)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !38, line: 233, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!75, !36, !295, !121}
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !38, line: 232, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!75, !36, !121}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !51, file: !38, line: 375, baseType: !174, size: 64, align: 64, offset: 1536)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !51, file: !38, line: 379, baseType: !301, size: 64, align: 64, offset: 1600)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !38, line: 322, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{!36, !36, !36, !75}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !51, file: !38, line: 382, baseType: !42, size: 64, align: 64, offset: 1664)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !51, file: !38, line: 385, baseType: !307, size: 64, align: 64, offset: 1728)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !38, line: 323, baseType: !147)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !51, file: !38, line: 386, baseType: !309, size: 64, align: 64, offset: 1792)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !38, line: 324, baseType: !147)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !51, file: !38, line: 389, baseType: !311, size: 64, align: 64, offset: 1856)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !313, line: 40, size: 256, align: 64, elements: !314)
!313 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!314 = !{!315, !316, !318, !319}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !312, file: !313, line: 41, baseType: !60, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !312, file: !313, line: 42, baseType: !317, size: 64, align: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !313, line: 18, baseType: !157)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !312, file: !313, line: 43, baseType: !75, size: 32, align: 32, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !312, file: !313, line: 45, baseType: !60, size: 64, align: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !51, file: !38, line: 390, baseType: !321, size: 64, align: 64, offset: 1920)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !38, line: 390, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !51, file: !38, line: 391, baseType: !324, size: 64, align: 64, offset: 1984)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !326, line: 11, size: 320, align: 64, elements: !327)
!326 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!327 = !{!328, !329, !334, !339, !340}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !325, file: !326, line: 12, baseType: !83, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !325, file: !326, line: 13, baseType: !330, size: 64, align: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !326, line: 8, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!36, !36, !121}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !325, file: !326, line: 14, baseType: !335, size: 64, align: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !326, line: 9, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!75, !36, !36, !121}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !325, file: !326, line: 15, baseType: !83, size: 64, align: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !325, file: !326, line: 16, baseType: !121, size: 64, align: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !51, file: !38, line: 392, baseType: !50, size: 64, align: 64, offset: 2048)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !51, file: !38, line: 393, baseType: !36, size: 64, align: 64, offset: 2112)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !51, file: !38, line: 394, baseType: !344, size: 64, align: 64, offset: 2176)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !38, line: 325, baseType: !166)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !51, file: !38, line: 395, baseType: !346, size: 64, align: 64, offset: 2240)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !38, line: 326, baseType: !242)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !51, file: !38, line: 396, baseType: !42, size: 64, align: 64, offset: 2304)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !51, file: !38, line: 397, baseType: !349, size: 64, align: 64, offset: 2368)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !38, line: 327, baseType: !242)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !51, file: !38, line: 398, baseType: !351, size: 64, align: 64, offset: 2432)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !38, line: 329, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!36, !50, !42}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !51, file: !38, line: 399, baseType: !356, size: 64, align: 64, offset: 2496)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !38, line: 328, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64, align: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!36, !50, !36, !36}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !51, file: !38, line: 400, baseType: !361, size: 64, align: 64, offset: 2560)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !38, line: 307, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !121}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !51, file: !38, line: 401, baseType: !174, size: 64, align: 64, offset: 2624)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !51, file: !38, line: 402, baseType: !36, size: 64, align: 64, offset: 2688)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !51, file: !38, line: 403, baseType: !36, size: 64, align: 64, offset: 2752)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !51, file: !38, line: 404, baseType: !36, size: 64, align: 64, offset: 2816)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !51, file: !38, line: 405, baseType: !36, size: 64, align: 64, offset: 2880)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !51, file: !38, line: 406, baseType: !36, size: 64, align: 64, offset: 2944)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !51, file: !38, line: 407, baseType: !66, size: 64, align: 64, offset: 3008)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !51, file: !38, line: 410, baseType: !373, size: 32, align: 32, offset: 3072)
!373 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !51, file: !38, line: 412, baseType: !66, size: 64, align: 64, offset: 3136)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !30, file: !21, line: 25, baseType: !36, size: 64, align: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !30, file: !21, line: 26, baseType: !36, size: 64, align: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !30, file: !21, line: 27, baseType: !36, size: 64, align: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !30, file: !21, line: 28, baseType: !36, size: 64, align: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !30, file: !21, line: 30, baseType: !36, size: 64, align: 64, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !30, file: !21, line: 31, baseType: !36, size: 64, align: 64, offset: 512)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !30, file: !21, line: 32, baseType: !36, size: 64, align: 64, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !30, file: !21, line: 33, baseType: !75, size: 32, align: 32, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !30, file: !21, line: 34, baseType: !75, size: 32, align: 32, offset: 672)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !30, file: !21, line: 37, baseType: !75, size: 32, align: 32, offset: 704)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !30, file: !21, line: 43, baseType: !36, size: 64, align: 64, offset: 768)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !22, file: !21, line: 76, baseType: !387, size: 64, align: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !21, line: 50, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !22, file: !21, line: 77, baseType: !75, size: 32, align: 32, offset: 256)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !22, file: !21, line: 78, baseType: !62, size: 8, align: 8, offset: 288)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !22, file: !21, line: 80, baseType: !62, size: 8, align: 8, offset: 296)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !22, file: !21, line: 85, baseType: !75, size: 32, align: 32, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !22, file: !21, line: 86, baseType: !75, size: 32, align: 32, offset: 352)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !22, file: !21, line: 88, baseType: !395, size: 64, align: 64, offset: 384)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !21, line: 54, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!75, !36, !387, !75, !36}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !22, file: !21, line: 89, baseType: !395, size: 64, align: 64, offset: 448)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !22, file: !21, line: 90, baseType: !36, size: 64, align: 64, offset: 512)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !22, file: !21, line: 91, baseType: !36, size: 64, align: 64, offset: 576)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !22, file: !21, line: 93, baseType: !36, size: 64, align: 64, offset: 640)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !22, file: !21, line: 94, baseType: !36, size: 64, align: 64, offset: 704)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !22, file: !21, line: 95, baseType: !36, size: 64, align: 64, offset: 768)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !22, file: !21, line: 97, baseType: !36, size: 64, align: 64, offset: 832)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !22, file: !21, line: 98, baseType: !36, size: 64, align: 64, offset: 896)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !22, file: !21, line: 99, baseType: !36, size: 64, align: 64, offset: 960)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !22, file: !21, line: 101, baseType: !36, size: 64, align: 64, offset: 1024)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !22, file: !21, line: 103, baseType: !75, size: 32, align: 32, offset: 1088)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !22, file: !21, line: 105, baseType: !36, size: 64, align: 64, offset: 1152)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !22, file: !21, line: 106, baseType: !48, size: 64, align: 64, offset: 1216)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !22, file: !21, line: 108, baseType: !75, size: 32, align: 32, offset: 1280)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !22, file: !21, line: 109, baseType: !36, size: 64, align: 64, offset: 1344)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !22, file: !21, line: 134, baseType: !362, size: 64, align: 64, offset: 1408)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !22, file: !21, line: 135, baseType: !121, size: 64, align: 64, offset: 1472)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !418, line: 33, baseType: !419)
!418 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!419 = !DICompositeType(tag: DW_TAG_structure_type, file: !418, line: 25, size: 256, align: 64, elements: !420)
!420 = !{!421, !422}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !419, file: !418, line: 26, baseType: !54, size: 192, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !419, file: !418, line: 27, baseType: !423, size: 64, align: 64, offset: 192)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 64, align: 64, elements: !113)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !12, line: 351, baseType: !427)
!427 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 217, size: 384, align: 64, elements: !428)
!428 = !{!429, !430, !431, !432, !440}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !427, file: !12, line: 291, baseType: !37, size: 128, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !427, file: !12, line: 292, baseType: !42, size: 64, align: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !427, file: !12, line: 293, baseType: !250, size: 64, align: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !427, file: !12, line: 349, baseType: !433, size: 32, align: 32, offset: 256)
!433 = !DICompositeType(tag: DW_TAG_structure_type, scope: !427, file: !12, line: 294, size: 32, align: 32, elements: !434)
!434 = !{!435, !436, !437, !438, !439}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !433, file: !12, line: 303, baseType: !373, size: 2, align: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !433, file: !12, line: 331, baseType: !373, size: 3, align: 32, offset: 2)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !433, file: !12, line: 336, baseType: !373, size: 1, align: 32, offset: 5)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !433, file: !12, line: 340, baseType: !373, size: 1, align: 32, offset: 6)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !433, file: !12, line: 345, baseType: !373, size: 1, align: 32, offset: 7)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !427, file: !12, line: 350, baseType: !441, size: 64, align: 64, offset: 320)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !127, line: 90, baseType: !75)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !12, line: 363, baseType: !445)
!445 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 356, size: 576, align: 64, elements: !446)
!446 = !{!447, !448, !449, !450}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !445, file: !12, line: 357, baseType: !426, size: 384, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !445, file: !12, line: 358, baseType: !42, size: 64, align: 64, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !445, file: !12, line: 360, baseType: !83, size: 64, align: 64, offset: 448)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !445, file: !12, line: 361, baseType: !42, size: 64, align: 64, offset: 512)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !12, line: 376, baseType: !453)
!453 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 368, size: 640, align: 64, elements: !454)
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !453, file: !12, line: 369, baseType: !444, size: 576, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !453, file: !12, line: 375, baseType: !457, size: 64, align: 64, offset: 576)
!457 = !DICompositeType(tag: DW_TAG_union_type, scope: !453, file: !12, line: 370, size: 64, align: 64, elements: !458)
!458 = !{!459, !460, !464, !467}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !457, file: !12, line: 371, baseType: !121, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !457, file: !12, line: 372, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !12, line: 134, baseType: !463)
!463 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !457, file: !12, line: 373, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !12, line: 129, baseType: !108)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !457, file: !12, line: 374, baseType: !468, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !12, line: 121, baseType: !373)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !462)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !469)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!477 = !{!478, !496, !539, !549, !555, !559, !562, !565, !571, !575, !582, !587, !595, !601, !623, !629, !635, !647, !657, !660, !664, !682, !707, !723, !732, !737, !740, !751, !760, !770, !781, !795, !827, !839, !845, !875, !878, !889, !892, !905, !928, !932, !936, !940, !944, !948, !952, !1020, !1027, !1031}
!478 = !DISubprogram(name: "PyCodec_Register", scope: !479, file: !479, line: 31, type: !176, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @PyCodec_Register, variables: !480)
!479 = !DIFile(filename: "Python/codecs.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!480 = !{!481, !482, !483, !490, !491, !494}
!481 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "search_function", arg: 1, scope: !478, file: !479, line: 31, type: !36)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp", scope: !478, file: !479, line: 33, type: !28)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !484, file: !479, line: 33, type: !485)
!484 = distinct !DILexicalBlock(scope: !478, file: !479, line: 33, column: 66)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !4, line: 33, baseType: !487)
!487 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !4, line: 31, size: 64, align: 64, elements: !488)
!488 = !{!489}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !487, file: !4, line: 32, baseType: !121, size: 64, align: 64)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !484, file: !479, line: 33, type: !121)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !484, file: !479, line: 33, type: !492)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !484, file: !479, line: 33, type: !495)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !4, line: 29, baseType: !3)
!496 = !DISubprogram(name: "_PyCodec_Lookup", scope: !479, file: !479, line: 100, type: !497, isLocal: false, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @_PyCodec_Lookup, variables: !499)
!497 = !DISubroutineType(types: !498)
!498 = !{!36, !60}
!499 = !{!500, !501, !502, !503, !504, !505, !506, !507, !509, !510, !511, !512, !516, !520, !524, !528, !532, !534, !536}
!500 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !496, file: !479, line: 100, type: !60)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp", scope: !496, file: !479, line: 102, type: !28)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !496, file: !479, line: 103, type: !36)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !496, file: !479, line: 103, type: !36)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !496, file: !479, line: 103, type: !36)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !496, file: !479, line: 104, type: !42)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !496, file: !479, line: 104, type: !42)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !508, file: !479, line: 111, type: !485)
!508 = distinct !DILexicalBlock(scope: !496, file: !479, line: 111, column: 46)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !508, file: !479, line: 111, type: !121)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !508, file: !479, line: 111, type: !492)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !508, file: !479, line: 111, type: !495)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !513, file: !479, line: 127, type: !36)
!513 = distinct !DILexicalBlock(scope: !514, file: !479, line: 127, column: 12)
!514 = distinct !DILexicalBlock(scope: !515, file: !479, line: 125, column: 31)
!515 = distinct !DILexicalBlock(scope: !496, file: !479, line: 125, column: 9)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !517, file: !479, line: 148, type: !36)
!517 = distinct !DILexicalBlock(scope: !518, file: !479, line: 147, column: 31)
!518 = distinct !DILexicalBlock(scope: !519, file: !479, line: 147, column: 5)
!519 = distinct !DILexicalBlock(scope: !496, file: !479, line: 147, column: 5)
!520 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !521, file: !479, line: 157, type: !36)
!521 = distinct !DILexicalBlock(scope: !522, file: !479, line: 157, column: 16)
!522 = distinct !DILexicalBlock(scope: !523, file: !479, line: 156, column: 42)
!523 = distinct !DILexicalBlock(scope: !517, file: !479, line: 156, column: 13)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !525, file: !479, line: 163, type: !36)
!525 = distinct !DILexicalBlock(scope: !526, file: !479, line: 163, column: 16)
!526 = distinct !DILexicalBlock(scope: !527, file: !479, line: 160, column: 129)
!527 = distinct !DILexicalBlock(scope: !517, file: !479, line: 160, column: 13)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !529, file: !479, line: 177, type: !36)
!529 = distinct !DILexicalBlock(scope: !530, file: !479, line: 177, column: 12)
!530 = distinct !DILexicalBlock(scope: !531, file: !479, line: 176, column: 68)
!531 = distinct !DILexicalBlock(scope: !496, file: !479, line: 176, column: 9)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !533, file: !479, line: 180, type: !36)
!533 = distinct !DILexicalBlock(scope: !496, file: !479, line: 180, column: 8)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !535, file: !479, line: 184, type: !36)
!535 = distinct !DILexicalBlock(scope: !496, file: !479, line: 184, column: 8)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !537, file: !479, line: 184, type: !36)
!537 = distinct !DILexicalBlock(scope: !538, file: !479, line: 184, column: 96)
!538 = distinct !DILexicalBlock(scope: !535, file: !479, line: 184, column: 62)
!539 = !DISubprogram(name: "PyCodec_KnownEncoding", scope: !479, file: !479, line: 190, type: !540, isLocal: false, isDefinition: true, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @PyCodec_KnownEncoding, variables: !542)
!540 = !DISubroutineType(types: !541)
!541 = !{!75, !60}
!542 = !{!543, !544, !545}
!543 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !539, file: !479, line: 190, type: !60)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codecs", scope: !539, file: !479, line: 192, type: !36)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !546, file: !479, line: 200, type: !36)
!546 = distinct !DILexicalBlock(scope: !547, file: !479, line: 200, column: 12)
!547 = distinct !DILexicalBlock(scope: !548, file: !479, line: 199, column: 10)
!548 = distinct !DILexicalBlock(scope: !539, file: !479, line: 195, column: 9)
!549 = !DISubprogram(name: "_PyCodecInfo_GetIncrementalDecoder", scope: !479, file: !479, line: 306, type: !550, isLocal: false, isDefinition: true, scopeLine: 308, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*)* @_PyCodecInfo_GetIncrementalDecoder, variables: !552)
!550 = !DISubroutineType(types: !551)
!551 = !{!36, !36, !60}
!552 = !{!553, !554}
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "codec_info", arg: 1, scope: !549, file: !479, line: 306, type: !36)
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 2, scope: !549, file: !479, line: 307, type: !60)
!555 = !DISubprogram(name: "_PyCodecInfo_GetIncrementalEncoder", scope: !479, file: !479, line: 313, type: !550, isLocal: false, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*)* @_PyCodecInfo_GetIncrementalEncoder, variables: !556)
!556 = !{!557, !558}
!557 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "codec_info", arg: 1, scope: !555, file: !479, line: 313, type: !36)
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 2, scope: !555, file: !479, line: 314, type: !60)
!559 = !DISubprogram(name: "PyCodec_Encoder", scope: !479, file: !479, line: 327, type: !497, isLocal: false, isDefinition: true, scopeLine: 328, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @PyCodec_Encoder, variables: !560)
!560 = !{!561}
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !559, file: !479, line: 327, type: !60)
!562 = !DISubprogram(name: "PyCodec_Decoder", scope: !479, file: !479, line: 332, type: !497, isLocal: false, isDefinition: true, scopeLine: 333, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @PyCodec_Decoder, variables: !563)
!563 = !{!564}
!564 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !562, file: !479, line: 332, type: !60)
!565 = !DISubprogram(name: "PyCodec_IncrementalEncoder", scope: !479, file: !479, line: 337, type: !566, isLocal: false, isDefinition: true, scopeLine: 339, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i8*)* @PyCodec_IncrementalEncoder, variables: !568)
!566 = !DISubroutineType(types: !567)
!567 = !{!36, !60, !60}
!568 = !{!569, !570}
!569 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !565, file: !479, line: 337, type: !60)
!570 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 2, scope: !565, file: !479, line: 338, type: !60)
!571 = !DISubprogram(name: "PyCodec_IncrementalDecoder", scope: !479, file: !479, line: 343, type: !566, isLocal: false, isDefinition: true, scopeLine: 345, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i8*)* @PyCodec_IncrementalDecoder, variables: !572)
!572 = !{!573, !574}
!573 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !571, file: !479, line: 343, type: !60)
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 2, scope: !571, file: !479, line: 344, type: !60)
!575 = !DISubprogram(name: "PyCodec_StreamReader", scope: !479, file: !479, line: 349, type: !576, isLocal: false, isDefinition: true, scopeLine: 352, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct._object*, i8*)* @PyCodec_StreamReader, variables: !578)
!576 = !DISubroutineType(types: !577)
!577 = !{!36, !60, !36, !60}
!578 = !{!579, !580, !581}
!579 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !575, file: !479, line: 349, type: !60)
!580 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stream", arg: 2, scope: !575, file: !479, line: 350, type: !36)
!581 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 3, scope: !575, file: !479, line: 351, type: !60)
!582 = !DISubprogram(name: "PyCodec_StreamWriter", scope: !479, file: !479, line: 356, type: !576, isLocal: false, isDefinition: true, scopeLine: 359, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct._object*, i8*)* @PyCodec_StreamWriter, variables: !583)
!583 = !{!584, !585, !586}
!584 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !582, file: !479, line: 356, type: !60)
!585 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stream", arg: 2, scope: !582, file: !479, line: 357, type: !36)
!586 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 3, scope: !582, file: !479, line: 358, type: !60)
!587 = !DISubprogram(name: "PyCodec_Encode", scope: !479, file: !479, line: 471, type: !588, isLocal: false, isDefinition: true, scopeLine: 474, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*, i8*)* @PyCodec_Encode, variables: !590)
!588 = !DISubroutineType(types: !589)
!589 = !{!36, !36, !60, !60}
!590 = !{!591, !592, !593, !594}
!591 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !587, file: !479, line: 471, type: !36)
!592 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 2, scope: !587, file: !479, line: 472, type: !60)
!593 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 3, scope: !587, file: !479, line: 473, type: !60)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "encoder", scope: !587, file: !479, line: 475, type: !36)
!595 = !DISubprogram(name: "PyCodec_Decode", scope: !479, file: !479, line: 484, type: !588, isLocal: false, isDefinition: true, scopeLine: 487, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*, i8*)* @PyCodec_Decode, variables: !596)
!596 = !{!597, !598, !599, !600}
!597 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !595, file: !479, line: 484, type: !36)
!598 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 2, scope: !595, file: !479, line: 485, type: !60)
!599 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 3, scope: !595, file: !479, line: 486, type: !60)
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoder", scope: !595, file: !479, line: 488, type: !36)
!601 = !DISubprogram(name: "_PyCodec_LookupTextEncoding", scope: !479, file: !479, line: 498, type: !566, isLocal: false, isDefinition: true, scopeLine: 500, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i8*)* @_PyCodec_LookupTextEncoding, variables: !602)
!602 = !{!603, !604, !605, !606, !607, !608, !616, !619}
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !601, file: !479, line: 498, type: !60)
!604 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alternate_command", arg: 2, scope: !601, file: !479, line: 499, type: !60)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codec", scope: !601, file: !479, line: 502, type: !36)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "attr", scope: !601, file: !479, line: 503, type: !36)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "is_text_codec", scope: !601, file: !479, line: 504, type: !75)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !609, file: !479, line: 520, type: !36)
!609 = distinct !DILexicalBlock(scope: !610, file: !479, line: 520, column: 20)
!610 = distinct !DILexicalBlock(scope: !611, file: !479, line: 519, column: 20)
!611 = distinct !DILexicalBlock(scope: !612, file: !479, line: 517, column: 17)
!612 = distinct !DILexicalBlock(scope: !613, file: !479, line: 516, column: 33)
!613 = distinct !DILexicalBlock(scope: !614, file: !479, line: 516, column: 13)
!614 = distinct !DILexicalBlock(scope: !615, file: !479, line: 514, column: 62)
!615 = distinct !DILexicalBlock(scope: !601, file: !479, line: 514, column: 9)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !617, file: !479, line: 525, type: !36)
!617 = distinct !DILexicalBlock(scope: !618, file: !479, line: 525, column: 16)
!618 = distinct !DILexicalBlock(scope: !613, file: !479, line: 523, column: 16)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !620, file: !479, line: 527, type: !36)
!620 = distinct !DILexicalBlock(scope: !621, file: !479, line: 527, column: 20)
!621 = distinct !DILexicalBlock(scope: !622, file: !479, line: 526, column: 33)
!622 = distinct !DILexicalBlock(scope: !618, file: !479, line: 526, column: 17)
!623 = !DISubprogram(name: "_PyCodec_EncodeText", scope: !479, file: !479, line: 570, type: !588, isLocal: false, isDefinition: true, scopeLine: 573, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*, i8*)* @_PyCodec_EncodeText, variables: !624)
!624 = !{!625, !626, !627, !628}
!625 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !623, file: !479, line: 570, type: !36)
!626 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 2, scope: !623, file: !479, line: 571, type: !60)
!627 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 3, scope: !623, file: !479, line: 572, type: !60)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "encoder", scope: !623, file: !479, line: 574, type: !36)
!629 = !DISubprogram(name: "_PyCodec_DecodeText", scope: !479, file: !479, line: 583, type: !588, isLocal: false, isDefinition: true, scopeLine: 586, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*, i8*)* @_PyCodec_DecodeText, variables: !630)
!630 = !{!631, !632, !633, !634}
!631 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !629, file: !479, line: 583, type: !36)
!632 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 2, scope: !629, file: !479, line: 584, type: !60)
!633 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 3, scope: !629, file: !479, line: 585, type: !60)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoder", scope: !629, file: !479, line: 587, type: !36)
!635 = !DISubprogram(name: "PyCodec_RegisterError", scope: !479, file: !479, line: 602, type: !636, isLocal: false, isDefinition: true, scopeLine: 603, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._object*)* @PyCodec_RegisterError, variables: !638)
!636 = !DISubroutineType(types: !637)
!637 = !{!75, !60, !36}
!638 = !{!639, !640, !641, !642, !644, !645, !646}
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !635, file: !479, line: 602, type: !60)
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "error", arg: 2, scope: !635, file: !479, line: 602, type: !36)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp", scope: !635, file: !479, line: 604, type: !28)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !643, file: !479, line: 604, type: !485)
!643 = distinct !DILexicalBlock(scope: !635, file: !479, line: 604, column: 66)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !643, file: !479, line: 604, type: !121)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !643, file: !479, line: 604, type: !492)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !643, file: !479, line: 604, type: !495)
!647 = !DISubprogram(name: "PyCodec_LookupError", scope: !479, file: !479, line: 618, type: !497, isLocal: false, isDefinition: true, scopeLine: 619, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @PyCodec_LookupError, variables: !648)
!648 = !{!649, !650, !651, !652, !654, !655, !656}
!649 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !647, file: !479, line: 618, type: !60)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handler", scope: !647, file: !479, line: 620, type: !36)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "interp", scope: !647, file: !479, line: 622, type: !28)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !653, file: !479, line: 622, type: !485)
!653 = distinct !DILexicalBlock(scope: !647, file: !479, line: 622, column: 66)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !653, file: !479, line: 622, type: !121)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !653, file: !479, line: 622, type: !492)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !653, file: !479, line: 622, type: !495)
!657 = !DISubprogram(name: "PyCodec_StrictErrors", scope: !479, file: !479, line: 652, type: !148, isLocal: false, isDefinition: true, scopeLine: 653, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyCodec_StrictErrors, variables: !658)
!658 = !{!659}
!659 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !657, file: !479, line: 652, type: !36)
!660 = !DISubprogram(name: "PyCodec_IgnoreErrors", scope: !479, file: !479, line: 662, type: !148, isLocal: false, isDefinition: true, scopeLine: 663, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyCodec_IgnoreErrors, variables: !661)
!661 = !{!662, !663}
!662 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !660, file: !479, line: 662, type: !36)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !660, file: !479, line: 664, type: !42)
!664 = !DISubprogram(name: "PyCodec_ReplaceErrors", scope: !479, file: !479, line: 685, type: !148, isLocal: false, isDefinition: true, scopeLine: 686, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyCodec_ReplaceErrors, variables: !665)
!665 = !{!666, !667, !668, !669, !670, !671, !674, !675, !676, !680, !681}
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !664, file: !479, line: 685, type: !36)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !664, file: !479, line: 687, type: !42)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !664, file: !479, line: 687, type: !42)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !664, file: !479, line: 687, type: !42)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !664, file: !479, line: 687, type: !42)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !672, file: !479, line: 690, type: !36)
!672 = distinct !DILexicalBlock(scope: !673, file: !479, line: 689, column: 61)
!673 = distinct !DILexicalBlock(scope: !664, file: !479, line: 689, column: 9)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !672, file: !479, line: 691, type: !75)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !672, file: !479, line: 692, type: !121)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !677, file: !479, line: 716, type: !36)
!677 = distinct !DILexicalBlock(scope: !678, file: !479, line: 715, column: 69)
!678 = distinct !DILexicalBlock(scope: !679, file: !479, line: 715, column: 14)
!679 = distinct !DILexicalBlock(scope: !673, file: !479, line: 708, column: 14)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kind", scope: !677, file: !479, line: 717, type: !75)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !677, file: !479, line: 718, type: !121)
!682 = !DISubprogram(name: "PyCodec_XMLCharRefReplaceErrors", scope: !479, file: !479, line: 740, type: !148, isLocal: false, isDefinition: true, scopeLine: 741, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyCodec_XMLCharRefReplaceErrors, variables: !683)
!683 = !{!684, !685, !688, !689, !690, !691, !692, !693, !694, !695, !696, !700, !704, !705}
!684 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !682, file: !479, line: 740, type: !36)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "restuple", scope: !686, file: !479, line: 743, type: !36)
!686 = distinct !DILexicalBlock(scope: !687, file: !479, line: 742, column: 61)
!687 = distinct !DILexicalBlock(scope: !682, file: !479, line: 742, column: 9)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "object", scope: !686, file: !479, line: 744, type: !36)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !686, file: !479, line: 745, type: !42)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !686, file: !479, line: 746, type: !42)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !686, file: !479, line: 747, type: !42)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !686, file: !479, line: 748, type: !36)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outp", scope: !686, file: !479, line: 749, type: !476)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ressize", scope: !686, file: !479, line: 750, type: !75)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch", scope: !686, file: !479, line: 751, type: !469)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !697, file: !479, line: 779, type: !36)
!697 = distinct !DILexicalBlock(scope: !698, file: !479, line: 779, column: 16)
!698 = distinct !DILexicalBlock(scope: !699, file: !479, line: 778, column: 32)
!699 = distinct !DILexicalBlock(scope: !686, file: !479, line: 778, column: 13)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "digits", scope: !701, file: !479, line: 785, type: !75)
!701 = distinct !DILexicalBlock(scope: !702, file: !479, line: 784, column: 39)
!702 = distinct !DILexicalBlock(scope: !703, file: !479, line: 784, column: 9)
!703 = distinct !DILexicalBlock(scope: !686, file: !479, line: 784, column: 9)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !701, file: !479, line: 786, type: !75)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !706, file: !479, line: 827, type: !36)
!706 = distinct !DILexicalBlock(scope: !686, file: !479, line: 827, column: 12)
!707 = !DISubprogram(name: "PyCodec_BackslashReplaceErrors", scope: !479, file: !479, line: 836, type: !148, isLocal: false, isDefinition: true, scopeLine: 837, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyCodec_BackslashReplaceErrors, variables: !708)
!708 = !{!709, !710, !713, !714, !715, !716, !717, !718, !719, !720, !721}
!709 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !707, file: !479, line: 836, type: !36)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "restuple", scope: !711, file: !479, line: 839, type: !36)
!711 = distinct !DILexicalBlock(scope: !712, file: !479, line: 838, column: 61)
!712 = distinct !DILexicalBlock(scope: !707, file: !479, line: 838, column: 9)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "object", scope: !711, file: !479, line: 840, type: !36)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !711, file: !479, line: 841, type: !42)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !711, file: !479, line: 842, type: !42)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !711, file: !479, line: 843, type: !42)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !711, file: !479, line: 844, type: !36)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outp", scope: !711, file: !479, line: 845, type: !476)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ressize", scope: !711, file: !479, line: 846, type: !75)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !711, file: !479, line: 847, type: !469)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !722, file: !479, line: 895, type: !36)
!722 = distinct !DILexicalBlock(scope: !711, file: !479, line: 895, column: 12)
!723 = !DISubprogram(name: "_Py_ANNOTATE_MEMORY_ORDER", scope: !4, file: !4, line: 59, type: !724, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32)* @_Py_ANNOTATE_MEMORY_ORDER, variables: !729)
!724 = !DISubroutineType(types: !725)
!725 = !{null, !726, !495}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64, align: 64)
!727 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!729 = !{!730, !731}
!730 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "address", arg: 1, scope: !723, file: !4, line: 59, type: !726)
!731 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 2, scope: !723, file: !4, line: 59, type: !495)
!732 = !DISubprogram(name: "_Py_atomic_thread_fence", scope: !4, file: !4, line: 51, type: !733, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @_Py_atomic_thread_fence, variables: !735)
!733 = !DISubroutineType(types: !734)
!734 = !{null, !495}
!735 = !{!736}
!736 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !732, file: !4, line: 51, type: !495)
!737 = !DISubprogram(name: "_Py_atomic_signal_fence", scope: !4, file: !4, line: 44, type: !733, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @_Py_atomic_signal_fence, variables: !738)
!738 = !{!739}
!739 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !737, file: !4, line: 44, type: !495)
!740 = !DISubprogram(name: "normalizestring", scope: !479, file: !479, line: 54, type: !497, isLocal: true, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @normalizestring, variables: !741)
!741 = !{!742, !743, !744, !745, !746, !747}
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "string", arg: 1, scope: !740, file: !479, line: 54, type: !60)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !740, file: !479, line: 56, type: !126)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !740, file: !479, line: 57, type: !126)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !740, file: !479, line: 58, type: !83)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !740, file: !479, line: 59, type: !36)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch", scope: !748, file: !479, line: 70, type: !62)
!748 = distinct !DILexicalBlock(scope: !749, file: !479, line: 69, column: 31)
!749 = distinct !DILexicalBlock(scope: !750, file: !479, line: 69, column: 5)
!750 = distinct !DILexicalBlock(scope: !740, file: !479, line: 69, column: 5)
!751 = !DISubprogram(name: "codec_makeincrementalcodec", scope: !479, file: !479, line: 248, type: !588, isLocal: true, isDefinition: true, scopeLine: 251, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*, i8*)* @codec_makeincrementalcodec, variables: !752)
!752 = !{!753, !754, !755, !756, !757, !758}
!753 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "codec_info", arg: 1, scope: !751, file: !479, line: 248, type: !36)
!754 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 2, scope: !751, file: !479, line: 249, type: !60)
!755 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attrname", arg: 3, scope: !751, file: !479, line: 250, type: !60)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !751, file: !479, line: 252, type: !36)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inccodec", scope: !751, file: !479, line: 252, type: !36)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !759, file: !479, line: 261, type: !36)
!759 = distinct !DILexicalBlock(scope: !751, file: !479, line: 261, column: 8)
!760 = !DISubprogram(name: "codec_getitem", scope: !479, file: !479, line: 232, type: !761, isLocal: true, isDefinition: true, scopeLine: 233, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i32)* @codec_getitem, variables: !763)
!761 = !DISubroutineType(types: !762)
!762 = !{!36, !60, !75}
!763 = !{!764, !765, !766, !767, !768}
!764 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !760, file: !479, line: 232, type: !60)
!765 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 2, scope: !760, file: !479, line: 232, type: !75)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codecs", scope: !760, file: !479, line: 234, type: !36)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !760, file: !479, line: 235, type: !36)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !769, file: !479, line: 241, type: !36)
!769 = distinct !DILexicalBlock(scope: !760, file: !479, line: 241, column: 8)
!770 = !DISubprogram(name: "codec_getincrementalcodec", scope: !479, file: !479, line: 266, type: !771, isLocal: true, isDefinition: true, scopeLine: 269, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i8*, i8*)* @codec_getincrementalcodec, variables: !773)
!771 = !DISubroutineType(types: !772)
!772 = !{!36, !60, !60, !60}
!773 = !{!774, !775, !776, !777, !778, !779}
!774 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !770, file: !479, line: 266, type: !60)
!775 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 2, scope: !770, file: !479, line: 267, type: !60)
!776 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attrname", arg: 3, scope: !770, file: !479, line: 268, type: !60)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codec_info", scope: !770, file: !479, line: 270, type: !36)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !770, file: !479, line: 270, type: !36)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !780, file: !479, line: 276, type: !36)
!780 = distinct !DILexicalBlock(scope: !770, file: !479, line: 276, column: 8)
!781 = !DISubprogram(name: "codec_getstreamcodec", scope: !479, file: !479, line: 283, type: !782, isLocal: true, isDefinition: true, scopeLine: 287, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct._object*, i8*, i32)* @codec_getstreamcodec, variables: !785)
!782 = !DISubroutineType(types: !783)
!783 = !{!36, !60, !36, !60, !784}
!784 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!785 = !{!786, !787, !788, !789, !790, !791, !792, !793}
!786 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !781, file: !479, line: 283, type: !60)
!787 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stream", arg: 2, scope: !781, file: !479, line: 284, type: !36)
!788 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 3, scope: !781, file: !479, line: 285, type: !60)
!789 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 4, scope: !781, file: !479, line: 286, type: !784)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codecs", scope: !781, file: !479, line: 288, type: !36)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "streamcodec", scope: !781, file: !479, line: 288, type: !36)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codeccls", scope: !781, file: !479, line: 288, type: !36)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !794, file: !479, line: 299, type: !36)
!794 = distinct !DILexicalBlock(scope: !781, file: !479, line: 299, column: 8)
!795 = !DISubprogram(name: "_PyCodec_EncodeInternal", scope: !479, file: !479, line: 385, type: !796, isLocal: true, isDefinition: true, scopeLine: 389, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i8*, i8*)* @_PyCodec_EncodeInternal, variables: !798)
!796 = !DISubroutineType(types: !797)
!797 = !{!36, !36, !36, !60, !60}
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806, !808, !810, !812, !814, !817, !819, !822, !824}
!799 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !795, file: !479, line: 385, type: !36)
!800 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoder", arg: 2, scope: !795, file: !479, line: 386, type: !36)
!801 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 3, scope: !795, file: !479, line: 387, type: !60)
!802 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 4, scope: !795, file: !479, line: 388, type: !60)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !795, file: !479, line: 390, type: !36)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !795, file: !479, line: 390, type: !36)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !795, file: !479, line: 391, type: !36)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !807, file: !479, line: 413, type: !36)
!807 = distinct !DILexicalBlock(scope: !795, file: !479, line: 413, column: 8)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !809, file: !479, line: 414, type: !36)
!809 = distinct !DILexicalBlock(scope: !795, file: !479, line: 414, column: 8)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !811, file: !479, line: 415, type: !36)
!811 = distinct !DILexicalBlock(scope: !795, file: !479, line: 415, column: 8)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !813, file: !479, line: 419, type: !36)
!813 = distinct !DILexicalBlock(scope: !795, file: !479, line: 419, column: 8)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !815, file: !479, line: 419, type: !36)
!815 = distinct !DILexicalBlock(scope: !816, file: !479, line: 419, column: 98)
!816 = distinct !DILexicalBlock(scope: !813, file: !479, line: 419, column: 64)
!817 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !818, file: !479, line: 420, type: !36)
!818 = distinct !DILexicalBlock(scope: !795, file: !479, line: 420, column: 8)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !820, file: !479, line: 420, type: !36)
!820 = distinct !DILexicalBlock(scope: !821, file: !479, line: 420, column: 96)
!821 = distinct !DILexicalBlock(scope: !818, file: !479, line: 420, column: 62)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !823, file: !479, line: 421, type: !36)
!823 = distinct !DILexicalBlock(scope: !795, file: !479, line: 421, column: 8)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !825, file: !479, line: 421, type: !36)
!825 = distinct !DILexicalBlock(scope: !826, file: !479, line: 421, column: 99)
!826 = distinct !DILexicalBlock(scope: !823, file: !479, line: 421, column: 65)
!827 = !DISubprogram(name: "args_tuple", scope: !479, file: !479, line: 206, type: !550, isLocal: true, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*)* @args_tuple, variables: !828)
!828 = !{!829, !830, !831, !832, !835}
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !827, file: !479, line: 206, type: !36)
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 2, scope: !827, file: !479, line: 207, type: !60)
!831 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !827, file: !479, line: 209, type: !36)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !833, file: !479, line: 217, type: !36)
!833 = distinct !DILexicalBlock(scope: !834, file: !479, line: 216, column: 17)
!834 = distinct !DILexicalBlock(scope: !827, file: !479, line: 216, column: 9)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !836, file: !479, line: 221, type: !36)
!836 = distinct !DILexicalBlock(scope: !837, file: !479, line: 221, column: 16)
!837 = distinct !DILexicalBlock(scope: !838, file: !479, line: 220, column: 30)
!838 = distinct !DILexicalBlock(scope: !833, file: !479, line: 220, column: 13)
!839 = !DISubprogram(name: "wrap_codec_error", scope: !479, file: !479, line: 368, type: !840, isLocal: true, isDefinition: true, scopeLine: 370, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i8*)* @wrap_codec_error, variables: !842)
!840 = !DISubroutineType(types: !841)
!841 = !{null, !60, !60}
!842 = !{!843, !844}
!843 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "operation", arg: 1, scope: !839, file: !479, line: 368, type: !60)
!844 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 2, scope: !839, file: !479, line: 369, type: !60)
!845 = !DISubprogram(name: "_PyCodec_DecodeInternal", scope: !479, file: !479, line: 431, type: !796, isLocal: true, isDefinition: true, scopeLine: 435, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i8*, i8*)* @_PyCodec_DecodeInternal, variables: !846)
!846 = !{!847, !848, !849, !850, !851, !852, !853, !854, !856, !858, !860, !862, !865, !867, !870, !872}
!847 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !845, file: !479, line: 431, type: !36)
!848 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "decoder", arg: 2, scope: !845, file: !479, line: 432, type: !36)
!849 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 3, scope: !845, file: !479, line: 433, type: !60)
!850 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "errors", arg: 4, scope: !845, file: !479, line: 434, type: !60)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !845, file: !479, line: 436, type: !36)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !845, file: !479, line: 436, type: !36)
!853 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !845, file: !479, line: 437, type: !36)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !855, file: !479, line: 458, type: !36)
!855 = distinct !DILexicalBlock(scope: !845, file: !479, line: 458, column: 8)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !857, file: !479, line: 459, type: !36)
!857 = distinct !DILexicalBlock(scope: !845, file: !479, line: 459, column: 8)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !859, file: !479, line: 460, type: !36)
!859 = distinct !DILexicalBlock(scope: !845, file: !479, line: 460, column: 8)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !861, file: !479, line: 464, type: !36)
!861 = distinct !DILexicalBlock(scope: !845, file: !479, line: 464, column: 8)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !863, file: !479, line: 464, type: !36)
!863 = distinct !DILexicalBlock(scope: !864, file: !479, line: 464, column: 96)
!864 = distinct !DILexicalBlock(scope: !861, file: !479, line: 464, column: 62)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !866, file: !479, line: 465, type: !36)
!866 = distinct !DILexicalBlock(scope: !845, file: !479, line: 465, column: 8)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !868, file: !479, line: 465, type: !36)
!868 = distinct !DILexicalBlock(scope: !869, file: !479, line: 465, column: 99)
!869 = distinct !DILexicalBlock(scope: !866, file: !479, line: 465, column: 65)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !871, file: !479, line: 466, type: !36)
!871 = distinct !DILexicalBlock(scope: !845, file: !479, line: 466, column: 8)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !873, file: !479, line: 466, type: !36)
!873 = distinct !DILexicalBlock(scope: !874, file: !479, line: 466, column: 98)
!874 = distinct !DILexicalBlock(scope: !871, file: !479, line: 466, column: 64)
!875 = !DISubprogram(name: "_PyCodec_TextEncoder", scope: !479, file: !479, line: 560, type: !497, isLocal: true, isDefinition: true, scopeLine: 561, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @_PyCodec_TextEncoder, variables: !876)
!876 = !{!877}
!877 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !875, file: !479, line: 560, type: !60)
!878 = !DISubprogram(name: "codec_getitem_checked", scope: !479, file: !479, line: 543, type: !879, isLocal: true, isDefinition: true, scopeLine: 546, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i8*, i32)* @codec_getitem_checked, variables: !881)
!879 = !DISubroutineType(types: !880)
!880 = !{!36, !60, !60, !75}
!881 = !{!882, !883, !884, !885, !886, !887}
!882 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !878, file: !479, line: 543, type: !60)
!883 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alternate_command", arg: 2, scope: !878, file: !479, line: 544, type: !60)
!884 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "index", arg: 3, scope: !878, file: !479, line: 545, type: !75)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codec", scope: !878, file: !479, line: 547, type: !36)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !878, file: !479, line: 548, type: !36)
!887 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !888, file: !479, line: 556, type: !36)
!888 = distinct !DILexicalBlock(scope: !878, file: !479, line: 556, column: 8)
!889 = !DISubprogram(name: "_PyCodec_TextDecoder", scope: !479, file: !479, line: 565, type: !497, isLocal: true, isDefinition: true, scopeLine: 566, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @_PyCodec_TextDecoder, variables: !890)
!890 = !{!891}
!891 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !889, file: !479, line: 565, type: !60)
!892 = !DISubprogram(name: "wrong_exception_type", scope: !479, file: !479, line: 636, type: !68, isLocal: true, isDefinition: true, scopeLine: 637, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @wrong_exception_type, variables: !893)
!893 = !{!894, !895, !896, !899, !901}
!894 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !892, file: !479, line: 636, type: !36)
!895 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !892, file: !479, line: 640, type: !36)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !897, file: !479, line: 642, type: !36)
!897 = distinct !DILexicalBlock(scope: !898, file: !479, line: 641, column: 29)
!898 = distinct !DILexicalBlock(scope: !892, file: !479, line: 641, column: 9)
!899 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !900, file: !479, line: 643, type: !36)
!900 = distinct !DILexicalBlock(scope: !897, file: !479, line: 643, column: 12)
!901 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !902, file: !479, line: 647, type: !36)
!902 = distinct !DILexicalBlock(scope: !903, file: !479, line: 647, column: 16)
!903 = distinct !DILexicalBlock(scope: !904, file: !479, line: 644, column: 33)
!904 = distinct !DILexicalBlock(scope: !897, file: !479, line: 644, column: 13)
