; ModuleID = 'programs_new/Python-new/complexobject.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !390, globals: !747)
!1 = !DIFile(filename: "complexobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !102, !50, !28, !368, !370, !231, !371, !389}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyComplexObject", file: !13, line: 44, baseType: !14)
!13 = !DIFile(filename: "Include/complexobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!14 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 41, size: 256, align: 64, elements: !15)
!15 = !{!16, !363}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !14, file: !13, line: 42, baseType: !17, size: 128, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !18, line: 109, baseType: !19)
!18 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !18, line: 105, size: 128, align: 64, elements: !20)
!20 = !{!21, !29}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !19, file: !18, line: 107, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !23, line: 177, baseType: !24)
!23 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !25, line: 102, baseType: !26)
!25 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !27, line: 181, baseType: !28)
!27 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!28 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !19, file: !18, line: 108, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !18, line: 334, size: 3200, align: 64, elements: !32)
!32 = !{!33, !39, !43, !44, !45, !51, !115, !120, !125, !126, !131, !183, !214, !226, !232, !233, !234, !236, !238, !269, !270, !271, !280, !281, !286, !287, !289, !291, !301, !311, !329, !330, !331, !333, !335, !336, !338, !343, !348, !353, !354, !355, !356, !357, !358, !359, !360, !362}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !18, line: 335, baseType: !34, size: 192, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !18, line: 114, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 111, size: 192, align: 64, elements: !36)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !35, file: !18, line: 112, baseType: !17, size: 128, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !35, file: !18, line: 113, baseType: !22, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !31, file: !18, line: 336, baseType: !40, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !31, file: !18, line: 337, baseType: !22, size: 64, align: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !31, file: !18, line: 337, baseType: !22, size: 64, align: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !31, file: !18, line: 341, baseType: !46, size: 64, align: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !18, line: 308, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !50}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !31, file: !18, line: 342, baseType: !52, size: 64, align: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !18, line: 314, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !50, !57, !56}
!56 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !25, line: 48, baseType: !59)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 246, size: 1728, align: 64, elements: !61)
!60 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!61 = !{!62, !63, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !83, !84, !85, !86, !88, !90, !92, !96, !99, !101, !103, !104, !105, !106, !110, !111}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !59, file: !60, line: 247, baseType: !56, size: 32, align: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !59, file: !60, line: 252, baseType: !64, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !59, file: !60, line: 253, baseType: !64, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !59, file: !60, line: 254, baseType: !64, size: 64, align: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !59, file: !60, line: 255, baseType: !64, size: 64, align: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !59, file: !60, line: 256, baseType: !64, size: 64, align: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !59, file: !60, line: 257, baseType: !64, size: 64, align: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !59, file: !60, line: 258, baseType: !64, size: 64, align: 64, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !59, file: !60, line: 259, baseType: !64, size: 64, align: 64, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !59, file: !60, line: 261, baseType: !64, size: 64, align: 64, offset: 576)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !59, file: !60, line: 262, baseType: !64, size: 64, align: 64, offset: 640)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !59, file: !60, line: 263, baseType: !64, size: 64, align: 64, offset: 704)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !59, file: !60, line: 265, baseType: !76, size: 64, align: 64, offset: 768)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !60, line: 161, size: 192, align: 64, elements: !78)
!78 = !{!79, !80, !82}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !77, file: !60, line: 162, baseType: !76, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !77, file: !60, line: 163, baseType: !81, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !77, file: !60, line: 167, baseType: !56, size: 32, align: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !59, file: !60, line: 267, baseType: !81, size: 64, align: 64, offset: 832)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !59, file: !60, line: 269, baseType: !56, size: 32, align: 32, offset: 896)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !59, file: !60, line: 273, baseType: !56, size: 32, align: 32, offset: 928)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !59, file: !60, line: 275, baseType: !87, size: 64, align: 64, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !27, line: 140, baseType: !28)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !59, file: !60, line: 279, baseType: !89, size: 16, align: 16, offset: 1024)
!89 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !59, file: !60, line: 280, baseType: !91, size: 8, align: 8, offset: 1040)
!91 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !59, file: !60, line: 281, baseType: !93, size: 8, align: 8, offset: 1048)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 8, align: 8, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 1)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !59, file: !60, line: 285, baseType: !97, size: 64, align: 64, offset: 1088)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !60, line: 155, baseType: null)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !59, file: !60, line: 294, baseType: !100, size: 64, align: 64, offset: 1152)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !27, line: 141, baseType: !28)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !59, file: !60, line: 303, baseType: !102, size: 64, align: 64, offset: 1216)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !59, file: !60, line: 304, baseType: !102, size: 64, align: 64, offset: 1280)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !59, file: !60, line: 305, baseType: !102, size: 64, align: 64, offset: 1344)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !59, file: !60, line: 306, baseType: !102, size: 64, align: 64, offset: 1408)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !59, file: !60, line: 307, baseType: !107, size: 64, align: 64, offset: 1472)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 62, baseType: !109)
!108 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!109 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !59, file: !60, line: 309, baseType: !56, size: 32, align: 32, offset: 1536)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !59, file: !60, line: 311, baseType: !112, size: 160, align: 8, offset: 1568)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 160, align: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 20)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !31, file: !18, line: 343, baseType: !116, size: 64, align: 64, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !18, line: 316, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!50, !50, !64}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !31, file: !18, line: 344, baseType: !121, size: 64, align: 64, offset: 576)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !18, line: 318, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!56, !50, !64, !50}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !31, file: !18, line: 345, baseType: !102, size: 64, align: 64, offset: 640)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !31, file: !18, line: 346, baseType: !127, size: 64, align: 64, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !18, line: 320, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!50, !50}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !31, file: !18, line: 350, baseType: !132, size: 64, align: 64, offset: 768)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !18, line: 278, baseType: !134)
!134 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 236, size: 2176, align: 64, elements: !135)
!135 = !{!136, !141, !142, !143, !144, !145, !150, !152, !153, !154, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !134, file: !18, line: 241, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !18, line: 166, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!50, !50, !50}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !134, file: !18, line: 242, baseType: !137, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !134, file: !18, line: 243, baseType: !137, size: 64, align: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !134, file: !18, line: 244, baseType: !137, size: 64, align: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !134, file: !18, line: 245, baseType: !137, size: 64, align: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !134, file: !18, line: 246, baseType: !146, size: 64, align: 64, offset: 320)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !18, line: 167, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!50, !50, !50, !50}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !134, file: !18, line: 247, baseType: !151, size: 64, align: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !18, line: 165, baseType: !128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !134, file: !18, line: 248, baseType: !151, size: 64, align: 64, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !134, file: !18, line: 249, baseType: !151, size: 64, align: 64, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !134, file: !18, line: 250, baseType: !155, size: 64, align: 64, offset: 576)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !18, line: 168, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!56, !50}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !134, file: !18, line: 251, baseType: !151, size: 64, align: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !134, file: !18, line: 252, baseType: !137, size: 64, align: 64, offset: 704)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !134, file: !18, line: 253, baseType: !137, size: 64, align: 64, offset: 768)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !134, file: !18, line: 254, baseType: !137, size: 64, align: 64, offset: 832)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !134, file: !18, line: 255, baseType: !137, size: 64, align: 64, offset: 896)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !134, file: !18, line: 256, baseType: !137, size: 64, align: 64, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !134, file: !18, line: 257, baseType: !151, size: 64, align: 64, offset: 1024)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !134, file: !18, line: 258, baseType: !102, size: 64, align: 64, offset: 1088)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !134, file: !18, line: 259, baseType: !151, size: 64, align: 64, offset: 1152)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !134, file: !18, line: 261, baseType: !137, size: 64, align: 64, offset: 1216)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !134, file: !18, line: 262, baseType: !137, size: 64, align: 64, offset: 1280)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !134, file: !18, line: 263, baseType: !137, size: 64, align: 64, offset: 1344)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !134, file: !18, line: 264, baseType: !137, size: 64, align: 64, offset: 1408)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !134, file: !18, line: 265, baseType: !146, size: 64, align: 64, offset: 1472)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !134, file: !18, line: 266, baseType: !137, size: 64, align: 64, offset: 1536)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !134, file: !18, line: 267, baseType: !137, size: 64, align: 64, offset: 1600)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !134, file: !18, line: 268, baseType: !137, size: 64, align: 64, offset: 1664)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !134, file: !18, line: 269, baseType: !137, size: 64, align: 64, offset: 1728)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !134, file: !18, line: 270, baseType: !137, size: 64, align: 64, offset: 1792)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !134, file: !18, line: 272, baseType: !137, size: 64, align: 64, offset: 1856)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !134, file: !18, line: 273, baseType: !137, size: 64, align: 64, offset: 1920)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !134, file: !18, line: 274, baseType: !137, size: 64, align: 64, offset: 1984)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !134, file: !18, line: 275, baseType: !137, size: 64, align: 64, offset: 2048)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !134, file: !18, line: 277, baseType: !151, size: 64, align: 64, offset: 2112)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !31, file: !18, line: 351, baseType: !184, size: 64, align: 64, offset: 832)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !18, line: 292, baseType: !186)
!186 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 280, size: 640, align: 64, elements: !187)
!187 = !{!188, !193, !194, !199, !200, !201, !206, !207, !212, !213}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !186, file: !18, line: 281, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !18, line: 169, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!22, !50}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !186, file: !18, line: 282, baseType: !137, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !186, file: !18, line: 283, baseType: !195, size: 64, align: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !18, line: 170, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!50, !50, !22}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !186, file: !18, line: 284, baseType: !195, size: 64, align: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !186, file: !18, line: 285, baseType: !102, size: 64, align: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !186, file: !18, line: 286, baseType: !202, size: 64, align: 64, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !18, line: 172, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!56, !50, !22, !50}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !186, file: !18, line: 287, baseType: !102, size: 64, align: 64, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !186, file: !18, line: 288, baseType: !208, size: 64, align: 64, offset: 448)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !18, line: 231, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!56, !50, !50}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !186, file: !18, line: 290, baseType: !137, size: 64, align: 64, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !186, file: !18, line: 291, baseType: !195, size: 64, align: 64, offset: 576)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !31, file: !18, line: 352, baseType: !215, size: 64, align: 64, offset: 896)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !18, line: 298, baseType: !217)
!217 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 294, size: 192, align: 64, elements: !218)
!218 = !{!219, !220, !221}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !217, file: !18, line: 295, baseType: !189, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !217, file: !18, line: 296, baseType: !137, size: 64, align: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !217, file: !18, line: 297, baseType: !222, size: 64, align: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !18, line: 174, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!56, !50, !50, !50}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !31, file: !18, line: 356, baseType: !227, size: 64, align: 64, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !18, line: 321, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!231, !50}
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !23, line: 186, baseType: !22)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !31, file: !18, line: 357, baseType: !146, size: 64, align: 64, offset: 1024)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !31, file: !18, line: 358, baseType: !127, size: 64, align: 64, offset: 1088)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !31, file: !18, line: 359, baseType: !235, size: 64, align: 64, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !18, line: 317, baseType: !138)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !31, file: !18, line: 360, baseType: !237, size: 64, align: 64, offset: 1216)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !18, line: 319, baseType: !223)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !31, file: !18, line: 363, baseType: !239, size: 64, align: 64, offset: 1280)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !18, line: 304, baseType: !241)
!241 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 301, size: 128, align: 64, elements: !242)
!242 = !{!243, !264}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !241, file: !18, line: 302, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !18, line: 193, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!56, !50, !248, !56}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !18, line: 191, baseType: !250)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !18, line: 178, size: 640, align: 64, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !261, !262, !263}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !250, file: !18, line: 179, baseType: !102, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !250, file: !18, line: 180, baseType: !50, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !250, file: !18, line: 181, baseType: !22, size: 64, align: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !250, file: !18, line: 182, baseType: !22, size: 64, align: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !250, file: !18, line: 184, baseType: !56, size: 32, align: 32, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !250, file: !18, line: 185, baseType: !56, size: 32, align: 32, offset: 288)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !250, file: !18, line: 186, baseType: !64, size: 64, align: 64, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !250, file: !18, line: 187, baseType: !260, size: 64, align: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !250, file: !18, line: 188, baseType: !260, size: 64, align: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !250, file: !18, line: 189, baseType: !260, size: 64, align: 64, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !250, file: !18, line: 190, baseType: !102, size: 64, align: 64, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !241, file: !18, line: 303, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !18, line: 194, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !50, !248}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !31, file: !18, line: 366, baseType: !109, size: 64, align: 64, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !31, file: !18, line: 368, baseType: !40, size: 64, align: 64, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !31, file: !18, line: 372, baseType: !272, size: 64, align: 64, offset: 1472)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !18, line: 233, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!56, !50, !276, !102}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !18, line: 232, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!56, !50, !102}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !31, file: !18, line: 375, baseType: !155, size: 64, align: 64, offset: 1536)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !31, file: !18, line: 379, baseType: !282, size: 64, align: 64, offset: 1600)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !18, line: 322, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!50, !50, !50, !56}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !31, file: !18, line: 382, baseType: !22, size: 64, align: 64, offset: 1664)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !31, file: !18, line: 385, baseType: !288, size: 64, align: 64, offset: 1728)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !18, line: 323, baseType: !128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !31, file: !18, line: 386, baseType: !290, size: 64, align: 64, offset: 1792)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !18, line: 324, baseType: !128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !31, file: !18, line: 389, baseType: !292, size: 64, align: 64, offset: 1856)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !294, line: 40, size: 256, align: 64, elements: !295)
!294 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!295 = !{!296, !297, !299, !300}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !293, file: !294, line: 41, baseType: !40, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !293, file: !294, line: 42, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !294, line: 18, baseType: !138)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !293, file: !294, line: 43, baseType: !56, size: 32, align: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !293, file: !294, line: 45, baseType: !40, size: 64, align: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !31, file: !18, line: 390, baseType: !302, size: 64, align: 64, offset: 1920)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !304, line: 18, size: 320, align: 64, elements: !305)
!304 = !DIFile(filename: "Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!305 = !{!306, !307, !308, !309, !310}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !303, file: !304, line: 19, baseType: !64, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !303, file: !304, line: 20, baseType: !56, size: 32, align: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !303, file: !304, line: 21, baseType: !22, size: 64, align: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !303, file: !304, line: 22, baseType: !56, size: 32, align: 32, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !303, file: !304, line: 23, baseType: !64, size: 64, align: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !31, file: !18, line: 391, baseType: !312, size: 64, align: 64, offset: 1984)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !314, line: 11, size: 320, align: 64, elements: !315)
!314 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!315 = !{!316, !317, !322, !327, !328}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !313, file: !314, line: 12, baseType: !64, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !313, file: !314, line: 13, baseType: !318, size: 64, align: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !314, line: 8, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!50, !50, !102}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !313, file: !314, line: 14, baseType: !323, size: 64, align: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !314, line: 9, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!56, !50, !50, !102}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !313, file: !314, line: 15, baseType: !64, size: 64, align: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !313, file: !314, line: 16, baseType: !102, size: 64, align: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !31, file: !18, line: 392, baseType: !30, size: 64, align: 64, offset: 2048)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !31, file: !18, line: 393, baseType: !50, size: 64, align: 64, offset: 2112)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !31, file: !18, line: 394, baseType: !332, size: 64, align: 64, offset: 2176)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !18, line: 325, baseType: !147)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !31, file: !18, line: 395, baseType: !334, size: 64, align: 64, offset: 2240)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !18, line: 326, baseType: !223)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !31, file: !18, line: 396, baseType: !22, size: 64, align: 64, offset: 2304)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !31, file: !18, line: 397, baseType: !337, size: 64, align: 64, offset: 2368)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !18, line: 327, baseType: !223)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !31, file: !18, line: 398, baseType: !339, size: 64, align: 64, offset: 2432)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !18, line: 329, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!50, !30, !22}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !31, file: !18, line: 399, baseType: !344, size: 64, align: 64, offset: 2496)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !18, line: 328, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!50, !30, !50, !50}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !31, file: !18, line: 400, baseType: !349, size: 64, align: 64, offset: 2560)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !18, line: 307, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !102}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !31, file: !18, line: 401, baseType: !155, size: 64, align: 64, offset: 2624)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !31, file: !18, line: 402, baseType: !50, size: 64, align: 64, offset: 2688)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !31, file: !18, line: 403, baseType: !50, size: 64, align: 64, offset: 2752)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !31, file: !18, line: 404, baseType: !50, size: 64, align: 64, offset: 2816)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !31, file: !18, line: 405, baseType: !50, size: 64, align: 64, offset: 2880)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !31, file: !18, line: 406, baseType: !50, size: 64, align: 64, offset: 2944)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !31, file: !18, line: 407, baseType: !46, size: 64, align: 64, offset: 3008)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !31, file: !18, line: 410, baseType: !361, size: 32, align: 32, offset: 3072)
!361 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !31, file: !18, line: 412, baseType: !46, size: 64, align: 64, offset: 3136)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "cval", scope: !14, file: !13, line: 43, baseType: !364, size: 128, align: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_complex", file: !13, line: 13, baseType: !365)
!365 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 10, size: 128, align: 64, elements: !366)
!366 = !{!367, !369}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !365, file: !13, line: 11, baseType: !368, size: 64, align: 64)
!368 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !365, file: !13, line: 12, baseType: !368, size: 64, align: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_uhash_t", file: !23, line: 189, baseType: !107)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !373)
!373 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !374)
!374 = !{!375, !376, !377, !378, !386}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !373, file: !4, line: 291, baseType: !17, size: 128, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !373, file: !4, line: 292, baseType: !22, size: 64, align: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !373, file: !4, line: 293, baseType: !231, size: 64, align: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !373, file: !4, line: 349, baseType: !379, size: 32, align: 32, offset: 256)
!379 = !DICompositeType(tag: DW_TAG_structure_type, scope: !373, file: !4, line: 294, size: 32, align: 32, elements: !380)
!380 = !{!381, !382, !383, !384, !385}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !379, file: !4, line: 303, baseType: !361, size: 2, align: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !379, file: !4, line: 331, baseType: !361, size: 3, align: 32, offset: 2)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !379, file: !4, line: 336, baseType: !361, size: 1, align: 32, offset: 5)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !379, file: !4, line: 340, baseType: !361, size: 1, align: 32, offset: 6)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !379, file: !4, line: 345, baseType: !361, size: 1, align: 32, offset: 7)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !373, file: !4, line: 350, baseType: !387, size: 64, align: 64, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !108, line: 90, baseType: !56)
!389 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!390 = !{!391, !399, !404, !410, !415, !432, !441, !447, !453, !460, !465, !468, !479, !492, !495, !508, !515, !524, !531, !538, !542, !546, !556, !563, !570, !574, !577, !581, !586, !589, !592, !596, !603, !611, !631, !635, !639, !660, !707, !732, !740}
!391 = !DISubprogram(name: "_Py_c_sum", scope: !392, file: !392, line: 16, type: !393, isLocal: false, isDefinition: true, scopeLine: 17, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double, double, double)* @_Py_c_sum, variables: !395)
!392 = !DIFile(filename: "Objects/complexobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!393 = !DISubroutineType(types: !394)
!394 = !{!364, !364, !364}
!395 = !{!396, !397, !398}
!396 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !391, file: !392, line: 16, type: !364)
!397 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !391, file: !392, line: 16, type: !364)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !391, file: !392, line: 18, type: !364)
!399 = !DISubprogram(name: "_Py_c_diff", scope: !392, file: !392, line: 25, type: !393, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double, double, double)* @_Py_c_diff, variables: !400)
!400 = !{!401, !402, !403}
!401 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !399, file: !392, line: 25, type: !364)
!402 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !399, file: !392, line: 25, type: !364)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !399, file: !392, line: 27, type: !364)
!404 = !DISubprogram(name: "_Py_c_neg", scope: !392, file: !392, line: 34, type: !405, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double)* @_Py_c_neg, variables: !407)
!405 = !DISubroutineType(types: !406)
!406 = !{!364, !364}
!407 = !{!408, !409}
!408 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !404, file: !392, line: 34, type: !364)
!409 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !404, file: !392, line: 36, type: !364)
!410 = !DISubprogram(name: "_Py_c_prod", scope: !392, file: !392, line: 43, type: !393, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double, double, double)* @_Py_c_prod, variables: !411)
!411 = !{!412, !413, !414}
!412 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !410, file: !392, line: 43, type: !364)
!413 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !410, file: !392, line: 43, type: !364)
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !410, file: !392, line: 45, type: !364)
!415 = !DISubprogram(name: "_Py_c_quot", scope: !392, file: !392, line: 52, type: !393, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double, double, double)* @_Py_c_quot, variables: !416)
!416 = !{!417, !418, !419, !420, !422, !423, !428, !429, !431}
!417 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !415, file: !392, line: 52, type: !364)
!418 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !415, file: !392, line: 52, type: !364)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !415, file: !392, line: 77, type: !364)
!420 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "abs_breal", scope: !415, file: !392, line: 78, type: !421)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "abs_bimag", scope: !415, file: !392, line: 79, type: !421)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ratio", scope: !424, file: !392, line: 88, type: !421)
!424 = distinct !DILexicalBlock(scope: !425, file: !392, line: 87, column: 14)
!425 = distinct !DILexicalBlock(scope: !426, file: !392, line: 83, column: 13)
!426 = distinct !DILexicalBlock(scope: !427, file: !392, line: 81, column: 34)
!427 = distinct !DILexicalBlock(scope: !415, file: !392, line: 81, column: 10)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "denom", scope: !424, file: !392, line: 89, type: !421)
!429 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ratio", scope: !430, file: !392, line: 96, type: !421)
!430 = distinct !DILexicalBlock(scope: !427, file: !392, line: 94, column: 10)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "denom", scope: !430, file: !392, line: 97, type: !421)
!432 = !DISubprogram(name: "_Py_c_pow", scope: !392, file: !392, line: 106, type: !393, isLocal: false, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double, double, double)* @_Py_c_pow, variables: !433)
!433 = !{!434, !435, !436, !437, !438, !439, !440}
!434 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !432, file: !392, line: 106, type: !364)
!435 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !432, file: !392, line: 106, type: !364)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !432, file: !392, line: 108, type: !364)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vabs", scope: !432, file: !392, line: 109, type: !368)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !432, file: !392, line: 109, type: !368)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "at", scope: !432, file: !392, line: 109, type: !368)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "phase", scope: !432, file: !392, line: 109, type: !368)
!441 = !DISubprogram(name: "_Py_c_abs", scope: !392, file: !392, line: 169, type: !442, isLocal: false, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: true, function: double (double, double)* @_Py_c_abs, variables: !444)
!442 = !DISubroutineType(types: !443)
!443 = !{!368, !364}
!444 = !{!445, !446}
!445 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 1, scope: !441, file: !392, line: 169, type: !364)
!446 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !441, file: !392, line: 172, type: !368)
!447 = !DISubprogram(name: "PyComplex_FromCComplex", scope: !392, file: !392, line: 212, type: !448, isLocal: false, isDefinition: true, scopeLine: 213, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (double, double)* @PyComplex_FromCComplex, variables: !450)
!448 = !DISubroutineType(types: !449)
!449 = !{!50, !364}
!450 = !{!451, !452}
!451 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cval", arg: 1, scope: !447, file: !392, line: 212, type: !364)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !447, file: !392, line: 214, type: !11)
!453 = !DISubprogram(name: "PyComplex_FromDoubles", scope: !392, file: !392, line: 235, type: !454, isLocal: false, isDefinition: true, scopeLine: 236, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (double, double)* @PyComplex_FromDoubles, variables: !456)
!454 = !DISubroutineType(types: !455)
!455 = !{!50, !368, !368}
!456 = !{!457, !458, !459}
!457 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "real", arg: 1, scope: !453, file: !392, line: 235, type: !368)
!458 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "imag", arg: 2, scope: !453, file: !392, line: 235, type: !368)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !453, file: !392, line: 237, type: !364)
!460 = !DISubprogram(name: "PyComplex_RealAsDouble", scope: !392, file: !392, line: 244, type: !461, isLocal: false, isDefinition: true, scopeLine: 245, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct._object*)* @PyComplex_RealAsDouble, variables: !463)
!461 = !DISubroutineType(types: !462)
!462 = !{!368, !50}
!463 = !{!464}
!464 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !460, file: !392, line: 244, type: !50)
!465 = !DISubprogram(name: "PyComplex_ImagAsDouble", scope: !392, file: !392, line: 255, type: !461, isLocal: false, isDefinition: true, scopeLine: 256, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct._object*)* @PyComplex_ImagAsDouble, variables: !466)
!466 = !{!467}
!467 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !465, file: !392, line: 255, type: !50)
!468 = !DISubprogram(name: "PyComplex_AsCComplex", scope: !392, file: !392, line: 286, type: !469, isLocal: false, isDefinition: true, scopeLine: 287, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (%struct._object*)* @PyComplex_AsCComplex, variables: !471)
!469 = !DISubroutineType(types: !470)
!470 = !{!364, !50}
!471 = !{!472, !473, !474, !475}
!472 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !468, file: !392, line: 286, type: !50)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cv", scope: !468, file: !392, line: 288, type: !364)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newop", scope: !468, file: !392, line: 289, type: !50)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !476, file: !392, line: 306, type: !50)
!476 = distinct !DILexicalBlock(scope: !477, file: !392, line: 306, column: 12)
!477 = distinct !DILexicalBlock(scope: !478, file: !392, line: 304, column: 16)
!478 = distinct !DILexicalBlock(scope: !468, file: !392, line: 304, column: 9)
!479 = !DISubprogram(name: "try_complex_special_method", scope: !392, file: !392, line: 266, type: !129, isLocal: true, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @try_complex_special_method, variables: !480)
!480 = !{!481, !482, !483, !486, !488}
!481 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !479, file: !392, line: 266, type: !50)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !479, file: !392, line: 267, type: !50)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !484, file: !392, line: 272, type: !50)
!484 = distinct !DILexicalBlock(scope: !485, file: !392, line: 271, column: 12)
!485 = distinct !DILexicalBlock(scope: !479, file: !392, line: 271, column: 9)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !487, file: !392, line: 273, type: !50)
!487 = distinct !DILexicalBlock(scope: !484, file: !392, line: 273, column: 12)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !489, file: !392, line: 277, type: !50)
!489 = distinct !DILexicalBlock(scope: !490, file: !392, line: 277, column: 16)
!490 = distinct !DILexicalBlock(scope: !491, file: !392, line: 274, column: 159)
!491 = distinct !DILexicalBlock(scope: !484, file: !392, line: 274, column: 13)
!492 = !DISubprogram(name: "complex_dealloc", scope: !392, file: !392, line: 322, type: !48, isLocal: true, isDefinition: true, scopeLine: 323, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @complex_dealloc, variables: !493)
!493 = !{!494}
!494 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !492, file: !392, line: 322, type: !50)
!495 = !DISubprogram(name: "complex_repr", scope: !392, file: !392, line: 328, type: !496, isLocal: true, isDefinition: true, scopeLine: 329, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyComplexObject*)* @complex_repr, variables: !498)
!496 = !DISubroutineType(types: !497)
!497 = !{!50, !11}
!498 = !{!499, !500, !501, !502, !503, !504, !505, !506, !507}
!499 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !495, file: !392, line: 328, type: !11)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "precision", scope: !495, file: !392, line: 330, type: !56)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format_code", scope: !495, file: !392, line: 331, type: !42)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !495, file: !392, line: 332, type: !50)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pre", scope: !495, file: !392, line: 335, type: !64)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "im", scope: !495, file: !392, line: 336, type: !64)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "re", scope: !495, file: !392, line: 341, type: !64)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lead", scope: !495, file: !392, line: 342, type: !64)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tail", scope: !495, file: !392, line: 343, type: !64)
!508 = !DISubprogram(name: "complex_add", scope: !392, file: !392, line: 437, type: !139, isLocal: true, isDefinition: true, scopeLine: 438, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @complex_add, variables: !509)
!509 = !{!510, !511, !512, !513, !514}
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !508, file: !392, line: 437, type: !50)
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !508, file: !392, line: 437, type: !50)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !508, file: !392, line: 439, type: !364)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !508, file: !392, line: 440, type: !364)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !508, file: !392, line: 440, type: !364)
!515 = !DISubprogram(name: "to_complex", scope: !392, file: !392, line: 413, type: !516, isLocal: true, isDefinition: true, scopeLine: 414, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object**, %struct.Py_complex*)* @to_complex, variables: !520)
!516 = !DISubroutineType(types: !517)
!517 = !{!56, !518, !519}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, align: 64)
!520 = !{!521, !522, !523}
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pobj", arg: 1, scope: !515, file: !392, line: 413, type: !518)
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pc", arg: 2, scope: !515, file: !392, line: 413, type: !519)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !515, file: !392, line: 415, type: !50)
!524 = !DISubprogram(name: "complex_sub", scope: !392, file: !392, line: 450, type: !139, isLocal: true, isDefinition: true, scopeLine: 451, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @complex_sub, variables: !525)
!525 = !{!526, !527, !528, !529, !530}
!526 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !524, file: !392, line: 450, type: !50)
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !524, file: !392, line: 450, type: !50)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !524, file: !392, line: 452, type: !364)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !524, file: !392, line: 453, type: !364)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !524, file: !392, line: 453, type: !364)
!531 = !DISubprogram(name: "complex_mul", scope: !392, file: !392, line: 463, type: !139, isLocal: true, isDefinition: true, scopeLine: 464, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @complex_mul, variables: !532)
!532 = !{!533, !534, !535, !536, !537}
!533 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !531, file: !392, line: 463, type: !50)
!534 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !531, file: !392, line: 463, type: !50)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !531, file: !392, line: 465, type: !364)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !531, file: !392, line: 466, type: !364)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !531, file: !392, line: 466, type: !364)
!538 = !DISubprogram(name: "complex_remainder", scope: !392, file: !392, line: 494, type: !139, isLocal: true, isDefinition: true, scopeLine: 495, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @complex_remainder, variables: !539)
!539 = !{!540, !541}
!540 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !538, file: !392, line: 494, type: !50)
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !538, file: !392, line: 494, type: !50)
!542 = !DISubprogram(name: "complex_divmod", scope: !392, file: !392, line: 503, type: !139, isLocal: true, isDefinition: true, scopeLine: 504, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @complex_divmod, variables: !543)
!543 = !{!544, !545}
!544 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !542, file: !392, line: 503, type: !50)
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !542, file: !392, line: 503, type: !50)
!546 = !DISubprogram(name: "complex_pow", scope: !392, file: !392, line: 511, type: !148, isLocal: true, isDefinition: true, scopeLine: 512, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @complex_pow, variables: !547)
!547 = !{!548, !549, !550, !551, !552, !553, !554, !555}
!548 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !546, file: !392, line: 511, type: !50)
!549 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !546, file: !392, line: 511, type: !50)
!550 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 3, scope: !546, file: !392, line: 511, type: !50)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !546, file: !392, line: 513, type: !364)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exponent", scope: !546, file: !392, line: 514, type: !364)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "int_exponent", scope: !546, file: !392, line: 515, type: !28)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !546, file: !392, line: 516, type: !364)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !546, file: !392, line: 516, type: !364)
!556 = !DISubprogram(name: "c_powi", scope: !392, file: !392, line: 152, type: !557, isLocal: true, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double, i64)* @c_powi, variables: !559)
!557 = !DISubroutineType(types: !558)
!558 = !{!364, !364, !28}
!559 = !{!560, !561, !562}
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !556, file: !392, line: 152, type: !364)
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !556, file: !392, line: 152, type: !28)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cn", scope: !556, file: !392, line: 154, type: !364)
!563 = !DISubprogram(name: "c_powu", scope: !392, file: !392, line: 136, type: !557, isLocal: true, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: true, function: { double, double } (double, double, i64)* @c_powu, variables: !564)
!564 = !{!565, !566, !567, !568, !569}
!565 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !563, file: !392, line: 136, type: !364)
!566 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !563, file: !392, line: 136, type: !28)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !563, file: !392, line: 138, type: !364)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !563, file: !392, line: 138, type: !364)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mask", scope: !563, file: !392, line: 139, type: !28)
!570 = !DISubprogram(name: "complex_neg", scope: !392, file: !392, line: 557, type: !496, isLocal: true, isDefinition: true, scopeLine: 558, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyComplexObject*)* @complex_neg, variables: !571)
!571 = !{!572, !573}
!572 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !570, file: !392, line: 557, type: !11)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "neg", scope: !570, file: !392, line: 559, type: !364)
!574 = !DISubprogram(name: "complex_pos", scope: !392, file: !392, line: 566, type: !496, isLocal: true, isDefinition: true, scopeLine: 567, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyComplexObject*)* @complex_pos, variables: !575)
!575 = !{!576}
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !574, file: !392, line: 566, type: !11)
!577 = !DISubprogram(name: "complex_abs", scope: !392, file: !392, line: 577, type: !496, isLocal: true, isDefinition: true, scopeLine: 578, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyComplexObject*)* @complex_abs, variables: !578)
!578 = !{!579, !580}
!579 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !577, file: !392, line: 577, type: !11)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !577, file: !392, line: 579, type: !368)
!581 = !DISubprogram(name: "complex_bool", scope: !392, file: !392, line: 594, type: !582, isLocal: true, isDefinition: true, scopeLine: 595, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyComplexObject*)* @complex_bool, variables: !584)
!582 = !DISubroutineType(types: !583)
!583 = !{!56, !11}
!584 = !{!585}
!585 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !581, file: !392, line: 594, type: !11)
!586 = !DISubprogram(name: "complex_int", scope: !392, file: !392, line: 657, type: !129, isLocal: true, isDefinition: true, scopeLine: 658, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @complex_int, variables: !587)
!587 = !{!588}
!588 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !586, file: !392, line: 657, type: !50)
!589 = !DISubprogram(name: "complex_float", scope: !392, file: !392, line: 665, type: !129, isLocal: true, isDefinition: true, scopeLine: 666, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @complex_float, variables: !590)
!590 = !{!591}
!591 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !589, file: !392, line: 665, type: !50)
!592 = !DISubprogram(name: "complex_int_div", scope: !392, file: !392, line: 549, type: !139, isLocal: true, isDefinition: true, scopeLine: 550, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @complex_int_div, variables: !593)
!593 = !{!594, !595}
!594 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !592, file: !392, line: 549, type: !50)
!595 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !592, file: !392, line: 549, type: !50)
!596 = !DISubprogram(name: "complex_div", scope: !392, file: !392, line: 476, type: !139, isLocal: true, isDefinition: true, scopeLine: 477, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @complex_div, variables: !597)
!597 = !{!598, !599, !600, !601, !602}
!598 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !596, file: !392, line: 476, type: !50)
!599 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !596, file: !392, line: 476, type: !50)
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "quot", scope: !596, file: !392, line: 478, type: !364)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !596, file: !392, line: 479, type: !364)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !596, file: !392, line: 479, type: !364)
!603 = !DISubprogram(name: "complex_hash", scope: !392, file: !392, line: 384, type: !604, isLocal: true, isDefinition: true, scopeLine: 385, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.PyComplexObject*)* @complex_hash, variables: !606)
!604 = !DISubroutineType(types: !605)
!605 = !{!231, !11}
!606 = !{!607, !608, !609, !610}
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !603, file: !392, line: 384, type: !11)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hashreal", scope: !603, file: !392, line: 386, type: !370)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hashimag", scope: !603, file: !392, line: 386, type: !370)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "combined", scope: !603, file: !392, line: 386, type: !370)
!611 = !DISubprogram(name: "complex_richcompare", scope: !392, file: !392, line: 600, type: !284, isLocal: true, isDefinition: true, scopeLine: 601, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @complex_richcompare, variables: !612)
!612 = !{!613, !614, !615, !616, !617, !618, !619, !624, !625, !627}
!613 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !611, file: !392, line: 600, type: !50)
!614 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !611, file: !392, line: 600, type: !50)
!615 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !611, file: !392, line: 600, type: !56)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !611, file: !392, line: 602, type: !50)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !611, file: !392, line: 603, type: !364)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "equal", scope: !611, file: !392, line: 604, type: !56)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !620, file: !392, line: 618, type: !50)
!620 = distinct !DILexicalBlock(scope: !621, file: !392, line: 617, column: 28)
!621 = distinct !DILexicalBlock(scope: !622, file: !392, line: 617, column: 13)
!622 = distinct !DILexicalBlock(scope: !623, file: !392, line: 613, column: 75)
!623 = distinct !DILexicalBlock(scope: !611, file: !392, line: 613, column: 9)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sub_res", scope: !620, file: !392, line: 618, type: !50)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !626, file: !392, line: 624, type: !50)
!626 = distinct !DILexicalBlock(scope: !620, file: !392, line: 624, column: 16)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !628, file: !392, line: 635, type: !364)
!628 = distinct !DILexicalBlock(scope: !629, file: !392, line: 634, column: 134)
!629 = distinct !DILexicalBlock(scope: !630, file: !392, line: 634, column: 14)
!630 = distinct !DILexicalBlock(scope: !623, file: !392, line: 631, column: 14)
!631 = !DISubprogram(name: "complex_conjugate", scope: !392, file: !392, line: 673, type: !129, isLocal: true, isDefinition: true, scopeLine: 674, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @complex_conjugate, variables: !632)
!632 = !{!633, !634}
!633 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !631, file: !392, line: 673, type: !50)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !631, file: !392, line: 675, type: !364)
!635 = !DISubprogram(name: "complex_getnewargs", scope: !392, file: !392, line: 687, type: !496, isLocal: true, isDefinition: true, scopeLine: 688, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyComplexObject*)* @complex_getnewargs, variables: !636)
!636 = !{!637, !638}
!637 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !635, file: !392, line: 687, type: !11)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !635, file: !392, line: 689, type: !364)
!639 = !DISubprogram(name: "complex__format__", scope: !392, file: !392, line: 699, type: !139, isLocal: true, isDefinition: true, scopeLine: 700, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @complex__format__, variables: !640)
!640 = !{!641, !642, !643, !644, !659}
!641 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !639, file: !392, line: 699, type: !50)
!642 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !639, file: !392, line: 699, type: !50)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format_spec", scope: !639, file: !392, line: 701, type: !50)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "writer", scope: !639, file: !392, line: 702, type: !645)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyUnicodeWriter", file: !4, line: 917, baseType: !646)
!646 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 897, size: 448, align: 64, elements: !647)
!647 = !{!648, !649, !650, !651, !653, !654, !655, !656, !657, !658}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !646, file: !4, line: 898, baseType: !50, size: 64, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !646, file: !4, line: 899, baseType: !102, size: 64, align: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !646, file: !4, line: 900, baseType: !3, size: 32, align: 32, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "maxchar", scope: !646, file: !4, line: 901, baseType: !652, size: 32, align: 32, offset: 160)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !361)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !646, file: !4, line: 902, baseType: !22, size: 64, align: 64, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !646, file: !4, line: 903, baseType: !22, size: 64, align: 64, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "min_length", scope: !646, file: !4, line: 906, baseType: !22, size: 64, align: 64, offset: 320)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "min_char", scope: !646, file: !4, line: 909, baseType: !652, size: 32, align: 32, offset: 384)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "overallocate", scope: !646, file: !4, line: 912, baseType: !389, size: 8, align: 8, offset: 416)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !646, file: !4, line: 916, baseType: !389, size: 8, align: 8, offset: 424)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !639, file: !392, line: 703, type: !56)
!660 = !DISubprogram(name: "complex_new", scope: !392, file: !392, line: 901, type: !661, isLocal: true, isDefinition: true, scopeLine: 902, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @complex_new, variables: !665)
!661 = !DISubroutineType(types: !662)
!662 = !{!50, !663, !50, !50}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !18, line: 422, baseType: !31)
!665 = !{!666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !685, !691, !696, !700, !702}
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !660, file: !392, line: 901, type: !663)
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !660, file: !392, line: 901, type: !50)
!668 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !660, file: !392, line: 901, type: !50)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !660, file: !392, line: 903, type: !50)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !660, file: !392, line: 903, type: !50)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !660, file: !392, line: 903, type: !50)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbr", scope: !660, file: !392, line: 904, type: !132)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbi", scope: !660, file: !392, line: 904, type: !132)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cr", scope: !660, file: !392, line: 905, type: !364)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ci", scope: !660, file: !392, line: 905, type: !364)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "own_r", scope: !660, file: !392, line: 906, type: !56)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cr_is_complex", scope: !660, file: !392, line: 907, type: !56)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ci_is_complex", scope: !660, file: !392, line: 908, type: !56)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !680, file: !392, line: 961, type: !50)
!680 = distinct !DILexicalBlock(scope: !681, file: !392, line: 961, column: 16)
!681 = distinct !DILexicalBlock(scope: !682, file: !392, line: 960, column: 20)
!682 = distinct !DILexicalBlock(scope: !683, file: !392, line: 960, column: 13)
!683 = distinct !DILexicalBlock(scope: !684, file: !392, line: 956, column: 84)
!684 = distinct !DILexicalBlock(scope: !660, file: !392, line: 955, column: 9)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !686, file: !392, line: 980, type: !50)
!686 = distinct !DILexicalBlock(scope: !687, file: !392, line: 980, column: 16)
!687 = distinct !DILexicalBlock(scope: !688, file: !392, line: 979, column: 20)
!688 = distinct !DILexicalBlock(scope: !689, file: !392, line: 979, column: 13)
!689 = distinct !DILexicalBlock(scope: !690, file: !392, line: 973, column: 129)
!690 = distinct !DILexicalBlock(scope: !660, file: !392, line: 973, column: 9)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !692, file: !392, line: 991, type: !50)
!692 = distinct !DILexicalBlock(scope: !693, file: !392, line: 991, column: 16)
!693 = distinct !DILexicalBlock(scope: !694, file: !392, line: 988, column: 20)
!694 = distinct !DILexicalBlock(scope: !695, file: !392, line: 988, column: 13)
!695 = distinct !DILexicalBlock(scope: !690, file: !392, line: 983, column: 10)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !697, file: !392, line: 998, type: !50)
!697 = distinct !DILexicalBlock(scope: !698, file: !392, line: 998, column: 16)
!698 = distinct !DILexicalBlock(scope: !699, file: !392, line: 995, column: 134)
!699 = distinct !DILexicalBlock(scope: !695, file: !392, line: 995, column: 13)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !701, file: !392, line: 1003, type: !50)
!701 = distinct !DILexicalBlock(scope: !695, file: !392, line: 1003, column: 12)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !703, file: !392, line: 1019, type: !50)
!703 = distinct !DILexicalBlock(scope: !704, file: !392, line: 1019, column: 12)
!704 = distinct !DILexicalBlock(scope: !705, file: !392, line: 1011, column: 12)
!705 = distinct !DILexicalBlock(scope: !706, file: !392, line: 1008, column: 14)
!706 = distinct !DILexicalBlock(scope: !660, file: !392, line: 1005, column: 9)
!707 = !DISubprogram(name: "complex_subtype_from_string", scope: !392, file: !392, line: 758, type: !708, isLocal: true, isDefinition: true, scopeLine: 759, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*)* @complex_subtype_from_string, variables: !710)
!708 = !DISubroutineType(types: !709)
!709 = !{!50, !663, !50}
!710 = !{!711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !724, !727, !729}
!711 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !707, file: !392, line: 758, type: !663)
!712 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !707, file: !392, line: 758, type: !50)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !707, file: !392, line: 760, type: !40)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !707, file: !392, line: 760, type: !40)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !707, file: !392, line: 761, type: !64)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !707, file: !392, line: 762, type: !368)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !707, file: !392, line: 762, type: !368)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !707, file: !392, line: 762, type: !368)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "got_bracket", scope: !707, file: !392, line: 763, type: !56)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s_buffer", scope: !707, file: !392, line: 764, type: !50)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !707, file: !392, line: 765, type: !22)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !723, file: !392, line: 889, type: !50)
!723 = distinct !DILexicalBlock(scope: !707, file: !392, line: 889, column: 8)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !725, file: !392, line: 889, type: !50)
!725 = distinct !DILexicalBlock(scope: !726, file: !392, line: 889, column: 100)
!726 = distinct !DILexicalBlock(scope: !723, file: !392, line: 889, column: 66)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !728, file: !392, line: 896, type: !50)
!728 = distinct !DILexicalBlock(scope: !707, file: !392, line: 896, column: 8)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !730, file: !392, line: 896, type: !50)
!730 = distinct !DILexicalBlock(scope: !731, file: !392, line: 896, column: 100)
!731 = distinct !DILexicalBlock(scope: !728, file: !392, line: 896, column: 66)
!732 = !DISubprogram(name: "complex_subtype_from_doubles", scope: !392, file: !392, line: 226, type: !733, isLocal: true, isDefinition: true, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, double, double)* @complex_subtype_from_doubles, variables: !735)
!733 = !DISubroutineType(types: !734)
!734 = !{!50, !663, !368, !368}
!735 = !{!736, !737, !738, !739}
!736 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !732, file: !392, line: 226, type: !663)
!737 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "real", arg: 2, scope: !732, file: !392, line: 226, type: !368)
!738 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "imag", arg: 3, scope: !732, file: !392, line: 226, type: !368)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !732, file: !392, line: 228, type: !364)
!740 = !DISubprogram(name: "complex_subtype_from_c_complex", scope: !392, file: !392, line: 201, type: !741, isLocal: true, isDefinition: true, scopeLine: 202, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, double, double)* @complex_subtype_from_c_complex, variables: !743)
!741 = !DISubroutineType(types: !742)
!742 = !{!50, !663, !364}
!743 = !{!744, !745, !746}
!744 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !740, file: !392, line: 201, type: !663)
!745 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cval", arg: 2, scope: !740, file: !392, line: 201, type: !364)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !740, file: !392, line: 203, type: !50)
!747 = !{!748, !749, !757, !758, !759, !763, !768, !772, !776, !781}
!748 = !DIGlobalVariable(name: "PyComplex_Type", scope: !0, file: !392, line: 1076, type: !664, isLocal: false, isDefinition: true, variable: %struct._typeobject* @PyComplex_Type)
!749 = !DIGlobalVariable(name: "PyId___complex__", scope: !479, file: !392, line: 268, type: !750, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @try_complex_special_method.PyId___complex__)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !18, line: 144, baseType: !751)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !18, line: 140, size: 192, align: 64, elements: !752)
!752 = !{!753, !755, !756}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !751, file: !18, line: 141, baseType: !754, size: 64, align: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64, align: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !751, file: !18, line: 142, baseType: !40, size: 64, align: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !751, file: !18, line: 143, baseType: !50, size: 64, align: 64, offset: 128)
!757 = !DIGlobalVariable(name: "complex_as_number", scope: !0, file: !392, line: 1040, type: !133, isLocal: true, isDefinition: true, variable: %struct.PyNumberMethods* @complex_as_number)
!758 = !DIGlobalVariable(name: "c_1", scope: !0, file: !392, line: 13, type: !364, isLocal: true, isDefinition: true, variable: %struct.Py_complex* @c_1)
!759 = !DIGlobalVariable(name: "complex_doc", scope: !0, file: !392, line: 1034, type: !760, isLocal: true, isDefinition: true, variable: [179 x i8]* @complex_doc)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 1432, align: 8, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 179)
!763 = !DIGlobalVariable(name: "complex_methods", scope: !0, file: !392, line: 736, type: !764, isLocal: true, isDefinition: true, variable: [4 x %struct.PyMethodDef]* @complex_methods)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !765, size: 1024, align: 64, elements: !766)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !294, line: 47, baseType: !293)
!766 = !{!767}
!767 = !DISubrange(count: 4)
!768 = !DIGlobalVariable(name: "complex_conjugate_doc", scope: !0, file: !392, line: 681, type: !769, isLocal: true, isDefinition: true, variable: [106 x i8]* @complex_conjugate_doc)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 848, align: 8, elements: !770)
!770 = !{!771}
!771 = !DISubrange(count: 106)
!772 = !DIGlobalVariable(name: "complex__format__doc", scope: !0, file: !392, line: 693, type: !773, isLocal: true, isDefinition: true, variable: [75 x i8]* @complex__format__doc)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 600, align: 8, elements: !774)
!774 = !{!775}
!775 = !DISubrange(count: 75)
!776 = !DIGlobalVariable(name: "complex_members", scope: !0, file: !392, line: 749, type: !777, isLocal: true, isDefinition: true, variable: [3 x %struct.PyMemberDef]* @complex_members)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !778, size: 960, align: 64, elements: !779)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !304, line: 24, baseType: !303)
!779 = !{!780}
!780 = !DISubrange(count: 3)
!781 = !DIGlobalVariable(name: "kwlist", scope: !660, file: !392, line: 909, type: !782, isLocal: true, isDefinition: true, variable: [3 x i8*]* @complex_new.kwlist)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 192, align: 64, elements: !779)
!783 = !{i32 2, !"Dwarf Version", i32 4}
!784 = !{i32 2, !"Debug Info Version", i32 3}
!785 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!786 = !DIExpression()
!787 = !DILocation(line: 16, column: 22, scope: !391)
!788 = !DILocation(line: 16, column: 36, scope: !391)
!789 = !DILocation(line: 18, column: 5, scope: !391)
!790 = !DILocation(line: 18, column: 16, scope: !391)
!791 = !DILocation(line: 19, column: 16, scope: !391)
!792 = !{!793, !794, i64 0}
!793 = !{!"", !794, i64 0, !794, i64 8}
!794 = !{!"double", !795, i64 0}
!795 = !{!"omnipotent char", !796, i64 0}
!796 = !{!"Simple C/C++ TBAA"}
!797 = !DILocation(line: 19, column: 25, scope: !391)
!798 = !DILocation(line: 19, column: 21, scope: !391)
!799 = !DILocation(line: 19, column: 7, scope: !391)
!800 = !DILocation(line: 19, column: 12, scope: !391)
!801 = !DILocation(line: 20, column: 16, scope: !391)
!802 = !{!793, !794, i64 8}
!803 = !DILocation(line: 20, column: 25, scope: !391)
!804 = !DILocation(line: 20, column: 21, scope: !391)
!805 = !DILocation(line: 20, column: 7, scope: !391)
!806 = !DILocation(line: 20, column: 12, scope: !391)
!807 = !DILocation(line: 21, column: 12, scope: !391)
!808 = !{i64 0, i64 8, !809, i64 8, i64 8, !809}
!809 = !{!794, !794, i64 0}
