; ModuleID = 'irs-onlybc/compile.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_unaryop", file: !11, line: 22, size: 32, align: 32, elements: !64)
!64 = !{!65, !66, !67, !68}
!65 = !DIEnumerator(name: "Invert", value: 1)
!66 = !DIEnumerator(name: "Not", value: 2)
!67 = !DIEnumerator(name: "UAdd", value: 3)
!68 = !DIEnumerator(name: "USub", value: 4)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_expr_context", file: !11, line: 11, size: 32, align: 32, elements: !70)
!70 = !{!71, !72, !73, !74, !75, !76}
!71 = !DIEnumerator(name: "Load", value: 1)
!72 = !DIEnumerator(name: "Store", value: 2)
!73 = !DIEnumerator(name: "Del", value: 3)
!74 = !DIEnumerator(name: "AugLoad", value: 4)
!75 = !DIEnumerator(name: "AugStore", value: 5)
!76 = !DIEnumerator(name: "Param", value: 6)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_slice_kind", file: !11, line: 323, size: 32, align: 32, elements: !78)
!78 = !{!79, !80, !81}
!79 = !DIEnumerator(name: "Slice_kind", value: 1)
!80 = !DIEnumerator(name: "ExtSlice_kind", value: 2)
!81 = !DIEnumerator(name: "Index_kind", value: 3)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_block_type", file: !83, line: 13, size: 32, align: 32, elements: !84)
!83 = !DIFile(filename: "Include/symtable.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!84 = !{!85, !86, !87}
!85 = !DIEnumerator(name: "FunctionBlock", value: 0)
!86 = !DIEnumerator(name: "ClassBlock", value: 1)
!87 = !DIEnumerator(name: "ModuleBlock", value: 2)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fblocktype", file: !89, line: 86, size: 32, align: 32, elements: !90)
!89 = !DIFile(filename: "Python/compile.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!90 = !{!91, !92, !93, !94}
!91 = !DIEnumerator(name: "LOOP", value: 0)
!92 = !DIEnumerator(name: "EXCEPT", value: 1)
!93 = !DIEnumerator(name: "FINALLY_TRY", value: 2)
!94 = !DIEnumerator(name: "FINALLY_END", value: 3)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !89, line: 93, size: 32, align: 32, elements: !96)
!96 = !{!97, !98, !99, !100, !101}
!97 = !DIEnumerator(name: "COMPILER_SCOPE_MODULE", value: 0)
!98 = !DIEnumerator(name: "COMPILER_SCOPE_CLASS", value: 1)
!99 = !DIEnumerator(name: "COMPILER_SCOPE_FUNCTION", value: 2)
!100 = !DIEnumerator(name: "COMPILER_SCOPE_LAMBDA", value: 3)
!101 = !DIEnumerator(name: "COMPILER_SCOPE_COMPREHENSION", value: 4)
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_stmt_kind", file: !11, line: 66, size: 32, align: 32, elements: !103)
!103 = !{!104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124}
!104 = !DIEnumerator(name: "FunctionDef_kind", value: 1)
!105 = !DIEnumerator(name: "ClassDef_kind", value: 2)
!106 = !DIEnumerator(name: "Return_kind", value: 3)
!107 = !DIEnumerator(name: "Delete_kind", value: 4)
!108 = !DIEnumerator(name: "Assign_kind", value: 5)
!109 = !DIEnumerator(name: "AugAssign_kind", value: 6)
!110 = !DIEnumerator(name: "For_kind", value: 7)
!111 = !DIEnumerator(name: "While_kind", value: 8)
!112 = !DIEnumerator(name: "If_kind", value: 9)
!113 = !DIEnumerator(name: "With_kind", value: 10)
!114 = !DIEnumerator(name: "Raise_kind", value: 11)
!115 = !DIEnumerator(name: "Try_kind", value: 12)
!116 = !DIEnumerator(name: "Assert_kind", value: 13)
!117 = !DIEnumerator(name: "Import_kind", value: 14)
!118 = !DIEnumerator(name: "ImportFrom_kind", value: 15)
!119 = !DIEnumerator(name: "Global_kind", value: 16)
!120 = !DIEnumerator(name: "Nonlocal_kind", value: 17)
!121 = !DIEnumerator(name: "Expr_kind", value: 18)
!122 = !DIEnumerator(name: "Pass_kind", value: 19)
!123 = !DIEnumerator(name: "Break_kind", value: 20)
!124 = !DIEnumerator(name: "Continue_kind", value: 21)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !126, file: !89, line: 2722, size: 32, align: 32, elements: !612)
!126 = !DISubprogram(name: "compiler_nameop", scope: !89, file: !89, line: 2718, type: !127, isLocal: true, isDefinition: true, scopeLine: 2719, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.compiler*, %struct._object*, i32)* @compiler_nameop, variables: !597)
!127 = !DISubroutineType(types: !128)
!128 = !{!129, !130, !594, !596}
!129 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "compiler", file: !89, line: 152, size: 576, align: 64, elements: !132)
!132 = !{!133, !472, !521, !522, !529, !530, !531, !532, !588, !589}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "c_filename", scope: !131, file: !89, line: 153, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !136, line: 109, baseType: !137)
!136 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !136, line: 105, size: 128, align: 64, elements: !138)
!138 = !{!139, !147}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !137, file: !136, line: 107, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !141, line: 177, baseType: !142)
!141 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !143, line: 102, baseType: !144)
!143 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !145, line: 181, baseType: !146)
!145 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!146 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !137, file: !136, line: 108, baseType: !148, size: 64, align: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !136, line: 334, size: 3200, align: 64, elements: !150)
!150 = !{!151, !157, !161, !162, !163, !168, !231, !236, !241, !242, !247, !299, !330, !342, !348, !349, !350, !352, !354, !385, !386, !387, !396, !397, !402, !403, !405, !407, !417, !420, !438, !439, !440, !442, !444, !445, !447, !452, !457, !462, !463, !464, !465, !466, !467, !468, !469, !471}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !149, file: !136, line: 335, baseType: !152, size: 192, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !136, line: 114, baseType: !153)
!153 = !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 111, size: 192, align: 64, elements: !154)
!154 = !{!155, !156}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !153, file: !136, line: 112, baseType: !135, size: 128, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !153, file: !136, line: 113, baseType: !140, size: 64, align: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !149, file: !136, line: 336, baseType: !158, size: 64, align: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !149, file: !136, line: 337, baseType: !140, size: 64, align: 64, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !149, file: !136, line: 337, baseType: !140, size: 64, align: 64, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !149, file: !136, line: 341, baseType: !164, size: 64, align: 64, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !136, line: 308, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !134}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !149, file: !136, line: 342, baseType: !169, size: 64, align: 64, offset: 448)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !136, line: 314, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64, align: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!129, !134, !173, !129}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !143, line: 48, baseType: !175)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !176, line: 246, size: 1728, align: 64, elements: !177)
!176 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!177 = !{!178, !179, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !199, !200, !201, !202, !204, !206, !208, !212, !215, !217, !219, !220, !221, !222, !226, !227}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !175, file: !176, line: 247, baseType: !129, size: 32, align: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !175, file: !176, line: 252, baseType: !180, size: 64, align: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !175, file: !176, line: 253, baseType: !180, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !175, file: !176, line: 254, baseType: !180, size: 64, align: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !175, file: !176, line: 255, baseType: !180, size: 64, align: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !175, file: !176, line: 256, baseType: !180, size: 64, align: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !175, file: !176, line: 257, baseType: !180, size: 64, align: 64, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !175, file: !176, line: 258, baseType: !180, size: 64, align: 64, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !175, file: !176, line: 259, baseType: !180, size: 64, align: 64, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !175, file: !176, line: 261, baseType: !180, size: 64, align: 64, offset: 576)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !175, file: !176, line: 262, baseType: !180, size: 64, align: 64, offset: 640)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !175, file: !176, line: 263, baseType: !180, size: 64, align: 64, offset: 704)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !175, file: !176, line: 265, baseType: !192, size: 64, align: 64, offset: 768)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !176, line: 161, size: 192, align: 64, elements: !194)
!194 = !{!195, !196, !198}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !193, file: !176, line: 162, baseType: !192, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !193, file: !176, line: 163, baseType: !197, size: 64, align: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !193, file: !176, line: 167, baseType: !129, size: 32, align: 32, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !175, file: !176, line: 267, baseType: !197, size: 64, align: 64, offset: 832)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !175, file: !176, line: 269, baseType: !129, size: 32, align: 32, offset: 896)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !175, file: !176, line: 273, baseType: !129, size: 32, align: 32, offset: 928)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !175, file: !176, line: 275, baseType: !203, size: 64, align: 64, offset: 960)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !145, line: 140, baseType: !146)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !175, file: !176, line: 279, baseType: !205, size: 16, align: 16, offset: 1024)
!205 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !175, file: !176, line: 280, baseType: !207, size: 8, align: 8, offset: 1040)
!207 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !175, file: !176, line: 281, baseType: !209, size: 8, align: 8, offset: 1048)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 8, align: 8, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 1)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !175, file: !176, line: 285, baseType: !213, size: 64, align: 64, offset: 1088)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !176, line: 155, baseType: null)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !175, file: !176, line: 294, baseType: !216, size: 64, align: 64, offset: 1152)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !145, line: 141, baseType: !146)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !175, file: !176, line: 303, baseType: !218, size: 64, align: 64, offset: 1216)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !175, file: !176, line: 304, baseType: !218, size: 64, align: 64, offset: 1280)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !175, file: !176, line: 305, baseType: !218, size: 64, align: 64, offset: 1344)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !175, file: !176, line: 306, baseType: !218, size: 64, align: 64, offset: 1408)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !175, file: !176, line: 307, baseType: !223, size: 64, align: 64, offset: 1472)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !224, line: 62, baseType: !225)
!224 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!225 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !175, file: !176, line: 309, baseType: !129, size: 32, align: 32, offset: 1536)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !175, file: !176, line: 311, baseType: !228, size: 160, align: 8, offset: 1568)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 160, align: 8, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 20)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !149, file: !136, line: 343, baseType: !232, size: 64, align: 64, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !136, line: 316, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!134, !134, !180}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !149, file: !136, line: 344, baseType: !237, size: 64, align: 64, offset: 576)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !136, line: 318, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!129, !134, !180, !134}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !149, file: !136, line: 345, baseType: !218, size: 64, align: 64, offset: 640)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !149, file: !136, line: 346, baseType: !243, size: 64, align: 64, offset: 704)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !136, line: 320, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!134, !134}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !149, file: !136, line: 350, baseType: !248, size: 64, align: 64, offset: 768)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !136, line: 278, baseType: !250)
!250 = !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 236, size: 2176, align: 64, elements: !251)
!251 = !{!252, !257, !258, !259, !260, !261, !266, !268, !269, !270, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !250, file: !136, line: 241, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !136, line: 166, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!134, !134, !134}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !250, file: !136, line: 242, baseType: !253, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !250, file: !136, line: 243, baseType: !253, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !250, file: !136, line: 244, baseType: !253, size: 64, align: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !250, file: !136, line: 245, baseType: !253, size: 64, align: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !250, file: !136, line: 246, baseType: !262, size: 64, align: 64, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !136, line: 167, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!134, !134, !134, !134}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !250, file: !136, line: 247, baseType: !267, size: 64, align: 64, offset: 384)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !136, line: 165, baseType: !244)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !250, file: !136, line: 248, baseType: !267, size: 64, align: 64, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !250, file: !136, line: 249, baseType: !267, size: 64, align: 64, offset: 512)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !250, file: !136, line: 250, baseType: !271, size: 64, align: 64, offset: 576)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !136, line: 168, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!129, !134}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !250, file: !136, line: 251, baseType: !267, size: 64, align: 64, offset: 640)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !250, file: !136, line: 252, baseType: !253, size: 64, align: 64, offset: 704)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !250, file: !136, line: 253, baseType: !253, size: 64, align: 64, offset: 768)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !250, file: !136, line: 254, baseType: !253, size: 64, align: 64, offset: 832)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !250, file: !136, line: 255, baseType: !253, size: 64, align: 64, offset: 896)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !250, file: !136, line: 256, baseType: !253, size: 64, align: 64, offset: 960)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !250, file: !136, line: 257, baseType: !267, size: 64, align: 64, offset: 1024)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !250, file: !136, line: 258, baseType: !218, size: 64, align: 64, offset: 1088)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !250, file: !136, line: 259, baseType: !267, size: 64, align: 64, offset: 1152)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !250, file: !136, line: 261, baseType: !253, size: 64, align: 64, offset: 1216)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !250, file: !136, line: 262, baseType: !253, size: 64, align: 64, offset: 1280)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !250, file: !136, line: 263, baseType: !253, size: 64, align: 64, offset: 1344)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !250, file: !136, line: 264, baseType: !253, size: 64, align: 64, offset: 1408)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !250, file: !136, line: 265, baseType: !262, size: 64, align: 64, offset: 1472)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !250, file: !136, line: 266, baseType: !253, size: 64, align: 64, offset: 1536)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !250, file: !136, line: 267, baseType: !253, size: 64, align: 64, offset: 1600)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !250, file: !136, line: 268, baseType: !253, size: 64, align: 64, offset: 1664)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !250, file: !136, line: 269, baseType: !253, size: 64, align: 64, offset: 1728)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !250, file: !136, line: 270, baseType: !253, size: 64, align: 64, offset: 1792)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !250, file: !136, line: 272, baseType: !253, size: 64, align: 64, offset: 1856)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !250, file: !136, line: 273, baseType: !253, size: 64, align: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !250, file: !136, line: 274, baseType: !253, size: 64, align: 64, offset: 1984)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !250, file: !136, line: 275, baseType: !253, size: 64, align: 64, offset: 2048)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !250, file: !136, line: 277, baseType: !267, size: 64, align: 64, offset: 2112)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !149, file: !136, line: 351, baseType: !300, size: 64, align: 64, offset: 832)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !136, line: 292, baseType: !302)
!302 = !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 280, size: 640, align: 64, elements: !303)
!303 = !{!304, !309, !310, !315, !316, !317, !322, !323, !328, !329}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !302, file: !136, line: 281, baseType: !305, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !136, line: 169, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!140, !134}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !302, file: !136, line: 282, baseType: !253, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !302, file: !136, line: 283, baseType: !311, size: 64, align: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !136, line: 170, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!134, !134, !140}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !302, file: !136, line: 284, baseType: !311, size: 64, align: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !302, file: !136, line: 285, baseType: !218, size: 64, align: 64, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !302, file: !136, line: 286, baseType: !318, size: 64, align: 64, offset: 320)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !136, line: 172, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!129, !134, !140, !134}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !302, file: !136, line: 287, baseType: !218, size: 64, align: 64, offset: 384)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !302, file: !136, line: 288, baseType: !324, size: 64, align: 64, offset: 448)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !136, line: 231, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!129, !134, !134}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !302, file: !136, line: 290, baseType: !253, size: 64, align: 64, offset: 512)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !302, file: !136, line: 291, baseType: !311, size: 64, align: 64, offset: 576)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !149, file: !136, line: 352, baseType: !331, size: 64, align: 64, offset: 896)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !136, line: 298, baseType: !333)
!333 = !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 294, size: 192, align: 64, elements: !334)
!334 = !{!335, !336, !337}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !333, file: !136, line: 295, baseType: !305, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !333, file: !136, line: 296, baseType: !253, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !333, file: !136, line: 297, baseType: !338, size: 64, align: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !136, line: 174, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!129, !134, !134, !134}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !149, file: !136, line: 356, baseType: !343, size: 64, align: 64, offset: 960)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !136, line: 321, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!347, !134}
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !141, line: 186, baseType: !140)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !149, file: !136, line: 357, baseType: !262, size: 64, align: 64, offset: 1024)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !149, file: !136, line: 358, baseType: !243, size: 64, align: 64, offset: 1088)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !149, file: !136, line: 359, baseType: !351, size: 64, align: 64, offset: 1152)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !136, line: 317, baseType: !254)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !149, file: !136, line: 360, baseType: !353, size: 64, align: 64, offset: 1216)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !136, line: 319, baseType: !339)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !149, file: !136, line: 363, baseType: !355, size: 64, align: 64, offset: 1280)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !136, line: 304, baseType: !357)
!357 = !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 301, size: 128, align: 64, elements: !358)
!358 = !{!359, !380}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !357, file: !136, line: 302, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !136, line: 193, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DISubroutineType(types: !363)
!363 = !{!129, !134, !364, !129}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !136, line: 191, baseType: !366)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !136, line: 178, size: 640, align: 64, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !377, !378, !379}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !366, file: !136, line: 179, baseType: !218, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !366, file: !136, line: 180, baseType: !134, size: 64, align: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !366, file: !136, line: 181, baseType: !140, size: 64, align: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !366, file: !136, line: 182, baseType: !140, size: 64, align: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !366, file: !136, line: 184, baseType: !129, size: 32, align: 32, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !366, file: !136, line: 185, baseType: !129, size: 32, align: 32, offset: 288)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !366, file: !136, line: 186, baseType: !180, size: 64, align: 64, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !366, file: !136, line: 187, baseType: !376, size: 64, align: 64, offset: 384)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !366, file: !136, line: 188, baseType: !376, size: 64, align: 64, offset: 448)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !366, file: !136, line: 189, baseType: !376, size: 64, align: 64, offset: 512)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !366, file: !136, line: 190, baseType: !218, size: 64, align: 64, offset: 576)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !357, file: !136, line: 303, baseType: !381, size: 64, align: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !136, line: 194, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{null, !134, !364}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !149, file: !136, line: 366, baseType: !225, size: 64, align: 64, offset: 1344)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !149, file: !136, line: 368, baseType: !158, size: 64, align: 64, offset: 1408)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !149, file: !136, line: 372, baseType: !388, size: 64, align: 64, offset: 1472)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !136, line: 233, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!129, !134, !392, !218}
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !136, line: 232, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!129, !134, !218}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !149, file: !136, line: 375, baseType: !271, size: 64, align: 64, offset: 1536)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !149, file: !136, line: 379, baseType: !398, size: 64, align: 64, offset: 1600)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !136, line: 322, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!134, !134, !134, !129}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !149, file: !136, line: 382, baseType: !140, size: 64, align: 64, offset: 1664)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !149, file: !136, line: 385, baseType: !404, size: 64, align: 64, offset: 1728)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !136, line: 323, baseType: !244)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !149, file: !136, line: 386, baseType: !406, size: 64, align: 64, offset: 1792)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !136, line: 324, baseType: !244)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !149, file: !136, line: 389, baseType: !408, size: 64, align: 64, offset: 1856)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !410, line: 40, size: 256, align: 64, elements: !411)
!410 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!411 = !{!412, !413, !415, !416}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !409, file: !410, line: 41, baseType: !158, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !409, file: !410, line: 42, baseType: !414, size: 64, align: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !410, line: 18, baseType: !254)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !409, file: !410, line: 43, baseType: !129, size: 32, align: 32, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !409, file: !410, line: 45, baseType: !158, size: 64, align: 64, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !149, file: !136, line: 390, baseType: !418, size: 64, align: 64, offset: 1920)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !136, line: 390, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !149, file: !136, line: 391, baseType: !421, size: 64, align: 64, offset: 1984)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !423, line: 11, size: 320, align: 64, elements: !424)
!423 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!424 = !{!425, !426, !431, !436, !437}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !422, file: !423, line: 12, baseType: !180, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !422, file: !423, line: 13, baseType: !427, size: 64, align: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !423, line: 8, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!134, !134, !218}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !422, file: !423, line: 14, baseType: !432, size: 64, align: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !423, line: 9, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!129, !134, !134, !218}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !422, file: !423, line: 15, baseType: !180, size: 64, align: 64, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !422, file: !423, line: 16, baseType: !218, size: 64, align: 64, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !149, file: !136, line: 392, baseType: !148, size: 64, align: 64, offset: 2048)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !149, file: !136, line: 393, baseType: !134, size: 64, align: 64, offset: 2112)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !149, file: !136, line: 394, baseType: !441, size: 64, align: 64, offset: 2176)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !136, line: 325, baseType: !263)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !149, file: !136, line: 395, baseType: !443, size: 64, align: 64, offset: 2240)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !136, line: 326, baseType: !339)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !149, file: !136, line: 396, baseType: !140, size: 64, align: 64, offset: 2304)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !149, file: !136, line: 397, baseType: !446, size: 64, align: 64, offset: 2368)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !136, line: 327, baseType: !339)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !149, file: !136, line: 398, baseType: !448, size: 64, align: 64, offset: 2432)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !136, line: 329, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!134, !148, !140}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !149, file: !136, line: 399, baseType: !453, size: 64, align: 64, offset: 2496)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !136, line: 328, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64, align: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!134, !148, !134, !134}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !149, file: !136, line: 400, baseType: !458, size: 64, align: 64, offset: 2560)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !136, line: 307, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !218}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !149, file: !136, line: 401, baseType: !271, size: 64, align: 64, offset: 2624)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !149, file: !136, line: 402, baseType: !134, size: 64, align: 64, offset: 2688)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !149, file: !136, line: 403, baseType: !134, size: 64, align: 64, offset: 2752)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !149, file: !136, line: 404, baseType: !134, size: 64, align: 64, offset: 2816)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !149, file: !136, line: 405, baseType: !134, size: 64, align: 64, offset: 2880)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !149, file: !136, line: 406, baseType: !134, size: 64, align: 64, offset: 2944)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !149, file: !136, line: 407, baseType: !164, size: 64, align: 64, offset: 3008)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !149, file: !136, line: 410, baseType: !470, size: 32, align: 32, offset: 3072)
!470 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !149, file: !136, line: 412, baseType: !164, size: 64, align: 64, offset: 3136)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "c_st", scope: !131, file: !89, line: 154, baseType: !473, size: 64, align: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "symtable", file: !83, line: 18, size: 640, align: 64, elements: !475)
!475 = !{!476, !477, !505, !506, !507, !508, !509, !510, !511, !519, !520}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "st_filename", scope: !474, file: !83, line: 19, baseType: !134, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "st_cur", scope: !474, file: !83, line: 21, baseType: !478, size: 64, align: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "_symtable_entry", file: !83, line: 37, size: 896, align: 64, elements: !480)
!480 = !{!481, !482, !483, !484, !485, !486, !487, !488, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !479, file: !83, line: 38, baseType: !135, size: 128, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ste_id", scope: !479, file: !83, line: 39, baseType: !134, size: 64, align: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ste_symbols", scope: !479, file: !83, line: 40, baseType: !134, size: 64, align: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ste_name", scope: !479, file: !83, line: 41, baseType: !134, size: 64, align: 64, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ste_varnames", scope: !479, file: !83, line: 42, baseType: !134, size: 64, align: 64, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ste_children", scope: !479, file: !83, line: 43, baseType: !134, size: 64, align: 64, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ste_directives", scope: !479, file: !83, line: 44, baseType: !134, size: 64, align: 64, offset: 448)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ste_type", scope: !479, file: !83, line: 45, baseType: !489, size: 32, align: 32, offset: 512)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_block_ty", file: !83, line: 14, baseType: !82)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ste_unoptimized", scope: !479, file: !83, line: 46, baseType: !129, size: 32, align: 32, offset: 544)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ste_nested", scope: !479, file: !83, line: 47, baseType: !129, size: 32, align: 32, offset: 576)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ste_free", scope: !479, file: !83, line: 48, baseType: !470, size: 1, align: 32, offset: 608)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ste_child_free", scope: !479, file: !83, line: 49, baseType: !470, size: 1, align: 32, offset: 609)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ste_generator", scope: !479, file: !83, line: 51, baseType: !470, size: 1, align: 32, offset: 610)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ste_varargs", scope: !479, file: !83, line: 52, baseType: !470, size: 1, align: 32, offset: 611)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ste_varkeywords", scope: !479, file: !83, line: 53, baseType: !470, size: 1, align: 32, offset: 612)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ste_returns_value", scope: !479, file: !83, line: 54, baseType: !470, size: 1, align: 32, offset: 613)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ste_needs_class_closure", scope: !479, file: !83, line: 56, baseType: !470, size: 1, align: 32, offset: 614)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ste_lineno", scope: !479, file: !83, line: 59, baseType: !129, size: 32, align: 32, offset: 640)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ste_col_offset", scope: !479, file: !83, line: 60, baseType: !129, size: 32, align: 32, offset: 672)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ste_opt_lineno", scope: !479, file: !83, line: 61, baseType: !129, size: 32, align: 32, offset: 704)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ste_opt_col_offset", scope: !479, file: !83, line: 62, baseType: !129, size: 32, align: 32, offset: 736)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ste_tmpname", scope: !479, file: !83, line: 63, baseType: !129, size: 32, align: 32, offset: 768)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ste_table", scope: !479, file: !83, line: 64, baseType: !473, size: 64, align: 64, offset: 832)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "st_top", scope: !474, file: !83, line: 22, baseType: !478, size: 64, align: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !474, file: !83, line: 23, baseType: !134, size: 64, align: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "st_stack", scope: !474, file: !83, line: 25, baseType: !134, size: 64, align: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "st_global", scope: !474, file: !83, line: 26, baseType: !134, size: 64, align: 64, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "st_nblocks", scope: !474, file: !83, line: 27, baseType: !129, size: 32, align: 32, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "st_private", scope: !474, file: !83, line: 30, baseType: !134, size: 64, align: 64, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "st_future", scope: !474, file: !83, line: 31, baseType: !512, size: 64, align: 64, offset: 512)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFutureFeatures", file: !514, line: 20, baseType: !515)
!514 = !DIFile(filename: "Include/compile.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!515 = !DICompositeType(tag: DW_TAG_structure_type, file: !514, line: 17, size: 64, align: 32, elements: !516)
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ff_features", scope: !515, file: !514, line: 18, baseType: !129, size: 32, align: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ff_lineno", scope: !515, file: !514, line: 19, baseType: !129, size: 32, align: 32, offset: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !474, file: !83, line: 33, baseType: !129, size: 32, align: 32, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_limit", scope: !474, file: !83, line: 34, baseType: !129, size: 32, align: 32, offset: 608)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "c_future", scope: !131, file: !89, line: 155, baseType: !512, size: 64, align: 64, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "c_flags", scope: !131, file: !89, line: 156, baseType: !523, size: 64, align: 64, offset: 192)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompilerFlags", file: !525, line: 22, baseType: !526)
!525 = !DIFile(filename: "Include/pythonrun.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!526 = !DICompositeType(tag: DW_TAG_structure_type, file: !525, line: 20, size: 32, align: 32, elements: !527)
!527 = !{!528}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "cf_flags", scope: !526, file: !525, line: 21, baseType: !129, size: 32, align: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "c_optimize", scope: !131, file: !89, line: 158, baseType: !129, size: 32, align: 32, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "c_interactive", scope: !131, file: !89, line: 159, baseType: !129, size: 32, align: 32, offset: 288)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "c_nestlevel", scope: !131, file: !89, line: 160, baseType: !129, size: 32, align: 32, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !131, file: !89, line: 162, baseType: !533, size: 64, align: 64, offset: 384)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "compiler_unit", file: !89, line: 104, size: 3648, align: 64, elements: !535)
!535 = !{!536, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !576, !577, !578, !584, !585, !586, !587}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "u_ste", scope: !534, file: !89, line: 105, baseType: !537, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySTEntryObject", file: !83, line: 65, baseType: !479)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "u_name", scope: !534, file: !89, line: 107, baseType: !134, size: 64, align: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "u_qualname", scope: !534, file: !89, line: 108, baseType: !134, size: 64, align: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "u_scope_type", scope: !534, file: !89, line: 109, baseType: !129, size: 32, align: 32, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "u_consts", scope: !534, file: !89, line: 115, baseType: !134, size: 64, align: 64, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "u_names", scope: !534, file: !89, line: 116, baseType: !134, size: 64, align: 64, offset: 320)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "u_varnames", scope: !534, file: !89, line: 117, baseType: !134, size: 64, align: 64, offset: 384)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "u_cellvars", scope: !534, file: !89, line: 118, baseType: !134, size: 64, align: 64, offset: 448)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "u_freevars", scope: !534, file: !89, line: 119, baseType: !134, size: 64, align: 64, offset: 512)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "u_private", scope: !534, file: !89, line: 121, baseType: !134, size: 64, align: 64, offset: 576)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "u_argcount", scope: !534, file: !89, line: 123, baseType: !140, size: 64, align: 64, offset: 640)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "u_kwonlyargcount", scope: !534, file: !89, line: 124, baseType: !140, size: 64, align: 64, offset: 704)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "u_blocks", scope: !534, file: !89, line: 127, baseType: !551, size: 64, align: 64, offset: 768)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "basicblock", file: !89, line: 77, baseType: !553)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "basicblock_", file: !89, line: 55, size: 384, align: 64, elements: !554)
!554 = !{!555, !557, !558, !559, !571, !572, !573, !574, !575}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "b_list", scope: !553, file: !89, line: 59, baseType: !556, size: 64, align: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "b_iused", scope: !553, file: !89, line: 61, baseType: !129, size: 32, align: 32, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "b_ialloc", scope: !553, file: !89, line: 63, baseType: !129, size: 32, align: 32, offset: 96)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "b_instr", scope: !553, file: !89, line: 65, baseType: !560, size: 64, align: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64, align: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "instr", file: !89, line: 45, size: 192, align: 64, elements: !562)
!562 = !{!563, !564, !565, !566, !568, !569, !570}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "i_jabs", scope: !561, file: !89, line: 46, baseType: !470, size: 1, align: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "i_jrel", scope: !561, file: !89, line: 47, baseType: !470, size: 1, align: 32, offset: 1)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "i_hasarg", scope: !561, file: !89, line: 48, baseType: !470, size: 1, align: 32, offset: 2)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "i_opcode", scope: !561, file: !89, line: 49, baseType: !567, size: 8, align: 8, offset: 8)
!567 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "i_oparg", scope: !561, file: !89, line: 50, baseType: !129, size: 32, align: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "i_target", scope: !561, file: !89, line: 51, baseType: !556, size: 64, align: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "i_lineno", scope: !561, file: !89, line: 52, baseType: !129, size: 32, align: 32, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "b_next", scope: !553, file: !89, line: 68, baseType: !556, size: 64, align: 64, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "b_seen", scope: !553, file: !89, line: 70, baseType: !470, size: 1, align: 32, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "b_return", scope: !553, file: !89, line: 72, baseType: !470, size: 1, align: 32, offset: 257)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "b_startdepth", scope: !553, file: !89, line: 74, baseType: !129, size: 32, align: 32, offset: 288)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "b_offset", scope: !553, file: !89, line: 76, baseType: !129, size: 32, align: 32, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "u_curblock", scope: !534, file: !89, line: 128, baseType: !551, size: 64, align: 64, offset: 832)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "u_nfblocks", scope: !534, file: !89, line: 130, baseType: !129, size: 32, align: 32, offset: 896)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "u_fblock", scope: !534, file: !89, line: 131, baseType: !579, size: 2560, align: 64, offset: 960)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !580, size: 2560, align: 64, elements: !229)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "fblockinfo", file: !89, line: 88, size: 128, align: 64, elements: !581)
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "fb_type", scope: !580, file: !89, line: 89, baseType: !88, size: 32, align: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "fb_block", scope: !580, file: !89, line: 90, baseType: !551, size: 64, align: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "u_firstlineno", scope: !534, file: !89, line: 133, baseType: !129, size: 32, align: 32, offset: 3520)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "u_lineno", scope: !534, file: !89, line: 134, baseType: !129, size: 32, align: 32, offset: 3552)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "u_col_offset", scope: !534, file: !89, line: 135, baseType: !129, size: 32, align: 32, offset: 3584)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "u_lineno_set", scope: !534, file: !89, line: 136, baseType: !129, size: 32, align: 32, offset: 3616)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "c_stack", scope: !131, file: !89, line: 163, baseType: !134, size: 64, align: 64, offset: 448)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "c_arena", scope: !131, file: !89, line: 164, baseType: !590, size: 64, align: 64, offset: 512)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64, align: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyArena", file: !592, line: 12, baseType: !593)
!592 = !DIFile(filename: "Include/pyarena.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "_arena", file: !592, line: 12, flags: DIFlagFwdDecl)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "identifier", file: !595, line: 4, baseType: !134)
!595 = !DIFile(filename: "Include/asdl.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "expr_context_ty", file: !11, line: 12, baseType: !69)
!597 = !{!598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !610}
!598 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !126, file: !89, line: 2718, type: !130)
!599 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !126, file: !89, line: 2718, type: !594)
!600 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 3, scope: !126, file: !89, line: 2718, type: !596)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !126, file: !89, line: 2720, type: !129)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "scope", scope: !126, file: !89, line: 2720, type: !129)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg", scope: !126, file: !89, line: 2721, type: !140)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "optype", scope: !126, file: !89, line: 2722, type: !125)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dict", scope: !126, file: !89, line: 2724, type: !134)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mangled", scope: !126, file: !89, line: 2725, type: !134)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !608, file: !89, line: 2801, type: !134)
!608 = distinct !DILexicalBlock(scope: !609, file: !89, line: 2801, column: 12)
!609 = distinct !DILexicalBlock(scope: !126, file: !89, line: 2768, column: 21)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !611, file: !89, line: 2837, type: !134)
!611 = distinct !DILexicalBlock(scope: !126, file: !89, line: 2837, column: 8)
!612 = !{!613, !614, !615, !616}
!613 = !DIEnumerator(name: "OP_FAST", value: 0)
!614 = !DIEnumerator(name: "OP_GLOBAL", value: 1)
!615 = !DIEnumerator(name: "OP_DEREF", value: 2)
!616 = !DIEnumerator(name: "OP_NAME", value: 3)
!617 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_excepthandler_kind", file: !11, line: 350, size: 32, align: 32, elements: !618)
!618 = !{!619}
!619 = !DIEnumerator(name: "ExceptHandler_kind", value: 1)
!620 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cmp_op", file: !621, line: 151, size: 32, align: 32, elements: !622)
!621 = !DIFile(filename: "Include/opcode.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634}
!623 = !DIEnumerator(name: "PyCmp_LT", value: 0)
!624 = !DIEnumerator(name: "PyCmp_LE", value: 1)
!625 = !DIEnumerator(name: "PyCmp_EQ", value: 2)
!626 = !DIEnumerator(name: "PyCmp_NE", value: 3)
!627 = !DIEnumerator(name: "PyCmp_GT", value: 4)
!628 = !DIEnumerator(name: "PyCmp_GE", value: 5)
!629 = !DIEnumerator(name: "PyCmp_IN", value: 6)
!630 = !DIEnumerator(name: "PyCmp_NOT_IN", value: 7)
!631 = !DIEnumerator(name: "PyCmp_IS", value: 8)
!632 = !DIEnumerator(name: "PyCmp_IS_NOT", value: 9)
!633 = !DIEnumerator(name: "PyCmp_EXC_MATCH", value: 10)
!634 = !DIEnumerator(name: "PyCmp_BAD", value: 11)
!635 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_cmpop", file: !11, line: 24, size: 32, align: 32, elements: !636)
!636 = !{!637, !638, !639, !640, !641, !642, !643, !644, !645, !646}
!637 = !DIEnumerator(name: "Eq", value: 1)
!638 = !DIEnumerator(name: "NotEq", value: 2)
!639 = !DIEnumerator(name: "Lt", value: 3)
!640 = !DIEnumerator(name: "LtE", value: 4)
!641 = !DIEnumerator(name: "Gt", value: 5)
!642 = !DIEnumerator(name: "GtE", value: 6)
!643 = !DIEnumerator(name: "Is", value: 7)
!644 = !DIEnumerator(name: "IsNot", value: 8)
!645 = !DIEnumerator(name: "In", value: 9)
!646 = !DIEnumerator(name: "NotIn", value: 10)
!647 = !{!218, !134, !648, !649, !667, !670, !678, !694, !696, !140, !223, !669, !688, !691, !690, !693, !698, !533, !1006, !1015, !551, !1016, !129, !560, !180, !730, !1024, !724, !1032, !1040, !1046, !1048, !158, !1050, !1066, !1072, !1079, !858, !1080, !160, !1081}
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !470)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !651)
!651 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !652)
!652 = !{!653, !654, !655, !656, !664}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !651, file: !4, line: 291, baseType: !135, size: 128, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !651, file: !4, line: 292, baseType: !140, size: 64, align: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !651, file: !4, line: 293, baseType: !347, size: 64, align: 64, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !651, file: !4, line: 349, baseType: !657, size: 32, align: 32, offset: 256)
!657 = !DICompositeType(tag: DW_TAG_structure_type, scope: !651, file: !4, line: 294, size: 32, align: 32, elements: !658)
!658 = !{!659, !660, !661, !662, !663}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !657, file: !4, line: 303, baseType: !470, size: 2, align: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !657, file: !4, line: 331, baseType: !470, size: 3, align: 32, offset: 2)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !657, file: !4, line: 336, baseType: !470, size: 1, align: 32, offset: 5)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !657, file: !4, line: 340, baseType: !470, size: 1, align: 32, offset: 6)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !657, file: !4, line: 345, baseType: !470, size: 1, align: 32, offset: 7)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !651, file: !4, line: 350, baseType: !665, size: 64, align: 64, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !224, line: 90, baseType: !129)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !567)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64, align: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !672)
!672 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !673)
!673 = !{!674, !675, !676, !677}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !672, file: !4, line: 357, baseType: !650, size: 384, align: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !672, file: !4, line: 358, baseType: !140, size: 64, align: 64, offset: 384)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !672, file: !4, line: 360, baseType: !180, size: 64, align: 64, offset: 448)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !672, file: !4, line: 361, baseType: !140, size: 64, align: 64, offset: 512)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !680)
!680 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !681)
!681 = !{!682, !683}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !680, file: !4, line: 369, baseType: !671, size: 576, align: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !680, file: !4, line: 375, baseType: !684, size: 64, align: 64, offset: 576)
!684 = !DICompositeType(tag: DW_TAG_union_type, scope: !680, file: !4, line: 370, size: 64, align: 64, elements: !685)
!685 = !{!686, !687, !689, !692}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !684, file: !4, line: 371, baseType: !218, size: 64, align: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !684, file: !4, line: 372, baseType: !688, size: 64, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !684, file: !4, line: 373, baseType: !690, size: 64, align: 64)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !205)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !684, file: !4, line: 374, baseType: !693, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !691)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !648)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "stmt_ty", file: !11, line: 7, baseType: !699)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64, align: 64)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "_stmt", file: !11, line: 72, size: 576, align: 64, elements: !701)
!701 = !{!702, !703, !1004, !1005}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !700, file: !11, line: 73, baseType: !102, size: 32, align: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !700, file: !11, line: 175, baseType: !704, size: 448, align: 64, offset: 64)
!704 = !DICompositeType(tag: DW_TAG_union_type, scope: !700, file: !11, line: 74, size: 448, align: 64, elements: !705)
!705 = !{!706, !912, !922, !926, !930, !935, !941, !948, !954, !960, !965, !970, !977, !982, !986, !992, !996, !1000}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "FunctionDef", scope: !704, file: !11, line: 81, baseType: !707, size: 320, align: 64)
!707 = !DICompositeType(tag: DW_TAG_structure_type, scope: !704, file: !11, line: 75, size: 320, align: 64, elements: !708)
!708 = !{!709, !710, !909, !910, !911}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !707, file: !11, line: 76, baseType: !594, size: 64, align: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !707, file: !11, line: 77, baseType: !711, size: 64, align: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments_ty", file: !11, line: 31, baseType: !712)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64, align: 64)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "_arguments", file: !11, line: 365, size: 384, align: 64, elements: !714)
!714 = !{!715, !723, !905, !906, !907, !908}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !713, file: !11, line: 366, baseType: !716, size: 64, align: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64, align: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "asdl_seq", file: !595, line: 21, baseType: !718)
!718 = !DICompositeType(tag: DW_TAG_structure_type, file: !595, line: 18, size: 128, align: 64, elements: !719)
!719 = !{!720, !721}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !718, file: !595, line: 19, baseType: !140, size: 64, align: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !718, file: !595, line: 20, baseType: !722, size: 64, align: 64, offset: 64)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 64, align: 64, elements: !210)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "vararg", scope: !713, file: !11, line: 367, baseType: !724, size: 64, align: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_ty", file: !11, line: 33, baseType: !725)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64, align: 64)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "_arg", file: !11, line: 374, size: 192, align: 64, elements: !727)
!727 = !{!728, !729, !903, !904}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !726, file: !11, line: 375, baseType: !594, size: 64, align: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "annotation", scope: !726, file: !11, line: 376, baseType: !730, size: 64, align: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "expr_ty", file: !11, line: 9, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64, align: 64)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "_expr", file: !11, line: 188, size: 448, align: 64, elements: !733)
!733 = !{!734, !735, !901, !902}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !732, file: !11, line: 189, baseType: !17, size: 32, align: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !732, file: !11, line: 318, baseType: !736, size: 320, align: 64, offset: 64)
!736 = !DICompositeType(tag: DW_TAG_union_type, scope: !732, file: !11, line: 190, size: 320, align: 64, elements: !737)
!737 = !{!738, !744, !751, !757, !762, !768, !773, !777, !782, !787, !793, !798, !802, !806, !819, !827, !832, !837, !842, !847, !853, !881, !886, !891, !896}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "BoolOp", scope: !736, file: !11, line: 194, baseType: !739, size: 128, align: 64)
!739 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 191, size: 128, align: 64, elements: !740)
!740 = !{!741, !743}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !739, file: !11, line: 192, baseType: !742, size: 32, align: 32)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolop_ty", file: !11, line: 16, baseType: !45)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !739, file: !11, line: 193, baseType: !716, size: 64, align: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "BinOp", scope: !736, file: !11, line: 200, baseType: !745, size: 192, align: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 196, size: 192, align: 64, elements: !746)
!746 = !{!747, !748, !750}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !745, file: !11, line: 197, baseType: !730, size: 64, align: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !745, file: !11, line: 198, baseType: !749, size: 32, align: 32, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "operator_ty", file: !11, line: 20, baseType: !49)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !745, file: !11, line: 199, baseType: !730, size: 64, align: 64, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "UnaryOp", scope: !736, file: !11, line: 205, baseType: !752, size: 128, align: 64)
!752 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 202, size: 128, align: 64, elements: !753)
!753 = !{!754, !756}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !752, file: !11, line: 203, baseType: !755, size: 32, align: 32)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryop_ty", file: !11, line: 22, baseType: !63)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "operand", scope: !752, file: !11, line: 204, baseType: !730, size: 64, align: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Lambda", scope: !736, file: !11, line: 210, baseType: !758, size: 128, align: 64)
!758 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 207, size: 128, align: 64, elements: !759)
!759 = !{!760, !761}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !758, file: !11, line: 208, baseType: !711, size: 64, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !758, file: !11, line: 209, baseType: !730, size: 64, align: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "IfExp", scope: !736, file: !11, line: 216, baseType: !763, size: 192, align: 64)
!763 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 212, size: 192, align: 64, elements: !764)
!764 = !{!765, !766, !767}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !763, file: !11, line: 213, baseType: !730, size: 64, align: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !763, file: !11, line: 214, baseType: !730, size: 64, align: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "orelse", scope: !763, file: !11, line: 215, baseType: !730, size: 64, align: 64, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Dict", scope: !736, file: !11, line: 221, baseType: !769, size: 128, align: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 218, size: 128, align: 64, elements: !770)
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !769, file: !11, line: 219, baseType: !716, size: 64, align: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !769, file: !11, line: 220, baseType: !716, size: 64, align: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "Set", scope: !736, file: !11, line: 225, baseType: !774, size: 64, align: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 223, size: 64, align: 64, elements: !775)
!775 = !{!776}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !774, file: !11, line: 224, baseType: !716, size: 64, align: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ListComp", scope: !736, file: !11, line: 230, baseType: !778, size: 128, align: 64)
!778 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 227, size: 128, align: 64, elements: !779)
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "elt", scope: !778, file: !11, line: 228, baseType: !730, size: 64, align: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "generators", scope: !778, file: !11, line: 229, baseType: !716, size: 64, align: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "SetComp", scope: !736, file: !11, line: 235, baseType: !783, size: 128, align: 64)
!783 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 232, size: 128, align: 64, elements: !784)
!784 = !{!785, !786}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "elt", scope: !783, file: !11, line: 233, baseType: !730, size: 64, align: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "generators", scope: !783, file: !11, line: 234, baseType: !716, size: 64, align: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "DictComp", scope: !736, file: !11, line: 241, baseType: !788, size: 192, align: 64)
!788 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 237, size: 192, align: 64, elements: !789)
!789 = !{!790, !791, !792}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !788, file: !11, line: 238, baseType: !730, size: 64, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !788, file: !11, line: 239, baseType: !730, size: 64, align: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "generators", scope: !788, file: !11, line: 240, baseType: !716, size: 64, align: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "GeneratorExp", scope: !736, file: !11, line: 246, baseType: !794, size: 128, align: 64)
!794 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 243, size: 128, align: 64, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "elt", scope: !794, file: !11, line: 244, baseType: !730, size: 64, align: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "generators", scope: !794, file: !11, line: 245, baseType: !716, size: 64, align: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "Yield", scope: !736, file: !11, line: 250, baseType: !799, size: 64, align: 64)
!799 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 248, size: 64, align: 64, elements: !800)
!800 = !{!801}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !799, file: !11, line: 249, baseType: !730, size: 64, align: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "YieldFrom", scope: !736, file: !11, line: 254, baseType: !803, size: 64, align: 64)
!803 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 252, size: 64, align: 64, elements: !804)
!804 = !{!805}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !803, file: !11, line: 253, baseType: !730, size: 64, align: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "Compare", scope: !736, file: !11, line: 260, baseType: !807, size: 192, align: 64)
!807 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 256, size: 192, align: 64, elements: !808)
!808 = !{!809, !810, !818}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !807, file: !11, line: 257, baseType: !730, size: 64, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !807, file: !11, line: 258, baseType: !811, size: 64, align: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64, align: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "asdl_int_seq", file: !595, line: 26, baseType: !813)
!813 = !DICompositeType(tag: DW_TAG_structure_type, file: !595, line: 23, size: 128, align: 64, elements: !814)
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !813, file: !595, line: 24, baseType: !140, size: 64, align: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !813, file: !595, line: 25, baseType: !817, size: 32, align: 32, offset: 64)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 32, align: 32, elements: !210)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "comparators", scope: !807, file: !11, line: 259, baseType: !716, size: 64, align: 64, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "Call", scope: !736, file: !11, line: 268, baseType: !820, size: 320, align: 64)
!820 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 262, size: 320, align: 64, elements: !821)
!821 = !{!822, !823, !824, !825, !826}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !820, file: !11, line: 263, baseType: !730, size: 64, align: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !820, file: !11, line: 264, baseType: !716, size: 64, align: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "keywords", scope: !820, file: !11, line: 265, baseType: !716, size: 64, align: 64, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "starargs", scope: !820, file: !11, line: 266, baseType: !730, size: 64, align: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "kwargs", scope: !820, file: !11, line: 267, baseType: !730, size: 64, align: 64, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "Num", scope: !736, file: !11, line: 272, baseType: !828, size: 64, align: 64)
!828 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 270, size: 64, align: 64, elements: !829)
!829 = !{!830}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !828, file: !11, line: 271, baseType: !831, size: 64, align: 64)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "object", file: !595, line: 7, baseType: !134)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "Str", scope: !736, file: !11, line: 276, baseType: !833, size: 64, align: 64)
!833 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 274, size: 64, align: 64, elements: !834)
!834 = !{!835}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !833, file: !11, line: 275, baseType: !836, size: 64, align: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "string", file: !595, line: 5, baseType: !134)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "Bytes", scope: !736, file: !11, line: 280, baseType: !838, size: 64, align: 64)
!838 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 278, size: 64, align: 64, elements: !839)
!839 = !{!840}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !838, file: !11, line: 279, baseType: !841, size: 64, align: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "bytes", file: !595, line: 6, baseType: !134)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "NameConstant", scope: !736, file: !11, line: 284, baseType: !843, size: 64, align: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 282, size: 64, align: 64, elements: !844)
!844 = !{!845}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !843, file: !11, line: 283, baseType: !846, size: 64, align: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "singleton", file: !595, line: 8, baseType: !134)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "Attribute", scope: !736, file: !11, line: 290, baseType: !848, size: 192, align: 64)
!848 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 286, size: 192, align: 64, elements: !849)
!849 = !{!850, !851, !852}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !848, file: !11, line: 287, baseType: !730, size: 64, align: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !848, file: !11, line: 288, baseType: !594, size: 64, align: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !848, file: !11, line: 289, baseType: !596, size: 32, align: 32, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "Subscript", scope: !736, file: !11, line: 296, baseType: !854, size: 192, align: 64)
!854 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 292, size: 192, align: 64, elements: !855)
!855 = !{!856, !857, !880}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !854, file: !11, line: 293, baseType: !730, size: 64, align: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !854, file: !11, line: 294, baseType: !858, size: 64, align: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "slice_ty", file: !11, line: 14, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64, align: 64)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "_slice", file: !11, line: 324, size: 256, align: 64, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !860, file: !11, line: 325, baseType: !77, size: 32, align: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !860, file: !11, line: 341, baseType: !864, size: 192, align: 64, offset: 64)
!864 = !DICompositeType(tag: DW_TAG_union_type, scope: !860, file: !11, line: 326, size: 192, align: 64, elements: !865)
!865 = !{!866, !872, !876}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "Slice", scope: !864, file: !11, line: 331, baseType: !867, size: 192, align: 64)
!867 = !DICompositeType(tag: DW_TAG_structure_type, scope: !864, file: !11, line: 327, size: 192, align: 64, elements: !868)
!868 = !{!869, !870, !871}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !867, file: !11, line: 328, baseType: !730, size: 64, align: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !867, file: !11, line: 329, baseType: !730, size: 64, align: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !867, file: !11, line: 330, baseType: !730, size: 64, align: 64, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ExtSlice", scope: !864, file: !11, line: 335, baseType: !873, size: 64, align: 64)
!873 = !DICompositeType(tag: DW_TAG_structure_type, scope: !864, file: !11, line: 333, size: 64, align: 64, elements: !874)
!874 = !{!875}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "dims", scope: !873, file: !11, line: 334, baseType: !716, size: 64, align: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "Index", scope: !864, file: !11, line: 339, baseType: !877, size: 64, align: 64)
!877 = !DICompositeType(tag: DW_TAG_structure_type, scope: !864, file: !11, line: 337, size: 64, align: 64, elements: !878)
!878 = !{!879}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !877, file: !11, line: 338, baseType: !730, size: 64, align: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !854, file: !11, line: 295, baseType: !596, size: 32, align: 32, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "Starred", scope: !736, file: !11, line: 301, baseType: !882, size: 128, align: 64)
!882 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 298, size: 128, align: 64, elements: !883)
!883 = !{!884, !885}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !882, file: !11, line: 299, baseType: !730, size: 64, align: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !882, file: !11, line: 300, baseType: !596, size: 32, align: 32, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !736, file: !11, line: 306, baseType: !887, size: 128, align: 64)
!887 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 303, size: 128, align: 64, elements: !888)
!888 = !{!889, !890}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !887, file: !11, line: 304, baseType: !594, size: 64, align: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !887, file: !11, line: 305, baseType: !596, size: 32, align: 32, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "List", scope: !736, file: !11, line: 311, baseType: !892, size: 128, align: 64)
!892 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 308, size: 128, align: 64, elements: !893)
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !892, file: !11, line: 309, baseType: !716, size: 64, align: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !892, file: !11, line: 310, baseType: !596, size: 32, align: 32, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "Tuple", scope: !736, file: !11, line: 316, baseType: !897, size: 128, align: 64)
!897 = !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !11, line: 313, size: 128, align: 64, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !897, file: !11, line: 314, baseType: !716, size: 64, align: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !897, file: !11, line: 315, baseType: !596, size: 32, align: 32, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !732, file: !11, line: 319, baseType: !129, size: 32, align: 32, offset: 384)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "col_offset", scope: !732, file: !11, line: 320, baseType: !129, size: 32, align: 32, offset: 416)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "lineno", scope: !726, file: !11, line: 377, baseType: !129, size: 32, align: 32, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "col_offset", scope: !726, file: !11, line: 378, baseType: !129, size: 32, align: 32, offset: 160)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "kwonlyargs", scope: !713, file: !11, line: 368, baseType: !716, size: 64, align: 64, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "kw_defaults", scope: !713, file: !11, line: 369, baseType: !716, size: 64, align: 64, offset: 192)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "kwarg", scope: !713, file: !11, line: 370, baseType: !724, size: 64, align: 64, offset: 256)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !713, file: !11, line: 371, baseType: !716, size: 64, align: 64, offset: 320)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !707, file: !11, line: 78, baseType: !716, size: 64, align: 64, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "decorator_list", scope: !707, file: !11, line: 79, baseType: !716, size: 64, align: 64, offset: 192)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "returns", scope: !707, file: !11, line: 80, baseType: !730, size: 64, align: 64, offset: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ClassDef", scope: !704, file: !11, line: 91, baseType: !913, size: 448, align: 64)
!913 = !DICompositeType(tag: DW_TAG_structure_type, scope: !704, file: !11, line: 83, size: 448, align: 64, elements: !914)
!914 = !{!915, !916, !917, !918, !919, !920, !921}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !913, file: !11, line: 84, baseType: !594, size: 64, align: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !913, file: !11, line: 85, baseType: !716, size: 64, align: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "keywords", scope: !913, file: !11, line: 86, baseType: !716, size: 64, align: 64, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "starargs", scope: !913, file: !11, line: 87, baseType: !730, size: 64, align: 64, offset: 192)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "kwargs", scope: !913, file: !11, line: 88, baseType: !730, size: 64, align: 64, offset: 256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !913, file: !11, line: 89, baseType: !716, size: 64, align: 64, offset: 320)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "decorator_list", scope: !913, file: !11, line: 90, baseType: !716, size: 64, align: 64, offset: 384)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "Return", scope: !704, file: !11, line: 95, baseType: !923, size: 64, align: 64)
!923 = !DICompositeType(tag: DW_TAG_structure_type, scope: !704, file: !11, line: 93, size: 64, align: 64, elements: !924)
!924 = !{!925}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !923, file: !11, line: 94, baseType: !730, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "Delete", scope: !704, file: !11, line: 99, baseType: !927, size: 64, align: 64)
!927 = !DICompositeType(tag: DW_TAG_structure_type, scope: !704, file: !11, line: 97, size: 64, align: 64, elements: !928)
!928 = !{!929}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "targets", scope: !927, file: !11, line: 98, baseType: !716, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "Assign", scope: !704, file: !11, line: 104, baseType: !931, size: 128, align: 64)
!931 = !DICompositeType(tag: DW_TAG_structure_type, scope: !704, file: !11, line: 101, size: 128, align: 64, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "targets", scope: !931, file: !11, line: 102, baseType: !716, size: 64, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !931, file: !11, line: 103, baseType: !730, size: 64, align: 64, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "AugAssign", scope: !704, file: !11, line: 110, baseType: !936, size: 192, align: 64)
!936 = !DICompositeType(tag: DW_TAG_structure_type, scope: !704, file: !11, line: 106, size: 192, align: 64, elements: !937)
!937 = !{!938, !939, !940}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !936, file: !11, line: 107, baseType: !730, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !936, file: !11, line: 108, baseType: !749, size: 32, align: 32, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !936, file: !11, line: 109, baseType: !730, size: 64, align: 64, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "For", scope: !704, file: !11, line: 117, baseType: !942, size: 256, align: 64)
!942 = !DICompositeType(tag: DW_TAG_structure_type, scope: !704, file: !11, line: 112, size: 256, align: 64, elements: !943)
!943 = !{!944, !945, !946, !947}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !942, file: !11, line: 113, baseType: !730, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !942, file: !11, line: 114, baseType: !730, size: 64, align: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !942, file: !11, line: 115, baseType: !716, size: 64, align: 64, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "orelse", scope: !942, file: !11, line: 116, baseType: !716, size: 64, align: 64, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "While", scope: !704, file: !11, line: 123, baseType: !949, size: 192, align: 64)
!949 = !DICompositeType(tag: DW_TAG_structure_type, scope: !704, file: !11, line: 119, size: 192, align: 64, elements: !950)
!950 = !{!951, !952, !953}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !949, file: !11, line: 120, baseType: !730, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !949, file: !11, line: 121, baseType: !716, size: 64, align: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "orelse", scope: !949, file: !11, line: 122, baseType: !716, size: 64, align: 64, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "If", scope: !704, file: !11, line: 129, baseType: !955, size: 192, align: 64)
!955 = !DICompositeType(tag: DW_TAG_structure_type, scope: !704, file: !11, line: 125, size: 192, align: 64, elements: !956)
!956 = !{!957, !958, !959}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !955, file: !11, line: 126, baseType: !730, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !955, file: !11, line: 127, baseType: !716, size: 64, align: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "orelse", scope: !955, file: !11, line: 128, baseType: !716, size: 64, align: 64, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "With", scope: !704, file: !11, line: 134, baseType: !961, size: 128, align: 64)
!961 = !DICompositeType(tag: DW_TAG_structure_type, scope: !704, file: !11, line: 131, size: 128, align: 64, elements: !962)
!962 = !{!963, !964}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !961, file: !11, line: 132, baseType: !716, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !961, file: !11, line: 133, baseType: !716, size: 64, align: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "Raise", scope: !704, file: !11, line: 139, baseType: !966, size: 128, align: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, scope: !704, file: !11, line: 136, size: 128, align: 64, elements: !967)
!967 = !{!968, !969}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "exc", scope: !966, file: !11, line: 137, baseType: !730, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !966, file: !11, line: 138, baseType: !730, size: 64, align: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "Try", scope: !704, file: !11, line: 146, baseType: !971, size: 256, align: 64)
!971 = !DICompositeType(tag: DW_TAG_structure_type, scope: !704, file: !11, line: 141, size: 256, align: 64, elements: !972)
!972 = !{!973, !974, !975, !976}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !971, file: !11, line: 142, baseType: !716, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !971, file: !11, line: 143, baseType: !716, size: 64, align: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "orelse", scope: !971, file: !11, line: 144, baseType: !716, size: 64, align: 64, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "finalbody", scope: !971, file: !11, line: 145, baseType: !716, size: 64, align: 64, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "Assert", scope: !704, file: !11, line: 151, baseType: !978, size: 128, align: 64)
!978 = !DICompositeType(tag: DW_TAG_structure_type, scope: !704, file: !11, line: 148, size: 128, align: 64, elements: !979)
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !978, file: !11, line: 149, baseType: !730, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !978, file: !11, line: 150, baseType: !730, size: 64, align: 64, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "Import", scope: !704, file: !11, line: 155, baseType: !983, size: 64, align: 64)
!983 = !DICompositeType(tag: DW_TAG_structure_type, scope: !704, file: !11, line: 153, size: 64, align: 64, elements: !984)
!984 = !{!985}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !983, file: !11, line: 154, baseType: !716, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "ImportFrom", scope: !704, file: !11, line: 161, baseType: !987, size: 192, align: 64)
!987 = !DICompositeType(tag: DW_TAG_structure_type, scope: !704, file: !11, line: 157, size: 192, align: 64, elements: !988)
!988 = !{!989, !990, !991}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !987, file: !11, line: 158, baseType: !594, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "names", scope: !987, file: !11, line: 159, baseType: !716, size: 64, align: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !987, file: !11, line: 160, baseType: !129, size: 32, align: 32, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "Global", scope: !704, file: !11, line: 165, baseType: !993, size: 64, align: 64)
