; ModuleID = 'irs-onlybc/connection.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !15, subprograms: !512, globals: !1253)
!1 = !DIFile(filename: "connection.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !8}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 190, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "PyGILState_LOCKED", value: 0)
!7 = !DIEnumerator(name: "PyGILState_UNLOCKED", value: 1)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !9, line: 451, size: 32, align: 32, elements: !10)
!9 = !DIFile(filename: "./Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!10 = !{!11, !12, !13, !14}
!11 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!12 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!13 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!14 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!15 = !{!16, !362, !55, !385, !403, !101, !40, !459, !460, !461, !479, !487, !505, !506, !508, !510}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !18, line: 109, baseType: !19)
!18 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !18, line: 105, size: 128, align: 64, elements: !20)
!20 = !{!21, !29}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !19, file: !18, line: 107, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !23, line: 177, baseType: !24)
!23 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !25, line: 102, baseType: !26)
!25 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !27, line: 181, baseType: !28)
!27 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!28 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !19, file: !18, line: 108, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !18, line: 334, size: 3200, align: 64, elements: !32)
!32 = !{!33, !39, !43, !44, !45, !50, !114, !119, !124, !125, !130, !182, !213, !225, !231, !232, !233, !235, !237, !268, !269, !270, !279, !280, !285, !286, !288, !290, !300, !310, !328, !329, !330, !332, !334, !335, !337, !342, !347, !352, !353, !354, !355, !356, !357, !358, !359, !361}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !18, line: 335, baseType: !34, size: 192, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !18, line: 114, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 111, size: 192, align: 64, elements: !36)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !35, file: !18, line: 112, baseType: !17, size: 128, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !35, file: !18, line: 113, baseType: !22, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !31, file: !18, line: 336, baseType: !40, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !31, file: !18, line: 337, baseType: !22, size: 64, align: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !31, file: !18, line: 337, baseType: !22, size: 64, align: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !31, file: !18, line: 341, baseType: !46, size: 64, align: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !18, line: 308, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !16}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !31, file: !18, line: 342, baseType: !51, size: 64, align: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !18, line: 314, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !16, !56, !55}
!55 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !25, line: 48, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !59, line: 246, size: 1728, align: 64, elements: !60)
!59 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!60 = !{!61, !62, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !82, !83, !84, !85, !87, !89, !91, !95, !98, !100, !102, !103, !104, !105, !109, !110}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !58, file: !59, line: 247, baseType: !55, size: 32, align: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !58, file: !59, line: 252, baseType: !63, size: 64, align: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !58, file: !59, line: 253, baseType: !63, size: 64, align: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !58, file: !59, line: 254, baseType: !63, size: 64, align: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !58, file: !59, line: 255, baseType: !63, size: 64, align: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !58, file: !59, line: 256, baseType: !63, size: 64, align: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !58, file: !59, line: 257, baseType: !63, size: 64, align: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !58, file: !59, line: 258, baseType: !63, size: 64, align: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !58, file: !59, line: 259, baseType: !63, size: 64, align: 64, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !58, file: !59, line: 261, baseType: !63, size: 64, align: 64, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !58, file: !59, line: 262, baseType: !63, size: 64, align: 64, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !58, file: !59, line: 263, baseType: !63, size: 64, align: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !58, file: !59, line: 265, baseType: !75, size: 64, align: 64, offset: 768)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !59, line: 161, size: 192, align: 64, elements: !77)
!77 = !{!78, !79, !81}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !76, file: !59, line: 162, baseType: !75, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !76, file: !59, line: 163, baseType: !80, size: 64, align: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !76, file: !59, line: 167, baseType: !55, size: 32, align: 32, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !58, file: !59, line: 267, baseType: !80, size: 64, align: 64, offset: 832)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !58, file: !59, line: 269, baseType: !55, size: 32, align: 32, offset: 896)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !58, file: !59, line: 273, baseType: !55, size: 32, align: 32, offset: 928)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !58, file: !59, line: 275, baseType: !86, size: 64, align: 64, offset: 960)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !27, line: 140, baseType: !28)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !58, file: !59, line: 279, baseType: !88, size: 16, align: 16, offset: 1024)
!88 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !58, file: !59, line: 280, baseType: !90, size: 8, align: 8, offset: 1040)
!90 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !58, file: !59, line: 281, baseType: !92, size: 8, align: 8, offset: 1048)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 8, align: 8, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 1)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !58, file: !59, line: 285, baseType: !96, size: 64, align: 64, offset: 1088)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !59, line: 155, baseType: null)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !58, file: !59, line: 294, baseType: !99, size: 64, align: 64, offset: 1152)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !27, line: 141, baseType: !28)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !58, file: !59, line: 303, baseType: !101, size: 64, align: 64, offset: 1216)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !58, file: !59, line: 304, baseType: !101, size: 64, align: 64, offset: 1280)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !58, file: !59, line: 305, baseType: !101, size: 64, align: 64, offset: 1344)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !58, file: !59, line: 306, baseType: !101, size: 64, align: 64, offset: 1408)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !58, file: !59, line: 307, baseType: !106, size: 64, align: 64, offset: 1472)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !107, line: 62, baseType: !108)
!107 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!108 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !58, file: !59, line: 309, baseType: !55, size: 32, align: 32, offset: 1536)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !58, file: !59, line: 311, baseType: !111, size: 160, align: 8, offset: 1568)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 160, align: 8, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 20)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !31, file: !18, line: 343, baseType: !115, size: 64, align: 64, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !18, line: 316, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!16, !16, !63}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !31, file: !18, line: 344, baseType: !120, size: 64, align: 64, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !18, line: 318, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!55, !16, !63, !16}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !31, file: !18, line: 345, baseType: !101, size: 64, align: 64, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !31, file: !18, line: 346, baseType: !126, size: 64, align: 64, offset: 704)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !18, line: 320, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!16, !16}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !31, file: !18, line: 350, baseType: !131, size: 64, align: 64, offset: 768)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !18, line: 278, baseType: !133)
!133 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 236, size: 2176, align: 64, elements: !134)
!134 = !{!135, !140, !141, !142, !143, !144, !149, !151, !152, !153, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !133, file: !18, line: 241, baseType: !136, size: 64, align: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !18, line: 166, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!16, !16, !16}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !133, file: !18, line: 242, baseType: !136, size: 64, align: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !133, file: !18, line: 243, baseType: !136, size: 64, align: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !133, file: !18, line: 244, baseType: !136, size: 64, align: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !133, file: !18, line: 245, baseType: !136, size: 64, align: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !133, file: !18, line: 246, baseType: !145, size: 64, align: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !18, line: 167, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!16, !16, !16, !16}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !133, file: !18, line: 247, baseType: !150, size: 64, align: 64, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !18, line: 165, baseType: !127)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !133, file: !18, line: 248, baseType: !150, size: 64, align: 64, offset: 448)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !133, file: !18, line: 249, baseType: !150, size: 64, align: 64, offset: 512)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !133, file: !18, line: 250, baseType: !154, size: 64, align: 64, offset: 576)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !18, line: 168, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!55, !16}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !133, file: !18, line: 251, baseType: !150, size: 64, align: 64, offset: 640)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !133, file: !18, line: 252, baseType: !136, size: 64, align: 64, offset: 704)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !133, file: !18, line: 253, baseType: !136, size: 64, align: 64, offset: 768)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !133, file: !18, line: 254, baseType: !136, size: 64, align: 64, offset: 832)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !133, file: !18, line: 255, baseType: !136, size: 64, align: 64, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !133, file: !18, line: 256, baseType: !136, size: 64, align: 64, offset: 960)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !133, file: !18, line: 257, baseType: !150, size: 64, align: 64, offset: 1024)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !133, file: !18, line: 258, baseType: !101, size: 64, align: 64, offset: 1088)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !133, file: !18, line: 259, baseType: !150, size: 64, align: 64, offset: 1152)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !133, file: !18, line: 261, baseType: !136, size: 64, align: 64, offset: 1216)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !133, file: !18, line: 262, baseType: !136, size: 64, align: 64, offset: 1280)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !133, file: !18, line: 263, baseType: !136, size: 64, align: 64, offset: 1344)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !133, file: !18, line: 264, baseType: !136, size: 64, align: 64, offset: 1408)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !133, file: !18, line: 265, baseType: !145, size: 64, align: 64, offset: 1472)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !133, file: !18, line: 266, baseType: !136, size: 64, align: 64, offset: 1536)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !133, file: !18, line: 267, baseType: !136, size: 64, align: 64, offset: 1600)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !133, file: !18, line: 268, baseType: !136, size: 64, align: 64, offset: 1664)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !133, file: !18, line: 269, baseType: !136, size: 64, align: 64, offset: 1728)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !133, file: !18, line: 270, baseType: !136, size: 64, align: 64, offset: 1792)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !133, file: !18, line: 272, baseType: !136, size: 64, align: 64, offset: 1856)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !133, file: !18, line: 273, baseType: !136, size: 64, align: 64, offset: 1920)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !133, file: !18, line: 274, baseType: !136, size: 64, align: 64, offset: 1984)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !133, file: !18, line: 275, baseType: !136, size: 64, align: 64, offset: 2048)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !133, file: !18, line: 277, baseType: !150, size: 64, align: 64, offset: 2112)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !31, file: !18, line: 351, baseType: !183, size: 64, align: 64, offset: 832)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !18, line: 292, baseType: !185)
!185 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 280, size: 640, align: 64, elements: !186)
!186 = !{!187, !192, !193, !198, !199, !200, !205, !206, !211, !212}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !185, file: !18, line: 281, baseType: !188, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !18, line: 169, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!22, !16}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !185, file: !18, line: 282, baseType: !136, size: 64, align: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !185, file: !18, line: 283, baseType: !194, size: 64, align: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !18, line: 170, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!16, !16, !22}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !185, file: !18, line: 284, baseType: !194, size: 64, align: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !185, file: !18, line: 285, baseType: !101, size: 64, align: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !185, file: !18, line: 286, baseType: !201, size: 64, align: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !18, line: 172, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!55, !16, !22, !16}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !185, file: !18, line: 287, baseType: !101, size: 64, align: 64, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !185, file: !18, line: 288, baseType: !207, size: 64, align: 64, offset: 448)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !18, line: 231, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!55, !16, !16}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !185, file: !18, line: 290, baseType: !136, size: 64, align: 64, offset: 512)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !185, file: !18, line: 291, baseType: !194, size: 64, align: 64, offset: 576)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !31, file: !18, line: 352, baseType: !214, size: 64, align: 64, offset: 896)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !18, line: 298, baseType: !216)
!216 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 294, size: 192, align: 64, elements: !217)
!217 = !{!218, !219, !220}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !216, file: !18, line: 295, baseType: !188, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !216, file: !18, line: 296, baseType: !136, size: 64, align: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !216, file: !18, line: 297, baseType: !221, size: 64, align: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !18, line: 174, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!55, !16, !16, !16}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !31, file: !18, line: 356, baseType: !226, size: 64, align: 64, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !18, line: 321, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!230, !16}
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !23, line: 186, baseType: !22)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !31, file: !18, line: 357, baseType: !145, size: 64, align: 64, offset: 1024)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !31, file: !18, line: 358, baseType: !126, size: 64, align: 64, offset: 1088)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !31, file: !18, line: 359, baseType: !234, size: 64, align: 64, offset: 1152)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !18, line: 317, baseType: !137)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !31, file: !18, line: 360, baseType: !236, size: 64, align: 64, offset: 1216)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !18, line: 319, baseType: !222)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !31, file: !18, line: 363, baseType: !238, size: 64, align: 64, offset: 1280)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !18, line: 304, baseType: !240)
!240 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 301, size: 128, align: 64, elements: !241)
!241 = !{!242, !263}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !240, file: !18, line: 302, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !18, line: 193, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!55, !16, !247, !55}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !18, line: 191, baseType: !249)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !18, line: 178, size: 640, align: 64, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258, !260, !261, !262}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !249, file: !18, line: 179, baseType: !101, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !249, file: !18, line: 180, baseType: !16, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !249, file: !18, line: 181, baseType: !22, size: 64, align: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !249, file: !18, line: 182, baseType: !22, size: 64, align: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !249, file: !18, line: 184, baseType: !55, size: 32, align: 32, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !249, file: !18, line: 185, baseType: !55, size: 32, align: 32, offset: 288)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !249, file: !18, line: 186, baseType: !63, size: 64, align: 64, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !249, file: !18, line: 187, baseType: !259, size: 64, align: 64, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !249, file: !18, line: 188, baseType: !259, size: 64, align: 64, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !249, file: !18, line: 189, baseType: !259, size: 64, align: 64, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !249, file: !18, line: 190, baseType: !101, size: 64, align: 64, offset: 576)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !240, file: !18, line: 303, baseType: !264, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !18, line: 194, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !16, !247}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !31, file: !18, line: 366, baseType: !108, size: 64, align: 64, offset: 1344)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !31, file: !18, line: 368, baseType: !40, size: 64, align: 64, offset: 1408)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !31, file: !18, line: 372, baseType: !271, size: 64, align: 64, offset: 1472)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !18, line: 233, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!55, !16, !275, !101}
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !18, line: 232, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!55, !16, !101}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !31, file: !18, line: 375, baseType: !154, size: 64, align: 64, offset: 1536)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !31, file: !18, line: 379, baseType: !281, size: 64, align: 64, offset: 1600)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !18, line: 322, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!16, !16, !16, !55}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !31, file: !18, line: 382, baseType: !22, size: 64, align: 64, offset: 1664)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !31, file: !18, line: 385, baseType: !287, size: 64, align: 64, offset: 1728)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !18, line: 323, baseType: !127)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !31, file: !18, line: 386, baseType: !289, size: 64, align: 64, offset: 1792)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !18, line: 324, baseType: !127)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !31, file: !18, line: 389, baseType: !291, size: 64, align: 64, offset: 1856)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !293, line: 40, size: 256, align: 64, elements: !294)
!293 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!294 = !{!295, !296, !298, !299}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !292, file: !293, line: 41, baseType: !40, size: 64, align: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !292, file: !293, line: 42, baseType: !297, size: 64, align: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !293, line: 18, baseType: !137)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !292, file: !293, line: 43, baseType: !55, size: 32, align: 32, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !292, file: !293, line: 45, baseType: !40, size: 64, align: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !31, file: !18, line: 390, baseType: !301, size: 64, align: 64, offset: 1920)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !303, line: 18, size: 320, align: 64, elements: !304)
!303 = !DIFile(filename: "./Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!304 = !{!305, !306, !307, !308, !309}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !302, file: !303, line: 19, baseType: !63, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !302, file: !303, line: 20, baseType: !55, size: 32, align: 32, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !302, file: !303, line: 21, baseType: !22, size: 64, align: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !302, file: !303, line: 22, baseType: !55, size: 32, align: 32, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !302, file: !303, line: 23, baseType: !63, size: 64, align: 64, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !31, file: !18, line: 391, baseType: !311, size: 64, align: 64, offset: 1984)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !313, line: 11, size: 320, align: 64, elements: !314)
!313 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!314 = !{!315, !316, !321, !326, !327}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !312, file: !313, line: 12, baseType: !63, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !312, file: !313, line: 13, baseType: !317, size: 64, align: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !313, line: 8, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!16, !16, !101}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !312, file: !313, line: 14, baseType: !322, size: 64, align: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !313, line: 9, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!55, !16, !16, !101}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !312, file: !313, line: 15, baseType: !63, size: 64, align: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !312, file: !313, line: 16, baseType: !101, size: 64, align: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !31, file: !18, line: 392, baseType: !30, size: 64, align: 64, offset: 2048)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !31, file: !18, line: 393, baseType: !16, size: 64, align: 64, offset: 2112)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !31, file: !18, line: 394, baseType: !331, size: 64, align: 64, offset: 2176)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !18, line: 325, baseType: !146)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !31, file: !18, line: 395, baseType: !333, size: 64, align: 64, offset: 2240)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !18, line: 326, baseType: !222)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !31, file: !18, line: 396, baseType: !22, size: 64, align: 64, offset: 2304)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !31, file: !18, line: 397, baseType: !336, size: 64, align: 64, offset: 2368)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !18, line: 327, baseType: !222)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !31, file: !18, line: 398, baseType: !338, size: 64, align: 64, offset: 2432)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !18, line: 329, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!16, !30, !22}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !31, file: !18, line: 399, baseType: !343, size: 64, align: 64, offset: 2496)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !18, line: 328, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!16, !30, !16, !16}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !31, file: !18, line: 400, baseType: !348, size: 64, align: 64, offset: 2560)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !18, line: 307, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !101}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !31, file: !18, line: 401, baseType: !154, size: 64, align: 64, offset: 2624)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !31, file: !18, line: 402, baseType: !16, size: 64, align: 64, offset: 2688)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !31, file: !18, line: 403, baseType: !16, size: 64, align: 64, offset: 2752)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !31, file: !18, line: 404, baseType: !16, size: 64, align: 64, offset: 2816)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !31, file: !18, line: 405, baseType: !16, size: 64, align: 64, offset: 2880)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !31, file: !18, line: 406, baseType: !16, size: 64, align: 64, offset: 2944)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !31, file: !18, line: 407, baseType: !46, size: 64, align: 64, offset: 3008)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !31, file: !18, line: 410, baseType: !360, size: 32, align: 32, offset: 3072)
!360 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !31, file: !18, line: 412, baseType: !46, size: 64, align: 64, offset: 3136)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "pysqlite_Cache", file: !364, line: 59, baseType: !365)
!364 = !DIFile(filename: "Modules/_sqlite/cache.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!365 = !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 42, size: 512, align: 64, elements: !366)
!366 = !{!367, !368, !369, !370, !371, !383, !384}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !365, file: !364, line: 44, baseType: !17, size: 128, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !365, file: !364, line: 45, baseType: !55, size: 32, align: 32, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !365, file: !364, line: 48, baseType: !16, size: 64, align: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "factory", scope: !365, file: !364, line: 51, baseType: !16, size: 64, align: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !365, file: !364, line: 53, baseType: !372, size: 64, align: 64, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "pysqlite_Node", file: !364, line: 40, baseType: !374)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "_pysqlite_Node", file: !364, line: 32, size: 448, align: 64, elements: !375)
!375 = !{!376, !377, !378, !379, !380, !382}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !374, file: !364, line: 34, baseType: !17, size: 128, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !374, file: !364, line: 35, baseType: !16, size: 64, align: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !374, file: !364, line: 36, baseType: !16, size: 64, align: 64, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !374, file: !364, line: 37, baseType: !28, size: 64, align: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !374, file: !364, line: 38, baseType: !381, size: 64, align: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !374, file: !364, line: 39, baseType: !381, size: 64, align: 64, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !365, file: !364, line: 54, baseType: !372, size: 64, align: 64, offset: 384)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "decref_factory", scope: !365, file: !364, line: 58, baseType: !55, size: 32, align: 32, offset: 448)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "pysqlite_Statement", file: !387, line: 42, baseType: !388)
!387 = !DIFile(filename: "Modules/_sqlite/statement.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!388 = !DICompositeType(tag: DW_TAG_structure_type, file: !387, line: 34, size: 448, align: 64, elements: !389)
!389 = !{!390, !391, !396, !400, !401, !402}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !388, file: !387, line: 36, baseType: !17, size: 128, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !388, file: !387, line: 37, baseType: !392, size: 64, align: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3", file: !394, line: 228, baseType: !395)
!394 = !DIFile(filename: "/usr/include/sqlite3.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3", file: !394, line: 228, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !388, file: !387, line: 38, baseType: !397, size: 64, align: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_stmt", file: !394, line: 2911, baseType: !399)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_stmt", file: !394, line: 2911, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "sql", scope: !388, file: !387, line: 39, baseType: !16, size: 64, align: 64, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "in_use", scope: !388, file: !387, line: 40, baseType: !55, size: 32, align: 32, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "in_weakreflist", scope: !388, file: !387, line: 41, baseType: !16, size: 64, align: 64, offset: 384)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "pysqlite_Cursor", file: !405, line: 52, baseType: !406)
!405 = !DIFile(filename: "Modules/_sqlite/cursor.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!406 = !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 32, size: 896, align: 64, elements: !407)
!407 = !{!408, !409, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !406, file: !405, line: 34, baseType: !17, size: 128, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !406, file: !405, line: 35, baseType: !410, size: 64, align: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "pysqlite_Connection", file: !412, line: 112, baseType: !413)
!412 = !DIFile(filename: "Modules/_sqlite/connection.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!413 = !DICompositeType(tag: DW_TAG_structure_type, file: !412, line: 35, size: 1792, align: 64, elements: !414)
!414 = !{!415, !416, !417, !418, !419, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !413, file: !412, line: 37, baseType: !17, size: 128, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !413, file: !412, line: 38, baseType: !392, size: 64, align: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "inTransaction", scope: !413, file: !412, line: 42, baseType: !42, size: 8, align: 8, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "detect_types", scope: !413, file: !412, line: 46, baseType: !55, size: 32, align: 32, offset: 224)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !413, file: !412, line: 49, baseType: !420, size: 64, align: 64, offset: 256)
!420 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_started", scope: !413, file: !412, line: 53, baseType: !420, size: 64, align: 64, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "isolation_level", scope: !413, file: !412, line: 56, baseType: !16, size: 64, align: 64, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "begin_statement", scope: !413, file: !412, line: 60, baseType: !63, size: 64, align: 64, offset: 448)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "check_same_thread", scope: !413, file: !412, line: 64, baseType: !55, size: 32, align: 32, offset: 512)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !413, file: !412, line: 66, baseType: !55, size: 32, align: 32, offset: 544)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ident", scope: !413, file: !412, line: 69, baseType: !28, size: 64, align: 64, offset: 576)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "statement_cache", scope: !413, file: !412, line: 71, baseType: !362, size: 64, align: 64, offset: 640)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "statements", scope: !413, file: !412, line: 74, baseType: !16, size: 64, align: 64, offset: 704)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "cursors", scope: !413, file: !412, line: 75, baseType: !16, size: 64, align: 64, offset: 768)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "created_statements", scope: !413, file: !412, line: 79, baseType: !55, size: 32, align: 32, offset: 832)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "created_cursors", scope: !413, file: !412, line: 80, baseType: !55, size: 32, align: 32, offset: 864)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "row_factory", scope: !413, file: !412, line: 82, baseType: !16, size: 64, align: 64, offset: 896)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "text_factory", scope: !413, file: !412, line: 90, baseType: !16, size: 64, align: 64, offset: 960)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "function_pinboard", scope: !413, file: !412, line: 96, baseType: !16, size: 64, align: 64, offset: 1024)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "collations", scope: !413, file: !412, line: 99, baseType: !16, size: 64, align: 64, offset: 1088)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Warning", scope: !413, file: !412, line: 102, baseType: !16, size: 64, align: 64, offset: 1152)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Error", scope: !413, file: !412, line: 103, baseType: !16, size: 64, align: 64, offset: 1216)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceError", scope: !413, file: !412, line: 104, baseType: !16, size: 64, align: 64, offset: 1280)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "DatabaseError", scope: !413, file: !412, line: 105, baseType: !16, size: 64, align: 64, offset: 1344)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "DataError", scope: !413, file: !412, line: 106, baseType: !16, size: 64, align: 64, offset: 1408)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "OperationalError", scope: !413, file: !412, line: 107, baseType: !16, size: 64, align: 64, offset: 1472)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "IntegrityError", scope: !413, file: !412, line: 108, baseType: !16, size: 64, align: 64, offset: 1536)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "InternalError", scope: !413, file: !412, line: 109, baseType: !16, size: 64, align: 64, offset: 1600)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ProgrammingError", scope: !413, file: !412, line: 110, baseType: !16, size: 64, align: 64, offset: 1664)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "NotSupportedError", scope: !413, file: !412, line: 111, baseType: !16, size: 64, align: 64, offset: 1728)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !406, file: !405, line: 36, baseType: !16, size: 64, align: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "row_cast_map", scope: !406, file: !405, line: 37, baseType: !16, size: 64, align: 64, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "arraysize", scope: !406, file: !405, line: 38, baseType: !55, size: 32, align: 32, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "lastrowid", scope: !406, file: !405, line: 39, baseType: !16, size: 64, align: 64, offset: 384)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "rowcount", scope: !406, file: !405, line: 40, baseType: !28, size: 64, align: 64, offset: 448)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "row_factory", scope: !406, file: !405, line: 41, baseType: !16, size: 64, align: 64, offset: 512)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "statement", scope: !406, file: !405, line: 42, baseType: !385, size: 64, align: 64, offset: 576)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !406, file: !405, line: 43, baseType: !55, size: 32, align: 32, offset: 640)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !406, file: !405, line: 44, baseType: !55, size: 32, align: 32, offset: 672)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !406, file: !405, line: 45, baseType: !55, size: 32, align: 32, offset: 704)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !406, file: !405, line: 46, baseType: !55, size: 32, align: 32, offset: 736)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "next_row", scope: !406, file: !405, line: 49, baseType: !16, size: 64, align: 64, offset: 768)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "in_weakreflist", scope: !406, file: !405, line: 51, baseType: !16, size: 64, align: 64, offset: 832)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_destructor_type", file: !394, line: 4239, baseType: !349)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !9, line: 351, baseType: !463)
!463 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 217, size: 384, align: 64, elements: !464)
!464 = !{!465, !466, !467, !468, !476}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !463, file: !9, line: 291, baseType: !17, size: 128, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !463, file: !9, line: 292, baseType: !22, size: 64, align: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !463, file: !9, line: 293, baseType: !230, size: 64, align: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !463, file: !9, line: 349, baseType: !469, size: 32, align: 32, offset: 256)
!469 = !DICompositeType(tag: DW_TAG_structure_type, scope: !463, file: !9, line: 294, size: 32, align: 32, elements: !470)
!470 = !{!471, !472, !473, !474, !475}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !469, file: !9, line: 303, baseType: !360, size: 2, align: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !469, file: !9, line: 331, baseType: !360, size: 3, align: 32, offset: 2)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !469, file: !9, line: 336, baseType: !360, size: 1, align: 32, offset: 5)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !469, file: !9, line: 340, baseType: !360, size: 1, align: 32, offset: 6)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !469, file: !9, line: 345, baseType: !360, size: 1, align: 32, offset: 7)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !463, file: !9, line: 350, baseType: !477, size: 64, align: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !107, line: 90, baseType: !55)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !9, line: 363, baseType: !481)
!481 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 356, size: 576, align: 64, elements: !482)
!482 = !{!483, !484, !485, !486}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !481, file: !9, line: 357, baseType: !462, size: 384, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !481, file: !9, line: 358, baseType: !22, size: 64, align: 64, offset: 384)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !481, file: !9, line: 360, baseType: !63, size: 64, align: 64, offset: 448)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !481, file: !9, line: 361, baseType: !22, size: 64, align: 64, offset: 512)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !9, line: 376, baseType: !489)
!489 = !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 368, size: 640, align: 64, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !489, file: !9, line: 369, baseType: !480, size: 576, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !489, file: !9, line: 375, baseType: !493, size: 64, align: 64, offset: 576)
!493 = !DICompositeType(tag: DW_TAG_union_type, scope: !489, file: !9, line: 370, size: 64, align: 64, elements: !494)
!494 = !{!495, !496, !500, !503}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !493, file: !9, line: 371, baseType: !101, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !493, file: !9, line: 372, baseType: !497, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !9, line: 134, baseType: !499)
!499 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !493, file: !9, line: 373, baseType: !501, size: 64, align: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64, align: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !9, line: 129, baseType: !88)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !493, file: !9, line: 374, baseType: !504, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !9, line: 121, baseType: !360)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !502)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !505)
!512 = !{!513, !597, !608, !626, !673, !690, !706, !717, !722, !734, !747, !760, !787, !808, !827, !836, !845, !848, !865, !899, !933, !967, !971, !991, !998, !1015, !1038, !1066, !1083, !1090, !1107, !1114, !1126, !1132, !1149, !1172, !1205, !1210, !1228, !1232, !1243, !1249}
!513 = !DISubprogram(name: "pysqlite_connection_init", scope: !514, file: !514, line: 62, type: !515, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.pysqlite_Connection*, %struct._object*, %struct._object*)* @pysqlite_connection_init, variables: !517)
!514 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_sqlite/connection.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!515 = !DISubroutineType(types: !516)
!516 = !{!55, !410, !16, !16}
!517 = !{!518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !589, !593, !595}
!518 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !513, file: !514, line: 62, type: !410)
!519 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !513, file: !514, line: 62, type: !16)
!520 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !513, file: !514, line: 62, type: !16)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "database", scope: !513, file: !514, line: 70, type: !63)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "detect_types", scope: !513, file: !514, line: 71, type: !55)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "isolation_level", scope: !513, file: !514, line: 72, type: !16)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "factory", scope: !513, file: !514, line: 73, type: !16)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "check_same_thread", scope: !513, file: !514, line: 74, type: !55)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cached_statements", scope: !513, file: !514, line: 75, type: !55)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uri", scope: !513, file: !514, line: 76, type: !55)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timeout", scope: !513, file: !514, line: 77, type: !420)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !513, file: !514, line: 78, type: !55)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !531, file: !514, line: 103, type: !532)
!531 = distinct !DILexicalBlock(scope: !513, file: !514, line: 103, column: 5)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !4, line: 139, baseType: !534)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !4, line: 69, size: 1536, align: 64, elements: !535)
!535 = !{!536, !538, !539, !559, !562, !563, !564, !565, !566, !567, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !534, file: !4, line: 72, baseType: !537, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !534, file: !4, line: 73, baseType: !537, size: 64, align: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !534, file: !4, line: 74, baseType: !540, size: 64, align: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !4, line: 44, baseType: !542)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !4, line: 19, size: 832, align: 64, elements: !543)
!543 = !{!544, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !542, file: !4, line: 21, baseType: !545, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !542, file: !4, line: 22, baseType: !537, size: 64, align: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !542, file: !4, line: 24, baseType: !16, size: 64, align: 64, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !542, file: !4, line: 25, baseType: !16, size: 64, align: 64, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !542, file: !4, line: 26, baseType: !16, size: 64, align: 64, offset: 256)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !542, file: !4, line: 27, baseType: !16, size: 64, align: 64, offset: 320)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !542, file: !4, line: 28, baseType: !16, size: 64, align: 64, offset: 384)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !542, file: !4, line: 30, baseType: !16, size: 64, align: 64, offset: 448)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !542, file: !4, line: 31, baseType: !16, size: 64, align: 64, offset: 512)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !542, file: !4, line: 32, baseType: !16, size: 64, align: 64, offset: 576)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !542, file: !4, line: 33, baseType: !55, size: 32, align: 32, offset: 640)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !542, file: !4, line: 34, baseType: !55, size: 32, align: 32, offset: 672)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !542, file: !4, line: 37, baseType: !55, size: 32, align: 32, offset: 704)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !542, file: !4, line: 43, baseType: !16, size: 64, align: 64, offset: 768)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !534, file: !4, line: 76, baseType: !560, size: 64, align: 64, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64, align: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !4, line: 50, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !534, file: !4, line: 77, baseType: !55, size: 32, align: 32, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !534, file: !4, line: 78, baseType: !42, size: 8, align: 8, offset: 288)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !534, file: !4, line: 80, baseType: !42, size: 8, align: 8, offset: 296)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !534, file: !4, line: 85, baseType: !55, size: 32, align: 32, offset: 320)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !534, file: !4, line: 86, baseType: !55, size: 32, align: 32, offset: 352)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !534, file: !4, line: 88, baseType: !568, size: 64, align: 64, offset: 384)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !4, line: 54, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64, align: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!55, !16, !560, !55, !16}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !534, file: !4, line: 89, baseType: !568, size: 64, align: 64, offset: 448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !534, file: !4, line: 90, baseType: !16, size: 64, align: 64, offset: 512)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !534, file: !4, line: 91, baseType: !16, size: 64, align: 64, offset: 576)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !534, file: !4, line: 93, baseType: !16, size: 64, align: 64, offset: 640)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !534, file: !4, line: 94, baseType: !16, size: 64, align: 64, offset: 704)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !534, file: !4, line: 95, baseType: !16, size: 64, align: 64, offset: 768)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !534, file: !4, line: 97, baseType: !16, size: 64, align: 64, offset: 832)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !534, file: !4, line: 98, baseType: !16, size: 64, align: 64, offset: 896)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !534, file: !4, line: 99, baseType: !16, size: 64, align: 64, offset: 960)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !534, file: !4, line: 101, baseType: !16, size: 64, align: 64, offset: 1024)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !534, file: !4, line: 103, baseType: !55, size: 32, align: 32, offset: 1088)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !534, file: !4, line: 105, baseType: !16, size: 64, align: 64, offset: 1152)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !534, file: !4, line: 106, baseType: !28, size: 64, align: 64, offset: 1216)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !534, file: !4, line: 108, baseType: !55, size: 32, align: 32, offset: 1280)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !534, file: !4, line: 109, baseType: !16, size: 64, align: 64, offset: 1344)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !534, file: !4, line: 134, baseType: !349, size: 64, align: 64, offset: 1408)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !534, file: !4, line: 135, baseType: !101, size: 64, align: 64, offset: 1472)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !590, file: !514, line: 132, type: !16)
!590 = distinct !DILexicalBlock(scope: !591, file: !514, line: 132, column: 12)
!591 = distinct !DILexicalBlock(scope: !592, file: !514, line: 131, column: 77)
!592 = distinct !DILexicalBlock(scope: !513, file: !514, line: 131, column: 9)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !594, file: !514, line: 135, type: !16)
!594 = distinct !DILexicalBlock(scope: !513, file: !514, line: 135, column: 8)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !596, file: !514, line: 158, type: !16)
!596 = distinct !DILexicalBlock(scope: !513, file: !514, line: 158, column: 8)
!597 = !DISubprogram(name: "pysqlite_flush_statement_cache", scope: !514, file: !514, line: 194, type: !598, isLocal: false, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.pysqlite_Connection*)* @pysqlite_flush_statement_cache, variables: !600)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !410}
!600 = !{!601, !602, !603, !604, !606}
!601 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !597, file: !514, line: 194, type: !410)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "node", scope: !597, file: !514, line: 196, type: !372)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "statement", scope: !597, file: !514, line: 197, type: !385)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !605, file: !514, line: 207, type: !16)
!605 = distinct !DILexicalBlock(scope: !597, file: !514, line: 207, column: 8)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !607, file: !514, line: 209, type: !16)
!607 = distinct !DILexicalBlock(scope: !597, file: !514, line: 209, column: 8)
!608 = !DISubprogram(name: "pysqlite_do_all_statements", scope: !514, file: !514, line: 214, type: !609, isLocal: false, isDefinition: true, scopeLine: 215, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.pysqlite_Connection*, i32, i32)* @pysqlite_do_all_statements, variables: !611)
!609 = !DISubroutineType(types: !610)
!610 = !{null, !410, !55, !55}
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619}
!612 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !608, file: !514, line: 214, type: !410)
!613 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "action", arg: 2, scope: !608, file: !514, line: 214, type: !55)
!614 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "reset_cursors", arg: 3, scope: !608, file: !514, line: 214, type: !55)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !608, file: !514, line: 216, type: !55)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "weakref", scope: !608, file: !514, line: 217, type: !16)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "statement", scope: !608, file: !514, line: 218, type: !16)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cursor", scope: !608, file: !514, line: 219, type: !403)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !620, file: !514, line: 231, type: !16)
!620 = distinct !DILexicalBlock(scope: !621, file: !514, line: 231, column: 16)
!621 = distinct !DILexicalBlock(scope: !622, file: !514, line: 224, column: 45)
!622 = distinct !DILexicalBlock(scope: !623, file: !514, line: 224, column: 13)
!623 = distinct !DILexicalBlock(scope: !624, file: !514, line: 221, column: 57)
!624 = distinct !DILexicalBlock(scope: !625, file: !514, line: 221, column: 5)
!625 = distinct !DILexicalBlock(scope: !608, file: !514, line: 221, column: 5)
!626 = !DISubprogram(name: "pysqlite_connection_dealloc", scope: !514, file: !514, line: 246, type: !598, isLocal: false, isDefinition: true, scopeLine: 247, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.pysqlite_Connection*)* @pysqlite_connection_dealloc, variables: !627)
!627 = !{!628, !629, !631, !634, !638, !640, !643, !645, !648, !650, !653, !655, !658, !660, !663, !665, !668, !670}
!628 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !626, file: !514, line: 246, type: !410)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !630, file: !514, line: 248, type: !16)
!630 = distinct !DILexicalBlock(scope: !626, file: !514, line: 248, column: 8)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !632, file: !514, line: 248, type: !16)
!632 = distinct !DILexicalBlock(scope: !633, file: !514, line: 248, column: 113)
!633 = distinct !DILexicalBlock(scope: !630, file: !514, line: 248, column: 79)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !635, file: !514, line: 252, type: !532)
!635 = distinct !DILexicalBlock(scope: !636, file: !514, line: 252, column: 9)
!636 = distinct !DILexicalBlock(scope: !637, file: !514, line: 251, column: 19)
!637 = distinct !DILexicalBlock(scope: !626, file: !514, line: 251, column: 9)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !639, file: !514, line: 260, type: !16)
!639 = distinct !DILexicalBlock(scope: !626, file: !514, line: 260, column: 8)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !641, file: !514, line: 260, type: !16)
!641 = distinct !DILexicalBlock(scope: !642, file: !514, line: 260, column: 113)
!642 = distinct !DILexicalBlock(scope: !639, file: !514, line: 260, column: 79)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !644, file: !514, line: 261, type: !16)
!644 = distinct !DILexicalBlock(scope: !626, file: !514, line: 261, column: 8)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !646, file: !514, line: 261, type: !16)
!646 = distinct !DILexicalBlock(scope: !647, file: !514, line: 261, column: 115)
!647 = distinct !DILexicalBlock(scope: !644, file: !514, line: 261, column: 81)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !649, file: !514, line: 262, type: !16)
!649 = distinct !DILexicalBlock(scope: !626, file: !514, line: 262, column: 8)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !651, file: !514, line: 262, type: !16)
!651 = distinct !DILexicalBlock(scope: !652, file: !514, line: 262, column: 109)
!652 = distinct !DILexicalBlock(scope: !649, file: !514, line: 262, column: 75)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !654, file: !514, line: 263, type: !16)
!654 = distinct !DILexicalBlock(scope: !626, file: !514, line: 263, column: 8)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !656, file: !514, line: 263, type: !16)
!656 = distinct !DILexicalBlock(scope: !657, file: !514, line: 263, column: 110)
!657 = distinct !DILexicalBlock(scope: !654, file: !514, line: 263, column: 76)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !659, file: !514, line: 264, type: !16)
!659 = distinct !DILexicalBlock(scope: !626, file: !514, line: 264, column: 8)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !661, file: !514, line: 264, type: !16)
!661 = distinct !DILexicalBlock(scope: !662, file: !514, line: 264, column: 108)
!662 = distinct !DILexicalBlock(scope: !659, file: !514, line: 264, column: 74)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !664, file: !514, line: 265, type: !16)
!664 = distinct !DILexicalBlock(scope: !626, file: !514, line: 265, column: 8)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !666, file: !514, line: 265, type: !16)
!666 = distinct !DILexicalBlock(scope: !667, file: !514, line: 265, column: 108)
!667 = distinct !DILexicalBlock(scope: !664, file: !514, line: 265, column: 74)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !669, file: !514, line: 266, type: !16)
!669 = distinct !DILexicalBlock(scope: !626, file: !514, line: 266, column: 8)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !671, file: !514, line: 266, type: !16)
!671 = distinct !DILexicalBlock(scope: !672, file: !514, line: 266, column: 105)
!672 = distinct !DILexicalBlock(scope: !669, file: !514, line: 266, column: 71)
!673 = !DISubprogram(name: "pysqlite_connection_register_cursor", scope: !514, file: !514, line: 276, type: !674, isLocal: false, isDefinition: true, scopeLine: 277, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.pysqlite_Connection*, %struct._object*)* @pysqlite_connection_register_cursor, variables: !676)
!674 = !DISubroutineType(types: !675)
!675 = !{!55, !410, !16}
!676 = !{!677, !678, !679, !680, !684, !688}
!677 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "connection", arg: 1, scope: !673, file: !514, line: 276, type: !410)
!678 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cursor", arg: 2, scope: !673, file: !514, line: 276, type: !16)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "weakref", scope: !673, file: !514, line: 278, type: !16)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !681, file: !514, line: 286, type: !16)
!681 = distinct !DILexicalBlock(scope: !682, file: !514, line: 286, column: 12)
!682 = distinct !DILexicalBlock(scope: !683, file: !514, line: 285, column: 59)
!683 = distinct !DILexicalBlock(scope: !673, file: !514, line: 285, column: 9)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !685, file: !514, line: 286, type: !16)
!685 = distinct !DILexicalBlock(scope: !686, file: !514, line: 286, column: 113)
!686 = distinct !DILexicalBlock(scope: !687, file: !514, line: 286, column: 84)
!687 = distinct !DILexicalBlock(scope: !681, file: !514, line: 286, column: 61)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !689, file: !514, line: 290, type: !16)
!689 = distinct !DILexicalBlock(scope: !673, file: !514, line: 290, column: 8)
!690 = !DISubprogram(name: "pysqlite_connection_cursor", scope: !514, file: !514, line: 297, type: !691, isLocal: false, isDefinition: true, scopeLine: 298, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pysqlite_Connection*, %struct._object*, %struct._object*)* @pysqlite_connection_cursor, variables: !693)
!691 = !DISubroutineType(types: !692)
!692 = !{!16, !410, !16, !16}
!693 = !{!694, !695, !696, !697, !698, !699, !703}
!694 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !690, file: !514, line: 297, type: !410)
!695 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !690, file: !514, line: 297, type: !16)
!696 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !690, file: !514, line: 297, type: !16)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "factory", scope: !690, file: !514, line: 300, type: !16)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cursor", scope: !690, file: !514, line: 301, type: !16)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !700, file: !514, line: 321, type: !16)
!700 = distinct !DILexicalBlock(scope: !701, file: !514, line: 321, column: 12)
!701 = distinct !DILexicalBlock(scope: !702, file: !514, line: 320, column: 59)
!702 = distinct !DILexicalBlock(scope: !690, file: !514, line: 320, column: 9)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !704, file: !514, line: 321, type: !16)
!704 = distinct !DILexicalBlock(scope: !705, file: !514, line: 321, column: 135)
!705 = distinct !DILexicalBlock(scope: !700, file: !514, line: 321, column: 101)
!706 = !DISubprogram(name: "pysqlite_connection_close", scope: !514, file: !514, line: 329, type: !707, isLocal: false, isDefinition: true, scopeLine: 330, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pysqlite_Connection*, %struct._object*)* @pysqlite_connection_close, variables: !709)
!707 = !DISubroutineType(types: !708)
!708 = !{!16, !410, !16}
!709 = !{!710, !711, !712, !713}
!710 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !706, file: !514, line: 329, type: !410)
!711 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !706, file: !514, line: 329, type: !16)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !706, file: !514, line: 331, type: !55)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !714, file: !514, line: 340, type: !532)
!714 = distinct !DILexicalBlock(scope: !715, file: !514, line: 340, column: 9)
!715 = distinct !DILexicalBlock(scope: !716, file: !514, line: 339, column: 19)
!716 = distinct !DILexicalBlock(scope: !706, file: !514, line: 339, column: 9)
!717 = !DISubprogram(name: "pysqlite_check_connection", scope: !514, file: !514, line: 361, type: !718, isLocal: false, isDefinition: true, scopeLine: 362, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.pysqlite_Connection*)* @pysqlite_check_connection, variables: !720)
!718 = !DISubroutineType(types: !719)
!719 = !{!55, !410}
!720 = !{!721}
!721 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "con", arg: 1, scope: !717, file: !514, line: 361, type: !410)
!722 = !DISubprogram(name: "_pysqlite_connection_begin", scope: !514, file: !514, line: 376, type: !723, isLocal: false, isDefinition: true, scopeLine: 377, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pysqlite_Connection*)* @_pysqlite_connection_begin, variables: !725)
!723 = !DISubroutineType(types: !724)
!724 = !{!16, !410}
!725 = !{!726, !727, !728, !729, !730, !732}
!726 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !722, file: !514, line: 376, type: !410)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !722, file: !514, line: 378, type: !55)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tail", scope: !722, file: !514, line: 379, type: !40)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "statement", scope: !722, file: !514, line: 380, type: !397)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !731, file: !514, line: 382, type: !532)
!731 = distinct !DILexicalBlock(scope: !722, file: !514, line: 382, column: 5)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !733, file: !514, line: 398, type: !532)
!733 = distinct !DILexicalBlock(scope: !722, file: !514, line: 398, column: 5)
!734 = !DISubprogram(name: "pysqlite_connection_commit", scope: !514, file: !514, line: 415, type: !707, isLocal: false, isDefinition: true, scopeLine: 416, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pysqlite_Connection*, %struct._object*)* @pysqlite_connection_commit, variables: !735)
!735 = !{!736, !737, !738, !739, !740, !741, !745}
!736 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !734, file: !514, line: 415, type: !410)
!737 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !734, file: !514, line: 415, type: !16)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !734, file: !514, line: 417, type: !55)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tail", scope: !734, file: !514, line: 418, type: !40)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "statement", scope: !734, file: !514, line: 419, type: !397)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !742, file: !514, line: 428, type: !532)
!742 = distinct !DILexicalBlock(scope: !743, file: !514, line: 428, column: 9)
!743 = distinct !DILexicalBlock(scope: !744, file: !514, line: 425, column: 30)
!744 = distinct !DILexicalBlock(scope: !734, file: !514, line: 425, column: 9)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !746, file: !514, line: 443, type: !532)
!746 = distinct !DILexicalBlock(scope: !743, file: !514, line: 443, column: 9)
!747 = !DISubprogram(name: "pysqlite_connection_rollback", scope: !514, file: !514, line: 461, type: !707, isLocal: false, isDefinition: true, scopeLine: 462, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pysqlite_Connection*, %struct._object*)* @pysqlite_connection_rollback, variables: !748)
!748 = !{!749, !750, !751, !752, !753, !754, !758}
!749 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !747, file: !514, line: 461, type: !410)
!750 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !747, file: !514, line: 461, type: !16)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !747, file: !514, line: 463, type: !55)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tail", scope: !747, file: !514, line: 464, type: !40)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "statement", scope: !747, file: !514, line: 465, type: !397)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !755, file: !514, line: 474, type: !532)
!755 = distinct !DILexicalBlock(scope: !756, file: !514, line: 474, column: 9)
!756 = distinct !DILexicalBlock(scope: !757, file: !514, line: 471, column: 30)
!757 = distinct !DILexicalBlock(scope: !747, file: !514, line: 471, column: 9)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !759, file: !514, line: 489, type: !532)
!759 = distinct !DILexicalBlock(scope: !756, file: !514, line: 489, column: 9)
!760 = !DISubprogram(name: "_pysqlite_build_py_params", scope: !514, file: !514, line: 544, type: !761, isLocal: false, isDefinition: true, scopeLine: 545, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.sqlite3_context*, i32, %struct.Mem**)* @_pysqlite_build_py_params, variables: !770)
!761 = !DISubroutineType(types: !762)
!762 = !{!16, !763, !55, !766}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64, align: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_context", file: !394, line: 3239, baseType: !765)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_context", file: !394, line: 3239, flags: DIFlagFwdDecl)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64, align: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64, align: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_value", file: !394, line: 3225, baseType: !769)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mem", file: !394, line: 3225, flags: DIFlagFwdDecl)
!770 = !{!771, !772, !773, !774, !775, !776, !777, !778, !779, !780}
!771 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "context", arg: 1, scope: !760, file: !514, line: 544, type: !763)
!772 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 2, scope: !760, file: !514, line: 544, type: !55)
!773 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 3, scope: !760, file: !514, line: 544, type: !766)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !760, file: !514, line: 546, type: !16)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !760, file: !514, line: 547, type: !55)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur_value", scope: !760, file: !514, line: 548, type: !767)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cur_py_value", scope: !760, file: !514, line: 549, type: !16)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val_str", scope: !760, file: !514, line: 550, type: !40)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buflen", scope: !760, file: !514, line: 551, type: !22)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !781, file: !514, line: 589, type: !16)
!781 = distinct !DILexicalBlock(scope: !782, file: !514, line: 589, column: 16)
!782 = distinct !DILexicalBlock(scope: !783, file: !514, line: 588, column: 28)
!783 = distinct !DILexicalBlock(scope: !784, file: !514, line: 588, column: 13)
!784 = distinct !DILexicalBlock(scope: !785, file: !514, line: 558, column: 32)
!785 = distinct !DILexicalBlock(scope: !786, file: !514, line: 558, column: 5)
!786 = distinct !DILexicalBlock(scope: !760, file: !514, line: 558, column: 5)
!787 = !DISubprogram(name: "_pysqlite_func_callback", scope: !514, file: !514, line: 600, type: !788, isLocal: false, isDefinition: true, scopeLine: 601, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.sqlite3_context*, i32, %struct.Mem**)* @_pysqlite_func_callback, variables: !790)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !763, !55, !766}
!790 = !{!791, !792, !793, !794, !795, !796, !797, !798, !800, !804}
!791 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "context", arg: 1, scope: !787, file: !514, line: 600, type: !763)
!792 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argc", arg: 2, scope: !787, file: !514, line: 600, type: !55)
!793 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argv", arg: 3, scope: !787, file: !514, line: 600, type: !766)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !787, file: !514, line: 602, type: !16)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "py_func", scope: !787, file: !514, line: 603, type: !16)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "py_retval", scope: !787, file: !514, line: 604, type: !16)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ok", scope: !787, file: !514, line: 605, type: !55)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "threadstate", scope: !787, file: !514, line: 608, type: !799)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGILState_STATE", file: !4, line: 191, baseType: !3)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !801, file: !514, line: 618, type: !16)
!801 = distinct !DILexicalBlock(scope: !802, file: !514, line: 618, column: 12)
!802 = distinct !DILexicalBlock(scope: !803, file: !514, line: 616, column: 15)
!803 = distinct !DILexicalBlock(scope: !787, file: !514, line: 616, column: 9)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !805, file: !514, line: 624, type: !16)
!805 = distinct !DILexicalBlock(scope: !806, file: !514, line: 624, column: 12)
!806 = distinct !DILexicalBlock(scope: !807, file: !514, line: 622, column: 20)
!807 = distinct !DILexicalBlock(scope: !787, file: !514, line: 622, column: 9)
!808 = !DISubprogram(name: "_pysqlite_final_callback", scope: !514, file: !514, line: 704, type: !809, isLocal: false, isDefinition: true, scopeLine: 705, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.sqlite3_context*)* @_pysqlite_final_callback, variables: !811)
!809 = !DISubroutineType(types: !810)
!810 = !{null, !763}
!811 = !{!812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !823}
!812 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "context", arg: 1, scope: !808, file: !514, line: 704, type: !763)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "function_result", scope: !808, file: !514, line: 706, type: !16)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aggregate_instance", scope: !808, file: !514, line: 707, type: !459)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ok", scope: !808, file: !514, line: 709, type: !55)
!816 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exception", scope: !808, file: !514, line: 710, type: !16)
!817 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !808, file: !514, line: 710, type: !16)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !808, file: !514, line: 710, type: !16)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "restore", scope: !808, file: !514, line: 711, type: !55)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "threadstate", scope: !808, file: !514, line: 714, type: !799)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !822, file: !514, line: 733, type: !16)
!822 = distinct !DILexicalBlock(scope: !808, file: !514, line: 733, column: 8)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !824, file: !514, line: 738, type: !16)
!824 = distinct !DILexicalBlock(scope: !825, file: !514, line: 738, column: 12)
!825 = distinct !DILexicalBlock(scope: !826, file: !514, line: 736, column: 26)
!826 = distinct !DILexicalBlock(scope: !808, file: !514, line: 736, column: 9)
!827 = !DISubprogram(name: "pysqlite_connection_create_function", scope: !514, file: !514, line: 833, type: !691, isLocal: false, isDefinition: true, scopeLine: 834, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pysqlite_Connection*, %struct._object*, %struct._object*)* @pysqlite_connection_create_function, variables: !828)
!828 = !{!829, !830, !831, !832, !833, !834, !835}
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !827, file: !514, line: 833, type: !410)
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !827, file: !514, line: 833, type: !16)
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !827, file: !514, line: 833, type: !16)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !827, file: !514, line: 837, type: !16)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !827, file: !514, line: 838, type: !63)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "narg", scope: !827, file: !514, line: 839, type: !55)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !827, file: !514, line: 840, type: !55)
!836 = !DISubprogram(name: "pysqlite_connection_create_aggregate", scope: !514, file: !514, line: 867, type: !691, isLocal: false, isDefinition: true, scopeLine: 868, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pysqlite_Connection*, %struct._object*, %struct._object*)* @pysqlite_connection_create_aggregate, variables: !837)
!837 = !{!838, !839, !840, !841, !842, !843, !844}
!838 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !836, file: !514, line: 867, type: !410)
!839 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !836, file: !514, line: 867, type: !16)
!840 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !836, file: !514, line: 867, type: !16)
!841 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aggregate_class", scope: !836, file: !514, line: 869, type: !16)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_arg", scope: !836, file: !514, line: 871, type: !55)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !836, file: !514, line: 872, type: !63)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !836, file: !514, line: 874, type: !55)
!845 = !DISubprogram(name: "pysqlite_check_thread", scope: !514, file: !514, line: 1142, type: !718, isLocal: false, isDefinition: true, scopeLine: 1143, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.pysqlite_Connection*)* @pysqlite_check_thread, variables: !846)
!846 = !{!847}
!847 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !845, file: !514, line: 1142, type: !410)
!848 = !DISubprogram(name: "pysqlite_connection_call", scope: !514, file: !514, line: 1232, type: !691, isLocal: false, isDefinition: true, scopeLine: 1233, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pysqlite_Connection*, %struct._object*, %struct._object*)* @pysqlite_connection_call, variables: !849)
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857, !861, !863}
!850 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !848, file: !514, line: 1232, type: !410)
!851 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !848, file: !514, line: 1232, type: !16)
!852 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !848, file: !514, line: 1232, type: !16)
!853 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sql", scope: !848, file: !514, line: 1234, type: !16)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "statement", scope: !848, file: !514, line: 1235, type: !385)
!855 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "weakref", scope: !848, file: !514, line: 1236, type: !16)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !848, file: !514, line: 1237, type: !55)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !858, file: !514, line: 1276, type: !16)
!858 = distinct !DILexicalBlock(scope: !859, file: !514, line: 1276, column: 12)
!859 = distinct !DILexicalBlock(scope: !860, file: !514, line: 1275, column: 56)
!860 = distinct !DILexicalBlock(scope: !848, file: !514, line: 1275, column: 9)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !862, file: !514, line: 1279, type: !16)
!862 = distinct !DILexicalBlock(scope: !848, file: !514, line: 1279, column: 8)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !864, file: !514, line: 1284, type: !16)
!864 = distinct !DILexicalBlock(scope: !848, file: !514, line: 1284, column: 8)
!865 = !DISubprogram(name: "pysqlite_connection_execute", scope: !514, file: !514, line: 1288, type: !691, isLocal: false, isDefinition: true, scopeLine: 1289, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pysqlite_Connection*, %struct._object*, %struct._object*)* @pysqlite_connection_execute, variables: !866)
!866 = !{!867, !868, !869, !870, !871, !872, !873, !877, !881, !885, !889, !891, !894, !896}
!867 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !865, file: !514, line: 1288, type: !410)
!868 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !865, file: !514, line: 1288, type: !16)
!869 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !865, file: !514, line: 1288, type: !16)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cursor", scope: !865, file: !514, line: 1290, type: !16)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !865, file: !514, line: 1291, type: !16)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "method", scope: !865, file: !514, line: 1292, type: !16)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !874, file: !514, line: 1301, type: !16)
!874 = distinct !DILexicalBlock(scope: !875, file: !514, line: 1301, column: 12)
!875 = distinct !DILexicalBlock(scope: !876, file: !514, line: 1300, column: 18)
!876 = distinct !DILexicalBlock(scope: !865, file: !514, line: 1300, column: 9)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !878, file: !514, line: 1301, type: !16)
!878 = distinct !DILexicalBlock(scope: !879, file: !514, line: 1301, column: 111)
!879 = distinct !DILexicalBlock(scope: !880, file: !514, line: 1301, column: 83)
!880 = distinct !DILexicalBlock(scope: !874, file: !514, line: 1301, column: 60)
!881 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !882, file: !514, line: 1307, type: !16)
!882 = distinct !DILexicalBlock(scope: !883, file: !514, line: 1307, column: 12)
!883 = distinct !DILexicalBlock(scope: !884, file: !514, line: 1306, column: 18)
!884 = distinct !DILexicalBlock(scope: !865, file: !514, line: 1306, column: 9)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !886, file: !514, line: 1307, type: !16)
!886 = distinct !DILexicalBlock(scope: !887, file: !514, line: 1307, column: 111)
!887 = distinct !DILexicalBlock(scope: !888, file: !514, line: 1307, column: 83)
!888 = distinct !DILexicalBlock(scope: !882, file: !514, line: 1307, column: 60)
!889 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !890, file: !514, line: 1311, type: !16)
!890 = distinct !DILexicalBlock(scope: !865, file: !514, line: 1311, column: 8)
