; ModuleID = 'irs-onlybc/context.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.mpd_context_t = type { i64, i64, i64, i32, i32, i32, i32, i32, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@mpd_traphandler = hidden global void (%struct.mpd_context_t*)* @mpd_dflt_traphandler, align 8
@mpd_setminalloc.minalloc_is_set = internal global i32 0, align 4
@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [17 x i8] c"%s:%d: warning: \00", align 1
@.str.1 = private unnamed_addr constant [90 x i8] c"/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_decimal/libmpdec/context.c\00", align 1
@.str.2 = private unnamed_addr constant [69 x i8] c"mpd_setminalloc: ignoring request to set MPD_MINALLOC a second time\0A\00", align 1
@.str.3 = private unnamed_addr constant [15 x i8] c"%s:%d: error: \00", align 1
@.str.4 = private unnamed_addr constant [31 x i8] c"illegal value for MPD_MINALLOC\00", align 1
@MPD_MINALLOC = external hidden global i64, align 8

; Function Attrs: nounwind uwtable
define hidden void @mpd_dflt_traphandler(%struct.mpd_context_t* %ctx) #0 {
entry:
  %ctx.addr = alloca %struct.mpd_context_t*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !16, subprograms: !21, globals: !146)
!1 = !DIFile(filename: "context.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 241, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_decimal/libmpdec/mpdecimal.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15}
!6 = !DIEnumerator(name: "MPD_ROUND_UP", value: 0)
!7 = !DIEnumerator(name: "MPD_ROUND_DOWN", value: 1)
!8 = !DIEnumerator(name: "MPD_ROUND_CEILING", value: 2)
!9 = !DIEnumerator(name: "MPD_ROUND_FLOOR", value: 3)
!10 = !DIEnumerator(name: "MPD_ROUND_HALF_UP", value: 4)
!11 = !DIEnumerator(name: "MPD_ROUND_HALF_DOWN", value: 5)
!12 = !DIEnumerator(name: "MPD_ROUND_HALF_EVEN", value: 6)
!13 = !DIEnumerator(name: "MPD_ROUND_05UP", value: 7)
!14 = !DIEnumerator(name: "MPD_ROUND_TRUNC", value: 8)
!15 = !DIEnumerator(name: "MPD_ROUND_GUARD", value: 9)
!16 = !{!17}
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpd_ssize_t", file: !4, line: 157, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !19, line: 197, baseType: !20)
!19 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!20 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!21 = !{!22, !45, !50, !57, !60, !63, !66, !72, !79, !82, !85, !90, !95, !98, !101, !104, !110, !114, !118, !122, !128, !132, !136, !140}
!22 = !DISubprogram(name: "mpd_dflt_traphandler", scope: !23, file: !23, line: 36, type: !24, isLocal: false, isDefinition: true, scopeLine: 37, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.mpd_context_t*)* @mpd_dflt_traphandler, variables: !43)
!23 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_decimal/libmpdec/context.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!24 = !DISubroutineType(types: !25)
!25 = !{null, !26}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpd_context_t", file: !4, line: 270, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "mpd_context_t", file: !4, line: 260, size: 384, align: 64, elements: !29)
!29 = !{!30, !31, !32, !33, !37, !38, !39, !41, !42}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !28, file: !4, line: 261, baseType: !17, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "emax", scope: !28, file: !4, line: 262, baseType: !17, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "emin", scope: !28, file: !4, line: 263, baseType: !17, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "traps", scope: !28, file: !4, line: 264, baseType: !34, size: 32, align: 32, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !35, line: 51, baseType: !36)
!35 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!36 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !28, file: !4, line: 265, baseType: !34, size: 32, align: 32, offset: 224)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "newtrap", scope: !28, file: !4, line: 266, baseType: !34, size: 32, align: 32, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "round", scope: !28, file: !4, line: 267, baseType: !40, size: 32, align: 32, offset: 288)
!40 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "clamp", scope: !28, file: !4, line: 268, baseType: !40, size: 32, align: 32, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "allcr", scope: !28, file: !4, line: 269, baseType: !40, size: 32, align: 32, offset: 352)
!43 = !{!44}
!44 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !22, file: !23, line: 36, type: !26)
!45 = !DISubprogram(name: "mpd_setminalloc", scope: !23, file: !23, line: 49, type: !46, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: true, function: void (i64)* @mpd_setminalloc, variables: !48)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !17}
!48 = !{!49}
!49 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !45, file: !23, line: 49, type: !17)
!50 = !DISubprogram(name: "mpd_init", scope: !23, file: !23, line: 66, type: !51, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.mpd_context_t*, i64)* @mpd_init, variables: !53)
!51 = !DISubroutineType(types: !52)
!52 = !{null, !26, !17}
!53 = !{!54, !55, !56}
!54 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !50, file: !23, line: 66, type: !26)
!55 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "prec", arg: 2, scope: !50, file: !23, line: 66, type: !17)
!56 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ideal_minalloc", scope: !50, file: !23, line: 68, type: !17)
!57 = !DISubprogram(name: "mpd_maxcontext", scope: !23, file: !23, line: 85, type: !24, isLocal: false, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.mpd_context_t*)* @mpd_maxcontext, variables: !58)
!58 = !{!59}
!59 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !57, file: !23, line: 85, type: !26)
!60 = !DISubprogram(name: "mpd_defaultcontext", scope: !23, file: !23, line: 99, type: !24, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.mpd_context_t*)* @mpd_defaultcontext, variables: !61)
!61 = !{!62}
!62 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !60, file: !23, line: 99, type: !26)
!63 = !DISubprogram(name: "mpd_basiccontext", scope: !23, file: !23, line: 113, type: !24, isLocal: false, isDefinition: true, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.mpd_context_t*)* @mpd_basiccontext, variables: !64)
!64 = !{!65}
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !63, file: !23, line: 113, type: !26)
!66 = !DISubprogram(name: "mpd_ieee_context", scope: !23, file: !23, line: 127, type: !67, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.mpd_context_t*, i32)* @mpd_ieee_context, variables: !69)
!67 = !DISubroutineType(types: !68)
!68 = !{!40, !26, !40}
!69 = !{!70, !71}
!70 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !66, file: !23, line: 127, type: !26)
!71 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bits", arg: 2, scope: !66, file: !23, line: 127, type: !40)
!72 = !DISubprogram(name: "mpd_getprec", scope: !23, file: !23, line: 147, type: !73, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.mpd_context_t*)* @mpd_getprec, variables: !77)
!73 = !DISubroutineType(types: !74)
!74 = !{!17, !75}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!77 = !{!78}
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !72, file: !23, line: 147, type: !75)
!79 = !DISubprogram(name: "mpd_getemax", scope: !23, file: !23, line: 153, type: !73, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.mpd_context_t*)* @mpd_getemax, variables: !80)
!80 = !{!81}
