; ModuleID = 'irs-onlybc/cursor.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Py_Identifier = type { %struct._Py_Identifier*, i8*, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !13, subprograms: !383, globals: !976)
!1 = !DIFile(filename: "cursor.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 54, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Modules/_sqlite/cursor.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10, !11, !12}
!6 = !DIEnumerator(name: "STATEMENT_INVALID", value: 0)
!7 = !DIEnumerator(name: "STATEMENT_INSERT", value: 1)
!8 = !DIEnumerator(name: "STATEMENT_DELETE", value: 2)
!9 = !DIEnumerator(name: "STATEMENT_UPDATE", value: 3)
!10 = !DIEnumerator(name: "STATEMENT_REPLACE", value: 4)
!11 = !DIEnumerator(name: "STATEMENT_SELECT", value: 5)
!12 = !DIEnumerator(name: "STATEMENT_OTHER", value: 6)
!13 = !{!14, !38, !99, !360, !26, !40, !378, !104, !379, !381}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !16, line: 109, baseType: !17)
!16 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !16, line: 105, size: 128, align: 64, elements: !18)
!18 = !{!19, !27}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !17, file: !16, line: 107, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !21, line: 177, baseType: !22)
!21 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !23, line: 102, baseType: !24)
!23 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !25, line: 181, baseType: !26)
!25 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!26 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !17, file: !16, line: 108, baseType: !28, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !16, line: 334, size: 3200, align: 64, elements: !30)
!30 = !{!31, !37, !41, !42, !43, !48, !112, !117, !122, !123, !128, !180, !211, !223, !229, !230, !231, !233, !235, !266, !267, !268, !277, !278, !283, !284, !286, !288, !298, !308, !326, !327, !328, !330, !332, !333, !335, !340, !345, !350, !351, !352, !353, !354, !355, !356, !357, !359}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !29, file: !16, line: 335, baseType: !32, size: 192, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !16, line: 114, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 111, size: 192, align: 64, elements: !34)
!34 = !{!35, !36}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !33, file: !16, line: 112, baseType: !15, size: 128, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !33, file: !16, line: 113, baseType: !20, size: 64, align: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !29, file: !16, line: 336, baseType: !38, size: 64, align: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !29, file: !16, line: 337, baseType: !20, size: 64, align: 64, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !29, file: !16, line: 337, baseType: !20, size: 64, align: 64, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !29, file: !16, line: 341, baseType: !44, size: 64, align: 64, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !16, line: 308, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{null, !14}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !29, file: !16, line: 342, baseType: !49, size: 64, align: 64, offset: 448)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !16, line: 314, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !14, !54, !53}
!53 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !23, line: 48, baseType: !56)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !57, line: 246, size: 1728, align: 64, elements: !58)
!57 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!58 = !{!59, !60, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !80, !81, !82, !83, !85, !87, !89, !93, !96, !98, !100, !101, !102, !103, !107, !108}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !56, file: !57, line: 247, baseType: !53, size: 32, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !56, file: !57, line: 252, baseType: !61, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !56, file: !57, line: 253, baseType: !61, size: 64, align: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !56, file: !57, line: 254, baseType: !61, size: 64, align: 64, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !56, file: !57, line: 255, baseType: !61, size: 64, align: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !56, file: !57, line: 256, baseType: !61, size: 64, align: 64, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !56, file: !57, line: 257, baseType: !61, size: 64, align: 64, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !56, file: !57, line: 258, baseType: !61, size: 64, align: 64, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !56, file: !57, line: 259, baseType: !61, size: 64, align: 64, offset: 512)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !56, file: !57, line: 261, baseType: !61, size: 64, align: 64, offset: 576)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !56, file: !57, line: 262, baseType: !61, size: 64, align: 64, offset: 640)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !56, file: !57, line: 263, baseType: !61, size: 64, align: 64, offset: 704)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !56, file: !57, line: 265, baseType: !73, size: 64, align: 64, offset: 768)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !57, line: 161, size: 192, align: 64, elements: !75)
!75 = !{!76, !77, !79}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !74, file: !57, line: 162, baseType: !73, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !74, file: !57, line: 163, baseType: !78, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !74, file: !57, line: 167, baseType: !53, size: 32, align: 32, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !56, file: !57, line: 267, baseType: !78, size: 64, align: 64, offset: 832)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !56, file: !57, line: 269, baseType: !53, size: 32, align: 32, offset: 896)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !56, file: !57, line: 273, baseType: !53, size: 32, align: 32, offset: 928)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !56, file: !57, line: 275, baseType: !84, size: 64, align: 64, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !25, line: 140, baseType: !26)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !56, file: !57, line: 279, baseType: !86, size: 16, align: 16, offset: 1024)
!86 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !56, file: !57, line: 280, baseType: !88, size: 8, align: 8, offset: 1040)
!88 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !56, file: !57, line: 281, baseType: !90, size: 8, align: 8, offset: 1048)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 8, align: 8, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 1)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !56, file: !57, line: 285, baseType: !94, size: 64, align: 64, offset: 1088)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !57, line: 155, baseType: null)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !56, file: !57, line: 294, baseType: !97, size: 64, align: 64, offset: 1152)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !25, line: 141, baseType: !26)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !56, file: !57, line: 303, baseType: !99, size: 64, align: 64, offset: 1216)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !56, file: !57, line: 304, baseType: !99, size: 64, align: 64, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !56, file: !57, line: 305, baseType: !99, size: 64, align: 64, offset: 1344)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !56, file: !57, line: 306, baseType: !99, size: 64, align: 64, offset: 1408)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !56, file: !57, line: 307, baseType: !104, size: 64, align: 64, offset: 1472)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !105, line: 62, baseType: !106)
!105 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!106 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !56, file: !57, line: 309, baseType: !53, size: 32, align: 32, offset: 1536)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !56, file: !57, line: 311, baseType: !109, size: 160, align: 8, offset: 1568)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 160, align: 8, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 20)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !29, file: !16, line: 343, baseType: !113, size: 64, align: 64, offset: 512)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !16, line: 316, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!14, !14, !61}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !29, file: !16, line: 344, baseType: !118, size: 64, align: 64, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !16, line: 318, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!53, !14, !61, !14}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !29, file: !16, line: 345, baseType: !99, size: 64, align: 64, offset: 640)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !29, file: !16, line: 346, baseType: !124, size: 64, align: 64, offset: 704)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !16, line: 320, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!14, !14}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !29, file: !16, line: 350, baseType: !129, size: 64, align: 64, offset: 768)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !16, line: 278, baseType: !131)
!131 = !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 236, size: 2176, align: 64, elements: !132)
!132 = !{!133, !138, !139, !140, !141, !142, !147, !149, !150, !151, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !131, file: !16, line: 241, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !16, line: 166, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!14, !14, !14}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !131, file: !16, line: 242, baseType: !134, size: 64, align: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !131, file: !16, line: 243, baseType: !134, size: 64, align: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !131, file: !16, line: 244, baseType: !134, size: 64, align: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !131, file: !16, line: 245, baseType: !134, size: 64, align: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !131, file: !16, line: 246, baseType: !143, size: 64, align: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !16, line: 167, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!14, !14, !14, !14}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !131, file: !16, line: 247, baseType: !148, size: 64, align: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !16, line: 165, baseType: !125)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !131, file: !16, line: 248, baseType: !148, size: 64, align: 64, offset: 448)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !131, file: !16, line: 249, baseType: !148, size: 64, align: 64, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !131, file: !16, line: 250, baseType: !152, size: 64, align: 64, offset: 576)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !16, line: 168, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!53, !14}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !131, file: !16, line: 251, baseType: !148, size: 64, align: 64, offset: 640)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !131, file: !16, line: 252, baseType: !134, size: 64, align: 64, offset: 704)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !131, file: !16, line: 253, baseType: !134, size: 64, align: 64, offset: 768)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !131, file: !16, line: 254, baseType: !134, size: 64, align: 64, offset: 832)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !131, file: !16, line: 255, baseType: !134, size: 64, align: 64, offset: 896)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !131, file: !16, line: 256, baseType: !134, size: 64, align: 64, offset: 960)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !131, file: !16, line: 257, baseType: !148, size: 64, align: 64, offset: 1024)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !131, file: !16, line: 258, baseType: !99, size: 64, align: 64, offset: 1088)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !131, file: !16, line: 259, baseType: !148, size: 64, align: 64, offset: 1152)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !131, file: !16, line: 261, baseType: !134, size: 64, align: 64, offset: 1216)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !131, file: !16, line: 262, baseType: !134, size: 64, align: 64, offset: 1280)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !131, file: !16, line: 263, baseType: !134, size: 64, align: 64, offset: 1344)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !131, file: !16, line: 264, baseType: !134, size: 64, align: 64, offset: 1408)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !131, file: !16, line: 265, baseType: !143, size: 64, align: 64, offset: 1472)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !131, file: !16, line: 266, baseType: !134, size: 64, align: 64, offset: 1536)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !131, file: !16, line: 267, baseType: !134, size: 64, align: 64, offset: 1600)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !131, file: !16, line: 268, baseType: !134, size: 64, align: 64, offset: 1664)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !131, file: !16, line: 269, baseType: !134, size: 64, align: 64, offset: 1728)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !131, file: !16, line: 270, baseType: !134, size: 64, align: 64, offset: 1792)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !131, file: !16, line: 272, baseType: !134, size: 64, align: 64, offset: 1856)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !131, file: !16, line: 273, baseType: !134, size: 64, align: 64, offset: 1920)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !131, file: !16, line: 274, baseType: !134, size: 64, align: 64, offset: 1984)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !131, file: !16, line: 275, baseType: !134, size: 64, align: 64, offset: 2048)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !131, file: !16, line: 277, baseType: !148, size: 64, align: 64, offset: 2112)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !29, file: !16, line: 351, baseType: !181, size: 64, align: 64, offset: 832)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !16, line: 292, baseType: !183)
!183 = !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 280, size: 640, align: 64, elements: !184)
!184 = !{!185, !190, !191, !196, !197, !198, !203, !204, !209, !210}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !183, file: !16, line: 281, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !16, line: 169, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64, align: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!20, !14}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !183, file: !16, line: 282, baseType: !134, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !183, file: !16, line: 283, baseType: !192, size: 64, align: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !16, line: 170, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!14, !14, !20}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !183, file: !16, line: 284, baseType: !192, size: 64, align: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !183, file: !16, line: 285, baseType: !99, size: 64, align: 64, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !183, file: !16, line: 286, baseType: !199, size: 64, align: 64, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !16, line: 172, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64, align: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!53, !14, !20, !14}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !183, file: !16, line: 287, baseType: !99, size: 64, align: 64, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !183, file: !16, line: 288, baseType: !205, size: 64, align: 64, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !16, line: 231, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!53, !14, !14}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !183, file: !16, line: 290, baseType: !134, size: 64, align: 64, offset: 512)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !183, file: !16, line: 291, baseType: !192, size: 64, align: 64, offset: 576)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !29, file: !16, line: 352, baseType: !212, size: 64, align: 64, offset: 896)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !16, line: 298, baseType: !214)
!214 = !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 294, size: 192, align: 64, elements: !215)
!215 = !{!216, !217, !218}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !214, file: !16, line: 295, baseType: !186, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !214, file: !16, line: 296, baseType: !134, size: 64, align: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !214, file: !16, line: 297, baseType: !219, size: 64, align: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !16, line: 174, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!53, !14, !14, !14}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !29, file: !16, line: 356, baseType: !224, size: 64, align: 64, offset: 960)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !16, line: 321, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!228, !14}
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !21, line: 186, baseType: !20)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !29, file: !16, line: 357, baseType: !143, size: 64, align: 64, offset: 1024)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !29, file: !16, line: 358, baseType: !124, size: 64, align: 64, offset: 1088)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !29, file: !16, line: 359, baseType: !232, size: 64, align: 64, offset: 1152)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !16, line: 317, baseType: !135)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !29, file: !16, line: 360, baseType: !234, size: 64, align: 64, offset: 1216)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !16, line: 319, baseType: !220)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !29, file: !16, line: 363, baseType: !236, size: 64, align: 64, offset: 1280)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !16, line: 304, baseType: !238)
!238 = !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 301, size: 128, align: 64, elements: !239)
!239 = !{!240, !261}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !238, file: !16, line: 302, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !16, line: 193, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!53, !14, !245, !53}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !16, line: 191, baseType: !247)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !16, line: 178, size: 640, align: 64, elements: !248)
!248 = !{!249, !250, !251, !252, !253, !254, !255, !256, !258, !259, !260}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !247, file: !16, line: 179, baseType: !99, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !247, file: !16, line: 180, baseType: !14, size: 64, align: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !247, file: !16, line: 181, baseType: !20, size: 64, align: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !247, file: !16, line: 182, baseType: !20, size: 64, align: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !247, file: !16, line: 184, baseType: !53, size: 32, align: 32, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !247, file: !16, line: 185, baseType: !53, size: 32, align: 32, offset: 288)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !247, file: !16, line: 186, baseType: !61, size: 64, align: 64, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !247, file: !16, line: 187, baseType: !257, size: 64, align: 64, offset: 384)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !247, file: !16, line: 188, baseType: !257, size: 64, align: 64, offset: 448)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !247, file: !16, line: 189, baseType: !257, size: 64, align: 64, offset: 512)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !247, file: !16, line: 190, baseType: !99, size: 64, align: 64, offset: 576)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !238, file: !16, line: 303, baseType: !262, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !16, line: 194, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !14, !245}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !29, file: !16, line: 366, baseType: !106, size: 64, align: 64, offset: 1344)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !29, file: !16, line: 368, baseType: !38, size: 64, align: 64, offset: 1408)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !29, file: !16, line: 372, baseType: !269, size: 64, align: 64, offset: 1472)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !16, line: 233, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!53, !14, !273, !99}
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !16, line: 232, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!53, !14, !99}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !29, file: !16, line: 375, baseType: !152, size: 64, align: 64, offset: 1536)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !29, file: !16, line: 379, baseType: !279, size: 64, align: 64, offset: 1600)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !16, line: 322, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64, align: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{!14, !14, !14, !53}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !29, file: !16, line: 382, baseType: !20, size: 64, align: 64, offset: 1664)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !29, file: !16, line: 385, baseType: !285, size: 64, align: 64, offset: 1728)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !16, line: 323, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !29, file: !16, line: 386, baseType: !287, size: 64, align: 64, offset: 1792)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !16, line: 324, baseType: !125)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !29, file: !16, line: 389, baseType: !289, size: 64, align: 64, offset: 1856)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !291, line: 40, size: 256, align: 64, elements: !292)
!291 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!292 = !{!293, !294, !296, !297}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !290, file: !291, line: 41, baseType: !38, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !290, file: !291, line: 42, baseType: !295, size: 64, align: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !291, line: 18, baseType: !135)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !290, file: !291, line: 43, baseType: !53, size: 32, align: 32, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !290, file: !291, line: 45, baseType: !38, size: 64, align: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !29, file: !16, line: 390, baseType: !299, size: 64, align: 64, offset: 1920)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !301, line: 18, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "./Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!302 = !{!303, !304, !305, !306, !307}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 19, baseType: !61, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !300, file: !301, line: 20, baseType: !53, size: 32, align: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !300, file: !301, line: 21, baseType: !20, size: 64, align: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !300, file: !301, line: 22, baseType: !53, size: 32, align: 32, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 23, baseType: !61, size: 64, align: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !29, file: !16, line: 391, baseType: !309, size: 64, align: 64, offset: 1984)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !311, line: 11, size: 320, align: 64, elements: !312)
!311 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!312 = !{!313, !314, !319, !324, !325}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !310, file: !311, line: 12, baseType: !61, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !310, file: !311, line: 13, baseType: !315, size: 64, align: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !311, line: 8, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!14, !14, !99}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !310, file: !311, line: 14, baseType: !320, size: 64, align: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !311, line: 9, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64, align: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!53, !14, !14, !99}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !310, file: !311, line: 15, baseType: !61, size: 64, align: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !310, file: !311, line: 16, baseType: !99, size: 64, align: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !29, file: !16, line: 392, baseType: !28, size: 64, align: 64, offset: 2048)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !29, file: !16, line: 393, baseType: !14, size: 64, align: 64, offset: 2112)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !29, file: !16, line: 394, baseType: !329, size: 64, align: 64, offset: 2176)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !16, line: 325, baseType: !144)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !29, file: !16, line: 395, baseType: !331, size: 64, align: 64, offset: 2240)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !16, line: 326, baseType: !220)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !29, file: !16, line: 396, baseType: !20, size: 64, align: 64, offset: 2304)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !29, file: !16, line: 397, baseType: !334, size: 64, align: 64, offset: 2368)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !16, line: 327, baseType: !220)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !29, file: !16, line: 398, baseType: !336, size: 64, align: 64, offset: 2432)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !16, line: 329, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!14, !28, !20}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !29, file: !16, line: 399, baseType: !341, size: 64, align: 64, offset: 2496)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !16, line: 328, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!14, !28, !14, !14}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !29, file: !16, line: 400, baseType: !346, size: 64, align: 64, offset: 2560)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !16, line: 307, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !99}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !29, file: !16, line: 401, baseType: !152, size: 64, align: 64, offset: 2624)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !29, file: !16, line: 402, baseType: !14, size: 64, align: 64, offset: 2688)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !29, file: !16, line: 403, baseType: !14, size: 64, align: 64, offset: 2752)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !29, file: !16, line: 404, baseType: !14, size: 64, align: 64, offset: 2816)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !29, file: !16, line: 405, baseType: !14, size: 64, align: 64, offset: 2880)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !29, file: !16, line: 406, baseType: !14, size: 64, align: 64, offset: 2944)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !29, file: !16, line: 407, baseType: !44, size: 64, align: 64, offset: 3008)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !29, file: !16, line: 410, baseType: !358, size: 32, align: 32, offset: 3072)
!358 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !29, file: !16, line: 412, baseType: !44, size: 64, align: 64, offset: 3136)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "pysqlite_Statement", file: !362, line: 42, baseType: !363)
!362 = !DIFile(filename: "Modules/_sqlite/statement.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!363 = !DICompositeType(tag: DW_TAG_structure_type, file: !362, line: 34, size: 448, align: 64, elements: !364)
!364 = !{!365, !366, !371, !375, !376, !377}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !363, file: !362, line: 36, baseType: !15, size: 128, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !363, file: !362, line: 37, baseType: !367, size: 64, align: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3", file: !369, line: 228, baseType: !370)
!369 = !DIFile(filename: "/usr/include/sqlite3.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3", file: !369, line: 228, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !363, file: !362, line: 38, baseType: !372, size: 64, align: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite3_stmt", file: !369, line: 2911, baseType: !374)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "sqlite3_stmt", file: !369, line: 2911, flags: DIFlagFwdDecl)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "sql", scope: !363, file: !362, line: 39, baseType: !14, size: 64, align: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "in_use", scope: !363, file: !362, line: 40, baseType: !53, size: 32, align: 32, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "in_weakreflist", scope: !363, file: !362, line: 41, baseType: !14, size: 64, align: 64, offset: 384)
!378 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !378)
!383 = !{!384, !392, !521, !527, !642, !755, !761, !765, !785, !788, !820, !825, !845, !860, !866, !878, !882, !885, !929, !968}
!384 = !DISubprogram(name: "_pysqlite_get_converter", scope: !385, file: !385, line: 140, type: !126, isLocal: false, isDefinition: true, scopeLine: 141, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @_pysqlite_get_converter, variables: !386)
!385 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_sqlite/cursor.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!386 = !{!387, !388, !389, !390}
!387 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !384, file: !385, line: 140, type: !14)
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "upcase_key", scope: !384, file: !385, line: 142, type: !14)
!389 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !384, file: !385, line: 143, type: !14)
!390 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !391, file: !385, line: 152, type: !14)
!391 = distinct !DILexicalBlock(scope: !384, file: !385, line: 152, column: 8)
!392 = !DISubprogram(name: "pysqlite_build_row_cast_map", scope: !385, file: !385, line: 157, type: !393, isLocal: false, isDefinition: true, scopeLine: 158, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.pysqlite_Cursor*)* @pysqlite_build_row_cast_map, variables: !473)
!393 = !DISubroutineType(types: !394)
!394 = !{!53, !395}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "pysqlite_Cursor", file: !4, line: 52, baseType: !397)
!397 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 32, size: 896, align: 64, elements: !398)
!398 = !{!399, !400, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !397, file: !4, line: 34, baseType: !15, size: 128, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "connection", scope: !397, file: !4, line: 35, baseType: !401, size: 64, align: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "pysqlite_Connection", file: !403, line: 112, baseType: !404)
!403 = !DIFile(filename: "Modules/_sqlite/connection.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!404 = !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 35, size: 1792, align: 64, elements: !405)
!405 = !{!406, !407, !408, !409, !410, !412, !413, !414, !415, !416, !417, !418, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !404, file: !403, line: 37, baseType: !15, size: 128, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "db", scope: !404, file: !403, line: 38, baseType: !367, size: 64, align: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "inTransaction", scope: !404, file: !403, line: 42, baseType: !40, size: 8, align: 8, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "detect_types", scope: !404, file: !403, line: 46, baseType: !53, size: 32, align: 32, offset: 224)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !404, file: !403, line: 49, baseType: !411, size: 64, align: 64, offset: 256)
!411 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_started", scope: !404, file: !403, line: 53, baseType: !411, size: 64, align: 64, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "isolation_level", scope: !404, file: !403, line: 56, baseType: !14, size: 64, align: 64, offset: 384)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "begin_statement", scope: !404, file: !403, line: 60, baseType: !61, size: 64, align: 64, offset: 448)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "check_same_thread", scope: !404, file: !403, line: 64, baseType: !53, size: 32, align: 32, offset: 512)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !404, file: !403, line: 66, baseType: !53, size: 32, align: 32, offset: 544)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ident", scope: !404, file: !403, line: 69, baseType: !26, size: 64, align: 64, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "statement_cache", scope: !404, file: !403, line: 71, baseType: !419, size: 64, align: 64, offset: 640)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "pysqlite_Cache", file: !421, line: 59, baseType: !422)
!421 = !DIFile(filename: "Modules/_sqlite/cache.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!422 = !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 42, size: 512, align: 64, elements: !423)
!423 = !{!424, !425, !426, !427, !428, !440, !441}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !422, file: !421, line: 44, baseType: !15, size: 128, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !422, file: !421, line: 45, baseType: !53, size: 32, align: 32, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !422, file: !421, line: 48, baseType: !14, size: 64, align: 64, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "factory", scope: !422, file: !421, line: 51, baseType: !14, size: 64, align: 64, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !422, file: !421, line: 53, baseType: !429, size: 64, align: 64, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "pysqlite_Node", file: !421, line: 40, baseType: !431)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "_pysqlite_Node", file: !421, line: 32, size: 448, align: 64, elements: !432)
!432 = !{!433, !434, !435, !436, !437, !439}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !431, file: !421, line: 34, baseType: !15, size: 128, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !431, file: !421, line: 35, baseType: !14, size: 64, align: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !431, file: !421, line: 36, baseType: !14, size: 64, align: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !431, file: !421, line: 37, baseType: !26, size: 64, align: 64, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !431, file: !421, line: 38, baseType: !438, size: 64, align: 64, offset: 320)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !431, file: !421, line: 39, baseType: !438, size: 64, align: 64, offset: 384)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !422, file: !421, line: 54, baseType: !429, size: 64, align: 64, offset: 384)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "decref_factory", scope: !422, file: !421, line: 58, baseType: !53, size: 32, align: 32, offset: 448)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "statements", scope: !404, file: !403, line: 74, baseType: !14, size: 64, align: 64, offset: 704)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "cursors", scope: !404, file: !403, line: 75, baseType: !14, size: 64, align: 64, offset: 768)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "created_statements", scope: !404, file: !403, line: 79, baseType: !53, size: 32, align: 32, offset: 832)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "created_cursors", scope: !404, file: !403, line: 80, baseType: !53, size: 32, align: 32, offset: 864)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "row_factory", scope: !404, file: !403, line: 82, baseType: !14, size: 64, align: 64, offset: 896)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "text_factory", scope: !404, file: !403, line: 90, baseType: !14, size: 64, align: 64, offset: 960)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "function_pinboard", scope: !404, file: !403, line: 96, baseType: !14, size: 64, align: 64, offset: 1024)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "collations", scope: !404, file: !403, line: 99, baseType: !14, size: 64, align: 64, offset: 1088)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "Warning", scope: !404, file: !403, line: 102, baseType: !14, size: 64, align: 64, offset: 1152)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "Error", scope: !404, file: !403, line: 103, baseType: !14, size: 64, align: 64, offset: 1216)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "InterfaceError", scope: !404, file: !403, line: 104, baseType: !14, size: 64, align: 64, offset: 1280)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "DatabaseError", scope: !404, file: !403, line: 105, baseType: !14, size: 64, align: 64, offset: 1344)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "DataError", scope: !404, file: !403, line: 106, baseType: !14, size: 64, align: 64, offset: 1408)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "OperationalError", scope: !404, file: !403, line: 107, baseType: !14, size: 64, align: 64, offset: 1472)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "IntegrityError", scope: !404, file: !403, line: 108, baseType: !14, size: 64, align: 64, offset: 1536)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "InternalError", scope: !404, file: !403, line: 109, baseType: !14, size: 64, align: 64, offset: 1600)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ProgrammingError", scope: !404, file: !403, line: 110, baseType: !14, size: 64, align: 64, offset: 1664)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "NotSupportedError", scope: !404, file: !403, line: 111, baseType: !14, size: 64, align: 64, offset: 1728)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !397, file: !4, line: 36, baseType: !14, size: 64, align: 64, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "row_cast_map", scope: !397, file: !4, line: 37, baseType: !14, size: 64, align: 64, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "arraysize", scope: !397, file: !4, line: 38, baseType: !53, size: 32, align: 32, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "lastrowid", scope: !397, file: !4, line: 39, baseType: !14, size: 64, align: 64, offset: 384)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rowcount", scope: !397, file: !4, line: 40, baseType: !26, size: 64, align: 64, offset: 448)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "row_factory", scope: !397, file: !4, line: 41, baseType: !14, size: 64, align: 64, offset: 512)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "statement", scope: !397, file: !4, line: 42, baseType: !360, size: 64, align: 64, offset: 576)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "closed", scope: !397, file: !4, line: 43, baseType: !53, size: 32, align: 32, offset: 640)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !397, file: !4, line: 44, baseType: !53, size: 32, align: 32, offset: 672)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !397, file: !4, line: 45, baseType: !53, size: 32, align: 32, offset: 704)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !397, file: !4, line: 46, baseType: !53, size: 32, align: 32, offset: 736)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "next_row", scope: !397, file: !4, line: 49, baseType: !14, size: 64, align: 64, offset: 768)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "in_weakreflist", scope: !397, file: !4, line: 51, baseType: !14, size: 64, align: 64, offset: 832)
!473 = !{!474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !485, !488, !503, !509, !515, !517}
!474 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !392, file: !385, line: 157, type: !395)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !392, file: !385, line: 159, type: !53)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type_start", scope: !392, file: !385, line: 160, type: !38)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !392, file: !385, line: 161, type: !38)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colname", scope: !392, file: !385, line: 163, type: !38)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decltype", scope: !392, file: !385, line: 164, type: !38)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "py_decltype", scope: !392, file: !385, line: 165, type: !14)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "converter", scope: !392, file: !385, line: 166, type: !14)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !392, file: !385, line: 167, type: !14)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !484, file: !385, line: 173, type: !14)
!484 = distinct !DILexicalBlock(scope: !392, file: !385, line: 173, column: 8)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !486, file: !385, line: 173, type: !14)
!486 = distinct !DILexicalBlock(scope: !487, file: !385, line: 173, column: 110)
!487 = distinct !DILexicalBlock(scope: !484, file: !385, line: 173, column: 76)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !489, file: !385, line: 195, type: !14)
!489 = distinct !DILexicalBlock(scope: !490, file: !385, line: 195, column: 28)
!490 = distinct !DILexicalBlock(scope: !491, file: !385, line: 185, column: 78)
!491 = distinct !DILexicalBlock(scope: !492, file: !385, line: 185, column: 32)
!492 = distinct !DILexicalBlock(scope: !493, file: !385, line: 183, column: 25)
!493 = distinct !DILexicalBlock(scope: !494, file: !385, line: 182, column: 55)
!494 = distinct !DILexicalBlock(scope: !495, file: !385, line: 182, column: 17)
!495 = distinct !DILexicalBlock(scope: !496, file: !385, line: 182, column: 17)
!496 = distinct !DILexicalBlock(scope: !497, file: !385, line: 181, column: 26)
!497 = distinct !DILexicalBlock(scope: !498, file: !385, line: 181, column: 17)
!498 = distinct !DILexicalBlock(scope: !499, file: !385, line: 179, column: 49)
!499 = distinct !DILexicalBlock(scope: !500, file: !385, line: 179, column: 13)
!500 = distinct !DILexicalBlock(scope: !501, file: !385, line: 176, column: 69)
!501 = distinct !DILexicalBlock(scope: !502, file: !385, line: 176, column: 5)
!502 = distinct !DILexicalBlock(scope: !392, file: !385, line: 176, column: 5)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !504, file: !385, line: 220, type: !14)
!504 = distinct !DILexicalBlock(scope: !505, file: !385, line: 220, column: 20)
!505 = distinct !DILexicalBlock(scope: !506, file: !385, line: 204, column: 27)
!506 = distinct !DILexicalBlock(scope: !507, file: !385, line: 204, column: 17)
!507 = distinct !DILexicalBlock(scope: !508, file: !385, line: 202, column: 63)
!508 = distinct !DILexicalBlock(scope: !500, file: !385, line: 202, column: 13)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !510, file: !385, line: 230, type: !14)
!510 = distinct !DILexicalBlock(scope: !511, file: !385, line: 230, column: 20)
!511 = distinct !DILexicalBlock(scope: !512, file: !385, line: 229, column: 49)
!512 = distinct !DILexicalBlock(scope: !513, file: !385, line: 229, column: 17)
!513 = distinct !DILexicalBlock(scope: !514, file: !385, line: 228, column: 64)
!514 = distinct !DILexicalBlock(scope: !500, file: !385, line: 228, column: 13)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !516, file: !385, line: 232, type: !14)
!516 = distinct !DILexicalBlock(scope: !513, file: !385, line: 232, column: 16)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !518, file: !385, line: 232, type: !14)
!518 = distinct !DILexicalBlock(scope: !519, file: !385, line: 232, column: 139)
!519 = distinct !DILexicalBlock(scope: !520, file: !385, line: 232, column: 99)
!520 = distinct !DILexicalBlock(scope: !516, file: !385, line: 232, column: 76)
!521 = !DISubprogram(name: "_pysqlite_build_column_name", scope: !385, file: !385, line: 241, type: !522, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @_pysqlite_build_column_name, variables: !524)
!522 = !DISubroutineType(types: !523)
!523 = !{!14, !38}
!524 = !{!525, !526}
!525 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "colname", arg: 1, scope: !521, file: !385, line: 241, type: !38)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !521, file: !385, line: 243, type: !38)
!527 = !DISubprogram(name: "_pysqlite_fetch_one_row", scope: !385, file: !385, line: 266, type: !528, isLocal: false, isDefinition: true, scopeLine: 267, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pysqlite_Cursor*)* @_pysqlite_fetch_one_row, variables: !530)
!528 = !DISubroutineType(types: !529)
!529 = !{!14, !395}
!530 = !{!531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !546, !547, !548, !549, !609, !618, !621, !636, !638}
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !527, file: !385, line: 266, type: !395)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !527, file: !385, line: 268, type: !53)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numcols", scope: !527, file: !385, line: 268, type: !53)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "row", scope: !527, file: !385, line: 269, type: !14)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !527, file: !385, line: 270, type: !14)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coltype", scope: !527, file: !385, line: 271, type: !53)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "converter", scope: !527, file: !385, line: 272, type: !14)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "converted", scope: !527, file: !385, line: 273, type: !14)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes", scope: !527, file: !385, line: 274, type: !20)
!540 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !527, file: !385, line: 275, type: !14)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val_str", scope: !527, file: !385, line: 276, type: !38)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !527, file: !385, line: 277, type: !543)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1600, align: 8, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 200)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "colname", scope: !527, file: !385, line: 278, type: !38)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf_bytes", scope: !527, file: !385, line: 279, type: !14)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error_obj", scope: !527, file: !385, line: 280, type: !14)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !550, file: !385, line: 287, type: !551)
!550 = distinct !DILexicalBlock(scope: !527, file: !385, line: 287, column: 5)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !553, line: 139, baseType: !554)
!553 = !DIFile(filename: "./Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !553, line: 69, size: 1536, align: 64, elements: !555)
!555 = !{!556, !558, !559, !579, !582, !583, !584, !585, !586, !587, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !554, file: !553, line: 72, baseType: !557, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !554, file: !553, line: 73, baseType: !557, size: 64, align: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !554, file: !553, line: 74, baseType: !560, size: 64, align: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64, align: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !553, line: 44, baseType: !562)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !553, line: 19, size: 832, align: 64, elements: !563)
!563 = !{!564, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !562, file: !553, line: 21, baseType: !565, size: 64, align: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !562, file: !553, line: 22, baseType: !557, size: 64, align: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !562, file: !553, line: 24, baseType: !14, size: 64, align: 64, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !562, file: !553, line: 25, baseType: !14, size: 64, align: 64, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !562, file: !553, line: 26, baseType: !14, size: 64, align: 64, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !562, file: !553, line: 27, baseType: !14, size: 64, align: 64, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !562, file: !553, line: 28, baseType: !14, size: 64, align: 64, offset: 384)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !562, file: !553, line: 30, baseType: !14, size: 64, align: 64, offset: 448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !562, file: !553, line: 31, baseType: !14, size: 64, align: 64, offset: 512)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !562, file: !553, line: 32, baseType: !14, size: 64, align: 64, offset: 576)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !562, file: !553, line: 33, baseType: !53, size: 32, align: 32, offset: 640)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !562, file: !553, line: 34, baseType: !53, size: 32, align: 32, offset: 672)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !562, file: !553, line: 37, baseType: !53, size: 32, align: 32, offset: 704)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !562, file: !553, line: 43, baseType: !14, size: 64, align: 64, offset: 768)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !554, file: !553, line: 76, baseType: !580, size: 64, align: 64, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64, align: 64)
!581 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !553, line: 50, flags: DIFlagFwdDecl)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !554, file: !553, line: 77, baseType: !53, size: 32, align: 32, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !554, file: !553, line: 78, baseType: !40, size: 8, align: 8, offset: 288)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !554, file: !553, line: 80, baseType: !40, size: 8, align: 8, offset: 296)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !554, file: !553, line: 85, baseType: !53, size: 32, align: 32, offset: 320)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !554, file: !553, line: 86, baseType: !53, size: 32, align: 32, offset: 352)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !554, file: !553, line: 88, baseType: !588, size: 64, align: 64, offset: 384)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !553, line: 54, baseType: !589)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64, align: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!53, !14, !580, !53, !14}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !554, file: !553, line: 89, baseType: !588, size: 64, align: 64, offset: 448)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !554, file: !553, line: 90, baseType: !14, size: 64, align: 64, offset: 512)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !554, file: !553, line: 91, baseType: !14, size: 64, align: 64, offset: 576)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !554, file: !553, line: 93, baseType: !14, size: 64, align: 64, offset: 640)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !554, file: !553, line: 94, baseType: !14, size: 64, align: 64, offset: 704)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !554, file: !553, line: 95, baseType: !14, size: 64, align: 64, offset: 768)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !554, file: !553, line: 97, baseType: !14, size: 64, align: 64, offset: 832)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !554, file: !553, line: 98, baseType: !14, size: 64, align: 64, offset: 896)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !554, file: !553, line: 99, baseType: !14, size: 64, align: 64, offset: 960)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !554, file: !553, line: 101, baseType: !14, size: 64, align: 64, offset: 1024)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !554, file: !553, line: 103, baseType: !53, size: 32, align: 32, offset: 1088)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !554, file: !553, line: 105, baseType: !14, size: 64, align: 64, offset: 1152)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !554, file: !553, line: 106, baseType: !26, size: 64, align: 64, offset: 1216)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !554, file: !553, line: 108, baseType: !53, size: 32, align: 32, offset: 1280)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !554, file: !553, line: 109, baseType: !14, size: 64, align: 64, offset: 1344)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !554, file: !553, line: 134, baseType: !347, size: 64, align: 64, offset: 1408)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !554, file: !553, line: 135, baseType: !99, size: 64, align: 64, offset: 1472)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !610, file: !385, line: 318, type: !14)
!610 = distinct !DILexicalBlock(scope: !611, file: !385, line: 318, column: 20)
!611 = distinct !DILexicalBlock(scope: !612, file: !385, line: 312, column: 20)
!612 = distinct !DILexicalBlock(scope: !613, file: !385, line: 309, column: 17)
!613 = distinct !DILexicalBlock(scope: !614, file: !385, line: 306, column: 45)
!614 = distinct !DILexicalBlock(scope: !615, file: !385, line: 306, column: 13)
!615 = distinct !DILexicalBlock(scope: !616, file: !385, line: 296, column: 35)
!616 = distinct !DILexicalBlock(scope: !617, file: !385, line: 296, column: 5)
!617 = distinct !DILexicalBlock(scope: !527, file: !385, line: 296, column: 5)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !619, file: !385, line: 324, type: !551)
!619 = distinct !DILexicalBlock(scope: !620, file: !385, line: 324, column: 13)
!620 = distinct !DILexicalBlock(scope: !614, file: !385, line: 323, column: 16)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !622, file: !385, line: 360, type: !14)
!622 = distinct !DILexicalBlock(scope: !623, file: !385, line: 360, column: 36)
!623 = distinct !DILexicalBlock(scope: !624, file: !385, line: 358, column: 36)
!624 = distinct !DILexicalBlock(scope: !625, file: !385, line: 356, column: 33)
!625 = distinct !DILexicalBlock(scope: !626, file: !385, line: 354, column: 32)
!626 = distinct !DILexicalBlock(scope: !627, file: !385, line: 352, column: 29)
!627 = distinct !DILexicalBlock(scope: !628, file: !385, line: 339, column: 37)
!628 = distinct !DILexicalBlock(scope: !629, file: !385, line: 339, column: 25)
!629 = distinct !DILexicalBlock(scope: !630, file: !385, line: 337, column: 83)
!630 = distinct !DILexicalBlock(scope: !631, file: !385, line: 337, column: 21)
!631 = distinct !DILexicalBlock(scope: !632, file: !385, line: 334, column: 38)
!632 = distinct !DILexicalBlock(scope: !633, file: !385, line: 334, column: 24)
!633 = distinct !DILexicalBlock(scope: !634, file: !385, line: 332, column: 24)
!634 = distinct !DILexicalBlock(scope: !635, file: !385, line: 330, column: 24)
!635 = distinct !DILexicalBlock(scope: !620, file: !385, line: 327, column: 17)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !637, file: !385, line: 362, type: !14)
!637 = distinct !DILexicalBlock(scope: !625, file: !385, line: 362, column: 32)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !639, file: !385, line: 393, type: !14)
!639 = distinct !DILexicalBlock(scope: !640, file: !385, line: 393, column: 12)
!640 = distinct !DILexicalBlock(scope: !641, file: !385, line: 392, column: 27)
!641 = distinct !DILexicalBlock(scope: !527, file: !385, line: 392, column: 9)
!642 = !DISubprogram(name: "_pysqlite_query_execute", scope: !385, file: !385, line: 425, type: !643, isLocal: false, isDefinition: true, scopeLine: 426, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pysqlite_Cursor*, i32, %struct._object*)* @_pysqlite_query_execute, variables: !645)
!643 = !DISubroutineType(types: !644)
!644 = !{!14, !395, !53, !14}
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !665, !669, !675, !677, !679, !683, !685, !689, !693, !697, !704, !708, !715, !717, !722, !726, !728, !733, !735, !737, !740, !742, !745, !747, !750, !752}
!646 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !642, file: !385, line: 425, type: !395)
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "multiple", arg: 2, scope: !642, file: !385, line: 425, type: !53)
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 3, scope: !642, file: !385, line: 425, type: !14)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "operation", scope: !642, file: !385, line: 427, type: !14)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "operation_cstr", scope: !642, file: !385, line: 428, type: !38)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "operation_len", scope: !642, file: !385, line: 429, type: !20)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "parameters_list", scope: !642, file: !385, line: 430, type: !14)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "parameters_iter", scope: !642, file: !385, line: 431, type: !14)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "parameters", scope: !642, file: !385, line: 432, type: !14)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !642, file: !385, line: 433, type: !53)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !642, file: !385, line: 434, type: !53)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func_args", scope: !642, file: !385, line: 435, type: !14)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !642, file: !385, line: 436, type: !14)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numcols", scope: !642, file: !385, line: 437, type: !53)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "statement_type", scope: !642, file: !385, line: 438, type: !53)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "descriptor", scope: !642, file: !385, line: 439, type: !14)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "second_argument", scope: !642, file: !385, line: 440, type: !14)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !664, file: !385, line: 449, type: !14)
!664 = distinct !DILexicalBlock(scope: !642, file: !385, line: 449, column: 8)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !666, file: !385, line: 449, type: !14)
!666 = distinct !DILexicalBlock(scope: !667, file: !385, line: 449, column: 123)
!667 = distinct !DILexicalBlock(scope: !668, file: !385, line: 449, column: 87)
!668 = distinct !DILexicalBlock(scope: !664, file: !385, line: 449, column: 64)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !670, file: !385, line: 498, type: !14)
!670 = distinct !DILexicalBlock(scope: !671, file: !385, line: 498, column: 16)
!671 = distinct !DILexicalBlock(scope: !672, file: !385, line: 497, column: 67)
!672 = distinct !DILexicalBlock(scope: !673, file: !385, line: 497, column: 13)
!673 = distinct !DILexicalBlock(scope: !674, file: !385, line: 473, column: 12)
!674 = distinct !DILexicalBlock(scope: !642, file: !385, line: 451, column: 9)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !676, file: !385, line: 501, type: !14)
!676 = distinct !DILexicalBlock(scope: !673, file: !385, line: 501, column: 12)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !678, file: !385, line: 519, type: !14)
!678 = distinct !DILexicalBlock(scope: !642, file: !385, line: 519, column: 8)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !680, file: !385, line: 535, type: !14)
!680 = distinct !DILexicalBlock(scope: !681, file: !385, line: 535, column: 12)
!681 = distinct !DILexicalBlock(scope: !682, file: !385, line: 533, column: 26)
!682 = distinct !DILexicalBlock(scope: !642, file: !385, line: 533, column: 9)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !684, file: !385, line: 539, type: !14)
!684 = distinct !DILexicalBlock(scope: !642, file: !385, line: 539, column: 8)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !686, file: !385, line: 546, type: !14)
!686 = distinct !DILexicalBlock(scope: !687, file: !385, line: 546, column: 12)
!687 = distinct !DILexicalBlock(scope: !688, file: !385, line: 545, column: 34)
!688 = distinct !DILexicalBlock(scope: !642, file: !385, line: 545, column: 9)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !690, file: !385, line: 553, type: !14)
!690 = distinct !DILexicalBlock(scope: !691, file: !385, line: 553, column: 16)
!691 = distinct !DILexicalBlock(scope: !692, file: !385, line: 552, column: 22)
!692 = distinct !DILexicalBlock(scope: !687, file: !385, line: 552, column: 13)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !694, file: !385, line: 553, type: !14)
!694 = distinct !DILexicalBlock(scope: !695, file: !385, line: 553, column: 133)
!695 = distinct !DILexicalBlock(scope: !696, file: !385, line: 553, column: 96)
!696 = distinct !DILexicalBlock(scope: !690, file: !385, line: 553, column: 73)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !698, file: !385, line: 573, type: !14)
!698 = distinct !DILexicalBlock(scope: !699, file: !385, line: 573, column: 24)
!699 = distinct !DILexicalBlock(scope: !700, file: !385, line: 568, column: 55)
!700 = distinct !DILexicalBlock(scope: !701, file: !385, line: 568, column: 21)
!701 = distinct !DILexicalBlock(scope: !702, file: !385, line: 563, column: 33)
!702 = distinct !DILexicalBlock(scope: !703, file: !385, line: 562, column: 44)
!703 = distinct !DILexicalBlock(scope: !642, file: !385, line: 562, column: 9)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !705, file: !385, line: 584, type: !14)
!705 = distinct !DILexicalBlock(scope: !706, file: !385, line: 584, column: 24)
!706 = distinct !DILexicalBlock(scope: !707, file: !385, line: 579, column: 54)
!707 = distinct !DILexicalBlock(scope: !701, file: !385, line: 579, column: 21)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !709, file: !385, line: 655, type: !551)
!709 = distinct !DILexicalBlock(scope: !710, file: !385, line: 655, column: 17)
!710 = distinct !DILexicalBlock(scope: !711, file: !385, line: 654, column: 57)
!711 = distinct !DILexicalBlock(scope: !712, file: !385, line: 654, column: 17)
!712 = distinct !DILexicalBlock(scope: !713, file: !385, line: 653, column: 77)
!713 = distinct !DILexicalBlock(scope: !714, file: !385, line: 653, column: 13)
!714 = distinct !DILexicalBlock(scope: !642, file: !385, line: 598, column: 15)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !716, file: !385, line: 659, type: !14)
!716 = distinct !DILexicalBlock(scope: !710, file: !385, line: 659, column: 20)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !718, file: !385, line: 690, type: !14)
!718 = distinct !DILexicalBlock(scope: !719, file: !385, line: 690, column: 16)
!719 = distinct !DILexicalBlock(scope: !720, file: !385, line: 688, column: 44)
!720 = distinct !DILexicalBlock(scope: !721, file: !385, line: 688, column: 20)
!721 = distinct !DILexicalBlock(scope: !714, file: !385, line: 681, column: 13)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !723, file: !385, line: 690, type: !14)
!723 = distinct !DILexicalBlock(scope: !724, file: !385, line: 690, column: 133)
!724 = distinct !DILexicalBlock(scope: !725, file: !385, line: 690, column: 96)
!725 = distinct !DILexicalBlock(scope: !718, file: !385, line: 690, column: 73)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !727, file: !385, line: 704, type: !14)
!727 = distinct !DILexicalBlock(scope: !714, file: !385, line: 704, column: 12)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lastrowid", scope: !729, file: !385, line: 706, type: !731)
!729 = distinct !DILexicalBlock(scope: !730, file: !385, line: 705, column: 62)
!730 = distinct !DILexicalBlock(scope: !714, file: !385, line: 705, column: 13)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "sqlite_int64", file: !369, line: 253, baseType: !732)
!732 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !734, file: !385, line: 707, type: !551)
!734 = distinct !DILexicalBlock(scope: !729, file: !385, line: 707, column: 13)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !736, file: !385, line: 719, type: !14)
!736 = distinct !DILexicalBlock(scope: !714, file: !385, line: 719, column: 12)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !738, file: !385, line: 719, type: !14)
!738 = distinct !DILexicalBlock(scope: !739, file: !385, line: 719, column: 106)
!739 = distinct !DILexicalBlock(scope: !736, file: !385, line: 719, column: 72)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !741, file: !385, line: 732, type: !14)
!741 = distinct !DILexicalBlock(scope: !642, file: !385, line: 732, column: 8)
!742 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !743, file: !385, line: 732, type: !14)
!743 = distinct !DILexicalBlock(scope: !744, file: !385, line: 732, column: 102)
!744 = distinct !DILexicalBlock(scope: !741, file: !385, line: 732, column: 68)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !746, file: !385, line: 733, type: !14)
!746 = distinct !DILexicalBlock(scope: !642, file: !385, line: 733, column: 8)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !748, file: !385, line: 733, type: !14)
!748 = distinct !DILexicalBlock(scope: !749, file: !385, line: 733, column: 107)
!749 = distinct !DILexicalBlock(scope: !746, file: !385, line: 733, column: 73)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !751, file: !385, line: 734, type: !14)
!751 = distinct !DILexicalBlock(scope: !642, file: !385, line: 734, column: 8)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !753, file: !385, line: 734, type: !14)
!753 = distinct !DILexicalBlock(scope: !754, file: !385, line: 734, column: 107)
!754 = distinct !DILexicalBlock(scope: !751, file: !385, line: 734, column: 73)
!755 = !DISubprogram(name: "pysqlite_cursor_execute", scope: !385, file: !385, line: 747, type: !756, isLocal: false, isDefinition: true, scopeLine: 748, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pysqlite_Cursor*, %struct._object*)* @pysqlite_cursor_execute, variables: !758)
!756 = !DISubroutineType(types: !757)
!757 = !{!14, !395, !14}
!758 = !{!759, !760}
!759 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !755, file: !385, line: 747, type: !395)
!760 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !755, file: !385, line: 747, type: !14)
!761 = !DISubprogram(name: "pysqlite_cursor_executemany", scope: !385, file: !385, line: 752, type: !756, isLocal: false, isDefinition: true, scopeLine: 753, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pysqlite_Cursor*, %struct._object*)* @pysqlite_cursor_executemany, variables: !762)
!762 = !{!763, !764}
!763 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !761, file: !385, line: 752, type: !395)
!764 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !761, file: !385, line: 752, type: !14)
!765 = !DISubprogram(name: "pysqlite_cursor_executescript", scope: !385, file: !385, line: 757, type: !756, isLocal: false, isDefinition: true, scopeLine: 758, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pysqlite_Cursor*, %struct._object*)* @pysqlite_cursor_executescript, variables: !766)
!766 = !{!767, !768, !769, !770, !771, !772, !773, !774, !775, !777, !780, !782}
!767 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !765, file: !385, line: 757, type: !395)
!768 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !765, file: !385, line: 757, type: !14)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "script_obj", scope: !765, file: !385, line: 759, type: !14)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "script_str", scope: !765, file: !385, line: 760, type: !14)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "script_cstr", scope: !765, file: !385, line: 761, type: !38)
!772 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "statement", scope: !765, file: !385, line: 762, type: !372)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !765, file: !385, line: 763, type: !53)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !765, file: !385, line: 764, type: !14)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !776, file: !385, line: 791, type: !14)
!776 = distinct !DILexicalBlock(scope: !765, file: !385, line: 791, column: 8)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !778, file: !385, line: 794, type: !551)
!778 = distinct !DILexicalBlock(scope: !779, file: !385, line: 794, column: 9)
!779 = distinct !DILexicalBlock(scope: !765, file: !385, line: 793, column: 15)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !781, file: !385, line: 831, type: !14)
!781 = distinct !DILexicalBlock(scope: !765, file: !385, line: 831, column: 8)
!782 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !783, file: !385, line: 831, type: !14)
!783 = distinct !DILexicalBlock(scope: !784, file: !385, line: 831, column: 102)
!784 = distinct !DILexicalBlock(scope: !781, file: !385, line: 831, column: 68)
!785 = !DISubprogram(name: "pysqlite_cursor_getiter", scope: !385, file: !385, line: 841, type: !528, isLocal: false, isDefinition: true, scopeLine: 842, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pysqlite_Cursor*)* @pysqlite_cursor_getiter, variables: !786)
!786 = !{!787}
!787 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !785, file: !385, line: 841, type: !395)
!788 = !DISubprogram(name: "pysqlite_cursor_iternext", scope: !385, file: !385, line: 847, type: !528, isLocal: false, isDefinition: true, scopeLine: 848, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pysqlite_Cursor*)* @pysqlite_cursor_iternext, variables: !789)
!789 = !{!790, !791, !792, !793, !794, !800, !804, !808, !814}
!790 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !788, file: !385, line: 847, type: !395)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next_row_tuple", scope: !788, file: !385, line: 849, type: !14)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next_row", scope: !788, file: !385, line: 850, type: !14)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rc", scope: !788, file: !385, line: 851, type: !53)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !795, file: !385, line: 865, type: !14)
!795 = distinct !DILexicalBlock(scope: !796, file: !385, line: 865, column: 16)
!796 = distinct !DILexicalBlock(scope: !797, file: !385, line: 863, column: 31)
!797 = distinct !DILexicalBlock(scope: !798, file: !385, line: 863, column: 14)
!798 = distinct !DILexicalBlock(scope: !799, file: !385, line: 862, column: 26)
!799 = distinct !DILexicalBlock(scope: !788, file: !385, line: 862, column: 9)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !801, file: !385, line: 865, type: !14)
!801 = distinct !DILexicalBlock(scope: !802, file: !385, line: 865, column: 133)
!802 = distinct !DILexicalBlock(scope: !803, file: !385, line: 865, column: 96)
!803 = distinct !DILexicalBlock(scope: !795, file: !385, line: 865, column: 73)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !805, file: !385, line: 880, type: !14)
!805 = distinct !DILexicalBlock(scope: !806, file: !385, line: 880, column: 12)
!806 = distinct !DILexicalBlock(scope: !807, file: !385, line: 874, column: 49)
!807 = distinct !DILexicalBlock(scope: !788, file: !385, line: 874, column: 9)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !809, file: !385, line: 889, type: !14)
!809 = distinct !DILexicalBlock(scope: !810, file: !385, line: 889, column: 16)
!810 = distinct !DILexicalBlock(scope: !811, file: !385, line: 887, column: 37)
!811 = distinct !DILexicalBlock(scope: !812, file: !385, line: 887, column: 13)
!812 = distinct !DILexicalBlock(scope: !813, file: !385, line: 885, column: 26)
!813 = distinct !DILexicalBlock(scope: !788, file: !385, line: 885, column: 9)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !815, file: !385, line: 898, type: !14)
!815 = distinct !DILexicalBlock(scope: !816, file: !385, line: 898, column: 20)
!816 = distinct !DILexicalBlock(scope: !817, file: !385, line: 896, column: 47)
!817 = distinct !DILexicalBlock(scope: !818, file: !385, line: 896, column: 17)
!818 = distinct !DILexicalBlock(scope: !819, file: !385, line: 894, column: 24)
!819 = distinct !DILexicalBlock(scope: !812, file: !385, line: 894, column: 13)
!820 = !DISubprogram(name: "pysqlite_cursor_fetchone", scope: !385, file: !385, line: 908, type: !756, isLocal: false, isDefinition: true, scopeLine: 909, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pysqlite_Cursor*, %struct._object*)* @pysqlite_cursor_fetchone, variables: !821)
!821 = !{!822, !823, !824}
!822 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !820, file: !385, line: 908, type: !395)
!823 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !820, file: !385, line: 908, type: !14)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "row", scope: !820, file: !385, line: 910, type: !14)
!825 = !DISubprogram(name: "pysqlite_cursor_fetchmany", scope: !385, file: !385, line: 921, type: !826, isLocal: false, isDefinition: true, scopeLine: 922, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pysqlite_Cursor*, %struct._object*, %struct._object*)* @pysqlite_cursor_fetchmany, variables: !828)
!826 = !DISubroutineType(types: !827)
!827 = !{!14, !395, !14, !14}
!828 = !{!829, !830, !831, !832, !833, !834, !835, !836, !841}
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !825, file: !385, line: 921, type: !395)
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !825, file: !385, line: 921, type: !14)
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !825, file: !385, line: 921, type: !14)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "row", scope: !825, file: !385, line: 925, type: !14)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !825, file: !385, line: 926, type: !14)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxrows", scope: !825, file: !385, line: 927, type: !53)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "counter", scope: !825, file: !385, line: 928, type: !53)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !837, file: !385, line: 946, type: !14)
!837 = distinct !DILexicalBlock(scope: !838, file: !385, line: 946, column: 16)
!838 = distinct !DILexicalBlock(scope: !839, file: !385, line: 944, column: 18)
!839 = distinct !DILexicalBlock(scope: !840, file: !385, line: 944, column: 13)
!840 = distinct !DILexicalBlock(scope: !825, file: !385, line: 942, column: 17)
!841 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !842, file: !385, line: 957, type: !14)
!842 = distinct !DILexicalBlock(scope: !843, file: !385, line: 957, column: 12)
!843 = distinct !DILexicalBlock(scope: !844, file: !385, line: 956, column: 27)
!844 = distinct !DILexicalBlock(scope: !825, file: !385, line: 956, column: 9)
!845 = !DISubprogram(name: "pysqlite_cursor_fetchall", scope: !385, file: !385, line: 964, type: !756, isLocal: false, isDefinition: true, scopeLine: 965, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pysqlite_Cursor*, %struct._object*)* @pysqlite_cursor_fetchall, variables: !846)
!846 = !{!847, !848, !849, !850, !851, !856}
!847 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !845, file: !385, line: 964, type: !395)
!848 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !845, file: !385, line: 964, type: !14)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "row", scope: !845, file: !385, line: 966, type: !14)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "list", scope: !845, file: !385, line: 967, type: !14)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !852, file: !385, line: 981, type: !14)
!852 = distinct !DILexicalBlock(scope: !853, file: !385, line: 981, column: 16)
!853 = distinct !DILexicalBlock(scope: !854, file: !385, line: 979, column: 18)
!854 = distinct !DILexicalBlock(scope: !855, file: !385, line: 979, column: 13)
!855 = distinct !DILexicalBlock(scope: !845, file: !385, line: 977, column: 17)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !857, file: !385, line: 986, type: !14)
!857 = distinct !DILexicalBlock(scope: !858, file: !385, line: 986, column: 12)
!858 = distinct !DILexicalBlock(scope: !859, file: !385, line: 985, column: 27)
!859 = distinct !DILexicalBlock(scope: !845, file: !385, line: 985, column: 9)
!860 = !DISubprogram(name: "pysqlite_noop", scope: !385, file: !385, line: 993, type: !861, isLocal: false, isDefinition: true, scopeLine: 994, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pysqlite_Connection*, %struct._object*)* @pysqlite_noop, variables: !863)
!861 = !DISubroutineType(types: !862)
!862 = !{!14, !401, !14}
!863 = !{!864, !865}
!864 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !860, file: !385, line: 993, type: !401)
!865 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !860, file: !385, line: 993, type: !14)
!866 = !DISubprogram(name: "pysqlite_cursor_close", scope: !385, file: !385, line: 1000, type: !756, isLocal: false, isDefinition: true, scopeLine: 1001, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.pysqlite_Cursor*, %struct._object*)* @pysqlite_cursor_close, variables: !867)
!867 = !{!868, !869, !870, !874}
!868 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !866, file: !385, line: 1000, type: !395)
!869 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !866, file: !385, line: 1000, type: !14)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !871, file: !385, line: 1008, type: !14)
!871 = distinct !DILexicalBlock(scope: !872, file: !385, line: 1008, column: 12)
!872 = distinct !DILexicalBlock(scope: !873, file: !385, line: 1006, column: 26)
!873 = distinct !DILexicalBlock(scope: !866, file: !385, line: 1006, column: 9)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !875, file: !385, line: 1008, type: !14)
!875 = distinct !DILexicalBlock(scope: !876, file: !385, line: 1008, column: 129)
!876 = distinct !DILexicalBlock(scope: !877, file: !385, line: 1008, column: 92)
!877 = distinct !DILexicalBlock(scope: !871, file: !385, line: 1008, column: 69)
!878 = !DISubprogram(name: "pysqlite_cursor_setup_types", scope: !385, file: !385, line: 1095, type: !879, isLocal: false, isDefinition: true, scopeLine: 1096, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @pysqlite_cursor_setup_types, variables: !881)
!879 = !DISubroutineType(types: !880)
!880 = !{!53}
!881 = !{}
!882 = !DISubprogram(name: "check_cursor", scope: !385, file: !385, line: 405, type: !393, isLocal: true, isDefinition: true, scopeLine: 406, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.pysqlite_Cursor*)* @check_cursor, variables: !883)
!883 = !{!884}
!884 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cur", arg: 1, scope: !882, file: !385, line: 405, type: !395)
!885 = !DISubprogram(name: "detect_statement_type", scope: !385, file: !385, line: 32, type: !886, isLocal: true, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*)* @detect_statement_type, variables: !889)
!886 = !DISubroutineType(types: !887)
!887 = !{!888, !38}
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "pysqlite_StatementKind", file: !4, line: 58, baseType: !3)
!889 = !{!890, !891, !892, !893, !894, !897, !898, !900, !901, !904, !905, !907, !908, !911, !912, !914, !915, !918, !919, !921, !922, !925, !926, !928}
!890 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "statement", arg: 1, scope: !885, file: !385, line: 32, type: !38)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !885, file: !385, line: 34, type: !109)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "src", scope: !885, file: !385, line: 35, type: !38)
!893 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dst", scope: !885, file: !385, line: 36, type: !61)
!894 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !895, file: !385, line: 55, type: !104)
!895 = distinct !DILexicalBlock(scope: !896, file: !385, line: 55, column: 25)
!896 = distinct !DILexicalBlock(scope: !885, file: !385, line: 55, column: 9)
!897 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !895, file: !385, line: 55, type: !104)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !899, file: !385, line: 55, type: !381)
!899 = distinct !DILexicalBlock(scope: !895, file: !385, line: 55, column: 1568)
!900 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !899, file: !385, line: 55, type: !53)
!901 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !902, file: !385, line: 57, type: !104)
!902 = distinct !DILexicalBlock(scope: !903, file: !385, line: 57, column: 32)
!903 = distinct !DILexicalBlock(scope: !896, file: !385, line: 57, column: 16)
!904 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !902, file: !385, line: 57, type: !104)
!905 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !906, file: !385, line: 57, type: !381)
!906 = distinct !DILexicalBlock(scope: !902, file: !385, line: 57, column: 1575)
!907 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !906, file: !385, line: 57, type: !53)
!908 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !909, file: !385, line: 59, type: !104)
!909 = distinct !DILexicalBlock(scope: !910, file: !385, line: 59, column: 32)
!910 = distinct !DILexicalBlock(scope: !903, file: !385, line: 59, column: 16)
!911 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !909, file: !385, line: 59, type: !104)
!912 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !913, file: !385, line: 59, type: !381)
!913 = distinct !DILexicalBlock(scope: !909, file: !385, line: 59, column: 1575)
!914 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !913, file: !385, line: 59, type: !53)
