; ModuleID = 'programs_new/Python-new/descrobject.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !11, subprograms: !520, globals: !1196)
!1 = !DIFile(filename: "descrobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !4, line: 23, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!7 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!8 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!9 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!10 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!11 = !{!12, !107, !55, !375, !381, !389, !410, !417, !112, !431, !438, !439, !440, !368, !69, !448, !506, !510}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDescrObject", file: !14, line: 56, baseType: !15)
!14 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 53, size: 384, align: 64, elements: !16)
!16 = !{!17, !372}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "d_common", scope: !15, file: !14, line: 54, baseType: !18, size: 320, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDescrObject", file: !14, line: 46, baseType: !19)
!19 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 41, size: 320, align: 64, elements: !20)
!20 = !{!21, !367, !370, !371}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !19, file: !14, line: 42, baseType: !22, size: 128, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !23, line: 109, baseType: !24)
!23 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !23, line: 105, size: 128, align: 64, elements: !25)
!25 = !{!26, !34}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !24, file: !23, line: 107, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !28, line: 177, baseType: !29)
!28 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !30, line: 102, baseType: !31)
!30 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !32, line: 181, baseType: !33)
!32 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!33 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !24, file: !23, line: 108, baseType: !35, size: 64, align: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !23, line: 334, size: 3200, align: 64, elements: !37)
!37 = !{!38, !44, !48, !49, !50, !56, !120, !125, !130, !131, !136, !188, !219, !231, !237, !238, !239, !241, !243, !274, !275, !276, !285, !286, !291, !292, !294, !296, !306, !316, !333, !334, !335, !337, !339, !340, !342, !347, !352, !357, !358, !359, !360, !361, !362, !363, !364, !366}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !36, file: !23, line: 335, baseType: !39, size: 192, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !23, line: 114, baseType: !40)
!40 = !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 111, size: 192, align: 64, elements: !41)
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !40, file: !23, line: 112, baseType: !22, size: 128, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !40, file: !23, line: 113, baseType: !27, size: 64, align: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !36, file: !23, line: 336, baseType: !45, size: 64, align: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!47 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !36, file: !23, line: 337, baseType: !27, size: 64, align: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !36, file: !23, line: 337, baseType: !27, size: 64, align: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !36, file: !23, line: 341, baseType: !51, size: 64, align: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !23, line: 308, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !55}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !36, file: !23, line: 342, baseType: !57, size: 64, align: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !23, line: 314, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !55, !62, !61}
!61 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !30, line: 48, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !65, line: 246, size: 1728, align: 64, elements: !66)
!65 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!66 = !{!67, !68, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !88, !89, !90, !91, !93, !95, !97, !101, !104, !106, !108, !109, !110, !111, !115, !116}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !64, file: !65, line: 247, baseType: !61, size: 32, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !64, file: !65, line: 252, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !64, file: !65, line: 253, baseType: !69, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !64, file: !65, line: 254, baseType: !69, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !64, file: !65, line: 255, baseType: !69, size: 64, align: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !64, file: !65, line: 256, baseType: !69, size: 64, align: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !64, file: !65, line: 257, baseType: !69, size: 64, align: 64, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !64, file: !65, line: 258, baseType: !69, size: 64, align: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !64, file: !65, line: 259, baseType: !69, size: 64, align: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !64, file: !65, line: 261, baseType: !69, size: 64, align: 64, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !64, file: !65, line: 262, baseType: !69, size: 64, align: 64, offset: 640)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !64, file: !65, line: 263, baseType: !69, size: 64, align: 64, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !64, file: !65, line: 265, baseType: !81, size: 64, align: 64, offset: 768)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !65, line: 161, size: 192, align: 64, elements: !83)
!83 = !{!84, !85, !87}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !82, file: !65, line: 162, baseType: !81, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !82, file: !65, line: 163, baseType: !86, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !82, file: !65, line: 167, baseType: !61, size: 32, align: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !64, file: !65, line: 267, baseType: !86, size: 64, align: 64, offset: 832)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !64, file: !65, line: 269, baseType: !61, size: 32, align: 32, offset: 896)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !64, file: !65, line: 273, baseType: !61, size: 32, align: 32, offset: 928)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !64, file: !65, line: 275, baseType: !92, size: 64, align: 64, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !32, line: 140, baseType: !33)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !64, file: !65, line: 279, baseType: !94, size: 16, align: 16, offset: 1024)
!94 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !64, file: !65, line: 280, baseType: !96, size: 8, align: 8, offset: 1040)
!96 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !64, file: !65, line: 281, baseType: !98, size: 8, align: 8, offset: 1048)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8, align: 8, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 1)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !64, file: !65, line: 285, baseType: !102, size: 64, align: 64, offset: 1088)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !65, line: 155, baseType: null)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !64, file: !65, line: 294, baseType: !105, size: 64, align: 64, offset: 1152)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !32, line: 141, baseType: !33)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !64, file: !65, line: 303, baseType: !107, size: 64, align: 64, offset: 1216)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !64, file: !65, line: 304, baseType: !107, size: 64, align: 64, offset: 1280)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !64, file: !65, line: 305, baseType: !107, size: 64, align: 64, offset: 1344)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !64, file: !65, line: 306, baseType: !107, size: 64, align: 64, offset: 1408)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !64, file: !65, line: 307, baseType: !112, size: 64, align: 64, offset: 1472)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !113, line: 62, baseType: !114)
!113 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!114 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !64, file: !65, line: 309, baseType: !61, size: 32, align: 32, offset: 1536)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !64, file: !65, line: 311, baseType: !117, size: 160, align: 8, offset: 1568)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 160, align: 8, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 20)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !36, file: !23, line: 343, baseType: !121, size: 64, align: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !23, line: 316, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!55, !55, !69}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !36, file: !23, line: 344, baseType: !126, size: 64, align: 64, offset: 576)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !23, line: 318, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!61, !55, !69, !55}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !36, file: !23, line: 345, baseType: !107, size: 64, align: 64, offset: 640)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !36, file: !23, line: 346, baseType: !132, size: 64, align: 64, offset: 704)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !23, line: 320, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!55, !55}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !36, file: !23, line: 350, baseType: !137, size: 64, align: 64, offset: 768)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !23, line: 278, baseType: !139)
!139 = !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 236, size: 2176, align: 64, elements: !140)
!140 = !{!141, !146, !147, !148, !149, !150, !155, !157, !158, !159, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !139, file: !23, line: 241, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !23, line: 166, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!55, !55, !55}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !139, file: !23, line: 242, baseType: !142, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !139, file: !23, line: 243, baseType: !142, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !139, file: !23, line: 244, baseType: !142, size: 64, align: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !139, file: !23, line: 245, baseType: !142, size: 64, align: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !139, file: !23, line: 246, baseType: !151, size: 64, align: 64, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !23, line: 167, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!55, !55, !55, !55}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !139, file: !23, line: 247, baseType: !156, size: 64, align: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !23, line: 165, baseType: !133)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !139, file: !23, line: 248, baseType: !156, size: 64, align: 64, offset: 448)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !139, file: !23, line: 249, baseType: !156, size: 64, align: 64, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !139, file: !23, line: 250, baseType: !160, size: 64, align: 64, offset: 576)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !23, line: 168, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!61, !55}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !139, file: !23, line: 251, baseType: !156, size: 64, align: 64, offset: 640)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !139, file: !23, line: 252, baseType: !142, size: 64, align: 64, offset: 704)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !139, file: !23, line: 253, baseType: !142, size: 64, align: 64, offset: 768)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !139, file: !23, line: 254, baseType: !142, size: 64, align: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !139, file: !23, line: 255, baseType: !142, size: 64, align: 64, offset: 896)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !139, file: !23, line: 256, baseType: !142, size: 64, align: 64, offset: 960)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !139, file: !23, line: 257, baseType: !156, size: 64, align: 64, offset: 1024)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !139, file: !23, line: 258, baseType: !107, size: 64, align: 64, offset: 1088)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !139, file: !23, line: 259, baseType: !156, size: 64, align: 64, offset: 1152)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !139, file: !23, line: 261, baseType: !142, size: 64, align: 64, offset: 1216)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !139, file: !23, line: 262, baseType: !142, size: 64, align: 64, offset: 1280)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !139, file: !23, line: 263, baseType: !142, size: 64, align: 64, offset: 1344)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !139, file: !23, line: 264, baseType: !142, size: 64, align: 64, offset: 1408)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !139, file: !23, line: 265, baseType: !151, size: 64, align: 64, offset: 1472)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !139, file: !23, line: 266, baseType: !142, size: 64, align: 64, offset: 1536)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !139, file: !23, line: 267, baseType: !142, size: 64, align: 64, offset: 1600)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !139, file: !23, line: 268, baseType: !142, size: 64, align: 64, offset: 1664)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !139, file: !23, line: 269, baseType: !142, size: 64, align: 64, offset: 1728)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !139, file: !23, line: 270, baseType: !142, size: 64, align: 64, offset: 1792)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !139, file: !23, line: 272, baseType: !142, size: 64, align: 64, offset: 1856)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !139, file: !23, line: 273, baseType: !142, size: 64, align: 64, offset: 1920)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !139, file: !23, line: 274, baseType: !142, size: 64, align: 64, offset: 1984)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !139, file: !23, line: 275, baseType: !142, size: 64, align: 64, offset: 2048)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !139, file: !23, line: 277, baseType: !156, size: 64, align: 64, offset: 2112)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !36, file: !23, line: 351, baseType: !189, size: 64, align: 64, offset: 832)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !23, line: 292, baseType: !191)
!191 = !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 280, size: 640, align: 64, elements: !192)
!192 = !{!193, !198, !199, !204, !205, !206, !211, !212, !217, !218}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !191, file: !23, line: 281, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !23, line: 169, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!27, !55}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !191, file: !23, line: 282, baseType: !142, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !191, file: !23, line: 283, baseType: !200, size: 64, align: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !23, line: 170, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!55, !55, !27}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !191, file: !23, line: 284, baseType: !200, size: 64, align: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !191, file: !23, line: 285, baseType: !107, size: 64, align: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !191, file: !23, line: 286, baseType: !207, size: 64, align: 64, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !23, line: 172, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!61, !55, !27, !55}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !191, file: !23, line: 287, baseType: !107, size: 64, align: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !191, file: !23, line: 288, baseType: !213, size: 64, align: 64, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !23, line: 231, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!61, !55, !55}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !191, file: !23, line: 290, baseType: !142, size: 64, align: 64, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !191, file: !23, line: 291, baseType: !200, size: 64, align: 64, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !36, file: !23, line: 352, baseType: !220, size: 64, align: 64, offset: 896)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !23, line: 298, baseType: !222)
!222 = !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 294, size: 192, align: 64, elements: !223)
!223 = !{!224, !225, !226}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !222, file: !23, line: 295, baseType: !194, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !222, file: !23, line: 296, baseType: !142, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !222, file: !23, line: 297, baseType: !227, size: 64, align: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !23, line: 174, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!61, !55, !55, !55}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !36, file: !23, line: 356, baseType: !232, size: 64, align: 64, offset: 960)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !23, line: 321, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!236, !55}
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !28, line: 186, baseType: !27)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !36, file: !23, line: 357, baseType: !151, size: 64, align: 64, offset: 1024)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !36, file: !23, line: 358, baseType: !132, size: 64, align: 64, offset: 1088)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !36, file: !23, line: 359, baseType: !240, size: 64, align: 64, offset: 1152)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !23, line: 317, baseType: !143)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !36, file: !23, line: 360, baseType: !242, size: 64, align: 64, offset: 1216)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !23, line: 319, baseType: !228)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !36, file: !23, line: 363, baseType: !244, size: 64, align: 64, offset: 1280)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !23, line: 304, baseType: !246)
!246 = !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 301, size: 128, align: 64, elements: !247)
!247 = !{!248, !269}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !246, file: !23, line: 302, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !23, line: 193, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!61, !55, !253, !61}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !23, line: 191, baseType: !255)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !23, line: 178, size: 640, align: 64, elements: !256)
!256 = !{!257, !258, !259, !260, !261, !262, !263, !264, !266, !267, !268}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !255, file: !23, line: 179, baseType: !107, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !255, file: !23, line: 180, baseType: !55, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !255, file: !23, line: 181, baseType: !27, size: 64, align: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !255, file: !23, line: 182, baseType: !27, size: 64, align: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !255, file: !23, line: 184, baseType: !61, size: 32, align: 32, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !255, file: !23, line: 185, baseType: !61, size: 32, align: 32, offset: 288)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !255, file: !23, line: 186, baseType: !69, size: 64, align: 64, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !255, file: !23, line: 187, baseType: !265, size: 64, align: 64, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !255, file: !23, line: 188, baseType: !265, size: 64, align: 64, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !255, file: !23, line: 189, baseType: !265, size: 64, align: 64, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !255, file: !23, line: 190, baseType: !107, size: 64, align: 64, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !246, file: !23, line: 303, baseType: !270, size: 64, align: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !23, line: 194, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !55, !253}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !36, file: !23, line: 366, baseType: !114, size: 64, align: 64, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !36, file: !23, line: 368, baseType: !45, size: 64, align: 64, offset: 1408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !36, file: !23, line: 372, baseType: !277, size: 64, align: 64, offset: 1472)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !23, line: 233, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!61, !55, !281, !107}
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !23, line: 232, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!61, !55, !107}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !36, file: !23, line: 375, baseType: !160, size: 64, align: 64, offset: 1536)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !36, file: !23, line: 379, baseType: !287, size: 64, align: 64, offset: 1600)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !23, line: 322, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!55, !55, !55, !61}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !36, file: !23, line: 382, baseType: !27, size: 64, align: 64, offset: 1664)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !36, file: !23, line: 385, baseType: !293, size: 64, align: 64, offset: 1728)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !23, line: 323, baseType: !133)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !36, file: !23, line: 386, baseType: !295, size: 64, align: 64, offset: 1792)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !23, line: 324, baseType: !133)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !36, file: !23, line: 389, baseType: !297, size: 64, align: 64, offset: 1856)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !299, line: 40, size: 256, align: 64, elements: !300)
!299 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!300 = !{!301, !302, !304, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !298, file: !299, line: 41, baseType: !45, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !298, file: !299, line: 42, baseType: !303, size: 64, align: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !299, line: 18, baseType: !143)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !298, file: !299, line: 43, baseType: !61, size: 32, align: 32, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !298, file: !299, line: 45, baseType: !45, size: 64, align: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !36, file: !23, line: 390, baseType: !307, size: 64, align: 64, offset: 1920)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !309, line: 18, size: 320, align: 64, elements: !310)
!309 = !DIFile(filename: "Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!310 = !{!311, !312, !313, !314, !315}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !308, file: !309, line: 19, baseType: !69, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !308, file: !309, line: 20, baseType: !61, size: 32, align: 32, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !308, file: !309, line: 21, baseType: !27, size: 64, align: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !308, file: !309, line: 22, baseType: !61, size: 32, align: 32, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !308, file: !309, line: 23, baseType: !69, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !36, file: !23, line: 391, baseType: !317, size: 64, align: 64, offset: 1984)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !14, line: 11, size: 320, align: 64, elements: !319)
!319 = !{!320, !321, !326, !331, !332}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !318, file: !14, line: 12, baseType: !69, size: 64, align: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !318, file: !14, line: 13, baseType: !322, size: 64, align: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !14, line: 8, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!55, !55, !107}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !318, file: !14, line: 14, baseType: !327, size: 64, align: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !14, line: 9, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!61, !55, !55, !107}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !318, file: !14, line: 15, baseType: !69, size: 64, align: 64, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !318, file: !14, line: 16, baseType: !107, size: 64, align: 64, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !36, file: !23, line: 392, baseType: !35, size: 64, align: 64, offset: 2048)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !36, file: !23, line: 393, baseType: !55, size: 64, align: 64, offset: 2112)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !36, file: !23, line: 394, baseType: !336, size: 64, align: 64, offset: 2176)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !23, line: 325, baseType: !152)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !36, file: !23, line: 395, baseType: !338, size: 64, align: 64, offset: 2240)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !23, line: 326, baseType: !228)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !36, file: !23, line: 396, baseType: !27, size: 64, align: 64, offset: 2304)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !36, file: !23, line: 397, baseType: !341, size: 64, align: 64, offset: 2368)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !23, line: 327, baseType: !228)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !36, file: !23, line: 398, baseType: !343, size: 64, align: 64, offset: 2432)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !23, line: 329, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!55, !35, !27}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !36, file: !23, line: 399, baseType: !348, size: 64, align: 64, offset: 2496)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !23, line: 328, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = !DISubroutineType(types: !351)
!351 = !{!55, !35, !55, !55}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !36, file: !23, line: 400, baseType: !353, size: 64, align: 64, offset: 2560)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !23, line: 307, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !107}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !36, file: !23, line: 401, baseType: !160, size: 64, align: 64, offset: 2624)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !36, file: !23, line: 402, baseType: !55, size: 64, align: 64, offset: 2688)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !36, file: !23, line: 403, baseType: !55, size: 64, align: 64, offset: 2752)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !36, file: !23, line: 404, baseType: !55, size: 64, align: 64, offset: 2816)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !36, file: !23, line: 405, baseType: !55, size: 64, align: 64, offset: 2880)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !36, file: !23, line: 406, baseType: !55, size: 64, align: 64, offset: 2944)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !36, file: !23, line: 407, baseType: !51, size: 64, align: 64, offset: 3008)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !36, file: !23, line: 410, baseType: !365, size: 32, align: 32, offset: 3072)
!365 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !36, file: !23, line: 412, baseType: !51, size: 64, align: 64, offset: 3136)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !19, file: !14, line: 43, baseType: !368, size: 64, align: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !23, line: 422, baseType: !36)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !19, file: !14, line: 44, baseType: !55, size: 64, align: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "d_qualname", scope: !19, file: !14, line: 45, baseType: !55, size: 64, align: 64, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "d_method", scope: !15, file: !14, line: 55, baseType: !373, size: 64, align: 64, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !299, line: 47, baseType: !298)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDescrObject", file: !14, line: 61, baseType: !377)
!377 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 58, size: 384, align: 64, elements: !378)
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "d_common", scope: !377, file: !14, line: 59, baseType: !18, size: 320, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "d_member", scope: !377, file: !14, line: 60, baseType: !307, size: 64, align: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDescrObject", file: !14, line: 66, baseType: !383)
!383 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 63, size: 384, align: 64, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "d_common", scope: !383, file: !14, line: 64, baseType: !18, size: 320, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "d_getset", scope: !383, file: !14, line: 65, baseType: !387, size: 64, align: 64, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGetSetDef", file: !14, line: 17, baseType: !318)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyWrapperDescrObject", file: !14, line: 72, baseType: !391)
!391 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 68, size: 448, align: 64, elements: !392)
!392 = !{!393, !394, !409}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "d_common", scope: !391, file: !14, line: 69, baseType: !18, size: 320, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "d_base", scope: !391, file: !14, line: 70, baseType: !395, size: 64, align: 64, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "wrapperbase", file: !14, line: 26, size: 448, align: 64, elements: !397)
!397 = !{!398, !399, !400, !401, !406, !407, !408}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !396, file: !14, line: 27, baseType: !69, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !396, file: !14, line: 28, baseType: !61, size: 32, align: 32, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !396, file: !14, line: 29, baseType: !107, size: 64, align: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper", scope: !396, file: !14, line: 30, baseType: !402, size: 64, align: 64, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "wrapperfunc", file: !14, line: 20, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!55, !55, !55, !107}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !396, file: !14, line: 31, baseType: !69, size: 64, align: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !396, file: !14, line: 32, baseType: !61, size: 32, align: 32, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "name_strobj", scope: !396, file: !14, line: 33, baseType: !55, size: 64, align: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "d_wrapped", scope: !391, file: !14, line: 71, baseType: !107, size: 64, align: 64, offset: 384)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "mappingproxyobject", file: !412, line: 771, baseType: !413)
!412 = !DIFile(filename: "Objects/descrobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!413 = !DICompositeType(tag: DW_TAG_structure_type, file: !412, line: 768, size: 192, align: 64, elements: !414)
!414 = !{!415, !416}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !413, file: !412, line: 769, baseType: !22, size: 128, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !413, file: !412, line: 770, baseType: !55, size: 64, align: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !419, line: 253, baseType: !420)
!419 = !DIFile(filename: "Include/objimpl.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!420 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !419, line: 246, size: 192, align: 64, elements: !421)
!421 = !{!422, !429}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !420, file: !419, line: 251, baseType: !423, size: 192, align: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, scope: !420, file: !419, line: 247, size: 192, align: 64, elements: !424)
!424 = !{!425, !427, !428}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !423, file: !419, line: 248, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !423, file: !419, line: 249, baseType: !426, size: 64, align: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !423, file: !419, line: 250, baseType: !27, size: 64, align: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !420, file: !419, line: 252, baseType: !430, size: 64, align: 64)
!430 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "wrapperobject", file: !412, line: 1016, baseType: !433)
!433 = !DICompositeType(tag: DW_TAG_structure_type, file: !412, line: 1012, size: 256, align: 64, elements: !434)
!434 = !{!435, !436, !437}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !433, file: !412, line: 1013, baseType: !22, size: 128, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "descr", scope: !433, file: !412, line: 1014, baseType: !389, size: 64, align: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !433, file: !412, line: 1015, baseType: !55, size: 64, align: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !442, line: 33, baseType: !443)
!442 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!443 = !DICompositeType(tag: DW_TAG_structure_type, file: !442, line: 25, size: 256, align: 64, elements: !444)
!444 = !{!445, !446}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !443, file: !442, line: 26, baseType: !39, size: 192, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !443, file: !442, line: 27, baseType: !447, size: 64, align: 64, offset: 192)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 64, align: 64, elements: !99)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !450, line: 139, baseType: !451)
!450 = !DIFile(filename: "Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !450, line: 69, size: 1536, align: 64, elements: !452)
!452 = !{!453, !455, !456, !476, !479, !480, !481, !482, !483, !484, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !451, file: !450, line: 72, baseType: !454, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !451, file: !450, line: 73, baseType: !454, size: 64, align: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !451, file: !450, line: 74, baseType: !457, size: 64, align: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !450, line: 44, baseType: !459)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !450, line: 19, size: 832, align: 64, elements: !460)
!460 = !{!461, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !459, file: !450, line: 21, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !459, file: !450, line: 22, baseType: !454, size: 64, align: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !459, file: !450, line: 24, baseType: !55, size: 64, align: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !459, file: !450, line: 25, baseType: !55, size: 64, align: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !459, file: !450, line: 26, baseType: !55, size: 64, align: 64, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !459, file: !450, line: 27, baseType: !55, size: 64, align: 64, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !459, file: !450, line: 28, baseType: !55, size: 64, align: 64, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !459, file: !450, line: 30, baseType: !55, size: 64, align: 64, offset: 448)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !459, file: !450, line: 31, baseType: !55, size: 64, align: 64, offset: 512)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !459, file: !450, line: 32, baseType: !55, size: 64, align: 64, offset: 576)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !459, file: !450, line: 33, baseType: !61, size: 32, align: 32, offset: 640)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !459, file: !450, line: 34, baseType: !61, size: 32, align: 32, offset: 672)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !459, file: !450, line: 37, baseType: !61, size: 32, align: 32, offset: 704)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !459, file: !450, line: 43, baseType: !55, size: 64, align: 64, offset: 768)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !451, file: !450, line: 76, baseType: !477, size: 64, align: 64, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !450, line: 50, flags: DIFlagFwdDecl)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !451, file: !450, line: 77, baseType: !61, size: 32, align: 32, offset: 256)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !451, file: !450, line: 78, baseType: !47, size: 8, align: 8, offset: 288)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !451, file: !450, line: 80, baseType: !47, size: 8, align: 8, offset: 296)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !451, file: !450, line: 85, baseType: !61, size: 32, align: 32, offset: 320)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !451, file: !450, line: 86, baseType: !61, size: 32, align: 32, offset: 352)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !451, file: !450, line: 88, baseType: !485, size: 64, align: 64, offset: 384)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !450, line: 54, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{!61, !55, !477, !61, !55}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !451, file: !450, line: 89, baseType: !485, size: 64, align: 64, offset: 448)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !451, file: !450, line: 90, baseType: !55, size: 64, align: 64, offset: 512)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !451, file: !450, line: 91, baseType: !55, size: 64, align: 64, offset: 576)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !451, file: !450, line: 93, baseType: !55, size: 64, align: 64, offset: 640)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !451, file: !450, line: 94, baseType: !55, size: 64, align: 64, offset: 704)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !451, file: !450, line: 95, baseType: !55, size: 64, align: 64, offset: 768)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !451, file: !450, line: 97, baseType: !55, size: 64, align: 64, offset: 832)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !451, file: !450, line: 98, baseType: !55, size: 64, align: 64, offset: 896)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !451, file: !450, line: 99, baseType: !55, size: 64, align: 64, offset: 960)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !451, file: !450, line: 101, baseType: !55, size: 64, align: 64, offset: 1024)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !451, file: !450, line: 103, baseType: !61, size: 32, align: 32, offset: 1088)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !451, file: !450, line: 105, baseType: !55, size: 64, align: 64, offset: 1152)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !451, file: !450, line: 106, baseType: !33, size: 64, align: 64, offset: 1216)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !451, file: !450, line: 108, baseType: !61, size: 32, align: 32, offset: 1280)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !451, file: !450, line: 109, baseType: !55, size: 64, align: 64, offset: 1344)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !451, file: !450, line: 134, baseType: !354, size: 64, align: 64, offset: 1408)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !451, file: !450, line: 135, baseType: !107, size: 64, align: 64, offset: 1472)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "wrapperfunc_kwds", file: !14, line: 23, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!55, !55, !55, !107, !55}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "propertyobject", file: !412, line: 1307, baseType: !512)
!512 = !DICompositeType(tag: DW_TAG_structure_type, file: !412, line: 1300, size: 448, align: 64, elements: !513)
!513 = !{!514, !515, !516, !517, !518, !519}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !512, file: !412, line: 1301, baseType: !22, size: 128, align: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "prop_get", scope: !512, file: !412, line: 1302, baseType: !55, size: 64, align: 64, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "prop_set", scope: !512, file: !412, line: 1303, baseType: !55, size: 64, align: 64, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "prop_del", scope: !512, file: !412, line: 1304, baseType: !55, size: 64, align: 64, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "prop_doc", scope: !512, file: !412, line: 1305, baseType: !55, size: 64, align: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "getter_doc", scope: !512, file: !412, line: 1306, baseType: !61, size: 32, align: 32, offset: 384)
!520 = !{!521, !528, !533, !542, !549, !557, !565, !575, !597, !602, !609, !628, !633, !643, !648, !654, !659, !673, !677, !683, !691, !708, !713, !718, !724, !732, !740, !749, !754, !760, !768, !776, !781, !800, !806, !810, !816, !832, !841, !846, !852, !857, !863, !866, !876, !883, !886, !892, !895, !898, !901, !904, !915, !918, !950, !959, !964, !967, !972, !979, !991, !1005, !1018, !1023, !1027, !1031, !1034, !1040, !1044, !1070, !1092, !1096, !1131, !1135, !1139, !1146, !1152, !1162}
!521 = !DISubprogram(name: "PyDescr_NewMethod", scope: !412, file: !412, line: 701, type: !522, isLocal: false, isDefinition: true, scopeLine: 702, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct.PyMethodDef*)* @PyDescr_NewMethod, variables: !524)
!522 = !DISubroutineType(types: !523)
!523 = !{!55, !368, !373}
!524 = !{!525, !526, !527}
!525 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !521, file: !412, line: 701, type: !368)
!526 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "method", arg: 2, scope: !521, file: !412, line: 701, type: !373)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "descr", scope: !521, file: !412, line: 703, type: !12)
!528 = !DISubprogram(name: "PyDescr_NewClassMethod", scope: !412, file: !412, line: 713, type: !522, isLocal: false, isDefinition: true, scopeLine: 714, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct.PyMethodDef*)* @PyDescr_NewClassMethod, variables: !529)
!529 = !{!530, !531, !532}
!530 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !528, file: !412, line: 713, type: !368)
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "method", arg: 2, scope: !528, file: !412, line: 713, type: !373)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "descr", scope: !528, file: !412, line: 715, type: !12)
!533 = !DISubprogram(name: "PyDescr_NewMember", scope: !412, file: !412, line: 725, type: !534, isLocal: false, isDefinition: true, scopeLine: 726, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct.PyMemberDef*)* @PyDescr_NewMember, variables: !538)
!534 = !DISubroutineType(types: !535)
!535 = !{!55, !368, !536}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMemberDef", file: !309, line: 24, baseType: !308)
!538 = !{!539, !540, !541}
!539 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !533, file: !412, line: 725, type: !368)
!540 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "member", arg: 2, scope: !533, file: !412, line: 725, type: !536)
!541 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "descr", scope: !533, file: !412, line: 727, type: !375)
!542 = !DISubprogram(name: "PyDescr_NewGetSet", scope: !412, file: !412, line: 737, type: !543, isLocal: false, isDefinition: true, scopeLine: 738, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct.PyGetSetDef*)* @PyDescr_NewGetSet, variables: !545)
!543 = !DISubroutineType(types: !544)
!544 = !{!55, !368, !387}
!545 = !{!546, !547, !548}
!546 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !542, file: !412, line: 737, type: !368)
!547 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "getset", arg: 2, scope: !542, file: !412, line: 737, type: !387)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "descr", scope: !542, file: !412, line: 739, type: !381)
!549 = !DISubprogram(name: "PyDescr_NewWrapper", scope: !412, file: !412, line: 749, type: !550, isLocal: false, isDefinition: true, scopeLine: 750, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct.wrapperbase*, i8*)* @PyDescr_NewWrapper, variables: !552)
!550 = !DISubroutineType(types: !551)
!551 = !{!55, !368, !395, !107}
!552 = !{!553, !554, !555, !556}
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !549, file: !412, line: 749, type: !368)
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 2, scope: !549, file: !412, line: 749, type: !395)
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "wrapped", arg: 3, scope: !549, file: !412, line: 749, type: !107)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "descr", scope: !549, file: !412, line: 751, type: !389)
!557 = !DISubprogram(name: "PyDictProxy_New", scope: !412, file: !412, line: 990, type: !134, isLocal: false, isDefinition: true, scopeLine: 991, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyDictProxy_New, variables: !558)
!558 = !{!559, !560, !561}
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mapping", arg: 1, scope: !557, file: !412, line: 990, type: !55)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pp", scope: !557, file: !412, line: 992, type: !410)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !562, file: !412, line: 1001, type: !417)
!562 = distinct !DILexicalBlock(scope: !563, file: !412, line: 1001, column: 12)
!563 = distinct !DILexicalBlock(scope: !564, file: !412, line: 998, column: 27)
!564 = distinct !DILexicalBlock(scope: !557, file: !412, line: 998, column: 9)
!565 = !DISubprogram(name: "PyWrapper_New", scope: !412, file: !412, line: 1246, type: !144, isLocal: false, isDefinition: true, scopeLine: 1247, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyWrapper_New, variables: !566)
!566 = !{!567, !568, !569, !570, !571}
!567 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 1, scope: !565, file: !412, line: 1246, type: !55)
!568 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 2, scope: !565, file: !412, line: 1246, type: !55)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wp", scope: !565, file: !412, line: 1248, type: !431)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "descr", scope: !565, file: !412, line: 1249, type: !389)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !572, file: !412, line: 1262, type: !417)
!572 = distinct !DILexicalBlock(scope: !573, file: !412, line: 1262, column: 12)
!573 = distinct !DILexicalBlock(scope: !574, file: !412, line: 1257, column: 27)
!574 = distinct !DILexicalBlock(scope: !565, file: !412, line: 1257, column: 9)
!575 = !DISubprogram(name: "descr_dealloc", scope: !412, file: !412, line: 7, type: !576, isLocal: true, isDefinition: true, scopeLine: 8, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyDescrObject*)* @descr_dealloc, variables: !578)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !438}
!578 = !{!579, !580, !582, !584, !587, !589, !592, !594}
!579 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !575, file: !412, line: 7, type: !438)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !581, file: !412, line: 9, type: !417)
!581 = distinct !DILexicalBlock(scope: !575, file: !412, line: 9, column: 8)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !583, file: !412, line: 10, type: !55)
!583 = distinct !DILexicalBlock(scope: !575, file: !412, line: 10, column: 8)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !585, file: !412, line: 10, type: !55)
!585 = distinct !DILexicalBlock(scope: !586, file: !412, line: 10, column: 105)
!586 = distinct !DILexicalBlock(scope: !583, file: !412, line: 10, column: 71)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !588, file: !412, line: 11, type: !55)
!588 = distinct !DILexicalBlock(scope: !575, file: !412, line: 11, column: 8)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !590, file: !412, line: 11, type: !55)
!590 = distinct !DILexicalBlock(scope: !591, file: !412, line: 11, column: 105)
!591 = distinct !DILexicalBlock(scope: !588, file: !412, line: 11, column: 71)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !593, file: !412, line: 12, type: !55)
!593 = distinct !DILexicalBlock(scope: !575, file: !412, line: 12, column: 8)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !595, file: !412, line: 12, type: !55)
!595 = distinct !DILexicalBlock(scope: !596, file: !412, line: 12, column: 109)
!596 = distinct !DILexicalBlock(scope: !593, file: !412, line: 12, column: 75)
!597 = !DISubprogram(name: "method_repr", scope: !412, file: !412, line: 35, type: !598, isLocal: true, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyMethodDescrObject*)* @method_repr, variables: !600)
!598 = !DISubroutineType(types: !599)
!599 = !{!55, !12}
!600 = !{!601}
!601 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !597, file: !412, line: 35, type: !12)
!602 = !DISubprogram(name: "descr_repr", scope: !412, file: !412, line: 25, type: !603, isLocal: true, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyDescrObject*, i8*)* @descr_repr, variables: !605)
!603 = !DISubroutineType(types: !604)
!604 = !{!55, !438, !69}
!605 = !{!606, !607, !608}
!606 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !602, file: !412, line: 25, type: !438)
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 2, scope: !602, file: !412, line: 25, type: !69)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !602, file: !412, line: 27, type: !55)
!609 = !DISubprogram(name: "methoddescr_call", scope: !412, file: !412, line: 213, type: !610, isLocal: true, isDefinition: true, scopeLine: 214, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyMethodDescrObject*, %struct._object*, %struct._object*)* @methoddescr_call, variables: !612)
!610 = !DISubroutineType(types: !611)
!611 = !{!55, !12, !55, !55}
!612 = !{!613, !614, !615, !616, !617, !618, !619, !620, !624, !626}
!613 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !609, file: !412, line: 213, type: !12)
!614 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !609, file: !412, line: 213, type: !55)
!615 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !609, file: !412, line: 213, type: !55)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "argc", scope: !609, file: !412, line: 215, type: !27)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !609, file: !412, line: 216, type: !55)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !609, file: !412, line: 216, type: !55)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !609, file: !412, line: 216, type: !55)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !621, file: !412, line: 247, type: !55)
!621 = distinct !DILexicalBlock(scope: !622, file: !412, line: 247, column: 12)
!622 = distinct !DILexicalBlock(scope: !623, file: !412, line: 246, column: 29)
!623 = distinct !DILexicalBlock(scope: !609, file: !412, line: 246, column: 9)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !625, file: !412, line: 251, type: !55)
!625 = distinct !DILexicalBlock(scope: !609, file: !412, line: 251, column: 8)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !627, file: !412, line: 252, type: !55)
!627 = distinct !DILexicalBlock(scope: !609, file: !412, line: 252, column: 8)
!628 = !DISubprogram(name: "descr_name", scope: !412, file: !412, line: 17, type: !629, isLocal: true, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyDescrObject*)* @descr_name, variables: !631)
!629 = !DISubroutineType(types: !630)
!630 = !{!55, !438}
!631 = !{!632}
!632 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !628, file: !412, line: 17, type: !438)
!633 = !DISubprogram(name: "descr_traverse", scope: !412, file: !412, line: 486, type: !279, isLocal: true, isDefinition: true, scopeLine: 487, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)* @descr_traverse, variables: !634)
!634 = !{!635, !636, !637, !638, !639}
!635 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !633, file: !412, line: 486, type: !55)
!636 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !633, file: !412, line: 486, type: !281)
!637 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !633, file: !412, line: 486, type: !107)
!638 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "descr", scope: !633, file: !412, line: 488, type: !438)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !640, file: !412, line: 489, type: !61)
!640 = distinct !DILexicalBlock(scope: !641, file: !412, line: 489, column: 29)
!641 = distinct !DILexicalBlock(scope: !642, file: !412, line: 489, column: 14)
!642 = distinct !DILexicalBlock(scope: !633, file: !412, line: 489, column: 8)
!643 = !DISubprogram(name: "descr_reduce", scope: !412, file: !412, line: 404, type: !629, isLocal: true, isDefinition: true, scopeLine: 405, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyDescrObject*)* @descr_reduce, variables: !644)
!644 = !{!645, !646, !647}
!645 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !643, file: !412, line: 404, type: !438)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "builtins", scope: !643, file: !412, line: 406, type: !55)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "getattr", scope: !643, file: !412, line: 407, type: !55)
!648 = !DISubprogram(name: "method_get_doc", scope: !412, file: !412, line: 354, type: !649, isLocal: true, isDefinition: true, scopeLine: 355, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyMethodDescrObject*, i8*)* @method_get_doc, variables: !651)
!649 = !DISubroutineType(types: !650)
!650 = !{!55, !12, !107}
!651 = !{!652, !653}
!652 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !648, file: !412, line: 354, type: !12)
!653 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !648, file: !412, line: 354, type: !107)
!654 = !DISubprogram(name: "descr_get_qualname", scope: !412, file: !412, line: 395, type: !629, isLocal: true, isDefinition: true, scopeLine: 396, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyDescrObject*)* @descr_get_qualname, variables: !655)
!655 = !{!656, !657}
!656 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !654, file: !412, line: 395, type: !438)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !658, file: !412, line: 399, type: !55)
!658 = distinct !DILexicalBlock(scope: !654, file: !412, line: 399, column: 8)
!659 = !DISubprogram(name: "calculate_qualname", scope: !412, file: !412, line: 366, type: !629, isLocal: true, isDefinition: true, scopeLine: 367, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyDescrObject*)* @calculate_qualname, variables: !660)
!660 = !{!661, !662, !663, !664, !668, !671}
!661 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !659, file: !412, line: 366, type: !438)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type_qualname", scope: !659, file: !412, line: 368, type: !55)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !659, file: !412, line: 368, type: !55)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !665, file: !412, line: 385, type: !55)
!665 = distinct !DILexicalBlock(scope: !666, file: !412, line: 385, column: 12)
!666 = distinct !DILexicalBlock(scope: !667, file: !412, line: 382, column: 88)
!667 = distinct !DILexicalBlock(scope: !659, file: !412, line: 382, column: 9)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !669, file: !412, line: 385, type: !55)
!669 = distinct !DILexicalBlock(scope: !670, file: !412, line: 385, column: 109)
!670 = distinct !DILexicalBlock(scope: !665, file: !412, line: 385, column: 75)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !672, file: !412, line: 390, type: !55)
!672 = distinct !DILexicalBlock(scope: !659, file: !412, line: 390, column: 8)
!673 = !DISubprogram(name: "method_get_text_signature", scope: !412, file: !412, line: 360, type: !649, isLocal: true, isDefinition: true, scopeLine: 361, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyMethodDescrObject*, i8*)* @method_get_text_signature, variables: !674)
!674 = !{!675, !676}
!675 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !673, file: !412, line: 360, type: !12)
!676 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !673, file: !412, line: 360, type: !107)
!677 = !DISubprogram(name: "method_get", scope: !412, file: !412, line: 122, type: !610, isLocal: true, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyMethodDescrObject*, %struct._object*, %struct._object*)* @method_get, variables: !678)
!678 = !{!679, !680, !681, !682}
!679 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !677, file: !412, line: 122, type: !12)
!680 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !677, file: !412, line: 122, type: !55)
!681 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 3, scope: !677, file: !412, line: 122, type: !55)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !677, file: !412, line: 124, type: !55)
!683 = !DISubprogram(name: "descr_check", scope: !412, file: !412, line: 63, type: !684, isLocal: true, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyDescrObject*, %struct._object*, %struct._object**)* @descr_check, variables: !687)
!684 = !DISubroutineType(types: !685)
!685 = !{!61, !438, !55, !686}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!687 = !{!688, !689, !690}
!688 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !683, file: !412, line: 63, type: !438)
!689 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !683, file: !412, line: 63, type: !55)
!690 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pres", arg: 3, scope: !683, file: !412, line: 63, type: !686)
!691 = !DISubprogram(name: "classmethoddescr_call", scope: !412, file: !412, line: 257, type: !610, isLocal: true, isDefinition: true, scopeLine: 259, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyMethodDescrObject*, %struct._object*, %struct._object*)* @classmethoddescr_call, variables: !692)
!692 = !{!693, !694, !695, !696, !697, !698, !699, !700, !704, !706}
!693 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !691, file: !412, line: 257, type: !12)
!694 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !691, file: !412, line: 257, type: !55)
!695 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !691, file: !412, line: 258, type: !55)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "argc", scope: !691, file: !412, line: 260, type: !27)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !691, file: !412, line: 261, type: !55)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !691, file: !412, line: 261, type: !55)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !691, file: !412, line: 261, type: !55)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !701, file: !412, line: 300, type: !55)
!701 = distinct !DILexicalBlock(scope: !702, file: !412, line: 300, column: 12)
!702 = distinct !DILexicalBlock(scope: !703, file: !412, line: 299, column: 29)
!703 = distinct !DILexicalBlock(scope: !691, file: !412, line: 299, column: 9)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !705, file: !412, line: 304, type: !55)
!705 = distinct !DILexicalBlock(scope: !691, file: !412, line: 304, column: 8)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !707, file: !412, line: 305, type: !55)
!707 = distinct !DILexicalBlock(scope: !691, file: !412, line: 305, column: 8)
!708 = !DISubprogram(name: "classmethod_get", scope: !412, file: !412, line: 84, type: !610, isLocal: true, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyMethodDescrObject*, %struct._object*, %struct._object*)* @classmethod_get, variables: !709)
!709 = !{!710, !711, !712}
!710 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !708, file: !412, line: 84, type: !12)
!711 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !708, file: !412, line: 84, type: !55)
!712 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 3, scope: !708, file: !412, line: 84, type: !55)
!713 = !DISubprogram(name: "member_repr", scope: !412, file: !412, line: 42, type: !714, isLocal: true, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyMemberDescrObject*)* @member_repr, variables: !716)
!714 = !DISubroutineType(types: !715)
!715 = !{!55, !375}
!716 = !{!717}
!717 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !713, file: !412, line: 42, type: !375)
!718 = !DISubprogram(name: "member_get_doc", scope: !412, file: !412, line: 435, type: !719, isLocal: true, isDefinition: true, scopeLine: 436, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyMemberDescrObject*, i8*)* @member_get_doc, variables: !721)
!719 = !DISubroutineType(types: !720)
!720 = !{!55, !375, !107}
!721 = !{!722, !723}
!722 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !718, file: !412, line: 435, type: !375)
!723 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !718, file: !412, line: 435, type: !107)
!724 = !DISubprogram(name: "member_get", scope: !412, file: !412, line: 132, type: !725, isLocal: true, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyMemberDescrObject*, %struct._object*, %struct._object*)* @member_get, variables: !727)
!725 = !DISubroutineType(types: !726)
!726 = !{!55, !375, !55, !55}
!727 = !{!728, !729, !730, !731}
!728 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !724, file: !412, line: 132, type: !375)
!729 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !724, file: !412, line: 132, type: !55)
!730 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 3, scope: !724, file: !412, line: 132, type: !55)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !724, file: !412, line: 134, type: !55)
!732 = !DISubprogram(name: "member_set", scope: !412, file: !412, line: 186, type: !733, isLocal: true, isDefinition: true, scopeLine: 187, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyMemberDescrObject*, %struct._object*, %struct._object*)* @member_set, variables: !735)
!733 = !DISubroutineType(types: !734)
!734 = !{!61, !375, !55, !55}
!735 = !{!736, !737, !738, !739}
!736 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !732, file: !412, line: 186, type: !375)
!737 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !732, file: !412, line: 186, type: !55)
!738 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !732, file: !412, line: 186, type: !55)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !732, file: !412, line: 188, type: !61)
!740 = !DISubprogram(name: "descr_setcheck", scope: !412, file: !412, line: 168, type: !741, isLocal: true, isDefinition: true, scopeLine: 170, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyDescrObject*, %struct._object*, %struct._object*, i32*)* @descr_setcheck, variables: !744)
!741 = !DISubroutineType(types: !742)
!742 = !{!61, !438, !55, !55, !743}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!744 = !{!745, !746, !747, !748}
!745 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !740, file: !412, line: 168, type: !438)
!746 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !740, file: !412, line: 168, type: !55)
!747 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !740, file: !412, line: 168, type: !55)
!748 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pres", arg: 4, scope: !740, file: !412, line: 169, type: !743)
!749 = !DISubprogram(name: "getset_repr", scope: !412, file: !412, line: 49, type: !750, isLocal: true, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyGetSetDescrObject*)* @getset_repr, variables: !752)
!750 = !DISubroutineType(types: !751)
!751 = !{!55, !381}
!752 = !{!753}
!753 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !749, file: !412, line: 49, type: !381)
!754 = !DISubprogram(name: "getset_get_doc", scope: !412, file: !412, line: 451, type: !755, isLocal: true, isDefinition: true, scopeLine: 452, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyGetSetDescrObject*, i8*)* @getset_get_doc, variables: !757)
!755 = !DISubroutineType(types: !756)
!756 = !{!55, !381, !107}
!757 = !{!758, !759}
!758 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !754, file: !412, line: 451, type: !381)
!759 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !754, file: !412, line: 451, type: !107)
!760 = !DISubprogram(name: "getset_get", scope: !412, file: !412, line: 142, type: !761, isLocal: true, isDefinition: true, scopeLine: 143, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyGetSetDescrObject*, %struct._object*, %struct._object*)* @getset_get, variables: !763)
!761 = !DISubroutineType(types: !762)
!762 = !{!55, !381, !55, !55}
!763 = !{!764, !765, !766, !767}
!764 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !760, file: !412, line: 142, type: !381)
!765 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !760, file: !412, line: 142, type: !55)
!766 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 3, scope: !760, file: !412, line: 142, type: !55)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !760, file: !412, line: 144, type: !55)
!768 = !DISubprogram(name: "getset_set", scope: !412, file: !412, line: 196, type: !769, isLocal: true, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyGetSetDescrObject*, %struct._object*, %struct._object*)* @getset_set, variables: !771)
!769 = !DISubroutineType(types: !770)
!770 = !{!61, !381, !55, !55}
!771 = !{!772, !773, !774, !775}
!772 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !768, file: !412, line: 196, type: !381)
!773 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !768, file: !412, line: 196, type: !55)
!774 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !768, file: !412, line: 196, type: !55)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !768, file: !412, line: 198, type: !61)
!776 = !DISubprogram(name: "wrapperdescr_repr", scope: !412, file: !412, line: 56, type: !777, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyWrapperDescrObject*)* @wrapperdescr_repr, variables: !779)
!777 = !DISubroutineType(types: !778)
!778 = !{!55, !389}
!779 = !{!780}
!780 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !776, file: !412, line: 56, type: !389)
!781 = !DISubprogram(name: "wrapperdescr_call", scope: !412, file: !412, line: 310, type: !782, isLocal: true, isDefinition: true, scopeLine: 311, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyWrapperDescrObject*, %struct._object*, %struct._object*)* @wrapperdescr_call, variables: !784)
!782 = !DISubroutineType(types: !783)
!783 = !{!55, !389, !55, !55}
!784 = !{!785, !786, !787, !788, !789, !790, !791, !792, !796, !798}
!785 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !781, file: !412, line: 310, type: !389)
!786 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !781, file: !412, line: 310, type: !55)
!787 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !781, file: !412, line: 310, type: !55)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "argc", scope: !781, file: !412, line: 312, type: !27)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !781, file: !412, line: 313, type: !55)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "func", scope: !781, file: !412, line: 313, type: !55)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !781, file: !412, line: 313, type: !55)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !793, file: !412, line: 344, type: !55)
!793 = distinct !DILexicalBlock(scope: !794, file: !412, line: 344, column: 12)
!794 = distinct !DILexicalBlock(scope: !795, file: !412, line: 343, column: 29)
!795 = distinct !DILexicalBlock(scope: !781, file: !412, line: 343, column: 9)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !797, file: !412, line: 348, type: !55)
!797 = distinct !DILexicalBlock(scope: !781, file: !412, line: 348, column: 8)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !799, file: !412, line: 349, type: !55)
!799 = distinct !DILexicalBlock(scope: !781, file: !412, line: 349, column: 8)
!800 = !DISubprogram(name: "wrapperdescr_get_doc", scope: !412, file: !412, line: 467, type: !801, isLocal: true, isDefinition: true, scopeLine: 468, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyWrapperDescrObject*, i8*)* @wrapperdescr_get_doc, variables: !803)
!801 = !DISubroutineType(types: !802)
!802 = !{!55, !389, !107}
!803 = !{!804, !805}
!804 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !800, file: !412, line: 467, type: !389)
!805 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !800, file: !412, line: 467, type: !107)
!806 = !DISubprogram(name: "wrapperdescr_get_text_signature", scope: !412, file: !412, line: 473, type: !801, isLocal: true, isDefinition: true, scopeLine: 474, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyWrapperDescrObject*, i8*)* @wrapperdescr_get_text_signature, variables: !807)
!807 = !{!808, !809}
!808 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !806, file: !412, line: 473, type: !389)
!809 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !806, file: !412, line: 473, type: !107)
!810 = !DISubprogram(name: "wrapperdescr_get", scope: !412, file: !412, line: 158, type: !782, isLocal: true, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyWrapperDescrObject*, %struct._object*, %struct._object*)* @wrapperdescr_get, variables: !811)
!811 = !{!812, !813, !814, !815}
!812 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descr", arg: 1, scope: !810, file: !412, line: 158, type: !389)
!813 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !810, file: !412, line: 158, type: !55)
!814 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 3, scope: !810, file: !412, line: 158, type: !55)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !810, file: !412, line: 160, type: !55)
!816 = !DISubprogram(name: "descr_new", scope: !412, file: !412, line: 680, type: !817, isLocal: true, isDefinition: true, scopeLine: 681, flags: DIFlagPrototyped, isOptimized: true, function: %struct.PyDescrObject* (%struct._typeobject*, %struct._typeobject*, i8*)* @descr_new, variables: !819)
!817 = !DISubroutineType(types: !818)
!818 = !{!438, !368, !368, !45}
!819 = !{!820, !821, !822, !823, !824, !828}
!820 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descrtype", arg: 1, scope: !816, file: !412, line: 680, type: !368)
!821 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 2, scope: !816, file: !412, line: 680, type: !368)
!822 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 3, scope: !816, file: !412, line: 680, type: !45)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "descr", scope: !816, file: !412, line: 682, type: !438)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !825, file: !412, line: 686, type: !55)
!825 = distinct !DILexicalBlock(scope: !826, file: !412, line: 686, column: 12)
!826 = distinct !DILexicalBlock(scope: !827, file: !412, line: 685, column: 30)
!827 = distinct !DILexicalBlock(scope: !816, file: !412, line: 685, column: 9)
!828 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !829, file: !412, line: 690, type: !55)
!829 = distinct !DILexicalBlock(scope: !830, file: !412, line: 690, column: 16)
!830 = distinct !DILexicalBlock(scope: !831, file: !412, line: 689, column: 42)
!831 = distinct !DILexicalBlock(scope: !826, file: !412, line: 689, column: 13)
!832 = !DISubprogram(name: "mappingproxy_dealloc", scope: !412, file: !412, line: 871, type: !833, isLocal: true, isDefinition: true, scopeLine: 872, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.mappingproxyobject*)* @mappingproxy_dealloc, variables: !835)
!833 = !DISubroutineType(types: !834)
!834 = !{null, !410}
!835 = !{!836, !837, !839}
!836 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pp", arg: 1, scope: !832, file: !412, line: 871, type: !410)
!837 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !838, file: !412, line: 873, type: !417)
!838 = distinct !DILexicalBlock(scope: !832, file: !412, line: 873, column: 8)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !840, file: !412, line: 874, type: !55)
!840 = distinct !DILexicalBlock(scope: !832, file: !412, line: 874, column: 8)
!841 = !DISubprogram(name: "mappingproxy_repr", scope: !412, file: !412, line: 891, type: !842, isLocal: true, isDefinition: true, scopeLine: 892, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mappingproxyobject*)* @mappingproxy_repr, variables: !844)
!842 = !DISubroutineType(types: !843)
!843 = !{!55, !410}
!844 = !{!845}
!845 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pp", arg: 1, scope: !841, file: !412, line: 891, type: !410)
!846 = !DISubprogram(name: "mappingproxy_contains", scope: !412, file: !412, line: 792, type: !847, isLocal: true, isDefinition: true, scopeLine: 793, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.mappingproxyobject*, %struct._object*)* @mappingproxy_contains, variables: !849)
!847 = !DISubroutineType(types: !848)
!848 = !{!61, !410, !55}
!849 = !{!850, !851}
!850 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pp", arg: 1, scope: !846, file: !412, line: 792, type: !410)
!851 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !846, file: !412, line: 792, type: !55)
!852 = !DISubprogram(name: "mappingproxy_len", scope: !412, file: !412, line: 774, type: !853, isLocal: true, isDefinition: true, scopeLine: 775, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.mappingproxyobject*)* @mappingproxy_len, variables: !855)
!853 = !DISubroutineType(types: !854)
!854 = !{!27, !410}
!855 = !{!856}
!856 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pp", arg: 1, scope: !852, file: !412, line: 774, type: !410)
!857 = !DISubprogram(name: "mappingproxy_getitem", scope: !412, file: !412, line: 780, type: !858, isLocal: true, isDefinition: true, scopeLine: 781, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mappingproxyobject*, %struct._object*)* @mappingproxy_getitem, variables: !860)
!858 = !DISubroutineType(types: !859)
!859 = !{!55, !410, !55}
!860 = !{!861, !862}
!861 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pp", arg: 1, scope: !857, file: !412, line: 780, type: !410)
!862 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !857, file: !412, line: 780, type: !55)
!863 = !DISubprogram(name: "mappingproxy_str", scope: !412, file: !412, line: 885, type: !842, isLocal: true, isDefinition: true, scopeLine: 886, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mappingproxyobject*)* @mappingproxy_str, variables: !864)
!864 = !{!865}
!865 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pp", arg: 1, scope: !863, file: !412, line: 885, type: !410)
!866 = !DISubprogram(name: "mappingproxy_traverse", scope: !412, file: !412, line: 897, type: !279, isLocal: true, isDefinition: true, scopeLine: 898, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)* @mappingproxy_traverse, variables: !867)
!867 = !{!868, !869, !870, !871, !872}
!868 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !866, file: !412, line: 897, type: !55)
!869 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !866, file: !412, line: 897, type: !281)
!870 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !866, file: !412, line: 897, type: !107)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pp", scope: !866, file: !412, line: 899, type: !410)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !873, file: !412, line: 900, type: !61)
!873 = distinct !DILexicalBlock(scope: !874, file: !412, line: 900, column: 27)
!874 = distinct !DILexicalBlock(scope: !875, file: !412, line: 900, column: 14)
!875 = distinct !DILexicalBlock(scope: !866, file: !412, line: 900, column: 8)
!876 = !DISubprogram(name: "mappingproxy_richcompare", scope: !412, file: !412, line: 905, type: !877, isLocal: true, isDefinition: true, scopeLine: 906, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mappingproxyobject*, %struct._object*, i32)* @mappingproxy_richcompare, variables: !879)
!877 = !DISubroutineType(types: !878)
!878 = !{!55, !410, !55, !61}
!879 = !{!880, !881, !882}
!880 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !876, file: !412, line: 905, type: !410)
!881 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !876, file: !412, line: 905, type: !55)
!882 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !876, file: !412, line: 905, type: !61)
!883 = !DISubprogram(name: "mappingproxy_getiter", scope: !412, file: !412, line: 879, type: !842, isLocal: true, isDefinition: true, scopeLine: 880, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mappingproxyobject*)* @mappingproxy_getiter, variables: !884)
!884 = !{!885}
!885 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pp", arg: 1, scope: !883, file: !412, line: 879, type: !410)
!886 = !DISubprogram(name: "mappingproxy_get", scope: !412, file: !412, line: 814, type: !858, isLocal: true, isDefinition: true, scopeLine: 815, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mappingproxyobject*, %struct._object*)* @mappingproxy_get, variables: !887)
!887 = !{!888, !889, !890, !891}
!888 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pp", arg: 1, scope: !886, file: !412, line: 814, type: !410)
!889 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !886, file: !412, line: 814, type: !55)
!890 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !886, file: !412, line: 816, type: !55)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "def", scope: !886, file: !412, line: 816, type: !55)
!892 = !DISubprogram(name: "mappingproxy_keys", scope: !412, file: !412, line: 825, type: !842, isLocal: true, isDefinition: true, scopeLine: 826, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mappingproxyobject*)* @mappingproxy_keys, variables: !893)
!893 = !{!894}
!894 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pp", arg: 1, scope: !892, file: !412, line: 825, type: !410)
!895 = !DISubprogram(name: "mappingproxy_values", scope: !412, file: !412, line: 832, type: !842, isLocal: true, isDefinition: true, scopeLine: 833, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mappingproxyobject*)* @mappingproxy_values, variables: !896)
!896 = !{!897}
!897 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pp", arg: 1, scope: !895, file: !412, line: 832, type: !410)
!898 = !DISubprogram(name: "mappingproxy_items", scope: !412, file: !412, line: 839, type: !842, isLocal: true, isDefinition: true, scopeLine: 840, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.mappingproxyobject*)* @mappingproxy_items, variables: !899)
!899 = !{!900}
!900 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pp", arg: 1, scope: !898, file: !412, line: 839, type: !410)
