; ModuleID = 'programs_new/Python-new/dictobject.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyDictObject = type { %struct._object, i64, %struct._dictkeysobject*, %struct._object** }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !582, globals: !1994)
!1 = !DIFile(filename: "dictobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !11}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !4, line: 23, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!7 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!8 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!9 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!10 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !12, line: 451, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!15 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!16 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!17 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!18 = !{!19, !20, !59, !391, !115, !405, !423, !481, !482, !490, !65, !31, !386, !498, !513, !530, !539, !73, !540, !550, !556}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictObject", file: !22, line: 28, baseType: !23)
!22 = !DIFile(filename: "Include/dictobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!23 = !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 23, size: 320, align: 64, elements: !24)
!24 = !{!25, !364, !365, !390}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !23, file: !22, line: 24, baseType: !26, size: 128, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !27, line: 109, baseType: !28)
!27 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !27, line: 105, size: 128, align: 64, elements: !29)
!29 = !{!30, !38}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !28, file: !27, line: 107, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !32, line: 177, baseType: !33)
!32 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !34, line: 102, baseType: !35)
!34 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !36, line: 181, baseType: !37)
!36 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!37 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !28, file: !27, line: 108, baseType: !39, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !27, line: 334, size: 3200, align: 64, elements: !41)
!41 = !{!42, !48, !52, !53, !54, !60, !123, !128, !133, !134, !139, !191, !222, !234, !240, !241, !242, !244, !246, !277, !278, !279, !288, !289, !294, !295, !297, !299, !309, !312, !330, !331, !332, !334, !336, !337, !339, !344, !349, !354, !355, !356, !357, !358, !359, !360, !361, !363}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !40, file: !27, line: 335, baseType: !43, size: 192, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !27, line: 114, baseType: !44)
!44 = !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 111, size: 192, align: 64, elements: !45)
!45 = !{!46, !47}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !44, file: !27, line: 112, baseType: !26, size: 128, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !44, file: !27, line: 113, baseType: !31, size: 64, align: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !40, file: !27, line: 336, baseType: !49, size: 64, align: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!51 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !40, file: !27, line: 337, baseType: !31, size: 64, align: 64, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !40, file: !27, line: 337, baseType: !31, size: 64, align: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !40, file: !27, line: 341, baseType: !55, size: 64, align: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !27, line: 308, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !40, file: !27, line: 342, baseType: !61, size: 64, align: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !27, line: 314, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !59, !66, !65}
!65 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !34, line: 48, baseType: !68)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !69, line: 246, size: 1728, align: 64, elements: !70)
!69 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!70 = !{!71, !72, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !92, !93, !94, !95, !97, !99, !101, !105, !108, !110, !111, !112, !113, !114, !118, !119}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !68, file: !69, line: 247, baseType: !65, size: 32, align: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !68, file: !69, line: 252, baseType: !73, size: 64, align: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !68, file: !69, line: 253, baseType: !73, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !68, file: !69, line: 254, baseType: !73, size: 64, align: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !68, file: !69, line: 255, baseType: !73, size: 64, align: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !68, file: !69, line: 256, baseType: !73, size: 64, align: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !68, file: !69, line: 257, baseType: !73, size: 64, align: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !68, file: !69, line: 258, baseType: !73, size: 64, align: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !68, file: !69, line: 259, baseType: !73, size: 64, align: 64, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !68, file: !69, line: 261, baseType: !73, size: 64, align: 64, offset: 576)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !68, file: !69, line: 262, baseType: !73, size: 64, align: 64, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !68, file: !69, line: 263, baseType: !73, size: 64, align: 64, offset: 704)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !68, file: !69, line: 265, baseType: !85, size: 64, align: 64, offset: 768)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !69, line: 161, size: 192, align: 64, elements: !87)
!87 = !{!88, !89, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !86, file: !69, line: 162, baseType: !85, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !86, file: !69, line: 163, baseType: !90, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !86, file: !69, line: 167, baseType: !65, size: 32, align: 32, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !68, file: !69, line: 267, baseType: !90, size: 64, align: 64, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !68, file: !69, line: 269, baseType: !65, size: 32, align: 32, offset: 896)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !68, file: !69, line: 273, baseType: !65, size: 32, align: 32, offset: 928)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !68, file: !69, line: 275, baseType: !96, size: 64, align: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !36, line: 140, baseType: !37)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !68, file: !69, line: 279, baseType: !98, size: 16, align: 16, offset: 1024)
!98 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !68, file: !69, line: 280, baseType: !100, size: 8, align: 8, offset: 1040)
!100 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !68, file: !69, line: 281, baseType: !102, size: 8, align: 8, offset: 1048)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 8, align: 8, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 1)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !68, file: !69, line: 285, baseType: !106, size: 64, align: 64, offset: 1088)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !69, line: 155, baseType: null)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !68, file: !69, line: 294, baseType: !109, size: 64, align: 64, offset: 1152)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !36, line: 141, baseType: !37)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !68, file: !69, line: 303, baseType: !19, size: 64, align: 64, offset: 1216)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !68, file: !69, line: 304, baseType: !19, size: 64, align: 64, offset: 1280)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !68, file: !69, line: 305, baseType: !19, size: 64, align: 64, offset: 1344)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !68, file: !69, line: 306, baseType: !19, size: 64, align: 64, offset: 1408)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !68, file: !69, line: 307, baseType: !115, size: 64, align: 64, offset: 1472)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !116, line: 62, baseType: !117)
!116 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!117 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !68, file: !69, line: 309, baseType: !65, size: 32, align: 32, offset: 1536)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !68, file: !69, line: 311, baseType: !120, size: 160, align: 8, offset: 1568)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 160, align: 8, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 20)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !40, file: !27, line: 343, baseType: !124, size: 64, align: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !27, line: 316, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!59, !59, !73}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !40, file: !27, line: 344, baseType: !129, size: 64, align: 64, offset: 576)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !27, line: 318, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!65, !59, !73, !59}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !40, file: !27, line: 345, baseType: !19, size: 64, align: 64, offset: 640)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !40, file: !27, line: 346, baseType: !135, size: 64, align: 64, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !27, line: 320, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!59, !59}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !40, file: !27, line: 350, baseType: !140, size: 64, align: 64, offset: 768)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !27, line: 278, baseType: !142)
!142 = !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 236, size: 2176, align: 64, elements: !143)
!143 = !{!144, !149, !150, !151, !152, !153, !158, !160, !161, !162, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !142, file: !27, line: 241, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !27, line: 166, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!59, !59, !59}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !142, file: !27, line: 242, baseType: !145, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !142, file: !27, line: 243, baseType: !145, size: 64, align: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !142, file: !27, line: 244, baseType: !145, size: 64, align: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !142, file: !27, line: 245, baseType: !145, size: 64, align: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !142, file: !27, line: 246, baseType: !154, size: 64, align: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !27, line: 167, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!59, !59, !59, !59}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !142, file: !27, line: 247, baseType: !159, size: 64, align: 64, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !27, line: 165, baseType: !136)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !142, file: !27, line: 248, baseType: !159, size: 64, align: 64, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !142, file: !27, line: 249, baseType: !159, size: 64, align: 64, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !142, file: !27, line: 250, baseType: !163, size: 64, align: 64, offset: 576)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !27, line: 168, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!65, !59}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !142, file: !27, line: 251, baseType: !159, size: 64, align: 64, offset: 640)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !142, file: !27, line: 252, baseType: !145, size: 64, align: 64, offset: 704)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !142, file: !27, line: 253, baseType: !145, size: 64, align: 64, offset: 768)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !142, file: !27, line: 254, baseType: !145, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !142, file: !27, line: 255, baseType: !145, size: 64, align: 64, offset: 896)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !142, file: !27, line: 256, baseType: !145, size: 64, align: 64, offset: 960)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !142, file: !27, line: 257, baseType: !159, size: 64, align: 64, offset: 1024)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !142, file: !27, line: 258, baseType: !19, size: 64, align: 64, offset: 1088)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !142, file: !27, line: 259, baseType: !159, size: 64, align: 64, offset: 1152)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !142, file: !27, line: 261, baseType: !145, size: 64, align: 64, offset: 1216)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !142, file: !27, line: 262, baseType: !145, size: 64, align: 64, offset: 1280)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !142, file: !27, line: 263, baseType: !145, size: 64, align: 64, offset: 1344)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !142, file: !27, line: 264, baseType: !145, size: 64, align: 64, offset: 1408)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !142, file: !27, line: 265, baseType: !154, size: 64, align: 64, offset: 1472)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !142, file: !27, line: 266, baseType: !145, size: 64, align: 64, offset: 1536)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !142, file: !27, line: 267, baseType: !145, size: 64, align: 64, offset: 1600)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !142, file: !27, line: 268, baseType: !145, size: 64, align: 64, offset: 1664)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !142, file: !27, line: 269, baseType: !145, size: 64, align: 64, offset: 1728)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !142, file: !27, line: 270, baseType: !145, size: 64, align: 64, offset: 1792)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !142, file: !27, line: 272, baseType: !145, size: 64, align: 64, offset: 1856)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !142, file: !27, line: 273, baseType: !145, size: 64, align: 64, offset: 1920)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !142, file: !27, line: 274, baseType: !145, size: 64, align: 64, offset: 1984)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !142, file: !27, line: 275, baseType: !145, size: 64, align: 64, offset: 2048)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !142, file: !27, line: 277, baseType: !159, size: 64, align: 64, offset: 2112)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !40, file: !27, line: 351, baseType: !192, size: 64, align: 64, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !27, line: 292, baseType: !194)
!194 = !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 280, size: 640, align: 64, elements: !195)
!195 = !{!196, !201, !202, !207, !208, !209, !214, !215, !220, !221}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !194, file: !27, line: 281, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !27, line: 169, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!31, !59}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !194, file: !27, line: 282, baseType: !145, size: 64, align: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !194, file: !27, line: 283, baseType: !203, size: 64, align: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !27, line: 170, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!59, !59, !31}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !194, file: !27, line: 284, baseType: !203, size: 64, align: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !194, file: !27, line: 285, baseType: !19, size: 64, align: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !194, file: !27, line: 286, baseType: !210, size: 64, align: 64, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !27, line: 172, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!65, !59, !31, !59}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !194, file: !27, line: 287, baseType: !19, size: 64, align: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !194, file: !27, line: 288, baseType: !216, size: 64, align: 64, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !27, line: 231, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!65, !59, !59}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !194, file: !27, line: 290, baseType: !145, size: 64, align: 64, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !194, file: !27, line: 291, baseType: !203, size: 64, align: 64, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !40, file: !27, line: 352, baseType: !223, size: 64, align: 64, offset: 896)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !27, line: 298, baseType: !225)
!225 = !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 294, size: 192, align: 64, elements: !226)
!226 = !{!227, !228, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !225, file: !27, line: 295, baseType: !197, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !225, file: !27, line: 296, baseType: !145, size: 64, align: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !225, file: !27, line: 297, baseType: !230, size: 64, align: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !27, line: 174, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!65, !59, !59, !59}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !40, file: !27, line: 356, baseType: !235, size: 64, align: 64, offset: 960)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !27, line: 321, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!239, !59}
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !32, line: 186, baseType: !31)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !40, file: !27, line: 357, baseType: !154, size: 64, align: 64, offset: 1024)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !40, file: !27, line: 358, baseType: !135, size: 64, align: 64, offset: 1088)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !40, file: !27, line: 359, baseType: !243, size: 64, align: 64, offset: 1152)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !27, line: 317, baseType: !146)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !40, file: !27, line: 360, baseType: !245, size: 64, align: 64, offset: 1216)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !27, line: 319, baseType: !231)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !40, file: !27, line: 363, baseType: !247, size: 64, align: 64, offset: 1280)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !27, line: 304, baseType: !249)
!249 = !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 301, size: 128, align: 64, elements: !250)
!250 = !{!251, !272}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !249, file: !27, line: 302, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !27, line: 193, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!65, !59, !256, !65}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !27, line: 191, baseType: !258)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !27, line: 178, size: 640, align: 64, elements: !259)
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !269, !270, !271}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !258, file: !27, line: 179, baseType: !19, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !258, file: !27, line: 180, baseType: !59, size: 64, align: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !258, file: !27, line: 181, baseType: !31, size: 64, align: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !258, file: !27, line: 182, baseType: !31, size: 64, align: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !258, file: !27, line: 184, baseType: !65, size: 32, align: 32, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !258, file: !27, line: 185, baseType: !65, size: 32, align: 32, offset: 288)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !258, file: !27, line: 186, baseType: !73, size: 64, align: 64, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !258, file: !27, line: 187, baseType: !268, size: 64, align: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !258, file: !27, line: 188, baseType: !268, size: 64, align: 64, offset: 448)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !258, file: !27, line: 189, baseType: !268, size: 64, align: 64, offset: 512)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !258, file: !27, line: 190, baseType: !19, size: 64, align: 64, offset: 576)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !249, file: !27, line: 303, baseType: !273, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !27, line: 194, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !59, !256}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !40, file: !27, line: 366, baseType: !117, size: 64, align: 64, offset: 1344)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !40, file: !27, line: 368, baseType: !49, size: 64, align: 64, offset: 1408)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !40, file: !27, line: 372, baseType: !280, size: 64, align: 64, offset: 1472)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !27, line: 233, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!65, !59, !284, !19}
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !27, line: 232, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!65, !59, !19}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !40, file: !27, line: 375, baseType: !163, size: 64, align: 64, offset: 1536)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !40, file: !27, line: 379, baseType: !290, size: 64, align: 64, offset: 1600)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !27, line: 322, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!59, !59, !59, !65}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !40, file: !27, line: 382, baseType: !31, size: 64, align: 64, offset: 1664)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !40, file: !27, line: 385, baseType: !296, size: 64, align: 64, offset: 1728)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !27, line: 323, baseType: !136)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !40, file: !27, line: 386, baseType: !298, size: 64, align: 64, offset: 1792)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !27, line: 324, baseType: !136)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !40, file: !27, line: 389, baseType: !300, size: 64, align: 64, offset: 1856)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !302, line: 40, size: 256, align: 64, elements: !303)
!302 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!303 = !{!304, !305, !307, !308}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !301, file: !302, line: 41, baseType: !49, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !301, file: !302, line: 42, baseType: !306, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !302, line: 18, baseType: !146)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !301, file: !302, line: 43, baseType: !65, size: 32, align: 32, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !301, file: !302, line: 45, baseType: !49, size: 64, align: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !40, file: !27, line: 390, baseType: !310, size: 64, align: 64, offset: 1920)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !27, line: 390, flags: DIFlagFwdDecl)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !40, file: !27, line: 391, baseType: !313, size: 64, align: 64, offset: 1984)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !315, line: 11, size: 320, align: 64, elements: !316)
!315 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!316 = !{!317, !318, !323, !328, !329}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !314, file: !315, line: 12, baseType: !73, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !314, file: !315, line: 13, baseType: !319, size: 64, align: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !315, line: 8, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!59, !59, !19}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !314, file: !315, line: 14, baseType: !324, size: 64, align: 64, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !315, line: 9, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!65, !59, !59, !19}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !314, file: !315, line: 15, baseType: !73, size: 64, align: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !314, file: !315, line: 16, baseType: !19, size: 64, align: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !40, file: !27, line: 392, baseType: !39, size: 64, align: 64, offset: 2048)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !40, file: !27, line: 393, baseType: !59, size: 64, align: 64, offset: 2112)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !40, file: !27, line: 394, baseType: !333, size: 64, align: 64, offset: 2176)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !27, line: 325, baseType: !155)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !40, file: !27, line: 395, baseType: !335, size: 64, align: 64, offset: 2240)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !27, line: 326, baseType: !231)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !40, file: !27, line: 396, baseType: !31, size: 64, align: 64, offset: 2304)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !40, file: !27, line: 397, baseType: !338, size: 64, align: 64, offset: 2368)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !27, line: 327, baseType: !231)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !40, file: !27, line: 398, baseType: !340, size: 64, align: 64, offset: 2432)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !27, line: 329, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64, align: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!59, !39, !31}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !40, file: !27, line: 399, baseType: !345, size: 64, align: 64, offset: 2496)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !27, line: 328, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64, align: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!59, !39, !59, !59}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !40, file: !27, line: 400, baseType: !350, size: 64, align: 64, offset: 2560)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !27, line: 307, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !19}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !40, file: !27, line: 401, baseType: !163, size: 64, align: 64, offset: 2624)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !40, file: !27, line: 402, baseType: !59, size: 64, align: 64, offset: 2688)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !40, file: !27, line: 403, baseType: !59, size: 64, align: 64, offset: 2752)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !40, file: !27, line: 404, baseType: !59, size: 64, align: 64, offset: 2816)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !40, file: !27, line: 405, baseType: !59, size: 64, align: 64, offset: 2880)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !40, file: !27, line: 406, baseType: !59, size: 64, align: 64, offset: 2944)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !40, file: !27, line: 407, baseType: !55, size: 64, align: 64, offset: 3008)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !40, file: !27, line: 410, baseType: !362, size: 32, align: 32, offset: 3072)
!362 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !40, file: !27, line: 412, baseType: !55, size: 64, align: 64, offset: 3136)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ma_used", scope: !23, file: !22, line: 25, baseType: !31, size: 64, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ma_keys", scope: !23, file: !22, line: 26, baseType: !366, size: 64, align: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictKeysObject", file: !22, line: 18, baseType: !368)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "_dictkeysobject", file: !369, line: 87, size: 448, align: 64, elements: !370)
!369 = !DIFile(filename: "Objects/dictobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!370 = !{!371, !372, !373, !387, !388}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "dk_refcnt", scope: !368, file: !369, line: 88, baseType: !31, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dk_size", scope: !368, file: !369, line: 89, baseType: !31, size: 64, align: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "dk_lookup", scope: !368, file: !369, line: 90, baseType: !374, size: 64, align: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "dict_lookup_func", file: !369, line: 84, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!378, !20, !59, !239, !385}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyDictKeyEntry", file: !369, line: 82, baseType: !380)
!380 = !DICompositeType(tag: DW_TAG_structure_type, file: !369, line: 77, size: 192, align: 64, elements: !381)
!381 = !{!382, !383, !384}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "me_hash", scope: !380, file: !369, line: 79, baseType: !239, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "me_key", scope: !380, file: !369, line: 80, baseType: !59, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "me_value", scope: !380, file: !369, line: 81, baseType: !59, size: 64, align: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "dk_usable", scope: !368, file: !369, line: 91, baseType: !31, size: 64, align: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "dk_entries", scope: !368, file: !369, line: 92, baseType: !389, size: 192, align: 64, offset: 256)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 192, align: 64, elements: !103)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ma_values", scope: !23, file: !22, line: 27, baseType: !386, size: 64, align: 64, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !393, line: 253, baseType: !394)
!393 = !DIFile(filename: "Include/objimpl.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!394 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !393, line: 246, size: 192, align: 64, elements: !395)
!395 = !{!396, !403}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !394, file: !393, line: 251, baseType: !397, size: 192, align: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, scope: !394, file: !393, line: 247, size: 192, align: 64, elements: !398)
!398 = !{!399, !401, !402}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !397, file: !393, line: 248, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !397, file: !393, line: 249, baseType: !400, size: 64, align: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !397, file: !393, line: 250, baseType: !31, size: 64, align: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !394, file: !393, line: 252, baseType: !404, size: 64, align: 64)
!404 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !12, line: 351, baseType: !407)
!407 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 217, size: 384, align: 64, elements: !408)
!408 = !{!409, !410, !411, !412, !420}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !407, file: !12, line: 291, baseType: !26, size: 128, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !407, file: !12, line: 292, baseType: !31, size: 64, align: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !407, file: !12, line: 293, baseType: !239, size: 64, align: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !407, file: !12, line: 349, baseType: !413, size: 32, align: 32, offset: 256)
!413 = !DICompositeType(tag: DW_TAG_structure_type, scope: !407, file: !12, line: 294, size: 32, align: 32, elements: !414)
!414 = !{!415, !416, !417, !418, !419}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !413, file: !12, line: 303, baseType: !362, size: 2, align: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !413, file: !12, line: 331, baseType: !362, size: 3, align: 32, offset: 2)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !413, file: !12, line: 336, baseType: !362, size: 1, align: 32, offset: 5)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !413, file: !12, line: 340, baseType: !362, size: 1, align: 32, offset: 6)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !413, file: !12, line: 345, baseType: !362, size: 1, align: 32, offset: 7)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !407, file: !12, line: 350, baseType: !421, size: 64, align: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !116, line: 90, baseType: !65)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !425, line: 139, baseType: !426)
!425 = !DIFile(filename: "Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !425, line: 69, size: 1536, align: 64, elements: !427)
!427 = !{!428, !430, !431, !451, !454, !455, !456, !457, !458, !459, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !426, file: !425, line: 72, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !426, file: !425, line: 73, baseType: !429, size: 64, align: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !426, file: !425, line: 74, baseType: !432, size: 64, align: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !425, line: 44, baseType: !434)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !425, line: 19, size: 832, align: 64, elements: !435)
!435 = !{!436, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !434, file: !425, line: 21, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !434, file: !425, line: 22, baseType: !429, size: 64, align: 64, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !434, file: !425, line: 24, baseType: !59, size: 64, align: 64, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !434, file: !425, line: 25, baseType: !59, size: 64, align: 64, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !434, file: !425, line: 26, baseType: !59, size: 64, align: 64, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !434, file: !425, line: 27, baseType: !59, size: 64, align: 64, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !434, file: !425, line: 28, baseType: !59, size: 64, align: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !434, file: !425, line: 30, baseType: !59, size: 64, align: 64, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !434, file: !425, line: 31, baseType: !59, size: 64, align: 64, offset: 512)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !434, file: !425, line: 32, baseType: !59, size: 64, align: 64, offset: 576)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !434, file: !425, line: 33, baseType: !65, size: 32, align: 32, offset: 640)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !434, file: !425, line: 34, baseType: !65, size: 32, align: 32, offset: 672)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !434, file: !425, line: 37, baseType: !65, size: 32, align: 32, offset: 704)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !434, file: !425, line: 43, baseType: !59, size: 64, align: 64, offset: 768)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !426, file: !425, line: 76, baseType: !452, size: 64, align: 64, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, align: 64)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !425, line: 50, flags: DIFlagFwdDecl)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !426, file: !425, line: 77, baseType: !65, size: 32, align: 32, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !426, file: !425, line: 78, baseType: !51, size: 8, align: 8, offset: 288)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !426, file: !425, line: 80, baseType: !51, size: 8, align: 8, offset: 296)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !426, file: !425, line: 85, baseType: !65, size: 32, align: 32, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !426, file: !425, line: 86, baseType: !65, size: 32, align: 32, offset: 352)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !426, file: !425, line: 88, baseType: !460, size: 64, align: 64, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !425, line: 54, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!65, !59, !452, !65, !59}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !426, file: !425, line: 89, baseType: !460, size: 64, align: 64, offset: 448)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !426, file: !425, line: 90, baseType: !59, size: 64, align: 64, offset: 512)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !426, file: !425, line: 91, baseType: !59, size: 64, align: 64, offset: 576)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !426, file: !425, line: 93, baseType: !59, size: 64, align: 64, offset: 640)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !426, file: !425, line: 94, baseType: !59, size: 64, align: 64, offset: 704)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !426, file: !425, line: 95, baseType: !59, size: 64, align: 64, offset: 768)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !426, file: !425, line: 97, baseType: !59, size: 64, align: 64, offset: 832)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !426, file: !425, line: 98, baseType: !59, size: 64, align: 64, offset: 896)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !426, file: !425, line: 99, baseType: !59, size: 64, align: 64, offset: 960)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !426, file: !425, line: 101, baseType: !59, size: 64, align: 64, offset: 1024)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !426, file: !425, line: 103, baseType: !65, size: 32, align: 32, offset: 1088)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !426, file: !425, line: 105, baseType: !59, size: 64, align: 64, offset: 1152)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !426, file: !425, line: 106, baseType: !37, size: 64, align: 64, offset: 1216)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !426, file: !425, line: 108, baseType: !65, size: 32, align: 32, offset: 1280)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !426, file: !425, line: 109, baseType: !59, size: 64, align: 64, offset: 1344)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !426, file: !425, line: 134, baseType: !351, size: 64, align: 64, offset: 1408)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !426, file: !425, line: 135, baseType: !19, size: 64, align: 64, offset: 1472)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !484, line: 40, baseType: !485)
!484 = !DIFile(filename: "Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!485 = !DICompositeType(tag: DW_TAG_structure_type, file: !484, line: 23, size: 320, align: 64, elements: !486)
!486 = !{!487, !488, !489}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !485, file: !484, line: 24, baseType: !43, size: 192, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !485, file: !484, line: 26, baseType: !386, size: 64, align: 64, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !485, file: !484, line: 39, baseType: !31, size: 64, align: 64, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !492, line: 33, baseType: !493)
!492 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!493 = !DICompositeType(tag: DW_TAG_structure_type, file: !492, line: 25, size: 256, align: 64, elements: !494)
!494 = !{!495, !496}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !493, file: !492, line: 26, baseType: !43, size: 192, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !493, file: !492, line: 27, baseType: !497, size: 64, align: 64, offset: 192)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 64, align: 64, elements: !103)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyHeapTypeObject", file: !27, line: 463, baseType: !500)
!500 = !DICompositeType(tag: DW_TAG_structure_type, name: "_heaptypeobject", file: !27, line: 448, size: 6592, align: 64, elements: !501)
!501 = !{!502, !504, !505, !506, !507, !508, !509, !510, !511}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ht_type", scope: !500, file: !27, line: 451, baseType: !503, size: 3200, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !27, line: 422, baseType: !40)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "as_number", scope: !500, file: !27, line: 452, baseType: !141, size: 2176, align: 64, offset: 3200)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "as_mapping", scope: !500, file: !27, line: 453, baseType: !224, size: 192, align: 64, offset: 5376)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "as_sequence", scope: !500, file: !27, line: 454, baseType: !193, size: 640, align: 64, offset: 5568)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "as_buffer", scope: !500, file: !27, line: 459, baseType: !248, size: 128, align: 64, offset: 6208)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ht_name", scope: !500, file: !27, line: 460, baseType: !59, size: 64, align: 64, offset: 6336)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ht_slots", scope: !500, file: !27, line: 460, baseType: !59, size: 64, align: 64, offset: 6400)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ht_qualname", scope: !500, file: !27, line: 460, baseType: !59, size: 64, align: 64, offset: 6464)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ht_cached_keys", scope: !500, file: !27, line: 461, baseType: !512, size: 64, align: 64, offset: 6528)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !12, line: 376, baseType: !515)
!515 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 368, size: 640, align: 64, elements: !516)
!516 = !{!517, !525}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !515, file: !12, line: 369, baseType: !518, size: 576, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !12, line: 363, baseType: !519)
!519 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 356, size: 576, align: 64, elements: !520)
!520 = !{!521, !522, !523, !524}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !519, file: !12, line: 357, baseType: !406, size: 384, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !519, file: !12, line: 358, baseType: !31, size: 64, align: 64, offset: 384)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !519, file: !12, line: 360, baseType: !73, size: 64, align: 64, offset: 448)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !519, file: !12, line: 361, baseType: !31, size: 64, align: 64, offset: 512)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !515, file: !12, line: 375, baseType: !526, size: 64, align: 64, offset: 576)
!526 = !DICompositeType(tag: DW_TAG_union_type, scope: !515, file: !12, line: 370, size: 64, align: 64, elements: !527)
!527 = !{!528, !529, !533, !536}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !526, file: !12, line: 371, baseType: !19, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !526, file: !12, line: 372, baseType: !530, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !12, line: 134, baseType: !532)
!532 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !526, file: !12, line: 373, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !12, line: 129, baseType: !98)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !526, file: !12, line: 374, baseType: !537, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !12, line: 121, baseType: !362)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictiterobject", file: !369, line: 2803, baseType: !542)
!542 = !DICompositeType(tag: DW_TAG_structure_type, file: !369, line: 2796, size: 448, align: 64, elements: !543)
!543 = !{!544, !545, !546, !547, !548, !549}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !542, file: !369, line: 2797, baseType: !26, size: 128, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "di_dict", scope: !542, file: !369, line: 2798, baseType: !20, size: 64, align: 64, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "di_used", scope: !542, file: !369, line: 2799, baseType: !31, size: 64, align: 64, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "di_pos", scope: !542, file: !369, line: 2800, baseType: !31, size: 64, align: 64, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "di_result", scope: !542, file: !369, line: 2801, baseType: !59, size: 64, align: 64, offset: 320)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !542, file: !369, line: 2802, baseType: !31, size: 64, align: 64, offset: 384)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "dictviewobject", file: !369, line: 3186, baseType: !552)
!552 = !DICompositeType(tag: DW_TAG_structure_type, file: !369, line: 3183, size: 192, align: 64, elements: !553)
!553 = !{!554, !555}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !552, file: !369, line: 3184, baseType: !26, size: 128, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "dv_dict", scope: !552, file: !369, line: 3185, baseType: !20, size: 64, align: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySetObject", file: !558, line: 35, baseType: !559)
!558 = !DIFile(filename: "Include/setobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "_setobject", file: !558, line: 36, size: 1600, align: 64, elements: !560)
!560 = !{!561, !562, !563, !564, !565, !572, !576, !577, !581}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !559, file: !558, line: 37, baseType: !26, size: 128, align: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !559, file: !558, line: 39, baseType: !31, size: 64, align: 64, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !559, file: !558, line: 40, baseType: !31, size: 64, align: 64, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !559, file: !558, line: 46, baseType: !31, size: 64, align: 64, offset: 256)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !559, file: !558, line: 52, baseType: !566, size: 64, align: 64, offset: 320)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64, align: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "setentry", file: !558, line: 28, baseType: !568)
!568 = !DICompositeType(tag: DW_TAG_structure_type, file: !558, line: 24, size: 128, align: 64, elements: !569)
!569 = !{!570, !571}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !568, file: !558, line: 26, baseType: !59, size: 64, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !568, file: !558, line: 27, baseType: !239, size: 64, align: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !559, file: !558, line: 53, baseType: !573, size: 64, align: 64, offset: 384)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64, align: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!566, !556, !59, !239}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !559, file: !558, line: 54, baseType: !239, size: 64, align: 64, offset: 448)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "smalltable", scope: !559, file: !558, line: 55, baseType: !578, size: 1024, align: 64, offset: 512)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 1024, align: 64, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 8)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !559, file: !558, line: 57, baseType: !59, size: 64, align: 64, offset: 1536)
!582 = !{!583, !589, !594, !598, !603, !609, !621, !628, !655, !663, !676, !691, !698, !714, !732, !742, !754, !790, !794, !841, !863, !866, !869, !872, !875, !894, !899, !907, !917, !922, !932, !940, !951, !960, !970, !975, !987, !998, !1003, !1011, !1018, !1045, !1054, !1059, !1062, !1100, !1111, !1118, !1130, !1149, !1160, !1186, !1200, !1223, !1241, !1269, !1274, !1285, !1315, !1365, !1370, !1390, !1397, !1438, !1441, !1448, !1474, !1477, !1492, !1500, !1505, !1515, !1524, !1539, !1558, !1561, !1570, !1573, !1576, !1581, !1591, !1600, !1663, !1666, !1669, !1674, !1688, !1703, !1718, !1732, !1736, !1771, !1782, !1801, !1811, !1820, !1832, !1844, !1856, !1868, !1874, !1880, !1891, !1900, !1914, !1917, !1944, !1951, !1954, !1957, !1968, !1976, !1988, !1991}
!583 = !DISubprogram(name: "PyDict_ClearFreeList", scope: !369, file: !369, line: 237, type: !584, isLocal: false, isDefinition: true, scopeLine: 238, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @PyDict_ClearFreeList, variables: !586)
!584 = !DISubroutineType(types: !585)
!585 = !{!65}
!586 = !{!587, !588}
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !583, file: !369, line: 239, type: !20)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !583, file: !369, line: 240, type: !65)
!589 = !DISubprogram(name: "_PyDict_DebugMallocStats", scope: !369, file: !369, line: 251, type: !590, isLocal: false, isDefinition: true, scopeLine: 252, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IO_FILE*)* @_PyDict_DebugMallocStats, variables: !592)
!590 = !DISubroutineType(types: !591)
!591 = !{null, !66}
!592 = !{!593}
!593 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !589, file: !369, line: 251, type: !66)
!594 = !DISubprogram(name: "PyDict_Fini", scope: !369, file: !369, line: 259, type: !595, isLocal: false, isDefinition: true, scopeLine: 260, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyDict_Fini, variables: !597)
!595 = !DISubroutineType(types: !596)
!596 = !{null}
!597 = !{}
!598 = !DISubprogram(name: "PyDict_New", scope: !369, file: !369, line: 424, type: !599, isLocal: false, isDefinition: true, scopeLine: 425, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyDict_New, variables: !601)
!599 = !DISubroutineType(types: !600)
!600 = !{!59}
!601 = !{!602}
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "keys", scope: !598, file: !369, line: 426, type: !366)
!603 = !DISubprogram(name: "_PyDict_HasOnlyStringKeys", scope: !369, file: !369, line: 699, type: !165, isLocal: false, isDefinition: true, scopeLine: 700, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @_PyDict_HasOnlyStringKeys, variables: !604)
!604 = !{!605, !606, !607, !608}
!605 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dict", arg: 1, scope: !603, file: !369, line: 699, type: !59)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !603, file: !369, line: 701, type: !31)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !603, file: !369, line: 702, type: !59)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !603, file: !369, line: 702, type: !59)
!609 = !DISubprogram(name: "_PyDict_MaybeUntrack", scope: !369, file: !369, line: 724, type: !57, isLocal: false, isDefinition: true, scopeLine: 725, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @_PyDict_MaybeUntrack, variables: !610)
!610 = !{!611, !612, !613, !614, !615, !616, !619}
!611 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !609, file: !369, line: 724, type: !59)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mp", scope: !609, file: !369, line: 726, type: !20)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !609, file: !369, line: 727, type: !59)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !609, file: !369, line: 728, type: !31)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !609, file: !369, line: 728, type: !31)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ep0", scope: !617, file: !369, line: 747, type: !378)
!617 = distinct !DILexicalBlock(scope: !618, file: !369, line: 746, column: 10)
!618 = distinct !DILexicalBlock(scope: !609, file: !369, line: 735, column: 9)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !620, file: !369, line: 756, type: !391)
!620 = distinct !DILexicalBlock(scope: !609, file: !369, line: 756, column: 8)
!621 = !DISubprogram(name: "_PyDict_NewPresized", scope: !369, file: !369, line: 1032, type: !622, isLocal: false, isDefinition: true, scopeLine: 1033, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i64)* @_PyDict_NewPresized, variables: !624)
!622 = !DISubroutineType(types: !623)
!623 = !{!59, !31}
!624 = !{!625, !626, !627}
!625 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "minused", arg: 1, scope: !621, file: !369, line: 1032, type: !31)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newsize", scope: !621, file: !369, line: 1034, type: !31)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_keys", scope: !621, file: !369, line: 1035, type: !366)
!628 = !DISubprogram(name: "PyDict_GetItem", scope: !369, file: !369, line: 1057, type: !147, isLocal: false, isDefinition: true, scopeLine: 1058, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyDict_GetItem, variables: !629)
!629 = !{!630, !631, !632, !633, !634, !635, !636, !637, !644, !645, !648, !650, !653, !654}
!630 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !628, file: !369, line: 1057, type: !59)
!631 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !628, file: !369, line: 1057, type: !59)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hash", scope: !628, file: !369, line: 1059, type: !239)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mp", scope: !628, file: !369, line: 1060, type: !20)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ep", scope: !628, file: !369, line: 1061, type: !378)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !628, file: !369, line: 1062, type: !423)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value_addr", scope: !628, file: !369, line: 1063, type: !386)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !638, file: !369, line: 1082, type: !639)
!638 = distinct !DILexicalBlock(scope: !628, file: !369, line: 1082, column: 45)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !4, line: 33, baseType: !641)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !4, line: 31, size: 64, align: 64, elements: !642)
!642 = !{!643}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !641, file: !4, line: 32, baseType: !19, size: 64, align: 64)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !638, file: !369, line: 1082, type: !19)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !638, file: !369, line: 1082, type: !646)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !19)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !638, file: !369, line: 1082, type: !649)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !4, line: 29, baseType: !3)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err_type", scope: !651, file: !369, line: 1086, type: !59)
!651 = distinct !DILexicalBlock(scope: !652, file: !369, line: 1084, column: 68)
!652 = distinct !DILexicalBlock(scope: !628, file: !369, line: 1084, column: 9)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err_value", scope: !651, file: !369, line: 1086, type: !59)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err_tb", scope: !651, file: !369, line: 1086, type: !59)
!655 = !DISubprogram(name: "PyDict_GetItemWithError", scope: !369, file: !369, line: 1109, type: !147, isLocal: false, isDefinition: true, scopeLine: 1110, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyDict_GetItemWithError, variables: !656)
!656 = !{!657, !658, !659, !660, !661, !662}
!657 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !655, file: !369, line: 1109, type: !59)
!658 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !655, file: !369, line: 1109, type: !59)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hash", scope: !655, file: !369, line: 1111, type: !239)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mp", scope: !655, file: !369, line: 1112, type: !20)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ep", scope: !655, file: !369, line: 1113, type: !378)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value_addr", scope: !655, file: !369, line: 1114, type: !386)
!663 = !DISubprogram(name: "_PyDict_GetItemIdWithError", scope: !369, file: !369, line: 1136, type: !664, isLocal: false, isDefinition: true, scopeLine: 1137, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._Py_Identifier*)* @_PyDict_GetItemIdWithError, variables: !672)
!664 = !DISubroutineType(types: !665)
!665 = !{!59, !59, !666}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64, align: 64)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !27, line: 140, size: 192, align: 64, elements: !668)
!668 = !{!669, !670, !671}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !667, file: !27, line: 141, baseType: !666, size: 64, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !667, file: !27, line: 142, baseType: !49, size: 64, align: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !667, file: !27, line: 143, baseType: !59, size: 64, align: 64, offset: 128)
!672 = !{!673, !674, !675}
!673 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dp", arg: 1, scope: !663, file: !369, line: 1136, type: !59)
!674 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !663, file: !369, line: 1136, type: !666)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kv", scope: !663, file: !369, line: 1138, type: !59)
!676 = !DISubprogram(name: "_PyDict_LoadGlobal", scope: !369, file: !369, line: 1149, type: !677, isLocal: false, isDefinition: true, scopeLine: 1150, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyDictObject*, %struct.PyDictObject*, %struct._object*)* @_PyDict_LoadGlobal, variables: !679)
!677 = !DISubroutineType(types: !678)
!678 = !{!59, !20, !20, !59}
!679 = !{!680, !681, !682, !683, !684, !687, !688}
!680 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "globals", arg: 1, scope: !676, file: !369, line: 1149, type: !20)
!681 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "builtins", arg: 2, scope: !676, file: !369, line: 1149, type: !20)
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 3, scope: !676, file: !369, line: 1149, type: !59)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !676, file: !369, line: 1151, type: !59)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value_addr", scope: !685, file: !369, line: 1153, type: !386)
!685 = distinct !DILexicalBlock(scope: !686, file: !369, line: 1152, column: 61)
!686 = distinct !DILexicalBlock(scope: !676, file: !369, line: 1152, column: 9)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hash", scope: !685, file: !369, line: 1154, type: !239)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !689, file: !369, line: 1156, type: !378)
!689 = distinct !DILexicalBlock(scope: !690, file: !369, line: 1155, column: 25)
!690 = distinct !DILexicalBlock(scope: !685, file: !369, line: 1155, column: 13)
!691 = !DISubprogram(name: "PyDict_SetItem", scope: !369, file: !369, line: 1187, type: !232, isLocal: false, isDefinition: true, scopeLine: 1188, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, %struct._object*)* @PyDict_SetItem, variables: !692)
!692 = !{!693, !694, !695, !696, !697}
!693 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !691, file: !369, line: 1187, type: !59)
!694 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !691, file: !369, line: 1187, type: !59)
!695 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !691, file: !369, line: 1187, type: !59)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mp", scope: !691, file: !369, line: 1189, type: !20)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hash", scope: !691, file: !369, line: 1190, type: !239)
!698 = !DISubprogram(name: "PyDict_DelItem", scope: !369, file: !369, line: 1211, type: !218, isLocal: false, isDefinition: true, scopeLine: 1212, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*)* @PyDict_DelItem, variables: !699)
!699 = !{!700, !701, !702, !703, !704, !705, !706, !707, !708, !712}
!700 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !698, file: !369, line: 1211, type: !59)
!701 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !698, file: !369, line: 1211, type: !59)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mp", scope: !698, file: !369, line: 1213, type: !20)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hash", scope: !698, file: !369, line: 1214, type: !239)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ep", scope: !698, file: !369, line: 1215, type: !378)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_key", scope: !698, file: !369, line: 1216, type: !59)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_value", scope: !698, file: !369, line: 1216, type: !59)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value_addr", scope: !698, file: !369, line: 1217, type: !386)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !709, file: !369, line: 1246, type: !59)
!709 = distinct !DILexicalBlock(scope: !710, file: !369, line: 1246, column: 12)
!710 = distinct !DILexicalBlock(scope: !711, file: !369, line: 1241, column: 43)
!711 = distinct !DILexicalBlock(scope: !698, file: !369, line: 1241, column: 9)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !713, file: !369, line: 1248, type: !59)
!713 = distinct !DILexicalBlock(scope: !698, file: !369, line: 1248, column: 8)
!714 = !DISubprogram(name: "PyDict_Clear", scope: !369, file: !369, line: 1253, type: !57, isLocal: false, isDefinition: true, scopeLine: 1254, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @PyDict_Clear, variables: !715)
!715 = !{!716, !717, !718, !719, !720, !721, !722, !728}
!716 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !714, file: !369, line: 1253, type: !59)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mp", scope: !714, file: !369, line: 1255, type: !20)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldkeys", scope: !714, file: !369, line: 1256, type: !366)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldvalues", scope: !714, file: !369, line: 1257, type: !386)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !714, file: !369, line: 1258, type: !31)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !714, file: !369, line: 1258, type: !31)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !723, file: !369, line: 1276, type: !59)
!723 = distinct !DILexicalBlock(scope: !724, file: !369, line: 1276, column: 16)
!724 = distinct !DILexicalBlock(scope: !725, file: !369, line: 1275, column: 9)
!725 = distinct !DILexicalBlock(scope: !726, file: !369, line: 1275, column: 9)
!726 = distinct !DILexicalBlock(scope: !727, file: !369, line: 1273, column: 34)
!727 = distinct !DILexicalBlock(scope: !714, file: !369, line: 1273, column: 9)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !729, file: !369, line: 1276, type: !59)
!729 = distinct !DILexicalBlock(scope: !730, file: !369, line: 1276, column: 127)
!730 = distinct !DILexicalBlock(scope: !731, file: !369, line: 1276, column: 93)
!731 = distinct !DILexicalBlock(scope: !723, file: !369, line: 1276, column: 70)
!732 = !DISubprogram(name: "PyDict_Next", scope: !369, file: !369, line: 1338, type: !733, isLocal: false, isDefinition: true, scopeLine: 1339, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64*, %struct._object**, %struct._object**)* @PyDict_Next, variables: !735)
!733 = !DISubroutineType(types: !734)
!734 = !{!65, !59, !268, !386, !386}
!735 = !{!736, !737, !738, !739, !740, !741}
!736 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !732, file: !369, line: 1338, type: !59)
!737 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ppos", arg: 2, scope: !732, file: !369, line: 1338, type: !268)
!738 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pkey", arg: 3, scope: !732, file: !369, line: 1338, type: !386)
!739 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pvalue", arg: 4, scope: !732, file: !369, line: 1338, type: !386)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mp", scope: !732, file: !369, line: 1340, type: !20)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !732, file: !369, line: 1341, type: !31)
!742 = !DISubprogram(name: "_PyDict_Next", scope: !369, file: !369, line: 1355, type: !743, isLocal: false, isDefinition: true, scopeLine: 1357, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64*, %struct._object**, %struct._object**, i64*)* @_PyDict_Next, variables: !746)
!743 = !DISubroutineType(types: !744)
!744 = !{!65, !59, !268, !386, !386, !745}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!746 = !{!747, !748, !749, !750, !751, !752, !753}
!747 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !742, file: !369, line: 1355, type: !59)
!748 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ppos", arg: 2, scope: !742, file: !369, line: 1355, type: !268)
!749 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pkey", arg: 3, scope: !742, file: !369, line: 1355, type: !386)
!750 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pvalue", arg: 4, scope: !742, file: !369, line: 1356, type: !386)
!751 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "phash", arg: 5, scope: !742, file: !369, line: 1356, type: !745)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mp", scope: !742, file: !369, line: 1358, type: !20)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !742, file: !369, line: 1359, type: !31)
!754 = !DISubprogram(name: "PyDict_MergeFromSeq2", scope: !369, file: !369, line: 1865, type: !755, isLocal: false, isDefinition: true, scopeLine: 1866, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, i32)* @PyDict_MergeFromSeq2, variables: !757)
!755 = !DISubroutineType(types: !756)
!756 = !{!65, !59, !59, !65}
!757 = !{!758, !759, !760, !761, !762, !763, !764, !765, !769, !770, !771, !774, !776, !778, !780, !783, !785, !788}
!758 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 1, scope: !754, file: !369, line: 1865, type: !59)
!759 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seq2", arg: 2, scope: !754, file: !369, line: 1865, type: !59)
!760 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "override", arg: 3, scope: !754, file: !369, line: 1865, type: !65)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !754, file: !369, line: 1867, type: !59)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !754, file: !369, line: 1868, type: !31)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !754, file: !369, line: 1869, type: !59)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fast", scope: !754, file: !369, line: 1870, type: !59)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !766, file: !369, line: 1881, type: !59)
!766 = distinct !DILexicalBlock(scope: !767, file: !369, line: 1880, column: 24)
!767 = distinct !DILexicalBlock(scope: !768, file: !369, line: 1880, column: 5)
!768 = distinct !DILexicalBlock(scope: !754, file: !369, line: 1880, column: 5)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !766, file: !369, line: 1881, type: !59)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !766, file: !369, line: 1882, type: !31)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "status", scope: !772, file: !369, line: 1915, type: !65)
!772 = distinct !DILexicalBlock(scope: !773, file: !369, line: 1914, column: 63)
!773 = distinct !DILexicalBlock(scope: !766, file: !369, line: 1914, column: 13)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !775, file: !369, line: 1919, type: !59)
!775 = distinct !DILexicalBlock(scope: !766, file: !369, line: 1919, column: 12)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !777, file: !369, line: 1920, type: !59)
!777 = distinct !DILexicalBlock(scope: !766, file: !369, line: 1920, column: 12)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !779, file: !369, line: 1926, type: !59)
!779 = distinct !DILexicalBlock(scope: !754, file: !369, line: 1926, column: 8)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !781, file: !369, line: 1926, type: !59)
!781 = distinct !DILexicalBlock(scope: !782, file: !369, line: 1926, column: 96)
!782 = distinct !DILexicalBlock(scope: !779, file: !369, line: 1926, column: 62)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !784, file: !369, line: 1927, type: !59)
!784 = distinct !DILexicalBlock(scope: !754, file: !369, line: 1927, column: 8)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !786, file: !369, line: 1927, type: !59)
!786 = distinct !DILexicalBlock(scope: !787, file: !369, line: 1927, column: 96)
!787 = distinct !DILexicalBlock(scope: !784, file: !369, line: 1927, column: 62)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !789, file: !369, line: 1930, type: !59)
!789 = distinct !DILexicalBlock(scope: !754, file: !369, line: 1930, column: 8)
!790 = !DISubprogram(name: "PyDict_Update", scope: !369, file: !369, line: 1935, type: !218, isLocal: false, isDefinition: true, scopeLine: 1936, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*)* @PyDict_Update, variables: !791)
!791 = !{!792, !793}
!792 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !790, file: !369, line: 1935, type: !59)
!793 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !790, file: !369, line: 1935, type: !59)
!794 = !DISubprogram(name: "PyDict_Merge", scope: !369, file: !369, line: 1941, type: !755, isLocal: false, isDefinition: true, scopeLine: 1942, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, i32)* @PyDict_Merge, variables: !795)
!795 = !{!796, !797, !798, !799, !800, !801, !802, !803, !804, !810, !812, !813, !814, !815, !816, !818, !825, !829, !831, !833, !835, !839}
!796 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !794, file: !369, line: 1941, type: !59)
!797 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !794, file: !369, line: 1941, type: !59)
!798 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "override", arg: 3, scope: !794, file: !369, line: 1941, type: !65)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mp", scope: !794, file: !369, line: 1943, type: !20)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "other", scope: !794, file: !369, line: 1943, type: !20)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !794, file: !369, line: 1944, type: !31)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !794, file: !369, line: 1944, type: !31)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "entry", scope: !794, file: !369, line: 1945, type: !378)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !805, file: !369, line: 1976, type: !59)
!805 = distinct !DILexicalBlock(scope: !806, file: !369, line: 1975, column: 66)
!806 = distinct !DILexicalBlock(scope: !807, file: !369, line: 1975, column: 9)
!807 = distinct !DILexicalBlock(scope: !808, file: !369, line: 1975, column: 9)
!808 = distinct !DILexicalBlock(scope: !809, file: !369, line: 1957, column: 75)
!809 = distinct !DILexicalBlock(scope: !794, file: !369, line: 1957, column: 9)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "keys", scope: !811, file: !369, line: 1995, type: !59)
!811 = distinct !DILexicalBlock(scope: !809, file: !369, line: 1993, column: 10)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iter", scope: !811, file: !369, line: 1996, type: !59)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !811, file: !369, line: 1997, type: !59)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !811, file: !369, line: 1997, type: !59)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "status", scope: !811, file: !369, line: 1998, type: !65)
!816 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !817, file: !369, line: 2009, type: !59)
!817 = distinct !DILexicalBlock(scope: !811, file: !369, line: 2009, column: 12)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !819, file: !369, line: 2015, type: !59)
!819 = distinct !DILexicalBlock(scope: !820, file: !369, line: 2015, column: 20)
!820 = distinct !DILexicalBlock(scope: !821, file: !369, line: 2014, column: 68)
!821 = distinct !DILexicalBlock(scope: !822, file: !369, line: 2014, column: 17)
!822 = distinct !DILexicalBlock(scope: !823, file: !369, line: 2013, column: 69)
!823 = distinct !DILexicalBlock(scope: !824, file: !369, line: 2013, column: 9)
!824 = distinct !DILexicalBlock(scope: !811, file: !369, line: 2013, column: 9)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !826, file: !369, line: 2020, type: !59)
!826 = distinct !DILexicalBlock(scope: !827, file: !369, line: 2020, column: 20)
!827 = distinct !DILexicalBlock(scope: !828, file: !369, line: 2019, column: 38)
!828 = distinct !DILexicalBlock(scope: !822, file: !369, line: 2019, column: 17)
!829 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !830, file: !369, line: 2021, type: !59)
!830 = distinct !DILexicalBlock(scope: !827, file: !369, line: 2021, column: 20)
!831 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !832, file: !369, line: 2025, type: !59)
!832 = distinct !DILexicalBlock(scope: !822, file: !369, line: 2025, column: 16)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !834, file: !369, line: 2026, type: !59)
!834 = distinct !DILexicalBlock(scope: !822, file: !369, line: 2026, column: 16)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !836, file: !369, line: 2028, type: !59)
!836 = distinct !DILexicalBlock(scope: !837, file: !369, line: 2028, column: 20)
!837 = distinct !DILexicalBlock(scope: !838, file: !369, line: 2027, column: 29)
!838 = distinct !DILexicalBlock(scope: !822, file: !369, line: 2027, column: 17)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !840, file: !369, line: 2032, type: !59)
!840 = distinct !DILexicalBlock(scope: !811, file: !369, line: 2032, column: 12)
!841 = !DISubprogram(name: "PyDict_Copy", scope: !369, file: !369, line: 2047, type: !137, isLocal: false, isDefinition: true, scopeLine: 2048, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyDict_Copy, variables: !842)
!842 = !{!843, !844, !845, !846, !847, !848, !851, !852, !856, !858, !861}
!843 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "o", arg: 1, scope: !841, file: !369, line: 2047, type: !59)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "copy", scope: !841, file: !369, line: 2049, type: !59)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mp", scope: !841, file: !369, line: 2050, type: !20)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !841, file: !369, line: 2051, type: !31)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !841, file: !369, line: 2051, type: !31)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "split_copy", scope: !849, file: !369, line: 2059, type: !20)
!849 = distinct !DILexicalBlock(scope: !850, file: !369, line: 2058, column: 42)
!850 = distinct !DILexicalBlock(scope: !841, file: !369, line: 2058, column: 9)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newvalues", scope: !849, file: !369, line: 2060, type: !386)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !853, file: !369, line: 2073, type: !59)
!853 = distinct !DILexicalBlock(scope: !854, file: !369, line: 2072, column: 63)
!854 = distinct !DILexicalBlock(scope: !855, file: !369, line: 2072, column: 9)
!855 = distinct !DILexicalBlock(scope: !849, file: !369, line: 2072, column: 9)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !857, file: !369, line: 2074, type: !59)
!857 = distinct !DILexicalBlock(scope: !853, file: !369, line: 2074, column: 16)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !859, file: !369, line: 2078, type: !391)
!859 = distinct !DILexicalBlock(scope: !860, file: !369, line: 2078, column: 16)
!860 = distinct !DILexicalBlock(scope: !849, file: !369, line: 2077, column: 13)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !862, file: !369, line: 2086, type: !59)
!862 = distinct !DILexicalBlock(scope: !841, file: !369, line: 2086, column: 8)
!863 = !DISubprogram(name: "PyDict_Size", scope: !369, file: !369, line: 2091, type: !199, isLocal: false, isDefinition: true, scopeLine: 2092, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyDict_Size, variables: !864)
!864 = !{!865}
!865 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mp", arg: 1, scope: !863, file: !369, line: 2091, type: !59)
!866 = !DISubprogram(name: "PyDict_Keys", scope: !369, file: !369, line: 2101, type: !137, isLocal: false, isDefinition: true, scopeLine: 2102, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyDict_Keys, variables: !867)
!867 = !{!868}
!868 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mp", arg: 1, scope: !866, file: !369, line: 2101, type: !59)
!869 = !DISubprogram(name: "PyDict_Values", scope: !369, file: !369, line: 2111, type: !137, isLocal: false, isDefinition: true, scopeLine: 2112, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyDict_Values, variables: !870)
!870 = !{!871}
!871 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mp", arg: 1, scope: !869, file: !369, line: 2111, type: !59)
!872 = !DISubprogram(name: "PyDict_Items", scope: !369, file: !369, line: 2121, type: !137, isLocal: false, isDefinition: true, scopeLine: 2122, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyDict_Items, variables: !873)
!873 = !{!874}
!874 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mp", arg: 1, scope: !872, file: !369, line: 2121, type: !59)
!875 = !DISubprogram(name: "PyDict_SetDefault", scope: !369, file: !369, line: 2273, type: !156, isLocal: false, isDefinition: true, scopeLine: 2274, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @PyDict_SetDefault, variables: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885}
!877 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 1, scope: !875, file: !369, line: 2273, type: !59)
!878 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !875, file: !369, line: 2273, type: !59)
!879 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "defaultobj", arg: 3, scope: !875, file: !369, line: 2273, type: !59)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mp", scope: !875, file: !369, line: 2275, type: !20)
!881 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !875, file: !369, line: 2276, type: !59)
!882 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hash", scope: !875, file: !369, line: 2277, type: !239)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ep", scope: !875, file: !369, line: 2278, type: !378)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value_addr", scope: !875, file: !369, line: 2279, type: !386)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !886, file: !369, line: 2304, type: !391)
!886 = distinct !DILexicalBlock(scope: !887, file: !369, line: 2304, column: 720)
!887 = distinct !DILexicalBlock(scope: !888, file: !369, line: 2304, column: 715)
!888 = distinct !DILexicalBlock(scope: !889, file: !369, line: 2304, column: 81)
!889 = distinct !DILexicalBlock(scope: !890, file: !369, line: 2304, column: 75)
!890 = distinct !DILexicalBlock(scope: !891, file: !369, line: 2304, column: 18)
!891 = distinct !DILexicalBlock(scope: !892, file: !369, line: 2304, column: 12)
!892 = distinct !DILexicalBlock(scope: !893, file: !369, line: 2295, column: 28)
!893 = distinct !DILexicalBlock(scope: !875, file: !369, line: 2295, column: 9)
!894 = !DISubprogram(name: "_PyDict_KeysSize", scope: !369, file: !369, line: 2506, type: !895, isLocal: false, isDefinition: true, scopeLine: 2507, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._dictkeysobject*)* @_PyDict_KeysSize, variables: !897)
!895 = !DISubroutineType(types: !896)
!896 = !{!31, !366}
!897 = !{!898}
!898 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "keys", arg: 1, scope: !894, file: !369, line: 2506, type: !366)
!899 = !DISubprogram(name: "PyDict_Contains", scope: !369, file: !369, line: 2586, type: !218, isLocal: false, isDefinition: true, scopeLine: 2587, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*)* @PyDict_Contains, variables: !900)
!900 = !{!901, !902, !903, !904, !905, !906}
!901 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !899, file: !369, line: 2586, type: !59)
!902 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !899, file: !369, line: 2586, type: !59)
