; ModuleID = 'irs-onlybc/dtoa.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Bigint = type { %struct.Bigint*, i32, i32, i32, i32, [1 x i32] }
%union.U = type { double }
%struct.BCinfo = type { i32, i32, i32, i32 }

@tens = internal constant [23 x double] [double 1.000000e+00, double 1.000000e+01, double 1.000000e+02, double 1.000000e+03, double 1.000000e+04, double 1.000000e+05, double 1.000000e+06, double 1.000000e+07, double 1.000000e+08, double 1.000000e+09, double 1.000000e+10, double 1.000000e+11, double 1.000000e+12, double 1.000000e+13, double 1.000000e+14, double 1.000000e+15, double 1.000000e+16, double 1.000000e+17, double 1.000000e+18, double 1.000000e+19, double 1.000000e+20, double 1.000000e+21, double 1.000000e+22], align 16
@bigtens = internal constant [5 x double] [double 1.000000e+16, double 1.000000e+32, double 1.000000e+64, double 1.000000e+128, double 1.000000e+256], align 16
@tinytens = internal constant [5 x double] [double 1.000000e-16, double 1.000000e-32, double 1.000000e-64, double 1.000000e-128, double 0x1168062864AC6F43], align 16
@.str = private unnamed_addr constant [9 x i8] c"Infinity\00", align 1
@.str.1 = private unnamed_addr constant [4 x i8] c"NaN\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"0\00", align 1
@freelist = internal global [8 x %struct.Bigint*] zeroinitializer, align 16

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !33, globals: !412)
!1 = !DIFile(filename: "dtoa.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !6, !7, !8, !13, !16, !30, !31, !12}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!6 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "ULong", file: !9, line: 155, baseType: !10)
!9 = !DIFile(filename: "Python/dtoa.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !11, line: 51, baseType: !12)
!11 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!12 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "Long", file: !9, line: 156, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !15, line: 196, baseType: !6)
!15 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bigint", file: !9, line: 336, baseType: !18)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bigint", file: !9, line: 330, size: 256, align: 64, elements: !19)
!19 = !{!20, !22, !23, !24, !25, !26}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !18, file: !9, line: 331, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !18, file: !9, line: 332, baseType: !6, size: 32, align: 32, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "maxwds", scope: !18, file: !9, line: 332, baseType: !6, size: 32, align: 32, offset: 96)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !18, file: !9, line: 332, baseType: !6, size: 32, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "wds", scope: !18, file: !9, line: 332, baseType: !6, size: 32, align: 32, offset: 160)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !18, file: !9, line: 333, baseType: !27, size: 32, align: 32, offset: 192)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, align: 32, elements: !28)
!28 = !{!29}
!29 = !DISubrange(count: 1)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !11, line: 55, baseType: !32)
!32 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!33 = !{!34, !49, !53, !113, !119, !166, !179, !187, !192, !201, !205, !215, !237, !250, !265, !277, !285, !296, !309, !315, !322, !340, !349, !363, !370, !378, !385, !398}
!34 = !DISubprogram(name: "_Py_dg_stdnan", scope: !9, file: !9, line: 1524, type: !35, isLocal: false, isDefinition: true, scopeLine: 1525, flags: DIFlagPrototyped, isOptimized: true, function: double (i32)* @_Py_dg_stdnan, variables: !38)
!35 = !DISubroutineType(types: !36)
!36 = !{!37, !6}
!37 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!38 = !{!39, !40}
!39 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sign", arg: 1, scope: !34, file: !9, line: 1524, type: !6)
!40 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !34, file: !9, line: 1526, type: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "U", file: !9, line: 188, baseType: !42)
!42 = !DICompositeType(tag: DW_TAG_union_type, file: !9, line: 188, size: 64, align: 64, elements: !43)
!43 = !{!44, !45}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !42, file: !9, line: 188, baseType: !37, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !42, file: !9, line: 188, baseType: !46, size: 64, align: 32)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 64, align: 32, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 2)
!49 = !DISubprogram(name: "_Py_dg_infinity", scope: !9, file: !9, line: 1538, type: !35, isLocal: false, isDefinition: true, scopeLine: 1539, flags: DIFlagPrototyped, isOptimized: true, function: double (i32)* @_Py_dg_infinity, variables: !50)
!50 = !{!51, !52}
!51 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sign", arg: 1, scope: !49, file: !9, line: 1538, type: !6)
!52 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !49, file: !9, line: 1540, type: !41)
!53 = !DISubprogram(name: "_Py_dg_strtod", scope: !9, file: !9, line: 1547, type: !54, isLocal: false, isDefinition: true, scopeLine: 1548, flags: DIFlagPrototyped, isOptimized: true, function: double (i8*, i8**)* @_Py_dg_strtod, variables: !59)
!54 = !DISubroutineType(types: !55)
!55 = !{!37, !56, !58}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!59 = !{!60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !103, !104, !105, !106, !107, !108, !109, !112}
!60 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s00", arg: 1, scope: !53, file: !9, line: 1547, type: !56)
!61 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "se", arg: 2, scope: !53, file: !9, line: 1547, type: !58)
!62 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bb2", scope: !53, file: !9, line: 1549, type: !6)
!63 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bb5", scope: !53, file: !9, line: 1549, type: !6)
!64 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bbe", scope: !53, file: !9, line: 1549, type: !6)
!65 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bd2", scope: !53, file: !9, line: 1549, type: !6)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bd5", scope: !53, file: !9, line: 1549, type: !6)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bs2", scope: !53, file: !9, line: 1549, type: !6)
!68 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !53, file: !9, line: 1549, type: !6)
!69 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dsign", scope: !53, file: !9, line: 1549, type: !6)
!70 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !53, file: !9, line: 1549, type: !6)
!71 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e1", scope: !53, file: !9, line: 1549, type: !6)
!72 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error", scope: !53, file: !9, line: 1549, type: !6)
!73 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "esign", scope: !53, file: !9, line: 1550, type: !6)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !53, file: !9, line: 1550, type: !6)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !53, file: !9, line: 1550, type: !6)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !53, file: !9, line: 1550, type: !6)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lz", scope: !53, file: !9, line: 1550, type: !6)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nd", scope: !53, file: !9, line: 1550, type: !6)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nd0", scope: !53, file: !9, line: 1550, type: !6)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "odd", scope: !53, file: !9, line: 1550, type: !6)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !53, file: !9, line: 1550, type: !6)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !53, file: !9, line: 1551, type: !56)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s0", scope: !53, file: !9, line: 1551, type: !56)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s1", scope: !53, file: !9, line: 1551, type: !56)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aadj", scope: !53, file: !9, line: 1552, type: !37)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aadj1", scope: !53, file: !9, line: 1552, type: !37)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aadj2", scope: !53, file: !9, line: 1553, type: !41)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "adj", scope: !53, file: !9, line: 1553, type: !41)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv", scope: !53, file: !9, line: 1553, type: !41)
!90 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rv0", scope: !53, file: !9, line: 1553, type: !41)
!91 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !53, file: !9, line: 1554, type: !8)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !53, file: !9, line: 1554, type: !8)
!93 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "abs_exp", scope: !53, file: !9, line: 1554, type: !8)
!94 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "L", scope: !53, file: !9, line: 1555, type: !13)
!95 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bc", scope: !53, file: !9, line: 1556, type: !96)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "BCinfo", file: !9, line: 297, baseType: !97)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "BCinfo", file: !9, line: 299, size: 128, align: 32, elements: !98)
!98 = !{!99, !100, !101, !102}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "e0", scope: !97, file: !9, line: 300, baseType: !6, size: 32, align: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "nd", scope: !97, file: !9, line: 300, baseType: !6, size: 32, align: 32, offset: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "nd0", scope: !97, file: !9, line: 300, baseType: !6, size: 32, align: 32, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !97, file: !9, line: 300, baseType: !6, size: 32, align: 32, offset: 96)
!103 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bb", scope: !53, file: !9, line: 1557, type: !16)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bb1", scope: !53, file: !9, line: 1557, type: !16)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bd", scope: !53, file: !9, line: 1557, type: !16)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bd0", scope: !53, file: !9, line: 1557, type: !16)
!107 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bs", scope: !53, file: !9, line: 1557, type: !16)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "delta", scope: !53, file: !9, line: 1557, type: !16)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !53, file: !9, line: 1558, type: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !111, line: 62, baseType: !32)
!111 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fraclen", scope: !53, file: !9, line: 1558, type: !110)
!113 = !DISubprogram(name: "_Py_dg_freedtoa", scope: !9, file: !9, line: 2339, type: !114, isLocal: false, isDefinition: true, scopeLine: 2340, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @_Py_dg_freedtoa, variables: !116)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !4}
!116 = !{!117, !118}
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !113, file: !9, line: 2339, type: !4)
!118 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !113, file: !9, line: 2341, type: !16)
!119 = !DISubprogram(name: "_Py_dg_dtoa", scope: !9, file: !9, line: 2385, type: !120, isLocal: false, isDefinition: true, scopeLine: 2387, flags: DIFlagPrototyped, isOptimized: true, function: i8* (double, i32, i32, i32*, i32*, i8**)* @_Py_dg_dtoa, variables: !122)
!120 = !DISubroutineType(types: !121)
!121 = !{!4, !37, !6, !6, !30, !30, !58}
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165}
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dd", arg: 1, scope: !119, file: !9, line: 2385, type: !37)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 2, scope: !119, file: !9, line: 2385, type: !6)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndigits", arg: 3, scope: !119, file: !9, line: 2385, type: !6)
!126 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "decpt", arg: 4, scope: !119, file: !9, line: 2386, type: !30)
!127 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sign", arg: 5, scope: !119, file: !9, line: 2386, type: !30)
!128 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rve", arg: 6, scope: !119, file: !9, line: 2386, type: !58)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bbits", scope: !119, file: !9, line: 2422, type: !6)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b2", scope: !119, file: !9, line: 2422, type: !6)
!131 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b5", scope: !119, file: !9, line: 2422, type: !6)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "be", scope: !119, file: !9, line: 2422, type: !6)
!133 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dig", scope: !119, file: !9, line: 2422, type: !6)
!134 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !119, file: !9, line: 2422, type: !6)
!135 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ieps", scope: !119, file: !9, line: 2422, type: !6)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ilim", scope: !119, file: !9, line: 2422, type: !6)
