; ModuleID = 'programs_new/Python-new/errors.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Py_atomic_address = type { i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !11, subprograms: !419, globals: !951)
!1 = !DIFile(filename: "errors.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !4, line: 23, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!7 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!8 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!9 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!10 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!11 = !{!12, !114, !29, !409, !411, !35, !76}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !14, line: 139, baseType: !15)
!14 = !DIFile(filename: "Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !14, line: 69, size: 1536, align: 64, elements: !16)
!16 = !{!17, !19, !20, !379, !382, !383, !384, !385, !386, !387, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !15, file: !14, line: 72, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !15, file: !14, line: 73, baseType: !18, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !15, file: !14, line: 74, baseType: !21, size: 64, align: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !14, line: 44, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !14, line: 19, size: 832, align: 64, elements: !24)
!24 = !{!25, !27, !28, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !23, file: !14, line: 21, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !23, file: !14, line: 22, baseType: !18, size: 64, align: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !23, file: !14, line: 24, baseType: !29, size: 64, align: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !31, line: 109, baseType: !32)
!31 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !31, line: 105, size: 128, align: 64, elements: !33)
!33 = !{!34, !42}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !32, file: !31, line: 107, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !36, line: 177, baseType: !37)
!36 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !38, line: 102, baseType: !39)
!38 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !40, line: 181, baseType: !41)
!40 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!41 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !32, file: !31, line: 108, baseType: !43, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !31, line: 334, size: 3200, align: 64, elements: !45)
!45 = !{!46, !52, !56, !57, !58, !63, !127, !132, !137, !138, !143, !195, !226, !238, !244, !245, !246, !248, !250, !281, !282, !283, !292, !293, !298, !299, !301, !303, !313, !316, !334, !335, !336, !338, !340, !341, !343, !348, !353, !358, !359, !360, !361, !362, !363, !364, !365, !367}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !44, file: !31, line: 335, baseType: !47, size: 192, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !31, line: 114, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 111, size: 192, align: 64, elements: !49)
!49 = !{!50, !51}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !48, file: !31, line: 112, baseType: !30, size: 128, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !48, file: !31, line: 113, baseType: !35, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !44, file: !31, line: 336, baseType: !53, size: 64, align: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !44, file: !31, line: 337, baseType: !35, size: 64, align: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !44, file: !31, line: 337, baseType: !35, size: 64, align: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !44, file: !31, line: 341, baseType: !59, size: 64, align: 64, offset: 384)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !31, line: 308, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !29}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !44, file: !31, line: 342, baseType: !64, size: 64, align: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !31, line: 314, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !29, !69, !68}
!68 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !38, line: 48, baseType: !71)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !72, line: 246, size: 1728, align: 64, elements: !73)
!72 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!73 = !{!74, !75, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !95, !96, !97, !98, !100, !102, !104, !108, !111, !113, !115, !116, !117, !118, !122, !123}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !71, file: !72, line: 247, baseType: !68, size: 32, align: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !71, file: !72, line: 252, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !71, file: !72, line: 253, baseType: !76, size: 64, align: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !71, file: !72, line: 254, baseType: !76, size: 64, align: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !71, file: !72, line: 255, baseType: !76, size: 64, align: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !71, file: !72, line: 256, baseType: !76, size: 64, align: 64, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !71, file: !72, line: 257, baseType: !76, size: 64, align: 64, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !71, file: !72, line: 258, baseType: !76, size: 64, align: 64, offset: 448)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !71, file: !72, line: 259, baseType: !76, size: 64, align: 64, offset: 512)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !71, file: !72, line: 261, baseType: !76, size: 64, align: 64, offset: 576)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !71, file: !72, line: 262, baseType: !76, size: 64, align: 64, offset: 640)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !71, file: !72, line: 263, baseType: !76, size: 64, align: 64, offset: 704)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !71, file: !72, line: 265, baseType: !88, size: 64, align: 64, offset: 768)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !72, line: 161, size: 192, align: 64, elements: !90)
!90 = !{!91, !92, !94}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !89, file: !72, line: 162, baseType: !88, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !89, file: !72, line: 163, baseType: !93, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !89, file: !72, line: 167, baseType: !68, size: 32, align: 32, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !71, file: !72, line: 267, baseType: !93, size: 64, align: 64, offset: 832)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !71, file: !72, line: 269, baseType: !68, size: 32, align: 32, offset: 896)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !71, file: !72, line: 273, baseType: !68, size: 32, align: 32, offset: 928)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !71, file: !72, line: 275, baseType: !99, size: 64, align: 64, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !40, line: 140, baseType: !41)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !71, file: !72, line: 279, baseType: !101, size: 16, align: 16, offset: 1024)
!101 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !71, file: !72, line: 280, baseType: !103, size: 8, align: 8, offset: 1040)
!103 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !71, file: !72, line: 281, baseType: !105, size: 8, align: 8, offset: 1048)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 8, align: 8, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 1)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !71, file: !72, line: 285, baseType: !109, size: 64, align: 64, offset: 1088)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !72, line: 155, baseType: null)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !71, file: !72, line: 294, baseType: !112, size: 64, align: 64, offset: 1152)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !40, line: 141, baseType: !41)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !71, file: !72, line: 303, baseType: !114, size: 64, align: 64, offset: 1216)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !71, file: !72, line: 304, baseType: !114, size: 64, align: 64, offset: 1280)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !71, file: !72, line: 305, baseType: !114, size: 64, align: 64, offset: 1344)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !71, file: !72, line: 306, baseType: !114, size: 64, align: 64, offset: 1408)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !71, file: !72, line: 307, baseType: !119, size: 64, align: 64, offset: 1472)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !120, line: 62, baseType: !121)
!120 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!121 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !71, file: !72, line: 309, baseType: !68, size: 32, align: 32, offset: 1536)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !71, file: !72, line: 311, baseType: !124, size: 160, align: 8, offset: 1568)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 160, align: 8, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 20)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !44, file: !31, line: 343, baseType: !128, size: 64, align: 64, offset: 512)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !31, line: 316, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!29, !29, !76}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !44, file: !31, line: 344, baseType: !133, size: 64, align: 64, offset: 576)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !31, line: 318, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!68, !29, !76, !29}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !44, file: !31, line: 345, baseType: !114, size: 64, align: 64, offset: 640)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !44, file: !31, line: 346, baseType: !139, size: 64, align: 64, offset: 704)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !31, line: 320, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!29, !29}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !44, file: !31, line: 350, baseType: !144, size: 64, align: 64, offset: 768)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !31, line: 278, baseType: !146)
!146 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 236, size: 2176, align: 64, elements: !147)
!147 = !{!148, !153, !154, !155, !156, !157, !162, !164, !165, !166, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !146, file: !31, line: 241, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !31, line: 166, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!29, !29, !29}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !146, file: !31, line: 242, baseType: !149, size: 64, align: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !146, file: !31, line: 243, baseType: !149, size: 64, align: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !146, file: !31, line: 244, baseType: !149, size: 64, align: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !146, file: !31, line: 245, baseType: !149, size: 64, align: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !146, file: !31, line: 246, baseType: !158, size: 64, align: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !31, line: 167, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64, align: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!29, !29, !29, !29}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !146, file: !31, line: 247, baseType: !163, size: 64, align: 64, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !31, line: 165, baseType: !140)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !146, file: !31, line: 248, baseType: !163, size: 64, align: 64, offset: 448)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !146, file: !31, line: 249, baseType: !163, size: 64, align: 64, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !146, file: !31, line: 250, baseType: !167, size: 64, align: 64, offset: 576)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !31, line: 168, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!68, !29}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !146, file: !31, line: 251, baseType: !163, size: 64, align: 64, offset: 640)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !146, file: !31, line: 252, baseType: !149, size: 64, align: 64, offset: 704)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !146, file: !31, line: 253, baseType: !149, size: 64, align: 64, offset: 768)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !146, file: !31, line: 254, baseType: !149, size: 64, align: 64, offset: 832)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !146, file: !31, line: 255, baseType: !149, size: 64, align: 64, offset: 896)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !146, file: !31, line: 256, baseType: !149, size: 64, align: 64, offset: 960)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !146, file: !31, line: 257, baseType: !163, size: 64, align: 64, offset: 1024)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !146, file: !31, line: 258, baseType: !114, size: 64, align: 64, offset: 1088)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !146, file: !31, line: 259, baseType: !163, size: 64, align: 64, offset: 1152)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !146, file: !31, line: 261, baseType: !149, size: 64, align: 64, offset: 1216)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !146, file: !31, line: 262, baseType: !149, size: 64, align: 64, offset: 1280)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !146, file: !31, line: 263, baseType: !149, size: 64, align: 64, offset: 1344)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !146, file: !31, line: 264, baseType: !149, size: 64, align: 64, offset: 1408)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !146, file: !31, line: 265, baseType: !158, size: 64, align: 64, offset: 1472)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !146, file: !31, line: 266, baseType: !149, size: 64, align: 64, offset: 1536)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !146, file: !31, line: 267, baseType: !149, size: 64, align: 64, offset: 1600)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !146, file: !31, line: 268, baseType: !149, size: 64, align: 64, offset: 1664)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !146, file: !31, line: 269, baseType: !149, size: 64, align: 64, offset: 1728)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !146, file: !31, line: 270, baseType: !149, size: 64, align: 64, offset: 1792)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !146, file: !31, line: 272, baseType: !149, size: 64, align: 64, offset: 1856)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !146, file: !31, line: 273, baseType: !149, size: 64, align: 64, offset: 1920)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !146, file: !31, line: 274, baseType: !149, size: 64, align: 64, offset: 1984)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !146, file: !31, line: 275, baseType: !149, size: 64, align: 64, offset: 2048)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !146, file: !31, line: 277, baseType: !163, size: 64, align: 64, offset: 2112)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !44, file: !31, line: 351, baseType: !196, size: 64, align: 64, offset: 832)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !31, line: 292, baseType: !198)
!198 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 280, size: 640, align: 64, elements: !199)
!199 = !{!200, !205, !206, !211, !212, !213, !218, !219, !224, !225}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !198, file: !31, line: 281, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !31, line: 169, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!35, !29}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !198, file: !31, line: 282, baseType: !149, size: 64, align: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !198, file: !31, line: 283, baseType: !207, size: 64, align: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !31, line: 170, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!29, !29, !35}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !198, file: !31, line: 284, baseType: !207, size: 64, align: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !198, file: !31, line: 285, baseType: !114, size: 64, align: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !198, file: !31, line: 286, baseType: !214, size: 64, align: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !31, line: 172, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!68, !29, !35, !29}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !198, file: !31, line: 287, baseType: !114, size: 64, align: 64, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !198, file: !31, line: 288, baseType: !220, size: 64, align: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !31, line: 231, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!68, !29, !29}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !198, file: !31, line: 290, baseType: !149, size: 64, align: 64, offset: 512)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !198, file: !31, line: 291, baseType: !207, size: 64, align: 64, offset: 576)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !44, file: !31, line: 352, baseType: !227, size: 64, align: 64, offset: 896)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !31, line: 298, baseType: !229)
!229 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 294, size: 192, align: 64, elements: !230)
!230 = !{!231, !232, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !229, file: !31, line: 295, baseType: !201, size: 64, align: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !229, file: !31, line: 296, baseType: !149, size: 64, align: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !229, file: !31, line: 297, baseType: !234, size: 64, align: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !31, line: 174, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!68, !29, !29, !29}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !44, file: !31, line: 356, baseType: !239, size: 64, align: 64, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !31, line: 321, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!243, !29}
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !36, line: 186, baseType: !35)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !44, file: !31, line: 357, baseType: !158, size: 64, align: 64, offset: 1024)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !44, file: !31, line: 358, baseType: !139, size: 64, align: 64, offset: 1088)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !44, file: !31, line: 359, baseType: !247, size: 64, align: 64, offset: 1152)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !31, line: 317, baseType: !150)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !44, file: !31, line: 360, baseType: !249, size: 64, align: 64, offset: 1216)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !31, line: 319, baseType: !235)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !44, file: !31, line: 363, baseType: !251, size: 64, align: 64, offset: 1280)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !31, line: 304, baseType: !253)
!253 = !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 301, size: 128, align: 64, elements: !254)
!254 = !{!255, !276}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !253, file: !31, line: 302, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !31, line: 193, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64, align: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!68, !29, !260, !68}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !31, line: 191, baseType: !262)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !31, line: 178, size: 640, align: 64, elements: !263)
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !273, !274, !275}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !262, file: !31, line: 179, baseType: !114, size: 64, align: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !262, file: !31, line: 180, baseType: !29, size: 64, align: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !262, file: !31, line: 181, baseType: !35, size: 64, align: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !262, file: !31, line: 182, baseType: !35, size: 64, align: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !262, file: !31, line: 184, baseType: !68, size: 32, align: 32, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !262, file: !31, line: 185, baseType: !68, size: 32, align: 32, offset: 288)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !262, file: !31, line: 186, baseType: !76, size: 64, align: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !262, file: !31, line: 187, baseType: !272, size: 64, align: 64, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !262, file: !31, line: 188, baseType: !272, size: 64, align: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !262, file: !31, line: 189, baseType: !272, size: 64, align: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !262, file: !31, line: 190, baseType: !114, size: 64, align: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !253, file: !31, line: 303, baseType: !277, size: 64, align: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !31, line: 194, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !29, !260}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !44, file: !31, line: 366, baseType: !121, size: 64, align: 64, offset: 1344)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !44, file: !31, line: 368, baseType: !53, size: 64, align: 64, offset: 1408)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !44, file: !31, line: 372, baseType: !284, size: 64, align: 64, offset: 1472)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !31, line: 233, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!68, !29, !288, !114}
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !31, line: 232, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!68, !29, !114}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !44, file: !31, line: 375, baseType: !167, size: 64, align: 64, offset: 1536)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !44, file: !31, line: 379, baseType: !294, size: 64, align: 64, offset: 1600)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !31, line: 322, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!29, !29, !29, !68}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !44, file: !31, line: 382, baseType: !35, size: 64, align: 64, offset: 1664)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !44, file: !31, line: 385, baseType: !300, size: 64, align: 64, offset: 1728)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !31, line: 323, baseType: !140)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !44, file: !31, line: 386, baseType: !302, size: 64, align: 64, offset: 1792)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !31, line: 324, baseType: !140)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !44, file: !31, line: 389, baseType: !304, size: 64, align: 64, offset: 1856)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !306, line: 40, size: 256, align: 64, elements: !307)
!306 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!307 = !{!308, !309, !311, !312}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !305, file: !306, line: 41, baseType: !53, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !305, file: !306, line: 42, baseType: !310, size: 64, align: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !306, line: 18, baseType: !150)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !305, file: !306, line: 43, baseType: !68, size: 32, align: 32, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !305, file: !306, line: 45, baseType: !53, size: 64, align: 64, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !44, file: !31, line: 390, baseType: !314, size: 64, align: 64, offset: 1920)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !31, line: 390, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !44, file: !31, line: 391, baseType: !317, size: 64, align: 64, offset: 1984)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !319, line: 11, size: 320, align: 64, elements: !320)
!319 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!320 = !{!321, !322, !327, !332, !333}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !318, file: !319, line: 12, baseType: !76, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !318, file: !319, line: 13, baseType: !323, size: 64, align: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !319, line: 8, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!29, !29, !114}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !318, file: !319, line: 14, baseType: !328, size: 64, align: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !319, line: 9, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64, align: 64)
!330 = !DISubroutineType(types: !331)
!331 = !{!68, !29, !29, !114}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !318, file: !319, line: 15, baseType: !76, size: 64, align: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !318, file: !319, line: 16, baseType: !114, size: 64, align: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !44, file: !31, line: 392, baseType: !43, size: 64, align: 64, offset: 2048)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !44, file: !31, line: 393, baseType: !29, size: 64, align: 64, offset: 2112)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !44, file: !31, line: 394, baseType: !337, size: 64, align: 64, offset: 2176)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !31, line: 325, baseType: !159)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !44, file: !31, line: 395, baseType: !339, size: 64, align: 64, offset: 2240)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !31, line: 326, baseType: !235)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !44, file: !31, line: 396, baseType: !35, size: 64, align: 64, offset: 2304)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !44, file: !31, line: 397, baseType: !342, size: 64, align: 64, offset: 2368)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !31, line: 327, baseType: !235)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !44, file: !31, line: 398, baseType: !344, size: 64, align: 64, offset: 2432)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !31, line: 329, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!29, !43, !35}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !44, file: !31, line: 399, baseType: !349, size: 64, align: 64, offset: 2496)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !31, line: 328, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!29, !43, !29, !29}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !44, file: !31, line: 400, baseType: !354, size: 64, align: 64, offset: 2560)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !31, line: 307, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !114}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !44, file: !31, line: 401, baseType: !167, size: 64, align: 64, offset: 2624)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !44, file: !31, line: 402, baseType: !29, size: 64, align: 64, offset: 2688)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !44, file: !31, line: 403, baseType: !29, size: 64, align: 64, offset: 2752)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !44, file: !31, line: 404, baseType: !29, size: 64, align: 64, offset: 2816)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !44, file: !31, line: 405, baseType: !29, size: 64, align: 64, offset: 2880)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !44, file: !31, line: 406, baseType: !29, size: 64, align: 64, offset: 2944)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !44, file: !31, line: 407, baseType: !59, size: 64, align: 64, offset: 3008)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !44, file: !31, line: 410, baseType: !366, size: 32, align: 32, offset: 3072)
!366 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !44, file: !31, line: 412, baseType: !59, size: 64, align: 64, offset: 3136)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !23, file: !14, line: 25, baseType: !29, size: 64, align: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !23, file: !14, line: 26, baseType: !29, size: 64, align: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !23, file: !14, line: 27, baseType: !29, size: 64, align: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !23, file: !14, line: 28, baseType: !29, size: 64, align: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !23, file: !14, line: 30, baseType: !29, size: 64, align: 64, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !23, file: !14, line: 31, baseType: !29, size: 64, align: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !23, file: !14, line: 32, baseType: !29, size: 64, align: 64, offset: 576)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !23, file: !14, line: 33, baseType: !68, size: 32, align: 32, offset: 640)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !23, file: !14, line: 34, baseType: !68, size: 32, align: 32, offset: 672)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !23, file: !14, line: 37, baseType: !68, size: 32, align: 32, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !23, file: !14, line: 43, baseType: !29, size: 64, align: 64, offset: 768)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !15, file: !14, line: 76, baseType: !380, size: 64, align: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !14, line: 50, flags: DIFlagFwdDecl)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !15, file: !14, line: 77, baseType: !68, size: 32, align: 32, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !15, file: !14, line: 78, baseType: !55, size: 8, align: 8, offset: 288)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !15, file: !14, line: 80, baseType: !55, size: 8, align: 8, offset: 296)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !15, file: !14, line: 85, baseType: !68, size: 32, align: 32, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !15, file: !14, line: 86, baseType: !68, size: 32, align: 32, offset: 352)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !15, file: !14, line: 88, baseType: !388, size: 64, align: 64, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !14, line: 54, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!68, !29, !380, !68, !29}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !15, file: !14, line: 89, baseType: !388, size: 64, align: 64, offset: 448)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !15, file: !14, line: 90, baseType: !29, size: 64, align: 64, offset: 512)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !15, file: !14, line: 91, baseType: !29, size: 64, align: 64, offset: 576)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !15, file: !14, line: 93, baseType: !29, size: 64, align: 64, offset: 640)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !15, file: !14, line: 94, baseType: !29, size: 64, align: 64, offset: 704)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !15, file: !14, line: 95, baseType: !29, size: 64, align: 64, offset: 768)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !15, file: !14, line: 97, baseType: !29, size: 64, align: 64, offset: 832)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !15, file: !14, line: 98, baseType: !29, size: 64, align: 64, offset: 896)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !15, file: !14, line: 99, baseType: !29, size: 64, align: 64, offset: 960)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !15, file: !14, line: 101, baseType: !29, size: 64, align: 64, offset: 1024)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !15, file: !14, line: 103, baseType: !68, size: 32, align: 32, offset: 1088)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !15, file: !14, line: 105, baseType: !29, size: 64, align: 64, offset: 1152)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !15, file: !14, line: 106, baseType: !41, size: 64, align: 64, offset: 1216)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !15, file: !14, line: 108, baseType: !68, size: 32, align: 32, offset: 1280)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !15, file: !14, line: 109, baseType: !29, size: 64, align: 64, offset: 1344)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !15, file: !14, line: 134, baseType: !355, size: 64, align: 64, offset: 1408)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !15, file: !14, line: 135, baseType: !114, size: 64, align: 64, offset: 1472)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !31, line: 422, baseType: !44)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !413, line: 33, baseType: !414)
!413 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!414 = !DICompositeType(tag: DW_TAG_structure_type, file: !413, line: 25, size: 256, align: 64, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !414, file: !413, line: 26, baseType: !47, size: 192, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !414, file: !413, line: 27, baseType: !418, size: 64, align: 64, offset: 192)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 64, align: 64, elements: !106)
!419 = !{!420, !464, !508, !514, !517, !529, !539, !553, !556, !604, !615, !619, !636, !665, !668, !669, !673, !695, !708, !711, !731, !737, !738, !763, !796, !817, !849, !853, !888, !901, !908, !915, !924, !929, !932}
!420 = !DISubprogram(name: "PyErr_Restore", scope: !421, file: !421, line: 28, type: !422, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, %struct._object*, %struct._object*)* @PyErr_Restore, variables: !424)
!421 = !DIFile(filename: "Python/errors.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!422 = !DISubroutineType(types: !423)
!423 = !{null, !29, !29, !29}
!424 = !{!425, !426, !427, !428, !429, !436, !437, !440, !442, !443, !444, !445, !449, !451, !454, !456, !459, !461}
!425 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !420, file: !421, line: 28, type: !29)
!426 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !420, file: !421, line: 28, type: !29)
!427 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "traceback", arg: 3, scope: !420, file: !421, line: 28, type: !29)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !420, file: !421, line: 30, type: !12)
!429 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !430, file: !421, line: 30, type: !431)
!430 = distinct !DILexicalBlock(scope: !420, file: !421, line: 30, column: 61)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !4, line: 33, baseType: !433)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !4, line: 31, size: 64, align: 64, elements: !434)
!434 = !{!435}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !433, file: !4, line: 32, baseType: !114, size: 64, align: 64)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !430, file: !421, line: 30, type: !114)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !430, file: !421, line: 30, type: !438)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !114)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !430, file: !421, line: 30, type: !441)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !4, line: 29, baseType: !3)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldtype", scope: !420, file: !421, line: 31, type: !29)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldvalue", scope: !420, file: !421, line: 31, type: !29)
!444 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldtraceback", scope: !420, file: !421, line: 31, type: !29)
!445 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !446, file: !421, line: 36, type: !29)
!446 = distinct !DILexicalBlock(scope: !447, file: !421, line: 36, column: 12)
!447 = distinct !DILexicalBlock(scope: !448, file: !421, line: 33, column: 97)
!448 = distinct !DILexicalBlock(scope: !420, file: !421, line: 33, column: 9)
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !450, file: !421, line: 50, type: !29)
!450 = distinct !DILexicalBlock(scope: !420, file: !421, line: 50, column: 8)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !452, file: !421, line: 50, type: !29)
!452 = distinct !DILexicalBlock(scope: !453, file: !421, line: 50, column: 99)
!453 = distinct !DILexicalBlock(scope: !450, file: !421, line: 50, column: 65)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !455, file: !421, line: 51, type: !29)
!455 = distinct !DILexicalBlock(scope: !420, file: !421, line: 51, column: 8)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !457, file: !421, line: 51, type: !29)
!457 = distinct !DILexicalBlock(scope: !458, file: !421, line: 51, column: 100)
!458 = distinct !DILexicalBlock(scope: !455, file: !421, line: 51, column: 66)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !460, file: !421, line: 52, type: !29)
!460 = distinct !DILexicalBlock(scope: !420, file: !421, line: 52, column: 8)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !462, file: !421, line: 52, type: !29)
!462 = distinct !DILexicalBlock(scope: !463, file: !421, line: 52, column: 104)
!463 = distinct !DILexicalBlock(scope: !460, file: !421, line: 52, column: 70)
!464 = !DISubprogram(name: "PyErr_SetObject", scope: !421, file: !421, line: 56, type: !465, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, %struct._object*)* @PyErr_SetObject, variables: !467)
!465 = !DISubroutineType(types: !466)
!466 = !{null, !29, !29}
!467 = !{!468, !469, !470, !471, !473, !474, !475, !476, !477, !478, !480, !485, !486, !488, !491, !493, !496, !499, !500, !503, !506}
!468 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exception", arg: 1, scope: !464, file: !421, line: 56, type: !29)
!469 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 2, scope: !464, file: !421, line: 56, type: !29)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !464, file: !421, line: 58, type: !12)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !472, file: !421, line: 58, type: !431)
!472 = distinct !DILexicalBlock(scope: !464, file: !421, line: 58, column: 61)
!473 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !472, file: !421, line: 58, type: !114)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !472, file: !421, line: 58, type: !438)
!475 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !472, file: !421, line: 58, type: !441)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc_value", scope: !464, file: !421, line: 59, type: !29)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !464, file: !421, line: 60, type: !29)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !479, file: !421, line: 69, type: !29)
!479 = distinct !DILexicalBlock(scope: !464, file: !421, line: 69, column: 8)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !481, file: !421, line: 76, type: !29)
!481 = distinct !DILexicalBlock(scope: !482, file: !421, line: 74, column: 92)
!482 = distinct !DILexicalBlock(scope: !483, file: !421, line: 74, column: 13)
!483 = distinct !DILexicalBlock(scope: !484, file: !421, line: 71, column: 68)
!484 = distinct !DILexicalBlock(scope: !464, file: !421, line: 71, column: 9)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fixed_value", scope: !481, file: !421, line: 76, type: !29)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !487, file: !421, line: 92, type: !29)
!487 = distinct !DILexicalBlock(scope: !481, file: !421, line: 92, column: 16)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !489, file: !421, line: 92, type: !29)
!489 = distinct !DILexicalBlock(scope: !490, file: !421, line: 92, column: 104)
!490 = distinct !DILexicalBlock(scope: !487, file: !421, line: 92, column: 70)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !492, file: !421, line: 93, type: !29)
!492 = distinct !DILexicalBlock(scope: !481, file: !421, line: 93, column: 16)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !494, file: !421, line: 93, type: !29)
!494 = distinct !DILexicalBlock(scope: !495, file: !421, line: 93, column: 105)
!495 = distinct !DILexicalBlock(scope: !492, file: !421, line: 93, column: 71)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !497, file: !421, line: 103, type: !29)
!497 = distinct !DILexicalBlock(scope: !498, file: !421, line: 102, column: 33)
!498 = distinct !DILexicalBlock(scope: !483, file: !421, line: 102, column: 13)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "context", scope: !497, file: !421, line: 103, type: !29)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !501, file: !421, line: 105, type: !29)
!501 = distinct !DILexicalBlock(scope: !502, file: !421, line: 105, column: 20)
!502 = distinct !DILexicalBlock(scope: !497, file: !421, line: 104, column: 59)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !504, file: !421, line: 114, type: !29)
!504 = distinct !DILexicalBlock(scope: !505, file: !421, line: 114, column: 16)
!505 = distinct !DILexicalBlock(scope: !498, file: !421, line: 113, column: 16)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !507, file: !421, line: 119, type: !29)
!507 = distinct !DILexicalBlock(scope: !464, file: !421, line: 119, column: 8)
!508 = !DISubprogram(name: "_PyErr_SetKeyError", scope: !421, file: !421, line: 127, type: !61, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @_PyErr_SetKeyError, variables: !509)
!509 = !{!510, !511, !512}
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 1, scope: !508, file: !421, line: 127, type: !29)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tup", scope: !508, file: !421, line: 129, type: !29)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !513, file: !421, line: 134, type: !29)
!513 = distinct !DILexicalBlock(scope: !508, file: !421, line: 134, column: 8)
!514 = !DISubprogram(name: "PyErr_SetNone", scope: !421, file: !421, line: 138, type: !61, isLocal: false, isDefinition: true, scopeLine: 139, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @PyErr_SetNone, variables: !515)
!515 = !{!516}
!516 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exception", arg: 1, scope: !514, file: !421, line: 138, type: !29)
!517 = !DISubprogram(name: "PyErr_SetString", scope: !421, file: !421, line: 144, type: !518, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, i8*)* @PyErr_SetString, variables: !520)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !29, !53}
!520 = !{!521, !522, !523, !524, !526}
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exception", arg: 1, scope: !517, file: !421, line: 144, type: !29)
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "string", arg: 2, scope: !517, file: !421, line: 144, type: !53)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !517, file: !421, line: 146, type: !29)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !525, file: !421, line: 148, type: !29)
!525 = distinct !DILexicalBlock(scope: !517, file: !421, line: 148, column: 8)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !527, file: !421, line: 148, type: !29)
!527 = distinct !DILexicalBlock(scope: !528, file: !421, line: 148, column: 97)
!528 = distinct !DILexicalBlock(scope: !525, file: !421, line: 148, column: 63)
!529 = !DISubprogram(name: "PyErr_Occurred", scope: !421, file: !421, line: 153, type: !530, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyErr_Occurred, variables: !532)
!530 = !DISubroutineType(types: !531)
!531 = !{!29}
!532 = !{!533, !534, !536, !537, !538}
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !529, file: !421, line: 159, type: !12)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !535, file: !421, line: 160, type: !431)
!535 = distinct !DILexicalBlock(scope: !529, file: !421, line: 160, column: 41)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !535, file: !421, line: 160, type: !114)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !535, file: !421, line: 160, type: !438)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !535, file: !421, line: 160, type: !441)
!539 = !DISubprogram(name: "PyErr_GivenExceptionMatches", scope: !421, file: !421, line: 167, type: !222, isLocal: false, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*)* @PyErr_GivenExceptionMatches, variables: !540)
!540 = !{!541, !542, !543, !546, !547, !550, !551, !552}
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "err", arg: 1, scope: !539, file: !421, line: 167, type: !29)
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 2, scope: !539, file: !421, line: 167, type: !29)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !544, file: !421, line: 174, type: !35)
!544 = distinct !DILexicalBlock(scope: !545, file: !421, line: 173, column: 77)
!545 = distinct !DILexicalBlock(scope: !539, file: !421, line: 173, column: 9)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !544, file: !421, line: 174, type: !35)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !548, file: !421, line: 191, type: !68)
!548 = distinct !DILexicalBlock(scope: !549, file: !421, line: 190, column: 277)
!549 = distinct !DILexicalBlock(scope: !539, file: !421, line: 190, column: 9)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exception", scope: !548, file: !421, line: 192, type: !29)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !548, file: !421, line: 192, type: !29)
!552 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !548, file: !421, line: 192, type: !29)
!553 = !DISubprogram(name: "PyErr_ExceptionMatches", scope: !421, file: !421, line: 211, type: !169, isLocal: false, isDefinition: true, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @PyErr_ExceptionMatches, variables: !554)
!554 = !{!555}
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !553, file: !421, line: 211, type: !29)
!556 = !DISubprogram(name: "PyErr_NormalizeException", scope: !421, file: !421, line: 224, type: !557, isLocal: false, isDefinition: true, scopeLine: 225, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object**, %struct._object**, %struct._object**)* @PyErr_NormalizeException, variables: !560)
!557 = !DISubroutineType(types: !558)
!558 = !{null, !559, !559, !559}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!560 = !{!561, !562, !563, !564, !565, !566, !567, !568, !569, !572, !575, !576, !578, !580, !584, !586, !588, !593, !595, !596, !597, !598, !602}
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !556, file: !421, line: 224, type: !559)
!562 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "val", arg: 2, scope: !556, file: !421, line: 224, type: !559)
!563 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tb", arg: 3, scope: !556, file: !421, line: 224, type: !559)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !556, file: !421, line: 226, type: !29)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !556, file: !421, line: 227, type: !29)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inclass", scope: !556, file: !421, line: 228, type: !29)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "initial_tb", scope: !556, file: !421, line: 229, type: !29)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !556, file: !421, line: 230, type: !12)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "is_subclass", scope: !570, file: !421, line: 252, type: !68)
!570 = distinct !DILexicalBlock(scope: !571, file: !421, line: 251, column: 144)
!571 = distinct !DILexicalBlock(scope: !556, file: !421, line: 251, column: 9)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !573, file: !421, line: 267, type: !29)
!573 = distinct !DILexicalBlock(scope: !574, file: !421, line: 266, column: 39)
!574 = distinct !DILexicalBlock(scope: !570, file: !421, line: 266, column: 13)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !573, file: !421, line: 267, type: !29)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !577, file: !421, line: 281, type: !29)
!577 = distinct !DILexicalBlock(scope: !573, file: !421, line: 281, column: 16)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !579, file: !421, line: 284, type: !29)
!579 = distinct !DILexicalBlock(scope: !573, file: !421, line: 284, column: 16)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !581, file: !421, line: 291, type: !29)
!581 = distinct !DILexicalBlock(scope: !582, file: !421, line: 291, column: 16)
!582 = distinct !DILexicalBlock(scope: !583, file: !421, line: 290, column: 35)
!583 = distinct !DILexicalBlock(scope: !574, file: !421, line: 290, column: 18)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !585, file: !421, line: 300, type: !29)
!585 = distinct !DILexicalBlock(scope: !556, file: !421, line: 300, column: 8)
!586 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !587, file: !421, line: 301, type: !29)
!587 = distinct !DILexicalBlock(scope: !556, file: !421, line: 301, column: 8)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !589, file: !421, line: 312, type: !29)
!589 = distinct !DILexicalBlock(scope: !590, file: !421, line: 312, column: 16)
!590 = distinct !DILexicalBlock(scope: !591, file: !421, line: 309, column: 13)
!591 = distinct !DILexicalBlock(scope: !592, file: !421, line: 308, column: 35)
!592 = distinct !DILexicalBlock(scope: !556, file: !421, line: 308, column: 9)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !594, file: !421, line: 315, type: !431)
!594 = distinct !DILexicalBlock(scope: !556, file: !421, line: 315, column: 46)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !594, file: !421, line: 315, type: !114)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !594, file: !421, line: 315, type: !438)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !594, file: !421, line: 315, type: !441)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !599, file: !421, line: 319, type: !29)
!599 = distinct !DILexicalBlock(scope: !600, file: !421, line: 319, column: 12)
!600 = distinct !DILexicalBlock(scope: !601, file: !421, line: 316, column: 61)
!601 = distinct !DILexicalBlock(scope: !556, file: !421, line: 316, column: 9)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !603, file: !421, line: 320, type: !29)
!603 = distinct !DILexicalBlock(scope: !600, file: !421, line: 320, column: 12)
!604 = !DISubprogram(name: "PyErr_Fetch", scope: !421, file: !421, line: 335, type: !557, isLocal: false, isDefinition: true, scopeLine: 336, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object**, %struct._object**, %struct._object**)* @PyErr_Fetch, variables: !605)
!605 = !{!606, !607, !608, !609, !610, !612, !613, !614}
!606 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_type", arg: 1, scope: !604, file: !421, line: 335, type: !559)
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_value", arg: 2, scope: !604, file: !421, line: 335, type: !559)
!608 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_traceback", arg: 3, scope: !604, file: !421, line: 335, type: !559)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !604, file: !421, line: 337, type: !12)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !611, file: !421, line: 337, type: !431)
!611 = distinct !DILexicalBlock(scope: !604, file: !421, line: 337, column: 61)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !611, file: !421, line: 337, type: !114)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !611, file: !421, line: 337, type: !438)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !611, file: !421, line: 337, type: !441)
!615 = !DISubprogram(name: "PyErr_Clear", scope: !421, file: !421, line: 349, type: !616, isLocal: false, isDefinition: true, scopeLine: 350, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyErr_Clear, variables: !618)
!616 = !DISubroutineType(types: !617)
!617 = !{null}
!618 = !{}
!619 = !DISubprogram(name: "PyErr_GetExcInfo", scope: !421, file: !421, line: 355, type: !557, isLocal: false, isDefinition: true, scopeLine: 356, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object**, %struct._object**, %struct._object**)* @PyErr_GetExcInfo, variables: !620)
!620 = !{!621, !622, !623, !624, !625, !627, !628, !629, !630, !632, !634}
!621 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_type", arg: 1, scope: !619, file: !421, line: 355, type: !559)
!622 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_value", arg: 2, scope: !619, file: !421, line: 355, type: !559)
!623 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_traceback", arg: 3, scope: !619, file: !421, line: 355, type: !559)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !619, file: !421, line: 357, type: !12)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !626, file: !421, line: 357, type: !431)
!626 = distinct !DILexicalBlock(scope: !619, file: !421, line: 357, column: 61)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !626, file: !421, line: 357, type: !114)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !626, file: !421, line: 357, type: !438)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !626, file: !421, line: 357, type: !441)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !631, file: !421, line: 363, type: !29)
!631 = distinct !DILexicalBlock(scope: !619, file: !421, line: 363, column: 8)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !633, file: !421, line: 364, type: !29)
!633 = distinct !DILexicalBlock(scope: !619, file: !421, line: 364, column: 8)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !635, file: !421, line: 365, type: !29)
!635 = distinct !DILexicalBlock(scope: !619, file: !421, line: 365, column: 8)
!636 = !DISubprogram(name: "PyErr_SetExcInfo", scope: !421, file: !421, line: 369, type: !422, isLocal: false, isDefinition: true, scopeLine: 370, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, %struct._object*, %struct._object*)* @PyErr_SetExcInfo, variables: !637)
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645, !647, !648, !649, !650, !652, !655, !657, !660, !662}
!638 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_type", arg: 1, scope: !636, file: !421, line: 369, type: !29)
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_value", arg: 2, scope: !636, file: !421, line: 369, type: !29)
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_traceback", arg: 3, scope: !636, file: !421, line: 369, type: !29)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldtype", scope: !636, file: !421, line: 371, type: !29)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldvalue", scope: !636, file: !421, line: 371, type: !29)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldtraceback", scope: !636, file: !421, line: 371, type: !29)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !636, file: !421, line: 372, type: !12)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !646, file: !421, line: 372, type: !431)
!646 = distinct !DILexicalBlock(scope: !636, file: !421, line: 372, column: 61)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !646, file: !421, line: 372, type: !114)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !646, file: !421, line: 372, type: !438)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !646, file: !421, line: 372, type: !441)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !651, file: !421, line: 382, type: !29)
!651 = distinct !DILexicalBlock(scope: !636, file: !421, line: 382, column: 8)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !653, file: !421, line: 382, type: !29)
!653 = distinct !DILexicalBlock(scope: !654, file: !421, line: 382, column: 99)
!654 = distinct !DILexicalBlock(scope: !651, file: !421, line: 382, column: 65)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !656, file: !421, line: 383, type: !29)
!656 = distinct !DILexicalBlock(scope: !636, file: !421, line: 383, column: 8)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !658, file: !421, line: 383, type: !29)
!658 = distinct !DILexicalBlock(scope: !659, file: !421, line: 383, column: 100)
!659 = distinct !DILexicalBlock(scope: !656, file: !421, line: 383, column: 66)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !661, file: !421, line: 384, type: !29)
!661 = distinct !DILexicalBlock(scope: !636, file: !421, line: 384, column: 8)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !663, file: !421, line: 384, type: !29)
!663 = distinct !DILexicalBlock(scope: !664, file: !421, line: 384, column: 104)
!664 = distinct !DILexicalBlock(scope: !661, file: !421, line: 384, column: 70)
!665 = !DISubprogram(name: "PyErr_BadArgument", scope: !421, file: !421, line: 390, type: !666, isLocal: false, isDefinition: true, scopeLine: 391, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @PyErr_BadArgument, variables: !618)
!666 = !DISubroutineType(types: !667)
!667 = !{!68}
!668 = !DISubprogram(name: "PyErr_NoMemory", scope: !421, file: !421, line: 398, type: !530, isLocal: false, isDefinition: true, scopeLine: 399, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyErr_NoMemory, variables: !618)
!669 = !DISubprogram(name: "PyErr_SetFromErrnoWithFilenameObject", scope: !421, file: !421, line: 411, type: !151, isLocal: false, isDefinition: true, scopeLine: 412, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @PyErr_SetFromErrnoWithFilenameObject, variables: !670)
!670 = !{!671, !672}
!671 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !669, file: !421, line: 411, type: !29)
!672 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filenameObject", arg: 2, scope: !669, file: !421, line: 411, type: !29)
!673 = !DISubprogram(name: "PyErr_SetFromErrnoWithFilenameObjects", scope: !421, file: !421, line: 417, type: !160, isLocal: false, isDefinition: true, scopeLine: 418, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @PyErr_SetFromErrnoWithFilenameObjects, variables: !674)
!674 = !{!675, !676, !677, !678, !679, !680, !681, !682, !685, !687, !691}
!675 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !673, file: !421, line: 417, type: !29)
!676 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filenameObject", arg: 2, scope: !673, file: !421, line: 417, type: !29)
!677 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filenameObject2", arg: 3, scope: !673, file: !421, line: 417, type: !29)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "message", scope: !673, file: !421, line: 419, type: !29)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !673, file: !421, line: 420, type: !29)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !673, file: !421, line: 420, type: !29)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !673, file: !421, line: 421, type: !68)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !683, file: !421, line: 433, type: !76)
!683 = distinct !DILexicalBlock(scope: !684, file: !421, line: 432, column: 17)
!684 = distinct !DILexicalBlock(scope: !673, file: !421, line: 432, column: 9)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !686, file: !421, line: 498, type: !29)
!686 = distinct !DILexicalBlock(scope: !673, file: !421, line: 498, column: 8)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !688, file: !421, line: 502, type: !29)
!688 = distinct !DILexicalBlock(scope: !689, file: !421, line: 502, column: 12)
!689 = distinct !DILexicalBlock(scope: !690, file: !421, line: 500, column: 29)
!690 = distinct !DILexicalBlock(scope: !673, file: !421, line: 500, column: 9)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !692, file: !421, line: 505, type: !29)
!692 = distinct !DILexicalBlock(scope: !693, file: !421, line: 505, column: 16)
!693 = distinct !DILexicalBlock(scope: !694, file: !421, line: 503, column: 30)
!694 = distinct !DILexicalBlock(scope: !689, file: !421, line: 503, column: 13)
!695 = !DISubprogram(name: "PyErr_SetFromErrnoWithFilename", scope: !421, file: !421, line: 515, type: !696, isLocal: false, isDefinition: true, scopeLine: 516, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*)* @PyErr_SetFromErrnoWithFilename, variables: !698)
!696 = !DISubroutineType(types: !697)
!697 = !{!29, !29, !53}
!698 = !{!699, !700, !701, !702, !703, !705}
!699 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !695, file: !421, line: 515, type: !29)
!700 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 2, scope: !695, file: !421, line: 515, type: !53)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !695, file: !421, line: 517, type: !29)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !695, file: !421, line: 518, type: !29)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !704, file: !421, line: 519, type: !29)
!704 = distinct !DILexicalBlock(scope: !695, file: !421, line: 519, column: 8)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !706, file: !421, line: 519, type: !29)
!706 = distinct !DILexicalBlock(scope: !707, file: !421, line: 519, column: 96)
!707 = distinct !DILexicalBlock(scope: !704, file: !421, line: 519, column: 62)
!708 = !DISubprogram(name: "PyErr_SetFromErrno", scope: !421, file: !421, line: 537, type: !141, isLocal: false, isDefinition: true, scopeLine: 538, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyErr_SetFromErrno, variables: !709)
!709 = !{!710}
!710 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !708, file: !421, line: 537, type: !29)
!711 = !DISubprogram(name: "PyErr_SetImportError", scope: !421, file: !421, line: 686, type: !160, isLocal: false, isDefinition: true, scopeLine: 687, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @PyErr_SetImportError, variables: !712)
!712 = !{!713, !714, !715, !716, !717, !718, !719, !723, !727, !729}
!713 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "msg", arg: 1, scope: !711, file: !421, line: 686, type: !29)
!714 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 2, scope: !711, file: !421, line: 686, type: !29)
!715 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 3, scope: !711, file: !421, line: 686, type: !29)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args", scope: !711, file: !421, line: 688, type: !29)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "kwargs", scope: !711, file: !421, line: 688, type: !29)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error", scope: !711, file: !421, line: 688, type: !29)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !720, file: !421, line: 699, type: !29)
!720 = distinct !DILexicalBlock(scope: !721, file: !421, line: 699, column: 12)
!721 = distinct !DILexicalBlock(scope: !722, file: !421, line: 698, column: 31)
!722 = distinct !DILexicalBlock(scope: !711, file: !421, line: 698, column: 9)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !724, file: !421, line: 722, type: !29)
!724 = distinct !DILexicalBlock(scope: !725, file: !421, line: 722, column: 12)
!725 = distinct !DILexicalBlock(scope: !726, file: !421, line: 720, column: 30)
!726 = distinct !DILexicalBlock(scope: !711, file: !421, line: 720, column: 9)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !728, file: !421, line: 725, type: !29)
!728 = distinct !DILexicalBlock(scope: !711, file: !421, line: 725, column: 8)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !730, file: !421, line: 726, type: !29)
!730 = distinct !DILexicalBlock(scope: !711, file: !421, line: 726, column: 8)
!731 = !DISubprogram(name: "_PyErr_BadInternalCall", scope: !421, file: !421, line: 732, type: !732, isLocal: false, isDefinition: true, scopeLine: 733, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32)* @_PyErr_BadInternalCall, variables: !734)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !53, !68}
!734 = !{!735, !736}
!735 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !731, file: !421, line: 732, type: !53)
!736 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 2, scope: !731, file: !421, line: 732, type: !68)
!737 = !DISubprogram(name: "PyErr_BadInternalCall", scope: !421, file: !421, line: 743, type: !616, isLocal: false, isDefinition: true, scopeLine: 744, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyErr_BadInternalCall, variables: !618)
!738 = !DISubprogram(name: "PyErr_Format", scope: !421, file: !421, line: 754, type: !739, isLocal: false, isDefinition: true, scopeLine: 755, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*, ...)* @PyErr_Format, variables: !741)
!739 = !DISubroutineType(types: !740)
!740 = !{!29, !29, !53, null}
!741 = !{!742, !743, !744, !757, !758, !760}
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exception", arg: 1, scope: !738, file: !421, line: 754, type: !29)
!743 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 2, scope: !738, file: !421, line: 754, type: !53)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vargs", scope: !738, file: !421, line: 756, type: !745)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !38, line: 79, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !747, line: 50, baseType: !748)
!747 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stdarg.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 756, baseType: !749)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !750, size: 192, align: 64, elements: !106)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "__va_list_tag", file: !1, line: 756, baseType: !751)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 756, size: 192, align: 64, elements: !752)
!752 = !{!753, !754, !755, !756}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !751, file: !1, line: 756, baseType: !366, size: 32, align: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !751, file: !1, line: 756, baseType: !366, size: 32, align: 32, offset: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !751, file: !1, line: 756, baseType: !114, size: 64, align: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !751, file: !1, line: 756, baseType: !114, size: 64, align: 64, offset: 128)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "string", scope: !738, file: !421, line: 757, type: !29)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !759, file: !421, line: 773, type: !29)
!759 = distinct !DILexicalBlock(scope: !738, file: !421, line: 773, column: 8)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !761, file: !421, line: 773, type: !29)
!761 = distinct !DILexicalBlock(scope: !762, file: !421, line: 773, column: 98)
!762 = distinct !DILexicalBlock(scope: !759, file: !421, line: 773, column: 64)
!763 = !DISubprogram(name: "PyErr_NewException", scope: !421, file: !421, line: 781, type: !764, isLocal: false, isDefinition: true, scopeLine: 782, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, %struct._object*, %struct._object*)* @PyErr_NewException, variables: !766)
!764 = !DISubroutineType(types: !765)
!765 = !{!29, !53, !29, !29}
!766 = !{!767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !778, !781, !783, !786, !788, !791, !793}
!767 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !763, file: !421, line: 781, type: !53)
!768 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 2, scope: !763, file: !421, line: 781, type: !29)
!769 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dict", arg: 3, scope: !763, file: !421, line: 781, type: !29)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dot", scope: !763, file: !421, line: 783, type: !53)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "modulename", scope: !763, file: !421, line: 784, type: !29)
!772 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "classname", scope: !763, file: !421, line: 785, type: !29)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mydict", scope: !763, file: !421, line: 786, type: !29)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bases", scope: !763, file: !421, line: 787, type: !29)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !763, file: !421, line: 788, type: !29)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !777, file: !421, line: 823, type: !29)
!777 = distinct !DILexicalBlock(scope: !763, file: !421, line: 823, column: 8)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !779, file: !421, line: 823, type: !29)
!779 = distinct !DILexicalBlock(scope: !780, file: !421, line: 823, column: 97)
!780 = distinct !DILexicalBlock(scope: !777, file: !421, line: 823, column: 63)
!781 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !782, file: !421, line: 824, type: !29)
!782 = distinct !DILexicalBlock(scope: !763, file: !421, line: 824, column: 8)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !784, file: !421, line: 824, type: !29)
!784 = distinct !DILexicalBlock(scope: !785, file: !421, line: 824, column: 98)
!785 = distinct !DILexicalBlock(scope: !782, file: !421, line: 824, column: 64)
!786 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !787, file: !421, line: 825, type: !29)
!787 = distinct !DILexicalBlock(scope: !763, file: !421, line: 825, column: 8)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !789, file: !421, line: 825, type: !29)
!789 = distinct !DILexicalBlock(scope: !790, file: !421, line: 825, column: 101)
!790 = distinct !DILexicalBlock(scope: !787, file: !421, line: 825, column: 67)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !792, file: !421, line: 826, type: !29)
!792 = distinct !DILexicalBlock(scope: !763, file: !421, line: 826, column: 8)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !794, file: !421, line: 826, type: !29)
!794 = distinct !DILexicalBlock(scope: !795, file: !421, line: 826, column: 102)
!795 = distinct !DILexicalBlock(scope: !792, file: !421, line: 826, column: 68)
!796 = !DISubprogram(name: "PyErr_NewExceptionWithDoc", scope: !421, file: !421, line: 833, type: !797, isLocal: false, isDefinition: true, scopeLine: 835, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i8*, %struct._object*, %struct._object*)* @PyErr_NewExceptionWithDoc, variables: !799)
!797 = !DISubroutineType(types: !798)
!798 = !{!29, !53, !53, !29, !29}
!799 = !{!800, !801, !802, !803, !804, !805, !806, !807, !808, !812, !814}
!800 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "name", arg: 1, scope: !796, file: !421, line: 833, type: !53)
!801 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "doc", arg: 2, scope: !796, file: !421, line: 833, type: !53)
!802 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 3, scope: !796, file: !421, line: 834, type: !29)
!803 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dict", arg: 4, scope: !796, file: !421, line: 834, type: !29)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !796, file: !421, line: 836, type: !68)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !796, file: !421, line: 837, type: !29)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mydict", scope: !796, file: !421, line: 838, type: !29)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "docobj", scope: !796, file: !421, line: 839, type: !29)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !809, file: !421, line: 853, type: !29)
!809 = distinct !DILexicalBlock(scope: !810, file: !421, line: 853, column: 12)
!810 = distinct !DILexicalBlock(scope: !811, file: !421, line: 848, column: 28)
!811 = distinct !DILexicalBlock(scope: !796, file: !421, line: 848, column: 9)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !813, file: !421, line: 860, type: !29)
!813 = distinct !DILexicalBlock(scope: !796, file: !421, line: 860, column: 8)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !815, file: !421, line: 860, type: !29)
!815 = distinct !DILexicalBlock(scope: !816, file: !421, line: 860, column: 98)
!816 = distinct !DILexicalBlock(scope: !813, file: !421, line: 860, column: 64)
!817 = !DISubprogram(name: "PyErr_WriteUnraisable", scope: !421, file: !421, line: 868, type: !61, isLocal: false, isDefinition: true, scopeLine: 869, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @PyErr_WriteUnraisable, variables: !818)
!818 = !{!819, !820, !821, !822, !823, !824, !825, !826, !829, !831, !834, !836, !839, !841, !844, !846}
!819 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !817, file: !421, line: 868, type: !29)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !817, file: !421, line: 871, type: !29)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !817, file: !421, line: 871, type: !29)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !817, file: !421, line: 871, type: !29)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !817, file: !421, line: 871, type: !29)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "moduleName", scope: !817, file: !421, line: 872, type: !29)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "className", scope: !817, file: !421, line: 873, type: !76)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dot", scope: !827, file: !421, line: 899, type: !76)
!827 = distinct !DILexicalBlock(scope: !828, file: !421, line: 898, column: 34)
!828 = distinct !DILexicalBlock(scope: !817, file: !421, line: 898, column: 9)
!829 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !830, file: !421, line: 937, type: !29)
!830 = distinct !DILexicalBlock(scope: !817, file: !421, line: 937, column: 8)
!831 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !832, file: !421, line: 937, type: !29)
!832 = distinct !DILexicalBlock(scope: !833, file: !421, line: 937, column: 102)
!833 = distinct !DILexicalBlock(scope: !830, file: !421, line: 937, column: 68)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !835, file: !421, line: 938, type: !29)
!835 = distinct !DILexicalBlock(scope: !817, file: !421, line: 938, column: 8)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !837, file: !421, line: 938, type: !29)
!837 = distinct !DILexicalBlock(scope: !838, file: !421, line: 938, column: 93)
!838 = distinct !DILexicalBlock(scope: !835, file: !421, line: 938, column: 59)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !840, file: !421, line: 939, type: !29)
!840 = distinct !DILexicalBlock(scope: !817, file: !421, line: 939, column: 8)
!841 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !842, file: !421, line: 939, type: !29)
!842 = distinct !DILexicalBlock(scope: !843, file: !421, line: 939, column: 93)
!843 = distinct !DILexicalBlock(scope: !840, file: !421, line: 939, column: 59)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !845, file: !421, line: 940, type: !29)
!845 = distinct !DILexicalBlock(scope: !817, file: !421, line: 940, column: 8)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !847, file: !421, line: 940, type: !29)
!847 = distinct !DILexicalBlock(scope: !848, file: !421, line: 940, column: 94)
!848 = distinct !DILexicalBlock(scope: !845, file: !421, line: 940, column: 60)
!849 = !DISubprogram(name: "PyErr_SyntaxLocation", scope: !421, file: !421, line: 948, type: !732, isLocal: false, isDefinition: true, scopeLine: 949, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32)* @PyErr_SyntaxLocation, variables: !850)
!850 = !{!851, !852}
!851 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !849, file: !421, line: 948, type: !53)
!852 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 2, scope: !849, file: !421, line: 948, type: !68)
!853 = !DISubprogram(name: "PyErr_SyntaxLocationObject", scope: !421, file: !421, line: 959, type: !854, isLocal: false, isDefinition: true, scopeLine: 960, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, i32, i32)* @PyErr_SyntaxLocationObject, variables: !856)
!854 = !DISubroutineType(types: !855)
!855 = !{null, !29, !68, !68}
!856 = !{!857, !858, !859, !860, !861, !862, !863, !864, !868, !874, !880}
!857 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !853, file: !421, line: 959, type: !29)
!858 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 2, scope: !853, file: !421, line: 959, type: !68)
!859 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "col_offset", arg: 3, scope: !853, file: !421, line: 959, type: !68)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc", scope: !853, file: !421, line: 961, type: !29)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !853, file: !421, line: 961, type: !29)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !853, file: !421, line: 961, type: !29)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !853, file: !421, line: 961, type: !29)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !865, file: !421, line: 980, type: !29)
!865 = distinct !DILexicalBlock(scope: !866, file: !421, line: 980, column: 12)
!866 = distinct !DILexicalBlock(scope: !867, file: !421, line: 977, column: 10)
!867 = distinct !DILexicalBlock(scope: !853, file: !421, line: 975, column: 9)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !869, file: !421, line: 989, type: !29)
!869 = distinct !DILexicalBlock(scope: !870, file: !421, line: 989, column: 16)
!870 = distinct !DILexicalBlock(scope: !871, file: !421, line: 986, column: 14)
!871 = distinct !DILexicalBlock(scope: !872, file: !421, line: 984, column: 13)
!872 = distinct !DILexicalBlock(scope: !873, file: !421, line: 982, column: 26)
!873 = distinct !DILexicalBlock(scope: !853, file: !421, line: 982, column: 9)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !875, file: !421, line: 1000, type: !29)
!875 = distinct !DILexicalBlock(scope: !876, file: !421, line: 1000, column: 16)
!876 = distinct !DILexicalBlock(scope: !877, file: !421, line: 997, column: 18)
!877 = distinct !DILexicalBlock(scope: !878, file: !421, line: 997, column: 13)
!878 = distinct !DILexicalBlock(scope: !879, file: !421, line: 992, column: 33)
!879 = distinct !DILexicalBlock(scope: !853, file: !421, line: 992, column: 9)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !881, file: !421, line: 1012, type: !29)
!881 = distinct !DILexicalBlock(scope: !882, file: !421, line: 1012, column: 20)
!882 = distinct !DILexicalBlock(scope: !883, file: !421, line: 1009, column: 22)
!883 = distinct !DILexicalBlock(scope: !884, file: !421, line: 1009, column: 17)
!884 = distinct !DILexicalBlock(scope: !885, file: !421, line: 1007, column: 49)
!885 = distinct !DILexicalBlock(scope: !886, file: !421, line: 1007, column: 13)
!886 = distinct !DILexicalBlock(scope: !887, file: !421, line: 1006, column: 35)
!887 = distinct !DILexicalBlock(scope: !853, file: !421, line: 1006, column: 9)
!888 = !DISubprogram(name: "PyErr_SyntaxLocationEx", scope: !421, file: !421, line: 1027, type: !889, isLocal: false, isDefinition: true, scopeLine: 1028, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32, i32)* @PyErr_SyntaxLocationEx, variables: !891)
!889 = !DISubroutineType(types: !890)
!890 = !{null, !53, !68, !68}
!891 = !{!892, !893, !894, !895, !896, !898}
!892 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !888, file: !421, line: 1027, type: !53)
!893 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 2, scope: !888, file: !421, line: 1027, type: !68)
!894 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "col_offset", arg: 3, scope: !888, file: !421, line: 1027, type: !68)
!895 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fileobj", scope: !888, file: !421, line: 1029, type: !29)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !897, file: !421, line: 1038, type: !29)
!897 = distinct !DILexicalBlock(scope: !888, file: !421, line: 1038, column: 8)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !899, file: !421, line: 1038, type: !29)
!899 = distinct !DILexicalBlock(scope: !900, file: !421, line: 1038, column: 99)
!900 = distinct !DILexicalBlock(scope: !897, file: !421, line: 1038, column: 65)
!901 = !DISubprogram(name: "PyErr_ProgramText", scope: !421, file: !421, line: 1084, type: !902, isLocal: false, isDefinition: true, scopeLine: 1085, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i32)* @PyErr_ProgramText, variables: !904)
!902 = !DISubroutineType(types: !903)
!903 = !{!29, !53, !68}
!904 = !{!905, !906, !907}
!905 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !901, file: !421, line: 1084, type: !53)
!906 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 2, scope: !901, file: !421, line: 1084, type: !68)
!907 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !901, file: !421, line: 1086, type: !69)
!908 = !DISubprogram(name: "PyErr_ProgramTextObject", scope: !421, file: !421, line: 1094, type: !909, isLocal: false, isDefinition: true, scopeLine: 1095, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i32)* @PyErr_ProgramTextObject, variables: !911)
!909 = !DISubroutineType(types: !910)
!910 = !{!29, !29, !68}
!911 = !{!912, !913, !914}
!912 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !908, file: !421, line: 1094, type: !29)
!913 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lineno", arg: 2, scope: !908, file: !421, line: 1094, type: !68)
!914 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fp", scope: !908, file: !421, line: 1096, type: !69)
