; ModuleID = 'programs_new/Python-new/exceptions.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !488, globals: !1803)
!1 = !DIFile(filename: "exceptions.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !50, !102, !369, !385, !403, !404, !337, !406, !414, !107, !40, !344, !428, !444, !452, !470, !471, !473, !475, !56, !477, !485}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBaseExceptionObject", file: !13, line: 18, baseType: !14)
!13 = !DIFile(filename: "Include/pyerrors.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!14 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 16, size: 512, align: 64, elements: !15)
!15 = !{!16, !363, !364, !365, !366, !367, !368}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !14, file: !13, line: 17, baseType: !17, size: 128, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !18, line: 109, baseType: !19)
!18 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !18, line: 105, size: 128, align: 64, elements: !20)
!20 = !{!21, !29}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !19, file: !18, line: 107, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !23, line: 177, baseType: !24)
!23 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !25, line: 102, baseType: !26)
!25 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !27, line: 181, baseType: !28)
!27 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!28 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !19, file: !18, line: 108, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !18, line: 334, size: 3200, align: 64, elements: !32)
!32 = !{!33, !39, !43, !44, !45, !51, !115, !120, !125, !126, !131, !183, !214, !226, !232, !233, !234, !236, !238, !269, !270, !271, !280, !281, !286, !287, !289, !291, !301, !311, !329, !330, !331, !333, !335, !336, !338, !343, !348, !353, !354, !355, !356, !357, !358, !359, !360, !362}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !18, line: 335, baseType: !34, size: 192, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !18, line: 114, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 111, size: 192, align: 64, elements: !36)
!36 = !{!37, !38}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !35, file: !18, line: 112, baseType: !17, size: 128, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !35, file: !18, line: 113, baseType: !22, size: 64, align: 64, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !31, file: !18, line: 336, baseType: !40, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !31, file: !18, line: 337, baseType: !22, size: 64, align: 64, offset: 256)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !31, file: !18, line: 337, baseType: !22, size: 64, align: 64, offset: 320)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !31, file: !18, line: 341, baseType: !46, size: 64, align: 64, offset: 384)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !18, line: 308, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !50}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !31, file: !18, line: 342, baseType: !52, size: 64, align: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !18, line: 314, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !50, !57, !56}
!56 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !25, line: 48, baseType: !59)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 246, size: 1728, align: 64, elements: !61)
!60 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!61 = !{!62, !63, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !83, !84, !85, !86, !88, !90, !92, !96, !99, !101, !103, !104, !105, !106, !110, !111}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !59, file: !60, line: 247, baseType: !56, size: 32, align: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !59, file: !60, line: 252, baseType: !64, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !59, file: !60, line: 253, baseType: !64, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !59, file: !60, line: 254, baseType: !64, size: 64, align: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !59, file: !60, line: 255, baseType: !64, size: 64, align: 64, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !59, file: !60, line: 256, baseType: !64, size: 64, align: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !59, file: !60, line: 257, baseType: !64, size: 64, align: 64, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !59, file: !60, line: 258, baseType: !64, size: 64, align: 64, offset: 448)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !59, file: !60, line: 259, baseType: !64, size: 64, align: 64, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !59, file: !60, line: 261, baseType: !64, size: 64, align: 64, offset: 576)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !59, file: !60, line: 262, baseType: !64, size: 64, align: 64, offset: 640)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !59, file: !60, line: 263, baseType: !64, size: 64, align: 64, offset: 704)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !59, file: !60, line: 265, baseType: !76, size: 64, align: 64, offset: 768)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !60, line: 161, size: 192, align: 64, elements: !78)
!78 = !{!79, !80, !82}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !77, file: !60, line: 162, baseType: !76, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !77, file: !60, line: 163, baseType: !81, size: 64, align: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !77, file: !60, line: 167, baseType: !56, size: 32, align: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !59, file: !60, line: 267, baseType: !81, size: 64, align: 64, offset: 832)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !59, file: !60, line: 269, baseType: !56, size: 32, align: 32, offset: 896)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !59, file: !60, line: 273, baseType: !56, size: 32, align: 32, offset: 928)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !59, file: !60, line: 275, baseType: !87, size: 64, align: 64, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !27, line: 140, baseType: !28)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !59, file: !60, line: 279, baseType: !89, size: 16, align: 16, offset: 1024)
!89 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !59, file: !60, line: 280, baseType: !91, size: 8, align: 8, offset: 1040)
!91 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !59, file: !60, line: 281, baseType: !93, size: 8, align: 8, offset: 1048)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 8, align: 8, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 1)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !59, file: !60, line: 285, baseType: !97, size: 64, align: 64, offset: 1088)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !60, line: 155, baseType: null)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !59, file: !60, line: 294, baseType: !100, size: 64, align: 64, offset: 1152)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !27, line: 141, baseType: !28)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !59, file: !60, line: 303, baseType: !102, size: 64, align: 64, offset: 1216)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !59, file: !60, line: 304, baseType: !102, size: 64, align: 64, offset: 1280)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !59, file: !60, line: 305, baseType: !102, size: 64, align: 64, offset: 1344)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !59, file: !60, line: 306, baseType: !102, size: 64, align: 64, offset: 1408)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !59, file: !60, line: 307, baseType: !107, size: 64, align: 64, offset: 1472)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 62, baseType: !109)
!108 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!109 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !59, file: !60, line: 309, baseType: !56, size: 32, align: 32, offset: 1536)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !59, file: !60, line: 311, baseType: !112, size: 160, align: 8, offset: 1568)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 160, align: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 20)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !31, file: !18, line: 343, baseType: !116, size: 64, align: 64, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !18, line: 316, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!50, !50, !64}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !31, file: !18, line: 344, baseType: !121, size: 64, align: 64, offset: 576)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !18, line: 318, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!56, !50, !64, !50}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !31, file: !18, line: 345, baseType: !102, size: 64, align: 64, offset: 640)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !31, file: !18, line: 346, baseType: !127, size: 64, align: 64, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !18, line: 320, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!50, !50}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !31, file: !18, line: 350, baseType: !132, size: 64, align: 64, offset: 768)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !18, line: 278, baseType: !134)
!134 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 236, size: 2176, align: 64, elements: !135)
!135 = !{!136, !141, !142, !143, !144, !145, !150, !152, !153, !154, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !134, file: !18, line: 241, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !18, line: 166, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!50, !50, !50}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !134, file: !18, line: 242, baseType: !137, size: 64, align: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !134, file: !18, line: 243, baseType: !137, size: 64, align: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !134, file: !18, line: 244, baseType: !137, size: 64, align: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !134, file: !18, line: 245, baseType: !137, size: 64, align: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !134, file: !18, line: 246, baseType: !146, size: 64, align: 64, offset: 320)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !18, line: 167, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!50, !50, !50, !50}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !134, file: !18, line: 247, baseType: !151, size: 64, align: 64, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !18, line: 165, baseType: !128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !134, file: !18, line: 248, baseType: !151, size: 64, align: 64, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !134, file: !18, line: 249, baseType: !151, size: 64, align: 64, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !134, file: !18, line: 250, baseType: !155, size: 64, align: 64, offset: 576)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !18, line: 168, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!56, !50}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !134, file: !18, line: 251, baseType: !151, size: 64, align: 64, offset: 640)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !134, file: !18, line: 252, baseType: !137, size: 64, align: 64, offset: 704)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !134, file: !18, line: 253, baseType: !137, size: 64, align: 64, offset: 768)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !134, file: !18, line: 254, baseType: !137, size: 64, align: 64, offset: 832)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !134, file: !18, line: 255, baseType: !137, size: 64, align: 64, offset: 896)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !134, file: !18, line: 256, baseType: !137, size: 64, align: 64, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !134, file: !18, line: 257, baseType: !151, size: 64, align: 64, offset: 1024)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !134, file: !18, line: 258, baseType: !102, size: 64, align: 64, offset: 1088)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !134, file: !18, line: 259, baseType: !151, size: 64, align: 64, offset: 1152)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !134, file: !18, line: 261, baseType: !137, size: 64, align: 64, offset: 1216)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !134, file: !18, line: 262, baseType: !137, size: 64, align: 64, offset: 1280)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !134, file: !18, line: 263, baseType: !137, size: 64, align: 64, offset: 1344)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !134, file: !18, line: 264, baseType: !137, size: 64, align: 64, offset: 1408)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !134, file: !18, line: 265, baseType: !146, size: 64, align: 64, offset: 1472)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !134, file: !18, line: 266, baseType: !137, size: 64, align: 64, offset: 1536)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !134, file: !18, line: 267, baseType: !137, size: 64, align: 64, offset: 1600)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !134, file: !18, line: 268, baseType: !137, size: 64, align: 64, offset: 1664)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !134, file: !18, line: 269, baseType: !137, size: 64, align: 64, offset: 1728)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !134, file: !18, line: 270, baseType: !137, size: 64, align: 64, offset: 1792)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !134, file: !18, line: 272, baseType: !137, size: 64, align: 64, offset: 1856)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !134, file: !18, line: 273, baseType: !137, size: 64, align: 64, offset: 1920)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !134, file: !18, line: 274, baseType: !137, size: 64, align: 64, offset: 1984)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !134, file: !18, line: 275, baseType: !137, size: 64, align: 64, offset: 2048)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !134, file: !18, line: 277, baseType: !151, size: 64, align: 64, offset: 2112)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !31, file: !18, line: 351, baseType: !184, size: 64, align: 64, offset: 832)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !18, line: 292, baseType: !186)
!186 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 280, size: 640, align: 64, elements: !187)
!187 = !{!188, !193, !194, !199, !200, !201, !206, !207, !212, !213}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !186, file: !18, line: 281, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !18, line: 169, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!22, !50}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !186, file: !18, line: 282, baseType: !137, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !186, file: !18, line: 283, baseType: !195, size: 64, align: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !18, line: 170, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!50, !50, !22}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !186, file: !18, line: 284, baseType: !195, size: 64, align: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !186, file: !18, line: 285, baseType: !102, size: 64, align: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !186, file: !18, line: 286, baseType: !202, size: 64, align: 64, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !18, line: 172, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!56, !50, !22, !50}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !186, file: !18, line: 287, baseType: !102, size: 64, align: 64, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !186, file: !18, line: 288, baseType: !208, size: 64, align: 64, offset: 448)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !18, line: 231, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!56, !50, !50}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !186, file: !18, line: 290, baseType: !137, size: 64, align: 64, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !186, file: !18, line: 291, baseType: !195, size: 64, align: 64, offset: 576)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !31, file: !18, line: 352, baseType: !215, size: 64, align: 64, offset: 896)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !18, line: 298, baseType: !217)
!217 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 294, size: 192, align: 64, elements: !218)
!218 = !{!219, !220, !221}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !217, file: !18, line: 295, baseType: !189, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !217, file: !18, line: 296, baseType: !137, size: 64, align: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !217, file: !18, line: 297, baseType: !222, size: 64, align: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !18, line: 174, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!56, !50, !50, !50}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !31, file: !18, line: 356, baseType: !227, size: 64, align: 64, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !18, line: 321, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!231, !50}
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !23, line: 186, baseType: !22)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !31, file: !18, line: 357, baseType: !146, size: 64, align: 64, offset: 1024)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !31, file: !18, line: 358, baseType: !127, size: 64, align: 64, offset: 1088)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !31, file: !18, line: 359, baseType: !235, size: 64, align: 64, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !18, line: 317, baseType: !138)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !31, file: !18, line: 360, baseType: !237, size: 64, align: 64, offset: 1216)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !18, line: 319, baseType: !223)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !31, file: !18, line: 363, baseType: !239, size: 64, align: 64, offset: 1280)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !18, line: 304, baseType: !241)
!241 = !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 301, size: 128, align: 64, elements: !242)
!242 = !{!243, !264}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !241, file: !18, line: 302, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !18, line: 193, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!56, !50, !248, !56}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !18, line: 191, baseType: !250)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !18, line: 178, size: 640, align: 64, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !261, !262, !263}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !250, file: !18, line: 179, baseType: !102, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !250, file: !18, line: 180, baseType: !50, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !250, file: !18, line: 181, baseType: !22, size: 64, align: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !250, file: !18, line: 182, baseType: !22, size: 64, align: 64, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !250, file: !18, line: 184, baseType: !56, size: 32, align: 32, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !250, file: !18, line: 185, baseType: !56, size: 32, align: 32, offset: 288)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !250, file: !18, line: 186, baseType: !64, size: 64, align: 64, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !250, file: !18, line: 187, baseType: !260, size: 64, align: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !250, file: !18, line: 188, baseType: !260, size: 64, align: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !250, file: !18, line: 189, baseType: !260, size: 64, align: 64, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !250, file: !18, line: 190, baseType: !102, size: 64, align: 64, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !241, file: !18, line: 303, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !18, line: 194, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !50, !248}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !31, file: !18, line: 366, baseType: !109, size: 64, align: 64, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !31, file: !18, line: 368, baseType: !40, size: 64, align: 64, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !31, file: !18, line: 372, baseType: !272, size: 64, align: 64, offset: 1472)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !18, line: 233, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!56, !50, !276, !102}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !18, line: 232, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!56, !50, !102}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !31, file: !18, line: 375, baseType: !155, size: 64, align: 64, offset: 1536)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !31, file: !18, line: 379, baseType: !282, size: 64, align: 64, offset: 1600)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !18, line: 322, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!50, !50, !50, !56}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !31, file: !18, line: 382, baseType: !22, size: 64, align: 64, offset: 1664)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !31, file: !18, line: 385, baseType: !288, size: 64, align: 64, offset: 1728)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !18, line: 323, baseType: !128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !31, file: !18, line: 386, baseType: !290, size: 64, align: 64, offset: 1792)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !18, line: 324, baseType: !128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !31, file: !18, line: 389, baseType: !292, size: 64, align: 64, offset: 1856)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !294, line: 40, size: 256, align: 64, elements: !295)
!294 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!295 = !{!296, !297, !299, !300}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !293, file: !294, line: 41, baseType: !40, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !293, file: !294, line: 42, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !294, line: 18, baseType: !138)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !293, file: !294, line: 43, baseType: !56, size: 32, align: 32, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !293, file: !294, line: 45, baseType: !40, size: 64, align: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !31, file: !18, line: 390, baseType: !302, size: 64, align: 64, offset: 1920)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64, align: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !304, line: 18, size: 320, align: 64, elements: !305)
!304 = !DIFile(filename: "Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!305 = !{!306, !307, !308, !309, !310}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !303, file: !304, line: 19, baseType: !64, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !303, file: !304, line: 20, baseType: !56, size: 32, align: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !303, file: !304, line: 21, baseType: !22, size: 64, align: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !303, file: !304, line: 22, baseType: !56, size: 32, align: 32, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !303, file: !304, line: 23, baseType: !64, size: 64, align: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !31, file: !18, line: 391, baseType: !312, size: 64, align: 64, offset: 1984)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !314, line: 11, size: 320, align: 64, elements: !315)
!314 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!315 = !{!316, !317, !322, !327, !328}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !313, file: !314, line: 12, baseType: !64, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !313, file: !314, line: 13, baseType: !318, size: 64, align: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !314, line: 8, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!50, !50, !102}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !313, file: !314, line: 14, baseType: !323, size: 64, align: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !314, line: 9, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!56, !50, !50, !102}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !313, file: !314, line: 15, baseType: !64, size: 64, align: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !313, file: !314, line: 16, baseType: !102, size: 64, align: 64, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !31, file: !18, line: 392, baseType: !30, size: 64, align: 64, offset: 2048)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !31, file: !18, line: 393, baseType: !50, size: 64, align: 64, offset: 2112)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !31, file: !18, line: 394, baseType: !332, size: 64, align: 64, offset: 2176)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !18, line: 325, baseType: !147)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !31, file: !18, line: 395, baseType: !334, size: 64, align: 64, offset: 2240)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !18, line: 326, baseType: !223)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !31, file: !18, line: 396, baseType: !22, size: 64, align: 64, offset: 2304)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !31, file: !18, line: 397, baseType: !337, size: 64, align: 64, offset: 2368)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !18, line: 327, baseType: !223)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !31, file: !18, line: 398, baseType: !339, size: 64, align: 64, offset: 2432)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !18, line: 329, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!50, !30, !22}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !31, file: !18, line: 399, baseType: !344, size: 64, align: 64, offset: 2496)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !18, line: 328, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!50, !30, !50, !50}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !31, file: !18, line: 400, baseType: !349, size: 64, align: 64, offset: 2560)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !18, line: 307, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !102}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !31, file: !18, line: 401, baseType: !155, size: 64, align: 64, offset: 2624)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !31, file: !18, line: 402, baseType: !50, size: 64, align: 64, offset: 2688)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !31, file: !18, line: 403, baseType: !50, size: 64, align: 64, offset: 2752)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !31, file: !18, line: 404, baseType: !50, size: 64, align: 64, offset: 2816)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !31, file: !18, line: 405, baseType: !50, size: 64, align: 64, offset: 2880)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !31, file: !18, line: 406, baseType: !50, size: 64, align: 64, offset: 2944)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !31, file: !18, line: 407, baseType: !46, size: 64, align: 64, offset: 3008)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !31, file: !18, line: 410, baseType: !361, size: 32, align: 32, offset: 3072)
!361 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !31, file: !18, line: 412, baseType: !46, size: 64, align: 64, offset: 3136)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !14, file: !13, line: 17, baseType: !50, size: 64, align: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !14, file: !13, line: 17, baseType: !50, size: 64, align: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !14, file: !13, line: 17, baseType: !50, size: 64, align: 64, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !14, file: !13, line: 17, baseType: !50, size: 64, align: 64, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !14, file: !13, line: 17, baseType: !50, size: 64, align: 64, offset: 384)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !14, file: !13, line: 17, baseType: !42, size: 8, align: 8, offset: 448)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeErrorObject", file: !13, line: 44, baseType: !371)
!371 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 37, size: 832, align: 64, elements: !372)
!372 = !{!373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !371, file: !13, line: 38, baseType: !17, size: 128, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !371, file: !13, line: 38, baseType: !50, size: 64, align: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !371, file: !13, line: 38, baseType: !50, size: 64, align: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !371, file: !13, line: 38, baseType: !50, size: 64, align: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !371, file: !13, line: 38, baseType: !50, size: 64, align: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !371, file: !13, line: 38, baseType: !50, size: 64, align: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !371, file: !13, line: 38, baseType: !42, size: 8, align: 8, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !371, file: !13, line: 39, baseType: !50, size: 64, align: 64, offset: 512)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !371, file: !13, line: 40, baseType: !50, size: 64, align: 64, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !371, file: !13, line: 41, baseType: !22, size: 64, align: 64, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !371, file: !13, line: 42, baseType: !22, size: 64, align: 64, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !371, file: !13, line: 43, baseType: !50, size: 64, align: 64, offset: 768)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !387)
!387 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !388)
!388 = !{!389, !390, !391, !392, !400}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !387, file: !4, line: 291, baseType: !17, size: 128, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !387, file: !4, line: 292, baseType: !22, size: 64, align: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !387, file: !4, line: 293, baseType: !231, size: 64, align: 64, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !387, file: !4, line: 349, baseType: !393, size: 32, align: 32, offset: 256)
!393 = !DICompositeType(tag: DW_TAG_structure_type, scope: !387, file: !4, line: 294, size: 32, align: 32, elements: !394)
!394 = !{!395, !396, !397, !398, !399}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !393, file: !4, line: 303, baseType: !361, size: 2, align: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !393, file: !4, line: 331, baseType: !361, size: 3, align: 32, offset: 2)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !393, file: !4, line: 336, baseType: !361, size: 1, align: 32, offset: 5)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !393, file: !4, line: 340, baseType: !361, size: 1, align: 32, offset: 6)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !393, file: !4, line: 345, baseType: !361, size: 1, align: 32, offset: 7)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !387, file: !4, line: 350, baseType: !401, size: 64, align: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !108, line: 90, baseType: !56)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !18, line: 422, baseType: !31)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !408, line: 33, baseType: !409)
!408 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!409 = !DICompositeType(tag: DW_TAG_structure_type, file: !408, line: 25, size: 256, align: 64, elements: !410)
!410 = !{!411, !412}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !409, file: !408, line: 26, baseType: !34, size: 192, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !409, file: !408, line: 27, baseType: !413, size: 64, align: 64, offset: 192)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 64, align: 64, elements: !94)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !416, line: 253, baseType: !417)
!416 = !DIFile(filename: "Include/objimpl.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!417 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !416, line: 246, size: 192, align: 64, elements: !418)
!418 = !{!419, !426}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !417, file: !416, line: 251, baseType: !420, size: 192, align: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, scope: !417, file: !416, line: 247, size: 192, align: 64, elements: !421)
!421 = !{!422, !424, !425}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !420, file: !416, line: 248, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !420, file: !416, line: 249, baseType: !423, size: 64, align: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !420, file: !416, line: 250, baseType: !22, size: 64, align: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !417, file: !416, line: 252, baseType: !427, size: 64, align: 64)
!427 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyOSErrorObject", file: !13, line: 61, baseType: !430)
!430 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 51, size: 832, align: 64, elements: !431)
!431 = !{!432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !430, file: !13, line: 52, baseType: !17, size: 128, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !430, file: !13, line: 52, baseType: !50, size: 64, align: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !430, file: !13, line: 52, baseType: !50, size: 64, align: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "traceback", scope: !430, file: !13, line: 52, baseType: !50, size: 64, align: 64, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !430, file: !13, line: 52, baseType: !50, size: 64, align: 64, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "cause", scope: !430, file: !13, line: 52, baseType: !50, size: 64, align: 64, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_context", scope: !430, file: !13, line: 52, baseType: !42, size: 8, align: 8, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "myerrno", scope: !430, file: !13, line: 53, baseType: !50, size: 64, align: 64, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "strerror", scope: !430, file: !13, line: 54, baseType: !50, size: 64, align: 64, offset: 576)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !430, file: !13, line: 55, baseType: !50, size: 64, align: 64, offset: 640)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "filename2", scope: !430, file: !13, line: 56, baseType: !50, size: 64, align: 64, offset: 704)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !430, file: !13, line: 60, baseType: !22, size: 64, align: 64, offset: 768)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !446)
!446 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !447)
!447 = !{!448, !449, !450, !451}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !446, file: !4, line: 357, baseType: !386, size: 384, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !446, file: !4, line: 358, baseType: !22, size: 64, align: 64, offset: 384)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !446, file: !4, line: 360, baseType: !64, size: 64, align: 64, offset: 448)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !446, file: !4, line: 361, baseType: !22, size: 64, align: 64, offset: 512)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !454)
!454 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !455)
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !454, file: !4, line: 369, baseType: !445, size: 576, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !454, file: !4, line: 375, baseType: !458, size: 64, align: 64, offset: 576)
!458 = !DICompositeType(tag: DW_TAG_union_type, scope: !454, file: !4, line: 370, size: 64, align: 64, elements: !459)
!459 = !{!460, !461, !465, !468}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !458, file: !4, line: 371, baseType: !102, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !458, file: !4, line: 372, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !464)
!464 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !458, file: !4, line: 373, baseType: !466, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !89)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !458, file: !4, line: 374, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !361)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !463)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !470)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !479, line: 41, baseType: !480)
!479 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!480 = !DICompositeType(tag: DW_TAG_structure_type, file: !479, line: 31, size: 320, align: 64, elements: !481)
!481 = !{!482, !483, !484}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !480, file: !479, line: 32, baseType: !34, size: 192, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !480, file: !479, line: 33, baseType: !231, size: 64, align: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !480, file: !479, line: 34, baseType: !93, size: 8, align: 8, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!488 = !{!489, !496, !500, !506, !518, !524, !534, !537, !540, !543, !546, !549, !559, !567, !571, !577, !581, !585, !593, !601, !605, !609, !613, !617, !620, !623, !626, !632, !636, !640, !653, !663, !672, !680, !781, !797, !844, !857, !864, !871, !874, !901, !936, !939, !946, !950, !953, !964, !967, !971, !975, !979, !983, !1002, !1013, !1024, !1039, !1058, !1069, !1080, !1094, !1115, !1120, !1139, !1162, !1198, !1205, !1210, !1233, !1262, !1273, !1279, !1287, !1303, !1308, !1321, !1352, !1384, !1408, !1422, !1430, !1461, !1502, !1551, !1554, !1560, !1564, !1577, !1584, !1605, !1624, !1647, !1671, !1691, !1717, !1732, !1751, !1756, !1764, !1776, !1786, !1799}
!489 = !DISubprogram(name: "PyException_GetTraceback", scope: !490, file: !490, line: 312, type: !129, isLocal: false, isDefinition: true, scopeLine: 312, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyException_GetTraceback, variables: !491)
!490 = !DIFile(filename: "Objects/exceptions.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!491 = !{!492, !493, !494}
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !489, file: !490, line: 312, type: !50)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base_self", scope: !489, file: !490, line: 313, type: !11)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !495, file: !490, line: 314, type: !50)
!495 = distinct !DILexicalBlock(scope: !489, file: !490, line: 314, column: 8)
!496 = !DISubprogram(name: "PyException_SetTraceback", scope: !490, file: !490, line: 320, type: !210, isLocal: false, isDefinition: true, scopeLine: 320, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*)* @PyException_SetTraceback, variables: !497)
!497 = !{!498, !499}
!498 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !496, file: !490, line: 320, type: !50)
!499 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tb", arg: 2, scope: !496, file: !490, line: 320, type: !50)
!500 = !DISubprogram(name: "PyException_GetCause", scope: !490, file: !490, line: 325, type: !129, isLocal: false, isDefinition: true, scopeLine: 325, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyException_GetCause, variables: !501)
!501 = !{!502, !503, !504}
!502 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !500, file: !490, line: 325, type: !50)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cause", scope: !500, file: !490, line: 326, type: !50)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !505, file: !490, line: 327, type: !50)
!505 = distinct !DILexicalBlock(scope: !500, file: !490, line: 327, column: 8)
!506 = !DISubprogram(name: "PyException_SetCause", scope: !490, file: !490, line: 333, type: !507, isLocal: false, isDefinition: true, scopeLine: 333, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, %struct._object*)* @PyException_SetCause, variables: !509)
!507 = !DISubroutineType(types: !508)
!508 = !{null, !50, !50}
!509 = !{!510, !511, !512, !513, !515}
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !506, file: !490, line: 333, type: !50)
!511 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cause", arg: 2, scope: !506, file: !490, line: 333, type: !50)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_cause", scope: !506, file: !490, line: 334, type: !50)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !514, file: !490, line: 337, type: !50)
!514 = distinct !DILexicalBlock(scope: !506, file: !490, line: 337, column: 8)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !516, file: !490, line: 337, type: !50)
!516 = distinct !DILexicalBlock(scope: !517, file: !490, line: 337, column: 101)
!517 = distinct !DILexicalBlock(scope: !514, file: !490, line: 337, column: 67)
!518 = !DISubprogram(name: "PyException_GetContext", scope: !490, file: !490, line: 341, type: !129, isLocal: false, isDefinition: true, scopeLine: 341, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyException_GetContext, variables: !519)
!519 = !{!520, !521, !522}
!520 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !518, file: !490, line: 341, type: !50)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "context", scope: !518, file: !490, line: 342, type: !50)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !523, file: !490, line: 343, type: !50)
!523 = distinct !DILexicalBlock(scope: !518, file: !490, line: 343, column: 8)
!524 = !DISubprogram(name: "PyException_SetContext", scope: !490, file: !490, line: 349, type: !507, isLocal: false, isDefinition: true, scopeLine: 349, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, %struct._object*)* @PyException_SetContext, variables: !525)
!525 = !{!526, !527, !528, !529, !531}
!526 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !524, file: !490, line: 349, type: !50)
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "context", arg: 2, scope: !524, file: !490, line: 349, type: !50)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_context", scope: !524, file: !490, line: 350, type: !50)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !530, file: !490, line: 352, type: !50)
!530 = distinct !DILexicalBlock(scope: !524, file: !490, line: 352, column: 8)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !532, file: !490, line: 352, type: !50)
!532 = distinct !DILexicalBlock(scope: !533, file: !490, line: 352, column: 103)
!533 = distinct !DILexicalBlock(scope: !530, file: !490, line: 352, column: 69)
!534 = !DISubprogram(name: "PyUnicodeEncodeError_GetEncoding", scope: !490, file: !490, line: 1542, type: !129, isLocal: false, isDefinition: true, scopeLine: 1543, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyUnicodeEncodeError_GetEncoding, variables: !535)
!535 = !{!536}
!536 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !534, file: !490, line: 1542, type: !50)
!537 = !DISubprogram(name: "PyUnicodeDecodeError_GetEncoding", scope: !490, file: !490, line: 1548, type: !129, isLocal: false, isDefinition: true, scopeLine: 1549, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyUnicodeDecodeError_GetEncoding, variables: !538)
!538 = !{!539}
!539 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !537, file: !490, line: 1548, type: !50)
!540 = !DISubprogram(name: "PyUnicodeEncodeError_GetObject", scope: !490, file: !490, line: 1554, type: !129, isLocal: false, isDefinition: true, scopeLine: 1555, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyUnicodeEncodeError_GetObject, variables: !541)
!541 = !{!542}
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !540, file: !490, line: 1554, type: !50)
!543 = !DISubprogram(name: "PyUnicodeDecodeError_GetObject", scope: !490, file: !490, line: 1560, type: !129, isLocal: false, isDefinition: true, scopeLine: 1561, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyUnicodeDecodeError_GetObject, variables: !544)
!544 = !{!545}
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !543, file: !490, line: 1560, type: !50)
!546 = !DISubprogram(name: "PyUnicodeTranslateError_GetObject", scope: !490, file: !490, line: 1566, type: !129, isLocal: false, isDefinition: true, scopeLine: 1567, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyUnicodeTranslateError_GetObject, variables: !547)
!547 = !{!548}
!548 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !546, file: !490, line: 1566, type: !50)
!549 = !DISubprogram(name: "PyUnicodeEncodeError_GetStart", scope: !490, file: !490, line: 1572, type: !550, isLocal: false, isDefinition: true, scopeLine: 1573, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64*)* @PyUnicodeEncodeError_GetStart, variables: !552)
!550 = !DISubroutineType(types: !551)
!551 = !{!56, !50, !260}
!552 = !{!553, !554, !555, !556, !557}
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !549, file: !490, line: 1572, type: !50)
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !549, file: !490, line: 1572, type: !260)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !549, file: !490, line: 1574, type: !22)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !549, file: !490, line: 1575, type: !50)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !558, file: !490, line: 1585, type: !50)
!558 = distinct !DILexicalBlock(scope: !549, file: !490, line: 1585, column: 8)
!559 = !DISubprogram(name: "PyUnicodeDecodeError_GetStart", scope: !490, file: !490, line: 1591, type: !550, isLocal: false, isDefinition: true, scopeLine: 1592, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64*)* @PyUnicodeDecodeError_GetStart, variables: !560)
!560 = !{!561, !562, !563, !564, !565}
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !559, file: !490, line: 1591, type: !50)
!562 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !559, file: !490, line: 1591, type: !260)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !559, file: !490, line: 1593, type: !22)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !559, file: !490, line: 1594, type: !50)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !566, file: !490, line: 1603, type: !50)
!566 = distinct !DILexicalBlock(scope: !559, file: !490, line: 1603, column: 8)
!567 = !DISubprogram(name: "PyUnicodeTranslateError_GetStart", scope: !490, file: !490, line: 1609, type: !550, isLocal: false, isDefinition: true, scopeLine: 1610, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64*)* @PyUnicodeTranslateError_GetStart, variables: !568)
!568 = !{!569, !570}
!569 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !567, file: !490, line: 1609, type: !50)
!570 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !567, file: !490, line: 1609, type: !260)
!571 = !DISubprogram(name: "PyUnicodeEncodeError_SetStart", scope: !490, file: !490, line: 1616, type: !572, isLocal: false, isDefinition: true, scopeLine: 1617, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64)* @PyUnicodeEncodeError_SetStart, variables: !574)
!572 = !DISubroutineType(types: !573)
!573 = !{!56, !50, !22}
!574 = !{!575, !576}
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !571, file: !490, line: 1616, type: !50)
!576 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !571, file: !490, line: 1616, type: !22)
!577 = !DISubprogram(name: "PyUnicodeDecodeError_SetStart", scope: !490, file: !490, line: 1624, type: !572, isLocal: false, isDefinition: true, scopeLine: 1625, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64)* @PyUnicodeDecodeError_SetStart, variables: !578)
!578 = !{!579, !580}
!579 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !577, file: !490, line: 1624, type: !50)
!580 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !577, file: !490, line: 1624, type: !22)
!581 = !DISubprogram(name: "PyUnicodeTranslateError_SetStart", scope: !490, file: !490, line: 1632, type: !572, isLocal: false, isDefinition: true, scopeLine: 1633, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64)* @PyUnicodeTranslateError_SetStart, variables: !582)
!582 = !{!583, !584}
!583 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !581, file: !490, line: 1632, type: !50)
!584 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !581, file: !490, line: 1632, type: !22)
!585 = !DISubprogram(name: "PyUnicodeEncodeError_GetEnd", scope: !490, file: !490, line: 1640, type: !550, isLocal: false, isDefinition: true, scopeLine: 1641, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64*)* @PyUnicodeEncodeError_GetEnd, variables: !586)
!586 = !{!587, !588, !589, !590, !591}
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !585, file: !490, line: 1640, type: !50)
!588 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 2, scope: !585, file: !490, line: 1640, type: !260)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !585, file: !490, line: 1642, type: !22)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !585, file: !490, line: 1643, type: !50)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !592, file: !490, line: 1653, type: !50)
!592 = distinct !DILexicalBlock(scope: !585, file: !490, line: 1653, column: 8)
!593 = !DISubprogram(name: "PyUnicodeDecodeError_GetEnd", scope: !490, file: !490, line: 1659, type: !550, isLocal: false, isDefinition: true, scopeLine: 1660, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64*)* @PyUnicodeDecodeError_GetEnd, variables: !594)
!594 = !{!595, !596, !597, !598, !599}
!595 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !593, file: !490, line: 1659, type: !50)
!596 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 2, scope: !593, file: !490, line: 1659, type: !260)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !593, file: !490, line: 1661, type: !22)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !593, file: !490, line: 1662, type: !50)
!599 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !600, file: !490, line: 1671, type: !50)
!600 = distinct !DILexicalBlock(scope: !593, file: !490, line: 1671, column: 8)
!601 = !DISubprogram(name: "PyUnicodeTranslateError_GetEnd", scope: !490, file: !490, line: 1677, type: !550, isLocal: false, isDefinition: true, scopeLine: 1678, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64*)* @PyUnicodeTranslateError_GetEnd, variables: !602)
!602 = !{!603, !604}
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !601, file: !490, line: 1677, type: !50)
!604 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !601, file: !490, line: 1677, type: !260)
!605 = !DISubprogram(name: "PyUnicodeEncodeError_SetEnd", scope: !490, file: !490, line: 1684, type: !572, isLocal: false, isDefinition: true, scopeLine: 1685, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64)* @PyUnicodeEncodeError_SetEnd, variables: !606)
!606 = !{!607, !608}
!607 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !605, file: !490, line: 1684, type: !50)
!608 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 2, scope: !605, file: !490, line: 1684, type: !22)
!609 = !DISubprogram(name: "PyUnicodeDecodeError_SetEnd", scope: !490, file: !490, line: 1692, type: !572, isLocal: false, isDefinition: true, scopeLine: 1693, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64)* @PyUnicodeDecodeError_SetEnd, variables: !610)
!610 = !{!611, !612}
!611 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !609, file: !490, line: 1692, type: !50)
!612 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 2, scope: !609, file: !490, line: 1692, type: !22)
!613 = !DISubprogram(name: "PyUnicodeTranslateError_SetEnd", scope: !490, file: !490, line: 1700, type: !572, isLocal: false, isDefinition: true, scopeLine: 1701, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64)* @PyUnicodeTranslateError_SetEnd, variables: !614)
!614 = !{!615, !616}
!615 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !613, file: !490, line: 1700, type: !50)
!616 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 2, scope: !613, file: !490, line: 1700, type: !22)
!617 = !DISubprogram(name: "PyUnicodeEncodeError_GetReason", scope: !490, file: !490, line: 1707, type: !129, isLocal: false, isDefinition: true, scopeLine: 1708, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyUnicodeEncodeError_GetReason, variables: !618)
!618 = !{!619}
!619 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !617, file: !490, line: 1707, type: !50)
!620 = !DISubprogram(name: "PyUnicodeDecodeError_GetReason", scope: !490, file: !490, line: 1714, type: !129, isLocal: false, isDefinition: true, scopeLine: 1715, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyUnicodeDecodeError_GetReason, variables: !621)
!621 = !{!622}
!622 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !620, file: !490, line: 1714, type: !50)
!623 = !DISubprogram(name: "PyUnicodeTranslateError_GetReason", scope: !490, file: !490, line: 1721, type: !129, isLocal: false, isDefinition: true, scopeLine: 1722, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyUnicodeTranslateError_GetReason, variables: !624)
!624 = !{!625}
!625 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !623, file: !490, line: 1721, type: !50)
!626 = !DISubprogram(name: "PyUnicodeEncodeError_SetReason", scope: !490, file: !490, line: 1728, type: !627, isLocal: false, isDefinition: true, scopeLine: 1729, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*)* @PyUnicodeEncodeError_SetReason, variables: !629)
!627 = !DISubroutineType(types: !628)
!628 = !{!56, !50, !40}
!629 = !{!630, !631}
!630 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !626, file: !490, line: 1728, type: !50)
!631 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "reason", arg: 2, scope: !626, file: !490, line: 1728, type: !40)
!632 = !DISubprogram(name: "PyUnicodeDecodeError_SetReason", scope: !490, file: !490, line: 1736, type: !627, isLocal: false, isDefinition: true, scopeLine: 1737, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*)* @PyUnicodeDecodeError_SetReason, variables: !633)
!633 = !{!634, !635}
!634 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !632, file: !490, line: 1736, type: !50)
!635 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "reason", arg: 2, scope: !632, file: !490, line: 1736, type: !40)
!636 = !DISubprogram(name: "PyUnicodeTranslateError_SetReason", scope: !490, file: !490, line: 1744, type: !627, isLocal: false, isDefinition: true, scopeLine: 1745, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*)* @PyUnicodeTranslateError_SetReason, variables: !637)
!637 = !{!638, !639}
!638 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exc", arg: 1, scope: !636, file: !490, line: 1744, type: !50)
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "reason", arg: 2, scope: !636, file: !490, line: 1744, type: !40)
!640 = !DISubprogram(name: "PyUnicodeEncodeError_Create", scope: !490, file: !490, line: 1898, type: !641, isLocal: false, isDefinition: true, scopeLine: 1901, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i32*, i64, i64, i64, i8*)* @PyUnicodeEncodeError_Create, variables: !646)
!641 = !DISubroutineType(types: !642)
!642 = !{!50, !40, !643, !22, !22, !22, !40}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64, align: 64)
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UNICODE", file: !4, line: 93, baseType: !402)
!646 = !{!647, !648, !649, !650, !651, !652}
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !640, file: !490, line: 1899, type: !40)
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 2, scope: !640, file: !490, line: 1899, type: !643)
!649 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 3, scope: !640, file: !490, line: 1899, type: !22)
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 4, scope: !640, file: !490, line: 1900, type: !22)
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 5, scope: !640, file: !490, line: 1900, type: !22)
!652 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "reason", arg: 6, scope: !640, file: !490, line: 1900, type: !40)
!653 = !DISubprogram(name: "PyUnicodeDecodeError_Create", scope: !490, file: !490, line: 2014, type: !654, isLocal: false, isDefinition: true, scopeLine: 2017, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i8*, i64, i64, i64, i8*)* @PyUnicodeDecodeError_Create, variables: !656)
!654 = !DISubroutineType(types: !655)
!655 = !{!50, !40, !40, !22, !22, !22, !40}
!656 = !{!657, !658, !659, !660, !661, !662}
!657 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "encoding", arg: 1, scope: !653, file: !490, line: 2015, type: !40)
!658 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 2, scope: !653, file: !490, line: 2015, type: !40)
!659 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 3, scope: !653, file: !490, line: 2015, type: !22)
!660 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 4, scope: !653, file: !490, line: 2016, type: !22)
!661 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 5, scope: !653, file: !490, line: 2016, type: !22)
!662 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "reason", arg: 6, scope: !653, file: !490, line: 2016, type: !40)
!663 = !DISubprogram(name: "PyUnicodeTranslateError_Create", scope: !490, file: !490, line: 2114, type: !664, isLocal: false, isDefinition: true, scopeLine: 2117, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32*, i64, i64, i64, i8*)* @PyUnicodeTranslateError_Create, variables: !666)
!664 = !DISubroutineType(types: !665)
!665 = !{!50, !643, !22, !22, !22, !40}
!666 = !{!667, !668, !669, !670, !671}
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !663, file: !490, line: 2115, type: !643)
!668 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 2, scope: !663, file: !490, line: 2115, type: !22)
!669 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 3, scope: !663, file: !490, line: 2116, type: !22)
!670 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 4, scope: !663, file: !490, line: 2116, type: !22)
!671 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "reason", arg: 5, scope: !663, file: !490, line: 2116, type: !40)
!672 = !DISubprogram(name: "_PyUnicodeTranslateError_Create", scope: !490, file: !490, line: 2123, type: !673, isLocal: false, isDefinition: true, scopeLine: 2126, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i64, i64, i8*)* @_PyUnicodeTranslateError_Create, variables: !675)
!673 = !DISubroutineType(types: !674)
!674 = !{!50, !50, !22, !22, !40}
!675 = !{!676, !677, !678, !679}
!676 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !672, file: !490, line: 2124, type: !50)
!677 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !672, file: !490, line: 2125, type: !22)
!678 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 3, scope: !672, file: !490, line: 2125, type: !22)
!679 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "reason", arg: 4, scope: !672, file: !490, line: 2125, type: !40)
!680 = !DISubprogram(name: "_PyExc_Init", scope: !490, file: !490, line: 2450, type: !48, isLocal: false, isDefinition: true, scopeLine: 2451, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @_PyExc_Init, variables: !681)
!681 = !{!682, !683, !684, !686, !689, !691, !694, !696, !698, !700, !702, !704, !706, !708, !710, !712, !714, !716, !718, !720, !722, !724, !726, !728, !730, !732, !734, !736, !738, !740, !742, !744, !746, !748, !750, !752, !754, !756, !758, !760, !762, !764, !766, !768, !770, !775, !776, !777, !779}
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bltinmod", arg: 1, scope: !680, file: !490, line: 2450, type: !50)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bdict", scope: !680, file: !490, line: 2452, type: !50)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !685, file: !490, line: 2533, type: !50)
!685 = distinct !DILexicalBlock(scope: !680, file: !490, line: 2533, column: 55)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !687, file: !490, line: 2533, type: !50)
!687 = distinct !DILexicalBlock(scope: !688, file: !490, line: 2533, column: 161)
!688 = distinct !DILexicalBlock(scope: !685, file: !490, line: 2533, column: 127)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !690, file: !490, line: 2534, type: !50)
!690 = distinct !DILexicalBlock(scope: !680, file: !490, line: 2534, column: 55)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !692, file: !490, line: 2534, type: !50)
!692 = distinct !DILexicalBlock(scope: !693, file: !490, line: 2534, column: 152)
!693 = distinct !DILexicalBlock(scope: !690, file: !490, line: 2534, column: 118)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !695, file: !490, line: 2587, type: !50)
!695 = distinct !DILexicalBlock(scope: !680, file: !490, line: 2587, column: 5)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !697, file: !490, line: 2587, type: !50)
!697 = distinct !DILexicalBlock(scope: !695, file: !490, line: 2587, column: 177)
!698 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !699, file: !490, line: 2588, type: !50)
!699 = distinct !DILexicalBlock(scope: !680, file: !490, line: 2588, column: 5)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !701, file: !490, line: 2588, type: !50)
!701 = distinct !DILexicalBlock(scope: !699, file: !490, line: 2588, column: 178)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !703, file: !490, line: 2589, type: !50)
!703 = distinct !DILexicalBlock(scope: !680, file: !490, line: 2589, column: 5)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !705, file: !490, line: 2589, type: !50)
!705 = distinct !DILexicalBlock(scope: !703, file: !490, line: 2589, column: 178)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !707, file: !490, line: 2590, type: !50)
!707 = distinct !DILexicalBlock(scope: !680, file: !490, line: 2590, column: 5)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !709, file: !490, line: 2590, type: !50)
!709 = distinct !DILexicalBlock(scope: !707, file: !490, line: 2590, column: 177)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !711, file: !490, line: 2592, type: !50)
!711 = distinct !DILexicalBlock(scope: !680, file: !490, line: 2592, column: 5)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !713, file: !490, line: 2592, type: !50)
!713 = distinct !DILexicalBlock(scope: !711, file: !490, line: 2592, column: 177)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !715, file: !490, line: 2593, type: !50)
!715 = distinct !DILexicalBlock(scope: !680, file: !490, line: 2593, column: 5)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !717, file: !490, line: 2593, type: !50)
!717 = distinct !DILexicalBlock(scope: !715, file: !490, line: 2593, column: 178)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !719, file: !490, line: 2595, type: !50)
!719 = distinct !DILexicalBlock(scope: !680, file: !490, line: 2595, column: 5)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !721, file: !490, line: 2595, type: !50)
!721 = distinct !DILexicalBlock(scope: !719, file: !490, line: 2595, column: 179)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !723, file: !490, line: 2597, type: !50)
!723 = distinct !DILexicalBlock(scope: !680, file: !490, line: 2597, column: 5)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !725, file: !490, line: 2597, type: !50)
!725 = distinct !DILexicalBlock(scope: !723, file: !490, line: 2597, column: 185)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !727, file: !490, line: 2599, type: !50)
!727 = distinct !DILexicalBlock(scope: !680, file: !490, line: 2599, column: 5)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !729, file: !490, line: 2599, type: !50)
!729 = distinct !DILexicalBlock(scope: !727, file: !490, line: 2599, column: 185)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !731, file: !490, line: 2601, type: !50)
!731 = distinct !DILexicalBlock(scope: !680, file: !490, line: 2601, column: 5)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !733, file: !490, line: 2601, type: !50)
!733 = distinct !DILexicalBlock(scope: !731, file: !490, line: 2601, column: 183)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !735, file: !490, line: 2603, type: !50)
!735 = distinct !DILexicalBlock(scope: !680, file: !490, line: 2603, column: 5)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !737, file: !490, line: 2603, type: !50)
!737 = distinct !DILexicalBlock(scope: !735, file: !490, line: 2603, column: 177)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !739, file: !490, line: 2605, type: !50)
!739 = distinct !DILexicalBlock(scope: !680, file: !490, line: 2605, column: 5)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !741, file: !490, line: 2605, type: !50)
!741 = distinct !DILexicalBlock(scope: !739, file: !490, line: 2605, column: 178)
!742 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !743, file: !490, line: 2607, type: !50)
!743 = distinct !DILexicalBlock(scope: !680, file: !490, line: 2607, column: 5)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !745, file: !490, line: 2607, type: !50)
!745 = distinct !DILexicalBlock(scope: !743, file: !490, line: 2607, column: 179)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !747, file: !490, line: 2609, type: !50)
!747 = distinct !DILexicalBlock(scope: !680, file: !490, line: 2609, column: 5)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !749, file: !490, line: 2609, type: !50)
!749 = distinct !DILexicalBlock(scope: !747, file: !490, line: 2609, column: 180)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !751, file: !490, line: 2611, type: !50)
!751 = distinct !DILexicalBlock(scope: !680, file: !490, line: 2611, column: 5)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !753, file: !490, line: 2611, type: !50)
!753 = distinct !DILexicalBlock(scope: !751, file: !490, line: 2611, column: 177)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !755, file: !490, line: 2613, type: !50)
!755 = distinct !DILexicalBlock(scope: !680, file: !490, line: 2613, column: 5)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !757, file: !490, line: 2613, type: !50)
!757 = distinct !DILexicalBlock(scope: !755, file: !490, line: 2613, column: 177)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !759, file: !490, line: 2614, type: !50)
!759 = distinct !DILexicalBlock(scope: !680, file: !490, line: 2614, column: 5)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !761, file: !490, line: 2614, type: !50)
!761 = distinct !DILexicalBlock(scope: !759, file: !490, line: 2614, column: 176)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !763, file: !490, line: 2616, type: !50)
!763 = distinct !DILexicalBlock(scope: !680, file: !490, line: 2616, column: 5)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !765, file: !490, line: 2616, type: !50)
!765 = distinct !DILexicalBlock(scope: !763, file: !490, line: 2616, column: 179)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_code", scope: !767, file: !490, line: 2618, type: !50)
!767 = distinct !DILexicalBlock(scope: !680, file: !490, line: 2618, column: 5)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !769, file: !490, line: 2618, type: !50)
!769 = distinct !DILexicalBlock(scope: !767, file: !490, line: 2618, column: 175)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err_inst", scope: !771, file: !490, line: 2628, type: !11)
!771 = distinct !DILexicalBlock(scope: !772, file: !490, line: 2627, column: 14)
!772 = distinct !DILexicalBlock(scope: !773, file: !490, line: 2624, column: 13)
!773 = distinct !DILexicalBlock(scope: !774, file: !490, line: 2622, column: 36)
!774 = distinct !DILexicalBlock(scope: !680, file: !490, line: 2622, column: 9)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "args_tuple", scope: !771, file: !490, line: 2630, type: !50)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc_message", scope: !771, file: !490, line: 2631, type: !50)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !778, file: !490, line: 2640, type: !50)
!778 = distinct !DILexicalBlock(scope: !771, file: !490, line: 2640, column: 16)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !780, file: !490, line: 2643, type: !50)
!780 = distinct !DILexicalBlock(scope: !771, file: !490, line: 2643, column: 16)
!781 = !DISubprogram(name: "_PyExc_Fini", scope: !490, file: !490, line: 2649, type: !782, isLocal: false, isDefinition: true, scopeLine: 2650, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_PyExc_Fini, variables: !784)
!782 = !DISubroutineType(types: !783)
!783 = !{null}
!784 = !{!785, !787, !791, !793}
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !786, file: !490, line: 2651, type: !50)
!786 = distinct !DILexicalBlock(scope: !781, file: !490, line: 2651, column: 8)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !788, file: !490, line: 2651, type: !50)
!788 = distinct !DILexicalBlock(scope: !789, file: !490, line: 2651, column: 143)
!789 = distinct !DILexicalBlock(scope: !790, file: !490, line: 2651, column: 97)
!790 = distinct !DILexicalBlock(scope: !786, file: !490, line: 2651, column: 74)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !792, file: !490, line: 2653, type: !50)
!792 = distinct !DILexicalBlock(scope: !781, file: !490, line: 2653, column: 8)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !794, file: !490, line: 2653, type: !50)
!794 = distinct !DILexicalBlock(scope: !795, file: !490, line: 2653, column: 111)
!795 = distinct !DILexicalBlock(scope: !796, file: !490, line: 2653, column: 81)
!796 = distinct !DILexicalBlock(scope: !792, file: !490, line: 2653, column: 58)
!797 = !DISubprogram(name: "_PyErr_TrySetFromCause", scope: !490, file: !490, line: 2685, type: !798, isLocal: false, isDefinition: true, scopeLine: 2686, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, ...)* @_PyErr_TrySetFromCause, variables: !800)
!798 = !DISubroutineType(types: !799)
!799 = !{!50, !40, null}
!800 = !{!801, !802, !803, !804, !805, !806, !807, !809, !810, !811, !812, !813, !814, !815, !816, !829, !830, !834, !838, !840, !842}
!801 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 1, scope: !797, file: !490, line: 2685, type: !40)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msg_prefix", scope: !797, file: !490, line: 2687, type: !50)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc", scope: !797, file: !490, line: 2688, type: !50)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !797, file: !490, line: 2688, type: !50)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !797, file: !490, line: 2688, type: !50)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "caught_type", scope: !797, file: !490, line: 2689, type: !404)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dictptr", scope: !797, file: !490, line: 2690, type: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "instance_args", scope: !797, file: !490, line: 2691, type: !50)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_args", scope: !797, file: !490, line: 2692, type: !22)
!811 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "caught_type_size", scope: !797, file: !490, line: 2692, type: !22)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base_exc_size", scope: !797, file: !490, line: 2692, type: !22)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_exc", scope: !797, file: !490, line: 2693, type: !50)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_val", scope: !797, file: !490, line: 2693, type: !50)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_tb", scope: !797, file: !490, line: 2693, type: !50)
!816 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vargs", scope: !797, file: !490, line: 2694, type: !817)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !25, line: 79, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !819, line: 50, baseType: !820)
!819 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stdarg.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 2694, baseType: !821)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 192, align: 64, elements: !94)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "__va_list_tag", file: !1, line: 2694, baseType: !823)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 2694, size: 192, align: 64, elements: !824)
!824 = !{!825, !826, !827, !828}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !823, file: !1, line: 2694, baseType: !361, size: 32, align: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !823, file: !1, line: 2694, baseType: !361, size: 32, align: 32, offset: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !823, file: !1, line: 2694, baseType: !102, size: 64, align: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !823, file: !1, line: 2694, baseType: !102, size: 64, align: 64, offset: 128)
!829 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "same_basic_size", scope: !797, file: !490, line: 2695, type: !56)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !831, file: !490, line: 2760, type: !50)
!831 = distinct !DILexicalBlock(scope: !832, file: !490, line: 2760, column: 12)
!832 = distinct !DILexicalBlock(scope: !833, file: !490, line: 2758, column: 27)
!833 = distinct !DILexicalBlock(scope: !797, file: !490, line: 2758, column: 9)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !835, file: !490, line: 2771, type: !50)
!835 = distinct !DILexicalBlock(scope: !836, file: !490, line: 2771, column: 12)
!836 = distinct !DILexicalBlock(scope: !837, file: !490, line: 2770, column: 35)
!837 = distinct !DILexicalBlock(scope: !797, file: !490, line: 2770, column: 9)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !839, file: !490, line: 2772, type: !50)
!839 = distinct !DILexicalBlock(scope: !836, file: !490, line: 2772, column: 12)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !841, file: !490, line: 2778, type: !50)
!841 = distinct !DILexicalBlock(scope: !797, file: !490, line: 2778, column: 8)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !843, file: !490, line: 2779, type: !50)
!843 = distinct !DILexicalBlock(scope: !797, file: !490, line: 2779, column: 8)
!844 = !DISubprogram(name: "BaseException_set_tb", scope: !490, file: !490, line: 226, type: !845, isLocal: true, isDefinition: true, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyBaseExceptionObject*, %struct._object*)* @BaseException_set_tb, variables: !847)
!845 = !DISubroutineType(types: !846)
!846 = !{!56, !11, !50}
!847 = !{!848, !849, !850, !852, !854}
!848 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !844, file: !490, line: 226, type: !11)
!849 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tb", arg: 2, scope: !844, file: !490, line: 226, type: !50)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !851, file: !490, line: 238, type: !50)
!851 = distinct !DILexicalBlock(scope: !844, file: !490, line: 238, column: 8)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !853, file: !490, line: 239, type: !50)
!853 = distinct !DILexicalBlock(scope: !844, file: !490, line: 239, column: 8)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !855, file: !490, line: 239, type: !50)
!855 = distinct !DILexicalBlock(scope: !856, file: !490, line: 239, column: 107)
!856 = distinct !DILexicalBlock(scope: !853, file: !490, line: 239, column: 73)
!857 = !DISubprogram(name: "BaseException_dealloc", scope: !490, file: !490, line: 87, type: !858, isLocal: true, isDefinition: true, scopeLine: 88, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyBaseExceptionObject*)* @BaseException_dealloc, variables: !860)
!858 = !DISubroutineType(types: !859)
!859 = !{null, !11}
!860 = !{!861, !862}
!861 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !857, file: !490, line: 87, type: !11)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !863, file: !490, line: 89, type: !414)
!863 = distinct !DILexicalBlock(scope: !857, file: !490, line: 89, column: 8)
!864 = !DISubprogram(name: "BaseException_repr", scope: !490, file: !490, line: 119, type: !865, isLocal: true, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyBaseExceptionObject*)* @BaseException_repr, variables: !867)
!865 = !DISubroutineType(types: !866)
!866 = !{!50, !11}
!867 = !{!868, !869, !870}
!868 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !864, file: !490, line: 119, type: !11)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !864, file: !490, line: 121, type: !40)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dot", scope: !864, file: !490, line: 122, type: !40)
!871 = !DISubprogram(name: "BaseException_str", scope: !490, file: !490, line: 106, type: !865, isLocal: true, isDefinition: true, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyBaseExceptionObject*)* @BaseException_str, variables: !872)
!872 = !{!873}
!873 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !871, file: !490, line: 106, type: !11)
!874 = !DISubprogram(name: "BaseException_traverse", scope: !490, file: !490, line: 95, type: !875, isLocal: true, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyBaseExceptionObject*, i32 (%struct._object*, i8*)*, i8*)* @BaseException_traverse, variables: !877)
!875 = !DISubroutineType(types: !876)
!876 = !{!56, !11, !276, !102}
!877 = !{!878, !879, !880, !881, !885, !889, !893, !897}
!878 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !874, file: !490, line: 95, type: !11)
!879 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !874, file: !490, line: 95, type: !276)
!880 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !874, file: !490, line: 95, type: !102)
!881 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !882, file: !490, line: 97, type: !56)
!882 = distinct !DILexicalBlock(scope: !883, file: !490, line: 97, column: 26)
!883 = distinct !DILexicalBlock(scope: !884, file: !490, line: 97, column: 14)
!884 = distinct !DILexicalBlock(scope: !874, file: !490, line: 97, column: 8)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !886, file: !490, line: 98, type: !56)
!886 = distinct !DILexicalBlock(scope: !887, file: !490, line: 98, column: 26)
!887 = distinct !DILexicalBlock(scope: !888, file: !490, line: 98, column: 14)
!888 = distinct !DILexicalBlock(scope: !874, file: !490, line: 98, column: 8)
!889 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !890, file: !490, line: 99, type: !56)
!890 = distinct !DILexicalBlock(scope: !891, file: !490, line: 99, column: 31)
!891 = distinct !DILexicalBlock(scope: !892, file: !490, line: 99, column: 14)
!892 = distinct !DILexicalBlock(scope: !874, file: !490, line: 99, column: 8)
!893 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !894, file: !490, line: 100, type: !56)
