; ModuleID = 'irs-onlybc/faulthandler.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !17, subprograms: !359, globals: !928)
!1 = !DIFile(filename: "faulthandler.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyLockStatus", file: !4, line: 14, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pythread.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "PY_LOCK_FAILURE", value: 0)
!7 = !DIEnumerator(name: "PY_LOCK_ACQUIRED", value: 1)
!8 = !DIEnumerator(name: "PY_LOCK_INTR", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !10, line: 23, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!11 = !{!12, !13, !14, !15, !16}
!12 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!13 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!14 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!15 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!16 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!17 = !{!18, !19, !58, !357, !358, !110, !66}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !21, line: 109, baseType: !22)
!21 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !21, line: 105, size: 128, align: 64, elements: !23)
!23 = !{!24, !32}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !22, file: !21, line: 107, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !26, line: 177, baseType: !27)
!26 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !28, line: 102, baseType: !29)
!28 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !30, line: 181, baseType: !31)
!30 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!31 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !22, file: !21, line: 108, baseType: !33, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !21, line: 334, size: 3200, align: 64, elements: !35)
!35 = !{!36, !42, !46, !47, !48, !53, !116, !121, !126, !127, !132, !184, !215, !227, !233, !234, !235, !237, !239, !270, !271, !272, !281, !282, !287, !288, !290, !292, !302, !305, !323, !324, !325, !327, !329, !330, !332, !337, !342, !347, !348, !349, !350, !351, !352, !353, !354, !356}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !34, file: !21, line: 335, baseType: !37, size: 192, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !21, line: 114, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 111, size: 192, align: 64, elements: !39)
!39 = !{!40, !41}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !38, file: !21, line: 112, baseType: !20, size: 128, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !38, file: !21, line: 113, baseType: !25, size: 64, align: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !34, file: !21, line: 336, baseType: !43, size: 64, align: 64, offset: 192)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !34, file: !21, line: 337, baseType: !25, size: 64, align: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !34, file: !21, line: 337, baseType: !25, size: 64, align: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !34, file: !21, line: 341, baseType: !49, size: 64, align: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !21, line: 308, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{null, !19}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !34, file: !21, line: 342, baseType: !54, size: 64, align: 64, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !21, line: 314, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !19, !59, !58}
!58 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !28, line: 48, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 246, size: 1728, align: 64, elements: !63)
!62 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!63 = !{!64, !65, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !85, !86, !87, !88, !90, !92, !94, !98, !101, !103, !104, !105, !106, !107, !111, !112}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !61, file: !62, line: 247, baseType: !58, size: 32, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !61, file: !62, line: 252, baseType: !66, size: 64, align: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !61, file: !62, line: 253, baseType: !66, size: 64, align: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !61, file: !62, line: 254, baseType: !66, size: 64, align: 64, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !61, file: !62, line: 255, baseType: !66, size: 64, align: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !61, file: !62, line: 256, baseType: !66, size: 64, align: 64, offset: 320)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !61, file: !62, line: 257, baseType: !66, size: 64, align: 64, offset: 384)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !61, file: !62, line: 258, baseType: !66, size: 64, align: 64, offset: 448)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !61, file: !62, line: 259, baseType: !66, size: 64, align: 64, offset: 512)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !61, file: !62, line: 261, baseType: !66, size: 64, align: 64, offset: 576)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !61, file: !62, line: 262, baseType: !66, size: 64, align: 64, offset: 640)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !61, file: !62, line: 263, baseType: !66, size: 64, align: 64, offset: 704)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !61, file: !62, line: 265, baseType: !78, size: 64, align: 64, offset: 768)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !62, line: 161, size: 192, align: 64, elements: !80)
!80 = !{!81, !82, !84}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !79, file: !62, line: 162, baseType: !78, size: 64, align: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !79, file: !62, line: 163, baseType: !83, size: 64, align: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !79, file: !62, line: 167, baseType: !58, size: 32, align: 32, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !61, file: !62, line: 267, baseType: !83, size: 64, align: 64, offset: 832)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !61, file: !62, line: 269, baseType: !58, size: 32, align: 32, offset: 896)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !61, file: !62, line: 273, baseType: !58, size: 32, align: 32, offset: 928)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !61, file: !62, line: 275, baseType: !89, size: 64, align: 64, offset: 960)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !30, line: 140, baseType: !31)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !61, file: !62, line: 279, baseType: !91, size: 16, align: 16, offset: 1024)
!91 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !61, file: !62, line: 280, baseType: !93, size: 8, align: 8, offset: 1040)
!93 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !61, file: !62, line: 281, baseType: !95, size: 8, align: 8, offset: 1048)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8, align: 8, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 1)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !61, file: !62, line: 285, baseType: !99, size: 64, align: 64, offset: 1088)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !62, line: 155, baseType: null)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !61, file: !62, line: 294, baseType: !102, size: 64, align: 64, offset: 1152)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !30, line: 141, baseType: !31)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !61, file: !62, line: 303, baseType: !18, size: 64, align: 64, offset: 1216)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !61, file: !62, line: 304, baseType: !18, size: 64, align: 64, offset: 1280)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !61, file: !62, line: 305, baseType: !18, size: 64, align: 64, offset: 1344)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !61, file: !62, line: 306, baseType: !18, size: 64, align: 64, offset: 1408)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !61, file: !62, line: 307, baseType: !108, size: 64, align: 64, offset: 1472)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !109, line: 62, baseType: !110)
!109 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!110 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !61, file: !62, line: 309, baseType: !58, size: 32, align: 32, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !61, file: !62, line: 311, baseType: !113, size: 160, align: 8, offset: 1568)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 160, align: 8, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 20)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !34, file: !21, line: 343, baseType: !117, size: 64, align: 64, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !21, line: 316, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!19, !19, !66}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !34, file: !21, line: 344, baseType: !122, size: 64, align: 64, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !21, line: 318, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!58, !19, !66, !19}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !34, file: !21, line: 345, baseType: !18, size: 64, align: 64, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !34, file: !21, line: 346, baseType: !128, size: 64, align: 64, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !21, line: 320, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!19, !19}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !34, file: !21, line: 350, baseType: !133, size: 64, align: 64, offset: 768)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !21, line: 278, baseType: !135)
!135 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 236, size: 2176, align: 64, elements: !136)
!136 = !{!137, !142, !143, !144, !145, !146, !151, !153, !154, !155, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !135, file: !21, line: 241, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !21, line: 166, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!19, !19, !19}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !135, file: !21, line: 242, baseType: !138, size: 64, align: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !135, file: !21, line: 243, baseType: !138, size: 64, align: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !135, file: !21, line: 244, baseType: !138, size: 64, align: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !135, file: !21, line: 245, baseType: !138, size: 64, align: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !135, file: !21, line: 246, baseType: !147, size: 64, align: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !21, line: 167, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!19, !19, !19, !19}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !135, file: !21, line: 247, baseType: !152, size: 64, align: 64, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !21, line: 165, baseType: !129)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !135, file: !21, line: 248, baseType: !152, size: 64, align: 64, offset: 448)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !135, file: !21, line: 249, baseType: !152, size: 64, align: 64, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !135, file: !21, line: 250, baseType: !156, size: 64, align: 64, offset: 576)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !21, line: 168, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!58, !19}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !135, file: !21, line: 251, baseType: !152, size: 64, align: 64, offset: 640)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !135, file: !21, line: 252, baseType: !138, size: 64, align: 64, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !135, file: !21, line: 253, baseType: !138, size: 64, align: 64, offset: 768)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !135, file: !21, line: 254, baseType: !138, size: 64, align: 64, offset: 832)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !135, file: !21, line: 255, baseType: !138, size: 64, align: 64, offset: 896)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !135, file: !21, line: 256, baseType: !138, size: 64, align: 64, offset: 960)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !135, file: !21, line: 257, baseType: !152, size: 64, align: 64, offset: 1024)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !135, file: !21, line: 258, baseType: !18, size: 64, align: 64, offset: 1088)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !135, file: !21, line: 259, baseType: !152, size: 64, align: 64, offset: 1152)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !135, file: !21, line: 261, baseType: !138, size: 64, align: 64, offset: 1216)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !135, file: !21, line: 262, baseType: !138, size: 64, align: 64, offset: 1280)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !135, file: !21, line: 263, baseType: !138, size: 64, align: 64, offset: 1344)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !135, file: !21, line: 264, baseType: !138, size: 64, align: 64, offset: 1408)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !135, file: !21, line: 265, baseType: !147, size: 64, align: 64, offset: 1472)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !135, file: !21, line: 266, baseType: !138, size: 64, align: 64, offset: 1536)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !135, file: !21, line: 267, baseType: !138, size: 64, align: 64, offset: 1600)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !135, file: !21, line: 268, baseType: !138, size: 64, align: 64, offset: 1664)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !135, file: !21, line: 269, baseType: !138, size: 64, align: 64, offset: 1728)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !135, file: !21, line: 270, baseType: !138, size: 64, align: 64, offset: 1792)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !135, file: !21, line: 272, baseType: !138, size: 64, align: 64, offset: 1856)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !135, file: !21, line: 273, baseType: !138, size: 64, align: 64, offset: 1920)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !135, file: !21, line: 274, baseType: !138, size: 64, align: 64, offset: 1984)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !135, file: !21, line: 275, baseType: !138, size: 64, align: 64, offset: 2048)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !135, file: !21, line: 277, baseType: !152, size: 64, align: 64, offset: 2112)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !34, file: !21, line: 351, baseType: !185, size: 64, align: 64, offset: 832)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !21, line: 292, baseType: !187)
!187 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 280, size: 640, align: 64, elements: !188)
!188 = !{!189, !194, !195, !200, !201, !202, !207, !208, !213, !214}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !187, file: !21, line: 281, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !21, line: 169, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!25, !19}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !187, file: !21, line: 282, baseType: !138, size: 64, align: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !187, file: !21, line: 283, baseType: !196, size: 64, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !21, line: 170, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!19, !19, !25}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !187, file: !21, line: 284, baseType: !196, size: 64, align: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !187, file: !21, line: 285, baseType: !18, size: 64, align: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !187, file: !21, line: 286, baseType: !203, size: 64, align: 64, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !21, line: 172, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!58, !19, !25, !19}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !187, file: !21, line: 287, baseType: !18, size: 64, align: 64, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !187, file: !21, line: 288, baseType: !209, size: 64, align: 64, offset: 448)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !21, line: 231, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!58, !19, !19}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !187, file: !21, line: 290, baseType: !138, size: 64, align: 64, offset: 512)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !187, file: !21, line: 291, baseType: !196, size: 64, align: 64, offset: 576)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !34, file: !21, line: 352, baseType: !216, size: 64, align: 64, offset: 896)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !21, line: 298, baseType: !218)
!218 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 294, size: 192, align: 64, elements: !219)
!219 = !{!220, !221, !222}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !218, file: !21, line: 295, baseType: !190, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !218, file: !21, line: 296, baseType: !138, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !218, file: !21, line: 297, baseType: !223, size: 64, align: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !21, line: 174, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!58, !19, !19, !19}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !34, file: !21, line: 356, baseType: !228, size: 64, align: 64, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !21, line: 321, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64, align: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!232, !19}
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !26, line: 186, baseType: !25)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !34, file: !21, line: 357, baseType: !147, size: 64, align: 64, offset: 1024)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !34, file: !21, line: 358, baseType: !128, size: 64, align: 64, offset: 1088)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !34, file: !21, line: 359, baseType: !236, size: 64, align: 64, offset: 1152)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !21, line: 317, baseType: !139)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !34, file: !21, line: 360, baseType: !238, size: 64, align: 64, offset: 1216)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !21, line: 319, baseType: !224)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !34, file: !21, line: 363, baseType: !240, size: 64, align: 64, offset: 1280)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !21, line: 304, baseType: !242)
!242 = !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 301, size: 128, align: 64, elements: !243)
!243 = !{!244, !265}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !242, file: !21, line: 302, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !21, line: 193, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!58, !19, !249, !58}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !21, line: 191, baseType: !251)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !21, line: 178, size: 640, align: 64, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260, !262, !263, !264}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !251, file: !21, line: 179, baseType: !18, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !251, file: !21, line: 180, baseType: !19, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !251, file: !21, line: 181, baseType: !25, size: 64, align: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !251, file: !21, line: 182, baseType: !25, size: 64, align: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !251, file: !21, line: 184, baseType: !58, size: 32, align: 32, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !251, file: !21, line: 185, baseType: !58, size: 32, align: 32, offset: 288)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !251, file: !21, line: 186, baseType: !66, size: 64, align: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !251, file: !21, line: 187, baseType: !261, size: 64, align: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !251, file: !21, line: 188, baseType: !261, size: 64, align: 64, offset: 448)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !251, file: !21, line: 189, baseType: !261, size: 64, align: 64, offset: 512)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !251, file: !21, line: 190, baseType: !18, size: 64, align: 64, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !242, file: !21, line: 303, baseType: !266, size: 64, align: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !21, line: 194, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !19, !249}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !34, file: !21, line: 366, baseType: !110, size: 64, align: 64, offset: 1344)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !34, file: !21, line: 368, baseType: !43, size: 64, align: 64, offset: 1408)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !34, file: !21, line: 372, baseType: !273, size: 64, align: 64, offset: 1472)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !21, line: 233, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!58, !19, !277, !18}
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !21, line: 232, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!58, !19, !18}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !34, file: !21, line: 375, baseType: !156, size: 64, align: 64, offset: 1536)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !34, file: !21, line: 379, baseType: !283, size: 64, align: 64, offset: 1600)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !21, line: 322, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!19, !19, !19, !58}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !34, file: !21, line: 382, baseType: !25, size: 64, align: 64, offset: 1664)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !34, file: !21, line: 385, baseType: !289, size: 64, align: 64, offset: 1728)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !21, line: 323, baseType: !129)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !34, file: !21, line: 386, baseType: !291, size: 64, align: 64, offset: 1792)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !21, line: 324, baseType: !129)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !34, file: !21, line: 389, baseType: !293, size: 64, align: 64, offset: 1856)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !295, line: 40, size: 256, align: 64, elements: !296)
!295 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!296 = !{!297, !298, !300, !301}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !294, file: !295, line: 41, baseType: !43, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !294, file: !295, line: 42, baseType: !299, size: 64, align: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !295, line: 18, baseType: !139)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !294, file: !295, line: 43, baseType: !58, size: 32, align: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !294, file: !295, line: 45, baseType: !43, size: 64, align: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !34, file: !21, line: 390, baseType: !303, size: 64, align: 64, offset: 1920)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !21, line: 390, flags: DIFlagFwdDecl)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !34, file: !21, line: 391, baseType: !306, size: 64, align: 64, offset: 1984)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !308, line: 11, size: 320, align: 64, elements: !309)
!308 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!309 = !{!310, !311, !316, !321, !322}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !307, file: !308, line: 12, baseType: !66, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !307, file: !308, line: 13, baseType: !312, size: 64, align: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !308, line: 8, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!19, !19, !18}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !307, file: !308, line: 14, baseType: !317, size: 64, align: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !308, line: 9, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!58, !19, !19, !18}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !307, file: !308, line: 15, baseType: !66, size: 64, align: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !307, file: !308, line: 16, baseType: !18, size: 64, align: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !34, file: !21, line: 392, baseType: !33, size: 64, align: 64, offset: 2048)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !34, file: !21, line: 393, baseType: !19, size: 64, align: 64, offset: 2112)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !34, file: !21, line: 394, baseType: !326, size: 64, align: 64, offset: 2176)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !21, line: 325, baseType: !148)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !34, file: !21, line: 395, baseType: !328, size: 64, align: 64, offset: 2240)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !21, line: 326, baseType: !224)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !34, file: !21, line: 396, baseType: !25, size: 64, align: 64, offset: 2304)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !34, file: !21, line: 397, baseType: !331, size: 64, align: 64, offset: 2368)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !21, line: 327, baseType: !224)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !34, file: !21, line: 398, baseType: !333, size: 64, align: 64, offset: 2432)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !21, line: 329, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!19, !33, !25}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !34, file: !21, line: 399, baseType: !338, size: 64, align: 64, offset: 2496)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !21, line: 328, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!19, !33, !19, !19}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !34, file: !21, line: 400, baseType: !343, size: 64, align: 64, offset: 2560)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !21, line: 307, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !18}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !34, file: !21, line: 401, baseType: !156, size: 64, align: 64, offset: 2624)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !34, file: !21, line: 402, baseType: !19, size: 64, align: 64, offset: 2688)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !34, file: !21, line: 403, baseType: !19, size: 64, align: 64, offset: 2752)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !34, file: !21, line: 404, baseType: !19, size: 64, align: 64, offset: 2816)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !34, file: !21, line: 405, baseType: !19, size: 64, align: 64, offset: 2880)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !34, file: !21, line: 406, baseType: !19, size: 64, align: 64, offset: 2944)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !34, file: !21, line: 407, baseType: !49, size: 64, align: 64, offset: 3008)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !34, file: !21, line: 410, baseType: !355, size: 32, align: 32, offset: 3072)
!355 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !34, file: !21, line: 412, baseType: !49, size: 64, align: 64, offset: 3136)
!357 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!358 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!359 = !{!360, !365, !370, !375, !609, !624, !629, !638, !641, !644, !654, !681, !696, !721, !730, !735, !738, !741, !771, !777, !786, !792, !799, !812, !816, !820, !827, !831, !835, !840, !847, !860, !882, !898, !906, !918}
!360 = !DISubprogram(name: "PyInit_faulthandler", scope: !361, file: !361, line: 1045, type: !362, isLocal: false, isDefinition: true, scopeLine: 1046, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_faulthandler, variables: !364)
!361 = !DIFile(filename: "./Modules/faulthandler.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!362 = !DISubroutineType(types: !363)
!363 = !{!19}
!364 = !{}
!365 = !DISubprogram(name: "_PyFaulthandler_Init", scope: !361, file: !361, line: 1090, type: !366, isLocal: false, isDefinition: true, scopeLine: 1091, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @_PyFaulthandler_Init, variables: !368)
!366 = !DISubroutineType(types: !367)
!367 = !{!58}
!368 = !{!369}
!369 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !365, file: !361, line: 1093, type: !58)
!370 = !DISubprogram(name: "_PyFaulthandler_Fini", scope: !361, file: !361, line: 1124, type: !371, isLocal: false, isDefinition: true, scopeLine: 1125, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @_PyFaulthandler_Fini, variables: !373)
!371 = !DISubroutineType(types: !372)
!372 = !{null}
!373 = !{!374}
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signum", scope: !370, file: !361, line: 1127, type: !355)
!375 = !DISubprogram(name: "faulthandler_enable", scope: !361, file: !361, line: 318, type: !149, isLocal: true, isDefinition: true, scopeLine: 319, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @faulthandler_enable, variables: !376)
!376 = !{!377, !378, !379, !380, !381, !382, !383, !486, !487, !488, !489, !604, !606}
!377 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !375, file: !361, line: 318, type: !19)
!378 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !375, file: !361, line: 318, type: !19)
!379 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !375, file: !361, line: 318, type: !19)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file", scope: !375, file: !361, line: 321, type: !19)
!381 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "all_threads", scope: !375, file: !361, line: 322, type: !58)
!382 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !375, file: !361, line: 323, type: !355)
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handler", scope: !375, file: !361, line: 324, type: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "fault_handler_t", file: !361, line: 46, baseType: !386)
!386 = !DICompositeType(tag: DW_TAG_structure_type, file: !361, line: 40, size: 1408, align: 64, elements: !387)
!387 = !{!388, !389, !390, !391, !485}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "signum", scope: !386, file: !361, line: 41, baseType: !58, size: 32, align: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !386, file: !361, line: 42, baseType: !58, size: 32, align: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !386, file: !361, line: 43, baseType: !43, size: 64, align: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !386, file: !361, line: 44, baseType: !392, size: 1216, align: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_sighandler_t", file: !361, line: 35, baseType: !393)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !394, line: 24, size: 1216, align: 64, elements: !395)
!394 = !DIFile(filename: "/usr/include/bits/sigaction.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!395 = !{!396, !473, !482, !483}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !393, file: !394, line: 35, baseType: !397, size: 64, align: 64)
!397 = !DICompositeType(tag: DW_TAG_union_type, scope: !393, file: !394, line: 28, size: 64, align: 64, elements: !398)
!398 = !{!399, !405}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !397, file: !394, line: 31, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !401, line: 85, baseType: !402)
!401 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64, align: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{null, !58}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !397, file: !394, line: 33, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !58, !409, !18}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !411, line: 127, baseType: !412)
!411 = !DIFile(filename: "/usr/include/bits/siginfo.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!412 = !DICompositeType(tag: DW_TAG_structure_type, file: !411, line: 62, size: 1024, align: 64, elements: !413)
!413 = !{!414, !415, !416, !417}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !412, file: !411, line: 64, baseType: !58, size: 32, align: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !412, file: !411, line: 65, baseType: !58, size: 32, align: 32, offset: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !412, file: !411, line: 67, baseType: !58, size: 32, align: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !412, file: !411, line: 126, baseType: !418, size: 896, align: 64, offset: 128)
!418 = !DICompositeType(tag: DW_TAG_union_type, scope: !412, file: !411, line: 69, size: 896, align: 64, elements: !419)
!419 = !{!420, !424, !431, !442, !448, !458, !462, !467}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !418, file: !411, line: 71, baseType: !421, size: 896, align: 32)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 896, align: 32, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 28)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !418, file: !411, line: 78, baseType: !425, size: 64, align: 32)
!425 = !DICompositeType(tag: DW_TAG_structure_type, scope: !418, file: !411, line: 74, size: 64, align: 32, elements: !426)
!426 = !{!427, !429}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !425, file: !411, line: 76, baseType: !428, size: 32, align: 32)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !30, line: 142, baseType: !58)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !425, file: !411, line: 77, baseType: !430, size: 32, align: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !30, line: 134, baseType: !355)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !418, file: !411, line: 86, baseType: !432, size: 128, align: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, scope: !418, file: !411, line: 81, size: 128, align: 64, elements: !433)
!433 = !{!434, !435, !436}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !432, file: !411, line: 83, baseType: !58, size: 32, align: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !432, file: !411, line: 84, baseType: !58, size: 32, align: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !432, file: !411, line: 85, baseType: !437, size: 64, align: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !411, line: 36, baseType: !438)
!438 = !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !411, line: 32, size: 64, align: 64, elements: !439)
!439 = !{!440, !441}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !438, file: !411, line: 34, baseType: !58, size: 32, align: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !438, file: !411, line: 35, baseType: !18, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !418, file: !411, line: 94, baseType: !443, size: 128, align: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, scope: !418, file: !411, line: 89, size: 128, align: 64, elements: !444)
!444 = !{!445, !446, !447}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !443, file: !411, line: 91, baseType: !428, size: 32, align: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !443, file: !411, line: 92, baseType: !430, size: 32, align: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !443, file: !411, line: 93, baseType: !437, size: 64, align: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !418, file: !411, line: 104, baseType: !449, size: 256, align: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, scope: !418, file: !411, line: 97, size: 256, align: 64, elements: !450)
!450 = !{!451, !452, !453, !454, !457}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !449, file: !411, line: 99, baseType: !428, size: 32, align: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !449, file: !411, line: 100, baseType: !430, size: 32, align: 32, offset: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !449, file: !411, line: 101, baseType: !58, size: 32, align: 32, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !449, file: !411, line: 102, baseType: !455, size: 64, align: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigchld_clock_t", file: !411, line: 58, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !30, line: 144, baseType: !31)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !449, file: !411, line: 103, baseType: !455, size: 64, align: 64, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !418, file: !411, line: 110, baseType: !459, size: 64, align: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, scope: !418, file: !411, line: 107, size: 64, align: 64, elements: !460)
!460 = !{!461}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !459, file: !411, line: 109, baseType: !18, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !418, file: !411, line: 117, baseType: !463, size: 128, align: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, scope: !418, file: !411, line: 113, size: 128, align: 64, elements: !464)
!464 = !{!465, !466}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !463, file: !411, line: 115, baseType: !31, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !463, file: !411, line: 116, baseType: !58, size: 32, align: 32, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !418, file: !411, line: 125, baseType: !468, size: 128, align: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, scope: !418, file: !411, line: 120, size: 128, align: 64, elements: !469)
!469 = !{!470, !471, !472}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !468, file: !411, line: 122, baseType: !18, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !468, file: !411, line: 123, baseType: !58, size: 32, align: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !468, file: !411, line: 124, baseType: !355, size: 32, align: 32, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !393, file: !394, line: 43, baseType: !474, size: 1024, align: 64, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !475, line: 31, baseType: !476)
!475 = !DIFile(filename: "/usr/include/bits/sigset.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!476 = !DICompositeType(tag: DW_TAG_structure_type, file: !475, line: 28, size: 1024, align: 64, elements: !477)
!477 = !{!478}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !476, file: !475, line: 30, baseType: !479, size: 1024, align: 64)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 1024, align: 64, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 16)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !393, file: !394, line: 46, baseType: !58, size: 32, align: 32, offset: 1088)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !393, file: !394, line: 49, baseType: !484, size: 64, align: 64, offset: 1152)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "all_threads", scope: !386, file: !361, line: 45, baseType: !58, size: 32, align: 32, offset: 1344)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "action", scope: !375, file: !361, line: 326, type: !393)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !375, file: !361, line: 328, type: !58)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !375, file: !361, line: 329, type: !58)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !375, file: !361, line: 330, type: !490)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !492, line: 139, baseType: !493)
!492 = !DIFile(filename: "Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !492, line: 69, size: 1536, align: 64, elements: !494)
!494 = !{!495, !497, !498, !518, !577, !578, !579, !580, !581, !582, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !493, file: !492, line: 72, baseType: !496, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64, align: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !493, file: !492, line: 73, baseType: !496, size: 64, align: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !493, file: !492, line: 74, baseType: !499, size: 64, align: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !492, line: 44, baseType: !501)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !492, line: 19, size: 832, align: 64, elements: !502)
!502 = !{!503, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !501, file: !492, line: 21, baseType: !504, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !501, file: !492, line: 22, baseType: !496, size: 64, align: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !501, file: !492, line: 24, baseType: !19, size: 64, align: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !501, file: !492, line: 25, baseType: !19, size: 64, align: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !501, file: !492, line: 26, baseType: !19, size: 64, align: 64, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !501, file: !492, line: 27, baseType: !19, size: 64, align: 64, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !501, file: !492, line: 28, baseType: !19, size: 64, align: 64, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !501, file: !492, line: 30, baseType: !19, size: 64, align: 64, offset: 448)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !501, file: !492, line: 31, baseType: !19, size: 64, align: 64, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !501, file: !492, line: 32, baseType: !19, size: 64, align: 64, offset: 576)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !501, file: !492, line: 33, baseType: !58, size: 32, align: 32, offset: 640)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !501, file: !492, line: 34, baseType: !58, size: 32, align: 32, offset: 672)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !501, file: !492, line: 37, baseType: !58, size: 32, align: 32, offset: 704)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !501, file: !492, line: 43, baseType: !19, size: 64, align: 64, offset: 768)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !493, file: !492, line: 76, baseType: !519, size: 64, align: 64, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64, align: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !521, line: 17, size: 3072, align: 64, elements: !522)
!521 = !DIFile(filename: "Include/frameobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!522 = !{!523, !524, !525, !552, !553, !554, !555, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !575}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !520, file: !521, line: 18, baseType: !37, size: 192, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "f_back", scope: !520, file: !521, line: 19, baseType: !519, size: 64, align: 64, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "f_code", scope: !520, file: !521, line: 20, baseType: !526, size: 64, align: 64, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !528, line: 33, baseType: !529)
!528 = !DIFile(filename: "Include/code.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!529 = !DICompositeType(tag: DW_TAG_structure_type, file: !528, line: 11, size: 1152, align: 64, elements: !530)
!530 = !{!531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !546, !547, !548, !549, !550, !551}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !529, file: !528, line: 12, baseType: !20, size: 128, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !529, file: !528, line: 13, baseType: !58, size: 32, align: 32, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !529, file: !528, line: 14, baseType: !58, size: 32, align: 32, offset: 160)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !529, file: !528, line: 15, baseType: !58, size: 32, align: 32, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !529, file: !528, line: 16, baseType: !58, size: 32, align: 32, offset: 224)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !529, file: !528, line: 17, baseType: !58, size: 32, align: 32, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "co_code", scope: !529, file: !528, line: 18, baseType: !19, size: 64, align: 64, offset: 320)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !529, file: !528, line: 19, baseType: !19, size: 64, align: 64, offset: 384)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !529, file: !528, line: 20, baseType: !19, size: 64, align: 64, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "co_varnames", scope: !529, file: !528, line: 21, baseType: !19, size: 64, align: 64, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "co_freevars", scope: !529, file: !528, line: 22, baseType: !19, size: 64, align: 64, offset: 576)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "co_cellvars", scope: !529, file: !528, line: 23, baseType: !19, size: 64, align: 64, offset: 640)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "co_cell2arg", scope: !529, file: !528, line: 25, baseType: !544, size: 64, align: 64, offset: 704)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64, align: 64)
!545 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !529, file: !528, line: 26, baseType: !19, size: 64, align: 64, offset: 768)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !529, file: !528, line: 27, baseType: !19, size: 64, align: 64, offset: 832)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !529, file: !528, line: 28, baseType: !58, size: 32, align: 32, offset: 896)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "co_lnotab", scope: !529, file: !528, line: 29, baseType: !19, size: 64, align: 64, offset: 960)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "co_zombieframe", scope: !529, file: !528, line: 31, baseType: !18, size: 64, align: 64, offset: 1024)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !529, file: !528, line: 32, baseType: !19, size: 64, align: 64, offset: 1088)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "f_builtins", scope: !520, file: !521, line: 21, baseType: !19, size: 64, align: 64, offset: 320)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "f_globals", scope: !520, file: !521, line: 22, baseType: !19, size: 64, align: 64, offset: 384)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "f_locals", scope: !520, file: !521, line: 23, baseType: !19, size: 64, align: 64, offset: 448)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "f_valuestack", scope: !520, file: !521, line: 24, baseType: !556, size: 64, align: 64, offset: 512)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "f_stacktop", scope: !520, file: !521, line: 28, baseType: !556, size: 64, align: 64, offset: 576)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "f_trace", scope: !520, file: !521, line: 29, baseType: !19, size: 64, align: 64, offset: 640)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_type", scope: !520, file: !521, line: 38, baseType: !19, size: 64, align: 64, offset: 704)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_value", scope: !520, file: !521, line: 38, baseType: !19, size: 64, align: 64, offset: 768)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_traceback", scope: !520, file: !521, line: 38, baseType: !19, size: 64, align: 64, offset: 832)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "f_gen", scope: !520, file: !521, line: 40, baseType: !19, size: 64, align: 64, offset: 896)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "f_lasti", scope: !520, file: !521, line: 42, baseType: !58, size: 32, align: 32, offset: 960)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "f_lineno", scope: !520, file: !521, line: 48, baseType: !58, size: 32, align: 32, offset: 992)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "f_iblock", scope: !520, file: !521, line: 49, baseType: !58, size: 32, align: 32, offset: 1024)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "f_executing", scope: !520, file: !521, line: 50, baseType: !45, size: 8, align: 8, offset: 1056)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "f_blockstack", scope: !520, file: !521, line: 51, baseType: !568, size: 1920, align: 32, offset: 1088)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 1920, align: 32, elements: !114)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTryBlock", file: !521, line: 15, baseType: !570)
!570 = !DICompositeType(tag: DW_TAG_structure_type, file: !521, line: 11, size: 96, align: 32, elements: !571)
!571 = !{!572, !573, !574}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "b_type", scope: !570, file: !521, line: 12, baseType: !58, size: 32, align: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "b_handler", scope: !570, file: !521, line: 13, baseType: !58, size: 32, align: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "b_level", scope: !570, file: !521, line: 14, baseType: !58, size: 32, align: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "f_localsplus", scope: !520, file: !521, line: 52, baseType: !576, size: 64, align: 64, offset: 3008)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 64, align: 64, elements: !96)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !493, file: !492, line: 77, baseType: !58, size: 32, align: 32, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !493, file: !492, line: 78, baseType: !45, size: 8, align: 8, offset: 288)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !493, file: !492, line: 80, baseType: !45, size: 8, align: 8, offset: 296)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !493, file: !492, line: 85, baseType: !58, size: 32, align: 32, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !493, file: !492, line: 86, baseType: !58, size: 32, align: 32, offset: 352)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !493, file: !492, line: 88, baseType: !583, size: 64, align: 64, offset: 384)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !492, line: 54, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{!58, !19, !519, !58, !19}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !493, file: !492, line: 89, baseType: !583, size: 64, align: 64, offset: 448)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !493, file: !492, line: 90, baseType: !19, size: 64, align: 64, offset: 512)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !493, file: !492, line: 91, baseType: !19, size: 64, align: 64, offset: 576)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !493, file: !492, line: 93, baseType: !19, size: 64, align: 64, offset: 640)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !493, file: !492, line: 94, baseType: !19, size: 64, align: 64, offset: 704)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !493, file: !492, line: 95, baseType: !19, size: 64, align: 64, offset: 768)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !493, file: !492, line: 97, baseType: !19, size: 64, align: 64, offset: 832)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !493, file: !492, line: 98, baseType: !19, size: 64, align: 64, offset: 896)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !493, file: !492, line: 99, baseType: !19, size: 64, align: 64, offset: 960)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !493, file: !492, line: 101, baseType: !19, size: 64, align: 64, offset: 1024)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !493, file: !492, line: 103, baseType: !58, size: 32, align: 32, offset: 1088)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !493, file: !492, line: 105, baseType: !19, size: 64, align: 64, offset: 1152)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !493, file: !492, line: 106, baseType: !31, size: 64, align: 64, offset: 1216)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !493, file: !492, line: 108, baseType: !58, size: 32, align: 32, offset: 1280)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !493, file: !492, line: 109, baseType: !19, size: 64, align: 64, offset: 1344)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !493, file: !492, line: 134, baseType: !344, size: 64, align: 64, offset: 1408)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !493, file: !492, line: 135, baseType: !18, size: 64, align: 64, offset: 1472)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !605, file: !361, line: 344, type: !19)
!605 = distinct !DILexicalBlock(scope: !375, file: !361, line: 344, column: 8)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !607, file: !361, line: 344, type: !19)
!607 = distinct !DILexicalBlock(scope: !608, file: !361, line: 344, column: 108)
!608 = distinct !DILexicalBlock(scope: !605, file: !361, line: 344, column: 74)
!609 = !DISubprogram(name: "faulthandler_get_fileno", scope: !361, file: !361, line: 135, type: !610, isLocal: true, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i32*)* @faulthandler_get_fileno, variables: !613)
!610 = !DISubroutineType(types: !611)
!611 = !{!19, !19, !612}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!613 = !{!614, !615, !616, !617, !618, !619, !621}
!614 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 1, scope: !609, file: !361, line: 135, type: !19)
!615 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_fd", arg: 2, scope: !609, file: !361, line: 135, type: !612)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !609, file: !361, line: 137, type: !19)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd_long", scope: !609, file: !361, line: 138, type: !31)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !609, file: !361, line: 139, type: !58)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !620, file: !361, line: 163, type: !19)
!620 = distinct !DILexicalBlock(scope: !609, file: !361, line: 163, column: 8)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !622, file: !361, line: 173, type: !19)
!622 = distinct !DILexicalBlock(scope: !623, file: !361, line: 173, column: 12)
!623 = distinct !DILexicalBlock(scope: !609, file: !361, line: 172, column: 9)
!624 = !DISubprogram(name: "get_thread_state", scope: !361, file: !361, line: 185, type: !625, isLocal: true, isDefinition: true, scopeLine: 186, flags: DIFlagPrototyped, isOptimized: true, function: %struct._ts* ()* @get_thread_state, variables: !627)
!625 = !DISubroutineType(types: !626)
!626 = !{!490}
!627 = !{!628}
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !624, file: !361, line: 187, type: !490)
!629 = !DISubprogram(name: "faulthandler_fatal_error", scope: !361, file: !361, line: 248, type: !403, isLocal: true, isDefinition: true, scopeLine: 249, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @faulthandler_fatal_error, variables: !630)
!630 = !{!631, !632, !634, !635, !636, !637}
!631 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "signum", arg: 1, scope: !629, file: !361, line: 248, type: !58)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !629, file: !361, line: 250, type: !633)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !629, file: !361, line: 251, type: !355)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "handler", scope: !629, file: !361, line: 252, type: !384)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !629, file: !361, line: 253, type: !490)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "save_errno", scope: !629, file: !361, line: 254, type: !58)
!638 = !DISubprogram(name: "faulthandler_disable_py", scope: !361, file: !361, line: 410, type: !130, isLocal: true, isDefinition: true, scopeLine: 411, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @faulthandler_disable_py, variables: !639)
!639 = !{!640}
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !638, file: !361, line: 410, type: !19)
!641 = !DISubprogram(name: "faulthandler_is_enabled", scope: !361, file: !361, line: 422, type: !130, isLocal: true, isDefinition: true, scopeLine: 423, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @faulthandler_is_enabled, variables: !642)
!642 = !{!643}
!643 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !641, file: !361, line: 422, type: !19)
!644 = !DISubprogram(name: "faulthandler_dump_traceback_py", scope: !361, file: !361, line: 197, type: !149, isLocal: true, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @faulthandler_dump_traceback_py, variables: !645)
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653}
!646 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !644, file: !361, line: 197, type: !19)
!647 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !644, file: !361, line: 198, type: !19)
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !644, file: !361, line: 198, type: !19)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file", scope: !644, file: !361, line: 201, type: !19)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "all_threads", scope: !644, file: !361, line: 202, type: !58)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !644, file: !361, line: 203, type: !490)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errmsg", scope: !644, file: !361, line: 204, type: !43)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !644, file: !361, line: 205, type: !58)
!654 = !DISubprogram(name: "faulthandler_dump_traceback_later", scope: !361, file: !361, line: 518, type: !149, isLocal: true, isDefinition: true, scopeLine: 520, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @faulthandler_dump_traceback_later, variables: !655)
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !670, !673, !677}
!656 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !654, file: !361, line: 518, type: !19)
!657 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !654, file: !361, line: 519, type: !19)
!658 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !654, file: !361, line: 519, type: !19)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timeout", scope: !654, file: !361, line: 522, type: !357)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "timeout_us", scope: !654, file: !361, line: 523, type: !358)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "repeat", scope: !654, file: !361, line: 524, type: !58)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file", scope: !654, file: !361, line: 525, type: !19)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !654, file: !361, line: 526, type: !58)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exit", scope: !654, file: !361, line: 527, type: !58)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !654, file: !361, line: 528, type: !490)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "header", scope: !654, file: !361, line: 529, type: !66)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "header_len", scope: !654, file: !361, line: 530, type: !108)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !669, file: !361, line: 563, type: !19)
!669 = distinct !DILexicalBlock(scope: !654, file: !361, line: 563, column: 8)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !671, file: !361, line: 563, type: !19)
!671 = distinct !DILexicalBlock(scope: !672, file: !361, line: 563, column: 103)
!672 = distinct !DILexicalBlock(scope: !669, file: !361, line: 563, column: 69)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !674, file: !361, line: 579, type: !19)
!674 = distinct !DILexicalBlock(scope: !675, file: !361, line: 579, column: 12)
!675 = distinct !DILexicalBlock(scope: !676, file: !361, line: 577, column: 75)
!676 = distinct !DILexicalBlock(scope: !654, file: !361, line: 577, column: 9)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !678, file: !361, line: 579, type: !19)
!678 = distinct !DILexicalBlock(scope: !679, file: !361, line: 579, column: 121)
!679 = distinct !DILexicalBlock(scope: !680, file: !361, line: 579, column: 88)
!680 = distinct !DILexicalBlock(scope: !674, file: !361, line: 579, column: 65)
!681 = !DISubprogram(name: "format_timeout", scope: !361, file: !361, line: 491, type: !682, isLocal: true, isDefinition: true, scopeLine: 492, flags: DIFlagPrototyped, isOptimized: true, function: i8* (double)* @format_timeout, variables: !684)
!682 = !DISubroutineType(types: !683)
!683 = !{!66, !357}
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692}
!685 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "timeout", arg: 1, scope: !681, file: !361, line: 491, type: !357)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "us", scope: !681, file: !361, line: 493, type: !110)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sec", scope: !681, file: !361, line: 493, type: !110)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min", scope: !681, file: !361, line: 493, type: !110)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hour", scope: !681, file: !361, line: 493, type: !110)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "intpart", scope: !681, file: !361, line: 494, type: !357)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fracpart", scope: !681, file: !361, line: 494, type: !357)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !681, file: !361, line: 495, type: !693)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 800, align: 8, elements: !694)
!694 = !{!695}
!695 = !DISubrange(count: 100)
!696 = !DISubprogram(name: "faulthandler_thread", scope: !361, file: !361, line: 430, type: !345, isLocal: true, isDefinition: true, scopeLine: 431, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*)* @faulthandler_thread, variables: !697)
!697 = !{!698, !699, !701, !702, !703, !704, !707, !715, !716, !719}
!698 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 1, scope: !696, file: !361, line: 430, type: !18)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !696, file: !361, line: 432, type: !700)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLockStatus", file: !4, line: 18, baseType: !3)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "errmsg", scope: !696, file: !361, line: 433, type: !43)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "current", scope: !696, file: !361, line: 434, type: !490)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ok", scope: !696, file: !361, line: 435, type: !58)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "set", scope: !696, file: !361, line: 437, type: !705)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !706, line: 37, baseType: !474)
!706 = !DIFile(filename: "/usr/include/sys/select.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !708, file: !361, line: 455, type: !710)
!708 = distinct !DILexicalBlock(scope: !709, file: !361, line: 455, column: 34)
!709 = distinct !DILexicalBlock(scope: !696, file: !361, line: 444, column: 8)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64, align: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !10, line: 33, baseType: !712)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !10, line: 31, size: 64, align: 64, elements: !713)
!713 = !{!714}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !712, file: !10, line: 32, baseType: !18, size: 64, align: 64)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !708, file: !361, line: 455, type: !18)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !708, file: !361, line: 455, type: !717)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64, align: 64)
!718 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !18)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !708, file: !361, line: 455, type: !720)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !10, line: 29, baseType: !9)
!721 = !DISubprogram(name: "_Py_ANNOTATE_MEMORY_ORDER", scope: !10, file: !10, line: 59, type: !722, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32)* @_Py_ANNOTATE_MEMORY_ORDER, variables: !727)
!722 = !DISubroutineType(types: !723)
!723 = !{null, !724, !720}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!727 = !{!728, !729}
!728 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "address", arg: 1, scope: !721, file: !10, line: 59, type: !724)
!729 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 2, scope: !721, file: !10, line: 59, type: !720)
!730 = !DISubprogram(name: "_Py_atomic_thread_fence", scope: !10, file: !10, line: 51, type: !731, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @_Py_atomic_thread_fence, variables: !733)
!731 = !DISubroutineType(types: !732)
!732 = !{null, !720}
!733 = !{!734}
!734 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !730, file: !10, line: 51, type: !720)
!735 = !DISubprogram(name: "_Py_atomic_signal_fence", scope: !10, file: !10, line: 44, type: !731, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @_Py_atomic_signal_fence, variables: !736)
!736 = !{!737}
!737 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !735, file: !10, line: 44, type: !720)
!738 = !DISubprogram(name: "faulthandler_cancel_dump_traceback_later_py", scope: !361, file: !361, line: 591, type: !130, isLocal: true, isDefinition: true, scopeLine: 592, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @faulthandler_cancel_dump_traceback_later_py, variables: !739)
!739 = !{!740}
!740 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !738, file: !361, line: 591, type: !19)
!741 = !DISubprogram(name: "faulthandler_register_py", scope: !361, file: !361, line: 708, type: !149, isLocal: true, isDefinition: true, scopeLine: 710, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @faulthandler_register_py, variables: !742)
!742 = !{!743, !744, !745, !746, !747, !748, !749, !750, !751, !763, !764, !765, !766, !768}
!743 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !741, file: !361, line: 708, type: !19)
!744 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !741, file: !361, line: 709, type: !19)
!745 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwargs", arg: 3, scope: !741, file: !361, line: 709, type: !19)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signum", scope: !741, file: !361, line: 712, type: !58)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "file", scope: !741, file: !361, line: 713, type: !19)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "all_threads", scope: !741, file: !361, line: 714, type: !58)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chain", scope: !741, file: !361, line: 715, type: !58)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !741, file: !361, line: 716, type: !58)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "user", scope: !741, file: !361, line: 717, type: !752)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64, align: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "user_signal_t", file: !361, line: 84, baseType: !754)
!754 = !DICompositeType(tag: DW_TAG_structure_type, file: !361, line: 76, size: 1536, align: 64, elements: !755)
!755 = !{!756, !757, !758, !759, !760, !761, !762}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !754, file: !361, line: 77, baseType: !58, size: 32, align: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !754, file: !361, line: 78, baseType: !19, size: 64, align: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !754, file: !361, line: 79, baseType: !58, size: 32, align: 32, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "all_threads", scope: !754, file: !361, line: 80, baseType: !58, size: 32, align: 32, offset: 160)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !754, file: !361, line: 81, baseType: !58, size: 32, align: 32, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !754, file: !361, line: 82, baseType: !392, size: 1216, align: 64, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !754, file: !361, line: 83, baseType: !499, size: 64, align: 64, offset: 1472)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "previous", scope: !741, file: !361, line: 718, type: !392)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !741, file: !361, line: 719, type: !490)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !741, file: !361, line: 720, type: !58)
!766 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !767, file: !361, line: 756, type: !19)
!767 = distinct !DILexicalBlock(scope: !741, file: !361, line: 756, column: 8)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !769, file: !361, line: 756, type: !19)
!769 = distinct !DILexicalBlock(scope: !770, file: !361, line: 756, column: 102)
!770 = distinct !DILexicalBlock(scope: !767, file: !361, line: 756, column: 68)
!771 = !DISubprogram(name: "check_signum", scope: !361, file: !361, line: 687, type: !772, isLocal: true, isDefinition: true, scopeLine: 688, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @check_signum, variables: !774)
!772 = !DISubroutineType(types: !773)
!773 = !{!58, !58}
!774 = !{!775, !776}
!775 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "signum", arg: 1, scope: !771, file: !361, line: 687, type: !58)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !771, file: !361, line: 689, type: !355)
!777 = !DISubprogram(name: "faulthandler_register", scope: !361, file: !361, line: 600, type: !778, isLocal: true, isDefinition: true, scopeLine: 601, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, %struct.sigaction*)* @faulthandler_register, variables: !781)
!778 = !DISubroutineType(types: !779)
!779 = !{!58, !58, !58, !780}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64, align: 64)
!781 = !{!782, !783, !784, !785}
!782 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "signum", arg: 1, scope: !777, file: !361, line: 600, type: !58)
!783 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "chain", arg: 2, scope: !777, file: !361, line: 600, type: !58)
!784 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_previous", arg: 3, scope: !777, file: !361, line: 600, type: !780)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "action", scope: !777, file: !361, line: 603, type: !393)
!786 = !DISubprogram(name: "faulthandler_user", scope: !361, file: !361, line: 640, type: !403, isLocal: true, isDefinition: true, scopeLine: 641, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @faulthandler_user, variables: !787)
!787 = !{!788, !789, !790, !791}
!788 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "signum", arg: 1, scope: !786, file: !361, line: 640, type: !58)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "user", scope: !786, file: !361, line: 642, type: !752)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tstate", scope: !786, file: !361, line: 643, type: !490)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "save_errno", scope: !786, file: !361, line: 644, type: !58)
!792 = !DISubprogram(name: "faulthandler_unregister_py", scope: !361, file: !361, line: 785, type: !140, isLocal: true, isDefinition: true, scopeLine: 786, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @faulthandler_unregister_py, variables: !793)
!793 = !{!794, !795, !796, !797, !798}
!794 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !792, file: !361, line: 785, type: !19)
!795 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !792, file: !361, line: 785, type: !19)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signum", scope: !792, file: !361, line: 787, type: !58)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "user", scope: !792, file: !361, line: 788, type: !752)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "change", scope: !792, file: !361, line: 789, type: !58)
!799 = !DISubprogram(name: "faulthandler_read_null", scope: !361, file: !361, line: 808, type: !140, isLocal: true, isDefinition: true, scopeLine: 809, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @faulthandler_read_null, variables: !800)
!800 = !{!801, !802, !803, !806, !807, !808}
!801 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !799, file: !361, line: 808, type: !19)
!802 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !799, file: !361, line: 808, type: !19)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !799, file: !361, line: 810, type: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64, align: 64)
!805 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !799, file: !361, line: 811, type: !805)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "release_gil", scope: !799, file: !361, line: 812, type: !58)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !809, file: !361, line: 818, type: !490)
!809 = distinct !DILexicalBlock(scope: !810, file: !361, line: 818, column: 9)
!810 = distinct !DILexicalBlock(scope: !811, file: !361, line: 817, column: 22)
!811 = distinct !DILexicalBlock(scope: !799, file: !361, line: 817, column: 9)
!812 = !DISubprogram(name: "faulthandler_sigsegv", scope: !361, file: !361, line: 828, type: !140, isLocal: true, isDefinition: true, scopeLine: 829, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @faulthandler_sigsegv, variables: !813)
!813 = !{!814, !815}
!814 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !812, file: !361, line: 828, type: !19)
!815 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !812, file: !361, line: 828, type: !19)
!816 = !DISubprogram(name: "faulthandler_sigabrt", scope: !361, file: !361, line: 866, type: !140, isLocal: true, isDefinition: true, scopeLine: 867, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @faulthandler_sigabrt, variables: !817)
!817 = !{!818, !819}
!818 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !816, file: !361, line: 866, type: !19)
!819 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !816, file: !361, line: 866, type: !19)
!820 = !DISubprogram(name: "faulthandler_sigfpe", scope: !361, file: !361, line: 851, type: !140, isLocal: true, isDefinition: true, scopeLine: 852, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @faulthandler_sigfpe, variables: !821)
!821 = !{!822, !823, !824, !825, !826}
!822 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !820, file: !361, line: 851, type: !19)
!823 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !820, file: !361, line: 851, type: !19)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !820, file: !361, line: 855, type: !805)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !820, file: !361, line: 855, type: !805)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !820, file: !361, line: 855, type: !805)
!827 = !DISubprogram(name: "faulthandler_sigbus", scope: !361, file: !361, line: 879, type: !140, isLocal: true, isDefinition: true, scopeLine: 880, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @faulthandler_sigbus, variables: !828)
!828 = !{!829, !830}
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !827, file: !361, line: 879, type: !19)
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !827, file: !361, line: 879, type: !19)
!831 = !DISubprogram(name: "faulthandler_sigill", scope: !361, file: !361, line: 888, type: !140, isLocal: true, isDefinition: true, scopeLine: 889, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @faulthandler_sigill, variables: !832)
!832 = !{!833, !834}
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !831, file: !361, line: 888, type: !19)
!834 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !831, file: !361, line: 888, type: !19)
!835 = !DISubprogram(name: "faulthandler_fatal_error_py", scope: !361, file: !361, line: 896, type: !140, isLocal: true, isDefinition: true, scopeLine: 897, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @faulthandler_fatal_error_py, variables: !836)
!836 = !{!837, !838, !839}
!837 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !835, file: !361, line: 896, type: !19)
!838 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !835, file: !361, line: 896, type: !19)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "message", scope: !835, file: !361, line: 898, type: !66)
!840 = !DISubprogram(name: "faulthandler_stack_overflow", scope: !361, file: !361, line: 921, type: !130, isLocal: true, isDefinition: true, scopeLine: 922, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @faulthandler_stack_overflow, variables: !841)
!841 = !{!842, !843, !844, !845, !846}
!842 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !840, file: !361, line: 921, type: !19)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "depth", scope: !840, file: !361, line: 923, type: !108)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !840, file: !361, line: 923, type: !108)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sp", scope: !840, file: !361, line: 924, type: !66)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stop", scope: !840, file: !361, line: 924, type: !66)
!847 = !DISubprogram(name: "stack_overflow", scope: !361, file: !361, line: 907, type: !848, isLocal: true, isDefinition: true, scopeLine: 908, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i8*, i64*)* @stack_overflow, variables: !851)
!848 = !DISubroutineType(types: !849)
!849 = !{!18, !18, !18, !850}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!851 = !{!852, !853, !854, !855, !859}
!852 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "min_sp", arg: 1, scope: !847, file: !361, line: 907, type: !18)
!853 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "max_sp", arg: 2, scope: !847, file: !361, line: 907, type: !18)
!854 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "depth", arg: 3, scope: !847, file: !361, line: 907, type: !850)
!855 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !847, file: !361, line: 910, type: !856)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 32768, align: 8, elements: !857)
!857 = !{!858}
!858 = !DISubrange(count: 4096)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sp", scope: !847, file: !361, line: 911, type: !18)
!860 = !DISubprogram(name: "faulthandler_traverse", scope: !361, file: !361, line: 944, type: !275, isLocal: true, isDefinition: true, scopeLine: 945, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)* @faulthandler_traverse, variables: !861)
!861 = !{!862, !863, !864, !865, !866, !870, !878}
!862 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "module", arg: 1, scope: !860, file: !361, line: 944, type: !19)
!863 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !860, file: !361, line: 944, type: !277)
!864 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !860, file: !361, line: 944, type: !18)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signum", scope: !860, file: !361, line: 947, type: !355)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !867, file: !361, line: 951, type: !58)
!867 = distinct !DILexicalBlock(scope: !868, file: !361, line: 951, column: 27)
!868 = distinct !DILexicalBlock(scope: !869, file: !361, line: 951, column: 14)
!869 = distinct !DILexicalBlock(scope: !860, file: !361, line: 951, column: 8)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !871, file: !361, line: 956, type: !58)
!871 = distinct !DILexicalBlock(scope: !872, file: !361, line: 956, column: 49)
!872 = distinct !DILexicalBlock(scope: !873, file: !361, line: 956, column: 22)
!873 = distinct !DILexicalBlock(scope: !874, file: !361, line: 956, column: 16)
!874 = distinct !DILexicalBlock(scope: !875, file: !361, line: 955, column: 9)
!875 = distinct !DILexicalBlock(scope: !876, file: !361, line: 955, column: 9)
!876 = distinct !DILexicalBlock(scope: !877, file: !361, line: 954, column: 37)
!877 = distinct !DILexicalBlock(scope: !860, file: !361, line: 954, column: 9)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !879, file: !361, line: 959, type: !58)
!879 = distinct !DILexicalBlock(scope: !880, file: !361, line: 959, column: 32)
!880 = distinct !DILexicalBlock(scope: !881, file: !361, line: 959, column: 14)
!881 = distinct !DILexicalBlock(scope: !860, file: !361, line: 959, column: 8)
!882 = !DISubprogram(name: "faulthandler_env_options", scope: !361, file: !361, line: 1054, type: !366, isLocal: true, isDefinition: true, scopeLine: 1055, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @faulthandler_env_options, variables: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !892, !894, !896}
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xoptions", scope: !882, file: !361, line: 1056, type: !19)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !882, file: !361, line: 1056, type: !19)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "module", scope: !882, file: !361, line: 1056, type: !19)
