; ModuleID = 'programs_new/Python-new/fcntlmodule.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !343, globals: !501)
!1 = !DIFile(filename: "fcntlmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !8, line: 109, baseType: !9)
!8 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !8, line: 105, size: 128, align: 64, elements: !10)
!10 = !{!11, !18}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !9, file: !8, line: 107, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !13, line: 177, baseType: !14)
!13 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !15, line: 102, baseType: !16)
!15 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !17, line: 181, baseType: !5)
!17 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !9, file: !8, line: 108, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !8, line: 334, size: 3200, align: 64, elements: !21)
!21 = !{!22, !28, !32, !33, !34, !39, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !291, !309, !310, !311, !313, !315, !316, !318, !323, !328, !333, !334, !335, !336, !337, !338, !339, !340, !342}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !20, file: !8, line: 335, baseType: !23, size: 192, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !8, line: 114, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 111, size: 192, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !24, file: !8, line: 112, baseType: !7, size: 128, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !24, file: !8, line: 113, baseType: !12, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !20, file: !8, line: 336, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !20, file: !8, line: 337, baseType: !12, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !20, file: !8, line: 337, baseType: !12, size: 64, align: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !20, file: !8, line: 341, baseType: !35, size: 64, align: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !8, line: 308, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !6}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !20, file: !8, line: 342, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !8, line: 314, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !6, !45, !44}
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !15, line: 48, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 246, size: 1728, align: 64, elements: !49)
!48 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!49 = !{!50, !51, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !71, !72, !73, !74, !76, !78, !80, !84, !87, !89, !90, !91, !92, !93, !97, !98}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !48, line: 247, baseType: !44, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !47, file: !48, line: 252, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !47, file: !48, line: 253, baseType: !52, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !47, file: !48, line: 254, baseType: !52, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !47, file: !48, line: 255, baseType: !52, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !47, file: !48, line: 256, baseType: !52, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !47, file: !48, line: 257, baseType: !52, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !47, file: !48, line: 258, baseType: !52, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !47, file: !48, line: 259, baseType: !52, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !47, file: !48, line: 261, baseType: !52, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !47, file: !48, line: 262, baseType: !52, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !47, file: !48, line: 263, baseType: !52, size: 64, align: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !47, file: !48, line: 265, baseType: !64, size: 64, align: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !48, line: 161, size: 192, align: 64, elements: !66)
!66 = !{!67, !68, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !65, file: !48, line: 162, baseType: !64, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !65, file: !48, line: 163, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !65, file: !48, line: 167, baseType: !44, size: 32, align: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !47, file: !48, line: 267, baseType: !69, size: 64, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !47, file: !48, line: 269, baseType: !44, size: 32, align: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !47, file: !48, line: 273, baseType: !44, size: 32, align: 32, offset: 928)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !47, file: !48, line: 275, baseType: !75, size: 64, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !17, line: 140, baseType: !5)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !47, file: !48, line: 279, baseType: !77, size: 16, align: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !47, file: !48, line: 280, baseType: !79, size: 8, align: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !47, file: !48, line: 281, baseType: !81, size: 8, align: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !47, file: !48, line: 285, baseType: !85, size: 64, align: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !48, line: 155, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !47, file: !48, line: 294, baseType: !88, size: 64, align: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !17, line: 141, baseType: !5)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !47, file: !48, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !47, file: !48, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !47, file: !48, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !47, file: !48, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !47, file: !48, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !47, file: !48, line: 309, baseType: !44, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !47, file: !48, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !20, file: !8, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !8, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!6, !6, !52}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !20, file: !8, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !8, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!44, !6, !52, !6}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !20, file: !8, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !20, file: !8, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !8, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!6, !6}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !20, file: !8, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !8, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !8, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !8, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!6, !6, !6}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !8, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !8, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !8, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !8, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !8, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !8, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!6, !6, !6, !6}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !8, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !8, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !8, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !8, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !8, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !8, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!44, !6}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !8, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !8, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !8, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !8, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !8, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !8, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !8, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !8, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !8, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !8, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !8, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !8, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !8, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !8, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !8, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !8, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !8, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !8, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !8, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !8, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !8, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !8, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !8, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !8, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !20, file: !8, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !8, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !8, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !8, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!12, !6}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !8, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !8, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !8, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!6, !6, !12}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !8, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !8, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !8, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !8, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!44, !6, !12, !6}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !8, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !8, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !8, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!44, !6, !6}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !8, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !8, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !20, file: !8, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !8, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !8, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !8, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !8, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !8, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!44, !6, !6, !6}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !20, file: !8, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !8, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !6}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !13, line: 186, baseType: !12)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !20, file: !8, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !20, file: !8, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !20, file: !8, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !8, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !20, file: !8, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !8, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !20, file: !8, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !8, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !8, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !8, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!44, !6, !235, !44}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !8, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !8, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !8, line: 179, baseType: !4, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !8, line: 180, baseType: !6, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !8, line: 181, baseType: !12, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !8, line: 182, baseType: !12, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !8, line: 184, baseType: !44, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !8, line: 185, baseType: !44, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !8, line: 186, baseType: !52, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !8, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !8, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !8, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !8, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !8, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !8, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !6, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !20, file: !8, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !20, file: !8, line: 368, baseType: !29, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !20, file: !8, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !8, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!44, !6, !263, !4}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !8, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!44, !6, !4}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !20, file: !8, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !20, file: !8, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !8, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!6, !6, !6, !44}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !20, file: !8, line: 382, baseType: !12, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !20, file: !8, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !8, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !20, file: !8, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !8, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !20, file: !8, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !29, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !44, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !29, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !20, file: !8, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !8, line: 390, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !20, file: !8, line: 391, baseType: !292, size: 64, align: 64, offset: 1984)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !294, line: 11, size: 320, align: 64, elements: !295)
!294 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!295 = !{!296, !297, !302, !307, !308}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !293, file: !294, line: 12, baseType: !52, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !293, file: !294, line: 13, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !294, line: 8, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!6, !6, !4}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !293, file: !294, line: 14, baseType: !303, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !294, line: 9, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!44, !6, !6, !4}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !293, file: !294, line: 15, baseType: !52, size: 64, align: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !293, file: !294, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !20, file: !8, line: 392, baseType: !19, size: 64, align: 64, offset: 2048)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !20, file: !8, line: 393, baseType: !6, size: 64, align: 64, offset: 2112)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !20, file: !8, line: 394, baseType: !312, size: 64, align: 64, offset: 2176)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !8, line: 325, baseType: !134)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !20, file: !8, line: 395, baseType: !314, size: 64, align: 64, offset: 2240)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !8, line: 326, baseType: !210)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !20, file: !8, line: 396, baseType: !12, size: 64, align: 64, offset: 2304)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !20, file: !8, line: 397, baseType: !317, size: 64, align: 64, offset: 2368)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !8, line: 327, baseType: !210)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !20, file: !8, line: 398, baseType: !319, size: 64, align: 64, offset: 2432)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !8, line: 329, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!6, !19, !12}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !20, file: !8, line: 399, baseType: !324, size: 64, align: 64, offset: 2496)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !8, line: 328, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!6, !19, !6, !6}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !20, file: !8, line: 400, baseType: !329, size: 64, align: 64, offset: 2560)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !8, line: 307, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !4}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !20, file: !8, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !20, file: !8, line: 402, baseType: !6, size: 64, align: 64, offset: 2688)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !20, file: !8, line: 403, baseType: !6, size: 64, align: 64, offset: 2752)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !20, file: !8, line: 404, baseType: !6, size: 64, align: 64, offset: 2816)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !20, file: !8, line: 405, baseType: !6, size: 64, align: 64, offset: 2880)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !20, file: !8, line: 406, baseType: !6, size: 64, align: 64, offset: 2944)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !20, file: !8, line: 407, baseType: !35, size: 64, align: 64, offset: 3008)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !20, file: !8, line: 410, baseType: !341, size: 32, align: 32, offset: 3072)
!341 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !20, file: !8, line: 412, baseType: !35, size: 64, align: 64, offset: 3136)
!343 = !{!344, !350, !428, !436, !465, !474, !498}
!344 = !DISubprogram(name: "PyInit_fcntl", scope: !345, file: !345, line: 617, type: !346, isLocal: false, isDefinition: true, scopeLine: 618, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_fcntl, variables: !348)
!345 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/fcntlmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!346 = !DISubroutineType(types: !347)
!347 = !{!6}
!348 = !{!349}
!349 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !344, file: !345, line: 619, type: !6)
!350 = !DISubprogram(name: "fcntl_fcntl", scope: !345, file: !345, line: 33, type: !126, isLocal: true, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @fcntl_fcntl, variables: !351)
!351 = !{!352, !353, !354, !355, !356, !357, !358, !359, !360, !364, !426}
!352 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !350, file: !345, line: 33, type: !6)
!353 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !350, file: !345, line: 33, type: !6)
!354 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !350, file: !345, line: 35, type: !44)
!355 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !350, file: !345, line: 36, type: !44)
!356 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg", scope: !350, file: !345, line: 37, type: !5)
!357 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !350, file: !345, line: 38, type: !44)
!358 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !350, file: !345, line: 39, type: !52)
!359 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !350, file: !345, line: 40, type: !12)
!360 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !350, file: !345, line: 41, type: !361)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8192, align: 8, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 1024)
!364 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !365, file: !345, line: 51, type: !368)
!365 = distinct !DILexicalBlock(scope: !366, file: !345, line: 51, column: 9)
!366 = distinct !DILexicalBlock(scope: !367, file: !345, line: 44, column: 68)
!367 = distinct !DILexicalBlock(scope: !350, file: !345, line: 43, column: 9)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !370, line: 139, baseType: !371)
!370 = !DIFile(filename: "./Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !370, line: 69, size: 1536, align: 64, elements: !372)
!372 = !{!373, !375, !376, !396, !399, !400, !401, !402, !403, !404, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !371, file: !370, line: 72, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !371, file: !370, line: 73, baseType: !374, size: 64, align: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !371, file: !370, line: 74, baseType: !377, size: 64, align: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !370, line: 44, baseType: !379)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !370, line: 19, size: 832, align: 64, elements: !380)
!380 = !{!381, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !379, file: !370, line: 21, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !379, file: !370, line: 22, baseType: !374, size: 64, align: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !379, file: !370, line: 24, baseType: !6, size: 64, align: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !379, file: !370, line: 25, baseType: !6, size: 64, align: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !379, file: !370, line: 26, baseType: !6, size: 64, align: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !379, file: !370, line: 27, baseType: !6, size: 64, align: 64, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !379, file: !370, line: 28, baseType: !6, size: 64, align: 64, offset: 384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !379, file: !370, line: 30, baseType: !6, size: 64, align: 64, offset: 448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !379, file: !370, line: 31, baseType: !6, size: 64, align: 64, offset: 512)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !379, file: !370, line: 32, baseType: !6, size: 64, align: 64, offset: 576)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !379, file: !370, line: 33, baseType: !44, size: 32, align: 32, offset: 640)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !379, file: !370, line: 34, baseType: !44, size: 32, align: 32, offset: 672)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !379, file: !370, line: 37, baseType: !44, size: 32, align: 32, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !379, file: !370, line: 43, baseType: !6, size: 64, align: 64, offset: 768)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !371, file: !370, line: 76, baseType: !397, size: 64, align: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !370, line: 50, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !371, file: !370, line: 77, baseType: !44, size: 32, align: 32, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !371, file: !370, line: 78, baseType: !31, size: 8, align: 8, offset: 288)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !371, file: !370, line: 80, baseType: !31, size: 8, align: 8, offset: 296)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !371, file: !370, line: 85, baseType: !44, size: 32, align: 32, offset: 320)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !371, file: !370, line: 86, baseType: !44, size: 32, align: 32, offset: 352)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !371, file: !370, line: 88, baseType: !405, size: 64, align: 64, offset: 384)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !370, line: 54, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!44, !6, !397, !44, !6}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !371, file: !370, line: 89, baseType: !405, size: 64, align: 64, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !371, file: !370, line: 90, baseType: !6, size: 64, align: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !371, file: !370, line: 91, baseType: !6, size: 64, align: 64, offset: 576)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !371, file: !370, line: 93, baseType: !6, size: 64, align: 64, offset: 640)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !371, file: !370, line: 94, baseType: !6, size: 64, align: 64, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !371, file: !370, line: 95, baseType: !6, size: 64, align: 64, offset: 768)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !371, file: !370, line: 97, baseType: !6, size: 64, align: 64, offset: 832)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !371, file: !370, line: 98, baseType: !6, size: 64, align: 64, offset: 896)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !371, file: !370, line: 99, baseType: !6, size: 64, align: 64, offset: 960)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !371, file: !370, line: 101, baseType: !6, size: 64, align: 64, offset: 1024)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !371, file: !370, line: 103, baseType: !44, size: 32, align: 32, offset: 1088)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !371, file: !370, line: 105, baseType: !6, size: 64, align: 64, offset: 1152)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !371, file: !370, line: 106, baseType: !5, size: 64, align: 64, offset: 1216)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !371, file: !370, line: 108, baseType: !44, size: 32, align: 32, offset: 1280)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !371, file: !370, line: 109, baseType: !6, size: 64, align: 64, offset: 1344)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !371, file: !370, line: 134, baseType: !330, size: 64, align: 64, offset: 1408)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !371, file: !370, line: 135, baseType: !4, size: 64, align: 64, offset: 1472)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !427, file: !345, line: 69, type: !368)
!427 = distinct !DILexicalBlock(scope: !350, file: !345, line: 69, column: 5)
!428 = !DISubprogram(name: "conv_descriptor", scope: !345, file: !345, line: 19, type: !429, isLocal: true, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i32*)* @conv_descriptor, variables: !432)
!429 = !DISubroutineType(types: !430)
!430 = !{!44, !6, !431}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!432 = !{!433, !434, !435}
!433 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "object", arg: 1, scope: !428, file: !345, line: 19, type: !6)
!434 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "target", arg: 2, scope: !428, file: !345, line: 19, type: !431)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !428, file: !345, line: 21, type: !44)
!436 = !DISubprogram(name: "fcntl_ioctl", scope: !345, file: !345, line: 97, type: !126, isLocal: true, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @fcntl_ioctl, variables: !437)
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !452, !455, !459, !463}
!438 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !436, file: !345, line: 97, type: !6)
!439 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !436, file: !345, line: 97, type: !6)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !436, file: !345, line: 100, type: !44)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !436, file: !345, line: 114, type: !341)
!442 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg", scope: !436, file: !345, line: 115, type: !44)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !436, file: !345, line: 116, type: !44)
!444 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pstr", scope: !436, file: !345, line: 117, type: !236)
!445 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !436, file: !345, line: 118, type: !52)
!446 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !436, file: !345, line: 119, type: !12)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mutate_arg", scope: !436, file: !345, line: 120, type: !44)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !436, file: !345, line: 121, type: !449)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8200, align: 8, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 1025)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg", scope: !453, file: !345, line: 126, type: !52)
!453 = distinct !DILexicalBlock(scope: !454, file: !345, line: 125, column: 47)
!454 = distinct !DILexicalBlock(scope: !436, file: !345, line: 123, column: 9)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !456, file: !345, line: 154, type: !368)
!456 = distinct !DILexicalBlock(scope: !457, file: !345, line: 154, column: 13)
!457 = distinct !DILexicalBlock(scope: !458, file: !345, line: 153, column: 25)
!458 = distinct !DILexicalBlock(scope: !453, file: !345, line: 153, column: 13)
!459 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !460, file: !345, line: 190, type: !368)
!460 = distinct !DILexicalBlock(scope: !461, file: !345, line: 190, column: 9)
!461 = distinct !DILexicalBlock(scope: !462, file: !345, line: 179, column: 63)
!462 = distinct !DILexicalBlock(scope: !436, file: !345, line: 178, column: 9)
!463 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !464, file: !345, line: 210, type: !368)
!464 = distinct !DILexicalBlock(scope: !436, file: !345, line: 210, column: 5)
!465 = !DISubprogram(name: "fcntl_flock", scope: !345, file: !345, line: 257, type: !126, isLocal: true, isDefinition: true, scopeLine: 258, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @fcntl_flock, variables: !466)
!466 = !{!467, !468, !469, !470, !471, !472}
!467 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !465, file: !345, line: 257, type: !6)
!468 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !465, file: !345, line: 257, type: !6)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !465, file: !345, line: 259, type: !44)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !465, file: !345, line: 260, type: !44)
!471 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !465, file: !345, line: 261, type: !44)
!472 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !473, file: !345, line: 268, type: !368)
!473 = distinct !DILexicalBlock(scope: !465, file: !345, line: 268, column: 5)
!474 = !DISubprogram(name: "fcntl_lockf", scope: !345, file: !345, line: 316, type: !126, isLocal: true, isDefinition: true, scopeLine: 317, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @fcntl_lockf, variables: !475)
!475 = !{!476, !477, !478, !479, !480, !481, !482, !483, !484, !496}
!476 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !474, file: !345, line: 316, type: !6)
!477 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !474, file: !345, line: 316, type: !6)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !474, file: !345, line: 318, type: !44)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !474, file: !345, line: 318, type: !44)
!480 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !474, file: !345, line: 318, type: !44)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "whence", scope: !474, file: !345, line: 318, type: !44)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lenobj", scope: !474, file: !345, line: 319, type: !6)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "startobj", scope: !474, file: !345, line: 319, type: !6)
!484 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !485, file: !345, line: 333, type: !486)
!485 = distinct !DILexicalBlock(scope: !474, file: !345, line: 332, column: 5)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "flock", file: !487, line: 35, size: 256, align: 64, elements: !488)
!487 = !DIFile(filename: "/usr/include/bits/fcntl.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!488 = !{!489, !491, !492, !493, !494}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "l_type", scope: !486, file: !487, line: 37, baseType: !490, size: 16, align: 16)
!490 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "l_whence", scope: !486, file: !487, line: 38, baseType: !490, size: 16, align: 16, offset: 16)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "l_start", scope: !486, file: !487, line: 43, baseType: !88, size: 64, align: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "l_len", scope: !486, file: !487, line: 44, baseType: !88, size: 64, align: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "l_pid", scope: !486, file: !487, line: 46, baseType: !495, size: 32, align: 32, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !17, line: 142, baseType: !44)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !497, file: !345, line: 369, type: !368)
!497 = distinct !DILexicalBlock(scope: !485, file: !345, line: 369, column: 9)
!498 = !DISubprogram(name: "all_ins", scope: !345, file: !345, line: 427, type: !144, isLocal: true, isDefinition: true, scopeLine: 428, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @all_ins, variables: !499)
!499 = !{!500}
!500 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m", arg: 1, scope: !498, file: !345, line: 427, type: !6)
!501 = !{!502, !525, !529, !533, !537, !541, !545}
!502 = !DIGlobalVariable(name: "fcntlmodule", scope: !0, file: !345, line: 604, type: !503, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @fcntlmodule)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !504, line: 47, size: 832, align: 64, elements: !505)
!504 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!505 = !{!506, !515, !516, !517, !518, !521, !522, !523, !524}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !503, file: !504, line: 48, baseType: !507, size: 320, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !504, line: 38, baseType: !508)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef_Base", file: !504, line: 33, size: 320, align: 64, elements: !509)
!509 = !{!510, !511, !513, !514}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !508, file: !504, line: 34, baseType: !7, size: 128, align: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "m_init", scope: !508, file: !504, line: 35, baseType: !512, size: 64, align: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "m_index", scope: !508, file: !504, line: 36, baseType: !12, size: 64, align: 64, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "m_copy", scope: !508, file: !504, line: 37, baseType: !6, size: 64, align: 64, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "m_name", scope: !503, file: !504, line: 49, baseType: !29, size: 64, align: 64, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "m_doc", scope: !503, file: !504, line: 50, baseType: !29, size: 64, align: 64, offset: 384)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "m_size", scope: !503, file: !504, line: 51, baseType: !12, size: 64, align: 64, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "m_methods", scope: !503, file: !504, line: 52, baseType: !519, size: 64, align: 64, offset: 512)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64, align: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !281, line: 47, baseType: !280)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "m_reload", scope: !503, file: !504, line: 53, baseType: !142, size: 64, align: 64, offset: 576)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "m_traverse", scope: !503, file: !504, line: 54, baseType: !259, size: 64, align: 64, offset: 640)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "m_clear", scope: !503, file: !504, line: 55, baseType: !142, size: 64, align: 64, offset: 704)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "m_free", scope: !503, file: !504, line: 56, baseType: !329, size: 64, align: 64, offset: 768)
!525 = !DIGlobalVariable(name: "module_doc", scope: !0, file: !345, line: 417, type: !526, isLocal: true, isDefinition: true, variable: [221 x i8]* @module_doc)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 1768, align: 8, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 221)
!529 = !DIGlobalVariable(name: "fcntl_methods", scope: !0, file: !345, line: 408, type: !530, isLocal: true, isDefinition: true, variable: [5 x %struct.PyMethodDef]* @fcntl_methods)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 1280, align: 64, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 5)
!533 = !DIGlobalVariable(name: "fcntl_doc", scope: !0, file: !345, line: 79, type: !534, isLocal: true, isDefinition: true, variable: [703 x i8]* @fcntl_doc)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 5624, align: 8, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 703)
!537 = !DIGlobalVariable(name: "ioctl_doc", scope: !0, file: !345, line: 221, type: !538, isLocal: true, isDefinition: true, variable: [1452 x i8]* @ioctl_doc)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 11616, align: 8, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 1452)
!541 = !DIGlobalVariable(name: "flock_doc", scope: !0, file: !345, line: 306, type: !542, isLocal: true, isDefinition: true, variable: [189 x i8]* @flock_doc)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 1512, align: 8, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 189)
!545 = !DIGlobalVariable(name: "lockf_doc", scope: !0, file: !345, line: 381, type: !546, isLocal: true, isDefinition: true, variable: [1033 x i8]* @lockf_doc)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8264, align: 8, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 1033)
!549 = !{i32 2, !"Dwarf Version", i32 4}
!550 = !{i32 2, !"Debug Info Version", i32 3}
!551 = !{i32 1, !"PIC Level", i32 2}
!552 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!553 = !DILocation(line: 619, column: 5, scope: !344)
!554 = !DIExpression()
!555 = !DILocation(line: 619, column: 15, scope: !344)
!556 = !DILocation(line: 622, column: 9, scope: !344)
!557 = !DILocation(line: 622, column: 7, scope: !344)
!558 = !{!559, !559, i64 0}
!559 = !{!"any pointer", !560, i64 0}
!560 = !{!"omnipotent char", !561, i64 0}
!561 = !{!"Simple C/C++ TBAA"}
!562 = !DILocation(line: 623, column: 9, scope: !563)
!563 = distinct !DILexicalBlock(scope: !344, file: !345, line: 623, column: 9)
!564 = !DILocation(line: 623, column: 11, scope: !563)
!565 = !DILocation(line: 623, column: 9, scope: !344)
!566 = !DILocation(line: 624, column: 9, scope: !563)
!567 = !DILocation(line: 627, column: 17, scope: !568)
!568 = distinct !DILexicalBlock(scope: !344, file: !345, line: 627, column: 9)
!569 = !DILocation(line: 627, column: 9, scope: !568)
!570 = !DILocation(line: 627, column: 20, scope: !568)
!571 = !DILocation(line: 627, column: 9, scope: !344)
!572 = !DILocation(line: 628, column: 9, scope: !568)
!573 = !DILocation(line: 630, column: 12, scope: !344)
!574 = !DILocation(line: 630, column: 5, scope: !344)
!575 = !DILocation(line: 631, column: 1, scope: !344)
!576 = !DILocation(line: 427, column: 19, scope: !498)
!577 = !DILocation(line: 429, column: 33, scope: !578)
!578 = distinct !DILexicalBlock(scope: !498, file: !345, line: 429, column: 9)
!579 = !DILocation(line: 429, column: 9, scope: !578)
!580 = !DILocation(line: 429, column: 9, scope: !498)
!581 = !DILocation(line: 429, column: 51, scope: !582)
!582 = !DILexicalBlockFile(scope: !578, file: !345, discriminator: 1)
!583 = !DILocation(line: 430, column: 33, scope: !584)
