; ModuleID = 'programs_new/Python-new/ffi64.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ffi_cif = type { i32, i32, %struct._ffi_type**, %struct._ffi_type*, i32, i32 }
%struct._ffi_type = type { i64, i16, i16, %struct._ffi_type** }
%struct.register_args = type { [6 x i64], [8 x %union.big_int_union] }
%union.big_int_union = type { i128 }
%struct.ffi_closure = type { [24 x i8], %struct.ffi_cif*, void (%struct.ffi_cif*, i8*, i8**, i8*)*, i8* }

; Function Attrs: uwtable
define i32 @ffi_prep_cif_machdep(%struct.ffi_cif* %cif) #0 {
entry:
  %cif.addr = alloca %struct.ffi_cif*, align 8
  %gprcount = alloca i32, align 4
  %ssecount = alloca i32, align 4
  %i = alloca i32, align 4
  %avn = alloca i32, align 4
  %n = alloca i32, align 4
  %ngpr = alloca i32, align 4
  %nsse = alloca i32, align 4
  %flags = alloca i32, align 4
  %classes = alloca [4 x i32], align 16
  %bytes = alloca i64, align 8
  %sse0 = alloca i8, align 1
  %sse1 = alloca i8, align 1
  %align = alloca i64, align 8
  store %struct.ffi_cif* %cif, %struct.ffi_cif** %cif.addr, align 8, !tbaa !285
  call void @llvm.dbg.declare(metadata %struct.ffi_cif** %cif.addr, metadata !107, metadata !289), !dbg !290
  %0 = bitcast i32* %gprcount to i8*, !dbg !291
  call void @llvm.lifetime.start(i64 4, i8* %0) #2, !dbg !291
  call void @llvm.dbg.declare(metadata i32* %gprcount, metadata !108, metadata !289), !dbg !292

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !31, subprograms: !79)
!1 = !DIFile(filename: "ffi64.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !9, !17}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 204, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "build/temp.linux-x86_64-3.4/libffi/include/ffi.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "FFI_OK", value: 0)
!7 = !DIEnumerator(name: "FFI_BAD_TYPEDEF", value: 1)
!8 = !DIEnumerator(name: "FFI_BAD_ABI", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ffi_abi", file: !10, line: 75, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "build/temp.linux-x86_64-3.4/libffi/include/ffitarget.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!11 = !{!12, !13, !14, !15, !16}
!12 = !DIEnumerator(name: "FFI_FIRST_ABI", value: 0)
!13 = !DIEnumerator(name: "FFI_SYSV", value: 1)
!14 = !DIEnumerator(name: "FFI_UNIX64", value: 2)
!15 = !DIEnumerator(name: "FFI_LAST_ABI", value: 3)
!16 = !DIEnumerator(name: "FFI_DEFAULT_ABI", value: 2)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "x86_64_reg_class", file: !18, line: 80, size: 32, align: 32, elements: !19)
!18 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_ctypes/libffi/src/x86/ffi64.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!20 = !DIEnumerator(name: "X86_64_NO_CLASS", value: 0)
!21 = !DIEnumerator(name: "X86_64_INTEGER_CLASS", value: 1)
!22 = !DIEnumerator(name: "X86_64_INTEGERSI_CLASS", value: 2)
!23 = !DIEnumerator(name: "X86_64_SSE_CLASS", value: 3)
!24 = !DIEnumerator(name: "X86_64_SSESF_CLASS", value: 4)
!25 = !DIEnumerator(name: "X86_64_SSEDF_CLASS", value: 5)
!26 = !DIEnumerator(name: "X86_64_SSEUP_CLASS", value: 6)
!27 = !DIEnumerator(name: "X86_64_X87_CLASS", value: 7)
!28 = !DIEnumerator(name: "X86_64_X87UP_CLASS", value: 8)
!29 = !DIEnumerator(name: "X86_64_COMPLEX_X87_CLASS", value: 9)
!30 = !DIEnumerator(name: "X86_64_MEMORY_CLASS", value: 10)
!31 = !{!32, !35, !36, !34, !58, !60, !62, !65, !66, !69, !72, !73, !74, !77}
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !33, line: 62, baseType: !34)
!33 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!34 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "register_args", file: !18, line: 59, size: 1408, align: 128, elements: !38)
!38 = !{!39, !45}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "gpr", scope: !37, file: !18, line: 62, baseType: !40, size: 384, align: 64)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 384, align: 64, elements: !43)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !42, line: 112, baseType: !34)
!42 = !DIFile(filename: "build/temp.linux-x86_64-3.4/libffi/include/ffi_common.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!43 = !{!44}
!44 = !DISubrange(count: 6)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !37, file: !18, line: 63, baseType: !46, size: 1024, align: 128, offset: 384)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 1024, align: 128, elements: !56)
!47 = !DICompositeType(tag: DW_TAG_union_type, name: "big_int_union", file: !18, line: 52, size: 128, align: 128, elements: !48)
!48 = !{!49, !52, !53}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "i32", scope: !47, file: !18, line: 54, baseType: !50, size: 32, align: 32)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !42, line: 110, baseType: !51)
!51 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !47, file: !18, line: 55, baseType: !41, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "i128", scope: !47, file: !18, line: 56, baseType: !54, size: 128, align: 128)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int128_t", file: !1, line: 426, baseType: !55)
!55 = !DIBasicType(name: "__int128", size: 128, align: 128, encoding: DW_ATE_signed)
!56 = !{!57}
!57 = !DISubrange(count: 8)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "SINT64", file: !42, line: 113, baseType: !61)
!61 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "SINT8", file: !42, line: 107, baseType: !64)
!64 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "SINT16", file: !42, line: 109, baseType: !68)
!68 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "SINT32", file: !42, line: 111, baseType: !71)
!71 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !76)
!76 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!79 = !{!80, !135, !170, !196, !235, !250, !275}
!80 = !DISubprogram(name: "ffi_prep_cif_machdep", scope: !18, file: !18, line: 351, type: !81, isLocal: false, isDefinition: true, scopeLine: 352, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ffi_cif*)* @ffi_prep_cif_machdep, variables: !106)
!81 = !DISubroutineType(types: !82)
!82 = !{!83, !84}
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ffi_status", file: !4, line: 208, baseType: !3)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "ffi_cif", file: !4, line: 222, baseType: !86)
!86 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 212, size: 256, align: 64, elements: !87)
!87 = !{!88, !90, !91, !103, !104, !105}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "abi", scope: !86, file: !4, line: 213, baseType: !89, size: 32, align: 32)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "ffi_abi", file: !10, line: 108, baseType: !9)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !86, file: !4, line: 214, baseType: !51, size: 32, align: 32, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !86, file: !4, line: 215, baseType: !92, size: 64, align: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ffi_type", file: !4, line: 118, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ffi_type", file: !4, line: 112, size: 192, align: 64, elements: !96)
!96 = !{!97, !98, !99, !100}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !95, file: !4, line: 114, baseType: !32, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !95, file: !4, line: 115, baseType: !76, size: 16, align: 16, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !95, file: !4, line: 116, baseType: !76, size: 16, align: 16, offset: 80)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !95, file: !4, line: 117, baseType: !101, size: 64, align: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "rtype", scope: !86, file: !4, line: 216, baseType: !93, size: 64, align: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !86, file: !4, line: 217, baseType: !51, size: 32, align: 32, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !86, file: !4, line: 218, baseType: !51, size: 32, align: 32, offset: 224)
!106 = !{!107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !120, !121, !128, !129}
!107 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cif", arg: 1, scope: !80, file: !18, line: 351, type: !84)
!108 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gprcount", scope: !80, file: !18, line: 353, type: !71)
!109 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ssecount", scope: !80, file: !18, line: 353, type: !71)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !80, file: !18, line: 353, type: !71)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "avn", scope: !80, file: !18, line: 353, type: !71)
!112 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !80, file: !18, line: 353, type: !71)
!113 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ngpr", scope: !80, file: !18, line: 353, type: !71)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nsse", scope: !80, file: !18, line: 353, type: !71)
!115 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !80, file: !18, line: 353, type: !71)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "classes", scope: !80, file: !18, line: 354, type: !117)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 128, align: 32, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 4)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !80, file: !18, line: 355, type: !32)
!121 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sse0", scope: !122, file: !18, line: 374, type: !127)
!122 = distinct !DILexicalBlock(scope: !123, file: !18, line: 372, column: 2)
!123 = distinct !DILexicalBlock(scope: !124, file: !18, line: 371, column: 16)
!124 = distinct !DILexicalBlock(scope: !125, file: !18, line: 363, column: 11)
!125 = distinct !DILexicalBlock(scope: !126, file: !18, line: 361, column: 5)
!126 = distinct !DILexicalBlock(scope: !80, file: !18, line: 360, column: 7)
!127 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sse1", scope: !122, file: !18, line: 375, type: !127)
!129 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "align", scope: !130, file: !18, line: 396, type: !61)
!130 = distinct !DILexicalBlock(scope: !131, file: !18, line: 395, column: 2)
!131 = distinct !DILexicalBlock(scope: !132, file: !18, line: 392, column: 11)
!132 = distinct !DILexicalBlock(scope: !133, file: !18, line: 391, column: 5)
!133 = distinct !DILexicalBlock(scope: !134, file: !18, line: 390, column: 3)
!134 = distinct !DILexicalBlock(scope: !80, file: !18, line: 390, column: 3)
!135 = !DISubprogram(name: "ffi_call", scope: !18, file: !18, line: 419, type: !136, isLocal: false, isDefinition: true, scopeLine: 420, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.ffi_cif*, void ()*, i8*, i8**)* @ffi_call, variables: !142)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !84, !138, !35, !141}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{null}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!142 = !{!143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !163, !164, !167, !169}
!143 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cif", arg: 1, scope: !135, file: !18, line: 419, type: !84)
!144 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fn", arg: 2, scope: !135, file: !18, line: 419, type: !138)
!145 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rvalue", arg: 3, scope: !135, file: !18, line: 419, type: !35)
!146 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "avalue", arg: 4, scope: !135, file: !18, line: 419, type: !141)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "classes", scope: !135, file: !18, line: 421, type: !117)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stack", scope: !135, file: !18, line: 422, type: !58)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "argp", scope: !135, file: !18, line: 422, type: !58)
!150 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg_types", scope: !135, file: !18, line: 423, type: !92)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gprcount", scope: !135, file: !18, line: 424, type: !71)
!152 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ssecount", scope: !135, file: !18, line: 424, type: !71)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ngpr", scope: !135, file: !18, line: 424, type: !71)
!154 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nsse", scope: !135, file: !18, line: 424, type: !71)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !135, file: !18, line: 424, type: !71)
!156 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "avn", scope: !135, file: !18, line: 424, type: !71)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret_in_memory", scope: !135, file: !18, line: 425, type: !127)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reg_args", scope: !135, file: !18, line: 426, type: !36)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !160, file: !18, line: 456, type: !32)
!160 = distinct !DILexicalBlock(scope: !161, file: !18, line: 455, column: 5)
!161 = distinct !DILexicalBlock(scope: !162, file: !18, line: 454, column: 3)
!162 = distinct !DILexicalBlock(scope: !135, file: !18, line: 454, column: 3)
!163 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !160, file: !18, line: 457, type: !71)
!164 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "align", scope: !165, file: !18, line: 464, type: !61)
!165 = distinct !DILexicalBlock(scope: !166, file: !18, line: 463, column: 2)
!166 = distinct !DILexicalBlock(scope: !160, file: !18, line: 460, column: 11)
!167 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !168, file: !18, line: 478, type: !58)
!168 = distinct !DILexicalBlock(scope: !166, file: !18, line: 476, column: 2)
!169 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !168, file: !18, line: 479, type: !71)
!170 = !DISubprogram(name: "ffi_prep_closure_loc", scope: !18, file: !18, line: 530, type: !171, isLocal: false, isDefinition: true, scopeLine: 535, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ffi_closure*, %struct.ffi_cif*, void (%struct.ffi_cif*, i8*, i8**, i8*)*, i8*, i8*)* @ffi_prep_closure_loc, variables: !187)
!171 = !DISubroutineType(types: !172)
!172 = !{!83, !173, !84, !183, !35, !35}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "ffi_closure", file: !4, line: 310, baseType: !175)
!175 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 299, size: 384, align: 64, elements: !176)
!176 = !{!177, !181, !182, !186}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tramp", scope: !175, file: !4, line: 304, baseType: !178, size: 192, align: 8)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 192, align: 8, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 24)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "cif", scope: !175, file: !4, line: 306, baseType: !84, size: 64, align: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !175, file: !4, line: 307, baseType: !183, size: 64, align: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{null, !84, !35, !141, !35}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !175, file: !4, line: 308, baseType: !35, size: 64, align: 64, offset: 320)
!187 = !{!188, !189, !190, !191, !192, !193, !194}
!188 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 1, scope: !170, file: !18, line: 530, type: !173)
!189 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cif", arg: 2, scope: !170, file: !18, line: 531, type: !84)
!190 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fun", arg: 3, scope: !170, file: !18, line: 532, type: !183)
!191 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "user_data", arg: 4, scope: !170, file: !18, line: 533, type: !35)
!192 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "codeloc", arg: 5, scope: !170, file: !18, line: 534, type: !35)
!193 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tramp", scope: !170, file: !18, line: 536, type: !74)
!194 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "abi", scope: !195, file: !18, line: 540, type: !71)
!195 = distinct !DILexicalBlock(scope: !170, file: !18, line: 539, column: 3)
!196 = !DISubprogram(name: "ffi_closure_unix64_inner", scope: !18, file: !18, line: 568, type: !197, isLocal: false, isDefinition: true, scopeLine: 570, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.ffi_closure*, i8*, %struct.register_args*, i8*)* @ffi_closure_unix64_inner, variables: !199)
!197 = !DISubroutineType(types: !198)
!198 = !{!71, !173, !35, !36, !58}
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !217, !218, !222, !223, !227, !228, !231, !234}
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 1, scope: !196, file: !18, line: 568, type: !173)
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "rvalue", arg: 2, scope: !196, file: !18, line: 568, type: !35)
!202 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "reg_args", arg: 3, scope: !196, file: !18, line: 569, type: !36)
!203 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "argp", arg: 4, scope: !196, file: !18, line: 569, type: !58)
!204 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cif", scope: !196, file: !18, line: 571, type: !84)
!205 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "avalue", scope: !196, file: !18, line: 572, type: !141)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg_types", scope: !196, file: !18, line: 573, type: !92)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !196, file: !18, line: 574, type: !61)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "avn", scope: !196, file: !18, line: 574, type: !61)
!209 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "gprcount", scope: !196, file: !18, line: 575, type: !71)
!210 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ssecount", scope: !196, file: !18, line: 575, type: !71)
!211 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ngpr", scope: !196, file: !18, line: 575, type: !71)
!212 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nsse", scope: !196, file: !18, line: 575, type: !71)
!213 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !196, file: !18, line: 576, type: !71)
!214 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "classes", scope: !215, file: !18, line: 585, type: !117)
!215 = distinct !DILexicalBlock(scope: !216, file: !18, line: 584, column: 5)
!216 = distinct !DILexicalBlock(scope: !196, file: !18, line: 583, column: 7)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !215, file: !18, line: 586, type: !71)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sse0", scope: !219, file: !18, line: 598, type: !127)
!219 = distinct !DILexicalBlock(scope: !220, file: !18, line: 596, column: 2)
!220 = distinct !DILexicalBlock(scope: !221, file: !18, line: 595, column: 16)
!221 = distinct !DILexicalBlock(scope: !215, file: !18, line: 587, column: 11)
