; ModuleID = 'irs-onlybc/fileutils.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!271 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!272 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!273 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!274 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!275 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!276 = !DIEnumerator(name: "THOUSEP", value: 65537)
!277 = !DIEnumerator(name: "__GROUPING", value: 65538)
!278 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!279 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!280 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!281 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!282 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!283 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!284 = !DIEnumerator(name: "__YESSTR", value: 327682)
!285 = !DIEnumerator(name: "__NOSTR", value: 327683)
!286 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!287 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!288 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!289 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!290 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!291 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!292 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!293 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!294 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!295 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!296 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!297 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!298 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!299 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!300 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!301 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!302 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!303 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!304 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!305 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!306 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!307 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!308 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!309 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!310 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!311 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!312 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!313 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!314 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!315 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!316 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!317 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!318 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!319 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!320 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!321 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!322 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!323 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!324 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!325 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!326 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!327 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!328 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!329 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!330 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!331 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!332 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!333 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!334 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!335 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!336 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!337 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!338 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!339 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!340 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!341 = !{!342, !427, !432, !681, !683, !389, !685, !381, !693, !695, !366, !684, !368}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !344, line: 109, baseType: !345)
!344 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !344, line: 105, size: 128, align: 64, elements: !346)
!346 = !{!347, !355}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !345, file: !344, line: 107, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !349, line: 177, baseType: !350)
!349 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !351, line: 102, baseType: !352)
!351 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !353, line: 181, baseType: !354)
!353 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!354 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !345, file: !344, line: 108, baseType: !356, size: 64, align: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !344, line: 334, size: 3200, align: 64, elements: !358)
!358 = !{!359, !365, !369, !370, !371, !376, !440, !445, !450, !451, !456, !508, !539, !551, !557, !558, !559, !561, !563, !594, !595, !596, !605, !606, !611, !612, !614, !616, !626, !629, !647, !648, !649, !651, !653, !654, !656, !661, !666, !671, !672, !673, !674, !675, !676, !677, !678, !680}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !357, file: !344, line: 335, baseType: !360, size: 192, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !344, line: 114, baseType: !361)
!361 = !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 111, size: 192, align: 64, elements: !362)
!362 = !{!363, !364}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !361, file: !344, line: 112, baseType: !343, size: 128, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !361, file: !344, line: 113, baseType: !348, size: 64, align: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !357, file: !344, line: 336, baseType: !366, size: 64, align: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!368 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !357, file: !344, line: 337, baseType: !348, size: 64, align: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !357, file: !344, line: 337, baseType: !348, size: 64, align: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !357, file: !344, line: 341, baseType: !372, size: 64, align: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !344, line: 308, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !342}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !357, file: !344, line: 342, baseType: !377, size: 64, align: 64, offset: 448)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !344, line: 314, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!381, !342, !382, !381}
!381 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !351, line: 48, baseType: !384)
!384 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !385, line: 246, size: 1728, align: 64, elements: !386)
!385 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!386 = !{!387, !388, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !408, !409, !410, !411, !413, !415, !417, !421, !424, !426, !428, !429, !430, !431, !435, !436}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !384, file: !385, line: 247, baseType: !381, size: 32, align: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !384, file: !385, line: 252, baseType: !389, size: 64, align: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !384, file: !385, line: 253, baseType: !389, size: 64, align: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !384, file: !385, line: 254, baseType: !389, size: 64, align: 64, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !384, file: !385, line: 255, baseType: !389, size: 64, align: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !384, file: !385, line: 256, baseType: !389, size: 64, align: 64, offset: 320)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !384, file: !385, line: 257, baseType: !389, size: 64, align: 64, offset: 384)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !384, file: !385, line: 258, baseType: !389, size: 64, align: 64, offset: 448)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !384, file: !385, line: 259, baseType: !389, size: 64, align: 64, offset: 512)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !384, file: !385, line: 261, baseType: !389, size: 64, align: 64, offset: 576)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !384, file: !385, line: 262, baseType: !389, size: 64, align: 64, offset: 640)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !384, file: !385, line: 263, baseType: !389, size: 64, align: 64, offset: 704)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !384, file: !385, line: 265, baseType: !401, size: 64, align: 64, offset: 768)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !385, line: 161, size: 192, align: 64, elements: !403)
!403 = !{!404, !405, !407}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !402, file: !385, line: 162, baseType: !401, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !402, file: !385, line: 163, baseType: !406, size: 64, align: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !402, file: !385, line: 167, baseType: !381, size: 32, align: 32, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !384, file: !385, line: 267, baseType: !406, size: 64, align: 64, offset: 832)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !384, file: !385, line: 269, baseType: !381, size: 32, align: 32, offset: 896)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !384, file: !385, line: 273, baseType: !381, size: 32, align: 32, offset: 928)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !384, file: !385, line: 275, baseType: !412, size: 64, align: 64, offset: 960)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !353, line: 140, baseType: !354)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !384, file: !385, line: 279, baseType: !414, size: 16, align: 16, offset: 1024)
!414 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !384, file: !385, line: 280, baseType: !416, size: 8, align: 8, offset: 1040)
!416 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !384, file: !385, line: 281, baseType: !418, size: 8, align: 8, offset: 1048)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 8, align: 8, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 1)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !384, file: !385, line: 285, baseType: !422, size: 64, align: 64, offset: 1088)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !385, line: 155, baseType: null)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !384, file: !385, line: 294, baseType: !425, size: 64, align: 64, offset: 1152)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !353, line: 141, baseType: !354)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !384, file: !385, line: 303, baseType: !427, size: 64, align: 64, offset: 1216)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !384, file: !385, line: 304, baseType: !427, size: 64, align: 64, offset: 1280)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !384, file: !385, line: 305, baseType: !427, size: 64, align: 64, offset: 1344)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !384, file: !385, line: 306, baseType: !427, size: 64, align: 64, offset: 1408)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !384, file: !385, line: 307, baseType: !432, size: 64, align: 64, offset: 1472)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !433, line: 62, baseType: !434)
!433 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!434 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !384, file: !385, line: 309, baseType: !381, size: 32, align: 32, offset: 1536)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !384, file: !385, line: 311, baseType: !437, size: 160, align: 8, offset: 1568)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 160, align: 8, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 20)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !357, file: !344, line: 343, baseType: !441, size: 64, align: 64, offset: 512)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !344, line: 316, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!342, !342, !389}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !357, file: !344, line: 344, baseType: !446, size: 64, align: 64, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !344, line: 318, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64, align: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!381, !342, !389, !342}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !357, file: !344, line: 345, baseType: !427, size: 64, align: 64, offset: 640)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !357, file: !344, line: 346, baseType: !452, size: 64, align: 64, offset: 704)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !344, line: 320, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!342, !342}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !357, file: !344, line: 350, baseType: !457, size: 64, align: 64, offset: 768)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !344, line: 278, baseType: !459)
!459 = !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 236, size: 2176, align: 64, elements: !460)
!460 = !{!461, !466, !467, !468, !469, !470, !475, !477, !478, !479, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !459, file: !344, line: 241, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !344, line: 166, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!342, !342, !342}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !459, file: !344, line: 242, baseType: !462, size: 64, align: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !459, file: !344, line: 243, baseType: !462, size: 64, align: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !459, file: !344, line: 244, baseType: !462, size: 64, align: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !459, file: !344, line: 245, baseType: !462, size: 64, align: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !459, file: !344, line: 246, baseType: !471, size: 64, align: 64, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !344, line: 167, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!342, !342, !342, !342}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !459, file: !344, line: 247, baseType: !476, size: 64, align: 64, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !344, line: 165, baseType: !453)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !459, file: !344, line: 248, baseType: !476, size: 64, align: 64, offset: 448)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !459, file: !344, line: 249, baseType: !476, size: 64, align: 64, offset: 512)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !459, file: !344, line: 250, baseType: !480, size: 64, align: 64, offset: 576)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !344, line: 168, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!381, !342}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !459, file: !344, line: 251, baseType: !476, size: 64, align: 64, offset: 640)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !459, file: !344, line: 252, baseType: !462, size: 64, align: 64, offset: 704)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !459, file: !344, line: 253, baseType: !462, size: 64, align: 64, offset: 768)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !459, file: !344, line: 254, baseType: !462, size: 64, align: 64, offset: 832)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !459, file: !344, line: 255, baseType: !462, size: 64, align: 64, offset: 896)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !459, file: !344, line: 256, baseType: !462, size: 64, align: 64, offset: 960)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !459, file: !344, line: 257, baseType: !476, size: 64, align: 64, offset: 1024)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !459, file: !344, line: 258, baseType: !427, size: 64, align: 64, offset: 1088)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !459, file: !344, line: 259, baseType: !476, size: 64, align: 64, offset: 1152)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !459, file: !344, line: 261, baseType: !462, size: 64, align: 64, offset: 1216)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !459, file: !344, line: 262, baseType: !462, size: 64, align: 64, offset: 1280)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !459, file: !344, line: 263, baseType: !462, size: 64, align: 64, offset: 1344)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !459, file: !344, line: 264, baseType: !462, size: 64, align: 64, offset: 1408)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !459, file: !344, line: 265, baseType: !471, size: 64, align: 64, offset: 1472)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !459, file: !344, line: 266, baseType: !462, size: 64, align: 64, offset: 1536)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !459, file: !344, line: 267, baseType: !462, size: 64, align: 64, offset: 1600)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !459, file: !344, line: 268, baseType: !462, size: 64, align: 64, offset: 1664)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !459, file: !344, line: 269, baseType: !462, size: 64, align: 64, offset: 1728)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !459, file: !344, line: 270, baseType: !462, size: 64, align: 64, offset: 1792)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !459, file: !344, line: 272, baseType: !462, size: 64, align: 64, offset: 1856)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !459, file: !344, line: 273, baseType: !462, size: 64, align: 64, offset: 1920)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !459, file: !344, line: 274, baseType: !462, size: 64, align: 64, offset: 1984)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !459, file: !344, line: 275, baseType: !462, size: 64, align: 64, offset: 2048)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !459, file: !344, line: 277, baseType: !476, size: 64, align: 64, offset: 2112)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !357, file: !344, line: 351, baseType: !509, size: 64, align: 64, offset: 832)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64, align: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !344, line: 292, baseType: !511)
!511 = !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 280, size: 640, align: 64, elements: !512)
!512 = !{!513, !518, !519, !524, !525, !526, !531, !532, !537, !538}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !511, file: !344, line: 281, baseType: !514, size: 64, align: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !344, line: 169, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64, align: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!348, !342}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !511, file: !344, line: 282, baseType: !462, size: 64, align: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !511, file: !344, line: 283, baseType: !520, size: 64, align: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !344, line: 170, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!342, !342, !348}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !511, file: !344, line: 284, baseType: !520, size: 64, align: 64, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !511, file: !344, line: 285, baseType: !427, size: 64, align: 64, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !511, file: !344, line: 286, baseType: !527, size: 64, align: 64, offset: 320)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !344, line: 172, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!381, !342, !348, !342}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !511, file: !344, line: 287, baseType: !427, size: 64, align: 64, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !511, file: !344, line: 288, baseType: !533, size: 64, align: 64, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !344, line: 231, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!381, !342, !342}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !511, file: !344, line: 290, baseType: !462, size: 64, align: 64, offset: 512)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !511, file: !344, line: 291, baseType: !520, size: 64, align: 64, offset: 576)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !357, file: !344, line: 352, baseType: !540, size: 64, align: 64, offset: 896)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !344, line: 298, baseType: !542)
!542 = !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 294, size: 192, align: 64, elements: !543)
!543 = !{!544, !545, !546}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !542, file: !344, line: 295, baseType: !514, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !542, file: !344, line: 296, baseType: !462, size: 64, align: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !542, file: !344, line: 297, baseType: !547, size: 64, align: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !344, line: 174, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64, align: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!381, !342, !342, !342}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !357, file: !344, line: 356, baseType: !552, size: 64, align: 64, offset: 960)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !344, line: 321, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64, align: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!556, !342}
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !349, line: 186, baseType: !348)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !357, file: !344, line: 357, baseType: !471, size: 64, align: 64, offset: 1024)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !357, file: !344, line: 358, baseType: !452, size: 64, align: 64, offset: 1088)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !357, file: !344, line: 359, baseType: !560, size: 64, align: 64, offset: 1152)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !344, line: 317, baseType: !463)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !357, file: !344, line: 360, baseType: !562, size: 64, align: 64, offset: 1216)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !344, line: 319, baseType: !548)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !357, file: !344, line: 363, baseType: !564, size: 64, align: 64, offset: 1280)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64, align: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !344, line: 304, baseType: !566)
!566 = !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 301, size: 128, align: 64, elements: !567)
!567 = !{!568, !589}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !566, file: !344, line: 302, baseType: !569, size: 64, align: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !344, line: 193, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64, align: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!381, !342, !573, !381}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !344, line: 191, baseType: !575)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !344, line: 178, size: 640, align: 64, elements: !576)
!576 = !{!577, !578, !579, !580, !581, !582, !583, !584, !586, !587, !588}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !575, file: !344, line: 179, baseType: !427, size: 64, align: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !575, file: !344, line: 180, baseType: !342, size: 64, align: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !575, file: !344, line: 181, baseType: !348, size: 64, align: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !575, file: !344, line: 182, baseType: !348, size: 64, align: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !575, file: !344, line: 184, baseType: !381, size: 32, align: 32, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !575, file: !344, line: 185, baseType: !381, size: 32, align: 32, offset: 288)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !575, file: !344, line: 186, baseType: !389, size: 64, align: 64, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !575, file: !344, line: 187, baseType: !585, size: 64, align: 64, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !575, file: !344, line: 188, baseType: !585, size: 64, align: 64, offset: 448)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !575, file: !344, line: 189, baseType: !585, size: 64, align: 64, offset: 512)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !575, file: !344, line: 190, baseType: !427, size: 64, align: 64, offset: 576)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !566, file: !344, line: 303, baseType: !590, size: 64, align: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !344, line: 194, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64, align: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !342, !573}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !357, file: !344, line: 366, baseType: !434, size: 64, align: 64, offset: 1344)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !357, file: !344, line: 368, baseType: !366, size: 64, align: 64, offset: 1408)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !357, file: !344, line: 372, baseType: !597, size: 64, align: 64, offset: 1472)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !344, line: 233, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64, align: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!381, !342, !601, !427}
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !344, line: 232, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64, align: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!381, !342, !427}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !357, file: !344, line: 375, baseType: !480, size: 64, align: 64, offset: 1536)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !357, file: !344, line: 379, baseType: !607, size: 64, align: 64, offset: 1600)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !344, line: 322, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!342, !342, !342, !381}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !357, file: !344, line: 382, baseType: !348, size: 64, align: 64, offset: 1664)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !357, file: !344, line: 385, baseType: !613, size: 64, align: 64, offset: 1728)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !344, line: 323, baseType: !453)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !357, file: !344, line: 386, baseType: !615, size: 64, align: 64, offset: 1792)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !344, line: 324, baseType: !453)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !357, file: !344, line: 389, baseType: !617, size: 64, align: 64, offset: 1856)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64, align: 64)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !619, line: 40, size: 256, align: 64, elements: !620)
!619 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!620 = !{!621, !622, !624, !625}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !618, file: !619, line: 41, baseType: !366, size: 64, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !618, file: !619, line: 42, baseType: !623, size: 64, align: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !619, line: 18, baseType: !463)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !618, file: !619, line: 43, baseType: !381, size: 32, align: 32, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !618, file: !619, line: 45, baseType: !366, size: 64, align: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !357, file: !344, line: 390, baseType: !627, size: 64, align: 64, offset: 1920)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64, align: 64)
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !344, line: 390, flags: DIFlagFwdDecl)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !357, file: !344, line: 391, baseType: !630, size: 64, align: 64, offset: 1984)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !632, line: 11, size: 320, align: 64, elements: !633)
!632 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!633 = !{!634, !635, !640, !645, !646}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !631, file: !632, line: 12, baseType: !389, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !631, file: !632, line: 13, baseType: !636, size: 64, align: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !632, line: 8, baseType: !637)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64, align: 64)
!638 = !DISubroutineType(types: !639)
!639 = !{!342, !342, !427}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !631, file: !632, line: 14, baseType: !641, size: 64, align: 64, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !632, line: 9, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64, align: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!381, !342, !342, !427}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !631, file: !632, line: 15, baseType: !389, size: 64, align: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !631, file: !632, line: 16, baseType: !427, size: 64, align: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !357, file: !344, line: 392, baseType: !356, size: 64, align: 64, offset: 2048)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !357, file: !344, line: 393, baseType: !342, size: 64, align: 64, offset: 2112)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !357, file: !344, line: 394, baseType: !650, size: 64, align: 64, offset: 2176)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !344, line: 325, baseType: !472)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !357, file: !344, line: 395, baseType: !652, size: 64, align: 64, offset: 2240)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !344, line: 326, baseType: !548)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !357, file: !344, line: 396, baseType: !348, size: 64, align: 64, offset: 2304)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !357, file: !344, line: 397, baseType: !655, size: 64, align: 64, offset: 2368)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !344, line: 327, baseType: !548)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !357, file: !344, line: 398, baseType: !657, size: 64, align: 64, offset: 2432)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !344, line: 329, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64, align: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!342, !356, !348}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !357, file: !344, line: 399, baseType: !662, size: 64, align: 64, offset: 2496)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !344, line: 328, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64, align: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!342, !356, !342, !342}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !357, file: !344, line: 400, baseType: !667, size: 64, align: 64, offset: 2560)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !344, line: 307, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64, align: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{null, !427}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !357, file: !344, line: 401, baseType: !480, size: 64, align: 64, offset: 2624)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !357, file: !344, line: 402, baseType: !342, size: 64, align: 64, offset: 2688)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !357, file: !344, line: 403, baseType: !342, size: 64, align: 64, offset: 2752)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !357, file: !344, line: 404, baseType: !342, size: 64, align: 64, offset: 2816)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !357, file: !344, line: 405, baseType: !342, size: 64, align: 64, offset: 2880)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !357, file: !344, line: 406, baseType: !342, size: 64, align: 64, offset: 2944)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !357, file: !344, line: 407, baseType: !372, size: 64, align: 64, offset: 3008)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !357, file: !344, line: 410, baseType: !679, size: 32, align: 32, offset: 3072)
!679 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !357, file: !344, line: 412, baseType: !372, size: 64, align: 64, offset: 3136)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64, align: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !433, line: 90, baseType: !381)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64, align: 64)
!684 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !687, line: 41, baseType: !688)
!687 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!688 = !DICompositeType(tag: DW_TAG_structure_type, file: !687, line: 31, size: 320, align: 64, elements: !689)
!689 = !{!690, !691, !692}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !688, file: !687, line: 32, baseType: !360, size: 192, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !688, file: !687, line: 33, baseType: !556, size: 64, align: 64, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !688, file: !687, line: 34, baseType: !418, size: 8, align: 8, offset: 256)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64, align: 64)
!694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !684)
!697 = !{!698, !706, !740, !760, !805, !815, !820, !828, !836, !849, !856, !866, !881, !893, !902, !965, !1003, !1010, !1019, !1046, !1053, !1068}
!698 = !DISubprogram(name: "_Py_device_encoding", scope: !699, file: !699, line: 37, type: !700, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32)* @_Py_device_encoding, variables: !702)
!699 = !DIFile(filename: "Python/fileutils.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!700 = !DISubroutineType(types: !701)
!701 = !{!342, !381}
!702 = !{!703, !704}
!703 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !698, file: !699, line: 37, type: !381)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codeset", scope: !705, file: !699, line: 58, type: !389)
!705 = distinct !DILexicalBlock(scope: !698, file: !699, line: 57, column: 5)
!706 = !DISubprogram(name: "_Py_char2wchar", scope: !699, file: !699, line: 261, type: !707, isLocal: false, isDefinition: true, scopeLine: 262, flags: DIFlagPrototyped, isOptimized: true, function: i32* (i8*, i64*)* @_Py_char2wchar, variables: !710)
!707 = !DISubroutineType(types: !708)
!708 = !{!681, !366, !709}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64, align: 64)
!710 = !{!711, !712, !713, !714, !715, !716, !717, !718, !733, !738}
!711 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 1, scope: !706, file: !699, line: 261, type: !366)
!712 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !706, file: !699, line: 261, type: !709)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !706, file: !699, line: 274, type: !681)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "argsize", scope: !706, file: !699, line: 275, type: !432)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !706, file: !699, line: 276, type: !432)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !706, file: !699, line: 278, type: !683)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !706, file: !699, line: 279, type: !681)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mbs", scope: !706, file: !699, line: 280, type: !719)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !720, line: 106, baseType: !721)
!720 = !DIFile(filename: "/usr/include/wchar.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !720, line: 94, baseType: !722)
!722 = !DICompositeType(tag: DW_TAG_structure_type, file: !720, line: 82, size: 64, align: 32, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !722, file: !720, line: 84, baseType: !381, size: 32, align: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !722, file: !720, line: 93, baseType: !726, size: 32, align: 32, offset: 32)
!726 = !DICompositeType(tag: DW_TAG_union_type, scope: !722, file: !720, line: 85, size: 32, align: 32, elements: !727)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !726, file: !720, line: 88, baseType: !679, size: 32, align: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !726, file: !720, line: 92, baseType: !730, size: 32, align: 8)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 32, align: 8, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 4)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !734, file: !699, line: 311, type: !681)
!734 = distinct !DILexicalBlock(scope: !735, file: !699, line: 310, column: 34)
!735 = distinct !DILexicalBlock(scope: !736, file: !699, line: 310, column: 13)
!736 = distinct !DILexicalBlock(scope: !737, file: !699, line: 305, column: 32)
!737 = distinct !DILexicalBlock(scope: !706, file: !699, line: 305, column: 9)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "converted", scope: !739, file: !699, line: 339, type: !432)
!739 = distinct !DILexicalBlock(scope: !706, file: !699, line: 338, column: 21)
!740 = !DISubprogram(name: "_Py_wchar2char", scope: !699, file: !699, line: 404, type: !741, isLocal: false, isDefinition: true, scopeLine: 405, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32*, i64*)* @_Py_wchar2char, variables: !745)
!741 = !DISubroutineType(types: !742)
!742 = !{!389, !743, !709}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64, align: 64)
!744 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !682)
!745 = !{!746, !747, !748, !750, !751, !752, !753, !754, !755, !756}
!746 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "text", arg: 1, scope: !740, file: !699, line: 404, type: !743)
!747 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "error_pos", arg: 2, scope: !740, file: !699, line: 404, type: !709)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !740, file: !699, line: 437, type: !749)
!749 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !740, file: !699, line: 438, type: !389)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !740, file: !699, line: 438, type: !389)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !740, file: !699, line: 439, type: !432)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !740, file: !699, line: 439, type: !432)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "converted", scope: !740, file: !699, line: 439, type: !432)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !740, file: !699, line: 440, type: !682)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !740, file: !699, line: 440, type: !757)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 64, align: 32, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 2)
!760 = !DISubprogram(name: "_Py_wstat", scope: !699, file: !699, line: 519, type: !761, isLocal: false, isDefinition: true, scopeLine: 520, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32*, %struct.stat*)* @_Py_wstat, variables: !800)
!761 = !DISubroutineType(types: !762)
!762 = !{!381, !743, !763}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64, align: 64)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !765, line: 46, size: 1152, align: 64, elements: !766)
!765 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!766 = !{!767, !769, !771, !773, !775, !777, !779, !780, !781, !782, !784, !786, !794, !795, !796}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !764, file: !765, line: 48, baseType: !768, size: 64, align: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !353, line: 133, baseType: !434)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !764, file: !765, line: 53, baseType: !770, size: 64, align: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !353, line: 136, baseType: !434)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !764, file: !765, line: 61, baseType: !772, size: 64, align: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !353, line: 139, baseType: !434)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !764, file: !765, line: 62, baseType: !774, size: 32, align: 32, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !353, line: 138, baseType: !679)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !764, file: !765, line: 64, baseType: !776, size: 32, align: 32, offset: 224)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !353, line: 134, baseType: !679)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !764, file: !765, line: 65, baseType: !778, size: 32, align: 32, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !353, line: 135, baseType: !679)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !764, file: !765, line: 67, baseType: !381, size: 32, align: 32, offset: 288)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !764, file: !765, line: 69, baseType: !768, size: 64, align: 64, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !764, file: !765, line: 74, baseType: !412, size: 64, align: 64, offset: 384)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !764, file: !765, line: 78, baseType: !783, size: 64, align: 64, offset: 448)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !353, line: 162, baseType: !354)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !764, file: !765, line: 80, baseType: !785, size: 64, align: 64, offset: 512)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !353, line: 167, baseType: !354)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !764, file: !765, line: 91, baseType: !787, size: 128, align: 64, offset: 576)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !788, line: 120, size: 128, align: 64, elements: !789)
!788 = !DIFile(filename: "/usr/include/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!789 = !{!790, !792}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !787, file: !788, line: 122, baseType: !791, size: 64, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !353, line: 148, baseType: !354)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !787, file: !788, line: 123, baseType: !793, size: 64, align: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !353, line: 184, baseType: !354)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !764, file: !765, line: 92, baseType: !787, size: 128, align: 64, offset: 704)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !764, file: !765, line: 93, baseType: !787, size: 128, align: 64, offset: 832)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !764, file: !765, line: 106, baseType: !797, size: 192, align: 64, offset: 960)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !793, size: 192, align: 64, elements: !798)
!798 = !{!799}
!799 = !DISubrange(count: 3)
!800 = !{!801, !802, !803, !804}
!801 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 1, scope: !760, file: !699, line: 519, type: !743)
!802 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 2, scope: !760, file: !699, line: 519, type: !763)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !760, file: !699, line: 521, type: !381)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fname", scope: !760, file: !699, line: 522, type: !389)
!805 = !DISubprogram(name: "_Py_stat", scope: !699, file: !699, line: 543, type: !806, isLocal: false, isDefinition: true, scopeLine: 544, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct.stat*)* @_Py_stat, variables: !808)
!806 = !DISubroutineType(types: !807)
!807 = !{!381, !342, !763}
!808 = !{!809, !810, !811, !812, !813}
!809 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 1, scope: !805, file: !699, line: 543, type: !342)
!810 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "statbuf", arg: 2, scope: !805, file: !699, line: 543, type: !763)
!811 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !805, file: !699, line: 558, type: !381)
!812 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !805, file: !699, line: 559, type: !342)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !814, file: !699, line: 563, type: !342)
!814 = distinct !DILexicalBlock(scope: !805, file: !699, line: 563, column: 8)
!815 = !DISubprogram(name: "_Py_get_inheritable", scope: !699, file: !699, line: 614, type: !816, isLocal: false, isDefinition: true, scopeLine: 615, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @_Py_get_inheritable, variables: !818)
!816 = !DISubroutineType(types: !817)
!817 = !{!381, !381}
!818 = !{!819}
!819 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !815, file: !699, line: 614, type: !381)
!820 = !DISubprogram(name: "_Py_set_inheritable", scope: !699, file: !699, line: 735, type: !821, isLocal: false, isDefinition: true, scopeLine: 736, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32*)* @_Py_set_inheritable, variables: !824)
!821 = !DISubroutineType(types: !822)
!822 = !{!381, !381, !381, !823}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!824 = !{!825, !826, !827}
!825 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !820, file: !699, line: 735, type: !381)
!826 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inheritable", arg: 2, scope: !820, file: !699, line: 735, type: !381)
!827 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atomic_flag_works", arg: 3, scope: !820, file: !699, line: 735, type: !823)
!828 = !DISubprogram(name: "_Py_open", scope: !699, file: !699, line: 743, type: !829, isLocal: false, isDefinition: true, scopeLine: 744, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32)* @_Py_open, variables: !831)
!829 = !DISubroutineType(types: !830)
!830 = !{!381, !366, !381}
!831 = !{!832, !833, !834, !835}
!832 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pathname", arg: 1, scope: !828, file: !699, line: 743, type: !366)
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 2, scope: !828, file: !699, line: 743, type: !381)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !828, file: !699, line: 745, type: !381)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_flag_works", scope: !828, file: !699, line: 752, type: !823)
!836 = !DISubprogram(name: "_Py_wfopen", scope: !699, file: !699, line: 775, type: !837, isLocal: false, isDefinition: true, scopeLine: 776, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IO_FILE* (i32*, i32*)* @_Py_wfopen, variables: !839)
!837 = !DISubroutineType(types: !838)
!838 = !{!382, !743, !743}
!839 = !{!840, !841, !842, !843, !844, !848}
!840 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 1, scope: !836, file: !699, line: 775, type: !743)
!841 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 2, scope: !836, file: !699, line: 775, type: !743)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !836, file: !699, line: 777, type: !382)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cpath", scope: !836, file: !699, line: 779, type: !389)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cmode", scope: !836, file: !699, line: 780, type: !845)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 80, align: 8, elements: !846)
!846 = !{!847}
!847 = !DISubrange(count: 10)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !836, file: !699, line: 781, type: !432)
!849 = !DISubprogram(name: "_Py_fopen", scope: !699, file: !699, line: 806, type: !850, isLocal: false, isDefinition: true, scopeLine: 807, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IO_FILE* (i8*, i8*)* @_Py_fopen, variables: !852)
!850 = !DISubroutineType(types: !851)
!851 = !{!382, !366, !366}
!852 = !{!853, !854, !855}
!853 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pathname", arg: 1, scope: !849, file: !699, line: 806, type: !366)
!854 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 2, scope: !849, file: !699, line: 806, type: !366)
!855 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !849, file: !699, line: 808, type: !382)
!856 = !DISubprogram(name: "_Py_fopen_obj", scope: !699, file: !699, line: 825, type: !857, isLocal: false, isDefinition: true, scopeLine: 826, flags: DIFlagPrototyped, isOptimized: true, function: %struct._IO_FILE* (%struct._object*, i8*)* @_Py_fopen_obj, variables: !859)
!857 = !DISubroutineType(types: !858)
!858 = !{!382, !342, !366}
!859 = !{!860, !861, !862, !863, !864}
!860 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 1, scope: !856, file: !699, line: 825, type: !342)
!861 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "mode", arg: 2, scope: !856, file: !699, line: 825, type: !366)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !856, file: !699, line: 827, type: !382)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !856, file: !699, line: 849, type: !342)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !865, file: !699, line: 853, type: !342)
!865 = distinct !DILexicalBlock(scope: !856, file: !699, line: 853, column: 8)
!866 = !DISubprogram(name: "_Py_wreadlink", scope: !699, file: !699, line: 870, type: !867, isLocal: false, isDefinition: true, scopeLine: 871, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32*, i32*, i64)* @_Py_wreadlink, variables: !869)
!867 = !DISubroutineType(types: !868)
!868 = !{!381, !743, !681, !432}
!869 = !{!870, !871, !872, !873, !874, !878, !879, !880}
!870 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 1, scope: !866, file: !699, line: 870, type: !743)
!871 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 2, scope: !866, file: !699, line: 870, type: !681)
!872 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bufsiz", arg: 3, scope: !866, file: !699, line: 870, type: !432)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cpath", scope: !866, file: !699, line: 872, type: !389)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cbuf", scope: !866, file: !699, line: 873, type: !875)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 32768, align: 8, elements: !876)
!876 = !{!877}
!877 = !DISubrange(count: 4096)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wbuf", scope: !866, file: !699, line: 874, type: !681)
!879 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !866, file: !699, line: 875, type: !381)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r1", scope: !866, file: !699, line: 876, type: !432)
!881 = !DISubprogram(name: "_Py_wrealpath", scope: !699, file: !699, line: 915, type: !882, isLocal: false, isDefinition: true, scopeLine: 917, flags: DIFlagPrototyped, isOptimized: true, function: i32* (i32*, i32*, i64)* @_Py_wrealpath, variables: !884)
!882 = !DISubroutineType(types: !883)
!883 = !{!681, !743, !681, !432}
!884 = !{!885, !886, !887, !888, !889, !890, !891, !892}
!885 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 1, scope: !881, file: !699, line: 915, type: !743)
!886 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "resolved_path", arg: 2, scope: !881, file: !699, line: 916, type: !681)
!887 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "resolved_path_size", arg: 3, scope: !881, file: !699, line: 916, type: !432)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cpath", scope: !881, file: !699, line: 918, type: !389)
!889 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cresolved_path", scope: !881, file: !699, line: 919, type: !875)
!890 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wresolved_path", scope: !881, file: !699, line: 920, type: !681)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !881, file: !699, line: 921, type: !389)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !881, file: !699, line: 922, type: !432)
!893 = !DISubprogram(name: "_Py_wgetcwd", scope: !699, file: !699, line: 954, type: !894, isLocal: false, isDefinition: true, scopeLine: 955, flags: DIFlagPrototyped, isOptimized: true, function: i32* (i32*, i64)* @_Py_wgetcwd, variables: !896)
!894 = !DISubroutineType(types: !895)
!895 = !{!681, !681, !432}
!896 = !{!897, !898, !899, !900, !901}
!897 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buf", arg: 1, scope: !893, file: !699, line: 954, type: !681)
!898 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !893, file: !699, line: 954, type: !432)
!899 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fname", scope: !893, file: !699, line: 960, type: !875)
!900 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wname", scope: !893, file: !699, line: 961, type: !681)
!901 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !893, file: !699, line: 962, type: !432)
!902 = !DISubprogram(name: "_Py_dup", scope: !699, file: !699, line: 985, type: !816, isLocal: false, isDefinition: true, scopeLine: 986, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @_Py_dup, variables: !903)
!903 = !{!904, !905}
!904 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !902, file: !699, line: 985, type: !381)
!905 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !906, file: !699, line: 1023, type: !907)
!906 = distinct !DILexicalBlock(scope: !902, file: !699, line: 1023, column: 5)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64, align: 64)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !909, line: 139, baseType: !910)
!909 = !DIFile(filename: "Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !909, line: 69, size: 1536, align: 64, elements: !911)
!911 = !{!912, !914, !915, !935, !938, !939, !940, !941, !942, !943, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !910, file: !909, line: 72, baseType: !913, size: 64, align: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64, align: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !910, file: !909, line: 73, baseType: !913, size: 64, align: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !910, file: !909, line: 74, baseType: !916, size: 64, align: 64, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !909, line: 44, baseType: !918)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !909, line: 19, size: 832, align: 64, elements: !919)
!919 = !{!920, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !918, file: !909, line: 21, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !918, file: !909, line: 22, baseType: !913, size: 64, align: 64, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !918, file: !909, line: 24, baseType: !342, size: 64, align: 64, offset: 128)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !918, file: !909, line: 25, baseType: !342, size: 64, align: 64, offset: 192)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !918, file: !909, line: 26, baseType: !342, size: 64, align: 64, offset: 256)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !918, file: !909, line: 27, baseType: !342, size: 64, align: 64, offset: 320)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !918, file: !909, line: 28, baseType: !342, size: 64, align: 64, offset: 384)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !918, file: !909, line: 30, baseType: !342, size: 64, align: 64, offset: 448)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !918, file: !909, line: 31, baseType: !342, size: 64, align: 64, offset: 512)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !918, file: !909, line: 32, baseType: !342, size: 64, align: 64, offset: 576)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !918, file: !909, line: 33, baseType: !381, size: 32, align: 32, offset: 640)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !918, file: !909, line: 34, baseType: !381, size: 32, align: 32, offset: 672)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !918, file: !909, line: 37, baseType: !381, size: 32, align: 32, offset: 704)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !918, file: !909, line: 43, baseType: !342, size: 64, align: 64, offset: 768)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !910, file: !909, line: 76, baseType: !936, size: 64, align: 64, offset: 192)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !909, line: 50, flags: DIFlagFwdDecl)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !910, file: !909, line: 77, baseType: !381, size: 32, align: 32, offset: 256)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !910, file: !909, line: 78, baseType: !368, size: 8, align: 8, offset: 288)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !910, file: !909, line: 80, baseType: !368, size: 8, align: 8, offset: 296)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !910, file: !909, line: 85, baseType: !381, size: 32, align: 32, offset: 320)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !910, file: !909, line: 86, baseType: !381, size: 32, align: 32, offset: 352)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !910, file: !909, line: 88, baseType: !944, size: 64, align: 64, offset: 384)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !909, line: 54, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!381, !342, !936, !381, !342}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !910, file: !909, line: 89, baseType: !944, size: 64, align: 64, offset: 448)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !910, file: !909, line: 90, baseType: !342, size: 64, align: 64, offset: 512)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !910, file: !909, line: 91, baseType: !342, size: 64, align: 64, offset: 576)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !910, file: !909, line: 93, baseType: !342, size: 64, align: 64, offset: 640)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !910, file: !909, line: 94, baseType: !342, size: 64, align: 64, offset: 704)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !910, file: !909, line: 95, baseType: !342, size: 64, align: 64, offset: 768)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !910, file: !909, line: 97, baseType: !342, size: 64, align: 64, offset: 832)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !910, file: !909, line: 98, baseType: !342, size: 64, align: 64, offset: 896)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !910, file: !909, line: 99, baseType: !342, size: 64, align: 64, offset: 960)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !910, file: !909, line: 101, baseType: !342, size: 64, align: 64, offset: 1024)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !910, file: !909, line: 103, baseType: !381, size: 32, align: 32, offset: 1088)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !910, file: !909, line: 105, baseType: !342, size: 64, align: 64, offset: 1152)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !910, file: !909, line: 106, baseType: !354, size: 64, align: 64, offset: 1216)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !910, file: !909, line: 108, baseType: !381, size: 32, align: 32, offset: 1280)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !910, file: !909, line: 109, baseType: !342, size: 64, align: 64, offset: 1344)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !910, file: !909, line: 134, baseType: !668, size: 64, align: 64, offset: 1408)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !910, file: !909, line: 135, baseType: !427, size: 64, align: 64, offset: 1472)
!965 = !DISubprogram(name: "check_force_ascii", scope: !699, file: !699, line: 95, type: !966, isLocal: true, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @check_force_ascii, variables: !968)
!966 = !DISubroutineType(types: !967)
!967 = !{!381}
!968 = !{!969, !970, !971, !973, !977, !978, !979, !983, !986, !987, !989, !990, !996, !997, !1001, !1002}
!969 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "loc", scope: !965, file: !699, line: 97, type: !389)
!970 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "codeset", scope: !965, file: !699, line: 99, type: !389)
!971 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "alias", scope: !965, file: !699, line: 99, type: !972)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!973 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "encoding", scope: !965, file: !699, line: 100, type: !974)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 800, align: 8, elements: !975)
!975 = !{!976}
!976 = !DISubrange(count: 100)
!977 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "is_ascii", scope: !965, file: !699, line: 101, type: !381)
!978 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !965, file: !699, line: 102, type: !679)
!979 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ascii_aliases", scope: !965, file: !699, line: 103, type: !980)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 896, align: 64, elements: !981)
!981 = !{!982}
!982 = !DISubrange(count: 14)
!983 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !984, file: !699, line: 124, type: !432)
!984 = distinct !DILexicalBlock(scope: !985, file: !699, line: 124, column: 24)
!985 = distinct !DILexicalBlock(scope: !965, file: !699, line: 124, column: 9)
!986 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !984, file: !699, line: 124, type: !432)
!987 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !988, file: !699, line: 124, type: !695)
!988 = distinct !DILexicalBlock(scope: !984, file: !699, line: 124, column: 1492)
!989 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !988, file: !699, line: 124, type: !381)
!990 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !991, file: !699, line: 140, type: !432)
!991 = distinct !DILexicalBlock(scope: !992, file: !699, line: 140, column: 28)
!992 = distinct !DILexicalBlock(scope: !993, file: !699, line: 140, column: 13)
!993 = distinct !DILexicalBlock(scope: !994, file: !699, line: 139, column: 62)
!994 = distinct !DILexicalBlock(scope: !995, file: !699, line: 139, column: 5)
!995 = distinct !DILexicalBlock(scope: !965, file: !699, line: 139, column: 5)
!996 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !991, file: !699, line: 140, type: !432)
!997 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch", scope: !998, file: !699, line: 151, type: !684)
!998 = distinct !DILexicalBlock(scope: !999, file: !699, line: 150, column: 31)
!999 = distinct !DILexicalBlock(scope: !1000, file: !699, line: 150, column: 5)
!1000 = distinct !DILexicalBlock(scope: !965, file: !699, line: 150, column: 5)
!1001 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wch", scope: !998, file: !699, line: 152, type: !682)
!1002 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !998, file: !699, line: 153, type: !432)
!1003 = !DISubprogram(name: "decode_ascii_surrogateescape", scope: !699, file: !699, line: 218, type: !707, isLocal: true, isDefinition: true, scopeLine: 219, flags: DIFlagPrototyped, isOptimized: true, function: i32* (i8*, i64*)* @decode_ascii_surrogateescape, variables: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009}
!1005 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 1, scope: !1003, file: !699, line: 218, type: !366)
!1006 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !1003, file: !699, line: 218, type: !709)
!1007 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !1003, file: !699, line: 220, type: !681)
!1008 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in", scope: !1003, file: !699, line: 221, type: !683)
!1009 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !1003, file: !699, line: 222, type: !681)
!1010 = !DISubprogram(name: "encode_ascii_surrogateescape", scope: !699, file: !699, line: 177, type: !741, isLocal: true, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i32*, i64*)* @encode_ascii_surrogateescape, variables: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1016, !1017, !1018}
!1012 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "text", arg: 1, scope: !1010, file: !699, line: 177, type: !743)
!1013 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "error_pos", arg: 2, scope: !1010, file: !699, line: 177, type: !709)
!1014 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !1010, file: !699, line: 179, type: !389)
!1015 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out", scope: !1010, file: !699, line: 179, type: !389)
!1016 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !1010, file: !699, line: 180, type: !432)
!1017 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !1010, file: !699, line: 180, type: !432)
!1018 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ch", scope: !1010, file: !699, line: 181, type: !682)
!1019 = !DISubprogram(name: "stat64", scope: !1020, file: !1020, line: 503, type: !1021, isLocal: false, isDefinition: true, scopeLine: 504, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct.stat64*)* @stat64, variables: !1043)
!1020 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!381, !366, !1023}
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !765, line: 119, size: 1152, align: 64, elements: !1025)
!1025 = !{!1026, !1027, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1039, !1040, !1041, !1042}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1024, file: !765, line: 121, baseType: !768, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1024, file: !765, line: 123, baseType: !1028, size: 64, align: 64, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !353, line: 137, baseType: !434)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1024, file: !765, line: 124, baseType: !772, size: 64, align: 64, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1024, file: !765, line: 125, baseType: !774, size: 32, align: 32, offset: 192)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1024, file: !765, line: 132, baseType: !776, size: 32, align: 32, offset: 224)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1024, file: !765, line: 133, baseType: !778, size: 32, align: 32, offset: 256)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1024, file: !765, line: 135, baseType: !381, size: 32, align: 32, offset: 288)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1024, file: !765, line: 136, baseType: !768, size: 64, align: 64, offset: 320)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1024, file: !765, line: 137, baseType: !412, size: 64, align: 64, offset: 384)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1024, file: !765, line: 143, baseType: !783, size: 64, align: 64, offset: 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1024, file: !765, line: 144, baseType: !1038, size: 64, align: 64, offset: 512)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !353, line: 168, baseType: !354)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1024, file: !765, line: 152, baseType: !787, size: 128, align: 64, offset: 576)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1024, file: !765, line: 153, baseType: !787, size: 128, align: 64, offset: 704)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1024, file: !765, line: 154, baseType: !787, size: 128, align: 64, offset: 832)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !1024, file: !765, line: 164, baseType: !797, size: 192, align: 64, offset: 960)
!1043 = !{!1044, !1045}
!1044 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__path", arg: 1, scope: !1019, file: !1020, line: 503, type: !366)
!1045 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__statbuf", arg: 2, scope: !1019, file: !1020, line: 503, type: !1023)
!1046 = !DISubprogram(name: "get_inheritable", scope: !699, file: !699, line: 571, type: !1047, isLocal: true, isDefinition: true, scopeLine: 572, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32)* @get_inheritable, variables: !1049)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!381, !381, !381}
!1049 = !{!1050, !1051, !1052}
!1050 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !1046, file: !699, line: 571, type: !381)
!1051 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "raise", arg: 2, scope: !1046, file: !699, line: 571, type: !381)
!1052 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !1046, file: !699, line: 598, type: !381)
!1053 = !DISubprogram(name: "set_inheritable", scope: !699, file: !699, line: 620, type: !1054, isLocal: true, isDefinition: true, scopeLine: 621, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, i32, i32, i32*)* @set_inheritable, variables: !1056)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!381, !381, !381, !381, !823}
!1056 = !{!1057, !1058, !1059, !1060, !1061, !1062, !1063}
!1057 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !1053, file: !699, line: 620, type: !381)
!1058 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inheritable", arg: 2, scope: !1053, file: !699, line: 620, type: !381)
!1059 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "raise", arg: 3, scope: !1053, file: !699, line: 620, type: !381)
!1060 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "atomic_flag_works", arg: 4, scope: !1053, file: !699, line: 620, type: !823)
!1061 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "request", scope: !1053, file: !699, line: 626, type: !381)
!1062 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !1053, file: !699, line: 627, type: !381)
!1063 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inheritable", scope: !1064, file: !699, line: 639, type: !381)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !699, line: 638, column: 39)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !699, line: 638, column: 13)
!1066 = distinct !DILexicalBlock(scope: !1067, file: !699, line: 637, column: 58)
!1067 = distinct !DILexicalBlock(scope: !1053, file: !699, line: 637, column: 9)
!1068 = !DISubprogram(name: "make_non_inheritable", scope: !699, file: !699, line: 712, type: !816, isLocal: true, isDefinition: true, scopeLine: 713, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @make_non_inheritable, variables: !1069)
!1069 = !{!1070}
!1070 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !1068, file: !699, line: 712, type: !381)
!1071 = !{!1072, !1073}
!1072 = !DIGlobalVariable(name: "_Py_open_cloexec_works", scope: !0, file: !699, line: 33, type: !381, isLocal: false, isDefinition: true, variable: i32* @_Py_open_cloexec_works)
!1073 = !DIGlobalVariable(name: "force_ascii", scope: !0, file: !699, line: 92, type: !381, isLocal: true, isDefinition: true, variable: i32* @force_ascii)
!1074 = !{i32 2, !"Dwarf Version", i32 4}
!1075 = !{i32 2, !"Debug Info Version", i32 3}
!1076 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!1077 = !{!1078, !1078, i64 0}
!1078 = !{!"int", !1079, i64 0}
!1079 = !{!"omnipotent char", !1080, i64 0}
!1080 = !{!"Simple C/C++ TBAA"}
!1081 = !DIExpression()
!1082 = !DILocation(line: 37, column: 25, scope: !698)
