; ModuleID = 'irs-onlybc/fileio.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyMethodDef = type { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !392, globals: !868)
!1 = !DIFile(filename: "fileio.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !43, !366, !100, !95, !380, !388, !15, !391, !21}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "fileio", file: !6, line: 58, baseType: !7)
!6 = !DIFile(filename: "./Modules/_io/fileio.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!7 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 46, size: 320, align: 64, elements: !8)
!8 = !{!9, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !7, file: !6, line: 47, baseType: !10, size: 128, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !11, line: 109, baseType: !12)
!11 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !11, line: 105, size: 128, align: 64, elements: !13)
!13 = !{!14, !22}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !12, file: !11, line: 107, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !16, line: 177, baseType: !17)
!16 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !18, line: 102, baseType: !19)
!18 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !20, line: 181, baseType: !21)
!20 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!21 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !12, file: !11, line: 108, baseType: !23, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !11, line: 334, size: 3200, align: 64, elements: !25)
!25 = !{!26, !32, !36, !37, !38, !44, !108, !113, !118, !119, !124, !176, !207, !219, !225, !226, !227, !229, !231, !262, !263, !264, !273, !274, !279, !280, !282, !284, !294, !304, !322, !323, !324, !326, !328, !329, !331, !336, !341, !346, !347, !348, !349, !350, !351, !352, !353, !355}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !24, file: !11, line: 335, baseType: !27, size: 192, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !11, line: 114, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 111, size: 192, align: 64, elements: !29)
!29 = !{!30, !31}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !28, file: !11, line: 112, baseType: !10, size: 128, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !28, file: !11, line: 113, baseType: !15, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !24, file: !11, line: 336, baseType: !33, size: 64, align: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!35 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !24, file: !11, line: 337, baseType: !15, size: 64, align: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !24, file: !11, line: 337, baseType: !15, size: 64, align: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !24, file: !11, line: 341, baseType: !39, size: 64, align: 64, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !11, line: 308, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !43}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !24, file: !11, line: 342, baseType: !45, size: 64, align: 64, offset: 448)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !11, line: 314, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{!49, !43, !50, !49}
!49 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !18, line: 48, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !53, line: 246, size: 1728, align: 64, elements: !54)
!53 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!54 = !{!55, !56, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !76, !77, !78, !79, !81, !83, !85, !89, !92, !94, !96, !97, !98, !99, !103, !104}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !52, file: !53, line: 247, baseType: !49, size: 32, align: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !52, file: !53, line: 252, baseType: !57, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !52, file: !53, line: 253, baseType: !57, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !52, file: !53, line: 254, baseType: !57, size: 64, align: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !52, file: !53, line: 255, baseType: !57, size: 64, align: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !52, file: !53, line: 256, baseType: !57, size: 64, align: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !52, file: !53, line: 257, baseType: !57, size: 64, align: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !52, file: !53, line: 258, baseType: !57, size: 64, align: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !52, file: !53, line: 259, baseType: !57, size: 64, align: 64, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !52, file: !53, line: 261, baseType: !57, size: 64, align: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !52, file: !53, line: 262, baseType: !57, size: 64, align: 64, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !52, file: !53, line: 263, baseType: !57, size: 64, align: 64, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !52, file: !53, line: 265, baseType: !69, size: 64, align: 64, offset: 768)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !53, line: 161, size: 192, align: 64, elements: !71)
!71 = !{!72, !73, !75}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !70, file: !53, line: 162, baseType: !69, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !70, file: !53, line: 163, baseType: !74, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !70, file: !53, line: 167, baseType: !49, size: 32, align: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !52, file: !53, line: 267, baseType: !74, size: 64, align: 64, offset: 832)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !52, file: !53, line: 269, baseType: !49, size: 32, align: 32, offset: 896)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !52, file: !53, line: 273, baseType: !49, size: 32, align: 32, offset: 928)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !52, file: !53, line: 275, baseType: !80, size: 64, align: 64, offset: 960)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !20, line: 140, baseType: !21)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !52, file: !53, line: 279, baseType: !82, size: 16, align: 16, offset: 1024)
!82 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !52, file: !53, line: 280, baseType: !84, size: 8, align: 8, offset: 1040)
!84 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !52, file: !53, line: 281, baseType: !86, size: 8, align: 8, offset: 1048)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8, align: 8, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 1)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !52, file: !53, line: 285, baseType: !90, size: 64, align: 64, offset: 1088)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !53, line: 155, baseType: null)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !52, file: !53, line: 294, baseType: !93, size: 64, align: 64, offset: 1152)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !20, line: 141, baseType: !21)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !52, file: !53, line: 303, baseType: !95, size: 64, align: 64, offset: 1216)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !52, file: !53, line: 304, baseType: !95, size: 64, align: 64, offset: 1280)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !52, file: !53, line: 305, baseType: !95, size: 64, align: 64, offset: 1344)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !52, file: !53, line: 306, baseType: !95, size: 64, align: 64, offset: 1408)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !52, file: !53, line: 307, baseType: !100, size: 64, align: 64, offset: 1472)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !101, line: 62, baseType: !102)
!101 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!102 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !52, file: !53, line: 309, baseType: !49, size: 32, align: 32, offset: 1536)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !52, file: !53, line: 311, baseType: !105, size: 160, align: 8, offset: 1568)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 160, align: 8, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 20)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !24, file: !11, line: 343, baseType: !109, size: 64, align: 64, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !11, line: 316, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!43, !43, !57}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !24, file: !11, line: 344, baseType: !114, size: 64, align: 64, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !11, line: 318, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!49, !43, !57, !43}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !24, file: !11, line: 345, baseType: !95, size: 64, align: 64, offset: 640)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !24, file: !11, line: 346, baseType: !120, size: 64, align: 64, offset: 704)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !11, line: 320, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!43, !43}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !24, file: !11, line: 350, baseType: !125, size: 64, align: 64, offset: 768)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !11, line: 278, baseType: !127)
!127 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 236, size: 2176, align: 64, elements: !128)
!128 = !{!129, !134, !135, !136, !137, !138, !143, !145, !146, !147, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !127, file: !11, line: 241, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !11, line: 166, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!43, !43, !43}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !127, file: !11, line: 242, baseType: !130, size: 64, align: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !127, file: !11, line: 243, baseType: !130, size: 64, align: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !127, file: !11, line: 244, baseType: !130, size: 64, align: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !127, file: !11, line: 245, baseType: !130, size: 64, align: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !127, file: !11, line: 246, baseType: !139, size: 64, align: 64, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !11, line: 167, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!43, !43, !43, !43}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !127, file: !11, line: 247, baseType: !144, size: 64, align: 64, offset: 384)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !11, line: 165, baseType: !121)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !127, file: !11, line: 248, baseType: !144, size: 64, align: 64, offset: 448)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !127, file: !11, line: 249, baseType: !144, size: 64, align: 64, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !127, file: !11, line: 250, baseType: !148, size: 64, align: 64, offset: 576)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !11, line: 168, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!49, !43}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !127, file: !11, line: 251, baseType: !144, size: 64, align: 64, offset: 640)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !127, file: !11, line: 252, baseType: !130, size: 64, align: 64, offset: 704)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !127, file: !11, line: 253, baseType: !130, size: 64, align: 64, offset: 768)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !127, file: !11, line: 254, baseType: !130, size: 64, align: 64, offset: 832)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !127, file: !11, line: 255, baseType: !130, size: 64, align: 64, offset: 896)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !127, file: !11, line: 256, baseType: !130, size: 64, align: 64, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !127, file: !11, line: 257, baseType: !144, size: 64, align: 64, offset: 1024)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !127, file: !11, line: 258, baseType: !95, size: 64, align: 64, offset: 1088)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !127, file: !11, line: 259, baseType: !144, size: 64, align: 64, offset: 1152)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !127, file: !11, line: 261, baseType: !130, size: 64, align: 64, offset: 1216)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !127, file: !11, line: 262, baseType: !130, size: 64, align: 64, offset: 1280)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !127, file: !11, line: 263, baseType: !130, size: 64, align: 64, offset: 1344)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !127, file: !11, line: 264, baseType: !130, size: 64, align: 64, offset: 1408)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !127, file: !11, line: 265, baseType: !139, size: 64, align: 64, offset: 1472)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !127, file: !11, line: 266, baseType: !130, size: 64, align: 64, offset: 1536)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !127, file: !11, line: 267, baseType: !130, size: 64, align: 64, offset: 1600)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !127, file: !11, line: 268, baseType: !130, size: 64, align: 64, offset: 1664)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !127, file: !11, line: 269, baseType: !130, size: 64, align: 64, offset: 1728)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !127, file: !11, line: 270, baseType: !130, size: 64, align: 64, offset: 1792)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !127, file: !11, line: 272, baseType: !130, size: 64, align: 64, offset: 1856)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !127, file: !11, line: 273, baseType: !130, size: 64, align: 64, offset: 1920)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !127, file: !11, line: 274, baseType: !130, size: 64, align: 64, offset: 1984)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !127, file: !11, line: 275, baseType: !130, size: 64, align: 64, offset: 2048)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !127, file: !11, line: 277, baseType: !144, size: 64, align: 64, offset: 2112)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !24, file: !11, line: 351, baseType: !177, size: 64, align: 64, offset: 832)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !11, line: 292, baseType: !179)
!179 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 280, size: 640, align: 64, elements: !180)
!180 = !{!181, !186, !187, !192, !193, !194, !199, !200, !205, !206}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !179, file: !11, line: 281, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !11, line: 169, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!15, !43}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !179, file: !11, line: 282, baseType: !130, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !179, file: !11, line: 283, baseType: !188, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !11, line: 170, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!43, !43, !15}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !179, file: !11, line: 284, baseType: !188, size: 64, align: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !179, file: !11, line: 285, baseType: !95, size: 64, align: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !179, file: !11, line: 286, baseType: !195, size: 64, align: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !11, line: 172, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!49, !43, !15, !43}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !179, file: !11, line: 287, baseType: !95, size: 64, align: 64, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !179, file: !11, line: 288, baseType: !201, size: 64, align: 64, offset: 448)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !11, line: 231, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!49, !43, !43}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !179, file: !11, line: 290, baseType: !130, size: 64, align: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !179, file: !11, line: 291, baseType: !188, size: 64, align: 64, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !24, file: !11, line: 352, baseType: !208, size: 64, align: 64, offset: 896)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !11, line: 298, baseType: !210)
!210 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 294, size: 192, align: 64, elements: !211)
!211 = !{!212, !213, !214}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !210, file: !11, line: 295, baseType: !182, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !210, file: !11, line: 296, baseType: !130, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !210, file: !11, line: 297, baseType: !215, size: 64, align: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !11, line: 174, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!49, !43, !43, !43}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !24, file: !11, line: 356, baseType: !220, size: 64, align: 64, offset: 960)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !11, line: 321, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!224, !43}
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !16, line: 186, baseType: !15)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !24, file: !11, line: 357, baseType: !139, size: 64, align: 64, offset: 1024)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !24, file: !11, line: 358, baseType: !120, size: 64, align: 64, offset: 1088)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !24, file: !11, line: 359, baseType: !228, size: 64, align: 64, offset: 1152)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !11, line: 317, baseType: !131)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !24, file: !11, line: 360, baseType: !230, size: 64, align: 64, offset: 1216)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !11, line: 319, baseType: !216)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !24, file: !11, line: 363, baseType: !232, size: 64, align: 64, offset: 1280)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !11, line: 304, baseType: !234)
!234 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 301, size: 128, align: 64, elements: !235)
!235 = !{!236, !257}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !234, file: !11, line: 302, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !11, line: 193, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!49, !43, !241, !49}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !11, line: 191, baseType: !243)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !11, line: 178, size: 640, align: 64, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !254, !255, !256}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !243, file: !11, line: 179, baseType: !95, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !243, file: !11, line: 180, baseType: !43, size: 64, align: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !243, file: !11, line: 181, baseType: !15, size: 64, align: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !243, file: !11, line: 182, baseType: !15, size: 64, align: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !243, file: !11, line: 184, baseType: !49, size: 32, align: 32, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !243, file: !11, line: 185, baseType: !49, size: 32, align: 32, offset: 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !243, file: !11, line: 186, baseType: !57, size: 64, align: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !243, file: !11, line: 187, baseType: !253, size: 64, align: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !243, file: !11, line: 188, baseType: !253, size: 64, align: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !243, file: !11, line: 189, baseType: !253, size: 64, align: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !243, file: !11, line: 190, baseType: !95, size: 64, align: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !234, file: !11, line: 303, baseType: !258, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !11, line: 194, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !43, !241}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !24, file: !11, line: 366, baseType: !102, size: 64, align: 64, offset: 1344)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !24, file: !11, line: 368, baseType: !33, size: 64, align: 64, offset: 1408)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !24, file: !11, line: 372, baseType: !265, size: 64, align: 64, offset: 1472)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !11, line: 233, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!49, !43, !269, !95}
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !11, line: 232, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!49, !43, !95}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !24, file: !11, line: 375, baseType: !148, size: 64, align: 64, offset: 1536)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !24, file: !11, line: 379, baseType: !275, size: 64, align: 64, offset: 1600)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !11, line: 322, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!43, !43, !43, !49}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !24, file: !11, line: 382, baseType: !15, size: 64, align: 64, offset: 1664)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !24, file: !11, line: 385, baseType: !281, size: 64, align: 64, offset: 1728)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !11, line: 323, baseType: !121)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !24, file: !11, line: 386, baseType: !283, size: 64, align: 64, offset: 1792)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !11, line: 324, baseType: !121)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !24, file: !11, line: 389, baseType: !285, size: 64, align: 64, offset: 1856)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !287, line: 40, size: 256, align: 64, elements: !288)
!287 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!288 = !{!289, !290, !292, !293}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !286, file: !287, line: 41, baseType: !33, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !286, file: !287, line: 42, baseType: !291, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !287, line: 18, baseType: !131)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !286, file: !287, line: 43, baseType: !49, size: 32, align: 32, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !286, file: !287, line: 45, baseType: !33, size: 64, align: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !24, file: !11, line: 390, baseType: !295, size: 64, align: 64, offset: 1920)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !297, line: 18, size: 320, align: 64, elements: !298)
!297 = !DIFile(filename: "Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!298 = !{!299, !300, !301, !302, !303}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !296, file: !297, line: 19, baseType: !57, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !296, file: !297, line: 20, baseType: !49, size: 32, align: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !296, file: !297, line: 21, baseType: !15, size: 64, align: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !296, file: !297, line: 22, baseType: !49, size: 32, align: 32, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !296, file: !297, line: 23, baseType: !57, size: 64, align: 64, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !24, file: !11, line: 391, baseType: !305, size: 64, align: 64, offset: 1984)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !307, line: 11, size: 320, align: 64, elements: !308)
!307 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!308 = !{!309, !310, !315, !320, !321}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !307, line: 12, baseType: !57, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !306, file: !307, line: 13, baseType: !311, size: 64, align: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !307, line: 8, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!43, !43, !95}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !306, file: !307, line: 14, baseType: !316, size: 64, align: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !307, line: 9, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!49, !43, !43, !95}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !306, file: !307, line: 15, baseType: !57, size: 64, align: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !306, file: !307, line: 16, baseType: !95, size: 64, align: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !24, file: !11, line: 392, baseType: !23, size: 64, align: 64, offset: 2048)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !24, file: !11, line: 393, baseType: !43, size: 64, align: 64, offset: 2112)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !24, file: !11, line: 394, baseType: !325, size: 64, align: 64, offset: 2176)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !11, line: 325, baseType: !140)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !24, file: !11, line: 395, baseType: !327, size: 64, align: 64, offset: 2240)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !11, line: 326, baseType: !216)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !24, file: !11, line: 396, baseType: !15, size: 64, align: 64, offset: 2304)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !24, file: !11, line: 397, baseType: !330, size: 64, align: 64, offset: 2368)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !11, line: 327, baseType: !216)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !24, file: !11, line: 398, baseType: !332, size: 64, align: 64, offset: 2432)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !11, line: 329, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DISubroutineType(types: !335)
!335 = !{!43, !23, !15}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !24, file: !11, line: 399, baseType: !337, size: 64, align: 64, offset: 2496)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !11, line: 328, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!43, !23, !43, !43}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !24, file: !11, line: 400, baseType: !342, size: 64, align: 64, offset: 2560)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !11, line: 307, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !95}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !24, file: !11, line: 401, baseType: !148, size: 64, align: 64, offset: 2624)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !24, file: !11, line: 402, baseType: !43, size: 64, align: 64, offset: 2688)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !24, file: !11, line: 403, baseType: !43, size: 64, align: 64, offset: 2752)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !24, file: !11, line: 404, baseType: !43, size: 64, align: 64, offset: 2816)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !24, file: !11, line: 405, baseType: !43, size: 64, align: 64, offset: 2880)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !24, file: !11, line: 406, baseType: !43, size: 64, align: 64, offset: 2944)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !24, file: !11, line: 407, baseType: !39, size: 64, align: 64, offset: 3008)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !24, file: !11, line: 410, baseType: !354, size: 32, align: 32, offset: 3072)
!354 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !24, file: !11, line: 412, baseType: !39, size: 64, align: 64, offset: 3136)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !7, file: !6, line: 48, baseType: !49, size: 32, align: 32, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "created", scope: !7, file: !6, line: 49, baseType: !354, size: 1, align: 32, offset: 160)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "readable", scope: !7, file: !6, line: 50, baseType: !354, size: 1, align: 32, offset: 161)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "writable", scope: !7, file: !6, line: 51, baseType: !354, size: 1, align: 32, offset: 162)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "appending", scope: !7, file: !6, line: 52, baseType: !354, size: 1, align: 32, offset: 163)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !7, file: !6, line: 53, baseType: !49, size: 2, align: 32, offset: 164)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "closefd", scope: !7, file: !6, line: 54, baseType: !354, size: 1, align: 32, offset: 166)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "finalizing", scope: !7, file: !6, line: 55, baseType: !35, size: 8, align: 8, offset: 168)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !7, file: !6, line: 56, baseType: !43, size: 64, align: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !7, file: !6, line: 57, baseType: !43, size: 64, align: 64, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !368, line: 253, baseType: !369)
!368 = !DIFile(filename: "Include/objimpl.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!369 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !368, line: 246, size: 192, align: 64, elements: !370)
!370 = !{!371, !378}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !369, file: !368, line: 251, baseType: !372, size: 192, align: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, scope: !369, file: !368, line: 247, size: 192, align: 64, elements: !373)
!373 = !{!374, !376, !377}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !372, file: !368, line: 248, baseType: !375, size: 64, align: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !372, file: !368, line: 249, baseType: !375, size: 64, align: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !372, file: !368, line: 250, baseType: !15, size: 64, align: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !369, file: !368, line: 252, baseType: !379, size: 64, align: 64)
!379 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !382, line: 41, baseType: !383)
!382 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!383 = !DICompositeType(tag: DW_TAG_structure_type, file: !382, line: 31, size: 320, align: 64, elements: !384)
!384 = !{!385, !386, !387}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !383, file: !382, line: 32, baseType: !27, size: 192, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !383, file: !382, line: 33, baseType: !224, size: 64, align: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !383, file: !382, line: 34, baseType: !86, size: 8, align: 8, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_off_t", file: !389, line: 94, baseType: !390)
!389 = !DIFile(filename: "./Modules/_io/_iomodule.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !18, line: 92, baseType: !93)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!392 = !{!393, !396, !409, !420, !425, !436, !447, !534, !537, !550, !619, !646, !653, !665, !677, !683, !696, !700, !718, !727, !739, !749, !752, !755, !758, !764, !773, !776, !782, !786, !790, !836, !851, !858}
!393 = !DISubprogram(name: "_PyFileIO_closed", scope: !6, file: !6, line: 67, type: !150, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @_PyFileIO_closed, variables: !394)
!394 = !{!395}
!395 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !393, file: !6, line: 67, type: !43)
!396 = !DISubprogram(name: "fileio_dealloc", scope: !6, file: !6, line: 474, type: !397, isLocal: true, isDefinition: true, scopeLine: 475, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.fileio*)* @fileio_dealloc, variables: !399)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !4}
!399 = !{!400, !401, !403, !405}
!400 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !396, file: !6, line: 474, type: !4)
!401 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !402, file: !6, line: 479, type: !366)
!402 = distinct !DILexicalBlock(scope: !396, file: !6, line: 479, column: 8)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !404, file: !6, line: 482, type: !43)
!404 = distinct !DILexicalBlock(scope: !396, file: !6, line: 482, column: 8)
!405 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !406, file: !6, line: 482, type: !43)
!406 = distinct !DILexicalBlock(scope: !407, file: !6, line: 482, column: 115)
!407 = distinct !DILexicalBlock(scope: !408, file: !6, line: 482, column: 83)
!408 = distinct !DILexicalBlock(scope: !404, file: !6, line: 482, column: 60)
!409 = !DISubprogram(name: "fileio_repr", scope: !6, file: !6, line: 1041, type: !410, isLocal: true, isDefinition: true, scopeLine: 1042, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*)* @fileio_repr, variables: !412)
!410 = !DISubroutineType(types: !411)
!411 = !{!43, !4}
!412 = !{!413, !414, !415, !416}
!413 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !409, file: !6, line: 1041, type: !4)
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nameobj", scope: !409, file: !6, line: 1043, type: !43)
!415 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !409, file: !6, line: 1043, type: !43)
!416 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !417, file: !6, line: 1060, type: !43)
!417 = distinct !DILexicalBlock(scope: !418, file: !6, line: 1060, column: 12)
!418 = distinct !DILexicalBlock(scope: !419, file: !6, line: 1057, column: 10)
!419 = distinct !DILexicalBlock(scope: !409, file: !6, line: 1049, column: 9)
!420 = !DISubprogram(name: "mode_string", scope: !6, file: !6, line: 1016, type: !421, isLocal: true, isDefinition: true, scopeLine: 1017, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.fileio*)* @mode_string, variables: !423)
!421 = !DISubroutineType(types: !422)
!422 = !{!57, !4}
!423 = !{!424}
!424 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !420, file: !6, line: 1016, type: !4)
!425 = !DISubprogram(name: "fileio_traverse", scope: !6, file: !6, line: 460, type: !426, isLocal: true, isDefinition: true, scopeLine: 461, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.fileio*, i32 (%struct._object*, i8*)*, i8*)* @fileio_traverse, variables: !428)
!426 = !DISubroutineType(types: !427)
!427 = !{!49, !4, !269, !95}
!428 = !{!429, !430, !431, !432}
!429 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !425, file: !6, line: 460, type: !4)
!430 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !425, file: !6, line: 460, type: !269)
!431 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !425, file: !6, line: 460, type: !95)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !433, file: !6, line: 462, type: !49)
!433 = distinct !DILexicalBlock(scope: !434, file: !6, line: 462, column: 26)
!434 = distinct !DILexicalBlock(scope: !435, file: !6, line: 462, column: 14)
!435 = distinct !DILexicalBlock(scope: !425, file: !6, line: 462, column: 8)
!436 = !DISubprogram(name: "fileio_clear", scope: !6, file: !6, line: 467, type: !437, isLocal: true, isDefinition: true, scopeLine: 468, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.fileio*)* @fileio_clear, variables: !439)
!437 = !DISubroutineType(types: !438)
!438 = !{!49, !4}
!439 = !{!440, !441, !443}
!440 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !436, file: !6, line: 467, type: !4)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !442, file: !6, line: 469, type: !43)
!442 = distinct !DILexicalBlock(scope: !436, file: !6, line: 469, column: 8)
!443 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !444, file: !6, line: 469, type: !43)
!444 = distinct !DILexicalBlock(scope: !445, file: !6, line: 469, column: 115)
!445 = distinct !DILexicalBlock(scope: !446, file: !6, line: 469, column: 83)
!446 = distinct !DILexicalBlock(scope: !442, file: !6, line: 469, column: 60)
!447 = !DISubprogram(name: "fileio_read", scope: !6, file: !6, line: 718, type: !448, isLocal: true, isDefinition: true, scopeLine: 719, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*, %struct._object*)* @fileio_read, variables: !450)
!448 = !DISubroutineType(types: !449)
!449 = !{!43, !4, !43}
!450 = !{!451, !452, !453, !454, !455, !456, !457, !519, !522, !524, !530}
!451 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !447, file: !6, line: 718, type: !4)
!452 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !447, file: !6, line: 718, type: !43)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !447, file: !6, line: 720, type: !57)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !447, file: !6, line: 721, type: !15)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !447, file: !6, line: 722, type: !15)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !447, file: !6, line: 723, type: !43)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !458, file: !6, line: 747, type: !461)
!458 = distinct !DILexicalBlock(scope: !459, file: !6, line: 747, column: 9)
!459 = distinct !DILexicalBlock(scope: !460, file: !6, line: 746, column: 14)
!460 = distinct !DILexicalBlock(scope: !447, file: !6, line: 746, column: 9)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !463, line: 139, baseType: !464)
!463 = !DIFile(filename: "Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !463, line: 69, size: 1536, align: 64, elements: !465)
!465 = !{!466, !468, !469, !489, !492, !493, !494, !495, !496, !497, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !464, file: !463, line: 72, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !464, file: !463, line: 73, baseType: !467, size: 64, align: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !464, file: !463, line: 74, baseType: !470, size: 64, align: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !463, line: 44, baseType: !472)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !463, line: 19, size: 832, align: 64, elements: !473)
!473 = !{!474, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !472, file: !463, line: 21, baseType: !475, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !472, file: !463, line: 22, baseType: !467, size: 64, align: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !472, file: !463, line: 24, baseType: !43, size: 64, align: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !472, file: !463, line: 25, baseType: !43, size: 64, align: 64, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !472, file: !463, line: 26, baseType: !43, size: 64, align: 64, offset: 256)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !472, file: !463, line: 27, baseType: !43, size: 64, align: 64, offset: 320)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !472, file: !463, line: 28, baseType: !43, size: 64, align: 64, offset: 384)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !472, file: !463, line: 30, baseType: !43, size: 64, align: 64, offset: 448)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !472, file: !463, line: 31, baseType: !43, size: 64, align: 64, offset: 512)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !472, file: !463, line: 32, baseType: !43, size: 64, align: 64, offset: 576)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !472, file: !463, line: 33, baseType: !49, size: 32, align: 32, offset: 640)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !472, file: !463, line: 34, baseType: !49, size: 32, align: 32, offset: 672)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !472, file: !463, line: 37, baseType: !49, size: 32, align: 32, offset: 704)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !472, file: !463, line: 43, baseType: !43, size: 64, align: 64, offset: 768)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !464, file: !463, line: 76, baseType: !490, size: 64, align: 64, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !463, line: 50, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !464, file: !463, line: 77, baseType: !49, size: 32, align: 32, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !464, file: !463, line: 78, baseType: !35, size: 8, align: 8, offset: 288)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !464, file: !463, line: 80, baseType: !35, size: 8, align: 8, offset: 296)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !464, file: !463, line: 85, baseType: !49, size: 32, align: 32, offset: 320)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !464, file: !463, line: 86, baseType: !49, size: 32, align: 32, offset: 352)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !464, file: !463, line: 88, baseType: !498, size: 64, align: 64, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !463, line: 54, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!49, !43, !490, !49, !43}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !464, file: !463, line: 89, baseType: !498, size: 64, align: 64, offset: 448)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !464, file: !463, line: 90, baseType: !43, size: 64, align: 64, offset: 512)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !464, file: !463, line: 91, baseType: !43, size: 64, align: 64, offset: 576)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !464, file: !463, line: 93, baseType: !43, size: 64, align: 64, offset: 640)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !464, file: !463, line: 94, baseType: !43, size: 64, align: 64, offset: 704)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !464, file: !463, line: 95, baseType: !43, size: 64, align: 64, offset: 768)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !464, file: !463, line: 97, baseType: !43, size: 64, align: 64, offset: 832)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !464, file: !463, line: 98, baseType: !43, size: 64, align: 64, offset: 896)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !464, file: !463, line: 99, baseType: !43, size: 64, align: 64, offset: 960)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !464, file: !463, line: 101, baseType: !43, size: 64, align: 64, offset: 1024)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !464, file: !463, line: 103, baseType: !49, size: 32, align: 32, offset: 1088)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !464, file: !463, line: 105, baseType: !43, size: 64, align: 64, offset: 1152)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !464, file: !463, line: 106, baseType: !21, size: 64, align: 64, offset: 1216)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !464, file: !463, line: 108, baseType: !49, size: 32, align: 32, offset: 1280)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !464, file: !463, line: 109, baseType: !43, size: 64, align: 64, offset: 1344)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !464, file: !463, line: 134, baseType: !343, size: 64, align: 64, offset: 1408)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !464, file: !463, line: 135, baseType: !95, size: 64, align: 64, offset: 1472)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !520, file: !6, line: 759, type: !49)
!520 = distinct !DILexicalBlock(scope: !521, file: !6, line: 758, column: 16)
!521 = distinct !DILexicalBlock(scope: !447, file: !6, line: 758, column: 9)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !523, file: !6, line: 760, type: !43)
!523 = distinct !DILexicalBlock(scope: !520, file: !6, line: 760, column: 12)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !525, file: !6, line: 770, type: !43)
!525 = distinct !DILexicalBlock(scope: !526, file: !6, line: 770, column: 16)
!526 = distinct !DILexicalBlock(scope: !527, file: !6, line: 769, column: 45)
!527 = distinct !DILexicalBlock(scope: !528, file: !6, line: 769, column: 13)
!528 = distinct !DILexicalBlock(scope: !529, file: !6, line: 768, column: 20)
!529 = distinct !DILexicalBlock(scope: !447, file: !6, line: 768, column: 9)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !531, file: !6, line: 770, type: !43)
!531 = distinct !DILexicalBlock(scope: !532, file: !6, line: 770, column: 113)
!532 = distinct !DILexicalBlock(scope: !533, file: !6, line: 770, column: 86)
!533 = distinct !DILexicalBlock(scope: !525, file: !6, line: 770, column: 63)
!534 = !DISubprogram(name: "err_closed", scope: !6, file: !6, line: 487, type: !535, isLocal: true, isDefinition: true, scopeLine: 488, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @err_closed, variables: !2)
!535 = !DISubroutineType(types: !536)
!536 = !{!43}
!537 = !DISubprogram(name: "err_mode", scope: !6, file: !6, line: 494, type: !538, isLocal: true, isDefinition: true, scopeLine: 495, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @err_mode, variables: !540)
!538 = !DISubroutineType(types: !539)
!539 = !{!43, !57}
!540 = !{!541, !542}
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "action", arg: 1, scope: !537, file: !6, line: 494, type: !57)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !537, file: !6, line: 496, type: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyIO_State", file: !389, line: 135, baseType: !545)
!545 = !DICompositeType(tag: DW_TAG_structure_type, file: !389, line: 130, size: 192, align: 64, elements: !546)
!546 = !{!547, !548, !549}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !545, file: !389, line: 131, baseType: !49, size: 32, align: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "locale_module", scope: !545, file: !389, line: 132, baseType: !43, size: 64, align: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "unsupported_operation", scope: !545, file: !389, line: 134, baseType: !43, size: 64, align: 64, offset: 128)
!550 = !DISubprogram(name: "fileio_readall", scope: !6, file: !6, line: 619, type: !410, isLocal: true, isDefinition: true, scopeLine: 620, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*)* @fileio_readall, variables: !551)
!551 = !{!552, !553, !590, !591, !592, !593, !594, !595, !596, !603, !605, !613, !617}
!552 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !550, file: !6, line: 619, type: !4)
!553 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !550, file: !6, line: 621, type: !554)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !555, line: 46, size: 1152, align: 64, elements: !556)
!555 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!556 = !{!557, !559, !561, !563, !565, !567, !569, !570, !571, !572, !574, !576, !584, !585, !586}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !554, file: !555, line: 48, baseType: !558, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !20, line: 133, baseType: !102)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !554, file: !555, line: 53, baseType: !560, size: 64, align: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !20, line: 136, baseType: !102)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !554, file: !555, line: 61, baseType: !562, size: 64, align: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !20, line: 139, baseType: !102)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !554, file: !555, line: 62, baseType: !564, size: 32, align: 32, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !20, line: 138, baseType: !354)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !554, file: !555, line: 64, baseType: !566, size: 32, align: 32, offset: 224)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !20, line: 134, baseType: !354)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !554, file: !555, line: 65, baseType: !568, size: 32, align: 32, offset: 256)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !20, line: 135, baseType: !354)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !554, file: !555, line: 67, baseType: !49, size: 32, align: 32, offset: 288)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !554, file: !555, line: 69, baseType: !558, size: 64, align: 64, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !554, file: !555, line: 74, baseType: !80, size: 64, align: 64, offset: 384)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !554, file: !555, line: 78, baseType: !573, size: 64, align: 64, offset: 448)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !20, line: 162, baseType: !21)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !554, file: !555, line: 80, baseType: !575, size: 64, align: 64, offset: 512)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !20, line: 167, baseType: !21)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !554, file: !555, line: 91, baseType: !577, size: 128, align: 64, offset: 576)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !578, line: 120, size: 128, align: 64, elements: !579)
!578 = !DIFile(filename: "/usr/include/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!579 = !{!580, !582}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !577, file: !578, line: 122, baseType: !581, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !20, line: 148, baseType: !21)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !577, file: !578, line: 123, baseType: !583, size: 64, align: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !20, line: 184, baseType: !21)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !554, file: !555, line: 92, baseType: !577, size: 128, align: 64, offset: 704)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !554, file: !555, line: 93, baseType: !577, size: 128, align: 64, offset: 832)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !554, file: !555, line: 106, baseType: !587, size: 192, align: 64, offset: 960)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 192, align: 64, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 3)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !550, file: !6, line: 622, type: !388)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !550, file: !6, line: 622, type: !388)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !550, file: !6, line: 623, type: !43)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes_read", scope: !550, file: !6, line: 624, type: !15)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !550, file: !6, line: 625, type: !15)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bufsize", scope: !550, file: !6, line: 626, type: !100)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !597, file: !6, line: 664, type: !43)
!597 = distinct !DILexicalBlock(scope: !598, file: !6, line: 664, column: 20)
!598 = distinct !DILexicalBlock(scope: !599, file: !6, line: 660, column: 76)
!599 = distinct !DILexicalBlock(scope: !600, file: !6, line: 660, column: 17)
!600 = distinct !DILexicalBlock(scope: !601, file: !6, line: 658, column: 48)
!601 = distinct !DILexicalBlock(scope: !602, file: !6, line: 658, column: 13)
!602 = distinct !DILexicalBlock(scope: !550, file: !6, line: 657, column: 15)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !604, file: !6, line: 673, type: !461)
!604 = distinct !DILexicalBlock(scope: !602, file: !6, line: 673, column: 9)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !606, file: !6, line: 689, type: !43)
!606 = distinct !DILexicalBlock(scope: !607, file: !6, line: 689, column: 24)
!607 = distinct !DILexicalBlock(scope: !608, file: !6, line: 688, column: 43)
!608 = distinct !DILexicalBlock(scope: !609, file: !6, line: 688, column: 21)
!609 = distinct !DILexicalBlock(scope: !610, file: !6, line: 687, column: 46)
!610 = distinct !DILexicalBlock(scope: !611, file: !6, line: 687, column: 17)
!611 = distinct !DILexicalBlock(scope: !612, file: !6, line: 686, column: 20)
!612 = distinct !DILexicalBlock(scope: !602, file: !6, line: 686, column: 13)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !614, file: !6, line: 697, type: !43)
!614 = distinct !DILexicalBlock(scope: !615, file: !6, line: 697, column: 20)
!615 = distinct !DILexicalBlock(scope: !616, file: !6, line: 696, column: 47)
!616 = distinct !DILexicalBlock(scope: !611, file: !6, line: 696, column: 17)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !618, file: !6, line: 700, type: !43)
!618 = distinct !DILexicalBlock(scope: !611, file: !6, line: 700, column: 16)
!619 = !DISubprogram(name: "fstat64", scope: !620, file: !620, line: 517, type: !621, isLocal: false, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.stat64*)* @fstat64, variables: !643)
!620 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!621 = !DISubroutineType(types: !622)
!622 = !{!49, !49, !623}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !555, line: 119, size: 1152, align: 64, elements: !625)
!625 = !{!626, !627, !629, !630, !631, !632, !633, !634, !635, !636, !637, !639, !640, !641, !642}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !624, file: !555, line: 121, baseType: !558, size: 64, align: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !624, file: !555, line: 123, baseType: !628, size: 64, align: 64, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !20, line: 137, baseType: !102)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !624, file: !555, line: 124, baseType: !562, size: 64, align: 64, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !624, file: !555, line: 125, baseType: !564, size: 32, align: 32, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !624, file: !555, line: 132, baseType: !566, size: 32, align: 32, offset: 224)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !624, file: !555, line: 133, baseType: !568, size: 32, align: 32, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !624, file: !555, line: 135, baseType: !49, size: 32, align: 32, offset: 288)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !624, file: !555, line: 136, baseType: !558, size: 64, align: 64, offset: 320)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !624, file: !555, line: 137, baseType: !80, size: 64, align: 64, offset: 384)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !624, file: !555, line: 143, baseType: !573, size: 64, align: 64, offset: 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !624, file: !555, line: 144, baseType: !638, size: 64, align: 64, offset: 512)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !20, line: 168, baseType: !21)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !624, file: !555, line: 152, baseType: !577, size: 128, align: 64, offset: 576)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !624, file: !555, line: 153, baseType: !577, size: 128, align: 64, offset: 704)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !624, file: !555, line: 154, baseType: !577, size: 128, align: 64, offset: 832)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !624, file: !555, line: 164, baseType: !587, size: 192, align: 64, offset: 960)
!643 = !{!644, !645}
!644 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__fd", arg: 1, scope: !619, file: !620, line: 517, type: !49)
!645 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__statbuf", arg: 2, scope: !619, file: !620, line: 517, type: !623)
!646 = !DISubprogram(name: "new_buffersize", scope: !6, file: !6, line: 600, type: !647, isLocal: true, isDefinition: true, scopeLine: 601, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.fileio*, i64)* @new_buffersize, variables: !649)
!647 = !DISubroutineType(types: !648)
!648 = !{!100, !4, !100}
!649 = !{!650, !651, !652}
!650 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !646, file: !6, line: 600, type: !4)
!651 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "currentsize", arg: 2, scope: !646, file: !6, line: 600, type: !100)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "addend", scope: !646, file: !6, line: 602, type: !100)
!653 = !DISubprogram(name: "fileio_readinto", scope: !6, file: !6, line: 546, type: !448, isLocal: true, isDefinition: true, scopeLine: 547, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*, %struct._object*)* @fileio_readinto, variables: !654)
!654 = !{!655, !656, !657, !658, !659, !660, !661}
!655 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !653, file: !6, line: 546, type: !4)
!656 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !653, file: !6, line: 546, type: !43)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pbuf", scope: !653, file: !6, line: 548, type: !242)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !653, file: !6, line: 549, type: !15)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !653, file: !6, line: 549, type: !15)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !653, file: !6, line: 550, type: !49)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !662, file: !6, line: 562, type: !461)
!662 = distinct !DILexicalBlock(scope: !663, file: !6, line: 562, column: 9)
!663 = distinct !DILexicalBlock(scope: !664, file: !6, line: 560, column: 14)
!664 = distinct !DILexicalBlock(scope: !653, file: !6, line: 560, column: 9)
!665 = !DISubprogram(name: "fileio_write", scope: !6, file: !6, line: 779, type: !448, isLocal: true, isDefinition: true, scopeLine: 780, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*, %struct._object*)* @fileio_write, variables: !666)
!666 = !{!667, !668, !669, !670, !671, !672, !673}
!667 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !665, file: !6, line: 779, type: !4)
!668 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !665, file: !6, line: 779, type: !43)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pbuf", scope: !665, file: !6, line: 781, type: !242)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !665, file: !6, line: 782, type: !15)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !665, file: !6, line: 782, type: !15)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !665, file: !6, line: 783, type: !49)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !674, file: !6, line: 794, type: !461)
!674 = distinct !DILexicalBlock(scope: !675, file: !6, line: 794, column: 9)
!675 = distinct !DILexicalBlock(scope: !676, file: !6, line: 793, column: 14)
!676 = distinct !DILexicalBlock(scope: !665, file: !6, line: 793, column: 9)
!677 = !DISubprogram(name: "fileio_seek", scope: !6, file: !6, line: 889, type: !448, isLocal: true, isDefinition: true, scopeLine: 890, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*, %struct._object*)* @fileio_seek, variables: !678)
!678 = !{!679, !680, !681, !682}
!679 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !677, file: !6, line: 889, type: !4)
!680 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !677, file: !6, line: 889, type: !43)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "posobj", scope: !677, file: !6, line: 891, type: !43)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "whence", scope: !677, file: !6, line: 892, type: !49)
!683 = !DISubprogram(name: "portable_lseek", scope: !6, file: !6, line: 833, type: !684, isLocal: true, isDefinition: true, scopeLine: 834, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32, %struct._object*, i32)* @portable_lseek, variables: !686)
!684 = !DISubroutineType(types: !685)
!685 = !{!43, !49, !43, !49}
!686 = !{!687, !688, !689, !690, !691, !692}
!687 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !683, file: !6, line: 833, type: !49)
!688 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "posobj", arg: 2, scope: !683, file: !6, line: 833, type: !43)
!689 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "whence", arg: 3, scope: !683, file: !6, line: 833, type: !49)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !683, file: !6, line: 835, type: !388)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !683, file: !6, line: 835, type: !388)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !693, file: !6, line: 869, type: !461)
!693 = distinct !DILexicalBlock(scope: !694, file: !6, line: 869, column: 9)
!694 = distinct !DILexicalBlock(scope: !695, file: !6, line: 868, column: 14)
!695 = distinct !DILexicalBlock(scope: !683, file: !6, line: 868, column: 9)
!696 = !DISubprogram(name: "fileio_tell", scope: !6, file: !6, line: 904, type: !448, isLocal: true, isDefinition: true, scopeLine: 905, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*, %struct._object*)* @fileio_tell, variables: !697)
!697 = !{!698, !699}
!698 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !696, file: !6, line: 904, type: !4)
!699 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !696, file: !6, line: 904, type: !43)
!700 = !DISubprogram(name: "fileio_truncate", scope: !6, file: !6, line: 914, type: !448, isLocal: true, isDefinition: true, scopeLine: 915, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*, %struct._object*)* @fileio_truncate, variables: !701)
!701 = !{!702, !703, !704, !705, !706, !707, !708, !712, !714}
!702 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !700, file: !6, line: 914, type: !4)
!703 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !700, file: !6, line: 914, type: !43)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "posobj", scope: !700, file: !6, line: 916, type: !43)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !700, file: !6, line: 918, type: !388)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !700, file: !6, line: 920, type: !49)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !700, file: !6, line: 921, type: !49)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !709, file: !6, line: 994, type: !43)
!709 = distinct !DILexicalBlock(scope: !710, file: !6, line: 994, column: 12)
!710 = distinct !DILexicalBlock(scope: !711, file: !6, line: 993, column: 26)
!711 = distinct !DILexicalBlock(scope: !700, file: !6, line: 993, column: 9)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !713, file: !6, line: 998, type: !461)
!713 = distinct !DILexicalBlock(scope: !700, file: !6, line: 998, column: 5)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !715, file: !6, line: 1006, type: !43)
!715 = distinct !DILexicalBlock(scope: !716, file: !6, line: 1006, column: 12)
!716 = distinct !DILexicalBlock(scope: !717, file: !6, line: 1005, column: 19)
!717 = distinct !DILexicalBlock(scope: !700, file: !6, line: 1005, column: 9)
!718 = !DISubprogram(name: "fileio_close", scope: !6, file: !6, line: 127, type: !410, isLocal: true, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*)* @fileio_close, variables: !719)
!719 = !{!720, !721, !724}
!720 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !718, file: !6, line: 127, type: !4)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !722, file: !6, line: 135, type: !43)
!722 = distinct !DILexicalBlock(scope: !723, file: !6, line: 134, column: 27)
!723 = distinct !DILexicalBlock(scope: !718, file: !6, line: 134, column: 9)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !725, file: !6, line: 137, type: !43)
!725 = distinct !DILexicalBlock(scope: !726, file: !6, line: 137, column: 16)
!726 = distinct !DILexicalBlock(scope: !722, file: !6, line: 136, column: 13)
!727 = !DISubprogram(name: "internal_close", scope: !6, file: !6, line: 99, type: !437, isLocal: true, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.fileio*)* @internal_close, variables: !728)
!728 = !{!729, !730, !731, !732, !735}
!729 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !727, file: !6, line: 99, type: !4)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !727, file: !6, line: 101, type: !49)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "save_errno", scope: !727, file: !6, line: 102, type: !49)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !733, file: !6, line: 104, type: !49)
!733 = distinct !DILexicalBlock(scope: !734, file: !6, line: 103, column: 24)
!734 = distinct !DILexicalBlock(scope: !727, file: !6, line: 103, column: 9)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !736, file: !6, line: 108, type: !461)
!736 = distinct !DILexicalBlock(scope: !737, file: !6, line: 108, column: 13)
!737 = distinct !DILexicalBlock(scope: !738, file: !6, line: 107, column: 18)
!738 = distinct !DILexicalBlock(scope: !733, file: !6, line: 107, column: 13)
!739 = !DISubprogram(name: "fileio_seekable", scope: !6, file: !6, line: 528, type: !410, isLocal: true, isDefinition: true, scopeLine: 529, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*)* @fileio_seekable, variables: !740)
!740 = !{!741, !742, !745}
!741 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !739, file: !6, line: 528, type: !4)
!742 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !743, file: !6, line: 533, type: !43)
!743 = distinct !DILexicalBlock(scope: !744, file: !6, line: 532, column: 29)
!744 = distinct !DILexicalBlock(scope: !739, file: !6, line: 532, column: 9)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !746, file: !6, line: 538, type: !43)
!746 = distinct !DILexicalBlock(scope: !747, file: !6, line: 538, column: 16)
!747 = distinct !DILexicalBlock(scope: !748, file: !6, line: 537, column: 16)
!748 = distinct !DILexicalBlock(scope: !743, file: !6, line: 534, column: 13)
!749 = !DISubprogram(name: "fileio_readable", scope: !6, file: !6, line: 512, type: !410, isLocal: true, isDefinition: true, scopeLine: 513, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*)* @fileio_readable, variables: !750)
!750 = !{!751}
!751 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !749, file: !6, line: 512, type: !4)
!752 = !DISubprogram(name: "fileio_writable", scope: !6, file: !6, line: 520, type: !410, isLocal: true, isDefinition: true, scopeLine: 521, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*)* @fileio_writable, variables: !753)
!753 = !{!754}
!754 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !752, file: !6, line: 520, type: !4)
!755 = !DISubprogram(name: "fileio_fileno", scope: !6, file: !6, line: 504, type: !410, isLocal: true, isDefinition: true, scopeLine: 505, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*)* @fileio_fileno, variables: !756)
!756 = !{!757}
!757 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !755, file: !6, line: 504, type: !4)
!758 = !DISubprogram(name: "fileio_isatty", scope: !6, file: !6, line: 1066, type: !410, isLocal: true, isDefinition: true, scopeLine: 1067, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*)* @fileio_isatty, variables: !759)
!759 = !{!760, !761, !762}
!760 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !758, file: !6, line: 1066, type: !4)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !758, file: !6, line: 1068, type: !21)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !763, file: !6, line: 1072, type: !461)
!763 = distinct !DILexicalBlock(scope: !758, file: !6, line: 1072, column: 5)
!764 = !DISubprogram(name: "fileio_dealloc_warn", scope: !6, file: !6, line: 76, type: !448, isLocal: true, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*, %struct._object*)* @fileio_dealloc_warn, variables: !765)
!765 = !{!766, !767, !768, !771, !772}
!766 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !764, file: !6, line: 76, type: !4)
!767 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "source", arg: 2, scope: !764, file: !6, line: 76, type: !43)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc", scope: !769, file: !6, line: 79, type: !43)
!769 = distinct !DILexicalBlock(scope: !770, file: !6, line: 78, column: 41)
!770 = distinct !DILexicalBlock(scope: !764, file: !6, line: 78, column: 9)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !769, file: !6, line: 79, type: !43)
!772 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tb", scope: !769, file: !6, line: 79, type: !43)
!773 = !DISubprogram(name: "fileio_getstate", scope: !6, file: !6, line: 1079, type: !410, isLocal: true, isDefinition: true, scopeLine: 1080, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*)* @fileio_getstate, variables: !774)
!774 = !{!775}
!775 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !773, file: !6, line: 1079, type: !4)
!776 = !DISubprogram(name: "get_closed", scope: !6, file: !6, line: 1193, type: !777, isLocal: true, isDefinition: true, scopeLine: 1194, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*, i8*)* @get_closed, variables: !779)
!777 = !DISubroutineType(types: !778)
!778 = !{!43, !4, !95}
!779 = !{!780, !781}
!780 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !776, file: !6, line: 1193, type: !4)
!781 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !776, file: !6, line: 1193, type: !95)
!782 = !DISubprogram(name: "get_closefd", scope: !6, file: !6, line: 1199, type: !777, isLocal: true, isDefinition: true, scopeLine: 1200, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*, i8*)* @get_closefd, variables: !783)
!783 = !{!784, !785}
!784 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !782, file: !6, line: 1199, type: !4)
!785 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !782, file: !6, line: 1199, type: !95)
!786 = !DISubprogram(name: "get_mode", scope: !6, file: !6, line: 1205, type: !777, isLocal: true, isDefinition: true, scopeLine: 1206, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.fileio*, i8*)* @get_mode, variables: !787)
!787 = !{!788, !789}
!788 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !786, file: !6, line: 1205, type: !4)
!789 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !786, file: !6, line: 1205, type: !95)
!790 = !DISubprogram(name: "fileio_init", scope: !6, file: !6, line: 214, type: !217, isLocal: true, isDefinition: true, scopeLine: 215, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*, %struct._object*)* @fileio_init, variables: !791)
!791 = !{!792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !811, !817, !819, !823, !825, !828, !830, !832}
!792 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "oself", arg: 1, scope: !790, file: !6, line: 214, type: !43)
!793 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !790, file: !6, line: 214, type: !43)
!794 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !790, file: !6, line: 214, type: !43)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !790, file: !6, line: 216, type: !4)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !790, file: !6, line: 218, type: !33)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nameobj", scope: !790, file: !6, line: 219, type: !43)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stringobj", scope: !790, file: !6, line: 219, type: !43)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "opener", scope: !790, file: !6, line: 219, type: !43)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mode", scope: !790, file: !6, line: 220, type: !57)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !790, file: !6, line: 221, type: !57)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !790, file: !6, line: 225, type: !49)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rwa", scope: !790, file: !6, line: 226, type: !49)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "plus", scope: !790, file: !6, line: 226, type: !49)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !790, file: !6, line: 227, type: !49)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd", scope: !790, file: !6, line: 228, type: !49)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "closefd", scope: !790, file: !6, line: 229, type: !49)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fd_is_own", scope: !790, file: !6, line: 230, type: !49)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_flag_works", scope: !790, file: !6, line: 232, type: !810)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!811 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_save", scope: !812, file: !6, line: 378, type: !461)
!812 = distinct !DILexicalBlock(scope: !813, file: !6, line: 378, column: 13)
!813 = distinct !DILexicalBlock(scope: !814, file: !6, line: 377, column: 42)
!814 = distinct !DILexicalBlock(scope: !815, file: !6, line: 377, column: 13)
!815 = distinct !DILexicalBlock(scope: !816, file: !6, line: 368, column: 10)
!816 = distinct !DILexicalBlock(scope: !790, file: !6, line: 362, column: 9)
!817 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fdobj", scope: !818, file: !6, line: 389, type: !43)
!818 = distinct !DILexicalBlock(scope: !814, file: !6, line: 388, column: 14)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !820, file: !6, line: 400, type: !43)
!820 = distinct !DILexicalBlock(scope: !821, file: !6, line: 400, column: 20)
!821 = distinct !DILexicalBlock(scope: !822, file: !6, line: 399, column: 88)
!822 = distinct !DILexicalBlock(scope: !818, file: !6, line: 399, column: 17)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !824, file: !6, line: 407, type: !43)
!824 = distinct !DILexicalBlock(scope: !818, file: !6, line: 407, column: 16)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !826, file: !6, line: 439, type: !43)
!826 = distinct !DILexicalBlock(scope: !827, file: !6, line: 435, column: 26)
!827 = distinct !DILexicalBlock(scope: !790, file: !6, line: 435, column: 9)
!828 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !829, file: !6, line: 442, type: !43)
!829 = distinct !DILexicalBlock(scope: !826, file: !6, line: 442, column: 12)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !831, file: !6, line: 455, type: !43)
!831 = distinct !DILexicalBlock(scope: !790, file: !6, line: 455, column: 8)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !833, file: !6, line: 455, type: !43)
!833 = distinct !DILexicalBlock(scope: !834, file: !6, line: 455, column: 113)
!834 = distinct !DILexicalBlock(scope: !835, file: !6, line: 455, column: 82)
!835 = distinct !DILexicalBlock(scope: !831, file: !6, line: 455, column: 59)
!836 = !DISubprogram(name: "check_fd", scope: !6, file: !6, line: 192, type: !837, isLocal: true, isDefinition: true, scopeLine: 193, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @check_fd, variables: !839)
!837 = !DISubroutineType(types: !838)
!838 = !{!49, !49}
!839 = !{!840, !841, !842, !845, !846, !848}
!840 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fd", arg: 1, scope: !836, file: !6, line: 192, type: !49)
!841 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !836, file: !6, line: 195, type: !554)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exc", scope: !843, file: !6, line: 197, type: !43)
!843 = distinct !DILexicalBlock(scope: !844, file: !6, line: 196, column: 71)
!844 = distinct !DILexicalBlock(scope: !836, file: !6, line: 196, column: 9)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msg", scope: !843, file: !6, line: 198, type: !57)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !847, file: !6, line: 202, type: !43)
!847 = distinct !DILexicalBlock(scope: !843, file: !6, line: 202, column: 12)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !849, file: !6, line: 202, type: !43)
!849 = distinct !DILexicalBlock(scope: !850, file: !6, line: 202, column: 99)
!850 = distinct !DILexicalBlock(scope: !847, file: !6, line: 202, column: 65)
!851 = !DISubprogram(name: "dircheck", scope: !6, file: !6, line: 176, type: !852, isLocal: true, isDefinition: true, scopeLine: 177, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.fileio*, %struct._object*)* @dircheck, variables: !854)
!852 = !DISubroutineType(types: !853)
!853 = !{!49, !4, !43}
!854 = !{!855, !856, !857}
!855 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !851, file: !6, line: 176, type: !4)
!856 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nameobj", arg: 2, scope: !851, file: !6, line: 176, type: !43)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !851, file: !6, line: 179, type: !554)
!858 = !DISubprogram(name: "fileio_new", scope: !6, file: !6, line: 150, type: !859, isLocal: true, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @fileio_new, variables: !863)
!859 = !DISubroutineType(types: !860)
!860 = !{!43, !861, !43, !43}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64, align: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !11, line: 422, baseType: !24)
!863 = !{!864, !865, !866, !867}
!864 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !858, file: !6, line: 150, type: !861)
!865 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !858, file: !6, line: 150, type: !43)
!866 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !858, file: !6, line: 150, type: !43)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !858, file: !6, line: 152, type: !4)
!868 = !{!869, !870, !878, !882, !887, !891, !895, !899, !903, !907, !911, !912, !913, !917, !921, !925, !929, !933, !937, !942, !947}
!869 = !DIGlobalVariable(name: "PyFileIO_Type", scope: !0, file: !6, line: 1223, type: !862, isLocal: false, isDefinition: true, variable: { %struct.PyVarObject, i8*, i64, i64, void (%struct._object*)*, i32 (%struct._object*, %struct._IO_FILE*, i32)*, %struct._object* (%struct._object*, i8*)*, i32 (%struct._object*, i8*, %struct._object*)*, i8*, %struct._object* (%struct._object*)*, %struct.PyNumberMethods*, %struct.PySequenceMethods*, %struct.PyMappingMethods*, i64 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*)*, i32 (%struct._object*, %struct._object*, %struct._object*)*, %struct.PyBufferProcs*, i64, i8*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, i32)*, i64, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*)*, %struct.PyMethodDef*, %struct.PyMemberDef*, %struct.PyGetSetDef*, %struct._typeobject*, %struct._object*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, i32 (%struct._object*, %struct._object*, %struct._object*)*, i64, i32 (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._typeobject*, i64)*, %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)*, void (i8*)*, i32 (%struct._object*)*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, void (%struct._object*)*, i32, void (%struct._object*)* }* @PyFileIO_Type)
!870 = !DIGlobalVariable(name: "PyId_name", scope: !0, file: !6, line: 62, type: !871, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @PyId_name)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !11, line: 144, baseType: !872)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !11, line: 140, size: 192, align: 64, elements: !873)
!873 = !{!874, !876, !877}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !872, file: !11, line: 141, baseType: !875, size: 64, align: 64)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64, align: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !872, file: !11, line: 142, baseType: !33, size: 64, align: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !872, file: !11, line: 143, baseType: !43, size: 64, align: 64, offset: 128)
!878 = !DIGlobalVariable(name: "fileio_doc", scope: !0, file: !6, line: 1087, type: !879, isLocal: true, isDefinition: true, variable: [845 x i8]* @fileio_doc)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 6760, align: 8, elements: !880)
!880 = !{!881}
!881 = !DISubrange(count: 845)
!882 = !DIGlobalVariable(name: "fileio_methods", scope: !0, file: !6, line: 1169, type: !883, isLocal: true, isDefinition: true, variable: [16 x %struct.PyMethodDef]* @fileio_methods)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !884, size: 4096, align: 64, elements: !885)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !287, line: 47, baseType: !286)
!885 = !{!886}
!886 = !DISubrange(count: 16)
!887 = !DIGlobalVariable(name: "read_doc", scope: !0, file: !6, line: 1102, type: !888, isLocal: true, isDefinition: true, variable: [232 x i8]* @read_doc)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 1856, align: 8, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 232)
!891 = !DIGlobalVariable(name: "readall_doc", scope: !0, file: !6, line: 1109, type: !892, isLocal: true, isDefinition: true, variable: [199 x i8]* @readall_doc)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 1592, align: 8, elements: !893)
!893 = !{!894}
!894 = !DISubrange(count: 199)
!895 = !DIGlobalVariable(name: "readinto_doc", scope: !0, file: !6, line: 1148, type: !896, isLocal: true, isDefinition: true, variable: [44 x i8]* @readinto_doc)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 352, align: 8, elements: !897)
!897 = !{!898}
!898 = !DISubrange(count: 44)
!899 = !DIGlobalVariable(name: "write_doc", scope: !0, file: !6, line: 1115, type: !900, isLocal: true, isDefinition: true, variable: [189 x i8]* @write_doc)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 1512, align: 8, elements: !901)
!901 = !{!902}
!902 = !DISubrange(count: 189)
