; ModuleID = 'programs_new/Python-new/firstsets.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.grammar = type { i32, %struct.dfa*, %struct.labellist, i32, i32 }
%struct.dfa = type { i32, i8*, i32, i32, %struct.state*, i8* }
%struct.state = type { i32, %struct.arc*, i32, i32, i32*, i32 }
%struct.arc = type { i16, i16 }
%struct.labellist = type { i32, %struct.label* }
%struct.label = type { i32, i8* }

@Py_DebugFlag = external global i32, align 4
@.str = private unnamed_addr constant [23 x i8] c"Adding FIRST sets ...\0A\00", align 1
@calcfirstset.dummy = internal global i8* null, align 8
@.str.1 = private unnamed_addr constant [30 x i8] c"Calculate FIRST set for '%s'\0A\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.2 = private unnamed_addr constant [25 x i8] c"Left-recursion for '%s'\0A\00", align 1
@.str.3 = private unnamed_addr constant [39 x i8] c"Re-calculating FIRST set for '%s' ???\0A\00", align 1
@.str.4 = private unnamed_addr constant [35 x i8] c"no mem for new sym in calcfirstset\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !9, globals: !85)
!1 = !DIFile(filename: "firstsets.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !7}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64, align: 64)
!8 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!9 = !{!10, !68}
!10 = !DISubprogram(name: "_Py_addfirstsets", scope: !11, file: !11, line: 14, type: !12, isLocal: false, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.grammar*)* @_Py_addfirstsets, variables: !64)
!11 = !DIFile(filename: "Parser/firstsets.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!12 = !DISubroutineType(types: !13)
!13 = !{null, !14}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "grammar", file: !16, line: 67, baseType: !17)
!16 = !DIFile(filename: "Include/grammar.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!17 = !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 61, size: 320, align: 64, elements: !18)
!18 = !{!19, !20, !50, !62, !63}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "g_ndfas", scope: !17, file: !16, line: 62, baseType: !6, size: 32, align: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "g_dfa", scope: !17, file: !16, line: 63, baseType: !21, size: 64, align: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "dfa", file: !16, line: 57, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 50, size: 320, align: 64, elements: !24)
!24 = !{!25, !26, !27, !28, !29, !47}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !23, file: !16, line: 51, baseType: !6, size: 32, align: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !23, file: !16, line: 52, baseType: !7, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "d_initial", scope: !23, file: !16, line: 53, baseType: !6, size: 32, align: 32, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "d_nstates", scope: !23, file: !16, line: 54, baseType: !6, size: 32, align: 32, offset: 160)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "d_state", scope: !23, file: !16, line: 55, baseType: !30, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "state", file: !16, line: 46, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 37, size: 320, align: 64, elements: !33)
!33 = !{!34, !35, !43, !44, !45, !46}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "s_narcs", scope: !32, file: !16, line: 38, baseType: !6, size: 32, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "s_arc", scope: !32, file: !16, line: 39, baseType: !36, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc", file: !16, line: 33, baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 30, size: 32, align: 16, elements: !39)
!39 = !{!40, !42}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "a_lbl", scope: !38, file: !16, line: 31, baseType: !41, size: 16, align: 16)
!41 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "a_arrow", scope: !38, file: !16, line: 32, baseType: !41, size: 16, align: 16, offset: 16)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "s_lower", scope: !32, file: !16, line: 42, baseType: !6, size: 32, align: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "s_upper", scope: !32, file: !16, line: 43, baseType: !6, size: 32, align: 32, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "s_accel", scope: !32, file: !16, line: 44, baseType: !5, size: 64, align: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "s_accept", scope: !32, file: !16, line: 45, baseType: !6, size: 32, align: 32, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "d_first", scope: !23, file: !16, line: 56, baseType: !48, size: 64, align: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitset", file: !49, line: 12, baseType: !7)
!49 = !DIFile(filename: "Include/bitset.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!50 = !DIDerivedType(tag: DW_TAG_member, name: "g_ll", scope: !17, file: !16, line: 64, baseType: !51, size: 128, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "labellist", file: !16, line: 26, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 23, size: 128, align: 64, elements: !53)
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ll_nlabels", scope: !52, file: !16, line: 24, baseType: !6, size: 32, align: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "ll_label", scope: !52, file: !16, line: 25, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "label", file: !16, line: 17, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 14, size: 128, align: 64, elements: !59)
!59 = !{!60, !61}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !58, file: !16, line: 15, baseType: !6, size: 32, align: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "lb_str", scope: !58, file: !16, line: 16, baseType: !7, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "g_start", scope: !17, file: !16, line: 65, baseType: !6, size: 32, align: 32, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "g_accel", scope: !17, file: !16, line: 66, baseType: !6, size: 32, align: 32, offset: 288)
!64 = !{!65, !66, !67}
!65 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !10, file: !11, line: 14, type: !14)
!66 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !10, file: !11, line: 16, type: !6)
!67 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !10, file: !11, line: 17, type: !21)
!68 = !DISubprogram(name: "calcfirstset", scope: !11, file: !11, line: 29, type: !69, isLocal: true, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.grammar*, %struct.dfa*)* @calcfirstset, variables: !71)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !14, !21}
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84}
!72 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "g", arg: 1, scope: !68, file: !11, line: 29, type: !14)
!73 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "d", arg: 2, scope: !68, file: !11, line: 29, type: !21)
!74 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !68, file: !11, line: 31, type: !6)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !68, file: !11, line: 31, type: !6)
!76 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !68, file: !11, line: 32, type: !30)
!77 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !68, file: !11, line: 33, type: !36)
!78 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nsyms", scope: !68, file: !11, line: 34, type: !6)
!79 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sym", scope: !68, file: !11, line: 35, type: !5)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbits", scope: !68, file: !11, line: 36, type: !6)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !68, file: !11, line: 38, type: !48)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !68, file: !11, line: 39, type: !6)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d1", scope: !68, file: !11, line: 40, type: !21)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l0", scope: !68, file: !11, line: 41, type: !56)
!85 = !{!86}
!86 = !DIGlobalVariable(name: "dummy", scope: !68, file: !11, line: 37, type: !48, isLocal: true, isDefinition: true, variable: i8** @calcfirstset.dummy)
!87 = !{i32 2, !"Dwarf Version", i32 4}
!88 = !{i32 2, !"Debug Info Version", i32 3}
!89 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!90 = !{!91, !91, i64 0}
!91 = !{!"any pointer", !92, i64 0}
!92 = !{!"omnipotent char", !93, i64 0}
!93 = !{!"Simple C/C++ TBAA"}
!94 = !DIExpression()
!95 = !DILocation(line: 14, column: 27, scope: !10)
!96 = !DILocation(line: 16, column: 5, scope: !10)
!97 = !DILocation(line: 16, column: 9, scope: !10)
!98 = !DILocation(line: 17, column: 5, scope: !10)
!99 = !DILocation(line: 17, column: 10, scope: !10)
!100 = !DILocation(line: 19, column: 9, scope: !101)
!101 = distinct !DILexicalBlock(scope: !10, file: !11, line: 19, column: 9)
!102 = !{!103, !103, i64 0}
!103 = !{!"int", !92, i64 0}
!104 = !DILocation(line: 19, column: 9, scope: !10)
!105 = !DILocation(line: 20, column: 9, scope: !101)
!106 = !DILocation(line: 21, column: 12, scope: !107)
!107 = distinct !DILexicalBlock(scope: !10, file: !11, line: 21, column: 5)
!108 = !DILocation(line: 21, column: 10, scope: !107)
!109 = !DILocation(line: 21, column: 17, scope: !110)
!110 = !DILexicalBlockFile(scope: !111, file: !11, discriminator: 2)
!111 = !DILexicalBlockFile(scope: !112, file: !11, discriminator: 1)
!112 = distinct !DILexicalBlock(scope: !107, file: !11, line: 21, column: 5)
!113 = !DILocation(line: 21, column: 21, scope: !112)
!114 = !DILocation(line: 21, column: 24, scope: !112)
!115 = !{!116, !103, i64 0}
