; ModuleID = 'irs-onlybc/floatobject.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !16, subprograms: !397, globals: !959)
!1 = !DIFile(filename: "floatobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 1567, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Objects/floatobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "unknown_format", value: 0)
!7 = !DIEnumerator(name: "ieee_big_endian_format", value: 1)
!8 = !DIEnumerator(name: "ieee_little_endian_format", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !10, line: 451, size: 32, align: 32, elements: !11)
!10 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!11 = !{!12, !13, !14, !15}
!12 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!13 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!14 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!15 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!16 = !{!17, !18, !56, !364, !372, !373, !359, !48, !374, !70, !371, !41, !39, !112, !62, !375, !377, !46, !379}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !20, line: 33, baseType: !21)
!20 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!21 = !DICompositeType(tag: DW_TAG_structure_type, file: !20, line: 25, size: 256, align: 64, elements: !22)
!22 = !{!23, !362}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !21, file: !20, line: 26, baseType: !24, size: 192, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !25, line: 114, baseType: !26)
!25 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!26 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 111, size: 192, align: 64, elements: !27)
!27 = !{!28, !361}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !26, file: !25, line: 112, baseType: !29, size: 128, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !25, line: 109, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !25, line: 105, size: 128, align: 64, elements: !31)
!31 = !{!32, !40}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !30, file: !25, line: 107, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !34, line: 177, baseType: !35)
!34 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !36, line: 102, baseType: !37)
!36 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !38, line: 181, baseType: !39)
!38 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!39 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !30, file: !25, line: 108, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !25, line: 334, size: 3200, align: 64, elements: !43)
!43 = !{!44, !45, !49, !50, !51, !57, !120, !125, !130, !131, !136, !188, !219, !231, !237, !238, !239, !241, !243, !274, !275, !276, !285, !286, !291, !292, !294, !296, !306, !309, !327, !328, !329, !331, !333, !334, !336, !341, !346, !351, !352, !353, !354, !355, !356, !357, !358, !360}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !42, file: !25, line: 335, baseType: !24, size: 192, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !42, file: !25, line: 336, baseType: !46, size: 64, align: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !42, file: !25, line: 337, baseType: !33, size: 64, align: 64, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !42, file: !25, line: 337, baseType: !33, size: 64, align: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !42, file: !25, line: 341, baseType: !52, size: 64, align: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !25, line: 308, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{null, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !42, file: !25, line: 342, baseType: !58, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !25, line: 314, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !56, !63, !62}
!62 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !36, line: 48, baseType: !65)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !66, line: 246, size: 1728, align: 64, elements: !67)
!66 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!67 = !{!68, !69, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !89, !90, !91, !92, !94, !96, !98, !102, !105, !107, !108, !109, !110, !111, !115, !116}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !65, file: !66, line: 247, baseType: !62, size: 32, align: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !65, file: !66, line: 252, baseType: !70, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !65, file: !66, line: 253, baseType: !70, size: 64, align: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !65, file: !66, line: 254, baseType: !70, size: 64, align: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !65, file: !66, line: 255, baseType: !70, size: 64, align: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !65, file: !66, line: 256, baseType: !70, size: 64, align: 64, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !65, file: !66, line: 257, baseType: !70, size: 64, align: 64, offset: 384)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !65, file: !66, line: 258, baseType: !70, size: 64, align: 64, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !65, file: !66, line: 259, baseType: !70, size: 64, align: 64, offset: 512)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !65, file: !66, line: 261, baseType: !70, size: 64, align: 64, offset: 576)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !65, file: !66, line: 262, baseType: !70, size: 64, align: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !65, file: !66, line: 263, baseType: !70, size: 64, align: 64, offset: 704)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !65, file: !66, line: 265, baseType: !82, size: 64, align: 64, offset: 768)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !66, line: 161, size: 192, align: 64, elements: !84)
!84 = !{!85, !86, !88}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !83, file: !66, line: 162, baseType: !82, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !83, file: !66, line: 163, baseType: !87, size: 64, align: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !83, file: !66, line: 167, baseType: !62, size: 32, align: 32, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !65, file: !66, line: 267, baseType: !87, size: 64, align: 64, offset: 832)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !65, file: !66, line: 269, baseType: !62, size: 32, align: 32, offset: 896)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !65, file: !66, line: 273, baseType: !62, size: 32, align: 32, offset: 928)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !65, file: !66, line: 275, baseType: !93, size: 64, align: 64, offset: 960)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !38, line: 140, baseType: !39)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !65, file: !66, line: 279, baseType: !95, size: 16, align: 16, offset: 1024)
!95 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !65, file: !66, line: 280, baseType: !97, size: 8, align: 8, offset: 1040)
!97 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !65, file: !66, line: 281, baseType: !99, size: 8, align: 8, offset: 1048)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 1)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !65, file: !66, line: 285, baseType: !103, size: 64, align: 64, offset: 1088)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !66, line: 155, baseType: null)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !65, file: !66, line: 294, baseType: !106, size: 64, align: 64, offset: 1152)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !38, line: 141, baseType: !39)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !65, file: !66, line: 303, baseType: !17, size: 64, align: 64, offset: 1216)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !65, file: !66, line: 304, baseType: !17, size: 64, align: 64, offset: 1280)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !65, file: !66, line: 305, baseType: !17, size: 64, align: 64, offset: 1344)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !65, file: !66, line: 306, baseType: !17, size: 64, align: 64, offset: 1408)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !65, file: !66, line: 307, baseType: !112, size: 64, align: 64, offset: 1472)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !113, line: 62, baseType: !114)
!113 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!114 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !65, file: !66, line: 309, baseType: !62, size: 32, align: 32, offset: 1536)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !65, file: !66, line: 311, baseType: !117, size: 160, align: 8, offset: 1568)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 160, align: 8, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 20)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !42, file: !25, line: 343, baseType: !121, size: 64, align: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !25, line: 316, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!56, !56, !70}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !42, file: !25, line: 344, baseType: !126, size: 64, align: 64, offset: 576)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !25, line: 318, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!62, !56, !70, !56}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !42, file: !25, line: 345, baseType: !17, size: 64, align: 64, offset: 640)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !42, file: !25, line: 346, baseType: !132, size: 64, align: 64, offset: 704)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !25, line: 320, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!56, !56}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !42, file: !25, line: 350, baseType: !137, size: 64, align: 64, offset: 768)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !25, line: 278, baseType: !139)
!139 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 236, size: 2176, align: 64, elements: !140)
!140 = !{!141, !146, !147, !148, !149, !150, !155, !157, !158, !159, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !139, file: !25, line: 241, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !25, line: 166, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!56, !56, !56}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !139, file: !25, line: 242, baseType: !142, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !139, file: !25, line: 243, baseType: !142, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !139, file: !25, line: 244, baseType: !142, size: 64, align: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !139, file: !25, line: 245, baseType: !142, size: 64, align: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !139, file: !25, line: 246, baseType: !151, size: 64, align: 64, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !25, line: 167, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!56, !56, !56, !56}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !139, file: !25, line: 247, baseType: !156, size: 64, align: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !25, line: 165, baseType: !133)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !139, file: !25, line: 248, baseType: !156, size: 64, align: 64, offset: 448)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !139, file: !25, line: 249, baseType: !156, size: 64, align: 64, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !139, file: !25, line: 250, baseType: !160, size: 64, align: 64, offset: 576)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !25, line: 168, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!62, !56}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !139, file: !25, line: 251, baseType: !156, size: 64, align: 64, offset: 640)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !139, file: !25, line: 252, baseType: !142, size: 64, align: 64, offset: 704)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !139, file: !25, line: 253, baseType: !142, size: 64, align: 64, offset: 768)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !139, file: !25, line: 254, baseType: !142, size: 64, align: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !139, file: !25, line: 255, baseType: !142, size: 64, align: 64, offset: 896)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !139, file: !25, line: 256, baseType: !142, size: 64, align: 64, offset: 960)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !139, file: !25, line: 257, baseType: !156, size: 64, align: 64, offset: 1024)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !139, file: !25, line: 258, baseType: !17, size: 64, align: 64, offset: 1088)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !139, file: !25, line: 259, baseType: !156, size: 64, align: 64, offset: 1152)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !139, file: !25, line: 261, baseType: !142, size: 64, align: 64, offset: 1216)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !139, file: !25, line: 262, baseType: !142, size: 64, align: 64, offset: 1280)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !139, file: !25, line: 263, baseType: !142, size: 64, align: 64, offset: 1344)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !139, file: !25, line: 264, baseType: !142, size: 64, align: 64, offset: 1408)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !139, file: !25, line: 265, baseType: !151, size: 64, align: 64, offset: 1472)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !139, file: !25, line: 266, baseType: !142, size: 64, align: 64, offset: 1536)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !139, file: !25, line: 267, baseType: !142, size: 64, align: 64, offset: 1600)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !139, file: !25, line: 268, baseType: !142, size: 64, align: 64, offset: 1664)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !139, file: !25, line: 269, baseType: !142, size: 64, align: 64, offset: 1728)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !139, file: !25, line: 270, baseType: !142, size: 64, align: 64, offset: 1792)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !139, file: !25, line: 272, baseType: !142, size: 64, align: 64, offset: 1856)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !139, file: !25, line: 273, baseType: !142, size: 64, align: 64, offset: 1920)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !139, file: !25, line: 274, baseType: !142, size: 64, align: 64, offset: 1984)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !139, file: !25, line: 275, baseType: !142, size: 64, align: 64, offset: 2048)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !139, file: !25, line: 277, baseType: !156, size: 64, align: 64, offset: 2112)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !42, file: !25, line: 351, baseType: !189, size: 64, align: 64, offset: 832)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !25, line: 292, baseType: !191)
!191 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 280, size: 640, align: 64, elements: !192)
!192 = !{!193, !198, !199, !204, !205, !206, !211, !212, !217, !218}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !191, file: !25, line: 281, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !25, line: 169, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!33, !56}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !191, file: !25, line: 282, baseType: !142, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !191, file: !25, line: 283, baseType: !200, size: 64, align: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !25, line: 170, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!56, !56, !33}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !191, file: !25, line: 284, baseType: !200, size: 64, align: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !191, file: !25, line: 285, baseType: !17, size: 64, align: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !191, file: !25, line: 286, baseType: !207, size: 64, align: 64, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !25, line: 172, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!62, !56, !33, !56}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !191, file: !25, line: 287, baseType: !17, size: 64, align: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !191, file: !25, line: 288, baseType: !213, size: 64, align: 64, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !25, line: 231, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!62, !56, !56}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !191, file: !25, line: 290, baseType: !142, size: 64, align: 64, offset: 512)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !191, file: !25, line: 291, baseType: !200, size: 64, align: 64, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !42, file: !25, line: 352, baseType: !220, size: 64, align: 64, offset: 896)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !25, line: 298, baseType: !222)
!222 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 294, size: 192, align: 64, elements: !223)
!223 = !{!224, !225, !226}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !222, file: !25, line: 295, baseType: !194, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !222, file: !25, line: 296, baseType: !142, size: 64, align: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !222, file: !25, line: 297, baseType: !227, size: 64, align: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !25, line: 174, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!62, !56, !56, !56}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !42, file: !25, line: 356, baseType: !232, size: 64, align: 64, offset: 960)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !25, line: 321, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!236, !56}
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !34, line: 186, baseType: !33)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !42, file: !25, line: 357, baseType: !151, size: 64, align: 64, offset: 1024)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !42, file: !25, line: 358, baseType: !132, size: 64, align: 64, offset: 1088)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !42, file: !25, line: 359, baseType: !240, size: 64, align: 64, offset: 1152)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !25, line: 317, baseType: !143)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !42, file: !25, line: 360, baseType: !242, size: 64, align: 64, offset: 1216)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !25, line: 319, baseType: !228)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !42, file: !25, line: 363, baseType: !244, size: 64, align: 64, offset: 1280)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !25, line: 304, baseType: !246)
!246 = !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 301, size: 128, align: 64, elements: !247)
!247 = !{!248, !269}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !246, file: !25, line: 302, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !25, line: 193, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!62, !56, !253, !62}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !25, line: 191, baseType: !255)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !25, line: 178, size: 640, align: 64, elements: !256)
!256 = !{!257, !258, !259, !260, !261, !262, !263, !264, !266, !267, !268}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !255, file: !25, line: 179, baseType: !17, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !255, file: !25, line: 180, baseType: !56, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !255, file: !25, line: 181, baseType: !33, size: 64, align: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !255, file: !25, line: 182, baseType: !33, size: 64, align: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !255, file: !25, line: 184, baseType: !62, size: 32, align: 32, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !255, file: !25, line: 185, baseType: !62, size: 32, align: 32, offset: 288)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !255, file: !25, line: 186, baseType: !70, size: 64, align: 64, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !255, file: !25, line: 187, baseType: !265, size: 64, align: 64, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !255, file: !25, line: 188, baseType: !265, size: 64, align: 64, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !255, file: !25, line: 189, baseType: !265, size: 64, align: 64, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !255, file: !25, line: 190, baseType: !17, size: 64, align: 64, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !246, file: !25, line: 303, baseType: !270, size: 64, align: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !25, line: 194, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !56, !253}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !42, file: !25, line: 366, baseType: !114, size: 64, align: 64, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !42, file: !25, line: 368, baseType: !46, size: 64, align: 64, offset: 1408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !42, file: !25, line: 372, baseType: !277, size: 64, align: 64, offset: 1472)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !25, line: 233, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!62, !56, !281, !17}
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !25, line: 232, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!62, !56, !17}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !42, file: !25, line: 375, baseType: !160, size: 64, align: 64, offset: 1536)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !42, file: !25, line: 379, baseType: !287, size: 64, align: 64, offset: 1600)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !25, line: 322, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!56, !56, !56, !62}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !42, file: !25, line: 382, baseType: !33, size: 64, align: 64, offset: 1664)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !42, file: !25, line: 385, baseType: !293, size: 64, align: 64, offset: 1728)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !25, line: 323, baseType: !133)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !42, file: !25, line: 386, baseType: !295, size: 64, align: 64, offset: 1792)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !25, line: 324, baseType: !133)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !42, file: !25, line: 389, baseType: !297, size: 64, align: 64, offset: 1856)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !299, line: 40, size: 256, align: 64, elements: !300)
!299 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!300 = !{!301, !302, !304, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !298, file: !299, line: 41, baseType: !46, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !298, file: !299, line: 42, baseType: !303, size: 64, align: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !299, line: 18, baseType: !143)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !298, file: !299, line: 43, baseType: !62, size: 32, align: 32, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !298, file: !299, line: 45, baseType: !46, size: 64, align: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !42, file: !25, line: 390, baseType: !307, size: 64, align: 64, offset: 1920)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !25, line: 390, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !42, file: !25, line: 391, baseType: !310, size: 64, align: 64, offset: 1984)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !312, line: 11, size: 320, align: 64, elements: !313)
!312 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!313 = !{!314, !315, !320, !325, !326}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !311, file: !312, line: 12, baseType: !70, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !311, file: !312, line: 13, baseType: !316, size: 64, align: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !312, line: 8, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!56, !56, !17}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !311, file: !312, line: 14, baseType: !321, size: 64, align: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !312, line: 9, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!62, !56, !56, !17}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !311, file: !312, line: 15, baseType: !70, size: 64, align: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !311, file: !312, line: 16, baseType: !17, size: 64, align: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !42, file: !25, line: 392, baseType: !41, size: 64, align: 64, offset: 2048)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !42, file: !25, line: 393, baseType: !56, size: 64, align: 64, offset: 2112)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !42, file: !25, line: 394, baseType: !330, size: 64, align: 64, offset: 2176)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !25, line: 325, baseType: !152)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !42, file: !25, line: 395, baseType: !332, size: 64, align: 64, offset: 2240)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !25, line: 326, baseType: !228)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !42, file: !25, line: 396, baseType: !33, size: 64, align: 64, offset: 2304)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !42, file: !25, line: 397, baseType: !335, size: 64, align: 64, offset: 2368)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !25, line: 327, baseType: !228)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !42, file: !25, line: 398, baseType: !337, size: 64, align: 64, offset: 2432)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !25, line: 329, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64, align: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{!56, !41, !33}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !42, file: !25, line: 399, baseType: !342, size: 64, align: 64, offset: 2496)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !25, line: 328, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!56, !41, !56, !56}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !42, file: !25, line: 400, baseType: !347, size: 64, align: 64, offset: 2560)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !25, line: 307, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !17}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !42, file: !25, line: 401, baseType: !160, size: 64, align: 64, offset: 2624)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !42, file: !25, line: 402, baseType: !56, size: 64, align: 64, offset: 2688)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !42, file: !25, line: 403, baseType: !56, size: 64, align: 64, offset: 2752)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !42, file: !25, line: 404, baseType: !56, size: 64, align: 64, offset: 2816)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !42, file: !25, line: 405, baseType: !56, size: 64, align: 64, offset: 2880)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !42, file: !25, line: 406, baseType: !56, size: 64, align: 64, offset: 2944)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !42, file: !25, line: 407, baseType: !52, size: 64, align: 64, offset: 3008)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !42, file: !25, line: 410, baseType: !359, size: 32, align: 32, offset: 3072)
!359 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !42, file: !25, line: 412, baseType: !52, size: 64, align: 64, offset: 3136)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !26, file: !25, line: 113, baseType: !33, size: 64, align: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !21, file: !20, line: 27, baseType: !363, size: 64, align: 64, offset: 192)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 64, align: 64, elements: !100)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFloatObject", file: !366, line: 18, baseType: !367)
!366 = !DIFile(filename: "Include/floatobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!367 = !DICompositeType(tag: DW_TAG_structure_type, file: !366, line: 15, size: 192, align: 64, elements: !368)
!368 = !{!369, !370}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !367, file: !366, line: 16, baseType: !29, size: 128, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ob_fval", scope: !367, file: !366, line: 17, baseType: !371, size: 64, align: 64, offset: 128)
!371 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!372 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!374 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !10, line: 351, baseType: !381)
!381 = !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 217, size: 384, align: 64, elements: !382)
!382 = !{!383, !384, !385, !386, !394}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !381, file: !10, line: 291, baseType: !29, size: 128, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !381, file: !10, line: 292, baseType: !33, size: 64, align: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !381, file: !10, line: 293, baseType: !236, size: 64, align: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !381, file: !10, line: 349, baseType: !387, size: 32, align: 32, offset: 256)
!387 = !DICompositeType(tag: DW_TAG_structure_type, scope: !381, file: !10, line: 294, size: 32, align: 32, elements: !388)
!388 = !{!389, !390, !391, !392, !393}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !387, file: !10, line: 303, baseType: !359, size: 2, align: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !387, file: !10, line: 331, baseType: !359, size: 3, align: 32, offset: 2)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !387, file: !10, line: 336, baseType: !359, size: 1, align: 32, offset: 5)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !387, file: !10, line: 340, baseType: !359, size: 1, align: 32, offset: 6)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !387, file: !10, line: 345, baseType: !359, size: 1, align: 32, offset: 7)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !381, file: !10, line: 350, baseType: !395, size: 64, align: 64, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !113, line: 90, baseType: !62)
!397 = !{!398, !402, !403, !417, !423, !444, !454, !462, !467, !470, !475, !495, !512, !535, !557, !562, !569, !575, !584, !590, !596, !603, !612, !627, !630, !633, !636, !641, !650, !658, !664, !669, !716, !724, !745, !783, !810, !816, !830, !835, !840, !843, !868, !913, !934, !938, !946}
!398 = !DISubprogram(name: "PyFloat_GetMax", scope: !4, file: !4, line: 25, type: !399, isLocal: false, isDefinition: true, scopeLine: 26, flags: DIFlagPrototyped, isOptimized: true, function: double ()* @PyFloat_GetMax, variables: !401)
!399 = !DISubroutineType(types: !400)
!400 = !{!371}
!401 = !{}
!402 = !DISubprogram(name: "PyFloat_GetMin", scope: !4, file: !4, line: 31, type: !399, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, function: double ()* @PyFloat_GetMin, variables: !401)
!403 = !DISubprogram(name: "PyFloat_GetInfo", scope: !4, file: !4, line: 73, type: !404, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyFloat_GetInfo, variables: !406)
!404 = !DISubroutineType(types: !405)
!405 = !{!56}
!406 = !{!407, !408, !409, !413}
!407 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "floatinfo", scope: !403, file: !4, line: 75, type: !56)
!408 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !403, file: !4, line: 76, type: !62)
!409 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !410, file: !4, line: 103, type: !56)
!410 = distinct !DILexicalBlock(scope: !411, file: !4, line: 103, column: 12)
!411 = distinct !DILexicalBlock(scope: !412, file: !4, line: 102, column: 27)
!412 = distinct !DILexicalBlock(scope: !403, file: !4, line: 102, column: 9)
!413 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !414, file: !4, line: 103, type: !56)
!414 = distinct !DILexicalBlock(scope: !415, file: !4, line: 103, column: 117)
!415 = distinct !DILexicalBlock(scope: !416, file: !4, line: 103, column: 86)
!416 = distinct !DILexicalBlock(scope: !410, file: !4, line: 103, column: 63)
!417 = !DISubprogram(name: "PyFloat_FromDouble", scope: !4, file: !4, line: 110, type: !418, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (double)* @PyFloat_FromDouble, variables: !420)
!418 = !DISubroutineType(types: !419)
!419 = !{!56, !371}
!420 = !{!421, !422}
!421 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fval", arg: 1, scope: !417, file: !4, line: 110, type: !371)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !417, file: !4, line: 112, type: !364)
!423 = !DISubprogram(name: "PyFloat_FromString", scope: !4, file: !4, line: 128, type: !134, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyFloat_FromString, variables: !424)
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433, !439, !441}
!425 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !423, file: !4, line: 128, type: !56)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !423, file: !4, line: 130, type: !46)
!427 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "last", scope: !423, file: !4, line: 130, type: !46)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !423, file: !4, line: 130, type: !46)
!429 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !423, file: !4, line: 131, type: !371)
!430 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s_buffer", scope: !423, file: !4, line: 132, type: !56)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !423, file: !4, line: 133, type: !33)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !423, file: !4, line: 134, type: !56)
!433 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !434, file: !4, line: 142, type: !56)
!434 = distinct !DILexicalBlock(scope: !435, file: !4, line: 142, column: 16)
!435 = distinct !DILexicalBlock(scope: !436, file: !4, line: 141, column: 30)
!436 = distinct !DILexicalBlock(scope: !437, file: !4, line: 141, column: 13)
!437 = distinct !DILexicalBlock(scope: !438, file: !4, line: 136, column: 75)
!438 = distinct !DILexicalBlock(scope: !423, file: !4, line: 136, column: 9)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !440, file: !4, line: 173, type: !56)
!440 = distinct !DILexicalBlock(scope: !423, file: !4, line: 173, column: 8)
!441 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !442, file: !4, line: 173, type: !56)
!442 = distinct !DILexicalBlock(scope: !443, file: !4, line: 173, column: 100)
!443 = distinct !DILexicalBlock(scope: !440, file: !4, line: 173, column: 66)
!444 = !DISubprogram(name: "PyFloat_AsDouble", scope: !4, file: !4, line: 194, type: !445, isLocal: false, isDefinition: true, scopeLine: 195, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct._object*)* @PyFloat_AsDouble, variables: !447)
!445 = !DISubroutineType(types: !446)
!446 = !{!371, !56}
!447 = !{!448, !449, !450, !451, !452}
!448 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !444, file: !4, line: 194, type: !56)
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nb", scope: !444, file: !4, line: 196, type: !137)
!450 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fo", scope: !444, file: !4, line: 197, type: !364)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !444, file: !4, line: 198, type: !371)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !453, file: !4, line: 223, type: !56)
!453 = distinct !DILexicalBlock(scope: !444, file: !4, line: 223, column: 8)
!454 = !DISubprogram(name: "_PyFloat_Init", scope: !4, file: !4, line: 1858, type: !455, isLocal: false, isDefinition: true, scopeLine: 1859, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @_PyFloat_Init, variables: !457)
!455 = !DISubroutineType(types: !456)
!456 = !{!62}
!457 = !{!458, !460}
!458 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !459, file: !4, line: 1877, type: !371)
!459 = distinct !DILexicalBlock(scope: !454, file: !4, line: 1876, column: 5)
!460 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !461, file: !4, line: 1891, type: !374)
!461 = distinct !DILexicalBlock(scope: !454, file: !4, line: 1890, column: 5)
!462 = !DISubprogram(name: "PyFloat_ClearFreeList", scope: !4, file: !4, line: 1915, type: !455, isLocal: false, isDefinition: true, scopeLine: 1916, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @PyFloat_ClearFreeList, variables: !463)
!463 = !{!464, !465, !466}
!464 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !462, file: !4, line: 1917, type: !364)
!465 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next", scope: !462, file: !4, line: 1917, type: !364)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !462, file: !4, line: 1918, type: !62)
!467 = !DISubprogram(name: "PyFloat_Fini", scope: !4, file: !4, line: 1930, type: !468, isLocal: false, isDefinition: true, scopeLine: 1931, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyFloat_Fini, variables: !401)
!468 = !DISubroutineType(types: !469)
!469 = !{null}
!470 = !DISubprogram(name: "_PyFloat_DebugMallocStats", scope: !4, file: !4, line: 1937, type: !471, isLocal: false, isDefinition: true, scopeLine: 1938, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IO_FILE*)* @_PyFloat_DebugMallocStats, variables: !473)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !63}
!473 = !{!474}
!474 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !470, file: !4, line: 1937, type: !63)
!475 = !DISubprogram(name: "_PyFloat_Pack4", scope: !4, file: !4, line: 1949, type: !476, isLocal: false, isDefinition: true, scopeLine: 1950, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double, i8*, i32)* @_PyFloat_Pack4, variables: !479)
!476 = !DISubroutineType(types: !477)
!477 = !{!62, !371, !478, !62}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!479 = !{!480, !481, !482, !483, !486, !487, !488, !489, !490, !492, !493, !494}
!480 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !475, file: !4, line: 1949, type: !371)
!481 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !475, file: !4, line: 1949, type: !478)
!482 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "le", arg: 3, scope: !475, file: !4, line: 1949, type: !62)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !484, file: !4, line: 1952, type: !372)
!484 = distinct !DILexicalBlock(scope: !485, file: !4, line: 1951, column: 41)
!485 = distinct !DILexicalBlock(scope: !475, file: !4, line: 1951, column: 9)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !484, file: !4, line: 1953, type: !62)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !484, file: !4, line: 1954, type: !371)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fbits", scope: !484, file: !4, line: 1955, type: !359)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "incr", scope: !484, file: !4, line: 1956, type: !62)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !491, file: !4, line: 2028, type: !374)
!491 = distinct !DILexicalBlock(scope: !485, file: !4, line: 2027, column: 10)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !491, file: !4, line: 2029, type: !46)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !491, file: !4, line: 2030, type: !62)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "incr", scope: !491, file: !4, line: 2030, type: !62)
!495 = !DISubprogram(name: "_PyFloat_Pack8", scope: !4, file: !4, line: 2054, type: !476, isLocal: false, isDefinition: true, scopeLine: 2055, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double, i8*, i32)* @_PyFloat_Pack8, variables: !496)
!496 = !{!497, !498, !499, !500, !503, !504, !505, !506, !507, !508, !510, !511}
!497 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !495, file: !4, line: 2054, type: !371)
!498 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !495, file: !4, line: 2054, type: !478)
!499 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "le", arg: 3, scope: !495, file: !4, line: 2054, type: !62)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !501, file: !4, line: 2057, type: !372)
!501 = distinct !DILexicalBlock(scope: !502, file: !4, line: 2056, column: 42)
!502 = distinct !DILexicalBlock(scope: !495, file: !4, line: 2056, column: 9)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !501, file: !4, line: 2058, type: !62)
!504 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !501, file: !4, line: 2059, type: !371)
!505 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fhi", scope: !501, file: !4, line: 2060, type: !359)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flo", scope: !501, file: !4, line: 2060, type: !359)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "incr", scope: !501, file: !4, line: 2061, type: !62)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !509, file: !4, line: 2165, type: !46)
!509 = distinct !DILexicalBlock(scope: !502, file: !4, line: 2164, column: 10)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !509, file: !4, line: 2166, type: !62)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "incr", scope: !509, file: !4, line: 2166, type: !62)
!512 = !DISubprogram(name: "_PyFloat_Unpack4", scope: !4, file: !4, line: 2183, type: !513, isLocal: false, isDefinition: true, scopeLine: 2184, flags: DIFlagPrototyped, isOptimized: true, function: double (i8*, i32)* @_PyFloat_Unpack4, variables: !515)
!513 = !DISubroutineType(types: !514)
!514 = !{!371, !377, !62}
!515 = !{!516, !517, !518, !521, !522, !523, !524, !525, !527, !533, !534}
!516 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !512, file: !4, line: 2183, type: !377)
!517 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "le", arg: 2, scope: !512, file: !4, line: 2183, type: !62)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !519, file: !4, line: 2186, type: !372)
!519 = distinct !DILexicalBlock(scope: !520, file: !4, line: 2185, column: 41)
!520 = distinct !DILexicalBlock(scope: !512, file: !4, line: 2185, column: 9)
!521 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !519, file: !4, line: 2187, type: !62)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !519, file: !4, line: 2188, type: !359)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !519, file: !4, line: 2189, type: !371)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "incr", scope: !519, file: !4, line: 2190, type: !62)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !526, file: !4, line: 2239, type: !374)
!526 = distinct !DILexicalBlock(scope: !520, file: !4, line: 2238, column: 10)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !528, file: !4, line: 2243, type: !530)
!528 = distinct !DILexicalBlock(scope: !529, file: !4, line: 2242, column: 64)
!529 = distinct !DILexicalBlock(scope: !526, file: !4, line: 2241, column: 13)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 32, align: 8, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 4)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !528, file: !4, line: 2244, type: !70)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !528, file: !4, line: 2245, type: !62)
!535 = !DISubprogram(name: "_PyFloat_Unpack8", scope: !4, file: !4, line: 2261, type: !513, isLocal: false, isDefinition: true, scopeLine: 2262, flags: DIFlagPrototyped, isOptimized: true, function: double (i8*, i32)* @_PyFloat_Unpack8, variables: !536)
!536 = !{!537, !538, !539, !542, !543, !544, !545, !546, !547, !549, !555, !556}
!537 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !535, file: !4, line: 2261, type: !377)
!538 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "le", arg: 2, scope: !535, file: !4, line: 2261, type: !62)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !540, file: !4, line: 2264, type: !372)
!540 = distinct !DILexicalBlock(scope: !541, file: !4, line: 2263, column: 42)
!541 = distinct !DILexicalBlock(scope: !535, file: !4, line: 2263, column: 9)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !540, file: !4, line: 2265, type: !62)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fhi", scope: !540, file: !4, line: 2266, type: !359)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flo", scope: !540, file: !4, line: 2266, type: !359)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !540, file: !4, line: 2267, type: !371)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "incr", scope: !540, file: !4, line: 2268, type: !62)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !548, file: !4, line: 2334, type: !371)
!548 = distinct !DILexicalBlock(scope: !541, file: !4, line: 2333, column: 10)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !550, file: !4, line: 2338, type: !552)
!550 = distinct !DILexicalBlock(scope: !551, file: !4, line: 2337, column: 65)
!551 = distinct !DILexicalBlock(scope: !548, file: !4, line: 2336, column: 13)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, align: 8, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 8)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !550, file: !4, line: 2339, type: !70)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !550, file: !4, line: 2340, type: !62)
!557 = !DISubprogram(name: "float_dealloc", scope: !4, file: !4, line: 178, type: !558, isLocal: true, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.PyFloatObject*)* @float_dealloc, variables: !560)
!558 = !DISubroutineType(types: !559)
!559 = !{null, !364}
!560 = !{!561}
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !557, file: !4, line: 178, type: !364)
!562 = !DISubprogram(name: "float_repr", scope: !4, file: !4, line: 263, type: !563, isLocal: true, isDefinition: true, scopeLine: 264, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyFloatObject*)* @float_repr, variables: !565)
!563 = !DISubroutineType(types: !564)
!564 = !{!56, !364}
!565 = !{!566, !567, !568}
!566 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !562, file: !4, line: 263, type: !364)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !562, file: !4, line: 265, type: !56)
!568 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !562, file: !4, line: 266, type: !70)
!569 = !DISubprogram(name: "float_add", scope: !4, file: !4, line: 488, type: !144, isLocal: true, isDefinition: true, scopeLine: 489, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @float_add, variables: !570)
!570 = !{!571, !572, !573, !574}
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !569, file: !4, line: 488, type: !56)
!572 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !569, file: !4, line: 488, type: !56)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !569, file: !4, line: 490, type: !371)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !569, file: !4, line: 490, type: !371)
!575 = !DISubprogram(name: "convert_to_double", scope: !4, file: !4, line: 243, type: !576, isLocal: true, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object**, double*)* @convert_to_double, variables: !580)
!576 = !DISubroutineType(types: !577)
!577 = !{!62, !578, !579}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!580 = !{!581, !582, !583}
!581 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !575, file: !4, line: 243, type: !578)
!582 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dbl", arg: 2, scope: !575, file: !4, line: 243, type: !579)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "obj", scope: !575, file: !4, line: 245, type: !56)
!584 = !DISubprogram(name: "float_sub", scope: !4, file: !4, line: 500, type: !144, isLocal: true, isDefinition: true, scopeLine: 501, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @float_sub, variables: !585)
!585 = !{!586, !587, !588, !589}
!586 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !584, file: !4, line: 500, type: !56)
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !584, file: !4, line: 500, type: !56)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !584, file: !4, line: 502, type: !371)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !584, file: !4, line: 502, type: !371)
!590 = !DISubprogram(name: "float_mul", scope: !4, file: !4, line: 512, type: !144, isLocal: true, isDefinition: true, scopeLine: 513, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @float_mul, variables: !591)
!591 = !{!592, !593, !594, !595}
!592 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !590, file: !4, line: 512, type: !56)
!593 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !590, file: !4, line: 512, type: !56)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !590, file: !4, line: 514, type: !371)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !590, file: !4, line: 514, type: !371)
!596 = !DISubprogram(name: "float_rem", scope: !4, file: !4, line: 541, type: !144, isLocal: true, isDefinition: true, scopeLine: 542, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @float_rem, variables: !597)
!597 = !{!598, !599, !600, !601, !602}
!598 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !596, file: !4, line: 541, type: !56)
!599 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !596, file: !4, line: 541, type: !56)
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vx", scope: !596, file: !4, line: 543, type: !371)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wx", scope: !596, file: !4, line: 543, type: !371)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !596, file: !4, line: 544, type: !371)
!603 = !DISubprogram(name: "float_divmod", scope: !4, file: !4, line: 571, type: !144, isLocal: true, isDefinition: true, scopeLine: 572, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @float_divmod, variables: !604)
!604 = !{!605, !606, !607, !608, !609, !610, !611}
!605 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !603, file: !4, line: 571, type: !56)
!606 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !603, file: !4, line: 571, type: !56)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vx", scope: !603, file: !4, line: 573, type: !371)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wx", scope: !603, file: !4, line: 573, type: !371)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "div", scope: !603, file: !4, line: 574, type: !371)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !603, file: !4, line: 574, type: !371)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "floordiv", scope: !603, file: !4, line: 574, type: !371)
!612 = !DISubprogram(name: "float_pow", scope: !4, file: !4, line: 637, type: !153, isLocal: true, isDefinition: true, scopeLine: 638, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, %struct._object*)* @float_pow, variables: !613)
!613 = !{!614, !615, !616, !617, !618, !619, !620, !621, !624}
!614 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !612, file: !4, line: 637, type: !56)
!615 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !612, file: !4, line: 637, type: !56)
!616 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "z", arg: 3, scope: !612, file: !4, line: 637, type: !56)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iv", scope: !612, file: !4, line: 639, type: !371)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iw", scope: !612, file: !4, line: 639, type: !371)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ix", scope: !612, file: !4, line: 639, type: !371)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "negate_result", scope: !612, file: !4, line: 640, type: !62)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iw_is_odd", scope: !622, file: !4, line: 681, type: !62)
!622 = distinct !DILexicalBlock(scope: !623, file: !4, line: 676, column: 122)
!623 = distinct !DILexicalBlock(scope: !612, file: !4, line: 676, column: 9)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iw_is_odd", scope: !625, file: !4, line: 691, type: !62)
!625 = distinct !DILexicalBlock(scope: !626, file: !4, line: 688, column: 20)
!626 = distinct !DILexicalBlock(scope: !612, file: !4, line: 688, column: 9)
!627 = !DISubprogram(name: "float_neg", scope: !4, file: !4, line: 761, type: !563, isLocal: true, isDefinition: true, scopeLine: 762, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyFloatObject*)* @float_neg, variables: !628)
!628 = !{!629}
!629 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !627, file: !4, line: 761, type: !364)
!630 = !DISubprogram(name: "float_float", scope: !4, file: !4, line: 1019, type: !134, isLocal: true, isDefinition: true, scopeLine: 1020, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @float_float, variables: !631)
!631 = !{!632}
!632 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !630, file: !4, line: 1019, type: !56)
!633 = !DISubprogram(name: "float_abs", scope: !4, file: !4, line: 767, type: !563, isLocal: true, isDefinition: true, scopeLine: 768, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyFloatObject*)* @float_abs, variables: !634)
!634 = !{!635}
!635 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !633, file: !4, line: 767, type: !364)
!636 = !DISubprogram(name: "float_bool", scope: !4, file: !4, line: 773, type: !637, isLocal: true, isDefinition: true, scopeLine: 774, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyFloatObject*)* @float_bool, variables: !639)
!637 = !DISubroutineType(types: !638)
!638 = !{!62, !364}
!639 = !{!640}
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !636, file: !4, line: 773, type: !364)
!641 = !DISubprogram(name: "float_trunc", scope: !4, file: !4, line: 831, type: !134, isLocal: true, isDefinition: true, scopeLine: 832, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @float_trunc, variables: !642)
!642 = !{!643, !644, !645, !646}
!643 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !641, file: !4, line: 831, type: !56)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !641, file: !4, line: 833, type: !371)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wholepart", scope: !641, file: !4, line: 834, type: !371)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "aslong", scope: !647, file: !4, line: 850, type: !649)
!647 = distinct !DILexicalBlock(scope: !648, file: !4, line: 849, column: 86)
!648 = distinct !DILexicalBlock(scope: !641, file: !4, line: 849, column: 9)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!650 = !DISubprogram(name: "float_floor_div", scope: !4, file: !4, line: 618, type: !144, isLocal: true, isDefinition: true, scopeLine: 619, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @float_floor_div, variables: !651)
!651 = !{!652, !653, !654, !655, !656}
!652 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !650, file: !4, line: 618, type: !56)
!653 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !650, file: !4, line: 618, type: !56)
!654 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !650, file: !4, line: 620, type: !56)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !650, file: !4, line: 620, type: !56)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !657, file: !4, line: 628, type: !56)
!657 = distinct !DILexicalBlock(scope: !650, file: !4, line: 628, column: 8)
!658 = !DISubprogram(name: "float_div", scope: !4, file: !4, line: 524, type: !144, isLocal: true, isDefinition: true, scopeLine: 525, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @float_div, variables: !659)
!659 = !{!660, !661, !662, !663}
!660 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !658, file: !4, line: 524, type: !56)
!661 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !658, file: !4, line: 524, type: !56)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !658, file: !4, line: 526, type: !371)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !658, file: !4, line: 526, type: !371)
!664 = !DISubprogram(name: "float_hash", scope: !4, file: !4, line: 482, type: !665, isLocal: true, isDefinition: true, scopeLine: 483, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.PyFloatObject*)* @float_hash, variables: !667)
!665 = !DISubroutineType(types: !666)
!666 = !{!236, !364}
!667 = !{!668}
!668 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !664, file: !4, line: 482, type: !364)
!669 = !DISubprogram(name: "float_richcompare", scope: !4, file: !4, line: 295, type: !289, isLocal: true, isDefinition: true, scopeLine: 296, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*, i32)* @float_richcompare, variables: !670)
!670 = !{!671, !672, !673, !674, !675, !676, !677, !682, !683, !684, !685, !687, !688, !689, !690, !691, !692, !695, !697, !699, !701, !703, !706, !708, !711, !713}
!671 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !669, file: !4, line: 295, type: !56)
!672 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "w", arg: 2, scope: !669, file: !4, line: 295, type: !56)
!673 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 3, scope: !669, file: !4, line: 295, type: !62)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !669, file: !4, line: 297, type: !371)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !669, file: !4, line: 297, type: !371)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !669, file: !4, line: 298, type: !62)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vsign", scope: !678, file: !4, line: 321, type: !62)
!678 = distinct !DILexicalBlock(scope: !679, file: !4, line: 320, column: 80)
!679 = distinct !DILexicalBlock(scope: !680, file: !4, line: 320, column: 14)
!680 = distinct !DILexicalBlock(scope: !681, file: !4, line: 309, column: 14)
!681 = distinct !DILexicalBlock(scope: !669, file: !4, line: 306, column: 9)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wsign", scope: !678, file: !4, line: 322, type: !62)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbits", scope: !678, file: !4, line: 323, type: !112)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exponent", scope: !678, file: !4, line: 324, type: !62)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fracpart", scope: !686, file: !4, line: 388, type: !371)
!686 = distinct !DILexicalBlock(scope: !678, file: !4, line: 387, column: 9)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "intpart", scope: !686, file: !4, line: 389, type: !371)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !686, file: !4, line: 390, type: !56)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "one", scope: !686, file: !4, line: 391, type: !56)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vv", scope: !686, file: !4, line: 392, type: !56)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ww", scope: !686, file: !4, line: 393, type: !56)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !693, file: !4, line: 412, type: !56)
!693 = distinct !DILexicalBlock(scope: !694, file: !4, line: 408, column: 34)
!694 = distinct !DILexicalBlock(scope: !686, file: !4, line: 408, column: 17)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !696, file: !4, line: 421, type: !56)
!696 = distinct !DILexicalBlock(scope: !693, file: !4, line: 421, column: 20)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !698, file: !4, line: 427, type: !56)
!698 = distinct !DILexicalBlock(scope: !693, file: !4, line: 427, column: 20)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !700, file: !4, line: 433, type: !56)
!700 = distinct !DILexicalBlock(scope: !693, file: !4, line: 433, column: 20)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !702, file: !4, line: 442, type: !56)
!702 = distinct !DILexicalBlock(scope: !686, file: !4, line: 442, column: 16)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !704, file: !4, line: 442, type: !56)
!704 = distinct !DILexicalBlock(scope: !705, file: !4, line: 442, column: 102)
!705 = distinct !DILexicalBlock(scope: !702, file: !4, line: 442, column: 68)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !707, file: !4, line: 443, type: !56)
!707 = distinct !DILexicalBlock(scope: !686, file: !4, line: 443, column: 16)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !709, file: !4, line: 443, type: !56)
!709 = distinct !DILexicalBlock(scope: !710, file: !4, line: 443, column: 102)
!710 = distinct !DILexicalBlock(scope: !707, file: !4, line: 443, column: 68)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !712, file: !4, line: 444, type: !56)
!712 = distinct !DILexicalBlock(scope: !686, file: !4, line: 444, column: 16)
!713 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !714, file: !4, line: 444, type: !56)
!714 = distinct !DILexicalBlock(scope: !715, file: !4, line: 444, column: 103)
!715 = distinct !DILexicalBlock(scope: !712, file: !4, line: 444, column: 69)
!716 = !DISubprogram(name: "float_round", scope: !4, file: !4, line: 973, type: !144, isLocal: true, isDefinition: true, scopeLine: 974, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @float_round, variables: !717)
!717 = !{!718, !719, !720, !721, !722, !723}
!718 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !716, file: !4, line: 973, type: !56)
!719 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !716, file: !4, line: 973, type: !56)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !716, file: !4, line: 975, type: !371)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rounded", scope: !716, file: !4, line: 975, type: !371)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o_ndigits", scope: !716, file: !4, line: 976, type: !56)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !716, file: !4, line: 977, type: !33)
!724 = !DISubprogram(name: "double_round", scope: !4, file: !4, line: 866, type: !725, isLocal: true, isDefinition: true, scopeLine: 866, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (double, i32)* @double_round, variables: !727)
!725 = !DISubroutineType(types: !726)
!726 = !{!56, !371, !62}
!727 = !{!728, !729, !730, !731, !732, !733, !734, !735, !739, !740, !741, !742, !743, !744}
!728 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !724, file: !4, line: 866, type: !371)
!729 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ndigits", arg: 2, scope: !724, file: !4, line: 866, type: !62)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rounded", scope: !724, file: !4, line: 868, type: !371)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buflen", scope: !724, file: !4, line: 869, type: !33)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mybuflen", scope: !724, file: !4, line: 869, type: !33)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !724, file: !4, line: 870, type: !70)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf_end", scope: !724, file: !4, line: 870, type: !70)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shortbuf", scope: !724, file: !4, line: 870, type: !736)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 800, align: 8, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 100)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mybuf", scope: !724, file: !4, line: 870, type: !70)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decpt", scope: !724, file: !4, line: 871, type: !62)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !724, file: !4, line: 871, type: !62)
!742 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !724, file: !4, line: 872, type: !56)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_387controlword", scope: !724, file: !4, line: 873, type: !95)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_387controlword", scope: !724, file: !4, line: 873, type: !95)
!745 = !DISubprogram(name: "float_as_integer_ratio", scope: !4, file: !4, line: 1424, type: !144, isLocal: true, isDefinition: true, scopeLine: 1425, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @float_as_integer_ratio, variables: !746)
!746 = !{!747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !761, !765, !768, !770, !773, !775, !778, !780}
!747 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !745, file: !4, line: 1424, type: !56)
!748 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !745, file: !4, line: 1424, type: !56)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !745, file: !4, line: 1426, type: !371)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "float_part", scope: !745, file: !4, line: 1427, type: !371)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exponent", scope: !745, file: !4, line: 1428, type: !62)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !745, file: !4, line: 1429, type: !62)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !745, file: !4, line: 1431, type: !56)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "py_exponent", scope: !745, file: !4, line: 1432, type: !56)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numerator", scope: !745, file: !4, line: 1433, type: !56)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "denominator", scope: !745, file: !4, line: 1434, type: !56)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result_pair", scope: !745, file: !4, line: 1435, type: !56)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "long_methods", scope: !745, file: !4, line: 1436, type: !137)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !760, file: !4, line: 1475, type: !56)
!760 = distinct !DILexicalBlock(scope: !745, file: !4, line: 1475, column: 93)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !762, file: !4, line: 1479, type: !56)
!762 = distinct !DILexicalBlock(scope: !763, file: !4, line: 1479, column: 93)
!763 = distinct !DILexicalBlock(scope: !764, file: !4, line: 1478, column: 23)
!764 = distinct !DILexicalBlock(scope: !745, file: !4, line: 1478, column: 9)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !766, file: !4, line: 1484, type: !56)
!766 = distinct !DILexicalBlock(scope: !767, file: !4, line: 1484, column: 12)
!767 = distinct !DILexicalBlock(scope: !764, file: !4, line: 1483, column: 10)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !769, file: !4, line: 1493, type: !56)
!769 = distinct !DILexicalBlock(scope: !745, file: !4, line: 1493, column: 8)
!770 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !771, file: !4, line: 1493, type: !56)
!771 = distinct !DILexicalBlock(scope: !772, file: !4, line: 1493, column: 103)
!772 = distinct !DILexicalBlock(scope: !769, file: !4, line: 1493, column: 69)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !774, file: !4, line: 1494, type: !56)
!774 = distinct !DILexicalBlock(scope: !745, file: !4, line: 1494, column: 8)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !776, file: !4, line: 1494, type: !56)
!776 = distinct !DILexicalBlock(scope: !777, file: !4, line: 1494, column: 103)
!777 = distinct !DILexicalBlock(scope: !774, file: !4, line: 1494, column: 69)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !779, file: !4, line: 1495, type: !56)
!779 = distinct !DILexicalBlock(scope: !745, file: !4, line: 1495, column: 8)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !781, file: !4, line: 1495, type: !56)
!781 = distinct !DILexicalBlock(scope: !782, file: !4, line: 1495, column: 101)
!782 = distinct !DILexicalBlock(scope: !779, file: !4, line: 1495, column: 67)
!783 = !DISubprogram(name: "float_fromhex", scope: !4, file: !4, line: 1173, type: !144, isLocal: true, isDefinition: true, scopeLine: 1174, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @float_fromhex, variables: !784)
!784 = !{!785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808}
!785 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "cls", arg: 1, scope: !783, file: !4, line: 1173, type: !56)
!786 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !783, file: !4, line: 1173, type: !56)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result_as_float", scope: !783, file: !4, line: 1175, type: !56)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !783, file: !4, line: 1175, type: !56)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !783, file: !4, line: 1176, type: !371)
!790 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exp", scope: !783, file: !4, line: 1177, type: !39)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "top_exp", scope: !783, file: !4, line: 1177, type: !39)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lsb", scope: !783, file: !4, line: 1177, type: !39)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key_digit", scope: !783, file: !4, line: 1177, type: !39)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !783, file: !4, line: 1178, type: !70)
!795 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coeff_start", scope: !783, file: !4, line: 1178, type: !70)
!796 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s_store", scope: !783, file: !4, line: 1178, type: !70)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coeff_end", scope: !783, file: !4, line: 1178, type: !70)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exp_start", scope: !783, file: !4, line: 1178, type: !70)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s_end", scope: !783, file: !4, line: 1178, type: !70)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "half_eps", scope: !783, file: !4, line: 1179, type: !62)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "digit", scope: !783, file: !4, line: 1179, type: !62)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "round_up", scope: !783, file: !4, line: 1179, type: !62)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "negate", scope: !783, file: !4, line: 1179, type: !62)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !783, file: !4, line: 1180, type: !33)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !783, file: !4, line: 1180, type: !33)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fdigits", scope: !783, file: !4, line: 1180, type: !33)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !783, file: !4, line: 1180, type: !33)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !809, file: !4, line: 1394, type: !56)
!809 = distinct !DILexicalBlock(scope: !783, file: !4, line: 1394, column: 8)
!810 = !DISubprogram(name: "hex_from_char", scope: !4, file: !4, line: 1038, type: !811, isLocal: true, isDefinition: true, scopeLine: 1038, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8)* @hex_from_char, variables: !813)
!811 = !DISubroutineType(types: !812)
!812 = !{!62, !48}
!813 = !{!814, !815}
!814 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !810, file: !4, line: 1038, type: !48)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !810, file: !4, line: 1039, type: !62)
!816 = !DISubprogram(name: "float_hex", scope: !4, file: !4, line: 1109, type: !134, isLocal: true, isDefinition: true, scopeLine: 1110, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @float_hex, variables: !817)
!817 = !{!818, !819, !820, !821, !822, !823, !824, !825, !826}
!818 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !816, file: !4, line: 1109, type: !56)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !816, file: !4, line: 1111, type: !371)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !816, file: !4, line: 1111, type: !371)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !816, file: !4, line: 1112, type: !62)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shift", scope: !816, file: !4, line: 1112, type: !62)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !816, file: !4, line: 1112, type: !62)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "si", scope: !816, file: !4, line: 1112, type: !62)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "esign", scope: !816, file: !4, line: 1112, type: !62)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !816, file: !4, line: 1115, type: !827)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 128, align: 8, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 16)
!830 = !DISubprogram(name: "char_from_hex", scope: !4, file: !4, line: 1031, type: !831, isLocal: true, isDefinition: true, scopeLine: 1032, flags: DIFlagPrototyped, isOptimized: true, function: i8 (i32)* @char_from_hex, variables: !833)
!831 = !DISubroutineType(types: !832)
!832 = !{!48, !62}
!833 = !{!834}
!834 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !830, file: !4, line: 1031, type: !62)
!835 = !DISubprogram(name: "float_is_integer", scope: !4, file: !4, line: 779, type: !134, isLocal: true, isDefinition: true, scopeLine: 780, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @float_is_integer, variables: !836)
!836 = !{!837, !838, !839}
!837 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !835, file: !4, line: 779, type: !56)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !835, file: !4, line: 781, type: !371)
!839 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !835, file: !4, line: 782, type: !56)
!840 = !DISubprogram(name: "float_getnewargs", scope: !4, file: !4, line: 1560, type: !563, isLocal: true, isDefinition: true, scopeLine: 1561, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyFloatObject*)* @float_getnewargs, variables: !841)
!841 = !{!842}
!842 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !840, file: !4, line: 1560, type: !364)
!843 = !DISubprogram(name: "float_getformat", scope: !4, file: !4, line: 1575, type: !844, isLocal: true, isDefinition: true, scopeLine: 1576, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*)* @float_getformat, variables: !848)
!844 = !DISubroutineType(types: !845)
!845 = !{!56, !846, !56}
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64, align: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !25, line: 422, baseType: !42)
!848 = !{!849, !850, !851, !852, !854, !857, !858, !860, !861, !864, !865, !867}
!849 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !843, file: !4, line: 1575, type: !846)
!850 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !843, file: !4, line: 1575, type: !56)
!851 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !843, file: !4, line: 1577, type: !70)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !843, file: !4, line: 1578, type: !853)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "float_format_type", file: !4, line: 1569, baseType: !3)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !855, file: !4, line: 1589, type: !112)
!855 = distinct !DILexicalBlock(scope: !856, file: !4, line: 1589, column: 24)
!856 = distinct !DILexicalBlock(scope: !843, file: !4, line: 1589, column: 9)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !855, file: !4, line: 1589, type: !112)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !859, file: !4, line: 1589, type: !377)
!859 = distinct !DILexicalBlock(scope: !855, file: !4, line: 1589, column: 1531)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !859, file: !4, line: 1589, type: !62)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !862, file: !4, line: 1592, type: !112)
!862 = distinct !DILexicalBlock(scope: !863, file: !4, line: 1592, column: 29)
!863 = distinct !DILexicalBlock(scope: !856, file: !4, line: 1592, column: 14)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !862, file: !4, line: 1592, type: !112)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !866, file: !4, line: 1592, type: !377)
!866 = distinct !DILexicalBlock(scope: !862, file: !4, line: 1592, column: 1521)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !866, file: !4, line: 1592, type: !62)
!868 = !DISubprogram(name: "float_setformat", scope: !4, file: !4, line: 1626, type: !844, isLocal: true, isDefinition: true, scopeLine: 1627, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*)* @float_setformat, variables: !869)
!869 = !{!870, !871, !872, !873, !874, !875, !876, !878, !881, !882, !884, !885, !888, !889, !891, !892, !895, !896, !898, !899, !902, !903, !905, !906, !909, !910, !912}
!870 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !868, file: !4, line: 1626, type: !846)
!871 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !868, file: !4, line: 1626, type: !56)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typestr", scope: !868, file: !4, line: 1628, type: !70)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format", scope: !868, file: !4, line: 1629, type: !70)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !868, file: !4, line: 1630, type: !853)
!875 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "detected", scope: !868, file: !4, line: 1631, type: !853)
!876 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !868, file: !4, line: 1632, type: !877)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64, align: 64)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !879, file: !4, line: 1637, type: !112)
!879 = distinct !DILexicalBlock(scope: !880, file: !4, line: 1637, column: 24)
!880 = distinct !DILexicalBlock(scope: !868, file: !4, line: 1637, column: 9)
!881 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !879, file: !4, line: 1637, type: !112)
!882 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !883, file: !4, line: 1637, type: !377)
!883 = distinct !DILexicalBlock(scope: !879, file: !4, line: 1637, column: 1639)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !883, file: !4, line: 1637, type: !62)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !886, file: !4, line: 1641, type: !112)
!886 = distinct !DILexicalBlock(scope: !887, file: !4, line: 1641, column: 29)
!887 = distinct !DILexicalBlock(scope: !880, file: !4, line: 1641, column: 14)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !886, file: !4, line: 1641, type: !112)
!889 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !890, file: !4, line: 1641, type: !377)
!890 = distinct !DILexicalBlock(scope: !886, file: !4, line: 1641, column: 1629)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !890, file: !4, line: 1641, type: !62)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !893, file: !4, line: 1652, type: !112)
!893 = distinct !DILexicalBlock(scope: !894, file: !4, line: 1652, column: 24)
!894 = distinct !DILexicalBlock(scope: !868, file: !4, line: 1652, column: 9)
!895 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !893, file: !4, line: 1652, type: !112)
!896 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !897, file: !4, line: 1652, type: !377)
!897 = distinct !DILexicalBlock(scope: !893, file: !4, line: 1652, column: 1636)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !897, file: !4, line: 1652, type: !62)
!899 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !900, file: !4, line: 1655, type: !112)
!900 = distinct !DILexicalBlock(scope: !901, file: !4, line: 1655, column: 29)
!901 = distinct !DILexicalBlock(scope: !894, file: !4, line: 1655, column: 14)
!902 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !900, file: !4, line: 1655, type: !112)
!903 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !904, file: !4, line: 1655, type: !377)
!904 = distinct !DILexicalBlock(scope: !900, file: !4, line: 1655, column: 1821)
!905 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !904, file: !4, line: 1655, type: !62)
!906 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1_len", scope: !907, file: !4, line: 1658, type: !112)
!907 = distinct !DILexicalBlock(scope: !908, file: !4, line: 1658, column: 29)
!908 = distinct !DILexicalBlock(scope: !901, file: !4, line: 1658, column: 14)
!909 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s2_len", scope: !907, file: !4, line: 1658, type: !112)
!910 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__s1", scope: !911, file: !4, line: 1658, type: !377)
!911 = distinct !DILexicalBlock(scope: !907, file: !4, line: 1658, column: 1776)
!912 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__result", scope: !911, file: !4, line: 1658, type: !62)
!913 = !DISubprogram(name: "float__format__", scope: !4, file: !4, line: 1701, type: !144, isLocal: true, isDefinition: true, scopeLine: 1702, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @float__format__, variables: !914)
!914 = !{!915, !916, !917, !918, !933}
!915 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !913, file: !4, line: 1701, type: !56)
!916 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !913, file: !4, line: 1701, type: !56)
!917 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format_spec", scope: !913, file: !4, line: 1703, type: !56)
!918 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "writer", scope: !913, file: !4, line: 1704, type: !919)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyUnicodeWriter", file: !10, line: 917, baseType: !920)
!920 = !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 897, size: 448, align: 64, elements: !921)
!921 = !{!922, !923, !924, !925, !927, !928, !929, !930, !931, !932}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !920, file: !10, line: 898, baseType: !56, size: 64, align: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !920, file: !10, line: 899, baseType: !17, size: 64, align: 64, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !920, file: !10, line: 900, baseType: !9, size: 32, align: 32, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "maxchar", scope: !920, file: !10, line: 901, baseType: !926, size: 32, align: 32, offset: 160)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !10, line: 121, baseType: !359)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !920, file: !10, line: 902, baseType: !33, size: 64, align: 64, offset: 192)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !920, file: !10, line: 903, baseType: !33, size: 64, align: 64, offset: 256)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "min_length", scope: !920, file: !10, line: 906, baseType: !33, size: 64, align: 64, offset: 320)
