; ModuleID = 'programs_new/Python-new/formatter_unicode.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !401, globals: !854)
!1 = !DIFile(filename: "formatter_unicode.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !96, !350, !351, !369, !373, !381, !397, !399, !17, !101, !37, !348, !371, !391, !394, !393, !396, !372, !50}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !13, line: 109, baseType: !14)
!13 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !13, line: 105, size: 128, align: 64, elements: !15)
!15 = !{!16, !24}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !14, file: !13, line: 107, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !18, line: 177, baseType: !19)
!18 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !20, line: 102, baseType: !21)
!20 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !22, line: 181, baseType: !23)
!22 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!23 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !14, file: !13, line: 108, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !13, line: 334, size: 3200, align: 64, elements: !27)
!27 = !{!28, !34, !38, !39, !40, !45, !109, !114, !119, !120, !125, !177, !208, !220, !226, !227, !228, !230, !232, !263, !264, !265, !274, !275, !280, !281, !283, !285, !295, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !26, file: !13, line: 335, baseType: !29, size: 192, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !13, line: 114, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 111, size: 192, align: 64, elements: !31)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !30, file: !13, line: 112, baseType: !12, size: 128, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !30, file: !13, line: 113, baseType: !17, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !26, file: !13, line: 336, baseType: !35, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!37 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !26, file: !13, line: 337, baseType: !17, size: 64, align: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !26, file: !13, line: 337, baseType: !17, size: 64, align: 64, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !26, file: !13, line: 341, baseType: !41, size: 64, align: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !13, line: 308, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !11}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !26, file: !13, line: 342, baseType: !46, size: 64, align: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !13, line: 314, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !11, !51, !50}
!50 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !20, line: 48, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !54, line: 246, size: 1728, align: 64, elements: !55)
!54 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!55 = !{!56, !57, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !77, !78, !79, !80, !82, !84, !86, !90, !93, !95, !97, !98, !99, !100, !104, !105}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !53, file: !54, line: 247, baseType: !50, size: 32, align: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !53, file: !54, line: 252, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !53, file: !54, line: 253, baseType: !58, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !53, file: !54, line: 254, baseType: !58, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !53, file: !54, line: 255, baseType: !58, size: 64, align: 64, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !53, file: !54, line: 256, baseType: !58, size: 64, align: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !53, file: !54, line: 257, baseType: !58, size: 64, align: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !53, file: !54, line: 258, baseType: !58, size: 64, align: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !53, file: !54, line: 259, baseType: !58, size: 64, align: 64, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !53, file: !54, line: 261, baseType: !58, size: 64, align: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !53, file: !54, line: 262, baseType: !58, size: 64, align: 64, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !53, file: !54, line: 263, baseType: !58, size: 64, align: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !53, file: !54, line: 265, baseType: !70, size: 64, align: 64, offset: 768)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !54, line: 161, size: 192, align: 64, elements: !72)
!72 = !{!73, !74, !76}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !71, file: !54, line: 162, baseType: !70, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !71, file: !54, line: 163, baseType: !75, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !71, file: !54, line: 167, baseType: !50, size: 32, align: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !53, file: !54, line: 267, baseType: !75, size: 64, align: 64, offset: 832)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !53, file: !54, line: 269, baseType: !50, size: 32, align: 32, offset: 896)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !53, file: !54, line: 273, baseType: !50, size: 32, align: 32, offset: 928)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !53, file: !54, line: 275, baseType: !81, size: 64, align: 64, offset: 960)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !22, line: 140, baseType: !23)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !53, file: !54, line: 279, baseType: !83, size: 16, align: 16, offset: 1024)
!83 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !53, file: !54, line: 280, baseType: !85, size: 8, align: 8, offset: 1040)
!85 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !53, file: !54, line: 281, baseType: !87, size: 8, align: 8, offset: 1048)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, align: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 1)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !53, file: !54, line: 285, baseType: !91, size: 64, align: 64, offset: 1088)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !54, line: 155, baseType: null)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !53, file: !54, line: 294, baseType: !94, size: 64, align: 64, offset: 1152)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !22, line: 141, baseType: !23)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !53, file: !54, line: 303, baseType: !96, size: 64, align: 64, offset: 1216)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !53, file: !54, line: 304, baseType: !96, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !53, file: !54, line: 305, baseType: !96, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !53, file: !54, line: 306, baseType: !96, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !53, file: !54, line: 307, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !53, file: !54, line: 309, baseType: !50, size: 32, align: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !53, file: !54, line: 311, baseType: !106, size: 160, align: 8, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 160, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !26, file: !13, line: 343, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !13, line: 316, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!11, !11, !58}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !26, file: !13, line: 344, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !13, line: 318, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!50, !11, !58, !11}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !26, file: !13, line: 345, baseType: !96, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !26, file: !13, line: 346, baseType: !121, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !13, line: 320, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!11, !11}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !26, file: !13, line: 350, baseType: !126, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !13, line: 278, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 236, size: 2176, align: 64, elements: !129)
!129 = !{!130, !135, !136, !137, !138, !139, !144, !146, !147, !148, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !128, file: !13, line: 241, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !13, line: 166, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!11, !11, !11}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !128, file: !13, line: 242, baseType: !131, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !128, file: !13, line: 243, baseType: !131, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !128, file: !13, line: 244, baseType: !131, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !128, file: !13, line: 245, baseType: !131, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !128, file: !13, line: 246, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !13, line: 167, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!11, !11, !11, !11}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !128, file: !13, line: 247, baseType: !145, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !13, line: 165, baseType: !122)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !128, file: !13, line: 248, baseType: !145, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !128, file: !13, line: 249, baseType: !145, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !128, file: !13, line: 250, baseType: !149, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !13, line: 168, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!50, !11}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !128, file: !13, line: 251, baseType: !145, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !128, file: !13, line: 252, baseType: !131, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !128, file: !13, line: 253, baseType: !131, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !128, file: !13, line: 254, baseType: !131, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !128, file: !13, line: 255, baseType: !131, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !128, file: !13, line: 256, baseType: !131, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !128, file: !13, line: 257, baseType: !145, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !128, file: !13, line: 258, baseType: !96, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !128, file: !13, line: 259, baseType: !145, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !128, file: !13, line: 261, baseType: !131, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !128, file: !13, line: 262, baseType: !131, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !128, file: !13, line: 263, baseType: !131, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !128, file: !13, line: 264, baseType: !131, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !128, file: !13, line: 265, baseType: !140, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !128, file: !13, line: 266, baseType: !131, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !128, file: !13, line: 267, baseType: !131, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !128, file: !13, line: 268, baseType: !131, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !128, file: !13, line: 269, baseType: !131, size: 64, align: 64, offset: 1728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !128, file: !13, line: 270, baseType: !131, size: 64, align: 64, offset: 1792)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !128, file: !13, line: 272, baseType: !131, size: 64, align: 64, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !128, file: !13, line: 273, baseType: !131, size: 64, align: 64, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !128, file: !13, line: 274, baseType: !131, size: 64, align: 64, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !128, file: !13, line: 275, baseType: !131, size: 64, align: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !128, file: !13, line: 277, baseType: !145, size: 64, align: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !26, file: !13, line: 351, baseType: !178, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !13, line: 292, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 280, size: 640, align: 64, elements: !181)
!181 = !{!182, !187, !188, !193, !194, !195, !200, !201, !206, !207}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !180, file: !13, line: 281, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !13, line: 169, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!17, !11}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !180, file: !13, line: 282, baseType: !131, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !180, file: !13, line: 283, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !13, line: 170, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!11, !11, !17}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !180, file: !13, line: 284, baseType: !189, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !180, file: !13, line: 285, baseType: !96, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !180, file: !13, line: 286, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !13, line: 172, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!50, !11, !17, !11}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !180, file: !13, line: 287, baseType: !96, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !180, file: !13, line: 288, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !13, line: 231, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!50, !11, !11}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !180, file: !13, line: 290, baseType: !131, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !180, file: !13, line: 291, baseType: !189, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !26, file: !13, line: 352, baseType: !209, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !13, line: 298, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 294, size: 192, align: 64, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !211, file: !13, line: 295, baseType: !183, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !211, file: !13, line: 296, baseType: !131, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !211, file: !13, line: 297, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !13, line: 174, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!50, !11, !11, !11}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !26, file: !13, line: 356, baseType: !221, size: 64, align: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !13, line: 321, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !11}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !18, line: 186, baseType: !17)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !26, file: !13, line: 357, baseType: !140, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !26, file: !13, line: 358, baseType: !121, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !26, file: !13, line: 359, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !13, line: 317, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !26, file: !13, line: 360, baseType: !231, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !13, line: 319, baseType: !217)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !26, file: !13, line: 363, baseType: !233, size: 64, align: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !13, line: 304, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 301, size: 128, align: 64, elements: !236)
!236 = !{!237, !258}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !235, file: !13, line: 302, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !13, line: 193, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!50, !11, !242, !50}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !13, line: 191, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !13, line: 178, size: 640, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !255, !256, !257}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !244, file: !13, line: 179, baseType: !96, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !244, file: !13, line: 180, baseType: !11, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !13, line: 181, baseType: !17, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !244, file: !13, line: 182, baseType: !17, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !244, file: !13, line: 184, baseType: !50, size: 32, align: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !244, file: !13, line: 185, baseType: !50, size: 32, align: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !244, file: !13, line: 186, baseType: !58, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !244, file: !13, line: 187, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !244, file: !13, line: 188, baseType: !254, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !244, file: !13, line: 189, baseType: !254, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !244, file: !13, line: 190, baseType: !96, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !235, file: !13, line: 303, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !13, line: 194, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !11, !242}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !26, file: !13, line: 366, baseType: !103, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !26, file: !13, line: 368, baseType: !35, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !26, file: !13, line: 372, baseType: !266, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !13, line: 233, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!50, !11, !270, !96}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !13, line: 232, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!50, !11, !96}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !26, file: !13, line: 375, baseType: !149, size: 64, align: 64, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !26, file: !13, line: 379, baseType: !276, size: 64, align: 64, offset: 1600)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !13, line: 322, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!11, !11, !11, !50}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !26, file: !13, line: 382, baseType: !17, size: 64, align: 64, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !26, file: !13, line: 385, baseType: !282, size: 64, align: 64, offset: 1728)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !13, line: 323, baseType: !122)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !26, file: !13, line: 386, baseType: !284, size: 64, align: 64, offset: 1792)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !13, line: 324, baseType: !122)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !26, file: !13, line: 389, baseType: !286, size: 64, align: 64, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 40, size: 256, align: 64, elements: !289)
!288 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 41, baseType: !35, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 18, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 43, baseType: !50, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 45, baseType: !35, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !26, file: !13, line: 390, baseType: !296, size: 64, align: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !13, line: 390, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !26, file: !13, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !58, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!11, !11, !96}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!50, !11, !11, !96}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !58, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !96, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !26, file: !13, line: 392, baseType: !25, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !26, file: !13, line: 393, baseType: !11, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !26, file: !13, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !13, line: 325, baseType: !141)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !26, file: !13, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !13, line: 326, baseType: !217)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !26, file: !13, line: 396, baseType: !17, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !26, file: !13, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !13, line: 327, baseType: !217)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !26, file: !13, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !13, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!11, !25, !17}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !26, file: !13, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !13, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!11, !25, !11, !11}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !26, file: !13, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !13, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !96}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !26, file: !13, line: 401, baseType: !149, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !26, file: !13, line: 402, baseType: !11, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !26, file: !13, line: 403, baseType: !11, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !26, file: !13, line: 404, baseType: !11, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !26, file: !13, line: 405, baseType: !11, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !26, file: !13, line: 406, baseType: !11, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !26, file: !13, line: 407, baseType: !41, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !26, file: !13, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !26, file: !13, line: 412, baseType: !41, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !348)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !353)
!353 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !354)
!354 = !{!355, !356, !357, !358, !366}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !353, file: !4, line: 291, baseType: !12, size: 128, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !353, file: !4, line: 292, baseType: !17, size: 64, align: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !353, file: !4, line: 293, baseType: !225, size: 64, align: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !353, file: !4, line: 349, baseType: !359, size: 32, align: 32, offset: 256)
!359 = !DICompositeType(tag: DW_TAG_structure_type, scope: !353, file: !4, line: 294, size: 32, align: 32, elements: !360)
!360 = !{!361, !362, !363, !364, !365}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !359, file: !4, line: 303, baseType: !348, size: 2, align: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !359, file: !4, line: 331, baseType: !348, size: 3, align: 32, offset: 2)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !359, file: !4, line: 336, baseType: !348, size: 1, align: 32, offset: 5)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !359, file: !4, line: 340, baseType: !348, size: 1, align: 32, offset: 6)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !359, file: !4, line: 345, baseType: !348, size: 1, align: 32, offset: 7)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !353, file: !4, line: 350, baseType: !367, size: 64, align: 64, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !102, line: 90, baseType: !50)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !372)
!372 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !375)
!375 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !376)
!376 = !{!377, !378, !379, !380}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !375, file: !4, line: 357, baseType: !352, size: 384, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !375, file: !4, line: 358, baseType: !17, size: 64, align: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !375, file: !4, line: 360, baseType: !58, size: 64, align: 64, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !375, file: !4, line: 361, baseType: !17, size: 64, align: 64, offset: 512)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !383)
!383 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !383, file: !4, line: 369, baseType: !374, size: 576, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !383, file: !4, line: 375, baseType: !387, size: 64, align: 64, offset: 576)
!387 = !DICompositeType(tag: DW_TAG_union_type, scope: !383, file: !4, line: 370, size: 64, align: 64, elements: !388)
!388 = !{!389, !390, !392, !395}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !387, file: !4, line: 371, baseType: !96, size: 64, align: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !387, file: !4, line: 372, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !387, file: !4, line: 373, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !83)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !387, file: !4, line: 374, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!401 = !{!402, !438, !459, !467, !475, !485, !500, !505, !508, !519, !524, !542, !552, !562, !568, !615, !681, !704, !746, !761, !791, !802}
!402 = !DISubprogram(name: "_PyUnicode_FormatAdvancedWriter", scope: !403, file: !403, line: 1374, type: !404, isLocal: false, isDefinition: true, scopeLine: 1378, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyUnicodeWriter*, %struct._object*, %struct._object*, i64, i64)* @_PyUnicode_FormatAdvancedWriter, variables: !420)
!403 = !DIFile(filename: "Python/formatter_unicode.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!404 = !DISubroutineType(types: !405)
!405 = !{!50, !406, !11, !11, !17, !17}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyUnicodeWriter", file: !4, line: 917, baseType: !408)
!408 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 897, size: 448, align: 64, elements: !409)
!409 = !{!410, !411, !412, !413, !414, !415, !416, !417, !418, !419}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !408, file: !4, line: 898, baseType: !11, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !408, file: !4, line: 899, baseType: !96, size: 64, align: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !408, file: !4, line: 900, baseType: !3, size: 32, align: 32, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "maxchar", scope: !408, file: !4, line: 901, baseType: !350, size: 32, align: 32, offset: 160)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !408, file: !4, line: 902, baseType: !17, size: 64, align: 64, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !408, file: !4, line: 903, baseType: !17, size: 64, align: 64, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "min_length", scope: !408, file: !4, line: 906, baseType: !17, size: 64, align: 64, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "min_char", scope: !408, file: !4, line: 909, baseType: !350, size: 32, align: 32, offset: 384)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "overallocate", scope: !408, file: !4, line: 912, baseType: !372, size: 8, align: 8, offset: 416)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !408, file: !4, line: 916, baseType: !372, size: 8, align: 8, offset: 424)
!420 = !{!421, !422, !423, !424, !425, !426}
!421 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "writer", arg: 1, scope: !402, file: !403, line: 1374, type: !406)
!422 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !402, file: !403, line: 1375, type: !11)
!423 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format_spec", arg: 3, scope: !402, file: !403, line: 1376, type: !11)
!424 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 4, scope: !402, file: !403, line: 1377, type: !17)
!425 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 5, scope: !402, file: !403, line: 1377, type: !17)
!426 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format", scope: !402, file: !403, line: 1379, type: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "InternalFormatSpec", file: !403, line: 118, baseType: !428)
!428 = !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 109, size: 384, align: 64, elements: !429)
!429 = !{!430, !431, !432, !433, !434, !435, !436, !437}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "fill_char", scope: !428, file: !403, line: 110, baseType: !350, size: 32, align: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !428, file: !403, line: 111, baseType: !350, size: 32, align: 32, offset: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "alternate", scope: !428, file: !403, line: 112, baseType: !50, size: 32, align: 32, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !428, file: !403, line: 113, baseType: !350, size: 32, align: 32, offset: 96)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !428, file: !403, line: 114, baseType: !17, size: 64, align: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_separators", scope: !428, file: !403, line: 115, baseType: !50, size: 32, align: 32, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !428, file: !403, line: 116, baseType: !17, size: 64, align: 64, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !428, file: !403, line: 117, baseType: !350, size: 32, align: 32, offset: 320)
!438 = !DISubprogram(name: "_PyLong_FormatAdvancedWriter", scope: !403, file: !403, line: 1410, type: !404, isLocal: false, isDefinition: true, scopeLine: 1414, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyUnicodeWriter*, %struct._object*, %struct._object*, i64, i64)* @_PyLong_FormatAdvancedWriter, variables: !439)
!439 = !{!440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !451, !454, !456}
!440 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "writer", arg: 1, scope: !438, file: !403, line: 1410, type: !406)
!441 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !438, file: !403, line: 1411, type: !11)
!442 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format_spec", arg: 3, scope: !438, file: !403, line: 1412, type: !11)
!443 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 4, scope: !438, file: !403, line: 1413, type: !17)
!444 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 5, scope: !438, file: !403, line: 1413, type: !17)
!445 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !438, file: !403, line: 1415, type: !11)
!446 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !438, file: !403, line: 1415, type: !11)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format", scope: !438, file: !403, line: 1416, type: !427)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !438, file: !403, line: 1417, type: !50)
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !450, file: !403, line: 1467, type: !11)
!450 = distinct !DILexicalBlock(scope: !438, file: !403, line: 1467, column: 8)
!451 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !452, file: !403, line: 1467, type: !11)
!452 = distinct !DILexicalBlock(scope: !453, file: !403, line: 1467, column: 95)
!453 = distinct !DILexicalBlock(scope: !450, file: !403, line: 1467, column: 61)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !455, file: !403, line: 1468, type: !11)
!455 = distinct !DILexicalBlock(scope: !438, file: !403, line: 1468, column: 8)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !457, file: !403, line: 1468, type: !11)
!457 = distinct !DILexicalBlock(scope: !458, file: !403, line: 1468, column: 95)
!458 = distinct !DILexicalBlock(scope: !455, file: !403, line: 1468, column: 61)
!459 = !DISubprogram(name: "_PyFloat_FormatAdvancedWriter", scope: !403, file: !403, line: 1473, type: !404, isLocal: false, isDefinition: true, scopeLine: 1477, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyUnicodeWriter*, %struct._object*, %struct._object*, i64, i64)* @_PyFloat_FormatAdvancedWriter, variables: !460)
!460 = !{!461, !462, !463, !464, !465, !466}
!461 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "writer", arg: 1, scope: !459, file: !403, line: 1473, type: !406)
!462 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !459, file: !403, line: 1474, type: !11)
!463 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format_spec", arg: 3, scope: !459, file: !403, line: 1475, type: !11)
!464 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 4, scope: !459, file: !403, line: 1476, type: !17)
!465 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 5, scope: !459, file: !403, line: 1476, type: !17)
!466 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format", scope: !459, file: !403, line: 1478, type: !427)
!467 = !DISubprogram(name: "_PyComplex_FormatAdvancedWriter", scope: !403, file: !403, line: 1512, type: !404, isLocal: false, isDefinition: true, scopeLine: 1516, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyUnicodeWriter*, %struct._object*, %struct._object*, i64, i64)* @_PyComplex_FormatAdvancedWriter, variables: !468)
!468 = !{!469, !470, !471, !472, !473, !474}
!469 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "writer", arg: 1, scope: !467, file: !403, line: 1512, type: !406)
!470 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !467, file: !403, line: 1513, type: !11)
!471 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format_spec", arg: 3, scope: !467, file: !403, line: 1514, type: !11)
!472 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 4, scope: !467, file: !403, line: 1515, type: !17)
!473 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 5, scope: !467, file: !403, line: 1515, type: !17)
!474 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "format", scope: !467, file: !403, line: 1517, type: !427)
!475 = !DISubprogram(name: "format_obj", scope: !403, file: !403, line: 1360, type: !476, isLocal: true, isDefinition: true, scopeLine: 1361, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._PyUnicodeWriter*)* @format_obj, variables: !478)
!476 = !DISubroutineType(types: !477)
!477 = !{!50, !11, !406}
!478 = !{!479, !480, !481, !482, !483}
!479 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !475, file: !403, line: 1360, type: !11)
!480 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "writer", arg: 2, scope: !475, file: !403, line: 1360, type: !406)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !475, file: !403, line: 1362, type: !11)
!482 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !475, file: !403, line: 1363, type: !50)
!483 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !484, file: !403, line: 1369, type: !11)
!484 = distinct !DILexicalBlock(scope: !475, file: !403, line: 1369, column: 8)
!485 = !DISubprogram(name: "parse_internal_render_format_spec", scope: !403, file: !403, line: 146, type: !486, isLocal: true, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64, i64, %struct.InternalFormatSpec*, i8, i8)* @parse_internal_render_format_spec, variables: !489)
!486 = !DISubroutineType(types: !487)
!487 = !{!50, !11, !17, !17, !488, !37, !37}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!489 = !{!490, !491, !492, !493, !494, !495, !496, !497, !498, !499}
!490 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format_spec", arg: 1, scope: !485, file: !403, line: 146, type: !11)
!491 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 2, scope: !485, file: !403, line: 147, type: !17)
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 3, scope: !485, file: !403, line: 147, type: !17)
!493 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 4, scope: !485, file: !403, line: 148, type: !488)
!494 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "default_type", arg: 5, scope: !485, file: !403, line: 149, type: !37)
!495 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "default_align", arg: 6, scope: !485, file: !403, line: 150, type: !37)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !485, file: !403, line: 152, type: !17)
!497 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "consumed", scope: !485, file: !403, line: 157, type: !17)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "align_specified", scope: !485, file: !403, line: 158, type: !50)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fill_char_specified", scope: !485, file: !403, line: 159, type: !50)
!500 = !DISubprogram(name: "is_alignment_token", scope: !403, file: !403, line: 86, type: !501, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @is_alignment_token, variables: !503)
!501 = !DISubroutineType(types: !502)
!502 = !{!50, !350}
!503 = !{!504}
!504 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !500, file: !403, line: 86, type: !350)
!505 = !DISubprogram(name: "is_sign_element", scope: !403, file: !403, line: 98, type: !501, isLocal: true, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32)* @is_sign_element, variables: !506)
!506 = !{!507}
!507 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !505, file: !403, line: 98, type: !350)
!508 = !DISubprogram(name: "get_integer", scope: !403, file: !403, line: 51, type: !509, isLocal: true, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64*, i64, i64*)* @get_integer, variables: !511)
!509 = !DISubroutineType(types: !510)
!510 = !{!50, !11, !254, !17, !254}
!511 = !{!512, !513, !514, !515, !516, !517, !518}
!512 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !508, file: !403, line: 51, type: !11)
!513 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pos", arg: 2, scope: !508, file: !403, line: 51, type: !254)
!514 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 3, scope: !508, file: !403, line: 51, type: !17)
!515 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "result", arg: 4, scope: !508, file: !403, line: 52, type: !254)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "accumulator", scope: !508, file: !403, line: 54, type: !17)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "digitval", scope: !508, file: !403, line: 54, type: !17)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numdigits", scope: !508, file: !403, line: 55, type: !50)
!519 = !DISubprogram(name: "invalid_comma_type", scope: !403, file: !403, line: 31, type: !520, isLocal: true, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @invalid_comma_type, variables: !522)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !350}
!522 = !{!523}
!523 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "presentation_type", arg: 1, scope: !519, file: !403, line: 31, type: !350)
!524 = !DISubprogram(name: "format_string_internal", scope: !403, file: !403, line: 726, type: !525, isLocal: true, isDefinition: true, scopeLine: 728, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct.InternalFormatSpec*, %struct._PyUnicodeWriter*)* @format_string_internal, variables: !529)
!525 = !DISubroutineType(types: !526)
!526 = !{!50, !11, !527, !406}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!529 = !{!530, !531, !532, !533, !534, !535, !536, !537, !538, !539}
!530 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 1, scope: !524, file: !403, line: 726, type: !11)
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 2, scope: !524, file: !403, line: 726, type: !527)
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "writer", arg: 3, scope: !524, file: !403, line: 727, type: !406)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lpad", scope: !524, file: !403, line: 729, type: !17)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rpad", scope: !524, file: !403, line: 730, type: !17)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "total", scope: !524, file: !403, line: 731, type: !17)
!536 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !524, file: !403, line: 732, type: !17)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !524, file: !403, line: 733, type: !50)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxchar", scope: !524, file: !403, line: 734, type: !350)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "valmaxchar", scope: !540, file: !403, line: 780, type: !350)
!540 = distinct !DILexicalBlock(scope: !541, file: !403, line: 779, column: 344)
!541 = distinct !DILexicalBlock(scope: !524, file: !403, line: 779, column: 9)
!542 = !DISubprogram(name: "calc_padding", scope: !403, file: !403, line: 286, type: !543, isLocal: true, isDefinition: true, scopeLine: 289, flags: DIFlagPrototyped, isOptimized: true, function: void (i64, i64, i32, i64*, i64*, i64*)* @calc_padding, variables: !545)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !17, !17, !350, !254, !254, !254}
!545 = !{!546, !547, !548, !549, !550, !551}
!546 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nchars", arg: 1, scope: !542, file: !403, line: 286, type: !17)
!547 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "width", arg: 2, scope: !542, file: !403, line: 286, type: !17)
!548 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "align", arg: 3, scope: !542, file: !403, line: 286, type: !350)
!549 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_lpadding", arg: 4, scope: !542, file: !403, line: 287, type: !254)
!550 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_rpadding", arg: 5, scope: !542, file: !403, line: 287, type: !254)
!551 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_total", arg: 6, scope: !542, file: !403, line: 288, type: !254)
!552 = !DISubprogram(name: "fill_padding", scope: !403, file: !403, line: 321, type: !553, isLocal: true, isDefinition: true, scopeLine: 325, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyUnicodeWriter*, i64, i32, i64, i64)* @fill_padding, variables: !555)
!553 = !DISubroutineType(types: !554)
!554 = !{!50, !406, !17, !350, !17, !17}
!555 = !{!556, !557, !558, !559, !560, !561}
!556 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "writer", arg: 1, scope: !552, file: !403, line: 321, type: !406)
!557 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nchars", arg: 2, scope: !552, file: !403, line: 322, type: !17)
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fill_char", arg: 3, scope: !552, file: !403, line: 323, type: !350)
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_lpadding", arg: 4, scope: !552, file: !403, line: 323, type: !17)
!560 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_rpadding", arg: 5, scope: !552, file: !403, line: 324, type: !17)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !552, file: !403, line: 326, type: !17)
!562 = !DISubprogram(name: "unknown_presentation_type", scope: !403, file: !403, line: 12, type: !563, isLocal: true, isDefinition: true, scopeLine: 14, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, i8*)* @unknown_presentation_type, variables: !565)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !350, !35}
!565 = !{!566, !567}
!566 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "presentation_type", arg: 1, scope: !562, file: !403, line: 12, type: !350)
!567 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type_name", arg: 2, scope: !562, file: !403, line: 13, type: !35)
!568 = !DISubprogram(name: "format_long_internal", scope: !403, file: !403, line: 811, type: !525, isLocal: true, isDefinition: true, scopeLine: 813, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct.InternalFormatSpec*, %struct._PyUnicodeWriter*)* @format_long_internal, variables: !569)
!569 = !{!570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !598, !599, !606, !609, !610, !612}
!570 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 1, scope: !568, file: !403, line: 811, type: !11)
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "format", arg: 2, scope: !568, file: !403, line: 811, type: !527)
!572 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "writer", arg: 3, scope: !568, file: !403, line: 812, type: !406)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !568, file: !403, line: 814, type: !50)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxchar", scope: !568, file: !403, line: 815, type: !350)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !568, file: !403, line: 816, type: !11)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inumeric_chars", scope: !568, file: !403, line: 817, type: !17)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign_char", scope: !568, file: !403, line: 818, type: !350)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_digits", scope: !568, file: !403, line: 819, type: !17)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_remainder", scope: !568, file: !403, line: 821, type: !17)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_prefix", scope: !568, file: !403, line: 823, type: !17)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n_total", scope: !568, file: !403, line: 824, type: !17)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prefix", scope: !568, file: !403, line: 825, type: !17)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "spec", scope: !568, file: !403, line: 826, type: !584)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "NumberFieldWidths", file: !403, line: 387, baseType: !585)
!585 = !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 367, size: 704, align: 64, elements: !586)
!586 = !{!587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "n_lpadding", scope: !585, file: !403, line: 368, baseType: !17, size: 64, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "n_prefix", scope: !585, file: !403, line: 369, baseType: !17, size: 64, align: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "n_spadding", scope: !585, file: !403, line: 370, baseType: !17, size: 64, align: 64, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "n_rpadding", scope: !585, file: !403, line: 371, baseType: !17, size: 64, align: 64, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !585, file: !403, line: 372, baseType: !37, size: 8, align: 8, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign", scope: !585, file: !403, line: 373, baseType: !17, size: 64, align: 64, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "n_grouped_digits", scope: !585, file: !403, line: 374, baseType: !17, size: 64, align: 64, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "n_decimal", scope: !585, file: !403, line: 376, baseType: !17, size: 64, align: 64, offset: 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "n_remainder", scope: !585, file: !403, line: 377, baseType: !17, size: 64, align: 64, offset: 512)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "n_digits", scope: !585, file: !403, line: 383, baseType: !17, size: 64, align: 64, offset: 576)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "n_min_width", scope: !585, file: !403, line: 385, baseType: !17, size: 64, align: 64, offset: 640)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !568, file: !403, line: 827, type: !23)
!599 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "locale", scope: !568, file: !403, line: 831, type: !600)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "LocaleInfo", file: !403, line: 361, baseType: !601)
!601 = !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 357, size: 192, align: 64, elements: !602)
!602 = !{!603, !604, !605}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !601, file: !403, line: 358, baseType: !11, size: 64, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !601, file: !403, line: 359, baseType: !11, size: 64, align: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !601, file: !403, line: 360, baseType: !35, size: 64, align: 64, offset: 128)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !607, file: !403, line: 873, type: !50)
!607 = distinct !DILexicalBlock(scope: !608, file: !403, line: 872, column: 10)
!608 = distinct !DILexicalBlock(scope: !568, file: !403, line: 841, column: 9)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "leading_chars_to_skip", scope: !607, file: !403, line: 874, type: !50)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !611, file: !403, line: 963, type: !11)
!611 = distinct !DILexicalBlock(scope: !568, file: !403, line: 963, column: 8)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !613, file: !403, line: 963, type: !11)
!613 = distinct !DILexicalBlock(scope: !614, file: !403, line: 963, column: 95)
!614 = distinct !DILexicalBlock(scope: !611, file: !403, line: 963, column: 61)
!615 = !DISubprogram(name: "get_locale_info", scope: !403, file: !403, line: 666, type: !616, isLocal: true, isDefinition: true, scopeLine: 667, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.LocaleInfo*)* @get_locale_info, variables: !619)
!616 = !DISubroutineType(types: !617)
!617 = !{!50, !50, !618}
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64, align: 64)
!619 = !{!620, !621, !622, !653, !657, !661, !664, !666, !669, !673, !676, !678}
!620 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !615, file: !403, line: 666, type: !50)
!621 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "locale_info", arg: 2, scope: !615, file: !403, line: 666, type: !618)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "locale_data", scope: !623, file: !403, line: 670, type: !625)
!623 = distinct !DILexicalBlock(scope: !624, file: !403, line: 669, column: 13)
!624 = distinct !DILexicalBlock(scope: !615, file: !403, line: 668, column: 19)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64, align: 64)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !627, line: 54, size: 768, align: 64, elements: !628)
!627 = !DIFile(filename: "/usr/include/locale.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!628 = !{!629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !626, file: !627, line: 58, baseType: !58, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !626, file: !627, line: 59, baseType: !58, size: 64, align: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !626, file: !627, line: 65, baseType: !58, size: 64, align: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !626, file: !627, line: 71, baseType: !58, size: 64, align: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !626, file: !627, line: 72, baseType: !58, size: 64, align: 64, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !626, file: !627, line: 73, baseType: !58, size: 64, align: 64, offset: 320)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !626, file: !627, line: 74, baseType: !58, size: 64, align: 64, offset: 384)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !626, file: !627, line: 75, baseType: !58, size: 64, align: 64, offset: 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !626, file: !627, line: 76, baseType: !58, size: 64, align: 64, offset: 512)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !626, file: !627, line: 77, baseType: !58, size: 64, align: 64, offset: 576)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !626, file: !627, line: 78, baseType: !37, size: 8, align: 8, offset: 640)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !626, file: !627, line: 79, baseType: !37, size: 8, align: 8, offset: 648)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !626, file: !627, line: 81, baseType: !37, size: 8, align: 8, offset: 656)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !626, file: !627, line: 83, baseType: !37, size: 8, align: 8, offset: 664)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !626, file: !627, line: 85, baseType: !37, size: 8, align: 8, offset: 672)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !626, file: !627, line: 87, baseType: !37, size: 8, align: 8, offset: 680)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !626, file: !627, line: 94, baseType: !37, size: 8, align: 8, offset: 688)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !626, file: !627, line: 95, baseType: !37, size: 8, align: 8, offset: 696)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !626, file: !627, line: 98, baseType: !37, size: 8, align: 8, offset: 704)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !626, file: !627, line: 100, baseType: !37, size: 8, align: 8, offset: 712)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !626, file: !627, line: 102, baseType: !37, size: 8, align: 8, offset: 720)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !626, file: !627, line: 104, baseType: !37, size: 8, align: 8, offset: 728)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !626, file: !627, line: 111, baseType: !37, size: 8, align: 8, offset: 736)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !626, file: !627, line: 112, baseType: !37, size: 8, align: 8, offset: 744)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !654, file: !403, line: 680, type: !11)
!654 = distinct !DILexicalBlock(scope: !655, file: !403, line: 680, column: 16)
!655 = distinct !DILexicalBlock(scope: !656, file: !403, line: 679, column: 55)
!656 = distinct !DILexicalBlock(scope: !623, file: !403, line: 679, column: 13)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !658, file: !403, line: 690, type: !11)
!658 = distinct !DILexicalBlock(scope: !659, file: !403, line: 690, column: 16)
!659 = distinct !DILexicalBlock(scope: !660, file: !403, line: 689, column: 73)
!660 = distinct !DILexicalBlock(scope: !624, file: !403, line: 689, column: 13)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !662, file: !403, line: 690, type: !11)
!662 = distinct !DILexicalBlock(scope: !663, file: !403, line: 690, column: 126)
!663 = distinct !DILexicalBlock(scope: !658, file: !403, line: 690, column: 92)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !665, file: !403, line: 691, type: !11)
!665 = distinct !DILexicalBlock(scope: !659, file: !403, line: 691, column: 16)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !667, file: !403, line: 691, type: !11)
!667 = distinct !DILexicalBlock(scope: !668, file: !403, line: 691, column: 126)
!668 = distinct !DILexicalBlock(scope: !665, file: !403, line: 691, column: 92)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !670, file: !403, line: 702, type: !11)
!670 = distinct !DILexicalBlock(scope: !671, file: !403, line: 702, column: 16)
!671 = distinct !DILexicalBlock(scope: !672, file: !403, line: 701, column: 73)
!672 = distinct !DILexicalBlock(scope: !624, file: !403, line: 701, column: 13)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !674, file: !403, line: 702, type: !11)
!674 = distinct !DILexicalBlock(scope: !675, file: !403, line: 702, column: 126)
!675 = distinct !DILexicalBlock(scope: !670, file: !403, line: 702, column: 92)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !677, file: !403, line: 703, type: !11)
!677 = distinct !DILexicalBlock(scope: !671, file: !403, line: 703, column: 16)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !679, file: !403, line: 703, type: !11)
!679 = distinct !DILexicalBlock(scope: !680, file: !403, line: 703, column: 126)
!680 = distinct !DILexicalBlock(scope: !677, file: !403, line: 703, column: 92)
!681 = !DISubprogram(name: "calc_number_widths", scope: !403, file: !403, line: 425, type: !682, isLocal: true, isDefinition: true, scopeLine: 430, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.NumberFieldWidths*, i64, i32, %struct._object*, i64, i64, i64, i32, %struct.LocaleInfo*, %struct.InternalFormatSpec*, i32*)* @calc_number_widths, variables: !687)
!682 = !DISubroutineType(types: !683)
!683 = !{!17, !684, !17, !350, !11, !17, !17, !17, !50, !685, !527, !396}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !600)
!687 = !{!688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701}
!688 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "spec", arg: 1, scope: !681, file: !403, line: 425, type: !684)
!689 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n_prefix", arg: 2, scope: !681, file: !403, line: 425, type: !17)
!690 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "sign_char", arg: 3, scope: !681, file: !403, line: 426, type: !350)
