; ModuleID = 'irs-onlybc/frameobject.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !11, subprograms: !504, globals: !967)
!1 = !DIFile(filename: "frameobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !4, line: 23, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!7 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!8 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!9 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!10 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!11 = !{!12, !13, !358, !359, !419, !102, !433, !52, !386, !489, !490, !497}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !15, line: 109, baseType: !16)
!15 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !15, line: 105, size: 128, align: 64, elements: !17)
!17 = !{!18, !26}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !16, file: !15, line: 107, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !20, line: 177, baseType: !21)
!20 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !22, line: 102, baseType: !23)
!22 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !24, line: 181, baseType: !25)
!24 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!25 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !16, file: !15, line: 108, baseType: !27, size: 64, align: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !15, line: 334, size: 3200, align: 64, elements: !29)
!29 = !{!30, !36, !40, !41, !42, !47, !110, !115, !120, !121, !126, !178, !209, !221, !227, !228, !229, !231, !233, !264, !265, !266, !275, !276, !281, !282, !284, !286, !296, !306, !324, !325, !326, !328, !330, !331, !333, !338, !343, !348, !349, !350, !351, !352, !353, !354, !355, !357}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !28, file: !15, line: 335, baseType: !31, size: 192, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !15, line: 114, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 111, size: 192, align: 64, elements: !33)
!33 = !{!34, !35}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !32, file: !15, line: 112, baseType: !14, size: 128, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !32, file: !15, line: 113, baseType: !19, size: 64, align: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !28, file: !15, line: 336, baseType: !37, size: 64, align: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !28, file: !15, line: 337, baseType: !19, size: 64, align: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !28, file: !15, line: 337, baseType: !19, size: 64, align: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !28, file: !15, line: 341, baseType: !43, size: 64, align: 64, offset: 384)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !15, line: 308, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{null, !13}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !28, file: !15, line: 342, baseType: !48, size: 64, align: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !15, line: 314, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!52, !13, !53, !52}
!52 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !22, line: 48, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !56, line: 246, size: 1728, align: 64, elements: !57)
!56 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!57 = !{!58, !59, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !79, !80, !81, !82, !84, !86, !88, !92, !95, !97, !98, !99, !100, !101, !105, !106}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !55, file: !56, line: 247, baseType: !52, size: 32, align: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !55, file: !56, line: 252, baseType: !60, size: 64, align: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !55, file: !56, line: 253, baseType: !60, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !55, file: !56, line: 254, baseType: !60, size: 64, align: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !55, file: !56, line: 255, baseType: !60, size: 64, align: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !55, file: !56, line: 256, baseType: !60, size: 64, align: 64, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !55, file: !56, line: 257, baseType: !60, size: 64, align: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !55, file: !56, line: 258, baseType: !60, size: 64, align: 64, offset: 448)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !55, file: !56, line: 259, baseType: !60, size: 64, align: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !55, file: !56, line: 261, baseType: !60, size: 64, align: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !55, file: !56, line: 262, baseType: !60, size: 64, align: 64, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !55, file: !56, line: 263, baseType: !60, size: 64, align: 64, offset: 704)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !55, file: !56, line: 265, baseType: !72, size: 64, align: 64, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !56, line: 161, size: 192, align: 64, elements: !74)
!74 = !{!75, !76, !78}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !73, file: !56, line: 162, baseType: !72, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !73, file: !56, line: 163, baseType: !77, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !73, file: !56, line: 167, baseType: !52, size: 32, align: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !55, file: !56, line: 267, baseType: !77, size: 64, align: 64, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !55, file: !56, line: 269, baseType: !52, size: 32, align: 32, offset: 896)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !55, file: !56, line: 273, baseType: !52, size: 32, align: 32, offset: 928)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !55, file: !56, line: 275, baseType: !83, size: 64, align: 64, offset: 960)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !24, line: 140, baseType: !25)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !55, file: !56, line: 279, baseType: !85, size: 16, align: 16, offset: 1024)
!85 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !55, file: !56, line: 280, baseType: !87, size: 8, align: 8, offset: 1040)
!87 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !55, file: !56, line: 281, baseType: !89, size: 8, align: 8, offset: 1048)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 8, align: 8, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 1)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !55, file: !56, line: 285, baseType: !93, size: 64, align: 64, offset: 1088)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !56, line: 155, baseType: null)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !55, file: !56, line: 294, baseType: !96, size: 64, align: 64, offset: 1152)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !24, line: 141, baseType: !25)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !55, file: !56, line: 303, baseType: !12, size: 64, align: 64, offset: 1216)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !55, file: !56, line: 304, baseType: !12, size: 64, align: 64, offset: 1280)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !55, file: !56, line: 305, baseType: !12, size: 64, align: 64, offset: 1344)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !55, file: !56, line: 306, baseType: !12, size: 64, align: 64, offset: 1408)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !55, file: !56, line: 307, baseType: !102, size: 64, align: 64, offset: 1472)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !103, line: 62, baseType: !104)
!103 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!104 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !55, file: !56, line: 309, baseType: !52, size: 32, align: 32, offset: 1536)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !55, file: !56, line: 311, baseType: !107, size: 160, align: 8, offset: 1568)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 160, align: 8, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 20)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !28, file: !15, line: 343, baseType: !111, size: 64, align: 64, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !15, line: 316, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!13, !13, !60}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !28, file: !15, line: 344, baseType: !116, size: 64, align: 64, offset: 576)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !15, line: 318, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!52, !13, !60, !13}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !28, file: !15, line: 345, baseType: !12, size: 64, align: 64, offset: 640)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !28, file: !15, line: 346, baseType: !122, size: 64, align: 64, offset: 704)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !15, line: 320, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!13, !13}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !28, file: !15, line: 350, baseType: !127, size: 64, align: 64, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !15, line: 278, baseType: !129)
!129 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 236, size: 2176, align: 64, elements: !130)
!130 = !{!131, !136, !137, !138, !139, !140, !145, !147, !148, !149, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !129, file: !15, line: 241, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !15, line: 166, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!13, !13, !13}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !129, file: !15, line: 242, baseType: !132, size: 64, align: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !129, file: !15, line: 243, baseType: !132, size: 64, align: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !129, file: !15, line: 244, baseType: !132, size: 64, align: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !129, file: !15, line: 245, baseType: !132, size: 64, align: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !129, file: !15, line: 246, baseType: !141, size: 64, align: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !15, line: 167, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!13, !13, !13, !13}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !129, file: !15, line: 247, baseType: !146, size: 64, align: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !15, line: 165, baseType: !123)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !129, file: !15, line: 248, baseType: !146, size: 64, align: 64, offset: 448)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !129, file: !15, line: 249, baseType: !146, size: 64, align: 64, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !129, file: !15, line: 250, baseType: !150, size: 64, align: 64, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !15, line: 168, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!52, !13}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !129, file: !15, line: 251, baseType: !146, size: 64, align: 64, offset: 640)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !129, file: !15, line: 252, baseType: !132, size: 64, align: 64, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !129, file: !15, line: 253, baseType: !132, size: 64, align: 64, offset: 768)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !129, file: !15, line: 254, baseType: !132, size: 64, align: 64, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !129, file: !15, line: 255, baseType: !132, size: 64, align: 64, offset: 896)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !129, file: !15, line: 256, baseType: !132, size: 64, align: 64, offset: 960)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !129, file: !15, line: 257, baseType: !146, size: 64, align: 64, offset: 1024)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !129, file: !15, line: 258, baseType: !12, size: 64, align: 64, offset: 1088)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !129, file: !15, line: 259, baseType: !146, size: 64, align: 64, offset: 1152)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !129, file: !15, line: 261, baseType: !132, size: 64, align: 64, offset: 1216)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !129, file: !15, line: 262, baseType: !132, size: 64, align: 64, offset: 1280)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !129, file: !15, line: 263, baseType: !132, size: 64, align: 64, offset: 1344)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !129, file: !15, line: 264, baseType: !132, size: 64, align: 64, offset: 1408)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !129, file: !15, line: 265, baseType: !141, size: 64, align: 64, offset: 1472)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !129, file: !15, line: 266, baseType: !132, size: 64, align: 64, offset: 1536)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !129, file: !15, line: 267, baseType: !132, size: 64, align: 64, offset: 1600)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !129, file: !15, line: 268, baseType: !132, size: 64, align: 64, offset: 1664)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !129, file: !15, line: 269, baseType: !132, size: 64, align: 64, offset: 1728)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !129, file: !15, line: 270, baseType: !132, size: 64, align: 64, offset: 1792)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !129, file: !15, line: 272, baseType: !132, size: 64, align: 64, offset: 1856)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !129, file: !15, line: 273, baseType: !132, size: 64, align: 64, offset: 1920)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !129, file: !15, line: 274, baseType: !132, size: 64, align: 64, offset: 1984)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !129, file: !15, line: 275, baseType: !132, size: 64, align: 64, offset: 2048)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !129, file: !15, line: 277, baseType: !146, size: 64, align: 64, offset: 2112)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !28, file: !15, line: 351, baseType: !179, size: 64, align: 64, offset: 832)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !15, line: 292, baseType: !181)
!181 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 280, size: 640, align: 64, elements: !182)
!182 = !{!183, !188, !189, !194, !195, !196, !201, !202, !207, !208}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !181, file: !15, line: 281, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !15, line: 169, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!19, !13}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !181, file: !15, line: 282, baseType: !132, size: 64, align: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !181, file: !15, line: 283, baseType: !190, size: 64, align: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !15, line: 170, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!13, !13, !19}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !181, file: !15, line: 284, baseType: !190, size: 64, align: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !181, file: !15, line: 285, baseType: !12, size: 64, align: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !181, file: !15, line: 286, baseType: !197, size: 64, align: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !15, line: 172, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!52, !13, !19, !13}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !181, file: !15, line: 287, baseType: !12, size: 64, align: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !181, file: !15, line: 288, baseType: !203, size: 64, align: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !15, line: 231, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!52, !13, !13}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !181, file: !15, line: 290, baseType: !132, size: 64, align: 64, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !181, file: !15, line: 291, baseType: !190, size: 64, align: 64, offset: 576)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !28, file: !15, line: 352, baseType: !210, size: 64, align: 64, offset: 896)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !15, line: 298, baseType: !212)
!212 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 294, size: 192, align: 64, elements: !213)
!213 = !{!214, !215, !216}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !212, file: !15, line: 295, baseType: !184, size: 64, align: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !212, file: !15, line: 296, baseType: !132, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !212, file: !15, line: 297, baseType: !217, size: 64, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !15, line: 174, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!52, !13, !13, !13}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !28, file: !15, line: 356, baseType: !222, size: 64, align: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !15, line: 321, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!226, !13}
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !20, line: 186, baseType: !19)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !28, file: !15, line: 357, baseType: !141, size: 64, align: 64, offset: 1024)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !28, file: !15, line: 358, baseType: !122, size: 64, align: 64, offset: 1088)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !28, file: !15, line: 359, baseType: !230, size: 64, align: 64, offset: 1152)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !15, line: 317, baseType: !133)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !28, file: !15, line: 360, baseType: !232, size: 64, align: 64, offset: 1216)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !15, line: 319, baseType: !218)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !28, file: !15, line: 363, baseType: !234, size: 64, align: 64, offset: 1280)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !15, line: 304, baseType: !236)
!236 = !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 301, size: 128, align: 64, elements: !237)
!237 = !{!238, !259}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !236, file: !15, line: 302, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !15, line: 193, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!52, !13, !243, !52}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !15, line: 191, baseType: !245)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !15, line: 178, size: 640, align: 64, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254, !256, !257, !258}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !245, file: !15, line: 179, baseType: !12, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !245, file: !15, line: 180, baseType: !13, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !245, file: !15, line: 181, baseType: !19, size: 64, align: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !245, file: !15, line: 182, baseType: !19, size: 64, align: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !245, file: !15, line: 184, baseType: !52, size: 32, align: 32, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !245, file: !15, line: 185, baseType: !52, size: 32, align: 32, offset: 288)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !245, file: !15, line: 186, baseType: !60, size: 64, align: 64, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !245, file: !15, line: 187, baseType: !255, size: 64, align: 64, offset: 384)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !245, file: !15, line: 188, baseType: !255, size: 64, align: 64, offset: 448)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !245, file: !15, line: 189, baseType: !255, size: 64, align: 64, offset: 512)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !245, file: !15, line: 190, baseType: !12, size: 64, align: 64, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !236, file: !15, line: 303, baseType: !260, size: 64, align: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !15, line: 194, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !13, !243}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !28, file: !15, line: 366, baseType: !104, size: 64, align: 64, offset: 1344)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !28, file: !15, line: 368, baseType: !37, size: 64, align: 64, offset: 1408)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !28, file: !15, line: 372, baseType: !267, size: 64, align: 64, offset: 1472)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !15, line: 233, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!52, !13, !271, !12}
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !15, line: 232, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!52, !13, !12}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !28, file: !15, line: 375, baseType: !150, size: 64, align: 64, offset: 1536)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !28, file: !15, line: 379, baseType: !277, size: 64, align: 64, offset: 1600)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !15, line: 322, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!13, !13, !13, !52}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !28, file: !15, line: 382, baseType: !19, size: 64, align: 64, offset: 1664)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !28, file: !15, line: 385, baseType: !283, size: 64, align: 64, offset: 1728)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !15, line: 323, baseType: !123)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !28, file: !15, line: 386, baseType: !285, size: 64, align: 64, offset: 1792)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !15, line: 324, baseType: !123)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !28, file: !15, line: 389, baseType: !287, size: 64, align: 64, offset: 1856)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !289, line: 40, size: 256, align: 64, elements: !290)
!289 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!290 = !{!291, !292, !294, !295}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !288, file: !289, line: 41, baseType: !37, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !288, file: !289, line: 42, baseType: !293, size: 64, align: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !289, line: 18, baseType: !133)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !288, file: !289, line: 43, baseType: !52, size: 32, align: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !288, file: !289, line: 45, baseType: !37, size: 64, align: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !28, file: !15, line: 390, baseType: !297, size: 64, align: 64, offset: 1920)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !299, line: 18, size: 320, align: 64, elements: !300)
!299 = !DIFile(filename: "Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!300 = !{!301, !302, !303, !304, !305}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !298, file: !299, line: 19, baseType: !60, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !298, file: !299, line: 20, baseType: !52, size: 32, align: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !298, file: !299, line: 21, baseType: !19, size: 64, align: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !298, file: !299, line: 22, baseType: !52, size: 32, align: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !298, file: !299, line: 23, baseType: !60, size: 64, align: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !28, file: !15, line: 391, baseType: !307, size: 64, align: 64, offset: 1984)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !309, line: 11, size: 320, align: 64, elements: !310)
!309 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!310 = !{!311, !312, !317, !322, !323}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !308, file: !309, line: 12, baseType: !60, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !308, file: !309, line: 13, baseType: !313, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !309, line: 8, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!13, !13, !12}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !308, file: !309, line: 14, baseType: !318, size: 64, align: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !309, line: 9, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!52, !13, !13, !12}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !308, file: !309, line: 15, baseType: !60, size: 64, align: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !308, file: !309, line: 16, baseType: !12, size: 64, align: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !28, file: !15, line: 392, baseType: !27, size: 64, align: 64, offset: 2048)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !28, file: !15, line: 393, baseType: !13, size: 64, align: 64, offset: 2112)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !28, file: !15, line: 394, baseType: !327, size: 64, align: 64, offset: 2176)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !15, line: 325, baseType: !142)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !28, file: !15, line: 395, baseType: !329, size: 64, align: 64, offset: 2240)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !15, line: 326, baseType: !218)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !28, file: !15, line: 396, baseType: !19, size: 64, align: 64, offset: 2304)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !28, file: !15, line: 397, baseType: !332, size: 64, align: 64, offset: 2368)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !15, line: 327, baseType: !218)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !28, file: !15, line: 398, baseType: !334, size: 64, align: 64, offset: 2432)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !15, line: 329, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!13, !27, !19}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !28, file: !15, line: 399, baseType: !339, size: 64, align: 64, offset: 2496)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !15, line: 328, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!13, !27, !13, !13}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !28, file: !15, line: 400, baseType: !344, size: 64, align: 64, offset: 2560)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !15, line: 307, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !12}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !28, file: !15, line: 401, baseType: !150, size: 64, align: 64, offset: 2624)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !28, file: !15, line: 402, baseType: !13, size: 64, align: 64, offset: 2688)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !28, file: !15, line: 403, baseType: !13, size: 64, align: 64, offset: 2752)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !28, file: !15, line: 404, baseType: !13, size: 64, align: 64, offset: 2816)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !28, file: !15, line: 405, baseType: !13, size: 64, align: 64, offset: 2880)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !28, file: !15, line: 406, baseType: !13, size: 64, align: 64, offset: 2944)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !28, file: !15, line: 407, baseType: !43, size: 64, align: 64, offset: 3008)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !28, file: !15, line: 410, baseType: !356, size: 32, align: 32, offset: 3072)
!356 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !28, file: !15, line: 412, baseType: !43, size: 64, align: 64, offset: 3136)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFrameObject", file: !361, line: 53, baseType: !362)
!361 = !DIFile(filename: "Include/frameobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !361, line: 17, size: 3072, align: 64, elements: !363)
!363 = !{!364, !365, !367, !394, !395, !396, !397, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !417}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !362, file: !361, line: 18, baseType: !31, size: 192, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "f_back", scope: !362, file: !361, line: 19, baseType: !366, size: 64, align: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "f_code", scope: !362, file: !361, line: 20, baseType: !368, size: 64, align: 64, offset: 256)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !370, line: 33, baseType: !371)
!370 = !DIFile(filename: "Include/code.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!371 = !DICompositeType(tag: DW_TAG_structure_type, file: !370, line: 11, size: 1152, align: 64, elements: !372)
!372 = !{!373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !388, !389, !390, !391, !392, !393}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !371, file: !370, line: 12, baseType: !14, size: 128, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !371, file: !370, line: 13, baseType: !52, size: 32, align: 32, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !371, file: !370, line: 14, baseType: !52, size: 32, align: 32, offset: 160)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !371, file: !370, line: 15, baseType: !52, size: 32, align: 32, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !371, file: !370, line: 16, baseType: !52, size: 32, align: 32, offset: 224)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !371, file: !370, line: 17, baseType: !52, size: 32, align: 32, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "co_code", scope: !371, file: !370, line: 18, baseType: !13, size: 64, align: 64, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !371, file: !370, line: 19, baseType: !13, size: 64, align: 64, offset: 384)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !371, file: !370, line: 20, baseType: !13, size: 64, align: 64, offset: 448)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "co_varnames", scope: !371, file: !370, line: 21, baseType: !13, size: 64, align: 64, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "co_freevars", scope: !371, file: !370, line: 22, baseType: !13, size: 64, align: 64, offset: 576)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "co_cellvars", scope: !371, file: !370, line: 23, baseType: !13, size: 64, align: 64, offset: 640)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "co_cell2arg", scope: !371, file: !370, line: 25, baseType: !386, size: 64, align: 64, offset: 704)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !371, file: !370, line: 26, baseType: !13, size: 64, align: 64, offset: 768)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !371, file: !370, line: 27, baseType: !13, size: 64, align: 64, offset: 832)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !371, file: !370, line: 28, baseType: !52, size: 32, align: 32, offset: 896)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "co_lnotab", scope: !371, file: !370, line: 29, baseType: !13, size: 64, align: 64, offset: 960)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "co_zombieframe", scope: !371, file: !370, line: 31, baseType: !12, size: 64, align: 64, offset: 1024)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !371, file: !370, line: 32, baseType: !13, size: 64, align: 64, offset: 1088)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "f_builtins", scope: !362, file: !361, line: 21, baseType: !13, size: 64, align: 64, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "f_globals", scope: !362, file: !361, line: 22, baseType: !13, size: 64, align: 64, offset: 384)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "f_locals", scope: !362, file: !361, line: 23, baseType: !13, size: 64, align: 64, offset: 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "f_valuestack", scope: !362, file: !361, line: 24, baseType: !398, size: 64, align: 64, offset: 512)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "f_stacktop", scope: !362, file: !361, line: 28, baseType: !398, size: 64, align: 64, offset: 576)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "f_trace", scope: !362, file: !361, line: 29, baseType: !13, size: 64, align: 64, offset: 640)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_type", scope: !362, file: !361, line: 38, baseType: !13, size: 64, align: 64, offset: 704)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_value", scope: !362, file: !361, line: 38, baseType: !13, size: 64, align: 64, offset: 768)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "f_exc_traceback", scope: !362, file: !361, line: 38, baseType: !13, size: 64, align: 64, offset: 832)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "f_gen", scope: !362, file: !361, line: 40, baseType: !13, size: 64, align: 64, offset: 896)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "f_lasti", scope: !362, file: !361, line: 42, baseType: !52, size: 32, align: 32, offset: 960)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "f_lineno", scope: !362, file: !361, line: 48, baseType: !52, size: 32, align: 32, offset: 992)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "f_iblock", scope: !362, file: !361, line: 49, baseType: !52, size: 32, align: 32, offset: 1024)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "f_executing", scope: !362, file: !361, line: 50, baseType: !39, size: 8, align: 8, offset: 1056)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "f_blockstack", scope: !362, file: !361, line: 51, baseType: !410, size: 1920, align: 32, offset: 1088)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 1920, align: 32, elements: !108)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTryBlock", file: !361, line: 15, baseType: !412)
!412 = !DICompositeType(tag: DW_TAG_structure_type, file: !361, line: 11, size: 96, align: 32, elements: !413)
!413 = !{!414, !415, !416}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "b_type", scope: !412, file: !361, line: 12, baseType: !52, size: 32, align: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "b_handler", scope: !412, file: !361, line: 13, baseType: !52, size: 32, align: 32, offset: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "b_level", scope: !412, file: !361, line: 14, baseType: !52, size: 32, align: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "f_localsplus", scope: !362, file: !361, line: 52, baseType: !418, size: 64, align: 64, offset: 3008)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 64, align: 64, elements: !90)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !421, line: 253, baseType: !422)
!421 = !DIFile(filename: "Include/objimpl.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!422 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !421, line: 246, size: 192, align: 64, elements: !423)
!423 = !{!424, !431}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !422, file: !421, line: 251, baseType: !425, size: 192, align: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, scope: !422, file: !421, line: 247, size: 192, align: 64, elements: !426)
!426 = !{!427, !429, !430}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !425, file: !421, line: 248, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !425, file: !421, line: 249, baseType: !428, size: 64, align: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !425, file: !421, line: 250, baseType: !19, size: 64, align: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !422, file: !421, line: 252, baseType: !432, size: 64, align: 64)
!432 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !435, line: 139, baseType: !436)
!435 = !DIFile(filename: "Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !435, line: 69, size: 1536, align: 64, elements: !437)
!437 = !{!438, !440, !441, !461, !462, !463, !464, !465, !466, !467, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !436, file: !435, line: 72, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !436, file: !435, line: 73, baseType: !439, size: 64, align: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !436, file: !435, line: 74, baseType: !442, size: 64, align: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !435, line: 44, baseType: !444)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !435, line: 19, size: 832, align: 64, elements: !445)
!445 = !{!446, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !444, file: !435, line: 21, baseType: !447, size: 64, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !444, file: !435, line: 22, baseType: !439, size: 64, align: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !444, file: !435, line: 24, baseType: !13, size: 64, align: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !444, file: !435, line: 25, baseType: !13, size: 64, align: 64, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !444, file: !435, line: 26, baseType: !13, size: 64, align: 64, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !444, file: !435, line: 27, baseType: !13, size: 64, align: 64, offset: 320)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !444, file: !435, line: 28, baseType: !13, size: 64, align: 64, offset: 384)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !444, file: !435, line: 30, baseType: !13, size: 64, align: 64, offset: 448)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !444, file: !435, line: 31, baseType: !13, size: 64, align: 64, offset: 512)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !444, file: !435, line: 32, baseType: !13, size: 64, align: 64, offset: 576)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !444, file: !435, line: 33, baseType: !52, size: 32, align: 32, offset: 640)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !444, file: !435, line: 34, baseType: !52, size: 32, align: 32, offset: 672)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !444, file: !435, line: 37, baseType: !52, size: 32, align: 32, offset: 704)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !444, file: !435, line: 43, baseType: !13, size: 64, align: 64, offset: 768)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !436, file: !435, line: 76, baseType: !366, size: 64, align: 64, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !436, file: !435, line: 77, baseType: !52, size: 32, align: 32, offset: 256)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !436, file: !435, line: 78, baseType: !39, size: 8, align: 8, offset: 288)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !436, file: !435, line: 80, baseType: !39, size: 8, align: 8, offset: 296)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !436, file: !435, line: 85, baseType: !52, size: 32, align: 32, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !436, file: !435, line: 86, baseType: !52, size: 32, align: 32, offset: 352)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !436, file: !435, line: 88, baseType: !468, size: 64, align: 64, offset: 384)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !435, line: 54, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!52, !13, !366, !52, !13}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !436, file: !435, line: 89, baseType: !468, size: 64, align: 64, offset: 448)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !436, file: !435, line: 90, baseType: !13, size: 64, align: 64, offset: 512)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !436, file: !435, line: 91, baseType: !13, size: 64, align: 64, offset: 576)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !436, file: !435, line: 93, baseType: !13, size: 64, align: 64, offset: 640)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !436, file: !435, line: 94, baseType: !13, size: 64, align: 64, offset: 704)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !436, file: !435, line: 95, baseType: !13, size: 64, align: 64, offset: 768)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !436, file: !435, line: 97, baseType: !13, size: 64, align: 64, offset: 832)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !436, file: !435, line: 98, baseType: !13, size: 64, align: 64, offset: 896)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !436, file: !435, line: 99, baseType: !13, size: 64, align: 64, offset: 960)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !436, file: !435, line: 101, baseType: !13, size: 64, align: 64, offset: 1024)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !436, file: !435, line: 103, baseType: !52, size: 32, align: 32, offset: 1088)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !436, file: !435, line: 105, baseType: !13, size: 64, align: 64, offset: 1152)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !436, file: !435, line: 106, baseType: !25, size: 64, align: 64, offset: 1216)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !436, file: !435, line: 108, baseType: !52, size: 32, align: 32, offset: 1280)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !436, file: !435, line: 109, baseType: !13, size: 64, align: 64, offset: 1344)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !436, file: !435, line: 134, baseType: !345, size: 64, align: 64, offset: 1408)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !436, file: !435, line: 135, baseType: !12, size: 64, align: 64, offset: 1472)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !492, line: 33, baseType: !493)
!492 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!493 = !DICompositeType(tag: DW_TAG_structure_type, file: !492, line: 25, size: 256, align: 64, elements: !494)
!494 = !{!495, !496}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !493, file: !492, line: 26, baseType: !31, size: 192, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !493, file: !492, line: 27, baseType: !418, size: 64, align: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCellObject", file: !499, line: 12, baseType: !500)
!499 = !DIFile(filename: "Include/cellobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!500 = !DICompositeType(tag: DW_TAG_structure_type, file: !499, line: 9, size: 192, align: 64, elements: !501)
!501 = !{!502, !503}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !500, file: !499, line: 10, baseType: !14, size: 128, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ob_ref", scope: !500, file: !499, line: 11, baseType: !13, size: 64, align: 64, offset: 128)
!504 = !{!505, !511, !515, !557, !567, !573, !583, !589, !605, !610, !613, !618, !699, !708, !713, !716, !777, !827, !832, !839, !845, !849, !901, !906, !921, !936}
!505 = !DISubprogram(name: "PyFrame_GetLineNumber", scope: !506, file: !506, line: 31, type: !507, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._frame*)* @PyFrame_GetLineNumber, variables: !509)
!506 = !DIFile(filename: "Objects/frameobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!507 = !DISubroutineType(types: !508)
!508 = !{!52, !359}
!509 = !{!510}
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !505, file: !506, line: 31, type: !359)
!511 = !DISubprogram(name: "_PyFrame_Init", scope: !506, file: !506, line: 606, type: !512, isLocal: false, isDefinition: true, scopeLine: 607, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @_PyFrame_Init, variables: !514)
!512 = !DISubroutineType(types: !513)
!513 = !{!52}
!514 = !{}
!515 = !DISubprogram(name: "PyFrame_New", scope: !506, file: !506, line: 615, type: !516, isLocal: false, isDefinition: true, scopeLine: 617, flags: DIFlagPrototyped, isOptimized: true, function: %struct._frame* (%struct._ts*, %struct.PyCodeObject*, %struct._object*, %struct._object*)* @PyFrame_New, variables: !518)
!516 = !DISubroutineType(types: !517)
!517 = !{!359, !433, !368, !13, !13}
!518 = !{!519, !520, !521, !522, !523, !524, !525, !526, !527, !530, !531, !532, !538, !542, !546, !548, !555}
!519 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "tstate", arg: 1, scope: !515, file: !506, line: 615, type: !433)
!520 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "code", arg: 2, scope: !515, file: !506, line: 615, type: !368)
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "globals", arg: 3, scope: !515, file: !506, line: 615, type: !13)
!522 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "locals", arg: 4, scope: !515, file: !506, line: 616, type: !13)
!523 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "back", scope: !515, file: !506, line: 618, type: !359)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !515, file: !506, line: 619, type: !359)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "builtins", scope: !515, file: !506, line: 620, type: !13)
!526 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !515, file: !506, line: 621, type: !19)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "extras", scope: !528, file: !506, line: 665, type: !19)
!528 = distinct !DILexicalBlock(scope: !529, file: !506, line: 664, column: 10)
!529 = distinct !DILexicalBlock(scope: !515, file: !506, line: 658, column: 9)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncells", scope: !528, file: !506, line: 665, type: !19)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfrees", scope: !528, file: !506, line: 665, type: !19)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !533, file: !506, line: 674, type: !13)
!533 = distinct !DILexicalBlock(scope: !534, file: !506, line: 674, column: 20)
!534 = distinct !DILexicalBlock(scope: !535, file: !506, line: 673, column: 34)
!535 = distinct !DILexicalBlock(scope: !536, file: !506, line: 673, column: 17)
!536 = distinct !DILexicalBlock(scope: !537, file: !506, line: 670, column: 38)
!537 = distinct !DILexicalBlock(scope: !528, file: !506, line: 670, column: 13)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_f", scope: !539, file: !506, line: 684, type: !359)
!539 = distinct !DILexicalBlock(scope: !540, file: !506, line: 683, column: 58)
!540 = distinct !DILexicalBlock(scope: !541, file: !506, line: 683, column: 17)
!541 = distinct !DILexicalBlock(scope: !537, file: !506, line: 678, column: 14)
!542 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !543, file: !506, line: 687, type: !13)
!543 = distinct !DILexicalBlock(scope: !544, file: !506, line: 687, column: 24)
!544 = distinct !DILexicalBlock(scope: !545, file: !506, line: 685, column: 42)
!545 = distinct !DILexicalBlock(scope: !539, file: !506, line: 685, column: 21)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !547, file: !506, line: 706, type: !13)
!547 = distinct !DILexicalBlock(scope: !515, file: !506, line: 706, column: 8)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !549, file: !506, line: 718, type: !13)
!549 = distinct !DILexicalBlock(scope: !550, file: !506, line: 718, column: 16)
!550 = distinct !DILexicalBlock(scope: !551, file: !506, line: 717, column: 35)
!551 = distinct !DILexicalBlock(scope: !552, file: !506, line: 717, column: 13)
!552 = distinct !DILexicalBlock(scope: !553, file: !506, line: 715, column: 39)
!553 = distinct !DILexicalBlock(scope: !554, file: !506, line: 715, column: 14)
!554 = distinct !DILexicalBlock(scope: !515, file: !506, line: 712, column: 9)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !556, file: !506, line: 736, type: !419)
!556 = distinct !DILexicalBlock(scope: !515, file: !506, line: 736, column: 8)
!557 = !DISubprogram(name: "PyFrame_BlockSetup", scope: !506, file: !506, line: 743, type: !558, isLocal: false, isDefinition: true, scopeLine: 744, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._frame*, i32, i32, i32)* @PyFrame_BlockSetup, variables: !560)
!558 = !DISubroutineType(types: !559)
!559 = !{null, !359, !52, !52, !52}
!560 = !{!561, !562, !563, !564, !565}
!561 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !557, file: !506, line: 743, type: !359)
!562 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 2, scope: !557, file: !506, line: 743, type: !52)
!563 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "handler", arg: 3, scope: !557, file: !506, line: 743, type: !52)
!564 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "level", arg: 4, scope: !557, file: !506, line: 743, type: !52)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !557, file: !506, line: 745, type: !566)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64, align: 64)
!567 = !DISubprogram(name: "PyFrame_BlockPop", scope: !506, file: !506, line: 755, type: !568, isLocal: false, isDefinition: true, scopeLine: 756, flags: DIFlagPrototyped, isOptimized: true, function: %struct.PyTryBlock* (%struct._frame*)* @PyFrame_BlockPop, variables: !570)
!568 = !DISubroutineType(types: !569)
!569 = !{!566, !359}
!570 = !{!571, !572}
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !567, file: !506, line: 755, type: !359)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !567, file: !506, line: 757, type: !566)
!573 = !DISubprogram(name: "PyFrame_FastToLocalsWithError", scope: !506, file: !506, line: 864, type: !507, isLocal: false, isDefinition: true, scopeLine: 865, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._frame*)* @PyFrame_FastToLocalsWithError, variables: !574)
!574 = !{!575, !576, !577, !578, !579, !580, !581, !582}
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !573, file: !506, line: 864, type: !359)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "locals", scope: !573, file: !506, line: 867, type: !13)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map", scope: !573, file: !506, line: 867, type: !13)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fast", scope: !573, file: !506, line: 868, type: !398)
!579 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "co", scope: !573, file: !506, line: 869, type: !368)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !573, file: !506, line: 870, type: !19)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncells", scope: !573, file: !506, line: 871, type: !19)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfreevars", scope: !573, file: !506, line: 871, type: !19)
!583 = !DISubprogram(name: "PyFrame_FastToLocals", scope: !506, file: !506, line: 924, type: !584, isLocal: false, isDefinition: true, scopeLine: 925, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._frame*)* @PyFrame_FastToLocals, variables: !586)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !359}
!586 = !{!587, !588}
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !583, file: !506, line: 924, type: !359)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !583, file: !506, line: 926, type: !52)
!589 = !DISubprogram(name: "PyFrame_LocalsToFast", scope: !506, file: !506, line: 936, type: !590, isLocal: false, isDefinition: true, scopeLine: 937, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._frame*, i32)* @PyFrame_LocalsToFast, variables: !592)
!590 = !DISubroutineType(types: !591)
!591 = !{null, !359, !52}
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604}
!593 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !589, file: !506, line: 936, type: !359)
!594 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "clear", arg: 2, scope: !589, file: !506, line: 936, type: !52)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "locals", scope: !589, file: !506, line: 939, type: !13)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "map", scope: !589, file: !506, line: 939, type: !13)
!597 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fast", scope: !589, file: !506, line: 940, type: !398)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error_type", scope: !589, file: !506, line: 941, type: !13)
!599 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error_value", scope: !589, file: !506, line: 941, type: !13)
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error_traceback", scope: !589, file: !506, line: 941, type: !13)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "co", scope: !589, file: !506, line: 942, type: !368)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !589, file: !506, line: 943, type: !19)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncells", scope: !589, file: !506, line: 944, type: !19)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfreevars", scope: !589, file: !506, line: 944, type: !19)
!605 = !DISubprogram(name: "PyFrame_ClearFreeList", scope: !506, file: !506, line: 978, type: !512, isLocal: false, isDefinition: true, scopeLine: 979, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @PyFrame_ClearFreeList, variables: !606)
!606 = !{!607, !608}
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "freelist_size", scope: !605, file: !506, line: 980, type: !52)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !609, file: !506, line: 983, type: !359)
!609 = distinct !DILexicalBlock(scope: !605, file: !506, line: 982, column: 37)
!610 = !DISubprogram(name: "PyFrame_Fini", scope: !506, file: !506, line: 993, type: !611, isLocal: false, isDefinition: true, scopeLine: 994, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyFrame_Fini, variables: !514)
!611 = !DISubroutineType(types: !612)
!612 = !{null}
!613 = !DISubprogram(name: "_PyFrame_DebugMallocStats", scope: !506, file: !506, line: 1000, type: !614, isLocal: false, isDefinition: true, scopeLine: 1001, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IO_FILE*)* @_PyFrame_DebugMallocStats, variables: !616)
!614 = !DISubroutineType(types: !615)
!615 = !{null, !53}
!616 = !{!617}
!617 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !613, file: !506, line: 1000, type: !53)
!618 = !DISubprogram(name: "frame_dealloc", scope: !506, file: !506, line: 419, type: !584, isLocal: true, isDefinition: true, scopeLine: 420, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._frame*)* @frame_dealloc, variables: !619)
!619 = !{!620, !621, !622, !623, !624, !626, !633, !634, !637, !639, !645, !649, !655, !658, !660, !663, !665, !667, !669, !673, !675, !679, !681, !685, !687, !691, !693, !697}
!620 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !618, file: !506, line: 419, type: !359)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !618, file: !506, line: 421, type: !398)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "valuestack", scope: !618, file: !506, line: 421, type: !398)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "co", scope: !618, file: !506, line: 422, type: !368)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_tstate", scope: !625, file: !506, line: 425, type: !433)
!625 = distinct !DILexicalBlock(scope: !618, file: !506, line: 425, column: 8)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "atomic_val", scope: !627, file: !506, line: 425, type: !628)
!627 = distinct !DILexicalBlock(scope: !625, file: !506, line: 425, column: 67)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64, align: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_atomic_address", file: !4, line: 33, baseType: !630)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_atomic_address", file: !4, line: 31, size: 64, align: 64, elements: !631)
!631 = !{!632}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_value", scope: !630, file: !4, line: 32, baseType: !12, size: 64, align: 64)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !627, file: !506, line: 425, type: !12)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "volatile_data", scope: !627, file: !506, line: 425, type: !635)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64, align: 64)
!636 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !12)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "order", scope: !627, file: !506, line: 425, type: !638)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_memory_order", file: !4, line: 29, baseType: !3)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !640, file: !506, line: 429, type: !13)
!640 = distinct !DILexicalBlock(scope: !641, file: !506, line: 429, column: 12)
!641 = distinct !DILexicalBlock(scope: !642, file: !506, line: 428, column: 5)
!642 = distinct !DILexicalBlock(scope: !643, file: !506, line: 428, column: 5)
!643 = distinct !DILexicalBlock(scope: !644, file: !506, line: 425, column: 797)
!644 = distinct !DILexicalBlock(scope: !625, file: !506, line: 425, column: 761)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !646, file: !506, line: 429, type: !13)
!646 = distinct !DILexicalBlock(scope: !647, file: !506, line: 429, column: 103)
!647 = distinct !DILexicalBlock(scope: !648, file: !506, line: 429, column: 79)
!648 = distinct !DILexicalBlock(scope: !640, file: !506, line: 429, column: 56)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !650, file: !506, line: 434, type: !13)
!650 = distinct !DILexicalBlock(scope: !651, file: !506, line: 434, column: 16)
!651 = distinct !DILexicalBlock(scope: !652, file: !506, line: 433, column: 9)
!652 = distinct !DILexicalBlock(scope: !653, file: !506, line: 433, column: 9)
!653 = distinct !DILexicalBlock(scope: !654, file: !506, line: 432, column: 38)
!654 = distinct !DILexicalBlock(scope: !643, file: !506, line: 432, column: 9)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !656, file: !506, line: 434, type: !13)
!656 = distinct !DILexicalBlock(scope: !657, file: !506, line: 434, column: 102)
!657 = distinct !DILexicalBlock(scope: !650, file: !506, line: 434, column: 68)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !659, file: !506, line: 437, type: !13)
!659 = distinct !DILexicalBlock(scope: !643, file: !506, line: 437, column: 8)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !661, file: !506, line: 437, type: !13)
!661 = distinct !DILexicalBlock(scope: !662, file: !506, line: 437, column: 101)
!662 = distinct !DILexicalBlock(scope: !659, file: !506, line: 437, column: 67)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !664, file: !506, line: 438, type: !13)
!664 = distinct !DILexicalBlock(scope: !643, file: !506, line: 438, column: 8)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !666, file: !506, line: 439, type: !13)
!666 = distinct !DILexicalBlock(scope: !643, file: !506, line: 439, column: 8)
!667 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !668, file: !506, line: 440, type: !13)
!668 = distinct !DILexicalBlock(scope: !643, file: !506, line: 440, column: 8)
!669 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !670, file: !506, line: 440, type: !13)
!670 = distinct !DILexicalBlock(scope: !671, file: !506, line: 440, column: 117)
!671 = distinct !DILexicalBlock(scope: !672, file: !506, line: 440, column: 84)
!672 = distinct !DILexicalBlock(scope: !668, file: !506, line: 440, column: 61)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !674, file: !506, line: 441, type: !13)
!674 = distinct !DILexicalBlock(scope: !643, file: !506, line: 441, column: 8)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !676, file: !506, line: 441, type: !13)
!676 = distinct !DILexicalBlock(scope: !677, file: !506, line: 441, column: 115)
!677 = distinct !DILexicalBlock(scope: !678, file: !506, line: 441, column: 83)
!678 = distinct !DILexicalBlock(scope: !674, file: !506, line: 441, column: 60)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !680, file: !506, line: 442, type: !13)
!680 = distinct !DILexicalBlock(scope: !643, file: !506, line: 442, column: 8)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !682, file: !506, line: 442, type: !13)
!682 = distinct !DILexicalBlock(scope: !683, file: !506, line: 442, column: 121)
!683 = distinct !DILexicalBlock(scope: !684, file: !506, line: 442, column: 86)
!684 = distinct !DILexicalBlock(scope: !680, file: !506, line: 442, column: 63)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !686, file: !506, line: 443, type: !13)
!686 = distinct !DILexicalBlock(scope: !643, file: !506, line: 443, column: 8)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !688, file: !506, line: 443, type: !13)
!688 = distinct !DILexicalBlock(scope: !689, file: !506, line: 443, column: 123)
!689 = distinct !DILexicalBlock(scope: !690, file: !506, line: 443, column: 87)
!690 = distinct !DILexicalBlock(scope: !686, file: !506, line: 443, column: 64)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !692, file: !506, line: 444, type: !13)
!692 = distinct !DILexicalBlock(scope: !643, file: !506, line: 444, column: 8)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !694, file: !506, line: 444, type: !13)
!694 = distinct !DILexicalBlock(scope: !695, file: !506, line: 444, column: 131)
!695 = distinct !DILexicalBlock(scope: !696, file: !506, line: 444, column: 91)
!696 = distinct !DILexicalBlock(scope: !692, file: !506, line: 444, column: 68)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !698, file: !506, line: 457, type: !13)
!698 = distinct !DILexicalBlock(scope: !643, file: !506, line: 457, column: 8)
!699 = !DISubprogram(name: "_Py_ANNOTATE_MEMORY_ORDER", scope: !4, file: !4, line: 59, type: !700, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i32)* @_Py_ANNOTATE_MEMORY_ORDER, variables: !705)
!700 = !DISubroutineType(types: !701)
!701 = !{null, !702, !638}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!705 = !{!706, !707}
!706 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "address", arg: 1, scope: !699, file: !4, line: 59, type: !702)
!707 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 2, scope: !699, file: !4, line: 59, type: !638)
!708 = !DISubprogram(name: "_Py_atomic_thread_fence", scope: !4, file: !4, line: 51, type: !709, isLocal: true, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @_Py_atomic_thread_fence, variables: !711)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !638}
!711 = !{!712}
!712 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !708, file: !4, line: 51, type: !638)
!713 = !DISubprogram(name: "_Py_atomic_signal_fence", scope: !4, file: !4, line: 44, type: !709, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, function: void (i32)* @_Py_atomic_signal_fence, variables: !714)
!714 = !{!715}
!715 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "order", arg: 1, scope: !713, file: !4, line: 44, type: !638)
!716 = !DISubprogram(name: "frame_traverse", scope: !506, file: !506, line: 462, type: !717, isLocal: true, isDefinition: true, scopeLine: 463, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._frame*, i32 (%struct._object*, i8*)*, i8*)* @frame_traverse, variables: !719)
!717 = !DISubroutineType(types: !718)
!718 = !{!52, !359, !271, !12}
!719 = !{!720, !721, !722, !723, !724, !725, !726, !727, !731, !735, !739, !743, !747, !751, !755, !759, !763, !769}
!720 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !716, file: !506, line: 462, type: !359)
!721 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !716, file: !506, line: 462, type: !271)
!722 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !716, file: !506, line: 462, type: !12)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fastlocals", scope: !716, file: !506, line: 464, type: !398)
!724 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !716, file: !506, line: 464, type: !398)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !716, file: !506, line: 465, type: !19)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slots", scope: !716, file: !506, line: 465, type: !19)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !728, file: !506, line: 467, type: !52)
!728 = distinct !DILexicalBlock(scope: !729, file: !506, line: 467, column: 25)
!729 = distinct !DILexicalBlock(scope: !730, file: !506, line: 467, column: 14)
!730 = distinct !DILexicalBlock(scope: !716, file: !506, line: 467, column: 8)
!731 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !732, file: !506, line: 468, type: !52)
!732 = distinct !DILexicalBlock(scope: !733, file: !506, line: 468, column: 25)
!733 = distinct !DILexicalBlock(scope: !734, file: !506, line: 468, column: 14)
!734 = distinct !DILexicalBlock(scope: !716, file: !506, line: 468, column: 8)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !736, file: !506, line: 469, type: !52)
!736 = distinct !DILexicalBlock(scope: !737, file: !506, line: 469, column: 29)
!737 = distinct !DILexicalBlock(scope: !738, file: !506, line: 469, column: 14)
!738 = distinct !DILexicalBlock(scope: !716, file: !506, line: 469, column: 8)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !740, file: !506, line: 470, type: !52)
!740 = distinct !DILexicalBlock(scope: !741, file: !506, line: 470, column: 28)
!741 = distinct !DILexicalBlock(scope: !742, file: !506, line: 470, column: 14)
!742 = distinct !DILexicalBlock(scope: !716, file: !506, line: 470, column: 8)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !744, file: !506, line: 471, type: !52)
!744 = distinct !DILexicalBlock(scope: !745, file: !506, line: 471, column: 27)
!745 = distinct !DILexicalBlock(scope: !746, file: !506, line: 471, column: 14)
!746 = distinct !DILexicalBlock(scope: !716, file: !506, line: 471, column: 8)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !748, file: !506, line: 472, type: !52)
!748 = distinct !DILexicalBlock(scope: !749, file: !506, line: 472, column: 26)
!749 = distinct !DILexicalBlock(scope: !750, file: !506, line: 472, column: 14)
!750 = distinct !DILexicalBlock(scope: !716, file: !506, line: 472, column: 8)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !752, file: !506, line: 473, type: !52)
!752 = distinct !DILexicalBlock(scope: !753, file: !506, line: 473, column: 29)
!753 = distinct !DILexicalBlock(scope: !754, file: !506, line: 473, column: 14)
!754 = distinct !DILexicalBlock(scope: !716, file: !506, line: 473, column: 8)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !756, file: !506, line: 474, type: !52)
!756 = distinct !DILexicalBlock(scope: !757, file: !506, line: 474, column: 30)
!757 = distinct !DILexicalBlock(scope: !758, file: !506, line: 474, column: 14)
!758 = distinct !DILexicalBlock(scope: !716, file: !506, line: 474, column: 8)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !760, file: !506, line: 475, type: !52)
!760 = distinct !DILexicalBlock(scope: !761, file: !506, line: 475, column: 34)
!761 = distinct !DILexicalBlock(scope: !762, file: !506, line: 475, column: 14)
!762 = distinct !DILexicalBlock(scope: !716, file: !506, line: 475, column: 8)
!763 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !764, file: !506, line: 481, type: !52)
!764 = distinct !DILexicalBlock(scope: !765, file: !506, line: 481, column: 31)
!765 = distinct !DILexicalBlock(scope: !766, file: !506, line: 481, column: 18)
!766 = distinct !DILexicalBlock(scope: !767, file: !506, line: 481, column: 12)
!767 = distinct !DILexicalBlock(scope: !768, file: !506, line: 480, column: 5)
!768 = distinct !DILexicalBlock(scope: !716, file: !506, line: 480, column: 5)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !770, file: !506, line: 486, type: !52)
!770 = distinct !DILexicalBlock(scope: !771, file: !506, line: 486, column: 26)
!771 = distinct !DILexicalBlock(scope: !772, file: !506, line: 486, column: 22)
!772 = distinct !DILexicalBlock(scope: !773, file: !506, line: 486, column: 16)
!773 = distinct !DILexicalBlock(scope: !774, file: !506, line: 485, column: 9)
!774 = distinct !DILexicalBlock(scope: !775, file: !506, line: 485, column: 9)
!775 = distinct !DILexicalBlock(scope: !776, file: !506, line: 484, column: 38)
!776 = distinct !DILexicalBlock(scope: !716, file: !506, line: 484, column: 9)
!777 = !DISubprogram(name: "frame_tp_clear", scope: !506, file: !506, line: 492, type: !584, isLocal: true, isDefinition: true, scopeLine: 493, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._frame*)* @frame_tp_clear, variables: !778)
!778 = !{!779, !780, !781, !782, !783, !784, !785, !787, !791, !793, !797, !799, !803, !805, !809, !813, !817, !823}
!779 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !777, file: !506, line: 492, type: !359)
!780 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fastlocals", scope: !777, file: !506, line: 494, type: !398)
!781 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !777, file: !506, line: 494, type: !398)
!782 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldtop", scope: !777, file: !506, line: 494, type: !398)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !777, file: !506, line: 495, type: !19)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slots", scope: !777, file: !506, line: 495, type: !19)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !786, file: !506, line: 506, type: !13)
!786 = distinct !DILexicalBlock(scope: !777, file: !506, line: 506, column: 8)
!787 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !788, file: !506, line: 506, type: !13)
!788 = distinct !DILexicalBlock(scope: !789, file: !506, line: 506, column: 121)
!789 = distinct !DILexicalBlock(scope: !790, file: !506, line: 506, column: 86)
!790 = distinct !DILexicalBlock(scope: !786, file: !506, line: 506, column: 63)
!791 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !792, file: !506, line: 507, type: !13)
!792 = distinct !DILexicalBlock(scope: !777, file: !506, line: 507, column: 8)
!793 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !794, file: !506, line: 507, type: !13)
!794 = distinct !DILexicalBlock(scope: !795, file: !506, line: 507, column: 123)
!795 = distinct !DILexicalBlock(scope: !796, file: !506, line: 507, column: 87)
!796 = distinct !DILexicalBlock(scope: !792, file: !506, line: 507, column: 64)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !798, file: !506, line: 508, type: !13)
!798 = distinct !DILexicalBlock(scope: !777, file: !506, line: 508, column: 8)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !800, file: !506, line: 508, type: !13)
!800 = distinct !DILexicalBlock(scope: !801, file: !506, line: 508, column: 131)
!801 = distinct !DILexicalBlock(scope: !802, file: !506, line: 508, column: 91)
!802 = distinct !DILexicalBlock(scope: !798, file: !506, line: 508, column: 68)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !804, file: !506, line: 509, type: !13)
!804 = distinct !DILexicalBlock(scope: !777, file: !506, line: 509, column: 8)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !806, file: !506, line: 509, type: !13)
!806 = distinct !DILexicalBlock(scope: !807, file: !506, line: 509, column: 115)
!807 = distinct !DILexicalBlock(scope: !808, file: !506, line: 509, column: 83)
!808 = distinct !DILexicalBlock(scope: !804, file: !506, line: 509, column: 60)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !810, file: !506, line: 515, type: !13)
!810 = distinct !DILexicalBlock(scope: !811, file: !506, line: 515, column: 12)
!811 = distinct !DILexicalBlock(scope: !812, file: !506, line: 514, column: 5)
!812 = distinct !DILexicalBlock(scope: !777, file: !506, line: 514, column: 5)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !814, file: !506, line: 515, type: !13)
!814 = distinct !DILexicalBlock(scope: !815, file: !506, line: 515, column: 121)
!815 = distinct !DILexicalBlock(scope: !816, file: !506, line: 515, column: 88)
!816 = distinct !DILexicalBlock(scope: !810, file: !506, line: 515, column: 65)
!817 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !818, file: !506, line: 520, type: !13)
!818 = distinct !DILexicalBlock(scope: !819, file: !506, line: 520, column: 16)
!819 = distinct !DILexicalBlock(scope: !820, file: !506, line: 519, column: 9)
!820 = distinct !DILexicalBlock(scope: !821, file: !506, line: 519, column: 9)
!821 = distinct !DILexicalBlock(scope: !822, file: !506, line: 518, column: 31)
!822 = distinct !DILexicalBlock(scope: !777, file: !506, line: 518, column: 9)
!823 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !824, file: !506, line: 520, type: !13)
!824 = distinct !DILexicalBlock(scope: !825, file: !506, line: 520, column: 107)
!825 = distinct !DILexicalBlock(scope: !826, file: !506, line: 520, column: 83)
!826 = distinct !DILexicalBlock(scope: !818, file: !506, line: 520, column: 60)
!827 = !DISubprogram(name: "frame_clear", scope: !506, file: !506, line: 525, type: !828, isLocal: true, isDefinition: true, scopeLine: 526, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._frame*)* @frame_clear, variables: !830)
!828 = !DISubroutineType(types: !829)
!829 = !{!13, !359}
!830 = !{!831}
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !827, file: !506, line: 525, type: !359)
!832 = !DISubprogram(name: "frame_sizeof", scope: !506, file: !506, line: 544, type: !828, isLocal: true, isDefinition: true, scopeLine: 545, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._frame*)* @frame_sizeof, variables: !833)
!833 = !{!834, !835, !836, !837, !838}
!834 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !832, file: !506, line: 544, type: !359)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !832, file: !506, line: 546, type: !19)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "extras", scope: !832, file: !506, line: 546, type: !19)
!837 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ncells", scope: !832, file: !506, line: 546, type: !19)
!838 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nfrees", scope: !832, file: !506, line: 546, type: !19)
!839 = !DISubprogram(name: "frame_getlocals", scope: !506, file: !506, line: 22, type: !840, isLocal: true, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._frame*, i8*)* @frame_getlocals, variables: !842)
!840 = !DISubroutineType(types: !841)
!841 = !{!13, !359, !12}
!842 = !{!843, !844}
!843 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !839, file: !506, line: 22, type: !359)
!844 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !839, file: !506, line: 22, type: !12)
!845 = !DISubprogram(name: "frame_getlineno", scope: !506, file: !506, line: 40, type: !840, isLocal: true, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._frame*, i8*)* @frame_getlineno, variables: !846)
!846 = !{!847, !848}
!847 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !845, file: !506, line: 40, type: !359)
!848 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !845, file: !506, line: 40, type: !12)
!849 = !DISubprogram(name: "frame_setlineno", scope: !506, file: !506, line: 61, type: !850, isLocal: true, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._frame*, %struct._object*)* @frame_setlineno, variables: !852)
!850 = !DISubroutineType(types: !851)
!851 = !{!52, !359, !13}
!852 = !{!853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !876, !877, !878, !879, !883, !887, !890, !891, !895, !897, !899}
!853 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !849, file: !506, line: 61, type: !359)
!854 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_new_lineno", arg: 2, scope: !849, file: !506, line: 61, type: !13)
!855 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_lineno", scope: !849, file: !506, line: 63, type: !52)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l_new_lineno", scope: !849, file: !506, line: 64, type: !25)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overflow", scope: !849, file: !506, line: 65, type: !52)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_lasti", scope: !849, file: !506, line: 66, type: !52)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_iblock", scope: !849, file: !506, line: 67, type: !52)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !849, file: !506, line: 68, type: !386)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code_len", scope: !849, file: !506, line: 69, type: !19)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lnotab", scope: !849, file: !506, line: 70, type: !386)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lnotab_len", scope: !849, file: !506, line: 71, type: !19)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !849, file: !506, line: 72, type: !52)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !849, file: !506, line: 73, type: !52)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "addr", scope: !849, file: !506, line: 74, type: !52)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_addr", scope: !849, file: !506, line: 75, type: !52)
!868 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max_addr", scope: !849, file: !506, line: 76, type: !52)
!869 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "delta_iblock", scope: !849, file: !506, line: 77, type: !52)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_delta_iblock", scope: !849, file: !506, line: 78, type: !52)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_iblock", scope: !849, file: !506, line: 79, type: !52)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f_lasti_setup_addr", scope: !849, file: !506, line: 80, type: !52)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_lasti_setup_addr", scope: !849, file: !506, line: 81, type: !52)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blockstack", scope: !849, file: !506, line: 82, type: !875)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 640, align: 32, elements: !108)
!876 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "in_finally", scope: !849, file: !506, line: 83, type: !875)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "blockstack_top", scope: !849, file: !506, line: 84, type: !52)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "setup_op", scope: !849, file: !506, line: 85, type: !387)
!879 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !880, file: !506, line: 131, type: !60)
!880 = distinct !DILexicalBlock(scope: !881, file: !506, line: 128, column: 10)
!881 = distinct !DILexicalBlock(scope: !882, file: !506, line: 124, column: 14)
!882 = distinct !DILexicalBlock(scope: !849, file: !506, line: 118, column: 9)
!883 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !884, file: !506, line: 193, type: !387)
!884 = distinct !DILexicalBlock(scope: !885, file: !506, line: 192, column: 45)
!885 = distinct !DILexicalBlock(scope: !886, file: !506, line: 192, column: 5)
!886 = distinct !DILexicalBlock(scope: !849, file: !506, line: 192, column: 5)
!887 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !888, file: !506, line: 232, type: !52)
!888 = distinct !DILexicalBlock(scope: !889, file: !506, line: 231, column: 54)
!889 = distinct !DILexicalBlock(scope: !884, file: !506, line: 231, column: 13)
!890 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "setup_addr", scope: !888, file: !506, line: 233, type: !52)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !892, file: !506, line: 278, type: !387)
!892 = distinct !DILexicalBlock(scope: !893, file: !506, line: 277, column: 52)
!893 = distinct !DILexicalBlock(scope: !894, file: !506, line: 277, column: 5)
!894 = distinct !DILexicalBlock(scope: !849, file: !506, line: 277, column: 5)
!895 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !896, file: !506, line: 319, type: !566)
!896 = distinct !DILexicalBlock(scope: !849, file: !506, line: 318, column: 38)
!897 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !898, file: !506, line: 321, type: !13)
!898 = distinct !DILexicalBlock(scope: !896, file: !506, line: 320, column: 64)
!899 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !900, file: !506, line: 322, type: !13)
!900 = distinct !DILexicalBlock(scope: !898, file: !506, line: 322, column: 16)
!901 = !DISubprogram(name: "frame_gettrace", scope: !506, file: !506, line: 333, type: !840, isLocal: true, isDefinition: true, scopeLine: 334, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._frame*, i8*)* @frame_gettrace, variables: !902)
!902 = !{!903, !904, !905}
!903 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !901, file: !506, line: 333, type: !359)
!904 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 2, scope: !901, file: !506, line: 333, type: !12)
!905 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "trace", scope: !901, file: !506, line: 335, type: !13)
!906 = !DISubprogram(name: "frame_settrace", scope: !506, file: !506, line: 346, type: !907, isLocal: true, isDefinition: true, scopeLine: 347, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._frame*, %struct._object*, i8*)* @frame_settrace, variables: !909)
!907 = !DISubroutineType(types: !908)
!908 = !{!52, !359, !13, !12}
!909 = !{!910, !911, !912, !913, !914, !916, !918}
!910 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "f", arg: 1, scope: !906, file: !506, line: 346, type: !359)
!911 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !906, file: !506, line: 346, type: !13)
!912 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "closure", arg: 3, scope: !906, file: !506, line: 346, type: !12)
!913 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_value", scope: !906, file: !506, line: 348, type: !13)
!914 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !915, file: !506, line: 354, type: !13)
!915 = distinct !DILexicalBlock(scope: !906, file: !506, line: 354, column: 8)
!916 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !917, file: !506, line: 356, type: !13)
!917 = distinct !DILexicalBlock(scope: !906, file: !506, line: 356, column: 8)
!918 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !919, file: !506, line: 356, type: !13)
!919 = distinct !DILexicalBlock(scope: !920, file: !506, line: 356, column: 101)
!920 = distinct !DILexicalBlock(scope: !917, file: !506, line: 356, column: 67)
!921 = !DISubprogram(name: "map_to_dict", scope: !506, file: !506, line: 778, type: !922, isLocal: true, isDefinition: true, scopeLine: 780, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64, %struct._object*, %struct._object**, i32)* @map_to_dict, variables: !924)
!922 = !DISubroutineType(types: !923)
!923 = !{!52, !13, !19, !13, !398, !52}
!924 = !{!925, !926, !927, !928, !929, !930, !931, !935}
!925 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "map", arg: 1, scope: !921, file: !506, line: 778, type: !13)
!926 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nmap", arg: 2, scope: !921, file: !506, line: 778, type: !19)
