; ModuleID = 'irs-onlybc/getpath.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !345, globals: !557)
!1 = !DIFile(filename: "getpath.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !9}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !7, line: 90, baseType: !8)
!7 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !11, line: 109, baseType: !12)
!11 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !11, line: 105, size: 128, align: 64, elements: !13)
!13 = !{!14, !22}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !12, file: !11, line: 107, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !16, line: 177, baseType: !17)
!16 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !18, line: 102, baseType: !19)
!18 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !20, line: 181, baseType: !21)
!20 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!21 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !12, file: !11, line: 108, baseType: !23, size: 64, align: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !11, line: 334, size: 3200, align: 64, elements: !25)
!25 = !{!26, !32, !36, !37, !38, !43, !104, !109, !114, !115, !120, !172, !203, !215, !221, !222, !223, !225, !227, !258, !259, !260, !269, !270, !275, !276, !278, !280, !290, !293, !311, !312, !313, !315, !317, !318, !320, !325, !330, !335, !336, !337, !338, !339, !340, !341, !342, !344}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !24, file: !11, line: 335, baseType: !27, size: 192, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !11, line: 114, baseType: !28)
!28 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 111, size: 192, align: 64, elements: !29)
!29 = !{!30, !31}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !28, file: !11, line: 112, baseType: !10, size: 128, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !28, file: !11, line: 113, baseType: !15, size: 64, align: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !24, file: !11, line: 336, baseType: !33, size: 64, align: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!35 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !24, file: !11, line: 337, baseType: !15, size: 64, align: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !24, file: !11, line: 337, baseType: !15, size: 64, align: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !24, file: !11, line: 341, baseType: !39, size: 64, align: 64, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !11, line: 308, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !9}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !24, file: !11, line: 342, baseType: !44, size: 64, align: 64, offset: 448)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !11, line: 314, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{!8, !9, !48, !8}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !18, line: 48, baseType: !50)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !51, line: 246, size: 1728, align: 64, elements: !52)
!51 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!52 = !{!53, !54, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !74, !75, !76, !77, !79, !81, !83, !87, !90, !92, !93, !94, !95, !96, !99, !100}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !50, file: !51, line: 247, baseType: !8, size: 32, align: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !50, file: !51, line: 252, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !50, file: !51, line: 253, baseType: !55, size: 64, align: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !50, file: !51, line: 254, baseType: !55, size: 64, align: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !50, file: !51, line: 255, baseType: !55, size: 64, align: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !50, file: !51, line: 256, baseType: !55, size: 64, align: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !50, file: !51, line: 257, baseType: !55, size: 64, align: 64, offset: 384)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !50, file: !51, line: 258, baseType: !55, size: 64, align: 64, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !50, file: !51, line: 259, baseType: !55, size: 64, align: 64, offset: 512)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !50, file: !51, line: 261, baseType: !55, size: 64, align: 64, offset: 576)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !50, file: !51, line: 262, baseType: !55, size: 64, align: 64, offset: 640)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !50, file: !51, line: 263, baseType: !55, size: 64, align: 64, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !50, file: !51, line: 265, baseType: !67, size: 64, align: 64, offset: 768)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !51, line: 161, size: 192, align: 64, elements: !69)
!69 = !{!70, !71, !73}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !68, file: !51, line: 162, baseType: !67, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !68, file: !51, line: 163, baseType: !72, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !68, file: !51, line: 167, baseType: !8, size: 32, align: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !50, file: !51, line: 267, baseType: !72, size: 64, align: 64, offset: 832)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !50, file: !51, line: 269, baseType: !8, size: 32, align: 32, offset: 896)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !50, file: !51, line: 273, baseType: !8, size: 32, align: 32, offset: 928)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !50, file: !51, line: 275, baseType: !78, size: 64, align: 64, offset: 960)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !20, line: 140, baseType: !21)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !50, file: !51, line: 279, baseType: !80, size: 16, align: 16, offset: 1024)
!80 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !50, file: !51, line: 280, baseType: !82, size: 8, align: 8, offset: 1040)
!82 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !50, file: !51, line: 281, baseType: !84, size: 8, align: 8, offset: 1048)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8, align: 8, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 1)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !50, file: !51, line: 285, baseType: !88, size: 64, align: 64, offset: 1088)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !51, line: 155, baseType: null)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !50, file: !51, line: 294, baseType: !91, size: 64, align: 64, offset: 1152)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !20, line: 141, baseType: !21)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !50, file: !51, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !50, file: !51, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !50, file: !51, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !50, file: !51, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !50, file: !51, line: 307, baseType: !97, size: 64, align: 64, offset: 1472)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !7, line: 62, baseType: !98)
!98 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !50, file: !51, line: 309, baseType: !8, size: 32, align: 32, offset: 1536)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !50, file: !51, line: 311, baseType: !101, size: 160, align: 8, offset: 1568)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 160, align: 8, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 20)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !24, file: !11, line: 343, baseType: !105, size: 64, align: 64, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !11, line: 316, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!9, !9, !55}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !24, file: !11, line: 344, baseType: !110, size: 64, align: 64, offset: 576)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !11, line: 318, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!8, !9, !55, !9}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !24, file: !11, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !24, file: !11, line: 346, baseType: !116, size: 64, align: 64, offset: 704)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !11, line: 320, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!9, !9}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !24, file: !11, line: 350, baseType: !121, size: 64, align: 64, offset: 768)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !11, line: 278, baseType: !123)
!123 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 236, size: 2176, align: 64, elements: !124)
!124 = !{!125, !130, !131, !132, !133, !134, !139, !141, !142, !143, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !123, file: !11, line: 241, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !11, line: 166, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!9, !9, !9}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !123, file: !11, line: 242, baseType: !126, size: 64, align: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !123, file: !11, line: 243, baseType: !126, size: 64, align: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !123, file: !11, line: 244, baseType: !126, size: 64, align: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !123, file: !11, line: 245, baseType: !126, size: 64, align: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !123, file: !11, line: 246, baseType: !135, size: 64, align: 64, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !11, line: 167, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!9, !9, !9, !9}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !123, file: !11, line: 247, baseType: !140, size: 64, align: 64, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !11, line: 165, baseType: !117)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !123, file: !11, line: 248, baseType: !140, size: 64, align: 64, offset: 448)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !123, file: !11, line: 249, baseType: !140, size: 64, align: 64, offset: 512)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !123, file: !11, line: 250, baseType: !144, size: 64, align: 64, offset: 576)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !11, line: 168, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!8, !9}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !123, file: !11, line: 251, baseType: !140, size: 64, align: 64, offset: 640)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !123, file: !11, line: 252, baseType: !126, size: 64, align: 64, offset: 704)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !123, file: !11, line: 253, baseType: !126, size: 64, align: 64, offset: 768)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !123, file: !11, line: 254, baseType: !126, size: 64, align: 64, offset: 832)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !123, file: !11, line: 255, baseType: !126, size: 64, align: 64, offset: 896)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !123, file: !11, line: 256, baseType: !126, size: 64, align: 64, offset: 960)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !123, file: !11, line: 257, baseType: !140, size: 64, align: 64, offset: 1024)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !123, file: !11, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !123, file: !11, line: 259, baseType: !140, size: 64, align: 64, offset: 1152)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !123, file: !11, line: 261, baseType: !126, size: 64, align: 64, offset: 1216)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !123, file: !11, line: 262, baseType: !126, size: 64, align: 64, offset: 1280)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !123, file: !11, line: 263, baseType: !126, size: 64, align: 64, offset: 1344)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !123, file: !11, line: 264, baseType: !126, size: 64, align: 64, offset: 1408)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !123, file: !11, line: 265, baseType: !135, size: 64, align: 64, offset: 1472)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !123, file: !11, line: 266, baseType: !126, size: 64, align: 64, offset: 1536)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !123, file: !11, line: 267, baseType: !126, size: 64, align: 64, offset: 1600)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !123, file: !11, line: 268, baseType: !126, size: 64, align: 64, offset: 1664)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !123, file: !11, line: 269, baseType: !126, size: 64, align: 64, offset: 1728)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !123, file: !11, line: 270, baseType: !126, size: 64, align: 64, offset: 1792)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !123, file: !11, line: 272, baseType: !126, size: 64, align: 64, offset: 1856)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !123, file: !11, line: 273, baseType: !126, size: 64, align: 64, offset: 1920)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !123, file: !11, line: 274, baseType: !126, size: 64, align: 64, offset: 1984)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !123, file: !11, line: 275, baseType: !126, size: 64, align: 64, offset: 2048)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !123, file: !11, line: 277, baseType: !140, size: 64, align: 64, offset: 2112)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !24, file: !11, line: 351, baseType: !173, size: 64, align: 64, offset: 832)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !11, line: 292, baseType: !175)
!175 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 280, size: 640, align: 64, elements: !176)
!176 = !{!177, !182, !183, !188, !189, !190, !195, !196, !201, !202}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !175, file: !11, line: 281, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !11, line: 169, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!15, !9}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !175, file: !11, line: 282, baseType: !126, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !175, file: !11, line: 283, baseType: !184, size: 64, align: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !11, line: 170, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!9, !9, !15}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !175, file: !11, line: 284, baseType: !184, size: 64, align: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !175, file: !11, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !175, file: !11, line: 286, baseType: !191, size: 64, align: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !11, line: 172, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!8, !9, !15, !9}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !175, file: !11, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !175, file: !11, line: 288, baseType: !197, size: 64, align: 64, offset: 448)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !11, line: 231, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!8, !9, !9}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !175, file: !11, line: 290, baseType: !126, size: 64, align: 64, offset: 512)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !175, file: !11, line: 291, baseType: !184, size: 64, align: 64, offset: 576)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !24, file: !11, line: 352, baseType: !204, size: 64, align: 64, offset: 896)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !11, line: 298, baseType: !206)
!206 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 294, size: 192, align: 64, elements: !207)
!207 = !{!208, !209, !210}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !206, file: !11, line: 295, baseType: !178, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !206, file: !11, line: 296, baseType: !126, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !206, file: !11, line: 297, baseType: !211, size: 64, align: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !11, line: 174, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!8, !9, !9, !9}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !24, file: !11, line: 356, baseType: !216, size: 64, align: 64, offset: 960)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !11, line: 321, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!220, !9}
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !16, line: 186, baseType: !15)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !24, file: !11, line: 357, baseType: !135, size: 64, align: 64, offset: 1024)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !24, file: !11, line: 358, baseType: !116, size: 64, align: 64, offset: 1088)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !24, file: !11, line: 359, baseType: !224, size: 64, align: 64, offset: 1152)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !11, line: 317, baseType: !127)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !24, file: !11, line: 360, baseType: !226, size: 64, align: 64, offset: 1216)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !11, line: 319, baseType: !212)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !24, file: !11, line: 363, baseType: !228, size: 64, align: 64, offset: 1280)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !11, line: 304, baseType: !230)
!230 = !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 301, size: 128, align: 64, elements: !231)
!231 = !{!232, !253}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !230, file: !11, line: 302, baseType: !233, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !11, line: 193, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!8, !9, !237, !8}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !11, line: 191, baseType: !239)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !11, line: 178, size: 640, align: 64, elements: !240)
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !250, !251, !252}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !239, file: !11, line: 179, baseType: !4, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !239, file: !11, line: 180, baseType: !9, size: 64, align: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !239, file: !11, line: 181, baseType: !15, size: 64, align: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !239, file: !11, line: 182, baseType: !15, size: 64, align: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !239, file: !11, line: 184, baseType: !8, size: 32, align: 32, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !239, file: !11, line: 185, baseType: !8, size: 32, align: 32, offset: 288)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !239, file: !11, line: 186, baseType: !55, size: 64, align: 64, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !239, file: !11, line: 187, baseType: !249, size: 64, align: 64, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !239, file: !11, line: 188, baseType: !249, size: 64, align: 64, offset: 448)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !239, file: !11, line: 189, baseType: !249, size: 64, align: 64, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !239, file: !11, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !230, file: !11, line: 303, baseType: !254, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !11, line: 194, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !9, !237}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !24, file: !11, line: 366, baseType: !98, size: 64, align: 64, offset: 1344)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !24, file: !11, line: 368, baseType: !33, size: 64, align: 64, offset: 1408)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !24, file: !11, line: 372, baseType: !261, size: 64, align: 64, offset: 1472)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !11, line: 233, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!8, !9, !265, !4}
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !11, line: 232, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!8, !9, !4}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !24, file: !11, line: 375, baseType: !144, size: 64, align: 64, offset: 1536)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !24, file: !11, line: 379, baseType: !271, size: 64, align: 64, offset: 1600)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !11, line: 322, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!9, !9, !9, !8}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !24, file: !11, line: 382, baseType: !15, size: 64, align: 64, offset: 1664)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !24, file: !11, line: 385, baseType: !277, size: 64, align: 64, offset: 1728)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !11, line: 323, baseType: !117)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !24, file: !11, line: 386, baseType: !279, size: 64, align: 64, offset: 1792)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !11, line: 324, baseType: !117)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !24, file: !11, line: 389, baseType: !281, size: 64, align: 64, offset: 1856)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !283, line: 40, size: 256, align: 64, elements: !284)
!283 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!284 = !{!285, !286, !288, !289}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !282, file: !283, line: 41, baseType: !33, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !282, file: !283, line: 42, baseType: !287, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !283, line: 18, baseType: !127)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !282, file: !283, line: 43, baseType: !8, size: 32, align: 32, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !282, file: !283, line: 45, baseType: !33, size: 64, align: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !24, file: !11, line: 390, baseType: !291, size: 64, align: 64, offset: 1920)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !11, line: 390, flags: DIFlagFwdDecl)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !24, file: !11, line: 391, baseType: !294, size: 64, align: 64, offset: 1984)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !296, line: 11, size: 320, align: 64, elements: !297)
!296 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!297 = !{!298, !299, !304, !309, !310}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !295, file: !296, line: 12, baseType: !55, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !295, file: !296, line: 13, baseType: !300, size: 64, align: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !296, line: 8, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64, align: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!9, !9, !4}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !295, file: !296, line: 14, baseType: !305, size: 64, align: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !296, line: 9, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!8, !9, !9, !4}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !295, file: !296, line: 15, baseType: !55, size: 64, align: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !295, file: !296, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !24, file: !11, line: 392, baseType: !23, size: 64, align: 64, offset: 2048)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !24, file: !11, line: 393, baseType: !9, size: 64, align: 64, offset: 2112)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !24, file: !11, line: 394, baseType: !314, size: 64, align: 64, offset: 2176)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !11, line: 325, baseType: !136)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !24, file: !11, line: 395, baseType: !316, size: 64, align: 64, offset: 2240)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !11, line: 326, baseType: !212)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !24, file: !11, line: 396, baseType: !15, size: 64, align: 64, offset: 2304)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !24, file: !11, line: 397, baseType: !319, size: 64, align: 64, offset: 2368)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !11, line: 327, baseType: !212)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !24, file: !11, line: 398, baseType: !321, size: 64, align: 64, offset: 2432)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !11, line: 329, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!9, !23, !15}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !24, file: !11, line: 399, baseType: !326, size: 64, align: 64, offset: 2496)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !11, line: 328, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!9, !23, !9, !9}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !24, file: !11, line: 400, baseType: !331, size: 64, align: 64, offset: 2560)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !11, line: 307, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{null, !4}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !24, file: !11, line: 401, baseType: !144, size: 64, align: 64, offset: 2624)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !24, file: !11, line: 402, baseType: !9, size: 64, align: 64, offset: 2688)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !24, file: !11, line: 403, baseType: !9, size: 64, align: 64, offset: 2752)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !24, file: !11, line: 404, baseType: !9, size: 64, align: 64, offset: 2816)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !24, file: !11, line: 405, baseType: !9, size: 64, align: 64, offset: 2880)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !24, file: !11, line: 406, baseType: !9, size: 64, align: 64, offset: 2944)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !24, file: !11, line: 407, baseType: !39, size: 64, align: 64, offset: 3008)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !24, file: !11, line: 410, baseType: !343, size: 32, align: 32, offset: 3072)
!343 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !24, file: !11, line: 412, baseType: !39, size: 64, align: 64, offset: 3136)
!345 = !{!346, !357, !360, !361, !362, !363, !415, !423, !465, !471, !478, !482, !509, !522, !526, !529, !553}
!346 = !DISubprogram(name: "Py_SetPath", scope: !347, file: !347, line: 824, type: !348, isLocal: false, isDefinition: true, scopeLine: 825, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*)* @Py_SetPath, variables: !352)
!347 = !DIFile(filename: "./Modules/getpath.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!348 = !DISubroutineType(types: !349)
!349 = !{null, !350}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!352 = !{!353, !354}
!353 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 1, scope: !346, file: !347, line: 824, type: !350)
!354 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prog", scope: !355, file: !347, line: 832, type: !5)
!355 = distinct !DILexicalBlock(scope: !356, file: !347, line: 830, column: 29)
!356 = distinct !DILexicalBlock(scope: !346, file: !347, line: 830, column: 9)
!357 = !DISubprogram(name: "Py_GetPath", scope: !347, file: !347, line: 842, type: !358, isLocal: false, isDefinition: true, scopeLine: 843, flags: DIFlagPrototyped, isOptimized: true, function: i32* ()* @Py_GetPath, variables: !2)
!358 = !DISubroutineType(types: !359)
!359 = !{!5}
!360 = !DISubprogram(name: "Py_GetPrefix", scope: !347, file: !347, line: 850, type: !358, isLocal: false, isDefinition: true, scopeLine: 851, flags: DIFlagPrototyped, isOptimized: true, function: i32* ()* @Py_GetPrefix, variables: !2)
!361 = !DISubprogram(name: "Py_GetExecPrefix", scope: !347, file: !347, line: 858, type: !358, isLocal: false, isDefinition: true, scopeLine: 859, flags: DIFlagPrototyped, isOptimized: true, function: i32* ()* @Py_GetExecPrefix, variables: !2)
!362 = !DISubprogram(name: "Py_GetProgramFullPath", scope: !347, file: !347, line: 866, type: !358, isLocal: false, isDefinition: true, scopeLine: 867, flags: DIFlagPrototyped, isOptimized: true, function: i32* ()* @Py_GetProgramFullPath, variables: !2)
!363 = !DISubprogram(name: "calculate_path", scope: !347, file: !347, line: 459, type: !364, isLocal: true, isDefinition: true, scopeLine: 460, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @calculate_path, variables: !366)
!364 = !DISubroutineType(types: !365)
!365 = !{null}
!366 = !{!367, !368, !369, !370, !371, !372, !373, !374, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !394, !397, !399, !400, !402, !403, !404, !407, !409, !411, !414}
!367 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_rtpypath", scope: !363, file: !347, line: 465, type: !55)
!368 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rtpypath", scope: !363, file: !347, line: 466, type: !5)
!369 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "home", scope: !363, file: !347, line: 467, type: !5)
!370 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_path", scope: !363, file: !347, line: 468, type: !55)
!371 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path_buffer", scope: !363, file: !347, line: 469, type: !5)
!372 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "path", scope: !363, file: !347, line: 470, type: !5)
!373 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prog", scope: !363, file: !347, line: 471, type: !5)
!374 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "argv0_path", scope: !363, file: !347, line: 472, type: !375)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 131104, align: 32, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 4097)
!378 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "zip_path", scope: !363, file: !347, line: 473, type: !375)
!379 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pfound", scope: !363, file: !347, line: 474, type: !8)
!380 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "efound", scope: !363, file: !347, line: 474, type: !8)
!381 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !363, file: !347, line: 475, type: !5)
!382 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bufsz", scope: !363, file: !347, line: 476, type: !97)
!383 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prefixsz", scope: !363, file: !347, line: 477, type: !97)
!384 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "defpath", scope: !363, file: !347, line: 478, type: !5)
!385 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_pythonpath", scope: !363, file: !347, line: 491, type: !5)
!386 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_prefix", scope: !363, file: !347, line: 491, type: !5)
!387 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_exec_prefix", scope: !363, file: !347, line: 491, type: !5)
!388 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lib_python", scope: !363, file: !347, line: 492, type: !5)
!389 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "delim", scope: !390, file: !347, line: 538, type: !5)
!390 = distinct !DILexicalBlock(scope: !391, file: !347, line: 537, column: 19)
!391 = distinct !DILexicalBlock(scope: !392, file: !347, line: 536, column: 20)
!392 = distinct !DILexicalBlock(scope: !393, file: !347, line: 536, column: 14)
!393 = distinct !DILexicalBlock(scope: !363, file: !347, line: 515, column: 9)
!394 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !395, file: !347, line: 541, type: !97)
!395 = distinct !DILexicalBlock(scope: !396, file: !347, line: 540, column: 24)
!396 = distinct !DILexicalBlock(scope: !390, file: !347, line: 540, column: 17)
!397 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmpbuffer", scope: !398, file: !347, line: 611, type: !375)
!398 = distinct !DILexicalBlock(scope: !363, file: !347, line: 610, column: 5)
!399 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "linklen", scope: !398, file: !347, line: 612, type: !8)
!400 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmpbuffer", scope: !401, file: !347, line: 639, type: !375)
!401 = distinct !DILexicalBlock(scope: !363, file: !347, line: 638, column: 5)
!402 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "env_cfg", scope: !401, file: !347, line: 640, type: !5)
!403 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "env_file", scope: !401, file: !347, line: 641, type: !48)
!404 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rtpypath_len", scope: !405, file: !347, line: 711, type: !97)
!405 = distinct !DILexicalBlock(scope: !406, file: !347, line: 710, column: 44)
!406 = distinct !DILexicalBlock(scope: !363, file: !347, line: 710, column: 9)
!407 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "delim", scope: !408, file: !347, line: 720, type: !5)
!408 = distinct !DILexicalBlock(scope: !363, file: !347, line: 719, column: 15)
!409 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "delim", scope: !410, file: !347, line: 761, type: !5)
!410 = distinct !DILexicalBlock(scope: !363, file: !347, line: 760, column: 15)
!411 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !412, file: !347, line: 769, type: !97)
!412 = distinct !DILexicalBlock(scope: !413, file: !347, line: 768, column: 20)
!413 = distinct !DILexicalBlock(scope: !410, file: !347, line: 768, column: 13)
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !412, file: !347, line: 770, type: !97)
!415 = !DISubprogram(name: "joinpath", scope: !347, file: !347, line: 207, type: !416, isLocal: true, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i32*)* @joinpath, variables: !418)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !5, !5}
!418 = !{!419, !420, !421, !422}
!419 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "buffer", arg: 1, scope: !415, file: !347, line: 207, type: !5)
!420 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stuff", arg: 2, scope: !415, file: !347, line: 207, type: !5)
!421 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !415, file: !347, line: 209, type: !97)
!422 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !415, file: !347, line: 209, type: !97)
!423 = !DISubprogram(name: "isxfile", scope: !347, file: !347, line: 172, type: !424, isLocal: true, isDefinition: true, scopeLine: 173, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32*)* @isxfile, variables: !426)
!424 = !DISubroutineType(types: !425)
!425 = !{!8, !5}
!426 = !{!427, !428}
!427 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "filename", arg: 1, scope: !423, file: !347, line: 172, type: !5)
!428 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !423, file: !347, line: 174, type: !429)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !430, line: 46, size: 1152, align: 64, elements: !431)
!430 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!431 = !{!432, !434, !436, !438, !440, !442, !444, !445, !446, !447, !449, !451, !459, !460, !461}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !429, file: !430, line: 48, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !20, line: 133, baseType: !98)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !429, file: !430, line: 53, baseType: !435, size: 64, align: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !20, line: 136, baseType: !98)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !429, file: !430, line: 61, baseType: !437, size: 64, align: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !20, line: 139, baseType: !98)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !429, file: !430, line: 62, baseType: !439, size: 32, align: 32, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !20, line: 138, baseType: !343)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !429, file: !430, line: 64, baseType: !441, size: 32, align: 32, offset: 224)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !20, line: 134, baseType: !343)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !429, file: !430, line: 65, baseType: !443, size: 32, align: 32, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !20, line: 135, baseType: !343)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !429, file: !430, line: 67, baseType: !8, size: 32, align: 32, offset: 288)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !429, file: !430, line: 69, baseType: !433, size: 64, align: 64, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !429, file: !430, line: 74, baseType: !78, size: 64, align: 64, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !429, file: !430, line: 78, baseType: !448, size: 64, align: 64, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !20, line: 162, baseType: !21)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !429, file: !430, line: 80, baseType: !450, size: 64, align: 64, offset: 512)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !20, line: 167, baseType: !21)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !429, file: !430, line: 91, baseType: !452, size: 128, align: 64, offset: 576)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !453, line: 120, size: 128, align: 64, elements: !454)
!453 = !DIFile(filename: "/usr/include/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!454 = !{!455, !457}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !452, file: !453, line: 122, baseType: !456, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !20, line: 148, baseType: !21)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !452, file: !453, line: 123, baseType: !458, size: 64, align: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !20, line: 184, baseType: !21)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !429, file: !430, line: 92, baseType: !452, size: 128, align: 64, offset: 704)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !429, file: !430, line: 93, baseType: !452, size: 128, align: 64, offset: 832)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !429, file: !430, line: 106, baseType: !462, size: 192, align: 64, offset: 960)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 192, align: 64, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 3)
!465 = !DISubprogram(name: "absolutize", scope: !347, file: !347, line: 247, type: !466, isLocal: true, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*)* @absolutize, variables: !468)
!466 = !DISubroutineType(types: !467)
!467 = !{null, !5}
!468 = !{!469, !470}
!469 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 1, scope: !465, file: !347, line: 247, type: !5)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !465, file: !347, line: 249, type: !375)
!471 = !DISubprogram(name: "copy_absolute", scope: !347, file: !347, line: 229, type: !472, isLocal: true, isDefinition: true, scopeLine: 230, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*, i32*, i64)* @copy_absolute, variables: !474)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !5, !5, !97}
!474 = !{!475, !476, !477}
!475 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "path", arg: 1, scope: !471, file: !347, line: 229, type: !5)
!476 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !471, file: !347, line: 229, type: !5)
!477 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pathlen", arg: 3, scope: !471, file: !347, line: 229, type: !97)
!478 = !DISubprogram(name: "reduce", scope: !347, file: !347, line: 135, type: !466, isLocal: true, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: true, function: void (i32*)* @reduce, variables: !479)
!479 = !{!480, !481}
!480 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dir", arg: 1, scope: !478, file: !347, line: 135, type: !5)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !478, file: !347, line: 137, type: !97)
!482 = !DISubprogram(name: "find_env_config_value", scope: !347, file: !347, line: 263, type: !483, isLocal: true, isDefinition: true, scopeLine: 264, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._IO_FILE*, i32*, i32*)* @find_env_config_value, variables: !485)
!483 = !DISubroutineType(types: !484)
!484 = !{!8, !48, !350, !5}
!485 = !{!486, !487, !488, !489, !490, !494, !496, !498, !499, !500, !503, !504, !506}
!486 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "env_file", arg: 1, scope: !482, file: !347, line: 263, type: !48)
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 2, scope: !482, file: !347, line: 263, type: !350)
!488 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "value", arg: 3, scope: !482, file: !347, line: 263, type: !5)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !482, file: !347, line: 265, type: !8)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !482, file: !347, line: 266, type: !491)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 65544, align: 8, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 8193)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !495, file: !347, line: 270, type: !55)
!495 = distinct !DILexicalBlock(scope: !482, file: !347, line: 269, column: 29)
!496 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmpbuffer", scope: !495, file: !347, line: 271, type: !497)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 262176, align: 32, elements: !492)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decoded", scope: !495, file: !347, line: 272, type: !9)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !495, file: !347, line: 273, type: !8)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !501, file: !347, line: 286, type: !15)
!501 = distinct !DILexicalBlock(scope: !502, file: !347, line: 285, column: 36)
