; ModuleID = 'irs-onlybc/graminit.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.dfa = type { i32, i8*, i32, i32, %struct.state*, i8* }
%struct.state = type { i32, %struct.arc*, i32, i32, i32*, i32 }
%struct.arc = type { i16, i16 }
%struct.label = type { i32, i8* }
%struct.grammar = type { i32, %struct.dfa*, %struct.labellist, i32, i32 }
%struct.labellist = type { i32, %struct.label* }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, globals: !3)
!1 = !DIFile(filename: "graminit.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !59, !63, !67, !69, !73, !74, !78, !79, !80, !81, !82, !84, !85, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !107, !108, !109, !110, !111, !112, !113, !114, !115, !119, !120, !121, !122, !123, !127, !128, !129, !130, !131, !132, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !184, !185, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548}
!4 = !DIGlobalVariable(name: "_PyParser_Grammar", scope: !0, file: !5, line: 2157, type: !6, isLocal: false, isDefinition: true, variable: %struct.grammar* @_PyParser_Grammar)
!5 = !DIFile(filename: "Python/graminit.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "grammar", file: !7, line: 67, baseType: !8)
!7 = !DIFile(filename: "Include/grammar.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!8 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 61, size: 320, align: 64, elements: !9)
!9 = !{!10, !12, !45, !57, !58}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "g_ndfas", scope: !8, file: !7, line: 62, baseType: !11, size: 32, align: 32)
!11 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "g_dfa", scope: !8, file: !7, line: 63, baseType: !13, size: 64, align: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "dfa", file: !7, line: 57, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 50, size: 320, align: 64, elements: !16)
!16 = !{!17, !18, !21, !22, !23, !42}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !15, file: !7, line: 51, baseType: !11, size: 32, align: 32)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !15, file: !7, line: 52, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "d_initial", scope: !15, file: !7, line: 53, baseType: !11, size: 32, align: 32, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "d_nstates", scope: !15, file: !7, line: 54, baseType: !11, size: 32, align: 32, offset: 160)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "d_state", scope: !15, file: !7, line: 55, baseType: !24, size: 64, align: 64, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "state", file: !7, line: 46, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 37, size: 320, align: 64, elements: !27)
!27 = !{!28, !29, !37, !38, !39, !41}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "s_narcs", scope: !26, file: !7, line: 38, baseType: !11, size: 32, align: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "s_arc", scope: !26, file: !7, line: 39, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "arc", file: !7, line: 33, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 30, size: 32, align: 16, elements: !33)
!33 = !{!34, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "a_lbl", scope: !32, file: !7, line: 31, baseType: !35, size: 16, align: 16)
!35 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "a_arrow", scope: !32, file: !7, line: 32, baseType: !35, size: 16, align: 16, offset: 16)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "s_lower", scope: !26, file: !7, line: 42, baseType: !11, size: 32, align: 32, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "s_upper", scope: !26, file: !7, line: 43, baseType: !11, size: 32, align: 32, offset: 160)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "s_accel", scope: !26, file: !7, line: 44, baseType: !40, size: 64, align: 64, offset: 192)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "s_accept", scope: !26, file: !7, line: 45, baseType: !11, size: 32, align: 32, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "d_first", scope: !15, file: !7, line: 56, baseType: !43, size: 64, align: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitset", file: !44, line: 12, baseType: !19)
!44 = !DIFile(filename: "Include/bitset.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!45 = !DIDerivedType(tag: DW_TAG_member, name: "g_ll", scope: !8, file: !7, line: 64, baseType: !46, size: 128, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "labellist", file: !7, line: 26, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 23, size: 128, align: 64, elements: !48)
!48 = !{!49, !50}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ll_nlabels", scope: !47, file: !7, line: 24, baseType: !11, size: 32, align: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ll_label", scope: !47, file: !7, line: 25, baseType: !51, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "label", file: !7, line: 17, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 14, size: 128, align: 64, elements: !54)
!54 = !{!55, !56}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "lb_type", scope: !53, file: !7, line: 15, baseType: !11, size: 32, align: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "lb_str", scope: !53, file: !7, line: 16, baseType: !19, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "g_start", scope: !8, file: !7, line: 65, baseType: !11, size: 32, align: 32, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "g_accel", scope: !8, file: !7, line: 66, baseType: !11, size: 32, align: 32, offset: 288)
!59 = !DIGlobalVariable(name: "dfas", scope: !0, file: !5, line: 1820, type: !60, isLocal: true, isDefinition: true, variable: [82 x %struct.dfa]* @dfas)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 26240, align: 64, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 82)
!63 = !DIGlobalVariable(name: "states_0", scope: !0, file: !5, line: 17, type: !64, isLocal: true, isDefinition: true, variable: [3 x %struct.state]* @states_0)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 960, align: 64, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 3)
!67 = !DIGlobalVariable(name: "arcs_0_0", scope: !0, file: !5, line: 6, type: !68, isLocal: true, isDefinition: true, variable: [3 x %struct.arc]* @arcs_0_0)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 96, align: 16, elements: !65)
!69 = !DIGlobalVariable(name: "arcs_0_1", scope: !0, file: !5, line: 11, type: !70, isLocal: true, isDefinition: true, variable: [1 x %struct.arc]* @arcs_0_1)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 32, align: 16, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 1)
!73 = !DIGlobalVariable(name: "arcs_0_2", scope: !0, file: !5, line: 14, type: !70, isLocal: true, isDefinition: true, variable: [1 x %struct.arc]* @arcs_0_2)
!74 = !DIGlobalVariable(name: "states_1", scope: !0, file: !5, line: 30, type: !75, isLocal: true, isDefinition: true, variable: [2 x %struct.state]* @states_1)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 640, align: 64, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 2)
!78 = !DIGlobalVariable(name: "arcs_1_0", scope: !0, file: !5, line: 22, type: !68, isLocal: true, isDefinition: true, variable: [3 x %struct.arc]* @arcs_1_0)
!79 = !DIGlobalVariable(name: "arcs_1_1", scope: !0, file: !5, line: 27, type: !70, isLocal: true, isDefinition: true, variable: [1 x %struct.arc]* @arcs_1_1)
!80 = !DIGlobalVariable(name: "states_2", scope: !0, file: !5, line: 44, type: !64, isLocal: true, isDefinition: true, variable: [3 x %struct.state]* @states_2)
!81 = !DIGlobalVariable(name: "arcs_2_0", scope: !0, file: !5, line: 34, type: !70, isLocal: true, isDefinition: true, variable: [1 x %struct.arc]* @arcs_2_0)
!82 = !DIGlobalVariable(name: "arcs_2_1", scope: !0, file: !5, line: 37, type: !83, isLocal: true, isDefinition: true, variable: [2 x %struct.arc]* @arcs_2_1)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 64, align: 16, elements: !76)
!84 = !DIGlobalVariable(name: "arcs_2_2", scope: !0, file: !5, line: 41, type: !70, isLocal: true, isDefinition: true, variable: [1 x %struct.arc]* @arcs_2_2)
!85 = !DIGlobalVariable(name: "states_3", scope: !0, file: !5, line: 72, type: !86, isLocal: true, isDefinition: true, variable: [7 x %struct.state]* @states_3)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 2240, align: 64, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 7)
!89 = !DIGlobalVariable(name: "arcs_3_0", scope: !0, file: !5, line: 49, type: !70, isLocal: true, isDefinition: true, variable: [1 x %struct.arc]* @arcs_3_0)
!90 = !DIGlobalVariable(name: "arcs_3_1", scope: !0, file: !5, line: 52, type: !70, isLocal: true, isDefinition: true, variable: [1 x %struct.arc]* @arcs_3_1)
!91 = !DIGlobalVariable(name: "arcs_3_2", scope: !0, file: !5, line: 55, type: !83, isLocal: true, isDefinition: true, variable: [2 x %struct.arc]* @arcs_3_2)
!92 = !DIGlobalVariable(name: "arcs_3_3", scope: !0, file: !5, line: 59, type: !83, isLocal: true, isDefinition: true, variable: [2 x %struct.arc]* @arcs_3_3)
!93 = !DIGlobalVariable(name: "arcs_3_4", scope: !0, file: !5, line: 63, type: !70, isLocal: true, isDefinition: true, variable: [1 x %struct.arc]* @arcs_3_4)
