; ModuleID = 'irs-onlybc/hashtable.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Py_hashtable_entry_t = type { %struct._Py_slist_item_s, i8*, i64 }
%struct._Py_slist_item_s = type { %struct._Py_slist_item_s* }
%struct._Py_hashtable_t = type { i64, i64, %struct._Py_slist_t*, i64, i64 (i8*)*, i32 (i8*, %struct._Py_hashtable_entry_t*)*, i8* (i8*)*, void (i8*)*, i64 (i8*)*, %struct._Py_hashtable_allocator_t }
%struct._Py_slist_t = type { %struct._Py_slist_item_s* }
%struct._Py_hashtable_allocator_t = type { i8* (i64)*, void (i8*)* }

; Function Attrs: nounwind uwtable
define i64 @_Py_hashtable_hash_int(i8* %key) #0 {
entry:
  %key.addr = alloca i8*, align 8
  store i8* %key, i8** %key.addr, align 8, !tbaa !273
  call void @llvm.dbg.declare(metadata i8** %key.addr, metadata !84, metadata !277), !dbg !278
  %0 = load i8*, i8** %key.addr, align 8, !dbg !279, !tbaa !273
  %1 = ptrtoint i8* %0 to i64, !dbg !280
  ret i64 %1, !dbg !281
}

; Function Attrs: nounwind readnone
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1

; Function Attrs: nounwind uwtable
define i64 @_Py_hashtable_hash_ptr(i8* %key) #0 {
entry:
  %key.addr = alloca i8*, align 8
  store i8* %key, i8** %key.addr, align 8, !tbaa !273
  call void @llvm.dbg.declare(metadata i8** %key.addr, metadata !87, metadata !277), !dbg !282
  %0 = load i8*, i8** %key.addr, align 8, !dbg !283, !tbaa !273

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !80)
!1 = !DIFile(filename: "hashtable.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !9, !10, !75, !18, !76, !77, !23, !79, !6}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_uhash_t", file: !5, line: 189, baseType: !6)
!5 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !7, line: 62, baseType: !8)
!7 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!8 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_t", file: !12, line: 67, baseType: !13)
!12 = !DIFile(filename: "./Modules/hashtable.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 55, size: 704, align: 64, elements: !14)
!14 = !{!15, !16, !17, !29, !30, !37, !51, !56, !61, !66}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "num_buckets", scope: !13, file: !12, line: 56, baseType: !6, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !13, file: !12, line: 57, baseType: !6, size: 64, align: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !13, file: !12, line: 58, baseType: !18, size: 64, align: 64, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_slist_t", file: !12, line: 13, baseType: !20)
!20 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 11, size: 64, align: 64, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !20, file: !12, line: 12, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_slist_item_t", file: !12, line: 9, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_slist_item_s", file: !12, line: 7, size: 64, align: 64, elements: !26)
!26 = !{!27}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !25, file: !12, line: 8, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !13, file: !12, line: 59, baseType: !6, size: 64, align: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "hash_func", scope: !13, file: !12, line: 61, baseType: !31, size: 64, align: 64, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_hash_func", file: !12, line: 41, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{!4, !35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "compare_func", scope: !13, file: !12, line: 62, baseType: !38, size: 64, align: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_compare_func", file: !12, line: 42, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !35, !43}
!42 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_entry_t", file: !12, line: 27, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 19, size: 192, align: 64, elements: !47)
!47 = !{!48, !49, !50}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_Py_slist_item", scope: !46, file: !12, line: 21, baseType: !24, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !46, file: !12, line: 23, baseType: !35, size: 64, align: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "key_hash", scope: !46, file: !12, line: 24, baseType: !4, size: 64, align: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "copy_data_func", scope: !13, file: !12, line: 63, baseType: !52, size: 64, align: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_copy_data_func", file: !12, line: 43, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!9, !9}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "free_data_func", scope: !13, file: !12, line: 64, baseType: !57, size: 64, align: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_free_data_func", file: !12, line: 44, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !9}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "get_data_size_func", scope: !13, file: !12, line: 65, baseType: !62, size: 64, align: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_get_data_size_func", file: !12, line: 45, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{!6, !9}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !13, file: !12, line: 66, baseType: !67, size: 128, align: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_hashtable_allocator_t", file: !12, line: 53, baseType: !68)
!68 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 47, size: 128, align: 64, elements: !69)
!69 = !{!70, !74}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "malloc", scope: !68, file: !12, line: 49, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!9, !6}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !68, file: !12, line: 52, baseType: !58, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!79 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!80 = !{!81, !85, !88, !92, !108, !115, !132, !141, !152, !159, !165, !171, !190, !198, !208, !219, !225, !231, !241, !248, !265}
!81 = !DISubprogram(name: "_Py_hashtable_hash_int", scope: !82, file: !82, line: 91, type: !33, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8*)* @_Py_hashtable_hash_int, variables: !83)
!82 = !DIFile(filename: "./Modules/hashtable.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!83 = !{!84}
!84 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !81, file: !82, line: 91, type: !35)
!85 = !DISubprogram(name: "_Py_hashtable_hash_ptr", scope: !82, file: !82, line: 97, type: !33, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8*)* @_Py_hashtable_hash_ptr, variables: !86)
!86 = !{!87}
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !85, file: !82, line: 97, type: !35)
!88 = !DISubprogram(name: "_Py_hashtable_compare_direct", scope: !82, file: !82, line: 103, type: !40, isLocal: false, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, %struct._Py_hashtable_entry_t*)* @_Py_hashtable_compare_direct, variables: !89)
!89 = !{!90, !91}
!90 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !88, file: !82, line: 103, type: !35)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "entry", arg: 2, scope: !88, file: !82, line: 103, type: !43)
!92 = !DISubprogram(name: "_Py_hashtable_new_full", scope: !82, file: !82, line: 122, type: !93, isLocal: false, isDefinition: true, scopeLine: 129, flags: DIFlagPrototyped, isOptimized: true, function: %struct._Py_hashtable_t* (i64, i64, i64 (i8*)*, i32 (i8*, %struct._Py_hashtable_entry_t*)*, i8* (i8*)*, void (i8*)*, i64 (i8*)*, %struct._Py_hashtable_allocator_t*)* @_Py_hashtable_new_full, variables: !96)
!93 = !DISubroutineType(types: !94)
!94 = !{!10, !6, !6, !31, !38, !52, !57, !62, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107}
!97 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "data_size", arg: 1, scope: !92, file: !82, line: 122, type: !6)
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "init_size", arg: 2, scope: !92, file: !82, line: 122, type: !6)
!99 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hash_func", arg: 3, scope: !92, file: !82, line: 123, type: !31)
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "compare_func", arg: 4, scope: !92, file: !82, line: 124, type: !38)
!101 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "copy_data_func", arg: 5, scope: !92, file: !82, line: 125, type: !52)
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "free_data_func", arg: 6, scope: !92, file: !82, line: 126, type: !57)
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "get_data_size_func", arg: 7, scope: !92, file: !82, line: 127, type: !62)
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "allocator", arg: 8, scope: !92, file: !82, line: 128, type: !95)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ht", scope: !92, file: !82, line: 130, type: !10)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buckets_size", scope: !92, file: !82, line: 131, type: !6)
