; ModuleID = 'programs_new/Python-new/io.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.mpd_t = type { i8, i64, i64, i64, i64, i64* }
%struct.mpd_context_t = type { i64, i64, i64, i32, i32, i32, i32, i32, i32 }
%struct.mpd_spec_t = type { i64, i64, i8, i8, i8, [5 x i8], i8*, i8*, i8* }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.mpd_mbstr_t = type { i64, i64, i64, i8* }

@.str = private unnamed_addr constant [4 x i8] c"nan\00", align 1
@.str.1 = private unnamed_addr constant [4 x i8] c"NAN\00", align 1
@.str.2 = private unnamed_addr constant [5 x i8] c"snan\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"SNAN\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"inf\00", align 1
@.str.5 = private unnamed_addr constant [4 x i8] c"INF\00", align 1
@.str.6 = private unnamed_addr constant [6 x i8] c"inity\00", align 1
@.str.7 = private unnamed_addr constant [6 x i8] c"INITY\00", align 1
@.str.8 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !38, globals: !542)
!1 = !DIFile(filename: "io.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 47, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17}
!6 = !DIEnumerator(name: "_ISupper", value: 256)
!7 = !DIEnumerator(name: "_ISlower", value: 512)
!8 = !DIEnumerator(name: "_ISalpha", value: 1024)
!9 = !DIEnumerator(name: "_ISdigit", value: 2048)
!10 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!11 = !DIEnumerator(name: "_ISspace", value: 8192)
!12 = !DIEnumerator(name: "_ISprint", value: 16384)
!13 = !DIEnumerator(name: "_ISgraph", value: 32768)
!14 = !DIEnumerator(name: "_ISblank", value: 1)
!15 = !DIEnumerator(name: "_IScntrl", value: 2)
!16 = !DIEnumerator(name: "_ISpunct", value: 4)
!17 = !DIEnumerator(name: "_ISalnum", value: 8)
!18 = !{!19, !22, !23, !26, !31, !32, !34, !35, !33, !36}
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !20, line: 48, baseType: !21)
!20 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!21 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 62, baseType: !25)
!24 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!25 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpd_ssize_t", file: !27, line: 157, baseType: !28)
!27 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_decimal/libmpdec/mpdecimal.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !29, line: 197, baseType: !30)
!29 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!30 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!31 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !27, line: 382, baseType: !21)
!35 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!38 = !{!39, !96, !106, !112, !121, !127, !150, !192, !227, !236, !246, !258, !272, !333, !339, !347, !354, !363, !370, !380, !390, !403, !411, !419, !426, !435, !442, !453, !463, !479, !496, !503, !510, !515, !524}
!39 = !DISubprogram(name: "mpd_qset_string", scope: !40, file: !40, line: 194, type: !41, isLocal: false, isDefinition: true, scopeLine: 196, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.mpd_t*, i8*, %struct.mpd_context_t*, i32*)* @mpd_qset_string, variables: !75)
!40 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_decimal/libmpdec/io.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!41 = !DISubroutineType(types: !42)
!42 = !{null, !43, !56, !58, !74}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpd_t", file: !27, line: 379, baseType: !45)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "mpd_t", file: !27, line: 372, size: 384, align: 64, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !45, file: !27, line: 373, baseType: !19, size: 8, align: 8)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !45, file: !27, line: 374, baseType: !26, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !45, file: !27, line: 375, baseType: !26, size: 64, align: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !45, file: !27, line: 376, baseType: !26, size: 64, align: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !45, file: !27, line: 377, baseType: !26, size: 64, align: 64, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !45, file: !27, line: 378, baseType: !53, size: 64, align: 64, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpd_uint_t", file: !27, line: 149, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !20, line: 55, baseType: !25)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpd_context_t", file: !27, line: 270, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "mpd_context_t", file: !27, line: 260, size: 384, align: 64, elements: !62)
!62 = !{!63, !64, !65, !66, !69, !70, !71, !72, !73}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !61, file: !27, line: 261, baseType: !26, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "emax", scope: !61, file: !27, line: 262, baseType: !26, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "emin", scope: !61, file: !27, line: 263, baseType: !26, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "traps", scope: !61, file: !27, line: 264, baseType: !67, size: 32, align: 32, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !20, line: 51, baseType: !68)
!68 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !61, file: !27, line: 265, baseType: !67, size: 32, align: 32, offset: 224)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "newtrap", scope: !61, file: !27, line: 266, baseType: !67, size: 32, align: 32, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "round", scope: !61, file: !27, line: 267, baseType: !31, size: 32, align: 32, offset: 288)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "clamp", scope: !61, file: !27, line: 268, baseType: !31, size: 32, align: 32, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "allcr", scope: !61, file: !27, line: 269, baseType: !31, size: 32, align: 32, offset: 352)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89}
!76 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dec", arg: 1, scope: !39, file: !40, line: 194, type: !43)
!77 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 2, scope: !39, file: !40, line: 194, type: !56)
!78 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 3, scope: !39, file: !40, line: 194, type: !58)
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 4, scope: !39, file: !40, line: 195, type: !74)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !39, file: !40, line: 197, type: !26)
!81 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !39, file: !40, line: 197, type: !26)
!82 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !39, file: !40, line: 197, type: !26)
!83 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coeff", scope: !39, file: !40, line: 198, type: !56)
!84 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !39, file: !40, line: 198, type: !56)
!85 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dpoint", scope: !39, file: !40, line: 199, type: !56)
!86 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exp", scope: !39, file: !40, line: 199, type: !56)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "digits", scope: !39, file: !40, line: 200, type: !23)
!88 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !39, file: !40, line: 201, type: !19)
!89 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fracdigits", scope: !90, file: !40, line: 277, type: !23)
!90 = distinct !DILexicalBlock(scope: !91, file: !40, line: 276, column: 21)
!91 = distinct !DILexicalBlock(scope: !92, file: !40, line: 276, column: 13)
!92 = distinct !DILexicalBlock(scope: !93, file: !40, line: 257, column: 10)
!93 = distinct !DILexicalBlock(scope: !94, file: !40, line: 248, column: 14)
!94 = distinct !DILexicalBlock(scope: !95, file: !40, line: 233, column: 14)
!95 = distinct !DILexicalBlock(scope: !39, file: !40, line: 217, column: 9)
!96 = !DISubprogram(name: "mpd_to_sci", scope: !40, file: !40, line: 627, type: !97, isLocal: false, isDefinition: true, scopeLine: 628, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.mpd_t*, i32)* @mpd_to_sci, variables: !101)
!97 = !DISubroutineType(types: !98)
!98 = !{!32, !99, !31}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!101 = !{!102, !103, !104, !105}
!102 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dec", arg: 1, scope: !96, file: !40, line: 627, type: !99)
!103 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt", arg: 2, scope: !96, file: !40, line: 627, type: !31)
!104 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !96, file: !40, line: 629, type: !32)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !96, file: !40, line: 630, type: !31)
!106 = !DISubprogram(name: "mpd_to_eng", scope: !40, file: !40, line: 638, type: !97, isLocal: false, isDefinition: true, scopeLine: 639, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.mpd_t*, i32)* @mpd_to_eng, variables: !107)
!107 = !{!108, !109, !110, !111}
!108 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dec", arg: 1, scope: !106, file: !40, line: 638, type: !99)
!109 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt", arg: 2, scope: !106, file: !40, line: 638, type: !31)
!110 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !106, file: !40, line: 640, type: !32)
!111 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !106, file: !40, line: 641, type: !31)
!112 = !DISubprogram(name: "mpd_to_sci_size", scope: !40, file: !40, line: 649, type: !113, isLocal: false, isDefinition: true, scopeLine: 650, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8**, %struct.mpd_t*, i32)* @mpd_to_sci_size, variables: !116)
!113 = !DISubroutineType(types: !114)
!114 = !{!26, !115, !99, !31}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!116 = !{!117, !118, !119, !120}
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "res", arg: 1, scope: !112, file: !40, line: 649, type: !115)
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dec", arg: 2, scope: !112, file: !40, line: 649, type: !99)
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt", arg: 3, scope: !112, file: !40, line: 649, type: !31)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !112, file: !40, line: 651, type: !31)
!121 = !DISubprogram(name: "mpd_to_eng_size", scope: !40, file: !40, line: 658, type: !113, isLocal: false, isDefinition: true, scopeLine: 659, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8**, %struct.mpd_t*, i32)* @mpd_to_eng_size, variables: !122)
!122 = !{!123, !124, !125, !126}
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "res", arg: 1, scope: !121, file: !40, line: 658, type: !115)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dec", arg: 2, scope: !121, file: !40, line: 658, type: !99)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt", arg: 3, scope: !121, file: !40, line: 658, type: !31)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !121, file: !40, line: 660, type: !31)
!127 = !DISubprogram(name: "mpd_validate_lconv", scope: !40, file: !40, line: 745, type: !128, isLocal: false, isDefinition: true, scopeLine: 746, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.mpd_spec_t*)* @mpd_validate_lconv, variables: !146)
!128 = !DISubroutineType(types: !129)
!129 = !{!31, !130}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpd_spec_t", file: !27, line: 400, baseType: !132)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "mpd_spec_t", file: !27, line: 390, size: 384, align: 64, elements: !133)
!133 = !{!134, !135, !136, !137, !138, !139, !143, !144, !145}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "min_width", scope: !132, file: !27, line: 391, baseType: !26, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !132, file: !27, line: 392, baseType: !26, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !27, line: 393, baseType: !33, size: 8, align: 8, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !132, file: !27, line: 394, baseType: !33, size: 8, align: 8, offset: 136)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !132, file: !27, line: 395, baseType: !33, size: 8, align: 8, offset: 144)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !132, file: !27, line: 396, baseType: !140, size: 40, align: 8, offset: 152)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 40, align: 8, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 5)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "dot", scope: !132, file: !27, line: 397, baseType: !56, size: 64, align: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "sep", scope: !132, file: !27, line: 398, baseType: !56, size: 64, align: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !132, file: !27, line: 399, baseType: !56, size: 64, align: 64, offset: 320)
!146 = !{!147, !148, !149}
!147 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "spec", arg: 1, scope: !127, file: !40, line: 745, type: !130)
!148 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !127, file: !40, line: 747, type: !23)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cp", scope: !127, file: !40, line: 749, type: !56)
!150 = !DISubprogram(name: "mpd_parse_fmt_str", scope: !40, file: !40, line: 768, type: !151, isLocal: false, isDefinition: true, scopeLine: 769, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.mpd_spec_t*, i8*, i32)* @mpd_parse_fmt_str, variables: !153)
!151 = !DISubroutineType(types: !152)
!152 = !{!31, !130, !56, !31}
!153 = !{!154, !155, !156, !157, !158, !159, !160}
!154 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "spec", arg: 1, scope: !150, file: !40, line: 768, type: !130)
!155 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt", arg: 2, scope: !150, file: !40, line: 768, type: !56)
!156 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "caps", arg: 3, scope: !150, file: !40, line: 768, type: !31)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cp", scope: !150, file: !40, line: 770, type: !32)
!158 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "have_align", scope: !150, file: !40, line: 771, type: !31)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !150, file: !40, line: 771, type: !31)
!160 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lc", scope: !161, file: !40, line: 864, type: !164)
!161 = distinct !DILexicalBlock(scope: !162, file: !40, line: 862, column: 40)
!162 = distinct !DILexicalBlock(scope: !163, file: !40, line: 862, column: 14)
!163 = distinct !DILexicalBlock(scope: !150, file: !40, line: 858, column: 9)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !166, line: 54, size: 768, align: 64, elements: !167)
!166 = !DIFile(filename: "/usr/include/locale.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!167 = !{!168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !165, file: !166, line: 58, baseType: !32, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !165, file: !166, line: 59, baseType: !32, size: 64, align: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !165, file: !166, line: 65, baseType: !32, size: 64, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !165, file: !166, line: 71, baseType: !32, size: 64, align: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !165, file: !166, line: 72, baseType: !32, size: 64, align: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !165, file: !166, line: 73, baseType: !32, size: 64, align: 64, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !165, file: !166, line: 74, baseType: !32, size: 64, align: 64, offset: 384)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !165, file: !166, line: 75, baseType: !32, size: 64, align: 64, offset: 448)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !165, file: !166, line: 76, baseType: !32, size: 64, align: 64, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !165, file: !166, line: 77, baseType: !32, size: 64, align: 64, offset: 576)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !165, file: !166, line: 78, baseType: !33, size: 8, align: 8, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !165, file: !166, line: 79, baseType: !33, size: 8, align: 8, offset: 648)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !165, file: !166, line: 81, baseType: !33, size: 8, align: 8, offset: 656)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !165, file: !166, line: 83, baseType: !33, size: 8, align: 8, offset: 664)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !165, file: !166, line: 85, baseType: !33, size: 8, align: 8, offset: 672)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !165, file: !166, line: 87, baseType: !33, size: 8, align: 8, offset: 680)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !165, file: !166, line: 94, baseType: !33, size: 8, align: 8, offset: 688)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !165, file: !166, line: 95, baseType: !33, size: 8, align: 8, offset: 696)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !165, file: !166, line: 98, baseType: !33, size: 8, align: 8, offset: 704)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !165, file: !166, line: 100, baseType: !33, size: 8, align: 8, offset: 712)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !165, file: !166, line: 102, baseType: !33, size: 8, align: 8, offset: 720)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !165, file: !166, line: 104, baseType: !33, size: 8, align: 8, offset: 728)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !165, file: !166, line: 111, baseType: !33, size: 8, align: 8, offset: 736)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !165, file: !166, line: 112, baseType: !33, size: 8, align: 8, offset: 744)
!192 = !DISubprogram(name: "mpd_qformat_spec", scope: !40, file: !40, line: 1227, type: !193, isLocal: false, isDefinition: true, scopeLine: 1229, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.mpd_t*, %struct.mpd_spec_t*, %struct.mpd_context_t*, i32*)* @mpd_qformat_spec, variables: !197)
!193 = !DISubroutineType(types: !194)
!194 = !{!32, !99, !195, !58, !74}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!197 = !{!198, !199, !200, !201, !202, !206, !207, !208, !216, !217, !218, !219, !223, !226}
!198 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dec", arg: 1, scope: !192, file: !40, line: 1227, type: !99)
!199 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "spec", arg: 2, scope: !192, file: !40, line: 1227, type: !195)
!200 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 3, scope: !192, file: !40, line: 1228, type: !58)
!201 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 4, scope: !192, file: !40, line: 1228, type: !74)
!202 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dt", scope: !192, file: !40, line: 1230, type: !203)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 4096, align: 64, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 64)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !192, file: !40, line: 1231, type: !44)
!207 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dplace", scope: !192, file: !40, line: 1232, type: !26)
!208 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !192, file: !40, line: 1233, type: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpd_mbstr_t", file: !40, line: 901, baseType: !210)
!210 = !DICompositeType(tag: DW_TAG_structure_type, file: !40, line: 896, size: 256, align: 64, elements: !211)
!211 = !{!212, !213, !214, !215}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !210, file: !40, line: 897, baseType: !26, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "nchars", scope: !210, file: !40, line: 898, baseType: !26, size: 64, align: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !210, file: !40, line: 899, baseType: !26, size: 64, align: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !210, file: !40, line: 900, baseType: !32, size: 64, align: 64, offset: 192)
!216 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "stackspec", scope: !192, file: !40, line: 1234, type: !131)
!217 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !192, file: !40, line: 1235, type: !33)
!218 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flags", scope: !192, file: !40, line: 1236, type: !31)
!219 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "__res", scope: !220, file: !40, line: 1245, type: !31)
!220 = distinct !DILexicalBlock(scope: !221, file: !40, line: 1245, column: 32)
!221 = distinct !DILexicalBlock(scope: !222, file: !40, line: 1244, column: 87)
!222 = distinct !DILexicalBlock(scope: !192, file: !40, line: 1244, column: 9)
!223 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "workstatus", scope: !224, file: !40, line: 1265, type: !67)
!224 = distinct !DILexicalBlock(scope: !225, file: !40, line: 1264, column: 10)
!225 = distinct !DILexicalBlock(scope: !192, file: !40, line: 1255, column: 9)
!226 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prec", scope: !224, file: !40, line: 1266, type: !26)
!227 = !DISubprogram(name: "mpd_qformat", scope: !40, file: !40, line: 1376, type: !228, isLocal: false, isDefinition: true, scopeLine: 1378, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct.mpd_t*, i8*, %struct.mpd_context_t*, i32*)* @mpd_qformat, variables: !230)
!228 = !DISubroutineType(types: !229)
!229 = !{!32, !99, !56, !58, !74}
!230 = !{!231, !232, !233, !234, !235}
!231 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dec", arg: 1, scope: !227, file: !40, line: 1376, type: !99)
!232 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fmt", arg: 2, scope: !227, file: !40, line: 1376, type: !56)
!233 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 3, scope: !227, file: !40, line: 1376, type: !58)
!234 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 4, scope: !227, file: !40, line: 1377, type: !74)
!235 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "spec", scope: !227, file: !40, line: 1379, type: !131)
!236 = !DISubprogram(name: "mpd_snprint_flags", scope: !40, file: !40, line: 1441, type: !237, isLocal: false, isDefinition: true, scopeLine: 1442, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32, i32)* @mpd_snprint_flags, variables: !239)
!237 = !DISubroutineType(types: !238)
!238 = !{!31, !32, !31, !67}
!239 = !{!240, !241, !242, !243, !244, !245}
!240 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !236, file: !40, line: 1441, type: !32)
!241 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nmemb", arg: 2, scope: !236, file: !40, line: 1441, type: !31)
!242 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 3, scope: !236, file: !40, line: 1441, type: !67)
!243 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cp", scope: !236, file: !40, line: 1443, type: !32)
!244 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !236, file: !40, line: 1444, type: !31)
!245 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !236, file: !40, line: 1444, type: !31)
!246 = !DISubprogram(name: "mpd_lsnprint_flags", scope: !40, file: !40, line: 1466, type: !247, isLocal: false, isDefinition: true, scopeLine: 1467, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32, i32, i8**)* @mpd_lsnprint_flags, variables: !250)
!247 = !DISubroutineType(types: !248)
!248 = !{!31, !32, !31, !67, !249}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!250 = !{!251, !252, !253, !254, !255, !256, !257}
!251 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !246, file: !40, line: 1466, type: !32)
!252 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nmemb", arg: 2, scope: !246, file: !40, line: 1466, type: !31)
!253 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 3, scope: !246, file: !40, line: 1466, type: !67)
!254 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flag_string", arg: 4, scope: !246, file: !40, line: 1466, type: !249)
!255 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cp", scope: !246, file: !40, line: 1468, type: !32)
!256 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !246, file: !40, line: 1469, type: !31)
!257 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !246, file: !40, line: 1469, type: !31)
!258 = !DISubprogram(name: "mpd_lsnprint_signals", scope: !40, file: !40, line: 1502, type: !247, isLocal: false, isDefinition: true, scopeLine: 1503, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i32, i32, i8**)* @mpd_lsnprint_signals, variables: !259)
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !268}
!260 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dest", arg: 1, scope: !258, file: !40, line: 1502, type: !32)
!261 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nmemb", arg: 2, scope: !258, file: !40, line: 1502, type: !31)
!262 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flags", arg: 3, scope: !258, file: !40, line: 1502, type: !67)
!263 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "signal_string", arg: 4, scope: !258, file: !40, line: 1502, type: !249)
!264 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cp", scope: !258, file: !40, line: 1504, type: !32)
!265 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !258, file: !40, line: 1505, type: !31)
!266 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !258, file: !40, line: 1505, type: !31)
!267 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ieee_invalid_done", scope: !258, file: !40, line: 1506, type: !31)
!268 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "f", scope: !269, file: !40, line: 1519, type: !67)
!269 = distinct !DILexicalBlock(scope: !270, file: !40, line: 1518, column: 30)
!270 = distinct !DILexicalBlock(scope: !271, file: !40, line: 1518, column: 5)
!271 = distinct !DILexicalBlock(scope: !258, file: !40, line: 1518, column: 5)
!272 = !DISubprogram(name: "mpd_fprint", scope: !40, file: !40, line: 1546, type: !273, isLocal: false, isDefinition: true, scopeLine: 1547, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IO_FILE*, %struct.mpd_t*)* @mpd_fprint, variables: !329)
!273 = !DISubroutineType(types: !274)
!274 = !{null, !275, !99}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !277, line: 48, baseType: !278)
!277 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !279, line: 246, size: 1728, align: 64, elements: !280)
!279 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!280 = !{!281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !301, !302, !303, !304, !307, !308, !310, !314, !317, !319, !320, !321, !322, !323, !324, !325}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !278, file: !279, line: 247, baseType: !31, size: 32, align: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !278, file: !279, line: 252, baseType: !32, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !278, file: !279, line: 253, baseType: !32, size: 64, align: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !278, file: !279, line: 254, baseType: !32, size: 64, align: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !278, file: !279, line: 255, baseType: !32, size: 64, align: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !278, file: !279, line: 256, baseType: !32, size: 64, align: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !278, file: !279, line: 257, baseType: !32, size: 64, align: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !278, file: !279, line: 258, baseType: !32, size: 64, align: 64, offset: 448)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !278, file: !279, line: 259, baseType: !32, size: 64, align: 64, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !278, file: !279, line: 261, baseType: !32, size: 64, align: 64, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !278, file: !279, line: 262, baseType: !32, size: 64, align: 64, offset: 640)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !278, file: !279, line: 263, baseType: !32, size: 64, align: 64, offset: 704)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !278, file: !279, line: 265, baseType: !294, size: 64, align: 64, offset: 768)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !279, line: 161, size: 192, align: 64, elements: !296)
!296 = !{!297, !298, !300}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !295, file: !279, line: 162, baseType: !294, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !295, file: !279, line: 163, baseType: !299, size: 64, align: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !295, file: !279, line: 167, baseType: !31, size: 32, align: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !278, file: !279, line: 267, baseType: !299, size: 64, align: 64, offset: 832)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !278, file: !279, line: 269, baseType: !31, size: 32, align: 32, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !278, file: !279, line: 273, baseType: !31, size: 32, align: 32, offset: 928)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !278, file: !279, line: 275, baseType: !305, size: 64, align: 64, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !306, line: 140, baseType: !30)
!306 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !278, file: !279, line: 279, baseType: !35, size: 16, align: 16, offset: 1024)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !278, file: !279, line: 280, baseType: !309, size: 8, align: 8, offset: 1040)
!309 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !278, file: !279, line: 281, baseType: !311, size: 8, align: 8, offset: 1048)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, align: 8, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 1)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !278, file: !279, line: 285, baseType: !315, size: 64, align: 64, offset: 1088)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !279, line: 155, baseType: null)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !278, file: !279, line: 294, baseType: !318, size: 64, align: 64, offset: 1152)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !306, line: 141, baseType: !30)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !278, file: !279, line: 303, baseType: !22, size: 64, align: 64, offset: 1216)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !278, file: !279, line: 304, baseType: !22, size: 64, align: 64, offset: 1280)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !278, file: !279, line: 305, baseType: !22, size: 64, align: 64, offset: 1344)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !278, file: !279, line: 306, baseType: !22, size: 64, align: 64, offset: 1408)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !278, file: !279, line: 307, baseType: !23, size: 64, align: 64, offset: 1472)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !278, file: !279, line: 309, baseType: !31, size: 32, align: 32, offset: 1536)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !278, file: !279, line: 311, baseType: !326, size: 160, align: 8, offset: 1568)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 160, align: 8, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 20)
!329 = !{!330, !331, !332}
!330 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "file", arg: 1, scope: !272, file: !40, line: 1546, type: !275)
!331 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dec", arg: 2, scope: !272, file: !40, line: 1546, type: !99)
!332 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decstring", scope: !272, file: !40, line: 1548, type: !32)
!333 = !DISubprogram(name: "mpd_print", scope: !40, file: !40, line: 1561, type: !334, isLocal: false, isDefinition: true, scopeLine: 1562, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.mpd_t*)* @mpd_print, variables: !336)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !99}
!336 = !{!337, !338}
!337 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dec", arg: 1, scope: !333, file: !40, line: 1561, type: !99)
!338 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "decstring", scope: !333, file: !40, line: 1563, type: !32)
!339 = !DISubprogram(name: "_mpd_strneq", scope: !40, file: !40, line: 58, type: !340, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i8*, i8*, i8*, i64)* @_mpd_strneq, variables: !342)
!340 = !DISubroutineType(types: !341)
!341 = !{!31, !56, !56, !56, !23}
!342 = !{!343, !344, !345, !346}
!343 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !339, file: !40, line: 58, type: !56)
!344 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "l", arg: 2, scope: !339, file: !40, line: 58, type: !56)
!345 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "u", arg: 3, scope: !339, file: !40, line: 58, type: !56)
!346 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 4, scope: !339, file: !40, line: 58, type: !23)
!347 = !DISubprogram(name: "scan_payload", scope: !40, file: !40, line: 177, type: !348, isLocal: true, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i8**)* @scan_payload, variables: !350)
!348 = !DISubroutineType(types: !349)
!349 = !{!56, !56, !249}
!350 = !{!351, !352, !353}
!351 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !347, file: !40, line: 177, type: !56)
!352 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 2, scope: !347, file: !40, line: 177, type: !249)
!353 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coeff", scope: !347, file: !40, line: 179, type: !56)
!354 = !DISubprogram(name: "scan_dpoint_exp", scope: !40, file: !40, line: 131, type: !355, isLocal: true, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i8**, i8**, i8**)* @scan_dpoint_exp, variables: !357)
!355 = !DISubroutineType(types: !356)
!356 = !{!56, !56, !249, !249, !249}
!357 = !{!358, !359, !360, !361, !362}
!358 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !354, file: !40, line: 131, type: !56)
!359 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dpoint", arg: 2, scope: !354, file: !40, line: 131, type: !249)
!360 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "exp", arg: 3, scope: !354, file: !40, line: 131, type: !249)
!361 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "end", arg: 4, scope: !354, file: !40, line: 132, type: !249)
!362 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "coeff", scope: !354, file: !40, line: 134, type: !56)
!363 = !DISubprogram(name: "strtoexp", scope: !40, file: !40, line: 71, type: !364, isLocal: true, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i8*)* @strtoexp, variables: !366)
!364 = !DISubroutineType(types: !365)
!365 = !{!26, !56}
!366 = !{!367, !368, !369}
