; ModuleID = 'programs_new/Python-new/iobase.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !383, globals: !755)
!1 = !DIFile(filename: "iobase.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !89, !350, !94, !364, !365, !373}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !6, line: 109, baseType: !7)
!6 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 105, size: 128, align: 64, elements: !8)
!8 = !{!9, !17}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !7, file: !6, line: 107, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !11, line: 177, baseType: !12)
!11 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !13, line: 102, baseType: !14)
!13 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !15, line: 181, baseType: !16)
!15 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!16 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !7, file: !6, line: 108, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !6, line: 334, size: 3200, align: 64, elements: !20)
!20 = !{!21, !27, !31, !32, !33, !38, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !19, file: !6, line: 335, baseType: !22, size: 192, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 114, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 111, size: 192, align: 64, elements: !24)
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !23, file: !6, line: 112, baseType: !5, size: 128, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !23, file: !6, line: 113, baseType: !10, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !19, file: !6, line: 336, baseType: !28, size: 64, align: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !19, file: !6, line: 337, baseType: !10, size: 64, align: 64, offset: 256)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !19, file: !6, line: 337, baseType: !10, size: 64, align: 64, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !19, file: !6, line: 341, baseType: !34, size: 64, align: 64, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 308, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !4}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !19, file: !6, line: 342, baseType: !39, size: 64, align: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !6, line: 314, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !4, !44, !43}
!43 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !13, line: 48, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 246, size: 1728, align: 64, elements: !48)
!47 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!48 = !{!49, !50, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !70, !71, !72, !73, !75, !77, !79, !83, !86, !88, !90, !91, !92, !93, !97, !98}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !46, file: !47, line: 247, baseType: !43, size: 32, align: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !46, file: !47, line: 252, baseType: !51, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !46, file: !47, line: 253, baseType: !51, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !46, file: !47, line: 254, baseType: !51, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !46, file: !47, line: 255, baseType: !51, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !46, file: !47, line: 256, baseType: !51, size: 64, align: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !46, file: !47, line: 257, baseType: !51, size: 64, align: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !46, file: !47, line: 258, baseType: !51, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !46, file: !47, line: 259, baseType: !51, size: 64, align: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !46, file: !47, line: 261, baseType: !51, size: 64, align: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !46, file: !47, line: 262, baseType: !51, size: 64, align: 64, offset: 640)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !46, file: !47, line: 263, baseType: !51, size: 64, align: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !46, file: !47, line: 265, baseType: !63, size: 64, align: 64, offset: 768)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !47, line: 161, size: 192, align: 64, elements: !65)
!65 = !{!66, !67, !69}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !64, file: !47, line: 162, baseType: !63, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !64, file: !47, line: 163, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !64, file: !47, line: 167, baseType: !43, size: 32, align: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !46, file: !47, line: 267, baseType: !68, size: 64, align: 64, offset: 832)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !46, file: !47, line: 269, baseType: !43, size: 32, align: 32, offset: 896)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !46, file: !47, line: 273, baseType: !43, size: 32, align: 32, offset: 928)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !46, file: !47, line: 275, baseType: !74, size: 64, align: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !15, line: 140, baseType: !16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !46, file: !47, line: 279, baseType: !76, size: 16, align: 16, offset: 1024)
!76 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !46, file: !47, line: 280, baseType: !78, size: 8, align: 8, offset: 1040)
!78 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !46, file: !47, line: 281, baseType: !80, size: 8, align: 8, offset: 1048)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 8, align: 8, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 1)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !46, file: !47, line: 285, baseType: !84, size: 64, align: 64, offset: 1088)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !47, line: 155, baseType: null)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !46, file: !47, line: 294, baseType: !87, size: 64, align: 64, offset: 1152)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !15, line: 141, baseType: !16)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !46, file: !47, line: 303, baseType: !89, size: 64, align: 64, offset: 1216)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !46, file: !47, line: 304, baseType: !89, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !46, file: !47, line: 305, baseType: !89, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !46, file: !47, line: 306, baseType: !89, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !46, file: !47, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !46, file: !47, line: 309, baseType: !43, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !46, file: !47, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !19, file: !6, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!4, !4, !51}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !19, file: !6, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!43, !4, !51, !4}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !19, file: !6, line: 345, baseType: !89, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !19, file: !6, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!4, !4}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !19, file: !6, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !6, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !6, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!4, !4, !4}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !6, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !6, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !6, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !6, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !6, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!4, !4, !4, !4}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !6, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !6, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !6, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !6, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!43, !4}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !6, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !6, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !6, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !6, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !6, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !6, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !6, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !6, line: 258, baseType: !89, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !6, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !6, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !6, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !6, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !6, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !6, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !6, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !6, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !6, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !6, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !6, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !6, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !6, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !6, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !6, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !6, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !19, file: !6, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !6, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !6, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!10, !4}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !6, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !6, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!4, !4, !10}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !6, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !6, line: 285, baseType: !89, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !6, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!43, !4, !10, !4}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !6, line: 287, baseType: !89, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !6, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!43, !4, !4}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !6, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !6, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !19, file: !6, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !6, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !6, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !6, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !6, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!43, !4, !4, !4}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !19, file: !6, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !4}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !11, line: 186, baseType: !10)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !19, file: !6, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !19, file: !6, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !19, file: !6, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !19, file: !6, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !19, file: !6, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !6, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !6, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !6, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!43, !4, !235, !43}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !6, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !6, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !6, line: 179, baseType: !89, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !6, line: 180, baseType: !4, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !6, line: 181, baseType: !10, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !6, line: 182, baseType: !10, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !6, line: 184, baseType: !43, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !6, line: 185, baseType: !43, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !6, line: 186, baseType: !51, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !6, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !6, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !6, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !6, line: 190, baseType: !89, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !6, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !6, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !4, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !19, file: !6, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !19, file: !6, line: 368, baseType: !28, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !19, file: !6, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!43, !4, !263, !89}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!43, !4, !89}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !19, file: !6, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !19, file: !6, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!4, !4, !4, !43}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !19, file: !6, line: 382, baseType: !10, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !19, file: !6, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !19, file: !6, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !19, file: !6, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !28, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !43, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !28, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !19, file: !6, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !291, line: 18, size: 320, align: 64, elements: !292)
!291 = !DIFile(filename: "Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!292 = !{!293, !294, !295, !296, !297}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !291, line: 19, baseType: !51, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !290, file: !291, line: 20, baseType: !43, size: 32, align: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !290, file: !291, line: 21, baseType: !10, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !290, file: !291, line: 22, baseType: !43, size: 32, align: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !290, file: !291, line: 23, baseType: !51, size: 64, align: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !19, file: !6, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !51, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!4, !4, !89}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!43, !4, !4, !89}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !51, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !89, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !19, file: !6, line: 392, baseType: !18, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !19, file: !6, line: 393, baseType: !4, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !19, file: !6, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 325, baseType: !134)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !19, file: !6, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 326, baseType: !210)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !19, file: !6, line: 396, baseType: !10, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !19, file: !6, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 327, baseType: !210)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !19, file: !6, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!4, !18, !10}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !19, file: !6, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!4, !18, !4, !4}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !19, file: !6, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !89}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !19, file: !6, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !19, file: !6, line: 402, baseType: !4, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !19, file: !6, line: 403, baseType: !4, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !19, file: !6, line: 404, baseType: !4, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !19, file: !6, line: 405, baseType: !4, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !19, file: !6, line: 406, baseType: !4, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !19, file: !6, line: 407, baseType: !34, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !19, file: !6, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !19, file: !6, line: 412, baseType: !34, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !352, line: 253, baseType: !353)
!352 = !DIFile(filename: "Include/objimpl.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!353 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !352, line: 246, size: 192, align: 64, elements: !354)
!354 = !{!355, !362}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !353, file: !352, line: 251, baseType: !356, size: 192, align: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, scope: !353, file: !352, line: 247, size: 192, align: 64, elements: !357)
!357 = !{!358, !360, !361}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !356, file: !352, line: 248, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !356, file: !352, line: 249, baseType: !359, size: 64, align: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !356, file: !352, line: 250, baseType: !10, size: 64, align: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !353, file: !352, line: 252, baseType: !363, size: 64, align: 64)
!363 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !367, line: 41, baseType: !368)
!367 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!368 = !DICompositeType(tag: DW_TAG_structure_type, file: !367, line: 31, size: 320, align: 64, elements: !369)
!369 = !{!370, !371, !372}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !368, file: !367, line: 32, baseType: !22, size: 192, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !368, file: !367, line: 33, baseType: !218, size: 64, align: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !368, file: !367, line: 34, baseType: !80, size: 8, align: 8, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyByteArrayObject", file: !375, line: 30, baseType: !376)
!375 = !DIFile(filename: "Include/bytearrayobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!376 = !DICompositeType(tag: DW_TAG_structure_type, file: !375, line: 23, size: 448, align: 64, elements: !377)
!377 = !{!378, !379, !380, !381, !382}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !376, file: !375, line: 24, baseType: !22, size: 192, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ob_alloc", scope: !376, file: !375, line: 25, baseType: !10, size: 64, align: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ob_bytes", scope: !376, file: !375, line: 26, baseType: !51, size: 64, align: 64, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ob_start", scope: !376, file: !375, line: 27, baseType: !51, size: 64, align: 64, offset: 320)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ob_exports", scope: !376, file: !375, line: 29, baseType: !43, size: 32, align: 32, offset: 384)
!383 = !{!384, !389, !393, !410, !427, !444, !451, !465, !485, !496, !507, !510, !518, !522, !526, !530, !534, !548, !552, !556, !560, !564, !568, !572, !576, !619, !651, !676, !680, !697, !716}
!384 = !DISubprogram(name: "_PyIOBase_check_closed", scope: !385, file: !385, line: 167, type: !126, isLocal: false, isDefinition: true, scopeLine: 168, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @_PyIOBase_check_closed, variables: !386)
!385 = !DIFile(filename: "./Modules/_io/iobase.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!386 = !{!387, !388}
!387 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !384, file: !385, line: 167, type: !4)
!388 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !384, file: !385, line: 167, type: !4)
!389 = !DISubprogram(name: "_PyIOBase_finalize", scope: !385, file: !385, line: 252, type: !144, isLocal: false, isDefinition: true, scopeLine: 253, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @_PyIOBase_finalize, variables: !390)
!390 = !{!391, !392}
!391 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !389, file: !385, line: 252, type: !4)
!392 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "is_zombie", scope: !389, file: !385, line: 254, type: !43)
!393 = !DISubprogram(name: "_PyIOBase_check_seekable", scope: !385, file: !385, line: 320, type: !126, isLocal: false, isDefinition: true, scopeLine: 321, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @_PyIOBase_check_seekable, variables: !394)
!394 = !{!395, !396, !397, !398, !402, !406}
!395 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !393, file: !385, line: 320, type: !4)
!396 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !393, file: !385, line: 320, type: !4)
!397 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !393, file: !385, line: 322, type: !4)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !399, file: !385, line: 326, type: !4)
!399 = distinct !DILexicalBlock(scope: !400, file: !385, line: 326, column: 12)
!400 = distinct !DILexicalBlock(scope: !401, file: !385, line: 325, column: 48)
!401 = distinct !DILexicalBlock(scope: !393, file: !385, line: 325, column: 9)
!402 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !403, file: !385, line: 326, type: !4)
!403 = distinct !DILexicalBlock(scope: !404, file: !385, line: 326, column: 105)
!404 = distinct !DILexicalBlock(scope: !405, file: !385, line: 326, column: 80)
!405 = distinct !DILexicalBlock(scope: !399, file: !385, line: 326, column: 57)
!406 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !407, file: !385, line: 331, type: !4)
!407 = distinct !DILexicalBlock(scope: !408, file: !385, line: 331, column: 12)
!408 = distinct !DILexicalBlock(scope: !409, file: !385, line: 330, column: 49)
!409 = distinct !DILexicalBlock(scope: !393, file: !385, line: 330, column: 9)
!410 = !DISubprogram(name: "_PyIOBase_check_readable", scope: !385, file: !385, line: 349, type: !126, isLocal: false, isDefinition: true, scopeLine: 350, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @_PyIOBase_check_readable, variables: !411)
!411 = !{!412, !413, !414, !415, !419, !423}
!412 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !410, file: !385, line: 349, type: !4)
!413 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !410, file: !385, line: 349, type: !4)
!414 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !410, file: !385, line: 351, type: !4)
!415 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !416, file: !385, line: 355, type: !4)
!416 = distinct !DILexicalBlock(scope: !417, file: !385, line: 355, column: 12)
!417 = distinct !DILexicalBlock(scope: !418, file: !385, line: 354, column: 48)
!418 = distinct !DILexicalBlock(scope: !410, file: !385, line: 354, column: 9)
!419 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !420, file: !385, line: 355, type: !4)
!420 = distinct !DILexicalBlock(scope: !421, file: !385, line: 355, column: 105)
!421 = distinct !DILexicalBlock(scope: !422, file: !385, line: 355, column: 80)
!422 = distinct !DILexicalBlock(scope: !416, file: !385, line: 355, column: 57)
!423 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !424, file: !385, line: 360, type: !4)
!424 = distinct !DILexicalBlock(scope: !425, file: !385, line: 360, column: 12)
!425 = distinct !DILexicalBlock(scope: !426, file: !385, line: 359, column: 49)
!426 = distinct !DILexicalBlock(scope: !410, file: !385, line: 359, column: 9)
!427 = !DISubprogram(name: "_PyIOBase_check_writable", scope: !385, file: !385, line: 378, type: !126, isLocal: false, isDefinition: true, scopeLine: 379, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @_PyIOBase_check_writable, variables: !428)
!428 = !{!429, !430, !431, !432, !436, !440}
!429 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !427, file: !385, line: 378, type: !4)
!430 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !427, file: !385, line: 378, type: !4)
!431 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !427, file: !385, line: 380, type: !4)
!432 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !433, file: !385, line: 384, type: !4)
!433 = distinct !DILexicalBlock(scope: !434, file: !385, line: 384, column: 12)
!434 = distinct !DILexicalBlock(scope: !435, file: !385, line: 383, column: 48)
!435 = distinct !DILexicalBlock(scope: !427, file: !385, line: 383, column: 9)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !437, file: !385, line: 384, type: !4)
!437 = distinct !DILexicalBlock(scope: !438, file: !385, line: 384, column: 105)
!438 = distinct !DILexicalBlock(scope: !439, file: !385, line: 384, column: 80)
!439 = distinct !DILexicalBlock(scope: !433, file: !385, line: 384, column: 57)
!440 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !441, file: !385, line: 389, type: !4)
!441 = distinct !DILexicalBlock(scope: !442, file: !385, line: 389, column: 12)
!442 = distinct !DILexicalBlock(scope: !443, file: !385, line: 388, column: 49)
!443 = distinct !DILexicalBlock(scope: !427, file: !385, line: 388, column: 9)
!444 = !DISubprogram(name: "iobase_closed", scope: !385, file: !385, line: 146, type: !144, isLocal: true, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @iobase_closed, variables: !445)
!445 = !{!446, !447, !448, !449}
!446 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !444, file: !385, line: 146, type: !4)
!447 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !444, file: !385, line: 148, type: !4)
!448 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "closed", scope: !444, file: !385, line: 149, type: !43)
!449 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !450, file: !385, line: 156, type: !4)
!450 = distinct !DILexicalBlock(scope: !444, file: !385, line: 156, column: 8)
!451 = !DISubprogram(name: "iobase_unsupported", scope: !385, file: !385, line: 70, type: !452, isLocal: true, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @iobase_unsupported, variables: !454)
!452 = !DISubroutineType(types: !453)
!453 = !{!4, !28}
!454 = !{!455, !456}
!455 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "message", arg: 1, scope: !451, file: !385, line: 70, type: !28)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "state", scope: !451, file: !385, line: 72, type: !457)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyIO_State", file: !459, line: 135, baseType: !460)
!459 = !DIFile(filename: "./Modules/_io/_iomodule.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!460 = !DICompositeType(tag: DW_TAG_structure_type, file: !459, line: 130, size: 192, align: 64, elements: !461)
!461 = !{!462, !463, !464}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !460, file: !459, line: 131, baseType: !43, size: 32, align: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "locale_module", scope: !460, file: !459, line: 132, baseType: !4, size: 64, align: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "unsupported_operation", scope: !460, file: !459, line: 134, baseType: !4, size: 64, align: 64, offset: 128)
!465 = !DISubprogram(name: "iobase_dealloc", scope: !385, file: !385, line: 284, type: !466, isLocal: true, isDefinition: true, scopeLine: 285, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.iobase*)* @iobase_dealloc, variables: !475)
!466 = !DISubroutineType(types: !467)
!467 = !{null, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "iobase", file: !385, line: 25, baseType: !470)
!470 = !DICompositeType(tag: DW_TAG_structure_type, file: !385, line: 20, size: 256, align: 64, elements: !471)
!471 = !{!472, !473, !474}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !470, file: !385, line: 21, baseType: !5, size: 128, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !470, file: !385, line: 23, baseType: !4, size: 64, align: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !470, file: !385, line: 24, baseType: !4, size: 64, align: 64, offset: 192)
!475 = !{!476, !477, !479, !481}
!476 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !465, file: !385, line: 284, type: !468)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !478, file: !385, line: 298, type: !350)
!478 = distinct !DILexicalBlock(scope: !465, file: !385, line: 298, column: 8)
!479 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !480, file: !385, line: 301, type: !4)
!480 = distinct !DILexicalBlock(scope: !465, file: !385, line: 301, column: 8)
!481 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !482, file: !385, line: 301, type: !4)
!482 = distinct !DILexicalBlock(scope: !483, file: !385, line: 301, column: 115)
!483 = distinct !DILexicalBlock(scope: !484, file: !385, line: 301, column: 83)
!484 = distinct !DILexicalBlock(scope: !480, file: !385, line: 301, column: 60)
!485 = !DISubprogram(name: "iobase_traverse", scope: !385, file: !385, line: 268, type: !486, isLocal: true, isDefinition: true, scopeLine: 269, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.iobase*, i32 (%struct._object*, i8*)*, i8*)* @iobase_traverse, variables: !488)
!486 = !DISubroutineType(types: !487)
!487 = !{!43, !468, !263, !89}
!488 = !{!489, !490, !491, !492}
!489 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !485, file: !385, line: 268, type: !468)
!490 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !485, file: !385, line: 268, type: !263)
!491 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !485, file: !385, line: 268, type: !89)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !493, file: !385, line: 270, type: !43)
!493 = distinct !DILexicalBlock(scope: !494, file: !385, line: 270, column: 26)
!494 = distinct !DILexicalBlock(scope: !495, file: !385, line: 270, column: 14)
!495 = distinct !DILexicalBlock(scope: !485, file: !385, line: 270, column: 8)
!496 = !DISubprogram(name: "iobase_clear", scope: !385, file: !385, line: 275, type: !497, isLocal: true, isDefinition: true, scopeLine: 276, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.iobase*)* @iobase_clear, variables: !499)
!497 = !DISubroutineType(types: !498)
!498 = !{!43, !468}
!499 = !{!500, !501, !503}
!500 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !496, file: !385, line: 275, type: !468)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !502, file: !385, line: 277, type: !4)
!502 = distinct !DILexicalBlock(scope: !496, file: !385, line: 277, column: 8)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !504, file: !385, line: 277, type: !4)
!504 = distinct !DILexicalBlock(scope: !505, file: !385, line: 277, column: 115)
!505 = distinct !DILexicalBlock(scope: !506, file: !385, line: 277, column: 83)
!506 = distinct !DILexicalBlock(scope: !502, file: !385, line: 277, column: 60)
!507 = !DISubprogram(name: "iobase_iter", scope: !385, file: !385, line: 563, type: !116, isLocal: true, isDefinition: true, scopeLine: 564, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @iobase_iter, variables: !508)
!508 = !{!509}
!509 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !507, file: !385, line: 563, type: !4)
!510 = !DISubprogram(name: "iobase_iternext", scope: !385, file: !385, line: 573, type: !116, isLocal: true, isDefinition: true, scopeLine: 574, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @iobase_iternext, variables: !511)
!511 = !{!512, !513, !514}
!512 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !510, file: !385, line: 573, type: !4)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !510, file: !385, line: 575, type: !4)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !515, file: !385, line: 581, type: !4)
!515 = distinct !DILexicalBlock(scope: !516, file: !385, line: 581, column: 12)
!516 = distinct !DILexicalBlock(scope: !517, file: !385, line: 580, column: 35)
!517 = distinct !DILexicalBlock(scope: !510, file: !385, line: 580, column: 9)
!518 = !DISubprogram(name: "iobase_seek", scope: !385, file: !385, line: 94, type: !126, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @iobase_seek, variables: !519)
!519 = !{!520, !521}
!520 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !518, file: !385, line: 94, type: !4)
!521 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !518, file: !385, line: 94, type: !4)
!522 = !DISubprogram(name: "iobase_tell", scope: !385, file: !385, line: 103, type: !126, isLocal: true, isDefinition: true, scopeLine: 104, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @iobase_tell, variables: !523)
!523 = !{!524, !525}
!524 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !522, file: !385, line: 103, type: !4)
!525 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !522, file: !385, line: 103, type: !4)
!526 = !DISubprogram(name: "iobase_truncate", scope: !385, file: !385, line: 117, type: !126, isLocal: true, isDefinition: true, scopeLine: 118, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @iobase_truncate, variables: !527)
!527 = !{!528, !529}
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !526, file: !385, line: 117, type: !4)
!529 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !526, file: !385, line: 117, type: !4)
!530 = !DISubprogram(name: "iobase_flush", scope: !385, file: !385, line: 130, type: !126, isLocal: true, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @iobase_flush, variables: !531)
!531 = !{!532, !533}
!532 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !530, file: !385, line: 130, type: !4)
!533 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !530, file: !385, line: 130, type: !4)
!534 = !DISubprogram(name: "iobase_close", scope: !385, file: !385, line: 184, type: !126, isLocal: true, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @iobase_close, variables: !535)
!535 = !{!536, !537, !538, !539, !543, !546}
!536 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !534, file: !385, line: 184, type: !4)
!537 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !534, file: !385, line: 184, type: !4)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !534, file: !385, line: 186, type: !4)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !540, file: !385, line: 194, type: !4)
!540 = distinct !DILexicalBlock(scope: !541, file: !385, line: 194, column: 12)
!541 = distinct !DILexicalBlock(scope: !542, file: !385, line: 193, column: 95)
!542 = distinct !DILexicalBlock(scope: !534, file: !385, line: 193, column: 9)
!543 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !544, file: !385, line: 194, type: !4)
!544 = distinct !DILexicalBlock(scope: !545, file: !385, line: 194, column: 99)
!545 = distinct !DILexicalBlock(scope: !540, file: !385, line: 194, column: 65)
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !547, file: !385, line: 201, type: !4)
!547 = distinct !DILexicalBlock(scope: !534, file: !385, line: 201, column: 8)
!548 = !DISubprogram(name: "iobase_seekable", scope: !385, file: !385, line: 314, type: !126, isLocal: true, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @iobase_seekable, variables: !549)
!549 = !{!550, !551}
!550 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !548, file: !385, line: 314, type: !4)
!551 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !548, file: !385, line: 314, type: !4)
!552 = !DISubprogram(name: "iobase_readable", scope: !385, file: !385, line: 342, type: !126, isLocal: true, isDefinition: true, scopeLine: 343, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @iobase_readable, variables: !553)
!553 = !{!554, !555}
!554 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !552, file: !385, line: 342, type: !4)
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !552, file: !385, line: 342, type: !4)
!556 = !DISubprogram(name: "iobase_writable", scope: !385, file: !385, line: 371, type: !126, isLocal: true, isDefinition: true, scopeLine: 372, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @iobase_writable, variables: !557)
!557 = !{!558, !559}
!558 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !556, file: !385, line: 371, type: !4)
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !556, file: !385, line: 371, type: !4)
!560 = !DISubprogram(name: "iobase_fileno", scope: !385, file: !385, line: 422, type: !126, isLocal: true, isDefinition: true, scopeLine: 423, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @iobase_fileno, variables: !561)
!561 = !{!562, !563}
!562 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !560, file: !385, line: 422, type: !4)
!563 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !560, file: !385, line: 422, type: !4)
!564 = !DISubprogram(name: "iobase_isatty", scope: !385, file: !385, line: 433, type: !126, isLocal: true, isDefinition: true, scopeLine: 434, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @iobase_isatty, variables: !565)
!565 = !{!566, !567}
!566 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !564, file: !385, line: 433, type: !4)
!567 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !564, file: !385, line: 433, type: !4)
!568 = !DISubprogram(name: "iobase_enter", scope: !385, file: !385, line: 397, type: !126, isLocal: true, isDefinition: true, scopeLine: 398, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @iobase_enter, variables: !569)
!569 = !{!570, !571}
!570 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !568, file: !385, line: 397, type: !4)
!571 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !568, file: !385, line: 397, type: !4)
!572 = !DISubprogram(name: "iobase_exit", scope: !385, file: !385, line: 407, type: !126, isLocal: true, isDefinition: true, scopeLine: 408, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @iobase_exit, variables: !573)
!573 = !{!574, !575}
!574 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !572, file: !385, line: 407, type: !4)
!575 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !572, file: !385, line: 407, type: !4)
!576 = !DISubprogram(name: "iobase_readline", scope: !385, file: !385, line: 452, type: !126, isLocal: true, isDefinition: true, scopeLine: 453, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @iobase_readline, variables: !577)
!577 = !{!578, !579, !580, !581, !582, !583, !584, !585, !587, !588, !591, !595, !598, !599, !601, !605, !609, !613, !615, !617}
!578 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !576, file: !385, line: 452, type: !4)
!579 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !576, file: !385, line: 452, type: !4)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "limit", scope: !576, file: !385, line: 456, type: !10)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "has_peek", scope: !576, file: !385, line: 457, type: !43)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !576, file: !385, line: 458, type: !4)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !576, file: !385, line: 458, type: !4)
!584 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_size", scope: !576, file: !385, line: 459, type: !10)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nreadahead", scope: !586, file: !385, line: 474, type: !10)
!586 = distinct !DILexicalBlock(scope: !576, file: !385, line: 473, column: 70)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !586, file: !385, line: 475, type: !4)
!588 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "readahead", scope: !589, file: !385, line: 478, type: !4)
!589 = distinct !DILexicalBlock(scope: !590, file: !385, line: 477, column: 23)
!590 = distinct !DILexicalBlock(scope: !586, file: !385, line: 477, column: 13)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !592, file: !385, line: 491, type: !4)
!592 = distinct !DILexicalBlock(scope: !593, file: !385, line: 491, column: 20)
!593 = distinct !DILexicalBlock(scope: !594, file: !385, line: 487, column: 92)
!594 = distinct !DILexicalBlock(scope: !589, file: !385, line: 487, column: 17)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !596, file: !385, line: 495, type: !10)
!596 = distinct !DILexicalBlock(scope: !597, file: !385, line: 494, column: 76)
!597 = distinct !DILexicalBlock(scope: !589, file: !385, line: 494, column: 17)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !596, file: !385, line: 496, type: !28)
!599 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !600, file: !385, line: 515, type: !4)
!600 = distinct !DILexicalBlock(scope: !589, file: !385, line: 515, column: 16)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !602, file: !385, line: 531, type: !4)
!602 = distinct !DILexicalBlock(scope: !603, file: !385, line: 531, column: 16)
!603 = distinct !DILexicalBlock(scope: !604, file: !385, line: 527, column: 80)
!604 = distinct !DILexicalBlock(scope: !586, file: !385, line: 527, column: 13)
!605 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !606, file: !385, line: 535, type: !4)
!606 = distinct !DILexicalBlock(scope: !607, file: !385, line: 535, column: 16)
!607 = distinct !DILexicalBlock(scope: !608, file: !385, line: 534, column: 65)
!608 = distinct !DILexicalBlock(scope: !586, file: !385, line: 534, column: 13)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !610, file: !385, line: 541, type: !4)
!610 = distinct !DILexicalBlock(scope: !611, file: !385, line: 541, column: 16)
!611 = distinct !DILexicalBlock(scope: !612, file: !385, line: 540, column: 103)
!612 = distinct !DILexicalBlock(scope: !586, file: !385, line: 540, column: 13)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !614, file: !385, line: 547, type: !4)
!614 = distinct !DILexicalBlock(scope: !586, file: !385, line: 547, column: 12)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !616, file: !385, line: 555, type: !4)
!616 = distinct !DILexicalBlock(scope: !576, file: !385, line: 555, column: 8)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !618, file: !385, line: 558, type: !4)
!618 = distinct !DILexicalBlock(scope: !576, file: !385, line: 558, column: 8)
!619 = !DISubprogram(name: "iobase_readlines", scope: !385, file: !385, line: 596, type: !126, isLocal: true, isDefinition: true, scopeLine: 597, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @iobase_readlines, variables: !620)
!620 = !{!621, !622, !623, !624, !625, !626, !629, !633, !635, !637, !643, !647, !649}
!621 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !619, file: !385, line: 596, type: !4)
!622 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !619, file: !385, line: 596, type: !4)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hint", scope: !619, file: !385, line: 598, type: !10)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "length", scope: !619, file: !385, line: 598, type: !10)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !619, file: !385, line: 599, type: !4)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !627, file: !385, line: 614, type: !4)
!627 = distinct !DILexicalBlock(scope: !628, file: !385, line: 609, column: 20)
!628 = distinct !DILexicalBlock(scope: !619, file: !385, line: 609, column: 9)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !630, file: !385, line: 617, type: !4)
!630 = distinct !DILexicalBlock(scope: !631, file: !385, line: 617, column: 16)
!631 = distinct !DILexicalBlock(scope: !632, file: !385, line: 616, column: 32)
!632 = distinct !DILexicalBlock(scope: !627, file: !385, line: 616, column: 13)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !634, file: !385, line: 620, type: !4)
!634 = distinct !DILexicalBlock(scope: !627, file: !385, line: 620, column: 12)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !636, file: !385, line: 625, type: !4)
!636 = distinct !DILexicalBlock(scope: !619, file: !385, line: 624, column: 15)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !638, file: !385, line: 628, type: !4)
!638 = distinct !DILexicalBlock(scope: !639, file: !385, line: 628, column: 20)
!639 = distinct !DILexicalBlock(scope: !640, file: !385, line: 627, column: 35)
!640 = distinct !DILexicalBlock(scope: !641, file: !385, line: 627, column: 17)
!641 = distinct !DILexicalBlock(scope: !642, file: !385, line: 626, column: 33)
!642 = distinct !DILexicalBlock(scope: !636, file: !385, line: 626, column: 13)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !644, file: !385, line: 636, type: !4)
!644 = distinct !DILexicalBlock(scope: !645, file: !385, line: 636, column: 16)
!645 = distinct !DILexicalBlock(scope: !646, file: !385, line: 635, column: 46)
!646 = distinct !DILexicalBlock(scope: !636, file: !385, line: 635, column: 13)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !648, file: !385, line: 637, type: !4)
!648 = distinct !DILexicalBlock(scope: !645, file: !385, line: 637, column: 16)
!649 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !650, file: !385, line: 641, type: !4)
!650 = distinct !DILexicalBlock(scope: !636, file: !385, line: 641, column: 12)
!651 = !DISubprogram(name: "iobase_writelines", scope: !385, file: !385, line: 650, type: !126, isLocal: true, isDefinition: true, scopeLine: 651, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @iobase_writelines, variables: !652)
!652 = !{!653, !654, !655, !656, !657, !658, !660, !666, !668, !672, !674}
!653 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !651, file: !385, line: 650, type: !4)
!654 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !651, file: !385, line: 650, type: !4)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lines", scope: !651, file: !385, line: 652, type: !4)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iter", scope: !651, file: !385, line: 652, type: !4)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !651, file: !385, line: 652, type: !4)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "line", scope: !659, file: !385, line: 666, type: !4)
!659 = distinct !DILexicalBlock(scope: !651, file: !385, line: 665, column: 15)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !661, file: !385, line: 669, type: !4)
!661 = distinct !DILexicalBlock(scope: !662, file: !385, line: 669, column: 20)
!662 = distinct !DILexicalBlock(scope: !663, file: !385, line: 668, column: 35)
!663 = distinct !DILexicalBlock(scope: !664, file: !385, line: 668, column: 17)
!664 = distinct !DILexicalBlock(scope: !665, file: !385, line: 667, column: 33)
!665 = distinct !DILexicalBlock(scope: !659, file: !385, line: 667, column: 13)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !667, file: !385, line: 680, type: !4)
!667 = distinct !DILexicalBlock(scope: !659, file: !385, line: 680, column: 12)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !669, file: !385, line: 682, type: !4)
!669 = distinct !DILexicalBlock(scope: !670, file: !385, line: 682, column: 16)
!670 = distinct !DILexicalBlock(scope: !671, file: !385, line: 681, column: 32)
!671 = distinct !DILexicalBlock(scope: !659, file: !385, line: 681, column: 13)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !673, file: !385, line: 685, type: !4)
!673 = distinct !DILexicalBlock(scope: !659, file: !385, line: 685, column: 12)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !675, file: !385, line: 687, type: !4)
!675 = distinct !DILexicalBlock(scope: !651, file: !385, line: 687, column: 8)
!676 = !DISubprogram(name: "iobase_closed_get", scope: !385, file: !385, line: 161, type: !307, isLocal: true, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i8*)* @iobase_closed_get, variables: !677)
!677 = !{!678, !679}
!678 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !676, file: !385, line: 161, type: !4)
!679 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "context", arg: 2, scope: !676, file: !385, line: 161, type: !89)
!680 = !DISubprogram(name: "iobase_finalize", scope: !385, file: !385, line: 208, type: !36, isLocal: true, isDefinition: true, scopeLine: 209, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*)* @iobase_finalize, variables: !681)
!681 = !{!682, !683, !684, !685, !686, !687, !688, !692}
!682 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !680, file: !385, line: 208, type: !4)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !680, file: !385, line: 210, type: !4)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error_type", scope: !680, file: !385, line: 211, type: !4)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error_value", scope: !680, file: !385, line: 211, type: !4)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error_traceback", scope: !680, file: !385, line: 211, type: !4)
!687 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "closed", scope: !680, file: !385, line: 212, type: !43)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !689, file: !385, line: 227, type: !4)
!689 = distinct !DILexicalBlock(scope: !690, file: !385, line: 227, column: 12)
!690 = distinct !DILexicalBlock(scope: !691, file: !385, line: 225, column: 10)
!691 = distinct !DILexicalBlock(scope: !680, file: !385, line: 221, column: 9)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !693, file: !385, line: 244, type: !4)
!693 = distinct !DILexicalBlock(scope: !694, file: !385, line: 244, column: 16)
!694 = distinct !DILexicalBlock(scope: !695, file: !385, line: 241, column: 13)
!695 = distinct !DILexicalBlock(scope: !696, file: !385, line: 231, column: 22)
!696 = distinct !DILexicalBlock(scope: !680, file: !385, line: 231, column: 9)
!697 = !DISubprogram(name: "rawiobase_read", scope: !385, file: !385, line: 799, type: !126, isLocal: true, isDefinition: true, scopeLine: 800, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @rawiobase_read, variables: !698)
!698 = !{!699, !700, !701, !702, !703, !704, !708, !710, !714}
!699 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !697, file: !385, line: 799, type: !4)
!700 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !697, file: !385, line: 799, type: !4)
!701 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !697, file: !385, line: 801, type: !10)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !697, file: !385, line: 802, type: !4)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !697, file: !385, line: 802, type: !4)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !705, file: !385, line: 822, type: !4)
!705 = distinct !DILexicalBlock(scope: !706, file: !385, line: 822, column: 12)
!706 = distinct !DILexicalBlock(scope: !707, file: !385, line: 821, column: 56)
!707 = distinct !DILexicalBlock(scope: !697, file: !385, line: 821, column: 9)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !709, file: !385, line: 827, type: !4)
!709 = distinct !DILexicalBlock(scope: !697, file: !385, line: 827, column: 8)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !711, file: !385, line: 829, type: !4)
!711 = distinct !DILexicalBlock(scope: !712, file: !385, line: 829, column: 12)
!712 = distinct !DILexicalBlock(scope: !713, file: !385, line: 828, column: 38)
!713 = distinct !DILexicalBlock(scope: !697, file: !385, line: 828, column: 9)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !715, file: !385, line: 834, type: !4)
!715 = distinct !DILexicalBlock(scope: !697, file: !385, line: 834, column: 8)
!716 = !DISubprogram(name: "rawiobase_readall", scope: !385, file: !385, line: 843, type: !126, isLocal: true, isDefinition: true, scopeLine: 844, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @rawiobase_readall, variables: !717)
!717 = !{!718, !719, !720, !721, !722, !723, !725, !729, !735, !737, !741, !743, !747, !749, !753}
!718 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !716, file: !385, line: 843, type: !4)
!719 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !716, file: !385, line: 843, type: !4)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !716, file: !385, line: 845, type: !43)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chunks", scope: !716, file: !385, line: 846, type: !4)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !716, file: !385, line: 847, type: !4)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "data", scope: !724, file: !385, line: 853, type: !4)
!724 = distinct !DILexicalBlock(scope: !716, file: !385, line: 852, column: 15)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !726, file: !385, line: 861, type: !4)
!726 = distinct !DILexicalBlock(scope: !727, file: !385, line: 861, column: 16)
!727 = distinct !DILexicalBlock(scope: !728, file: !385, line: 855, column: 20)
!728 = distinct !DILexicalBlock(scope: !724, file: !385, line: 855, column: 13)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !730, file: !385, line: 866, type: !4)
!730 = distinct !DILexicalBlock(scope: !731, file: !385, line: 866, column: 20)
!731 = distinct !DILexicalBlock(scope: !732, file: !385, line: 865, column: 59)
!732 = distinct !DILexicalBlock(scope: !733, file: !385, line: 865, column: 17)
!733 = distinct !DILexicalBlock(scope: !734, file: !385, line: 864, column: 40)
!734 = distinct !DILexicalBlock(scope: !724, file: !385, line: 864, column: 13)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !736, file: !385, line: 869, type: !4)
!736 = distinct !DILexicalBlock(scope: !733, file: !385, line: 869, column: 16)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !738, file: !385, line: 873, type: !4)
!738 = distinct !DILexicalBlock(scope: !739, file: !385, line: 873, column: 16)
!739 = distinct !DILexicalBlock(scope: !740, file: !385, line: 872, column: 83)
!740 = distinct !DILexicalBlock(scope: !724, file: !385, line: 872, column: 13)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !742, file: !385, line: 874, type: !4)
!742 = distinct !DILexicalBlock(scope: !739, file: !385, line: 874, column: 16)
!743 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !744, file: !385, line: 880, type: !4)
!744 = distinct !DILexicalBlock(scope: !745, file: !385, line: 880, column: 16)
!745 = distinct !DILexicalBlock(scope: !746, file: !385, line: 878, column: 68)
!746 = distinct !DILexicalBlock(scope: !724, file: !385, line: 878, column: 13)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !748, file: !385, line: 884, type: !4)
!748 = distinct !DILexicalBlock(scope: !724, file: !385, line: 884, column: 12)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !750, file: !385, line: 886, type: !4)
!750 = distinct !DILexicalBlock(scope: !751, file: !385, line: 886, column: 16)
!751 = distinct !DILexicalBlock(scope: !752, file: !385, line: 885, column: 20)
!752 = distinct !DILexicalBlock(scope: !724, file: !385, line: 885, column: 13)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !754, file: !385, line: 891, type: !4)
!754 = distinct !DILexicalBlock(scope: !716, file: !385, line: 891, column: 8)
!755 = !{!756, !758, !759, !763, !766, !770, !778, !782, !786, !787, !791, !795, !799, !803, !807, !811, !812, !813, !814, !818, !819, !823, !828, !829, !833, !835, !836}
!756 = !DIGlobalVariable(name: "PyIOBase_Type", scope: !0, file: !385, line: 727, type: !757, isLocal: false, isDefinition: true, variable: { %struct.PyVarObject, i8*, i64, i64, void (%struct._object*)*, i32 (%struct._object*, %struct._IO_FILE*, i32)*, %struct._object* (%struct._object*, i8*)*, i32 (%struct._object*, i8*, %struct._object*)*, i8*, %struct._object* (%struct._object*)*, %struct.PyNumberMethods*, %struct.PySequenceMethods*, %struct.PyMappingMethods*, i64 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*)*, i32 (%struct._object*, %struct._object*, %struct._object*)*, %struct.PyBufferProcs*, i64, i8*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, i32)*, i64, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*)*, %struct.PyMethodDef*, %struct.PyMemberDef*, %struct.PyGetSetDef*, %struct._typeobject*, %struct._object*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, i32 (%struct._object*, %struct._object*, %struct._object*)*, i64, i32 (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._typeobject*, i64)*, %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)*, void (i8*)*, i32 (%struct._object*)*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, void (%struct._object*)*, i32, void (%struct._object*)* }* @PyIOBase_Type)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !6, line: 422, baseType: !19)
!758 = !DIGlobalVariable(name: "PyRawIOBase_Type", scope: !0, file: !385, line: 901, type: !757, isLocal: false, isDefinition: true, variable: { %struct.PyVarObject, i8*, i64, i64, void (%struct._object*)*, i32 (%struct._object*, %struct._IO_FILE*, i32)*, %struct._object* (%struct._object*, i8*)*, i32 (%struct._object*, i8*, %struct._object*)*, i8*, %struct._object* (%struct._object*)*, %struct.PyNumberMethods*, %struct.PySequenceMethods*, %struct.PyMappingMethods*, i64 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*)*, i32 (%struct._object*, %struct._object*, %struct._object*)*, %struct.PyBufferProcs*, i64, i8*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, %struct._object* (%struct._object*, %struct._object*, i32)*, i64, %struct._object* (%struct._object*)*, %struct._object* (%struct._object*)*, %struct.PyMethodDef*, %struct.PyMemberDef*, %struct.PyGetSetDef*, %struct._typeobject*, %struct._object*, %struct._object* (%struct._object*, %struct._object*, %struct._object*)*, i32 (%struct._object*, %struct._object*, %struct._object*)*, i64, i32 (%struct._object*, %struct._object*, %struct._object*)*, %struct._object* (%struct._typeobject*, i64)*, %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)*, void (i8*)*, i32 (%struct._object*)*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, %struct._object*, void (%struct._object*)*, i32, void (%struct._object*)* }* @PyRawIOBase_Type)
!759 = !DIGlobalVariable(name: "iobase_doc", scope: !0, file: !385, line: 27, type: !760, isLocal: true, isDefinition: true, variable: [1242 x i8]* @iobase_doc)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 9936, align: 8, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 1242)
!763 = !DIGlobalVariable(name: "iobase_methods", scope: !0, file: !385, line: 691, type: !764, isLocal: true, isDefinition: true, variable: <{ { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }, { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }, { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }, { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }, { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }, { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }, { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }, { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }, { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }, { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }, { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }, { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }, { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }, { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }, { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }, { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }, { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }, { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }, { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* }, { i8*, %struct._object* (%struct._object*, %struct._object*)*, i32, i8* } }>* @iobase_methods)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !765, size: 5120, align: 64, elements: !100)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMethodDef", file: !281, line: 47, baseType: !280)
!766 = !DIGlobalVariable(name: "iobase_seek_doc", scope: !0, file: !385, line: 80, type: !767, isLocal: true, isDefinition: true, variable: [386 x i8]* @iobase_seek_doc)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 3088, align: 8, elements: !768)
!768 = !{!769}
!769 = !DISubrange(count: 386)
!770 = !DIGlobalVariable(name: "PyId_seek", scope: !522, file: !385, line: 105, type: !771, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @iobase_tell.PyId_seek)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Py_Identifier", file: !6, line: 144, baseType: !772)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Py_Identifier", file: !6, line: 140, size: 192, align: 64, elements: !773)
!773 = !{!774, !776, !777}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !772, file: !6, line: 141, baseType: !775, size: 64, align: 64)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !772, file: !6, line: 142, baseType: !28, size: 64, align: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !772, file: !6, line: 143, baseType: !4, size: 64, align: 64, offset: 128)
!778 = !DIGlobalVariable(name: "iobase_tell_doc", scope: !0, file: !385, line: 99, type: !779, isLocal: true, isDefinition: true, variable: [32 x i8]* @iobase_tell_doc)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 256, align: 8, elements: !780)
!780 = !{!781}
!781 = !DISubrange(count: 32)
!782 = !DIGlobalVariable(name: "iobase_truncate_doc", scope: !0, file: !385, line: 110, type: !783, isLocal: true, isDefinition: true, variable: [150 x i8]* @iobase_truncate_doc)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 1200, align: 8, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 150)
!786 = !DIGlobalVariable(name: "PyId___IOBase_closed", scope: !0, file: !385, line: 62, type: !771, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @PyId___IOBase_closed)
!787 = !DIGlobalVariable(name: "iobase_flush_doc", scope: !0, file: !385, line: 124, type: !788, isLocal: true, isDefinition: true, variable: [102 x i8]* @iobase_flush_doc)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 816, align: 8, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 102)
!791 = !DIGlobalVariable(name: "iobase_close_doc", scope: !0, file: !385, line: 140, type: !792, isLocal: true, isDefinition: true, variable: [90 x i8]* @iobase_close_doc)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 720, align: 8, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 90)
!795 = !DIGlobalVariable(name: "iobase_seekable_doc", scope: !0, file: !385, line: 307, type: !796, isLocal: true, isDefinition: true, variable: [162 x i8]* @iobase_seekable_doc)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 1296, align: 8, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 162)
!799 = !DIGlobalVariable(name: "iobase_readable_doc", scope: !0, file: !385, line: 336, type: !800, isLocal: true, isDefinition: true, variable: [97 x i8]* @iobase_readable_doc)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 776, align: 8, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 97)
!803 = !DIGlobalVariable(name: "iobase_writable_doc", scope: !0, file: !385, line: 365, type: !804, isLocal: true, isDefinition: true, variable: [98 x i8]* @iobase_writable_doc)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 784, align: 8, elements: !805)
!805 = !{!806}
!806 = !DISubrange(count: 98)
!807 = !DIGlobalVariable(name: "iobase_fileno_doc", scope: !0, file: !385, line: 416, type: !808, isLocal: true, isDefinition: true, variable: [122 x i8]* @iobase_fileno_doc)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 976, align: 8, elements: !809)
!809 = !{!810}
!810 = !DISubrange(count: 122)
!811 = !DIGlobalVariable(name: "iobase_isatty_doc", scope: !0, file: !385, line: 427, type: !792, isLocal: true, isDefinition: true, variable: [90 x i8]* @iobase_isatty_doc)
!812 = !DIGlobalVariable(name: "PyId_peek", scope: !576, file: !385, line: 460, type: !771, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @iobase_readline.PyId_peek)
!813 = !DIGlobalVariable(name: "PyId_read", scope: !0, file: !385, line: 66, type: !771, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @PyId_read)
!814 = !DIGlobalVariable(name: "iobase_readline_doc", scope: !0, file: !385, line: 442, type: !815, isLocal: true, isDefinition: true, variable: [257 x i8]* @iobase_readline_doc)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 2056, align: 8, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 257)
!818 = !DIGlobalVariable(name: "PyId_extend", scope: !619, file: !385, line: 613, type: !771, isLocal: true, isDefinition: true, variable: %struct._Py_Identifier* @iobase_readlines.PyId_extend)
