; ModuleID = 'programs_new/Python-new/itertoolsmodule.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !541, globals: !2467)
!1 = !DIFile(filename: "itertoolsmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !89, !350, !359, !360, !368, !378, !388, !396, !404, !94, !412, !422, !429, !436, !443, !10, !450, !458, !468, !479, !488, !495, !502, !512, !524, !532, !43}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !6, line: 109, baseType: !7)
!6 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !6, line: 105, size: 128, align: 64, elements: !8)
!8 = !{!9, !17}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !7, file: !6, line: 107, baseType: !10, size: 64, align: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !11, line: 177, baseType: !12)
!11 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !13, line: 102, baseType: !14)
!13 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !15, line: 181, baseType: !16)
!15 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!16 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !7, file: !6, line: 108, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !6, line: 334, size: 3200, align: 64, elements: !20)
!20 = !{!21, !27, !31, !32, !33, !38, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !19, file: !6, line: 335, baseType: !22, size: 192, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !6, line: 114, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 111, size: 192, align: 64, elements: !24)
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !23, file: !6, line: 112, baseType: !5, size: 128, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !23, file: !6, line: 113, baseType: !10, size: 64, align: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !19, file: !6, line: 336, baseType: !28, size: 64, align: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !19, file: !6, line: 337, baseType: !10, size: 64, align: 64, offset: 256)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !19, file: !6, line: 337, baseType: !10, size: 64, align: 64, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !19, file: !6, line: 341, baseType: !34, size: 64, align: 64, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !6, line: 308, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !4}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !19, file: !6, line: 342, baseType: !39, size: 64, align: 64, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !6, line: 314, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !4, !44, !43}
!43 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !13, line: 48, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 246, size: 1728, align: 64, elements: !48)
!47 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!48 = !{!49, !50, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !70, !71, !72, !73, !75, !77, !79, !83, !86, !88, !90, !91, !92, !93, !97, !98}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !46, file: !47, line: 247, baseType: !43, size: 32, align: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !46, file: !47, line: 252, baseType: !51, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !46, file: !47, line: 253, baseType: !51, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !46, file: !47, line: 254, baseType: !51, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !46, file: !47, line: 255, baseType: !51, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !46, file: !47, line: 256, baseType: !51, size: 64, align: 64, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !46, file: !47, line: 257, baseType: !51, size: 64, align: 64, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !46, file: !47, line: 258, baseType: !51, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !46, file: !47, line: 259, baseType: !51, size: 64, align: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !46, file: !47, line: 261, baseType: !51, size: 64, align: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !46, file: !47, line: 262, baseType: !51, size: 64, align: 64, offset: 640)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !46, file: !47, line: 263, baseType: !51, size: 64, align: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !46, file: !47, line: 265, baseType: !63, size: 64, align: 64, offset: 768)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !47, line: 161, size: 192, align: 64, elements: !65)
!65 = !{!66, !67, !69}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !64, file: !47, line: 162, baseType: !63, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !64, file: !47, line: 163, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !64, file: !47, line: 167, baseType: !43, size: 32, align: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !46, file: !47, line: 267, baseType: !68, size: 64, align: 64, offset: 832)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !46, file: !47, line: 269, baseType: !43, size: 32, align: 32, offset: 896)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !46, file: !47, line: 273, baseType: !43, size: 32, align: 32, offset: 928)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !46, file: !47, line: 275, baseType: !74, size: 64, align: 64, offset: 960)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !15, line: 140, baseType: !16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !46, file: !47, line: 279, baseType: !76, size: 16, align: 16, offset: 1024)
!76 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !46, file: !47, line: 280, baseType: !78, size: 8, align: 8, offset: 1040)
!78 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !46, file: !47, line: 281, baseType: !80, size: 8, align: 8, offset: 1048)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 8, align: 8, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 1)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !46, file: !47, line: 285, baseType: !84, size: 64, align: 64, offset: 1088)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !47, line: 155, baseType: null)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !46, file: !47, line: 294, baseType: !87, size: 64, align: 64, offset: 1152)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !15, line: 141, baseType: !16)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !46, file: !47, line: 303, baseType: !89, size: 64, align: 64, offset: 1216)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !46, file: !47, line: 304, baseType: !89, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !46, file: !47, line: 305, baseType: !89, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !46, file: !47, line: 306, baseType: !89, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !46, file: !47, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !46, file: !47, line: 309, baseType: !43, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !46, file: !47, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !19, file: !6, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !6, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!4, !4, !51}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !19, file: !6, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !6, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!43, !4, !51, !4}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !19, file: !6, line: 345, baseType: !89, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !19, file: !6, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !6, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!4, !4}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !19, file: !6, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !6, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !6, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !6, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!4, !4, !4}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !6, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !6, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !6, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !6, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !6, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !6, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!4, !4, !4, !4}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !6, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !6, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !6, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !6, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !6, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !6, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!43, !4}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !6, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !6, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !6, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !6, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !6, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !6, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !6, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !6, line: 258, baseType: !89, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !6, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !6, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !6, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !6, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !6, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !6, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !6, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !6, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !6, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !6, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !6, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !6, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !6, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !6, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !6, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !6, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !19, file: !6, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !6, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !6, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !6, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!10, !4}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !6, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !6, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !6, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!4, !4, !10}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !6, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !6, line: 285, baseType: !89, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !6, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !6, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!43, !4, !10, !4}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !6, line: 287, baseType: !89, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !6, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !6, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!43, !4, !4}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !6, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !6, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !19, file: !6, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !6, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !6, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !6, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !6, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !6, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!43, !4, !4, !4}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !19, file: !6, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !6, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !4}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !11, line: 186, baseType: !10)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !19, file: !6, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !19, file: !6, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !19, file: !6, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !6, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !19, file: !6, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !6, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !19, file: !6, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !6, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !6, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !6, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!43, !4, !235, !43}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !6, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !6, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !6, line: 179, baseType: !89, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !6, line: 180, baseType: !4, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !6, line: 181, baseType: !10, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !6, line: 182, baseType: !10, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !6, line: 184, baseType: !43, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !6, line: 185, baseType: !43, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !6, line: 186, baseType: !51, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !6, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !6, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !6, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !6, line: 190, baseType: !89, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !6, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !6, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !4, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !19, file: !6, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !19, file: !6, line: 368, baseType: !28, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !19, file: !6, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !6, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!43, !4, !263, !89}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !6, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!43, !4, !89}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !19, file: !6, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !19, file: !6, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !6, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!4, !4, !4, !43}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !19, file: !6, line: 382, baseType: !10, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !19, file: !6, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !6, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !19, file: !6, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !6, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !19, file: !6, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !28, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !43, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !28, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !19, file: !6, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !291, line: 18, size: 320, align: 64, elements: !292)
!291 = !DIFile(filename: "Include/structmember.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!292 = !{!293, !294, !295, !296, !297}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !291, line: 19, baseType: !51, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !290, file: !291, line: 20, baseType: !43, size: 32, align: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !290, file: !291, line: 21, baseType: !10, size: 64, align: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !290, file: !291, line: 22, baseType: !43, size: 32, align: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !290, file: !291, line: 23, baseType: !51, size: 64, align: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !19, file: !6, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !51, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!4, !4, !89}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!43, !4, !4, !89}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !51, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !89, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !19, file: !6, line: 392, baseType: !18, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !19, file: !6, line: 393, baseType: !4, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !19, file: !6, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !6, line: 325, baseType: !134)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !19, file: !6, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !6, line: 326, baseType: !210)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !19, file: !6, line: 396, baseType: !10, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !19, file: !6, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !6, line: 327, baseType: !210)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !19, file: !6, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !6, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!4, !18, !10}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !19, file: !6, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !6, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!4, !18, !4, !4}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !19, file: !6, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !6, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !89}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !19, file: !6, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !19, file: !6, line: 402, baseType: !4, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !19, file: !6, line: 403, baseType: !4, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !19, file: !6, line: 404, baseType: !4, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !19, file: !6, line: 405, baseType: !4, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !19, file: !6, line: 406, baseType: !4, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !19, file: !6, line: 407, baseType: !34, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !19, file: !6, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !19, file: !6, line: 412, baseType: !34, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "accumulateobject", file: !352, line: 3368, baseType: !353)
!352 = !DIFile(filename: "./Modules/itertoolsmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!353 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 3363, size: 320, align: 64, elements: !354)
!354 = !{!355, !356, !357, !358}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !353, file: !352, line: 3364, baseType: !5, size: 128, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !353, file: !352, line: 3365, baseType: !4, size: 64, align: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !353, file: !352, line: 3366, baseType: !4, size: 64, align: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "binop", scope: !353, file: !352, line: 3367, baseType: !4, size: 64, align: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !362, line: 33, baseType: !363)
!362 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!363 = !DICompositeType(tag: DW_TAG_structure_type, file: !362, line: 25, size: 256, align: 64, elements: !364)
!364 = !{!365, !366}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !363, file: !362, line: 26, baseType: !22, size: 192, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !363, file: !362, line: 27, baseType: !367, size: 64, align: 64, offset: 192)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, align: 64, elements: !81)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "combinationsobject", file: !352, line: 2333, baseType: !370)
!370 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 2326, size: 448, align: 64, elements: !371)
!371 = !{!372, !373, !374, !375, !376, !377}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !370, file: !352, line: 2327, baseType: !5, size: 128, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !370, file: !352, line: 2328, baseType: !4, size: 64, align: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !370, file: !352, line: 2329, baseType: !247, size: 64, align: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !370, file: !352, line: 2330, baseType: !4, size: 64, align: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !370, file: !352, line: 2331, baseType: !10, size: 64, align: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !370, file: !352, line: 2332, baseType: !43, size: 32, align: 32, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "cwrobject", file: !352, line: 2674, baseType: !380)
!380 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 2667, size: 448, align: 64, elements: !381)
!381 = !{!382, !383, !384, !385, !386, !387}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !380, file: !352, line: 2668, baseType: !5, size: 128, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !380, file: !352, line: 2669, baseType: !4, size: 64, align: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !380, file: !352, line: 2670, baseType: !247, size: 64, align: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !380, file: !352, line: 2671, baseType: !4, size: 64, align: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !380, file: !352, line: 2672, baseType: !10, size: 64, align: 64, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !380, file: !352, line: 2673, baseType: !43, size: 32, align: 32, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "cycleobject", file: !352, line: 867, baseType: !390)
!390 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 862, size: 320, align: 64, elements: !391)
!391 = !{!392, !393, !394, !395}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !390, file: !352, line: 863, baseType: !5, size: 128, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !390, file: !352, line: 864, baseType: !4, size: 64, align: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !390, file: !352, line: 865, baseType: !4, size: 64, align: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "firstpass", scope: !390, file: !352, line: 866, baseType: !43, size: 32, align: 32, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "dropwhileobject", file: !352, line: 1051, baseType: !398)
!398 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 1046, size: 320, align: 64, elements: !399)
!399 = !{!400, !401, !402, !403}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !398, file: !352, line: 1047, baseType: !5, size: 128, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !398, file: !352, line: 1048, baseType: !4, size: 64, align: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !398, file: !352, line: 1049, baseType: !4, size: 64, align: 64, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !398, file: !352, line: 1050, baseType: !16, size: 64, align: 64, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "takewhileobject", file: !352, line: 1220, baseType: !406)
!406 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 1215, size: 320, align: 64, elements: !407)
!407 = !{!408, !409, !410, !411}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !406, file: !352, line: 1216, baseType: !5, size: 128, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !406, file: !352, line: 1217, baseType: !4, size: 64, align: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !406, file: !352, line: 1218, baseType: !4, size: 64, align: 64, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !406, file: !352, line: 1219, baseType: !16, size: 64, align: 64, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "isliceobject", file: !352, line: 1386, baseType: !414)
!414 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 1379, size: 448, align: 64, elements: !415)
!415 = !{!416, !417, !418, !419, !420, !421}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !414, file: !352, line: 1380, baseType: !5, size: 128, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !414, file: !352, line: 1381, baseType: !4, size: 64, align: 64, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !414, file: !352, line: 1382, baseType: !10, size: 64, align: 64, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !414, file: !352, line: 1383, baseType: !10, size: 64, align: 64, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !414, file: !352, line: 1384, baseType: !10, size: 64, align: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !414, file: !352, line: 1385, baseType: !10, size: 64, align: 64, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "starmapobject", file: !352, line: 1637, baseType: !424)
!424 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 1633, size: 256, align: 64, elements: !425)
!425 = !{!426, !427, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !424, file: !352, line: 1634, baseType: !5, size: 128, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !424, file: !352, line: 1635, baseType: !4, size: 64, align: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !424, file: !352, line: 1636, baseType: !4, size: 64, align: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "chainobject", file: !352, line: 1781, baseType: !431)
!431 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 1777, size: 256, align: 64, elements: !432)
!432 = !{!433, !434, !435}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !431, file: !352, line: 1778, baseType: !5, size: 128, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !431, file: !352, line: 1779, baseType: !4, size: 64, align: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !431, file: !352, line: 1780, baseType: !4, size: 64, align: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "compressobject", file: !352, line: 3544, baseType: !438)
!438 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 3540, size: 256, align: 64, elements: !439)
!439 = !{!440, !441, !442}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !438, file: !352, line: 3541, baseType: !5, size: 128, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !438, file: !352, line: 3542, baseType: !4, size: 64, align: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "selectors", scope: !438, file: !352, line: 3543, baseType: !4, size: 64, align: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "filterfalseobject", file: !352, line: 3704, baseType: !445)
!445 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 3700, size: 256, align: 64, elements: !446)
!446 = !{!447, !448, !449}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !445, file: !352, line: 3701, baseType: !5, size: 128, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !445, file: !352, line: 3702, baseType: !4, size: 64, align: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !445, file: !352, line: 3703, baseType: !4, size: 64, align: 64, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "countobject", file: !352, line: 3863, baseType: !452)
!452 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 3858, size: 320, align: 64, elements: !453)
!453 = !{!454, !455, !456, !457}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !452, file: !352, line: 3859, baseType: !5, size: 128, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !452, file: !352, line: 3860, baseType: !10, size: 64, align: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "long_cnt", scope: !452, file: !352, line: 3861, baseType: !4, size: 64, align: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "long_step", scope: !452, file: !352, line: 3862, baseType: !4, size: 64, align: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "ziplongestobject", file: !352, line: 4256, baseType: !460)
!460 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 4249, size: 448, align: 64, elements: !461)
!461 = !{!462, !463, !464, !465, !466, !467}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !460, file: !352, line: 4250, baseType: !5, size: 128, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "tuplesize", scope: !460, file: !352, line: 4251, baseType: !10, size: 64, align: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "numactive", scope: !460, file: !352, line: 4252, baseType: !10, size: 64, align: 64, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ittuple", scope: !460, file: !352, line: 4253, baseType: !4, size: 64, align: 64, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !460, file: !352, line: 4254, baseType: !4, size: 64, align: 64, offset: 320)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "fillvalue", scope: !460, file: !352, line: 4255, baseType: !4, size: 64, align: 64, offset: 384)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "permutationsobject", file: !352, line: 3002, baseType: !470)
!470 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 2994, size: 512, align: 64, elements: !471)
!471 = !{!472, !473, !474, !475, !476, !477, !478}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !470, file: !352, line: 2995, baseType: !5, size: 128, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !470, file: !352, line: 2996, baseType: !4, size: 64, align: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !470, file: !352, line: 2997, baseType: !247, size: 64, align: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "cycles", scope: !470, file: !352, line: 2998, baseType: !247, size: 64, align: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !470, file: !352, line: 2999, baseType: !4, size: 64, align: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !470, file: !352, line: 3000, baseType: !10, size: 64, align: 64, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !470, file: !352, line: 3001, baseType: !43, size: 32, align: 32, offset: 448)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "productobject", file: !352, line: 1990, baseType: !481)
!481 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 1984, size: 384, align: 64, elements: !482)
!482 = !{!483, !484, !485, !486, !487}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !481, file: !352, line: 1985, baseType: !5, size: 128, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !481, file: !352, line: 1986, baseType: !4, size: 64, align: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !481, file: !352, line: 1987, baseType: !247, size: 64, align: 64, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !481, file: !352, line: 1988, baseType: !4, size: 64, align: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "stopped", scope: !481, file: !352, line: 1989, baseType: !43, size: 32, align: 32, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "repeatobject", file: !352, line: 4103, baseType: !490)
!490 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 4099, size: 256, align: 64, elements: !491)
!491 = !{!492, !493, !494}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !490, file: !352, line: 4100, baseType: !5, size: 128, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !490, file: !352, line: 4101, baseType: !4, size: 64, align: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "cnt", scope: !490, file: !352, line: 4102, baseType: !10, size: 64, align: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "_grouperobject", file: !352, line: 239, baseType: !497)
!497 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 235, size: 256, align: 64, elements: !498)
!498 = !{!499, !500, !501}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !497, file: !352, line: 236, baseType: !5, size: 128, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !497, file: !352, line: 237, baseType: !4, size: 64, align: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "tgtkey", scope: !497, file: !352, line: 238, baseType: !4, size: 64, align: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64, align: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "groupbyobject", file: !352, line: 21, baseType: !504)
!504 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 14, size: 448, align: 64, elements: !505)
!505 = !{!506, !507, !508, !509, !510, !511}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !504, file: !352, line: 15, baseType: !5, size: 128, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !504, file: !352, line: 16, baseType: !4, size: 64, align: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "keyfunc", scope: !504, file: !352, line: 17, baseType: !4, size: 64, align: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "tgtkey", scope: !504, file: !352, line: 18, baseType: !4, size: 64, align: 64, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "currkey", scope: !504, file: !352, line: 19, baseType: !4, size: 64, align: 64, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "currvalue", scope: !504, file: !352, line: 20, baseType: !4, size: 64, align: 64, offset: 384)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64, align: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "teedataobject", file: !352, line: 407, baseType: !514)
!514 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 401, size: 3968, align: 64, elements: !515)
!515 = !{!516, !517, !518, !519, !520}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !514, file: !352, line: 402, baseType: !5, size: 128, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !514, file: !352, line: 403, baseType: !4, size: 64, align: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "numread", scope: !514, file: !352, line: 404, baseType: !43, size: 32, align: 32, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nextlink", scope: !514, file: !352, line: 405, baseType: !4, size: 64, align: 64, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !514, file: !352, line: 406, baseType: !521, size: 3648, align: 64, offset: 320)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 3648, align: 64, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 57)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "teeobject", file: !352, line: 414, baseType: !526)
!526 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 409, size: 320, align: 64, elements: !527)
!527 = !{!528, !529, !530, !531}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !526, file: !352, line: 410, baseType: !5, size: 128, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "dataobj", scope: !526, file: !352, line: 411, baseType: !512, size: 64, align: 64, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !526, file: !352, line: 412, baseType: !43, size: 32, align: 32, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "weakreflist", scope: !526, file: !352, line: 413, baseType: !4, size: 64, align: 64, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !534, line: 40, baseType: !535)
!534 = !DIFile(filename: "Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!535 = !DICompositeType(tag: DW_TAG_structure_type, file: !534, line: 23, size: 320, align: 64, elements: !536)
!536 = !{!537, !538, !540}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !535, file: !534, line: 24, baseType: !22, size: 192, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !535, file: !534, line: 26, baseType: !539, size: 64, align: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !535, file: !534, line: 39, baseType: !10, size: 64, align: 64, offset: 256)
!541 = !{!542, !555, !575, !594, !606, !609, !621, !640, !655, !670, !697, !713, !738, !745, !762, !777, !792, !818, !834, !858, !865, !882, !897, !912, !929, !932, !948, !967, !982, !997, !1018, !1021, !1028, !1041, !1056, !1071, !1088, !1091, !1098, !1111, !1121, !1132, !1151, !1161, !1168, !1187, !1202, !1217, !1232, !1235, !1248, !1263, !1278, !1311, !1318, !1327, !1330, !1352, !1358, !1373, !1388, !1409, !1412, !1432, !1447, !1462, !1485, !1488, !1501, !1516, !1524, !1539, !1542, !1547, !1550, !1581, !1601, !1620, !1664, !1679, !1691, !1721, !1736, !1751, !1785, !1813, !1844, !1851, !1870, !1885, !1900, !1930, !1947, !1972, !1979, !2018, !2028, !2033, !2044, !2047, !2050, !2053, !2061, !2091, !2118, !2158, !2165, !2169, !2194, !2206, !2215, !2230, !2254, !2257, !2264, !2269, !2280, !2291, !2302, !2309, !2313, !2320, !2324, !2327, !2341, !2347, !2357, !2362, !2384, !2405, !2417, !2422, !2438}
!542 = !DISubprogram(name: "PyInit_itertools", scope: !352, file: !352, line: 4568, type: !543, isLocal: false, isDefinition: true, scopeLine: 4569, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_itertools, variables: !545)
!543 = !DISubroutineType(types: !544)
!544 = !{!4}
!545 = !{!546, !547, !548, !549}
!546 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !542, file: !352, line: 4570, type: !43)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !542, file: !352, line: 4571, type: !4)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "name", scope: !542, file: !352, line: 4572, type: !51)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "typelist", scope: !542, file: !352, line: 4573, type: !550)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 1344, align: 64, elements: !553)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTypeObject", file: !6, line: 422, baseType: !19)
!553 = !{!554}
!554 = !DISubrange(count: 21)
!555 = !DISubprogram(name: "accumulate_dealloc", scope: !352, file: !352, line: 3407, type: !556, isLocal: true, isDefinition: true, scopeLine: 3408, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.accumulateobject*)* @accumulate_dealloc, variables: !558)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !350}
!558 = !{!559, !560, !562, !565, !567, !570, !572}
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !555, file: !352, line: 3407, type: !350)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !561, file: !352, line: 3410, type: !4)
!561 = distinct !DILexicalBlock(scope: !555, file: !352, line: 3410, column: 8)
!562 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !563, file: !352, line: 3410, type: !4)
!563 = distinct !DILexicalBlock(scope: !564, file: !352, line: 3410, column: 101)
!564 = distinct !DILexicalBlock(scope: !561, file: !352, line: 3410, column: 67)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !566, file: !352, line: 3411, type: !4)
!566 = distinct !DILexicalBlock(scope: !555, file: !352, line: 3411, column: 8)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !568, file: !352, line: 3411, type: !4)
!568 = distinct !DILexicalBlock(scope: !569, file: !352, line: 3411, column: 101)
!569 = distinct !DILexicalBlock(scope: !566, file: !352, line: 3411, column: 67)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !571, file: !352, line: 3412, type: !4)
!571 = distinct !DILexicalBlock(scope: !555, file: !352, line: 3412, column: 8)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !573, file: !352, line: 3412, type: !4)
!573 = distinct !DILexicalBlock(scope: !574, file: !352, line: 3412, column: 98)
!574 = distinct !DILexicalBlock(scope: !571, file: !352, line: 3412, column: 64)
!575 = !DISubprogram(name: "accumulate_traverse", scope: !352, file: !352, line: 3417, type: !576, isLocal: true, isDefinition: true, scopeLine: 3418, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.accumulateobject*, i32 (%struct._object*, i8*)*, i8*)* @accumulate_traverse, variables: !578)
!576 = !DISubroutineType(types: !577)
!577 = !{!43, !350, !263, !89}
!578 = !{!579, !580, !581, !582, !586, !590}
!579 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !575, file: !352, line: 3417, type: !350)
!580 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !575, file: !352, line: 3417, type: !263)
!581 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !575, file: !352, line: 3417, type: !89)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !583, file: !352, line: 3419, type: !43)
!583 = distinct !DILexicalBlock(scope: !584, file: !352, line: 3419, column: 25)
!584 = distinct !DILexicalBlock(scope: !585, file: !352, line: 3419, column: 14)
!585 = distinct !DILexicalBlock(scope: !575, file: !352, line: 3419, column: 8)
!586 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !587, file: !352, line: 3420, type: !43)
!587 = distinct !DILexicalBlock(scope: !588, file: !352, line: 3420, column: 22)
!588 = distinct !DILexicalBlock(scope: !589, file: !352, line: 3420, column: 14)
!589 = distinct !DILexicalBlock(scope: !575, file: !352, line: 3420, column: 8)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !591, file: !352, line: 3421, type: !43)
!591 = distinct !DILexicalBlock(scope: !592, file: !352, line: 3421, column: 25)
!592 = distinct !DILexicalBlock(scope: !593, file: !352, line: 3421, column: 14)
!593 = distinct !DILexicalBlock(scope: !575, file: !352, line: 3421, column: 8)
!594 = !DISubprogram(name: "accumulate_next", scope: !352, file: !352, line: 3426, type: !595, isLocal: true, isDefinition: true, scopeLine: 3427, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.accumulateobject*)* @accumulate_next, variables: !597)
!595 = !DISubroutineType(types: !596)
!596 = !{!4, !350}
!597 = !{!598, !599, !600, !601, !602, !604}
!598 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !594, file: !352, line: 3426, type: !350)
!599 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !594, file: !352, line: 3428, type: !4)
!600 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldtotal", scope: !594, file: !352, line: 3428, type: !4)
!601 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newtotal", scope: !594, file: !352, line: 3428, type: !4)
!602 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !603, file: !352, line: 3444, type: !4)
!603 = distinct !DILexicalBlock(scope: !594, file: !352, line: 3444, column: 8)
!604 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !605, file: !352, line: 3450, type: !4)
!605 = distinct !DILexicalBlock(scope: !594, file: !352, line: 3450, column: 8)
!606 = !DISubprogram(name: "accumulate_reduce", scope: !352, file: !352, line: 3457, type: !595, isLocal: true, isDefinition: true, scopeLine: 3458, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.accumulateobject*)* @accumulate_reduce, variables: !607)
!607 = !{!608}
!608 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !606, file: !352, line: 3457, type: !350)
!609 = !DISubprogram(name: "accumulate_setstate", scope: !352, file: !352, line: 3465, type: !610, isLocal: true, isDefinition: true, scopeLine: 3466, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.accumulateobject*, %struct._object*)* @accumulate_setstate, variables: !612)
!610 = !DISubroutineType(types: !611)
!611 = !{!4, !350, !4}
!612 = !{!613, !614, !615, !617}
!613 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !609, file: !352, line: 3465, type: !350)
!614 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 2, scope: !609, file: !352, line: 3465, type: !4)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !616, file: !352, line: 3467, type: !4)
!616 = distinct !DILexicalBlock(scope: !609, file: !352, line: 3467, column: 8)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !618, file: !352, line: 3467, type: !4)
!618 = distinct !DILexicalBlock(scope: !619, file: !352, line: 3467, column: 113)
!619 = distinct !DILexicalBlock(scope: !620, file: !352, line: 3467, column: 82)
!620 = distinct !DILexicalBlock(scope: !616, file: !352, line: 3467, column: 59)
!621 = !DISubprogram(name: "accumulate_new", scope: !352, file: !352, line: 3373, type: !622, isLocal: true, isDefinition: true, scopeLine: 3374, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @accumulate_new, variables: !624)
!622 = !DISubroutineType(types: !623)
!623 = !{!4, !551, !4, !4}
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !636}
!625 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !621, file: !352, line: 3373, type: !551)
!626 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !621, file: !352, line: 3373, type: !4)
!627 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !621, file: !352, line: 3373, type: !4)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iterable", scope: !621, file: !352, line: 3376, type: !4)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !621, file: !352, line: 3377, type: !4)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "binop", scope: !621, file: !352, line: 3378, type: !4)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lz", scope: !621, file: !352, line: 3379, type: !350)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !633, file: !352, line: 3393, type: !4)
!633 = distinct !DILexicalBlock(scope: !634, file: !352, line: 3393, column: 12)
!634 = distinct !DILexicalBlock(scope: !635, file: !352, line: 3392, column: 27)
!635 = distinct !DILexicalBlock(scope: !621, file: !352, line: 3392, column: 9)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !637, file: !352, line: 3398, type: !4)
!637 = distinct !DILexicalBlock(scope: !638, file: !352, line: 3398, column: 12)
!638 = distinct !DILexicalBlock(scope: !639, file: !352, line: 3397, column: 37)
!639 = distinct !DILexicalBlock(scope: !621, file: !352, line: 3397, column: 9)
!640 = !DISubprogram(name: "combinations_dealloc", scope: !352, file: !352, line: 2392, type: !641, isLocal: true, isDefinition: true, scopeLine: 2393, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.combinationsobject*)* @combinations_dealloc, variables: !643)
!641 = !DISubroutineType(types: !642)
!642 = !{null, !368}
!643 = !{!644, !645, !647, !650, !652}
!644 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "co", arg: 1, scope: !640, file: !352, line: 2392, type: !368)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !646, file: !352, line: 2395, type: !4)
!646 = distinct !DILexicalBlock(scope: !640, file: !352, line: 2395, column: 8)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !648, file: !352, line: 2395, type: !4)
!648 = distinct !DILexicalBlock(scope: !649, file: !352, line: 2395, column: 100)
!649 = distinct !DILexicalBlock(scope: !646, file: !352, line: 2395, column: 66)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !651, file: !352, line: 2396, type: !4)
!651 = distinct !DILexicalBlock(scope: !640, file: !352, line: 2396, column: 8)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !653, file: !352, line: 2396, type: !4)
!653 = distinct !DILexicalBlock(scope: !654, file: !352, line: 2396, column: 102)
!654 = distinct !DILexicalBlock(scope: !651, file: !352, line: 2396, column: 68)
!655 = !DISubprogram(name: "combinations_traverse", scope: !352, file: !352, line: 2413, type: !656, isLocal: true, isDefinition: true, scopeLine: 2414, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.combinationsobject*, i32 (%struct._object*, i8*)*, i8*)* @combinations_traverse, variables: !658)
!656 = !DISubroutineType(types: !657)
!657 = !{!43, !368, !263, !89}
!658 = !{!659, !660, !661, !662, !666}
!659 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "co", arg: 1, scope: !655, file: !352, line: 2413, type: !368)
!660 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !655, file: !352, line: 2413, type: !263)
!661 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !655, file: !352, line: 2413, type: !89)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !663, file: !352, line: 2415, type: !43)
!663 = distinct !DILexicalBlock(scope: !664, file: !352, line: 2415, column: 24)
!664 = distinct !DILexicalBlock(scope: !665, file: !352, line: 2415, column: 14)
!665 = distinct !DILexicalBlock(scope: !655, file: !352, line: 2415, column: 8)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !667, file: !352, line: 2416, type: !43)
!667 = distinct !DILexicalBlock(scope: !668, file: !352, line: 2416, column: 26)
!668 = distinct !DILexicalBlock(scope: !669, file: !352, line: 2416, column: 14)
!669 = distinct !DILexicalBlock(scope: !655, file: !352, line: 2416, column: 8)
!670 = !DISubprogram(name: "combinations_next", scope: !352, file: !352, line: 2421, type: !671, isLocal: true, isDefinition: true, scopeLine: 2422, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.combinationsobject*)* @combinations_next, variables: !673)
!671 = !DISubroutineType(types: !672)
!672 = !{!4, !368}
!673 = !{!674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !690, !692}
!674 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "co", arg: 1, scope: !670, file: !352, line: 2421, type: !368)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "elem", scope: !670, file: !352, line: 2423, type: !4)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldelem", scope: !670, file: !352, line: 2424, type: !4)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pool", scope: !670, file: !352, line: 2425, type: !4)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !670, file: !352, line: 2426, type: !247)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !670, file: !352, line: 2427, type: !4)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !670, file: !352, line: 2428, type: !10)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !670, file: !352, line: 2429, type: !10)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !670, file: !352, line: 2430, type: !10)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !670, file: !352, line: 2430, type: !10)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !670, file: !352, line: 2430, type: !10)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_result", scope: !686, file: !352, line: 2450, type: !4)
!686 = distinct !DILexicalBlock(scope: !687, file: !352, line: 2449, column: 53)
!687 = distinct !DILexicalBlock(scope: !688, file: !352, line: 2449, column: 13)
!688 = distinct !DILexicalBlock(scope: !689, file: !352, line: 2447, column: 12)
!689 = distinct !DILexicalBlock(scope: !670, file: !352, line: 2435, column: 9)
!690 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !691, file: !352, line: 2460, type: !4)
!691 = distinct !DILexicalBlock(scope: !686, file: !352, line: 2460, column: 16)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !693, file: !352, line: 2494, type: !4)
!693 = distinct !DILexicalBlock(scope: !694, file: !352, line: 2494, column: 16)
!694 = distinct !DILexicalBlock(scope: !695, file: !352, line: 2488, column: 28)
!695 = distinct !DILexicalBlock(scope: !696, file: !352, line: 2488, column: 9)
!696 = distinct !DILexicalBlock(scope: !688, file: !352, line: 2488, column: 9)
!697 = !DISubprogram(name: "combinations_reduce", scope: !352, file: !352, line: 2507, type: !671, isLocal: true, isDefinition: true, scopeLine: 2508, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.combinationsobject*)* @combinations_reduce, variables: !698)
!698 = !{!699, !700, !704, !705, !709}
!699 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !697, file: !352, line: 2507, type: !368)
!700 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !701, file: !352, line: 2514, type: !4)
!701 = distinct !DILexicalBlock(scope: !702, file: !352, line: 2513, column: 12)
!702 = distinct !DILexicalBlock(scope: !703, file: !352, line: 2511, column: 16)
!703 = distinct !DILexicalBlock(scope: !697, file: !352, line: 2509, column: 9)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !701, file: !352, line: 2515, type: !10)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !706, file: !352, line: 2523, type: !4)
!706 = distinct !DILexicalBlock(scope: !707, file: !352, line: 2522, column: 9)
!707 = distinct !DILexicalBlock(scope: !708, file: !352, line: 2521, column: 9)
!708 = distinct !DILexicalBlock(scope: !701, file: !352, line: 2521, column: 9)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !710, file: !352, line: 2525, type: !4)
!710 = distinct !DILexicalBlock(scope: !711, file: !352, line: 2525, column: 20)
!711 = distinct !DILexicalBlock(scope: !712, file: !352, line: 2524, column: 25)
!712 = distinct !DILexicalBlock(scope: !706, file: !352, line: 2524, column: 17)
!713 = !DISubprogram(name: "combinations_setstate", scope: !352, file: !352, line: 2536, type: !714, isLocal: true, isDefinition: true, scopeLine: 2537, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.combinationsobject*, %struct._object*)* @combinations_setstate, variables: !716)
!714 = !DISubroutineType(types: !715)
!715 = !{!4, !368, !4}
!716 = !{!717, !718, !719, !720, !721, !722, !726, !727, !728, !732, !734}
!717 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !713, file: !352, line: 2536, type: !368)
!718 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 2, scope: !713, file: !352, line: 2536, type: !4)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !713, file: !352, line: 2538, type: !4)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !713, file: !352, line: 2539, type: !10)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !713, file: !352, line: 2540, type: !10)
!722 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "max", scope: !723, file: !352, line: 2550, type: !10)
!723 = distinct !DILexicalBlock(scope: !724, file: !352, line: 2549, column: 5)
!724 = distinct !DILexicalBlock(scope: !725, file: !352, line: 2548, column: 5)
!725 = distinct !DILexicalBlock(scope: !713, file: !352, line: 2548, column: 5)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indexObject", scope: !723, file: !352, line: 2551, type: !4)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !723, file: !352, line: 2552, type: !10)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "element", scope: !729, file: !352, line: 2568, type: !4)
!729 = distinct !DILexicalBlock(scope: !730, file: !352, line: 2567, column: 29)
!730 = distinct !DILexicalBlock(scope: !731, file: !352, line: 2567, column: 5)
!731 = distinct !DILexicalBlock(scope: !713, file: !352, line: 2567, column: 5)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !733, file: !352, line: 2573, type: !4)
!733 = distinct !DILexicalBlock(scope: !713, file: !352, line: 2573, column: 8)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !735, file: !352, line: 2573, type: !4)
!735 = distinct !DILexicalBlock(scope: !736, file: !352, line: 2573, column: 115)
!736 = distinct !DILexicalBlock(scope: !737, file: !352, line: 2573, column: 83)
!737 = distinct !DILexicalBlock(scope: !733, file: !352, line: 2573, column: 60)
!738 = !DISubprogram(name: "combinations_sizeof", scope: !352, file: !352, line: 2403, type: !739, isLocal: true, isDefinition: true, scopeLine: 2404, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.combinationsobject*, i8*)* @combinations_sizeof, variables: !741)
!739 = !DISubroutineType(types: !740)
!740 = !{!4, !368, !89}
!741 = !{!742, !743, !744}
!742 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "co", arg: 1, scope: !738, file: !352, line: 2403, type: !368)
!743 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !738, file: !352, line: 2403, type: !89)
!744 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !738, file: !352, line: 2405, type: !10)
!745 = !DISubprogram(name: "combinations_new", scope: !352, file: !352, line: 2338, type: !622, isLocal: true, isDefinition: true, scopeLine: 2339, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @combinations_new, variables: !746)
!746 = !{!747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !759}
!747 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !745, file: !352, line: 2338, type: !551)
!748 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !745, file: !352, line: 2338, type: !4)
!749 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !745, file: !352, line: 2338, type: !4)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "co", scope: !745, file: !352, line: 2340, type: !368)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !745, file: !352, line: 2341, type: !10)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !745, file: !352, line: 2342, type: !10)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pool", scope: !745, file: !352, line: 2343, type: !4)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iterable", scope: !745, file: !352, line: 2344, type: !4)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !745, file: !352, line: 2345, type: !247)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !745, file: !352, line: 2346, type: !10)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !758, file: !352, line: 2387, type: !4)
!758 = distinct !DILexicalBlock(scope: !745, file: !352, line: 2387, column: 8)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !760, file: !352, line: 2387, type: !4)
!760 = distinct !DILexicalBlock(scope: !761, file: !352, line: 2387, column: 96)
!761 = distinct !DILexicalBlock(scope: !758, file: !352, line: 2387, column: 62)
!762 = !DISubprogram(name: "cwr_dealloc", scope: !352, file: !352, line: 2733, type: !763, isLocal: true, isDefinition: true, scopeLine: 2734, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.cwrobject*)* @cwr_dealloc, variables: !765)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !378}
!765 = !{!766, !767, !769, !772, !774}
!766 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "co", arg: 1, scope: !762, file: !352, line: 2733, type: !378)
!767 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !768, file: !352, line: 2736, type: !4)
!768 = distinct !DILexicalBlock(scope: !762, file: !352, line: 2736, column: 8)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !770, file: !352, line: 2736, type: !4)
!770 = distinct !DILexicalBlock(scope: !771, file: !352, line: 2736, column: 100)
!771 = distinct !DILexicalBlock(scope: !768, file: !352, line: 2736, column: 66)
!772 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !773, file: !352, line: 2737, type: !4)
!773 = distinct !DILexicalBlock(scope: !762, file: !352, line: 2737, column: 8)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !775, file: !352, line: 2737, type: !4)
!775 = distinct !DILexicalBlock(scope: !776, file: !352, line: 2737, column: 102)
!776 = distinct !DILexicalBlock(scope: !773, file: !352, line: 2737, column: 68)
!777 = !DISubprogram(name: "cwr_traverse", scope: !352, file: !352, line: 2754, type: !778, isLocal: true, isDefinition: true, scopeLine: 2755, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cwrobject*, i32 (%struct._object*, i8*)*, i8*)* @cwr_traverse, variables: !780)
!778 = !DISubroutineType(types: !779)
!779 = !{!43, !378, !263, !89}
!780 = !{!781, !782, !783, !784, !788}
!781 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "co", arg: 1, scope: !777, file: !352, line: 2754, type: !378)
!782 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !777, file: !352, line: 2754, type: !263)
!783 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !777, file: !352, line: 2754, type: !89)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !785, file: !352, line: 2756, type: !43)
!785 = distinct !DILexicalBlock(scope: !786, file: !352, line: 2756, column: 24)
!786 = distinct !DILexicalBlock(scope: !787, file: !352, line: 2756, column: 14)
!787 = distinct !DILexicalBlock(scope: !777, file: !352, line: 2756, column: 8)
!788 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !789, file: !352, line: 2757, type: !43)
!789 = distinct !DILexicalBlock(scope: !790, file: !352, line: 2757, column: 26)
!790 = distinct !DILexicalBlock(scope: !791, file: !352, line: 2757, column: 14)
!791 = distinct !DILexicalBlock(scope: !777, file: !352, line: 2757, column: 8)
!792 = !DISubprogram(name: "cwr_next", scope: !352, file: !352, line: 2762, type: !793, isLocal: true, isDefinition: true, scopeLine: 2763, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.cwrobject*)* @cwr_next, variables: !795)
!793 = !DISubroutineType(types: !794)
!794 = !{!4, !378}
!795 = !{!796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !811, !813}
!796 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "co", arg: 1, scope: !792, file: !352, line: 2762, type: !378)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "elem", scope: !792, file: !352, line: 2764, type: !4)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oldelem", scope: !792, file: !352, line: 2765, type: !4)
!799 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pool", scope: !792, file: !352, line: 2766, type: !4)
!800 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !792, file: !352, line: 2767, type: !247)
!801 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !792, file: !352, line: 2768, type: !4)
!802 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !792, file: !352, line: 2769, type: !10)
!803 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !792, file: !352, line: 2770, type: !10)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !792, file: !352, line: 2771, type: !10)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !792, file: !352, line: 2771, type: !10)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "old_result", scope: !807, file: !352, line: 2791, type: !4)
!807 = distinct !DILexicalBlock(scope: !808, file: !352, line: 2790, column: 53)
!808 = distinct !DILexicalBlock(scope: !809, file: !352, line: 2790, column: 13)
!809 = distinct !DILexicalBlock(scope: !810, file: !352, line: 2788, column: 12)
!810 = distinct !DILexicalBlock(scope: !792, file: !352, line: 2776, column: 9)
!811 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !812, file: !352, line: 2801, type: !4)
!812 = distinct !DILexicalBlock(scope: !807, file: !352, line: 2801, column: 16)
!813 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !814, file: !352, line: 2827, type: !4)
!814 = distinct !DILexicalBlock(scope: !815, file: !352, line: 2827, column: 16)
!815 = distinct !DILexicalBlock(scope: !816, file: !352, line: 2822, column: 28)
!816 = distinct !DILexicalBlock(scope: !817, file: !352, line: 2822, column: 9)
!817 = distinct !DILexicalBlock(scope: !809, file: !352, line: 2822, column: 9)
!818 = !DISubprogram(name: "cwr_reduce", scope: !352, file: !352, line: 2840, type: !793, isLocal: true, isDefinition: true, scopeLine: 2841, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.cwrobject*)* @cwr_reduce, variables: !819)
!819 = !{!820, !821, !825, !826, !830}
!820 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !818, file: !352, line: 2840, type: !378)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !822, file: !352, line: 2847, type: !4)
!822 = distinct !DILexicalBlock(scope: !823, file: !352, line: 2846, column: 12)
!823 = distinct !DILexicalBlock(scope: !824, file: !352, line: 2844, column: 16)
!824 = distinct !DILexicalBlock(scope: !818, file: !352, line: 2842, column: 9)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !822, file: !352, line: 2848, type: !10)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !827, file: !352, line: 2856, type: !4)
!827 = distinct !DILexicalBlock(scope: !828, file: !352, line: 2855, column: 9)
!828 = distinct !DILexicalBlock(scope: !829, file: !352, line: 2854, column: 9)
!829 = distinct !DILexicalBlock(scope: !822, file: !352, line: 2854, column: 9)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !831, file: !352, line: 2858, type: !4)
!831 = distinct !DILexicalBlock(scope: !832, file: !352, line: 2858, column: 20)
!832 = distinct !DILexicalBlock(scope: !833, file: !352, line: 2857, column: 25)
!833 = distinct !DILexicalBlock(scope: !827, file: !352, line: 2857, column: 17)
!834 = !DISubprogram(name: "cwr_setstate", scope: !352, file: !352, line: 2869, type: !835, isLocal: true, isDefinition: true, scopeLine: 2870, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.cwrobject*, %struct._object*)* @cwr_setstate, variables: !837)
!835 = !DISubroutineType(types: !836)
!836 = !{!4, !378, !4}
!837 = !{!838, !839, !840, !841, !842, !843, !847, !848, !852, !854}
!838 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !834, file: !352, line: 2869, type: !378)
!839 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "state", arg: 2, scope: !834, file: !352, line: 2869, type: !4)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !834, file: !352, line: 2871, type: !4)
!841 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !834, file: !352, line: 2872, type: !10)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !834, file: !352, line: 2872, type: !10)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indexObject", scope: !844, file: !352, line: 2883, type: !4)
!844 = distinct !DILexicalBlock(scope: !845, file: !352, line: 2882, column: 5)
!845 = distinct !DILexicalBlock(scope: !846, file: !352, line: 2881, column: 5)
!846 = distinct !DILexicalBlock(scope: !834, file: !352, line: 2881, column: 5)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "index", scope: !844, file: !352, line: 2884, type: !10)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "element", scope: !849, file: !352, line: 2898, type: !4)
!849 = distinct !DILexicalBlock(scope: !850, file: !352, line: 2897, column: 29)
!850 = distinct !DILexicalBlock(scope: !851, file: !352, line: 2897, column: 5)
!851 = distinct !DILexicalBlock(scope: !834, file: !352, line: 2897, column: 5)
!852 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !853, file: !352, line: 2902, type: !4)
!853 = distinct !DILexicalBlock(scope: !834, file: !352, line: 2902, column: 8)
!854 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !855, file: !352, line: 2902, type: !4)
!855 = distinct !DILexicalBlock(scope: !856, file: !352, line: 2902, column: 115)
!856 = distinct !DILexicalBlock(scope: !857, file: !352, line: 2902, column: 83)
!857 = distinct !DILexicalBlock(scope: !853, file: !352, line: 2902, column: 60)
!858 = !DISubprogram(name: "cwr_sizeof", scope: !352, file: !352, line: 2744, type: !859, isLocal: true, isDefinition: true, scopeLine: 2745, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.cwrobject*, i8*)* @cwr_sizeof, variables: !861)
!859 = !DISubroutineType(types: !860)
!860 = !{!4, !378, !89}
!861 = !{!862, !863, !864}
!862 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "co", arg: 1, scope: !858, file: !352, line: 2744, type: !378)
!863 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "unused", arg: 2, scope: !858, file: !352, line: 2744, type: !89)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !858, file: !352, line: 2746, type: !10)
!865 = !DISubprogram(name: "cwr_new", scope: !352, file: !352, line: 2679, type: !622, isLocal: true, isDefinition: true, scopeLine: 2680, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._typeobject*, %struct._object*, %struct._object*)* @cwr_new, variables: !866)
!866 = !{!867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !879}
!867 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "type", arg: 1, scope: !865, file: !352, line: 2679, type: !551)
!868 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !865, file: !352, line: 2679, type: !4)
!869 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !865, file: !352, line: 2679, type: !4)
!870 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "co", scope: !865, file: !352, line: 2681, type: !378)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !865, file: !352, line: 2682, type: !10)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !865, file: !352, line: 2683, type: !10)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pool", scope: !865, file: !352, line: 2684, type: !4)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iterable", scope: !865, file: !352, line: 2685, type: !4)
!875 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "indices", scope: !865, file: !352, line: 2686, type: !247)
!876 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !865, file: !352, line: 2687, type: !10)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !878, file: !352, line: 2728, type: !4)
!878 = distinct !DILexicalBlock(scope: !865, file: !352, line: 2728, column: 8)
!879 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !880, file: !352, line: 2728, type: !4)
!880 = distinct !DILexicalBlock(scope: !881, file: !352, line: 2728, column: 96)
!881 = distinct !DILexicalBlock(scope: !878, file: !352, line: 2728, column: 62)
!882 = !DISubprogram(name: "cycle_dealloc", scope: !352, file: !352, line: 911, type: !883, isLocal: true, isDefinition: true, scopeLine: 912, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.cycleobject*)* @cycle_dealloc, variables: !885)
!883 = !DISubroutineType(types: !884)
!884 = !{null, !388}
!885 = !{!886, !887, !889, !892, !894}
!886 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !882, file: !352, line: 911, type: !388)
!887 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !888, file: !352, line: 914, type: !4)
!888 = distinct !DILexicalBlock(scope: !882, file: !352, line: 914, column: 8)
!889 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !890, file: !352, line: 914, type: !4)
!890 = distinct !DILexicalBlock(scope: !891, file: !352, line: 914, column: 101)
!891 = distinct !DILexicalBlock(scope: !888, file: !352, line: 914, column: 67)
!892 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !893, file: !352, line: 915, type: !4)
!893 = distinct !DILexicalBlock(scope: !882, file: !352, line: 915, column: 8)
!894 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !895, file: !352, line: 915, type: !4)
!895 = distinct !DILexicalBlock(scope: !896, file: !352, line: 915, column: 98)
!896 = distinct !DILexicalBlock(scope: !893, file: !352, line: 915, column: 64)
!897 = !DISubprogram(name: "cycle_traverse", scope: !352, file: !352, line: 920, type: !898, isLocal: true, isDefinition: true, scopeLine: 921, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.cycleobject*, i32 (%struct._object*, i8*)*, i8*)* @cycle_traverse, variables: !900)
!898 = !DISubroutineType(types: !899)
!899 = !{!43, !388, !263, !89}
!900 = !{!901, !902, !903, !904, !908}
!901 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !897, file: !352, line: 920, type: !388)
!902 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "visit", arg: 2, scope: !897, file: !352, line: 920, type: !263)
!903 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 3, scope: !897, file: !352, line: 920, type: !89)
!904 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !905, file: !352, line: 922, type: !43)
!905 = distinct !DILexicalBlock(scope: !906, file: !352, line: 922, column: 22)
!906 = distinct !DILexicalBlock(scope: !907, file: !352, line: 922, column: 14)
!907 = distinct !DILexicalBlock(scope: !897, file: !352, line: 922, column: 8)
!908 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vret", scope: !909, file: !352, line: 923, type: !43)
!909 = distinct !DILexicalBlock(scope: !910, file: !352, line: 923, column: 25)
!910 = distinct !DILexicalBlock(scope: !911, file: !352, line: 923, column: 14)
!911 = distinct !DILexicalBlock(scope: !897, file: !352, line: 923, column: 8)
!912 = !DISubprogram(name: "cycle_next", scope: !352, file: !352, line: 928, type: !913, isLocal: true, isDefinition: true, scopeLine: 929, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.cycleobject*)* @cycle_next, variables: !915)
!913 = !DISubroutineType(types: !914)
!914 = !{!4, !388}
!915 = !{!916, !917, !918, !919, !920, !927}
!916 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lz", arg: 1, scope: !912, file: !352, line: 928, type: !388)
!917 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !912, file: !352, line: 930, type: !4)
!918 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !912, file: !352, line: 931, type: !4)
!919 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !912, file: !352, line: 932, type: !4)
!920 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !921, file: !352, line: 938, type: !4)
!921 = distinct !DILexicalBlock(scope: !922, file: !352, line: 938, column: 20)
!922 = distinct !DILexicalBlock(scope: !923, file: !352, line: 937, column: 67)
!923 = distinct !DILexicalBlock(scope: !924, file: !352, line: 937, column: 17)
!924 = distinct !DILexicalBlock(scope: !925, file: !352, line: 936, column: 33)
!925 = distinct !DILexicalBlock(scope: !926, file: !352, line: 936, column: 13)
!926 = distinct !DILexicalBlock(scope: !912, file: !352, line: 934, column: 15)
!927 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !928, file: !352, line: 957, type: !4)
!928 = distinct !DILexicalBlock(scope: !926, file: !352, line: 957, column: 12)
!929 = !DISubprogram(name: "cycle_reduce", scope: !352, file: !352, line: 962, type: !913, isLocal: true, isDefinition: true, scopeLine: 963, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.cycleobject*)* @cycle_reduce, variables: !930)
!930 = !{!931}
