; ModuleID = 'irs-onlybc/listnode.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct._node = type { i16, i8*, i32, i32, i32, %struct._node* }

@stdout = external global %struct._IO_FILE*, align 8
@level = internal global i32 0, align 4
@atbol = internal global i32 0, align 4
@.str = private unnamed_addr constant [2 x i8] c"\09\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"%s \00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"? \00", align 1

; Function Attrs: nounwind uwtable
define void @PyNode_ListTree(%struct._node* %n) #0 {
entry:
  %n.addr = alloca %struct._node*, align 8
  store %struct._node* %n, %struct._node** %n.addr, align 8, !tbaa !112
  call void @llvm.dbg.declare(metadata %struct._node** %n.addr, metadata !27, metadata !116), !dbg !117
  %0 = load %struct._IO_FILE*, %struct._IO_FILE** @stdout, align 8, !dbg !118, !tbaa !112
  %1 = load %struct._node*, %struct._node** %n.addr, align 8, !dbg !119, !tbaa !112

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !5, globals: !106)
!1 = !DIFile(filename: "listnode.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !{!6, !28, !93}
!6 = !DISubprogram(name: "PyNode_ListTree", scope: !7, file: !7, line: 13, type: !8, isLocal: false, isDefinition: true, scopeLine: 14, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._node*)* @PyNode_ListTree, variables: !26)
!7 = !DIFile(filename: "Parser/listnode.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!8 = !DISubroutineType(types: !9)
!9 = !{null, !10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "node", file: !12, line: 17, baseType: !13)
!12 = !DIFile(filename: "Include/node.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "_node", file: !12, line: 10, size: 320, align: 64, elements: !14)
!14 = !{!15, !17, !20, !22, !23, !24}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "n_type", scope: !13, file: !12, line: 11, baseType: !16, size: 16, align: 16)
!16 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "n_str", scope: !13, file: !12, line: 12, baseType: !18, size: 64, align: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "n_lineno", scope: !13, file: !12, line: 13, baseType: !21, size: 32, align: 32, offset: 128)
!21 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "n_col_offset", scope: !13, file: !12, line: 14, baseType: !21, size: 32, align: 32, offset: 160)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "n_nchildren", scope: !13, file: !12, line: 15, baseType: !21, size: 32, align: 32, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "n_child", scope: !13, file: !12, line: 16, baseType: !25, size: 64, align: 64, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!26 = !{!27}
!27 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !6, file: !7, line: 13, type: !10)
!28 = !DISubprogram(name: "listnode", scope: !7, file: !7, line: 21, type: !29, isLocal: true, isDefinition: true, scopeLine: 22, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IO_FILE*, %struct._node*)* @listnode, variables: !90)
!29 = !DISubroutineType(types: !30)
!30 = !{null, !31, !10}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !33, line: 48, baseType: !34)
!33 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !35, line: 246, size: 1728, align: 64, elements: !36)
!35 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!36 = !{!37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !57, !58, !59, !60, !64, !66, !68, !72, !75, !77, !78, !79, !80, !81, !85, !86}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !34, file: !35, line: 247, baseType: !21, size: 32, align: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !34, file: !35, line: 252, baseType: !18, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !34, file: !35, line: 253, baseType: !18, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !34, file: !35, line: 254, baseType: !18, size: 64, align: 64, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !34, file: !35, line: 255, baseType: !18, size: 64, align: 64, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !34, file: !35, line: 256, baseType: !18, size: 64, align: 64, offset: 320)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !34, file: !35, line: 257, baseType: !18, size: 64, align: 64, offset: 384)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !34, file: !35, line: 258, baseType: !18, size: 64, align: 64, offset: 448)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !34, file: !35, line: 259, baseType: !18, size: 64, align: 64, offset: 512)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !34, file: !35, line: 261, baseType: !18, size: 64, align: 64, offset: 576)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !34, file: !35, line: 262, baseType: !18, size: 64, align: 64, offset: 640)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !34, file: !35, line: 263, baseType: !18, size: 64, align: 64, offset: 704)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !34, file: !35, line: 265, baseType: !50, size: 64, align: 64, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !35, line: 161, size: 192, align: 64, elements: !52)
!52 = !{!53, !54, !56}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !51, file: !35, line: 162, baseType: !50, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !51, file: !35, line: 163, baseType: !55, size: 64, align: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !51, file: !35, line: 167, baseType: !21, size: 32, align: 32, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !34, file: !35, line: 267, baseType: !55, size: 64, align: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !34, file: !35, line: 269, baseType: !21, size: 32, align: 32, offset: 896)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !34, file: !35, line: 273, baseType: !21, size: 32, align: 32, offset: 928)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !34, file: !35, line: 275, baseType: !61, size: 64, align: 64, offset: 960)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !62, line: 140, baseType: !63)
!62 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!63 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !34, file: !35, line: 279, baseType: !65, size: 16, align: 16, offset: 1024)
!65 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !34, file: !35, line: 280, baseType: !67, size: 8, align: 8, offset: 1040)
!67 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !34, file: !35, line: 281, baseType: !69, size: 8, align: 8, offset: 1048)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8, align: 8, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 1)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !34, file: !35, line: 285, baseType: !73, size: 64, align: 64, offset: 1088)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !35, line: 155, baseType: null)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !34, file: !35, line: 294, baseType: !76, size: 64, align: 64, offset: 1152)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !62, line: 141, baseType: !63)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !34, file: !35, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !34, file: !35, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !34, file: !35, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !34, file: !35, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !34, file: !35, line: 307, baseType: !82, size: 64, align: 64, offset: 1472)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !83, line: 62, baseType: !84)
!83 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!84 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !34, file: !35, line: 309, baseType: !21, size: 32, align: 32, offset: 1536)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !34, file: !35, line: 311, baseType: !87, size: 160, align: 8, offset: 1568)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 160, align: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 20)
!90 = !{!91, !92}
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !28, file: !7, line: 21, type: !31)
!92 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !28, file: !7, line: 21, type: !10)
!93 = !DISubprogram(name: "list1node", scope: !7, file: !7, line: 29, type: !29, isLocal: true, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IO_FILE*, %struct._node*)* @list1node, variables: !94)
!94 = !{!95, !96, !97, !100}
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !93, file: !7, line: 29, type: !31)
!96 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !93, file: !7, line: 29, type: !10)
!97 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !98, file: !7, line: 34, type: !21)
!98 = distinct !DILexicalBlock(scope: !99, file: !7, line: 33, column: 35)
!99 = distinct !DILexicalBlock(scope: !93, file: !7, line: 33, column: 9)
!100 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !101, file: !7, line: 48, type: !21)
!101 = distinct !DILexicalBlock(scope: !102, file: !7, line: 47, column: 24)
!102 = distinct !DILexicalBlock(scope: !103, file: !7, line: 47, column: 17)
!103 = distinct !DILexicalBlock(scope: !104, file: !7, line: 39, column: 32)
!104 = distinct !DILexicalBlock(scope: !105, file: !7, line: 38, column: 39)
!105 = distinct !DILexicalBlock(scope: !99, file: !7, line: 38, column: 14)
!106 = !{!107, !108}
!107 = !DIGlobalVariable(name: "level", scope: !0, file: !7, line: 18, type: !21, isLocal: true, isDefinition: true, variable: i32* @level)
!108 = !DIGlobalVariable(name: "atbol", scope: !0, file: !7, line: 18, type: !21, isLocal: true, isDefinition: true, variable: i32* @atbol)
!109 = !{i32 2, !"Dwarf Version", i32 4}
!110 = !{i32 2, !"Debug Info Version", i32 3}
!111 = !{!"clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)"}
!112 = !{!113, !113, i64 0}
!113 = !{!"any pointer", !114, i64 0}
!114 = !{!"omnipotent char", !115, i64 0}
!115 = !{!"Simple C/C++ TBAA"}
!116 = !DIExpression()
!117 = !DILocation(line: 13, column: 23, scope: !6)
!118 = !DILocation(line: 15, column: 14, scope: !6)
!119 = !DILocation(line: 15, column: 22, scope: !6)
!120 = !DILocation(line: 15, column: 5, scope: !6)
!121 = !DILocation(line: 16, column: 1, scope: !6)
!122 = !DILocation(line: 21, column: 16, scope: !28)
!123 = !DILocation(line: 21, column: 26, scope: !28)
!124 = !DILocation(line: 23, column: 11, scope: !28)
!125 = !{!126, !126, i64 0}
!126 = !{!"int", !114, i64 0}
!127 = !DILocation(line: 24, column: 11, scope: !28)
!128 = !DILocation(line: 25, column: 15, scope: !28)
!129 = !DILocation(line: 25, column: 19, scope: !28)
!130 = !DILocation(line: 25, column: 5, scope: !28)
!131 = !DILocation(line: 26, column: 1, scope: !28)
!132 = !DILocation(line: 29, column: 17, scope: !93)
!133 = !DILocation(line: 29, column: 27, scope: !93)
!134 = !DILocation(line: 31, column: 9, scope: !135)
!135 = distinct !DILexicalBlock(scope: !93, file: !7, line: 31, column: 9)
!136 = !DILocation(line: 31, column: 11, scope: !135)
!137 = !DILocation(line: 31, column: 9, scope: !93)
!138 = !DILocation(line: 32, column: 9, scope: !135)
!139 = !DILocation(line: 33, column: 13, scope: !99)
!140 = !DILocation(line: 33, column: 17, scope: !99)
!141 = !{!142, !143, i64 0}
!142 = !{!"_node", !143, i64 0, !113, i64 8, !126, i64 16, !126, i64 20, !126, i64 24, !113, i64 32}
!143 = !{!"short", !114, i64 0}
!144 = !DILocation(line: 33, column: 10, scope: !99)
!145 = !DILocation(line: 33, column: 26, scope: !99)
