; ModuleID = 'programs_new/Python-new/listobject.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyListObject = type { %struct.PyVarObject, %struct._object**, i64 }
%struct.PyVarObject = type { %struct._object, i64 }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !18, subprograms: !463, globals: !1490)
!1 = !DIFile(filename: "listobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3, !11}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Py_memory_order", file: !4, line: 23, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/pyatomic.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "_Py_memory_order_relaxed", value: 0)
!7 = !DIEnumerator(name: "_Py_memory_order_acquire", value: 1)
!8 = !DIEnumerator(name: "_Py_memory_order_release", value: 2)
!9 = !DIEnumerator(name: "_Py_memory_order_acq_rel", value: 3)
!10 = !DIEnumerator(name: "_Py_memory_order_seq_cst", value: 4)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !12, line: 451, size: 32, align: 32, elements: !13)
!12 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!15 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!16 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!17 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!18 = !{!19, !22, !358, !107, !365, !367, !368, !382, !28, !390, !448, !456}
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !20, line: 62, baseType: !21)
!20 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!21 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !24, line: 109, baseType: !25)
!24 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !24, line: 105, size: 128, align: 64, elements: !26)
!26 = !{!27, !35}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !25, file: !24, line: 107, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !29, line: 177, baseType: !30)
!29 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !31, line: 102, baseType: !32)
!31 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !33, line: 181, baseType: !34)
!33 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!34 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !25, file: !24, line: 108, baseType: !36, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !24, line: 334, size: 3200, align: 64, elements: !38)
!38 = !{!39, !45, !49, !50, !51, !56, !117, !122, !127, !128, !133, !185, !216, !228, !234, !235, !236, !238, !240, !271, !272, !273, !282, !283, !288, !289, !291, !293, !303, !306, !324, !325, !326, !328, !330, !331, !333, !338, !343, !348, !349, !350, !351, !352, !353, !354, !355, !357}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !37, file: !24, line: 335, baseType: !40, size: 192, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !24, line: 114, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 111, size: 192, align: 64, elements: !42)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !41, file: !24, line: 112, baseType: !23, size: 128, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !41, file: !24, line: 113, baseType: !28, size: 64, align: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !37, file: !24, line: 336, baseType: !46, size: 64, align: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !37, file: !24, line: 337, baseType: !28, size: 64, align: 64, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !37, file: !24, line: 337, baseType: !28, size: 64, align: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !37, file: !24, line: 341, baseType: !52, size: 64, align: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !24, line: 308, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{null, !22}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !37, file: !24, line: 342, baseType: !57, size: 64, align: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !24, line: 314, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !22, !62, !61}
!61 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !31, line: 48, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !65, line: 246, size: 1728, align: 64, elements: !66)
!65 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!66 = !{!67, !68, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !88, !89, !90, !91, !93, !95, !97, !101, !104, !106, !108, !109, !110, !111, !112, !113}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !64, file: !65, line: 247, baseType: !61, size: 32, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !64, file: !65, line: 252, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !64, file: !65, line: 253, baseType: !69, size: 64, align: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !64, file: !65, line: 254, baseType: !69, size: 64, align: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !64, file: !65, line: 255, baseType: !69, size: 64, align: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !64, file: !65, line: 256, baseType: !69, size: 64, align: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !64, file: !65, line: 257, baseType: !69, size: 64, align: 64, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !64, file: !65, line: 258, baseType: !69, size: 64, align: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !64, file: !65, line: 259, baseType: !69, size: 64, align: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !64, file: !65, line: 261, baseType: !69, size: 64, align: 64, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !64, file: !65, line: 262, baseType: !69, size: 64, align: 64, offset: 640)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !64, file: !65, line: 263, baseType: !69, size: 64, align: 64, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !64, file: !65, line: 265, baseType: !81, size: 64, align: 64, offset: 768)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64, align: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !65, line: 161, size: 192, align: 64, elements: !83)
!83 = !{!84, !85, !87}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !82, file: !65, line: 162, baseType: !81, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !82, file: !65, line: 163, baseType: !86, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !82, file: !65, line: 167, baseType: !61, size: 32, align: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !64, file: !65, line: 267, baseType: !86, size: 64, align: 64, offset: 832)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !64, file: !65, line: 269, baseType: !61, size: 32, align: 32, offset: 896)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !64, file: !65, line: 273, baseType: !61, size: 32, align: 32, offset: 928)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !64, file: !65, line: 275, baseType: !92, size: 64, align: 64, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !33, line: 140, baseType: !34)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !64, file: !65, line: 279, baseType: !94, size: 16, align: 16, offset: 1024)
!94 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !64, file: !65, line: 280, baseType: !96, size: 8, align: 8, offset: 1040)
!96 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !64, file: !65, line: 281, baseType: !98, size: 8, align: 8, offset: 1048)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8, align: 8, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 1)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !64, file: !65, line: 285, baseType: !102, size: 64, align: 64, offset: 1088)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !65, line: 155, baseType: null)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !64, file: !65, line: 294, baseType: !105, size: 64, align: 64, offset: 1152)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !33, line: 141, baseType: !34)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !64, file: !65, line: 303, baseType: !107, size: 64, align: 64, offset: 1216)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !64, file: !65, line: 304, baseType: !107, size: 64, align: 64, offset: 1280)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !64, file: !65, line: 305, baseType: !107, size: 64, align: 64, offset: 1344)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !64, file: !65, line: 306, baseType: !107, size: 64, align: 64, offset: 1408)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !64, file: !65, line: 307, baseType: !19, size: 64, align: 64, offset: 1472)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !64, file: !65, line: 309, baseType: !61, size: 32, align: 32, offset: 1536)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !64, file: !65, line: 311, baseType: !114, size: 160, align: 8, offset: 1568)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 160, align: 8, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 20)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !37, file: !24, line: 343, baseType: !118, size: 64, align: 64, offset: 512)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !24, line: 316, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!22, !22, !69}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !37, file: !24, line: 344, baseType: !123, size: 64, align: 64, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !24, line: 318, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64, align: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!61, !22, !69, !22}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !37, file: !24, line: 345, baseType: !107, size: 64, align: 64, offset: 640)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !37, file: !24, line: 346, baseType: !129, size: 64, align: 64, offset: 704)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !24, line: 320, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!22, !22}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !37, file: !24, line: 350, baseType: !134, size: 64, align: 64, offset: 768)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !24, line: 278, baseType: !136)
!136 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 236, size: 2176, align: 64, elements: !137)
!137 = !{!138, !143, !144, !145, !146, !147, !152, !154, !155, !156, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !136, file: !24, line: 241, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !24, line: 166, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!22, !22, !22}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !136, file: !24, line: 242, baseType: !139, size: 64, align: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !136, file: !24, line: 243, baseType: !139, size: 64, align: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !136, file: !24, line: 244, baseType: !139, size: 64, align: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !136, file: !24, line: 245, baseType: !139, size: 64, align: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !136, file: !24, line: 246, baseType: !148, size: 64, align: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !24, line: 167, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!22, !22, !22, !22}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !136, file: !24, line: 247, baseType: !153, size: 64, align: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !24, line: 165, baseType: !130)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !136, file: !24, line: 248, baseType: !153, size: 64, align: 64, offset: 448)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !136, file: !24, line: 249, baseType: !153, size: 64, align: 64, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !136, file: !24, line: 250, baseType: !157, size: 64, align: 64, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !24, line: 168, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64, align: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{!61, !22}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !136, file: !24, line: 251, baseType: !153, size: 64, align: 64, offset: 640)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !136, file: !24, line: 252, baseType: !139, size: 64, align: 64, offset: 704)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !136, file: !24, line: 253, baseType: !139, size: 64, align: 64, offset: 768)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !136, file: !24, line: 254, baseType: !139, size: 64, align: 64, offset: 832)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !136, file: !24, line: 255, baseType: !139, size: 64, align: 64, offset: 896)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !136, file: !24, line: 256, baseType: !139, size: 64, align: 64, offset: 960)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !136, file: !24, line: 257, baseType: !153, size: 64, align: 64, offset: 1024)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !136, file: !24, line: 258, baseType: !107, size: 64, align: 64, offset: 1088)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !136, file: !24, line: 259, baseType: !153, size: 64, align: 64, offset: 1152)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !136, file: !24, line: 261, baseType: !139, size: 64, align: 64, offset: 1216)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !136, file: !24, line: 262, baseType: !139, size: 64, align: 64, offset: 1280)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !136, file: !24, line: 263, baseType: !139, size: 64, align: 64, offset: 1344)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !136, file: !24, line: 264, baseType: !139, size: 64, align: 64, offset: 1408)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !136, file: !24, line: 265, baseType: !148, size: 64, align: 64, offset: 1472)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !136, file: !24, line: 266, baseType: !139, size: 64, align: 64, offset: 1536)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !136, file: !24, line: 267, baseType: !139, size: 64, align: 64, offset: 1600)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !136, file: !24, line: 268, baseType: !139, size: 64, align: 64, offset: 1664)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !136, file: !24, line: 269, baseType: !139, size: 64, align: 64, offset: 1728)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !136, file: !24, line: 270, baseType: !139, size: 64, align: 64, offset: 1792)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !136, file: !24, line: 272, baseType: !139, size: 64, align: 64, offset: 1856)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !136, file: !24, line: 273, baseType: !139, size: 64, align: 64, offset: 1920)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !136, file: !24, line: 274, baseType: !139, size: 64, align: 64, offset: 1984)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !136, file: !24, line: 275, baseType: !139, size: 64, align: 64, offset: 2048)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !136, file: !24, line: 277, baseType: !153, size: 64, align: 64, offset: 2112)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !37, file: !24, line: 351, baseType: !186, size: 64, align: 64, offset: 832)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !24, line: 292, baseType: !188)
!188 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 280, size: 640, align: 64, elements: !189)
!189 = !{!190, !195, !196, !201, !202, !203, !208, !209, !214, !215}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !188, file: !24, line: 281, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !24, line: 169, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!28, !22}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !188, file: !24, line: 282, baseType: !139, size: 64, align: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !188, file: !24, line: 283, baseType: !197, size: 64, align: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !24, line: 170, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!22, !22, !28}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !188, file: !24, line: 284, baseType: !197, size: 64, align: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !188, file: !24, line: 285, baseType: !107, size: 64, align: 64, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !188, file: !24, line: 286, baseType: !204, size: 64, align: 64, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !24, line: 172, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!61, !22, !28, !22}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !188, file: !24, line: 287, baseType: !107, size: 64, align: 64, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !188, file: !24, line: 288, baseType: !210, size: 64, align: 64, offset: 448)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !24, line: 231, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!61, !22, !22}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !188, file: !24, line: 290, baseType: !139, size: 64, align: 64, offset: 512)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !188, file: !24, line: 291, baseType: !197, size: 64, align: 64, offset: 576)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !37, file: !24, line: 352, baseType: !217, size: 64, align: 64, offset: 896)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !24, line: 298, baseType: !219)
!219 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 294, size: 192, align: 64, elements: !220)
!220 = !{!221, !222, !223}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !219, file: !24, line: 295, baseType: !191, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !219, file: !24, line: 296, baseType: !139, size: 64, align: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !219, file: !24, line: 297, baseType: !224, size: 64, align: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !24, line: 174, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64, align: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!61, !22, !22, !22}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !37, file: !24, line: 356, baseType: !229, size: 64, align: 64, offset: 960)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !24, line: 321, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!233, !22}
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !29, line: 186, baseType: !28)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !37, file: !24, line: 357, baseType: !148, size: 64, align: 64, offset: 1024)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !37, file: !24, line: 358, baseType: !129, size: 64, align: 64, offset: 1088)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !37, file: !24, line: 359, baseType: !237, size: 64, align: 64, offset: 1152)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !24, line: 317, baseType: !140)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !37, file: !24, line: 360, baseType: !239, size: 64, align: 64, offset: 1216)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !24, line: 319, baseType: !225)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !37, file: !24, line: 363, baseType: !241, size: 64, align: 64, offset: 1280)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !24, line: 304, baseType: !243)
!243 = !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 301, size: 128, align: 64, elements: !244)
!244 = !{!245, !266}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !243, file: !24, line: 302, baseType: !246, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !24, line: 193, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!61, !22, !250, !61}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !24, line: 191, baseType: !252)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !24, line: 178, size: 640, align: 64, elements: !253)
!253 = !{!254, !255, !256, !257, !258, !259, !260, !261, !263, !264, !265}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !252, file: !24, line: 179, baseType: !107, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !252, file: !24, line: 180, baseType: !22, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !252, file: !24, line: 181, baseType: !28, size: 64, align: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !252, file: !24, line: 182, baseType: !28, size: 64, align: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !252, file: !24, line: 184, baseType: !61, size: 32, align: 32, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !252, file: !24, line: 185, baseType: !61, size: 32, align: 32, offset: 288)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !252, file: !24, line: 186, baseType: !69, size: 64, align: 64, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !252, file: !24, line: 187, baseType: !262, size: 64, align: 64, offset: 384)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !252, file: !24, line: 188, baseType: !262, size: 64, align: 64, offset: 448)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !252, file: !24, line: 189, baseType: !262, size: 64, align: 64, offset: 512)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !252, file: !24, line: 190, baseType: !107, size: 64, align: 64, offset: 576)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !243, file: !24, line: 303, baseType: !267, size: 64, align: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !24, line: 194, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !22, !250}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !37, file: !24, line: 366, baseType: !21, size: 64, align: 64, offset: 1344)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !37, file: !24, line: 368, baseType: !46, size: 64, align: 64, offset: 1408)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !37, file: !24, line: 372, baseType: !274, size: 64, align: 64, offset: 1472)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !24, line: 233, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!61, !22, !278, !107}
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !24, line: 232, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!61, !22, !107}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !37, file: !24, line: 375, baseType: !157, size: 64, align: 64, offset: 1536)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !37, file: !24, line: 379, baseType: !284, size: 64, align: 64, offset: 1600)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !24, line: 322, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!22, !22, !22, !61}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !37, file: !24, line: 382, baseType: !28, size: 64, align: 64, offset: 1664)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !37, file: !24, line: 385, baseType: !290, size: 64, align: 64, offset: 1728)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !24, line: 323, baseType: !130)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !37, file: !24, line: 386, baseType: !292, size: 64, align: 64, offset: 1792)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !24, line: 324, baseType: !130)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !37, file: !24, line: 389, baseType: !294, size: 64, align: 64, offset: 1856)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !296, line: 40, size: 256, align: 64, elements: !297)
!296 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!297 = !{!298, !299, !301, !302}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !295, file: !296, line: 41, baseType: !46, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !295, file: !296, line: 42, baseType: !300, size: 64, align: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !296, line: 18, baseType: !140)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !295, file: !296, line: 43, baseType: !61, size: 32, align: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !295, file: !296, line: 45, baseType: !46, size: 64, align: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !37, file: !24, line: 390, baseType: !304, size: 64, align: 64, offset: 1920)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !24, line: 390, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !37, file: !24, line: 391, baseType: !307, size: 64, align: 64, offset: 1984)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !309, line: 11, size: 320, align: 64, elements: !310)
!309 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!310 = !{!311, !312, !317, !322, !323}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !308, file: !309, line: 12, baseType: !69, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !308, file: !309, line: 13, baseType: !313, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !309, line: 8, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!22, !22, !107}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !308, file: !309, line: 14, baseType: !318, size: 64, align: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !309, line: 9, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!61, !22, !22, !107}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !308, file: !309, line: 15, baseType: !69, size: 64, align: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !308, file: !309, line: 16, baseType: !107, size: 64, align: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !37, file: !24, line: 392, baseType: !36, size: 64, align: 64, offset: 2048)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !37, file: !24, line: 393, baseType: !22, size: 64, align: 64, offset: 2112)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !37, file: !24, line: 394, baseType: !327, size: 64, align: 64, offset: 2176)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !24, line: 325, baseType: !149)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !37, file: !24, line: 395, baseType: !329, size: 64, align: 64, offset: 2240)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !24, line: 326, baseType: !225)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !37, file: !24, line: 396, baseType: !28, size: 64, align: 64, offset: 2304)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !37, file: !24, line: 397, baseType: !332, size: 64, align: 64, offset: 2368)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !24, line: 327, baseType: !225)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !37, file: !24, line: 398, baseType: !334, size: 64, align: 64, offset: 2432)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !24, line: 329, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!22, !36, !28}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !37, file: !24, line: 399, baseType: !339, size: 64, align: 64, offset: 2496)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !24, line: 328, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!22, !36, !22, !22}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !37, file: !24, line: 400, baseType: !344, size: 64, align: 64, offset: 2560)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !24, line: 307, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64, align: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !107}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !37, file: !24, line: 401, baseType: !157, size: 64, align: 64, offset: 2624)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !37, file: !24, line: 402, baseType: !22, size: 64, align: 64, offset: 2688)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !37, file: !24, line: 403, baseType: !22, size: 64, align: 64, offset: 2752)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !37, file: !24, line: 404, baseType: !22, size: 64, align: 64, offset: 2816)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !37, file: !24, line: 405, baseType: !22, size: 64, align: 64, offset: 2880)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !37, file: !24, line: 406, baseType: !22, size: 64, align: 64, offset: 2944)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !37, file: !24, line: 407, baseType: !52, size: 64, align: 64, offset: 3008)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !37, file: !24, line: 410, baseType: !356, size: 32, align: 32, offset: 3072)
!356 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !37, file: !24, line: 412, baseType: !52, size: 64, align: 64, offset: 3136)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !360, line: 40, baseType: !361)
!360 = !DIFile(filename: "Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!361 = !DICompositeType(tag: DW_TAG_structure_type, file: !360, line: 23, size: 320, align: 64, elements: !362)
!362 = !{!363, !364, !366}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !361, file: !360, line: 24, baseType: !40, size: 192, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !361, file: !360, line: 26, baseType: !365, size: 64, align: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !361, file: !360, line: 39, baseType: !28, size: 64, align: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyGC_Head", file: !370, line: 253, baseType: !371)
!370 = !DIFile(filename: "Include/objimpl.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!371 = !DICompositeType(tag: DW_TAG_union_type, name: "_gc_head", file: !370, line: 246, size: 192, align: 64, elements: !372)
!372 = !{!373, !380}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !371, file: !370, line: 251, baseType: !374, size: 192, align: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, scope: !371, file: !370, line: 247, size: 192, align: 64, elements: !375)
!375 = !{!376, !378, !379}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "gc_next", scope: !374, file: !370, line: 248, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "gc_prev", scope: !374, file: !370, line: 249, baseType: !377, size: 64, align: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "gc_refs", scope: !374, file: !370, line: 250, baseType: !28, size: 64, align: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !371, file: !370, line: 252, baseType: !381, size: 64, align: 64)
!381 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !384, line: 33, baseType: !385)
!384 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!385 = !DICompositeType(tag: DW_TAG_structure_type, file: !384, line: 25, size: 256, align: 64, elements: !386)
!386 = !{!387, !388}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !385, file: !384, line: 26, baseType: !40, size: 192, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !385, file: !384, line: 27, baseType: !389, size: 64, align: 64, offset: 192)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, align: 64, elements: !99)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyThreadState", file: !392, line: 139, baseType: !393)
!392 = !DIFile(filename: "Include/pystate.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ts", file: !392, line: 69, size: 1536, align: 64, elements: !394)
!394 = !{!395, !397, !398, !418, !421, !422, !423, !424, !425, !426, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !393, file: !392, line: 72, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !393, file: !392, line: 73, baseType: !396, size: 64, align: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "interp", scope: !393, file: !392, line: 74, baseType: !399, size: 64, align: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyInterpreterState", file: !392, line: 44, baseType: !401)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "_is", file: !392, line: 19, size: 832, align: 64, elements: !402)
!402 = !{!403, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !401, file: !392, line: 21, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tstate_head", scope: !401, file: !392, line: 22, baseType: !396, size: 64, align: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "modules", scope: !401, file: !392, line: 24, baseType: !22, size: 64, align: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "modules_by_index", scope: !401, file: !392, line: 25, baseType: !22, size: 64, align: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "sysdict", scope: !401, file: !392, line: 26, baseType: !22, size: 64, align: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "builtins", scope: !401, file: !392, line: 27, baseType: !22, size: 64, align: 64, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "importlib", scope: !401, file: !392, line: 28, baseType: !22, size: 64, align: 64, offset: 384)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_path", scope: !401, file: !392, line: 30, baseType: !22, size: 64, align: 64, offset: 448)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "codec_search_cache", scope: !401, file: !392, line: 31, baseType: !22, size: 64, align: 64, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "codec_error_registry", scope: !401, file: !392, line: 32, baseType: !22, size: 64, align: 64, offset: 576)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "codecs_initialized", scope: !401, file: !392, line: 33, baseType: !61, size: 32, align: 32, offset: 640)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "fscodec_initialized", scope: !401, file: !392, line: 34, baseType: !61, size: 32, align: 32, offset: 672)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "dlopenflags", scope: !401, file: !392, line: 37, baseType: !61, size: 32, align: 32, offset: 704)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "builtins_copy", scope: !401, file: !392, line: 43, baseType: !22, size: 64, align: 64, offset: 768)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !393, file: !392, line: 76, baseType: !419, size: 64, align: 64, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "_frame", file: !392, line: 50, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_depth", scope: !393, file: !392, line: 77, baseType: !61, size: 32, align: 32, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "overflowed", scope: !393, file: !392, line: 78, baseType: !48, size: 8, align: 8, offset: 288)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "recursion_critical", scope: !393, file: !392, line: 80, baseType: !48, size: 8, align: 8, offset: 296)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tracing", scope: !393, file: !392, line: 85, baseType: !61, size: 32, align: 32, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "use_tracing", scope: !393, file: !392, line: 86, baseType: !61, size: 32, align: 32, offset: 352)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "c_profilefunc", scope: !393, file: !392, line: 88, baseType: !427, size: 64, align: 64, offset: 384)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_tracefunc", file: !392, line: 54, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!61, !22, !419, !61, !22}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "c_tracefunc", scope: !393, file: !392, line: 89, baseType: !427, size: 64, align: 64, offset: 448)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "c_profileobj", scope: !393, file: !392, line: 90, baseType: !22, size: 64, align: 64, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "c_traceobj", scope: !393, file: !392, line: 91, baseType: !22, size: 64, align: 64, offset: 576)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_type", scope: !393, file: !392, line: 93, baseType: !22, size: 64, align: 64, offset: 640)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_value", scope: !393, file: !392, line: 94, baseType: !22, size: 64, align: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "curexc_traceback", scope: !393, file: !392, line: 95, baseType: !22, size: 64, align: 64, offset: 768)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "exc_type", scope: !393, file: !392, line: 97, baseType: !22, size: 64, align: 64, offset: 832)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "exc_value", scope: !393, file: !392, line: 98, baseType: !22, size: 64, align: 64, offset: 896)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "exc_traceback", scope: !393, file: !392, line: 99, baseType: !22, size: 64, align: 64, offset: 960)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "dict", scope: !393, file: !392, line: 101, baseType: !22, size: 64, align: 64, offset: 1024)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "gilstate_counter", scope: !393, file: !392, line: 103, baseType: !61, size: 32, align: 32, offset: 1088)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "async_exc", scope: !393, file: !392, line: 105, baseType: !22, size: 64, align: 64, offset: 1152)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !393, file: !392, line: 106, baseType: !34, size: 64, align: 64, offset: 1216)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_nesting", scope: !393, file: !392, line: 108, baseType: !61, size: 32, align: 32, offset: 1280)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "trash_delete_later", scope: !393, file: !392, line: 109, baseType: !22, size: 64, align: 64, offset: 1344)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete", scope: !393, file: !392, line: 134, baseType: !345, size: 64, align: 64, offset: 1408)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "on_delete_data", scope: !393, file: !392, line: 135, baseType: !107, size: 64, align: 64, offset: 1472)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "listreviterobject", file: !450, line: 2827, baseType: !451)
!450 = !DIFile(filename: "Objects/listobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!451 = !DICompositeType(tag: DW_TAG_structure_type, file: !450, line: 2823, size: 256, align: 64, elements: !452)
!452 = !{!453, !454, !455}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !451, file: !450, line: 2824, baseType: !23, size: 128, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "it_index", scope: !451, file: !450, line: 2825, baseType: !28, size: 64, align: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "it_seq", scope: !451, file: !450, line: 2826, baseType: !358, size: 64, align: 64, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "listiterobject", file: !450, line: 2673, baseType: !458)
!458 = !DICompositeType(tag: DW_TAG_structure_type, file: !450, line: 2669, size: 256, align: 64, elements: !459)
!459 = !{!460, !461, !462}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !458, file: !450, line: 2670, baseType: !23, size: 128, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "it_index", scope: !458, file: !450, line: 2671, baseType: !28, size: 64, align: 64, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "it_seq", scope: !458, file: !450, line: 2672, baseType: !358, size: 64, align: 64, offset: 192)
!463 = !{!464, !470, !474, !479, !494, !497, !501, !527, !532, !536, !543, !551, !557, !562, !566, !573, !583, !592, !599, !615, !671, !716, !794, !802, !808, !818, !825, !843, !852, !863, !881, !897, !915, !922, !931, !937, !944, !952, !970, !974, !978, !984, !989, !997, !1028, !1037, !1042, !1045, !1095, !1100, !1117, !1130, !1134, !1142, !1148, !1155, !1171, !1190, !1248, !1262, !1277, !1298, !1303, !1307, !1310, !1313, !1317, !1323, !1334, !1343, !1355, !1365, !1368, !1379, !1385, !1388, !1400, !1407, !1413, !1425, !1436, !1443, !1449, !1452, !1459, !1469, !1480}
!464 = !DISubprogram(name: "PyList_ClearFreeList", scope: !450, file: !450, line: 102, type: !465, isLocal: false, isDefinition: true, scopeLine: 103, flags: DIFlagPrototyped, isOptimized: true, function: i32 ()* @PyList_ClearFreeList, variables: !467)
!465 = !DISubroutineType(types: !466)
!466 = !{!61}
!467 = !{!468, !469}
!468 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !464, file: !450, line: 104, type: !358)
!469 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !464, file: !450, line: 105, type: !61)
!470 = !DISubprogram(name: "PyList_Fini", scope: !450, file: !450, line: 115, type: !471, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: true, function: void ()* @PyList_Fini, variables: !473)
!471 = !DISubroutineType(types: !472)
!472 = !{null}
!473 = !{}
!474 = !DISubprogram(name: "_PyList_DebugMallocStats", scope: !450, file: !450, line: 122, type: !475, isLocal: false, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._IO_FILE*)* @_PyList_DebugMallocStats, variables: !477)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !62}
!477 = !{!478}
!478 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "out", arg: 1, scope: !474, file: !450, line: 122, type: !62)
!479 = !DISubprogram(name: "PyList_New", scope: !450, file: !450, line: 130, type: !480, isLocal: false, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i64)* @PyList_New, variables: !482)
!480 = !DISubroutineType(types: !481)
!481 = !{!22, !28}
!482 = !{!483, !484, !485, !486, !492}
!483 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !479, file: !450, line: 130, type: !28)
!484 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "op", scope: !479, file: !450, line: 132, type: !358)
!485 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nbytes", scope: !479, file: !450, line: 133, type: !19)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !487, file: !450, line: 171, type: !22)
!487 = distinct !DILexicalBlock(scope: !488, file: !450, line: 171, column: 16)
!488 = distinct !DILexicalBlock(scope: !489, file: !450, line: 170, column: 40)
!489 = distinct !DILexicalBlock(scope: !490, file: !450, line: 170, column: 13)
!490 = distinct !DILexicalBlock(scope: !491, file: !450, line: 168, column: 10)
!491 = distinct !DILexicalBlock(scope: !479, file: !450, line: 166, column: 9)
!492 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !493, file: !450, line: 178, type: !368)
!493 = distinct !DILexicalBlock(scope: !479, file: !450, line: 178, column: 8)
!494 = !DISubprogram(name: "PyList_Size", scope: !450, file: !450, line: 183, type: !193, isLocal: false, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyList_Size, variables: !495)
!495 = !{!496}
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !494, file: !450, line: 183, type: !22)
!497 = !DISubprogram(name: "PyList_GetItem", scope: !450, file: !450, line: 196, type: !199, isLocal: false, isDefinition: true, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i64)* @PyList_GetItem, variables: !498)
!498 = !{!499, !500}
!499 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !497, file: !450, line: 196, type: !22)
!500 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !497, file: !450, line: 196, type: !28)
!501 = !DISubprogram(name: "PyList_SetItem", scope: !450, file: !450, line: 216, type: !206, isLocal: false, isDefinition: true, scopeLine: 218, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64, %struct._object*)* @PyList_SetItem, variables: !502)
!502 = !{!503, !504, !505, !506, !507, !508, !512, !515, !519, !522, !524}
!503 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !501, file: !450, line: 216, type: !22)
!504 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !501, file: !450, line: 216, type: !28)
!505 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newitem", arg: 3, scope: !501, file: !450, line: 217, type: !22)
!506 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "olditem", scope: !501, file: !450, line: 219, type: !22)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !501, file: !450, line: 220, type: !365)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !509, file: !450, line: 222, type: !22)
!509 = distinct !DILexicalBlock(scope: !510, file: !450, line: 222, column: 12)
!510 = distinct !DILexicalBlock(scope: !511, file: !450, line: 221, column: 77)
!511 = distinct !DILexicalBlock(scope: !501, file: !450, line: 221, column: 9)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !513, file: !450, line: 222, type: !22)
!513 = distinct !DILexicalBlock(scope: !514, file: !450, line: 222, column: 103)
!514 = distinct !DILexicalBlock(scope: !509, file: !450, line: 222, column: 69)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !516, file: !450, line: 227, type: !22)
!516 = distinct !DILexicalBlock(scope: !517, file: !450, line: 227, column: 12)
!517 = distinct !DILexicalBlock(scope: !518, file: !450, line: 226, column: 56)
!518 = distinct !DILexicalBlock(scope: !501, file: !450, line: 226, column: 9)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !520, file: !450, line: 227, type: !22)
!520 = distinct !DILexicalBlock(scope: !521, file: !450, line: 227, column: 103)
!521 = distinct !DILexicalBlock(scope: !516, file: !450, line: 227, column: 69)
!522 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !523, file: !450, line: 235, type: !22)
!523 = distinct !DILexicalBlock(scope: !501, file: !450, line: 235, column: 8)
!524 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !525, file: !450, line: 235, type: !22)
!525 = distinct !DILexicalBlock(scope: !526, file: !450, line: 235, column: 99)
!526 = distinct !DILexicalBlock(scope: !523, file: !450, line: 235, column: 65)
!527 = !DISubprogram(name: "PyList_Insert", scope: !450, file: !450, line: 273, type: !206, isLocal: false, isDefinition: true, scopeLine: 274, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64, %struct._object*)* @PyList_Insert, variables: !528)
!528 = !{!529, !530, !531}
!529 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !527, file: !450, line: 273, type: !22)
!530 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "where", arg: 2, scope: !527, file: !450, line: 273, type: !28)
!531 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newitem", arg: 3, scope: !527, file: !450, line: 273, type: !22)
!532 = !DISubprogram(name: "PyList_Append", scope: !450, file: !450, line: 303, type: !212, isLocal: false, isDefinition: true, scopeLine: 304, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, %struct._object*)* @PyList_Append, variables: !533)
!533 = !{!534, !535}
!534 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !532, file: !450, line: 303, type: !22)
!535 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newitem", arg: 2, scope: !532, file: !450, line: 303, type: !22)
!536 = !DISubprogram(name: "PyList_GetSlice", scope: !450, file: !450, line: 461, type: !537, isLocal: false, isDefinition: true, scopeLine: 462, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i64, i64)* @PyList_GetSlice, variables: !539)
!537 = !DISubroutineType(types: !538)
!538 = !{!22, !22, !28, !28}
!539 = !{!540, !541, !542}
!540 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !536, file: !450, line: 461, type: !22)
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ilow", arg: 2, scope: !536, file: !450, line: 461, type: !28)
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ihigh", arg: 3, scope: !536, file: !450, line: 461, type: !28)
!543 = !DISubprogram(name: "PyList_SetSlice", scope: !450, file: !450, line: 682, type: !544, isLocal: false, isDefinition: true, scopeLine: 683, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i64, i64, %struct._object*)* @PyList_SetSlice, variables: !546)
!544 = !DISubroutineType(types: !545)
!545 = !{!61, !22, !28, !28, !22}
!546 = !{!547, !548, !549, !550}
!547 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !543, file: !450, line: 682, type: !22)
!548 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ilow", arg: 2, scope: !543, file: !450, line: 682, type: !28)
!549 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ihigh", arg: 3, scope: !543, file: !450, line: 682, type: !28)
!550 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 4, scope: !543, file: !450, line: 682, type: !22)
!551 = !DISubprogram(name: "_PyList_Extend", scope: !450, file: !450, line: 893, type: !552, isLocal: false, isDefinition: true, scopeLine: 894, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyListObject*, %struct._object*)* @_PyList_Extend, variables: !554)
!552 = !DISubroutineType(types: !553)
!553 = !{!22, !358, !22}
!554 = !{!555, !556}
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !551, file: !450, line: 893, type: !358)
!556 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !551, file: !450, line: 893, type: !22)
!557 = !DISubprogram(name: "PyList_Sort", scope: !450, file: !450, line: 2084, type: !159, isLocal: false, isDefinition: true, scopeLine: 2085, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @PyList_Sort, variables: !558)
!558 = !{!559, !560}
!559 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !557, file: !450, line: 2084, type: !22)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !561, file: !450, line: 2093, type: !22)
!561 = distinct !DILexicalBlock(scope: !557, file: !450, line: 2093, column: 8)
!562 = !DISubprogram(name: "PyList_Reverse", scope: !450, file: !450, line: 2106, type: !159, isLocal: false, isDefinition: true, scopeLine: 2107, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @PyList_Reverse, variables: !563)
!563 = !{!564, !565}
!564 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !562, file: !450, line: 2106, type: !22)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "self", scope: !562, file: !450, line: 2108, type: !358)
!566 = !DISubprogram(name: "PyList_AsTuple", scope: !450, file: !450, line: 2120, type: !131, isLocal: false, isDefinition: true, scopeLine: 2121, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*)* @PyList_AsTuple, variables: !567)
!567 = !{!568, !569, !570, !571, !572}
!568 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !566, file: !450, line: 2120, type: !22)
!569 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !566, file: !450, line: 2122, type: !22)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !566, file: !450, line: 2123, type: !365)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !566, file: !450, line: 2123, type: !365)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !566, file: !450, line: 2124, type: !28)
!573 = !DISubprogram(name: "ins1", scope: !450, file: !450, line: 240, type: !574, isLocal: true, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyListObject*, i64, %struct._object*)* @ins1, variables: !576)
!574 = !DISubroutineType(types: !575)
!575 = !{!61, !358, !28, !22}
!576 = !{!577, !578, !579, !580, !581, !582}
!577 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !573, file: !450, line: 240, type: !358)
!578 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "where", arg: 2, scope: !573, file: !450, line: 240, type: !28)
!579 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 3, scope: !573, file: !450, line: 240, type: !22)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !573, file: !450, line: 242, type: !28)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !573, file: !450, line: 242, type: !28)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "items", scope: !573, file: !450, line: 243, type: !365)
!583 = !DISubprogram(name: "list_resize", scope: !450, file: !450, line: 26, type: !584, isLocal: true, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyListObject*, i64)* @list_resize, variables: !586)
!584 = !DISubroutineType(types: !585)
!585 = !{!61, !358, !28}
!586 = !{!587, !588, !589, !590, !591}
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !583, file: !450, line: 26, type: !358)
!588 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "newsize", arg: 2, scope: !583, file: !450, line: 26, type: !28)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "items", scope: !583, file: !450, line: 28, type: !365)
!590 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new_allocated", scope: !583, file: !450, line: 29, type: !19)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "allocated", scope: !583, file: !450, line: 30, type: !28)
!592 = !DISubprogram(name: "app1", scope: !450, file: !450, line: 283, type: !593, isLocal: true, isDefinition: true, scopeLine: 284, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyListObject*, %struct._object*)* @app1, variables: !595)
!593 = !DISubroutineType(types: !594)
!594 = !{!61, !358, !22}
!595 = !{!596, !597, !598}
!596 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !592, file: !450, line: 283, type: !358)
!597 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 2, scope: !592, file: !450, line: 283, type: !22)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !592, file: !450, line: 285, type: !28)
!599 = !DISubprogram(name: "list_slice", scope: !450, file: !450, line: 432, type: !600, isLocal: true, isDefinition: true, scopeLine: 433, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyListObject*, i64, i64)* @list_slice, variables: !602)
!600 = !DISubroutineType(types: !601)
!601 = !{!22, !358, !28, !28}
!602 = !{!603, !604, !605, !606, !607, !608, !609, !610, !611}
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !599, file: !450, line: 432, type: !358)
!604 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ilow", arg: 2, scope: !599, file: !450, line: 432, type: !28)
!605 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ihigh", arg: 3, scope: !599, file: !450, line: 432, type: !28)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "np", scope: !599, file: !450, line: 434, type: !358)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "src", scope: !599, file: !450, line: 435, type: !365)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !599, file: !450, line: 435, type: !365)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !599, file: !450, line: 436, type: !28)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !599, file: !450, line: 436, type: !28)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !612, file: !450, line: 453, type: !22)
!612 = distinct !DILexicalBlock(scope: !613, file: !450, line: 452, column: 31)
!613 = distinct !DILexicalBlock(scope: !614, file: !450, line: 452, column: 5)
!614 = distinct !DILexicalBlock(scope: !599, file: !450, line: 452, column: 5)
!615 = !DISubprogram(name: "list_ass_slice", scope: !450, file: !450, line: 579, type: !616, isLocal: true, isDefinition: true, scopeLine: 580, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.PyListObject*, i64, i64, %struct._object*)* @list_ass_slice, variables: !618)
!616 = !DISubroutineType(types: !617)
!617 = !{!61, !358, !28, !28, !22}
!618 = !{!619, !620, !621, !622, !623, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !643, !647, !650, !653, !657, !659, !663, !666, !668}
!619 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !615, file: !450, line: 579, type: !358)
!620 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ilow", arg: 2, scope: !615, file: !450, line: 579, type: !28)
!621 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ihigh", arg: 3, scope: !615, file: !450, line: 579, type: !28)
!622 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 4, scope: !615, file: !450, line: 579, type: !22)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "recycle_on_stack", scope: !615, file: !450, line: 587, type: !624)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 512, align: 64, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 8)
!627 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "recycle", scope: !615, file: !450, line: 588, type: !365)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !615, file: !450, line: 589, type: !365)
!629 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "vitem", scope: !615, file: !450, line: 590, type: !365)
!630 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v_as_SF", scope: !615, file: !450, line: 591, type: !22)
!631 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !615, file: !450, line: 592, type: !28)
!632 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "norig", scope: !615, file: !450, line: 593, type: !28)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !615, file: !450, line: 594, type: !28)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !615, file: !450, line: 595, type: !28)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !615, file: !450, line: 596, type: !19)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !615, file: !450, line: 597, type: !61)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !638, file: !450, line: 608, type: !22)
!638 = distinct !DILexicalBlock(scope: !639, file: !450, line: 608, column: 16)
!639 = distinct !DILexicalBlock(scope: !640, file: !450, line: 602, column: 39)
!640 = distinct !DILexicalBlock(scope: !641, file: !450, line: 602, column: 13)
!641 = distinct !DILexicalBlock(scope: !642, file: !450, line: 601, column: 10)
!642 = distinct !DILexicalBlock(scope: !615, file: !450, line: 599, column: 9)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !644, file: !450, line: 631, type: !22)
!644 = distinct !DILexicalBlock(scope: !645, file: !450, line: 631, column: 12)
!645 = distinct !DILexicalBlock(scope: !646, file: !450, line: 630, column: 50)
!646 = distinct !DILexicalBlock(scope: !615, file: !450, line: 630, column: 9)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !648, file: !450, line: 631, type: !22)
!648 = distinct !DILexicalBlock(scope: !649, file: !450, line: 631, column: 103)
!649 = distinct !DILexicalBlock(scope: !644, file: !450, line: 631, column: 69)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tail", scope: !651, file: !450, line: 647, type: !28)
!651 = distinct !DILexicalBlock(scope: !652, file: !450, line: 646, column: 16)
!652 = distinct !DILexicalBlock(scope: !615, file: !450, line: 646, column: 9)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !654, file: !450, line: 666, type: !22)
!654 = distinct !DILexicalBlock(scope: !655, file: !450, line: 665, column: 37)
!655 = distinct !DILexicalBlock(scope: !656, file: !450, line: 665, column: 5)
!656 = distinct !DILexicalBlock(scope: !615, file: !450, line: 665, column: 5)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !658, file: !450, line: 667, type: !22)
!658 = distinct !DILexicalBlock(scope: !654, file: !450, line: 667, column: 12)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !660, file: !450, line: 671, type: !22)
!660 = distinct !DILexicalBlock(scope: !661, file: !450, line: 671, column: 12)
!661 = distinct !DILexicalBlock(scope: !662, file: !450, line: 670, column: 5)
!662 = distinct !DILexicalBlock(scope: !615, file: !450, line: 670, column: 5)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !664, file: !450, line: 671, type: !22)
!664 = distinct !DILexicalBlock(scope: !665, file: !450, line: 671, column: 106)
!665 = distinct !DILexicalBlock(scope: !660, file: !450, line: 671, column: 72)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !667, file: !450, line: 676, type: !22)
!667 = distinct !DILexicalBlock(scope: !615, file: !450, line: 676, column: 8)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !669, file: !450, line: 676, type: !22)
!669 = distinct !DILexicalBlock(scope: !670, file: !450, line: 676, column: 99)
!670 = distinct !DILexicalBlock(scope: !667, file: !450, line: 676, column: 65)
!671 = !DISubprogram(name: "listextend", scope: !450, file: !450, line: 782, type: !552, isLocal: true, isDefinition: true, scopeLine: 783, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyListObject*, %struct._object*)* @listextend, variables: !672)
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680, !681, !684, !685, !689, !693, !697, !699, !703, !707, !710, !712, !714}
!673 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !671, file: !450, line: 782, type: !358)
!674 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !671, file: !450, line: 782, type: !22)
!675 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !671, file: !450, line: 784, type: !22)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !671, file: !450, line: 785, type: !28)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !671, file: !450, line: 786, type: !28)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mn", scope: !671, file: !450, line: 787, type: !28)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !671, file: !450, line: 788, type: !28)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iternext", scope: !671, file: !450, line: 789, type: !130)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "src", scope: !682, file: !450, line: 796, type: !365)
!682 = distinct !DILexicalBlock(scope: !683, file: !450, line: 795, column: 131)
!683 = distinct !DILexicalBlock(scope: !671, file: !450, line: 795, column: 9)
!684 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !682, file: !450, line: 796, type: !365)
!685 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !686, file: !450, line: 803, type: !22)
!686 = distinct !DILexicalBlock(scope: !687, file: !450, line: 803, column: 16)
!687 = distinct !DILexicalBlock(scope: !688, file: !450, line: 801, column: 21)
!688 = distinct !DILexicalBlock(scope: !682, file: !450, line: 801, column: 13)
!689 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !690, file: !450, line: 808, type: !22)
!690 = distinct !DILexicalBlock(scope: !691, file: !450, line: 808, column: 16)
!691 = distinct !DILexicalBlock(scope: !692, file: !450, line: 807, column: 45)
!692 = distinct !DILexicalBlock(scope: !682, file: !450, line: 807, column: 13)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !694, file: !450, line: 820, type: !22)
!694 = distinct !DILexicalBlock(scope: !695, file: !450, line: 819, column: 33)
!695 = distinct !DILexicalBlock(scope: !696, file: !450, line: 819, column: 9)
!696 = distinct !DILexicalBlock(scope: !682, file: !450, line: 819, column: 9)
!697 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !698, file: !450, line: 824, type: !22)
!698 = distinct !DILexicalBlock(scope: !682, file: !450, line: 824, column: 12)
!699 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !700, file: !450, line: 836, type: !22)
!700 = distinct !DILexicalBlock(scope: !701, file: !450, line: 836, column: 12)
!701 = distinct !DILexicalBlock(scope: !702, file: !450, line: 835, column: 18)
!702 = distinct !DILexicalBlock(scope: !671, file: !450, line: 835, column: 9)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !704, file: !450, line: 855, type: !22)
!704 = distinct !DILexicalBlock(scope: !705, file: !450, line: 854, column: 14)
!705 = distinct !DILexicalBlock(scope: !706, file: !450, line: 854, column: 5)
!706 = distinct !DILexicalBlock(scope: !671, file: !450, line: 854, column: 5)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "status", scope: !708, file: !450, line: 871, type: !61)
!708 = distinct !DILexicalBlock(scope: !709, file: !450, line: 870, column: 14)
!709 = distinct !DILexicalBlock(scope: !704, file: !450, line: 865, column: 13)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !711, file: !450, line: 872, type: !22)
!711 = distinct !DILexicalBlock(scope: !708, file: !450, line: 872, column: 16)
!712 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !713, file: !450, line: 884, type: !22)
!713 = distinct !DILexicalBlock(scope: !671, file: !450, line: 884, column: 8)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !715, file: !450, line: 888, type: !22)
!715 = distinct !DILexicalBlock(scope: !671, file: !450, line: 888, column: 8)
!716 = !DISubprogram(name: "listsort", scope: !450, file: !450, line: 1909, type: !717, isLocal: true, isDefinition: true, scopeLine: 1910, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.PyListObject*, %struct._object*, %struct._object*)* @listsort, variables: !719)
!717 = !DISubroutineType(types: !718)
!718 = !{!22, !358, !22, !22}
!719 = !{!720, !721, !722, !723, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !771, !773, !774, !778, !784, !789, !792}
!720 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !716, file: !450, line: 1909, type: !358)
!721 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !716, file: !450, line: 1909, type: !22)
!722 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "kwds", arg: 3, scope: !716, file: !450, line: 1909, type: !22)
!723 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ms", scope: !716, file: !450, line: 1911, type: !724)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "MergeState", file: !450, line: 1406, baseType: !725)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "s_MergeState", file: !450, line: 1379, size: 33024, align: 64, elements: !726)
!726 = !{!727, !728, !734, !735, !736, !744}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "min_gallop", scope: !725, file: !450, line: 1384, baseType: !28, size: 64, align: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !725, file: !450, line: 1389, baseType: !729, size: 128, align: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "sortslice", file: !450, line: 981, baseType: !730)
!730 = !DICompositeType(tag: DW_TAG_structure_type, file: !450, line: 978, size: 128, align: 64, elements: !731)
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !730, file: !450, line: 979, baseType: !365, size: 64, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !730, file: !450, line: 980, baseType: !365, size: 64, align: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "alloced", scope: !725, file: !450, line: 1390, baseType: !28, size: 64, align: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !725, file: !450, line: 1401, baseType: !61, size: 32, align: 32, offset: 256)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !725, file: !450, line: 1402, baseType: !737, size: 16320, align: 64, offset: 320)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !738, size: 16320, align: 64, elements: !742)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "s_slice", file: !450, line: 1374, size: 192, align: 64, elements: !739)
!739 = !{!740, !741}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !738, file: !450, line: 1375, baseType: !729, size: 128, align: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !738, file: !450, line: 1376, baseType: !28, size: 64, align: 64, offset: 128)
!742 = !{!743}
!743 = !DISubrange(count: 85)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "temparray", scope: !725, file: !450, line: 1405, baseType: !745, size: 16384, align: 64, offset: 16640)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 16384, align: 64, elements: !746)
!746 = !{!747}
!747 = !DISubrange(count: 256)
!748 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nremaining", scope: !716, file: !450, line: 1912, type: !28)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "minrun", scope: !716, file: !450, line: 1913, type: !28)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lo", scope: !716, file: !450, line: 1914, type: !729)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "saved_ob_size", scope: !716, file: !450, line: 1915, type: !28)
!752 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "saved_allocated", scope: !716, file: !450, line: 1915, type: !28)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "saved_ob_item", scope: !716, file: !450, line: 1916, type: !365)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "final_ob_item", scope: !716, file: !450, line: 1917, type: !365)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !716, file: !450, line: 1918, type: !22)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reverse", scope: !716, file: !450, line: 1919, type: !61)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "keyfunc", scope: !716, file: !450, line: 1920, type: !22)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !716, file: !450, line: 1921, type: !28)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "keys", scope: !716, file: !450, line: 1923, type: !365)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !761, file: !450, line: 1972, type: !22)
!761 = distinct !DILexicalBlock(scope: !762, file: !450, line: 1972, column: 24)
!762 = distinct !DILexicalBlock(scope: !763, file: !450, line: 1971, column: 17)
!763 = distinct !DILexicalBlock(scope: !764, file: !450, line: 1971, column: 17)
!764 = distinct !DILexicalBlock(scope: !765, file: !450, line: 1970, column: 40)
!765 = distinct !DILexicalBlock(scope: !766, file: !450, line: 1970, column: 17)
!766 = distinct !DILexicalBlock(scope: !767, file: !450, line: 1967, column: 46)
!767 = distinct !DILexicalBlock(scope: !768, file: !450, line: 1967, column: 9)
!768 = distinct !DILexicalBlock(scope: !769, file: !450, line: 1967, column: 9)
!769 = distinct !DILexicalBlock(scope: !770, file: !450, line: 1957, column: 10)
!770 = distinct !DILexicalBlock(scope: !716, file: !450, line: 1952, column: 9)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "descending", scope: !772, file: !450, line: 2002, type: !61)
!772 = distinct !DILexicalBlock(scope: !716, file: !450, line: 2001, column: 8)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !772, file: !450, line: 2003, type: !28)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "force", scope: !775, file: !450, line: 2013, type: !777)
!775 = distinct !DILexicalBlock(scope: !776, file: !450, line: 2012, column: 25)
!776 = distinct !DILexicalBlock(scope: !772, file: !450, line: 2012, column: 13)
!777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !779, file: !450, line: 2045, type: !22)
!779 = distinct !DILexicalBlock(scope: !780, file: !450, line: 2045, column: 16)
!780 = distinct !DILexicalBlock(scope: !781, file: !450, line: 2044, column: 9)
!781 = distinct !DILexicalBlock(scope: !782, file: !450, line: 2044, column: 9)
!782 = distinct !DILexicalBlock(scope: !783, file: !450, line: 2043, column: 29)
!783 = distinct !DILexicalBlock(scope: !716, file: !450, line: 2043, column: 9)
!784 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !785, file: !450, line: 2073, type: !22)
!785 = distinct !DILexicalBlock(scope: !786, file: !450, line: 2073, column: 16)
!786 = distinct !DILexicalBlock(scope: !787, file: !450, line: 2072, column: 26)
!787 = distinct !DILexicalBlock(scope: !788, file: !450, line: 2069, column: 38)
!788 = distinct !DILexicalBlock(scope: !716, file: !450, line: 2069, column: 9)
!789 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !790, file: !450, line: 2073, type: !22)
!790 = distinct !DILexicalBlock(scope: !791, file: !450, line: 2073, column: 116)
!791 = distinct !DILexicalBlock(scope: !785, file: !450, line: 2073, column: 82)
!792 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xincref_tmp", scope: !793, file: !450, line: 2077, type: !22)
!793 = distinct !DILexicalBlock(scope: !716, file: !450, line: 2077, column: 8)
!794 = !DISubprogram(name: "merge_init", scope: !450, file: !450, line: 1410, type: !795, isLocal: true, isDefinition: true, scopeLine: 1411, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.s_MergeState*, i64, i32)* @merge_init, variables: !798)
!795 = !DISubroutineType(types: !796)
!796 = !{null, !797, !28, !61}
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64, align: 64)
!798 = !{!799, !800, !801}
!799 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ms", arg: 1, scope: !794, file: !450, line: 1410, type: !797)
!800 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "list_size", arg: 2, scope: !794, file: !450, line: 1410, type: !28)
!801 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "has_keyfunc", arg: 3, scope: !794, file: !450, line: 1410, type: !61)
!802 = !DISubprogram(name: "merge_compute_minrun", scope: !450, file: !450, line: 1883, type: !803, isLocal: true, isDefinition: true, scopeLine: 1884, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i64)* @merge_compute_minrun, variables: !805)
!803 = !DISubroutineType(types: !804)
!804 = !{!28, !28}
!805 = !{!806, !807}
!806 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !802, file: !450, line: 1883, type: !28)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !802, file: !450, line: 1885, type: !28)
!808 = !DISubprogram(name: "count_run", scope: !450, file: !450, line: 1133, type: !809, isLocal: true, isDefinition: true, scopeLine: 1134, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object**, %struct._object**, i32*)* @count_run, variables: !812)
!809 = !DISubroutineType(types: !810)
!810 = !{!28, !365, !365, !811}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!812 = !{!813, !814, !815, !816, !817}
!813 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lo", arg: 1, scope: !808, file: !450, line: 1133, type: !365)
!814 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hi", arg: 2, scope: !808, file: !450, line: 1133, type: !365)
!815 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "descending", arg: 3, scope: !808, file: !450, line: 1133, type: !811)
!816 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !808, file: !450, line: 1135, type: !28)
!817 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !808, file: !450, line: 1136, type: !28)
!818 = !DISubprogram(name: "reverse_sortslice", scope: !450, file: !450, line: 1896, type: !819, isLocal: true, isDefinition: true, scopeLine: 1897, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.sortslice*, i64)* @reverse_sortslice, variables: !822)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !821, !28}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64, align: 64)
!822 = !{!823, !824}
!823 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !818, file: !450, line: 1896, type: !821)
!824 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !818, file: !450, line: 1896, type: !28)
!825 = !DISubprogram(name: "binarysort", scope: !450, file: !450, line: 1059, type: !826, isLocal: true, isDefinition: true, scopeLine: 1060, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object**, %struct._object**, %struct._object**, %struct._object**)* @binarysort, variables: !828)
!826 = !DISubroutineType(types: !827)
!827 = !{!61, !729, !365, !365}
!828 = !{!829, !830, !831, !832, !833, !834, !835, !836, !837}
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "lo", arg: 1, scope: !825, file: !450, line: 1059, type: !729)
!830 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hi", arg: 2, scope: !825, file: !450, line: 1059, type: !365)
!831 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 3, scope: !825, file: !450, line: 1059, type: !365)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !825, file: !450, line: 1061, type: !28)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !825, file: !450, line: 1062, type: !365)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !825, file: !450, line: 1062, type: !365)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !825, file: !450, line: 1062, type: !365)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pivot", scope: !825, file: !450, line: 1063, type: !22)
!837 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "offset", scope: !838, file: !450, line: 1099, type: !28)
!838 = distinct !DILexicalBlock(scope: !839, file: !450, line: 1098, column: 38)
!839 = distinct !DILexicalBlock(scope: !840, file: !450, line: 1098, column: 13)
!840 = distinct !DILexicalBlock(scope: !841, file: !450, line: 1069, column: 33)
!841 = distinct !DILexicalBlock(scope: !842, file: !450, line: 1069, column: 5)
!842 = distinct !DILexicalBlock(scope: !825, file: !450, line: 1069, column: 5)
!843 = !DISubprogram(name: "merge_collapse", scope: !450, file: !450, line: 1828, type: !844, isLocal: true, isDefinition: true, scopeLine: 1829, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.s_MergeState*)* @merge_collapse, variables: !846)
!844 = !DISubroutineType(types: !845)
!845 = !{!61, !797}
!846 = !{!847, !848, !850}
!847 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ms", arg: 1, scope: !843, file: !450, line: 1828, type: !797)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !843, file: !450, line: 1830, type: !849)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64, align: 64)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !851, file: !450, line: 1834, type: !28)
!851 = distinct !DILexicalBlock(scope: !843, file: !450, line: 1833, column: 23)
!852 = !DISubprogram(name: "merge_at", scope: !450, file: !450, line: 1763, type: !853, isLocal: true, isDefinition: true, scopeLine: 1764, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.s_MergeState*, i64)* @merge_at, variables: !855)
!853 = !DISubroutineType(types: !854)
!854 = !{!28, !797, !28}
!855 = !{!856, !857, !858, !859, !860, !861, !862}
!856 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ms", arg: 1, scope: !852, file: !450, line: 1763, type: !797)
!857 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !852, file: !450, line: 1763, type: !28)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ssa", scope: !852, file: !450, line: 1765, type: !729)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ssb", scope: !852, file: !450, line: 1765, type: !729)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "na", scope: !852, file: !450, line: 1766, type: !28)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nb", scope: !852, file: !450, line: 1766, type: !28)
!862 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !852, file: !450, line: 1767, type: !28)
!863 = !DISubprogram(name: "gallop_right", scope: !450, file: !450, line: 1279, type: !864, isLocal: true, isDefinition: true, scopeLine: 1280, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*, %struct._object**, i64, i64)* @gallop_right, variables: !866)
!864 = !DISubroutineType(types: !865)
!865 = !{!28, !22, !365, !28, !28}
!866 = !{!867, !868, !869, !870, !871, !872, !873, !874, !877, !879}
!867 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !863, file: !450, line: 1279, type: !22)
!868 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !863, file: !450, line: 1279, type: !365)
!869 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 3, scope: !863, file: !450, line: 1279, type: !28)
!870 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hint", arg: 4, scope: !863, file: !450, line: 1279, type: !28)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ofs", scope: !863, file: !450, line: 1281, type: !28)
!872 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lastofs", scope: !863, file: !450, line: 1282, type: !28)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !863, file: !450, line: 1283, type: !28)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxofs", scope: !875, file: !450, line: 1294, type: !777)
!875 = distinct !DILexicalBlock(scope: !876, file: !450, line: 1290, column: 77)
!876 = distinct !DILexicalBlock(scope: !863, file: !450, line: 1290, column: 74)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxofs", scope: !878, file: !450, line: 1316, type: !777)
!878 = distinct !DILexicalBlock(scope: !876, file: !450, line: 1312, column: 10)
!879 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !880, file: !450, line: 1341, type: !28)
!880 = distinct !DILexicalBlock(scope: !863, file: !450, line: 1340, column: 27)
!881 = !DISubprogram(name: "gallop_left", scope: !450, file: !450, line: 1188, type: !864, isLocal: true, isDefinition: true, scopeLine: 1189, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*, %struct._object**, i64, i64)* @gallop_left, variables: !882)
!882 = !{!883, !884, !885, !886, !887, !888, !889, !890, !893, !895}
!883 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "key", arg: 1, scope: !881, file: !450, line: 1188, type: !22)
!884 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !881, file: !450, line: 1188, type: !365)
!885 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 3, scope: !881, file: !450, line: 1188, type: !28)
!886 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "hint", arg: 4, scope: !881, file: !450, line: 1188, type: !28)
!887 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ofs", scope: !881, file: !450, line: 1190, type: !28)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lastofs", scope: !881, file: !450, line: 1191, type: !28)
!889 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !881, file: !450, line: 1192, type: !28)
!890 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxofs", scope: !891, file: !450, line: 1203, type: !777)
!891 = distinct !DILexicalBlock(scope: !892, file: !450, line: 1199, column: 77)
!892 = distinct !DILexicalBlock(scope: !881, file: !450, line: 1199, column: 74)
!893 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "maxofs", scope: !894, file: !450, line: 1224, type: !777)
!894 = distinct !DILexicalBlock(scope: !892, file: !450, line: 1220, column: 10)
!895 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !896, file: !450, line: 1250, type: !28)
!896 = distinct !DILexicalBlock(scope: !881, file: !450, line: 1249, column: 27)
!897 = !DISubprogram(name: "merge_lo", scope: !450, file: !450, line: 1492, type: !898, isLocal: true, isDefinition: true, scopeLine: 1494, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.s_MergeState*, %struct._object**, %struct._object**, i64, %struct._object**, %struct._object**, i64)* @merge_lo, variables: !900)
!898 = !DISubroutineType(types: !899)
!899 = !{!28, !797, !729, !28, !729, !28}
!900 = !{!901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !914}
!901 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ms", arg: 1, scope: !897, file: !450, line: 1492, type: !797)
!902 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ssa", arg: 2, scope: !897, file: !450, line: 1492, type: !729)
!903 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "na", arg: 3, scope: !897, file: !450, line: 1492, type: !28)
!904 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ssb", arg: 4, scope: !897, file: !450, line: 1493, type: !729)
!905 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nb", arg: 5, scope: !897, file: !450, line: 1493, type: !28)
!906 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "k", scope: !897, file: !450, line: 1495, type: !28)
!907 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dest", scope: !897, file: !450, line: 1496, type: !729)
!908 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !897, file: !450, line: 1497, type: !61)
!909 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "min_gallop", scope: !897, file: !450, line: 1498, type: !28)
!910 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "acount", scope: !911, file: !450, line: 1517, type: !28)
!911 = distinct !DILexicalBlock(scope: !912, file: !450, line: 1516, column: 14)
!912 = distinct !DILexicalBlock(scope: !913, file: !450, line: 1516, column: 5)
!913 = distinct !DILexicalBlock(scope: !897, file: !450, line: 1516, column: 5)
!914 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bcount", scope: !911, file: !450, line: 1518, type: !28)
!915 = !DISubprogram(name: "merge_getmem", scope: !450, file: !450, line: 1453, type: !916, isLocal: true, isDefinition: true, scopeLine: 1454, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.s_MergeState*, i64)* @merge_getmem, variables: !918)
!916 = !DISubroutineType(types: !917)
!917 = !{!61, !797, !28}
!918 = !{!919, !920, !921}
!919 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ms", arg: 1, scope: !915, file: !450, line: 1453, type: !797)
!920 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "need", arg: 2, scope: !915, file: !450, line: 1453, type: !28)
!921 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "multiplier", scope: !915, file: !450, line: 1455, type: !61)
!922 = !DISubprogram(name: "sortslice_memcpy", scope: !450, file: !450, line: 1009, type: !923, isLocal: true, isDefinition: true, scopeLine: 1011, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct.sortslice*, i64, %struct.sortslice*, i64, i64)* @sortslice_memcpy, variables: !925)
!923 = !DISubroutineType(types: !924)
!924 = !{null, !821, !28, !821, !28, !28}
!925 = !{!926, !927, !928, !929, !930}
!926 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s1", arg: 1, scope: !922, file: !450, line: 1009, type: !821)
!927 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "i", arg: 2, scope: !922, file: !450, line: 1009, type: !28)
