; ModuleID = 'irs-onlybc/longobject.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !448, globals: !2136)
!1 = !DIFile(filename: "longobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !350, !96, !17, !101, !362, !363, !103, !359, !366, !23, !50, !367, !369, !370, !372, !373, !374, !58, !375, !383, !401, !403, !411, !422, !425, !37, !427, !429, !225, !430, !438}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !13, line: 109, baseType: !14)
!13 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !13, line: 105, size: 128, align: 64, elements: !15)
!15 = !{!16, !24}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !14, file: !13, line: 107, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !18, line: 177, baseType: !19)
!18 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !20, line: 102, baseType: !21)
!20 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !22, line: 181, baseType: !23)
!22 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!23 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !14, file: !13, line: 108, baseType: !25, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !13, line: 334, size: 3200, align: 64, elements: !27)
!27 = !{!28, !34, !38, !39, !40, !45, !109, !114, !119, !120, !125, !177, !208, !220, !226, !227, !228, !230, !232, !263, !264, !265, !274, !275, !280, !281, !283, !285, !295, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !26, file: !13, line: 335, baseType: !29, size: 192, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !13, line: 114, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 111, size: 192, align: 64, elements: !31)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !30, file: !13, line: 112, baseType: !12, size: 128, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !30, file: !13, line: 113, baseType: !17, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !26, file: !13, line: 336, baseType: !35, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!37 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !26, file: !13, line: 337, baseType: !17, size: 64, align: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !26, file: !13, line: 337, baseType: !17, size: 64, align: 64, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !26, file: !13, line: 341, baseType: !41, size: 64, align: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !13, line: 308, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !11}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !26, file: !13, line: 342, baseType: !46, size: 64, align: 64, offset: 448)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !13, line: 314, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !11, !51, !50}
!50 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !20, line: 48, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !54, line: 246, size: 1728, align: 64, elements: !55)
!54 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!55 = !{!56, !57, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !77, !78, !79, !80, !82, !84, !86, !90, !93, !95, !97, !98, !99, !100, !104, !105}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !53, file: !54, line: 247, baseType: !50, size: 32, align: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !53, file: !54, line: 252, baseType: !58, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !53, file: !54, line: 253, baseType: !58, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !53, file: !54, line: 254, baseType: !58, size: 64, align: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !53, file: !54, line: 255, baseType: !58, size: 64, align: 64, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !53, file: !54, line: 256, baseType: !58, size: 64, align: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !53, file: !54, line: 257, baseType: !58, size: 64, align: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !53, file: !54, line: 258, baseType: !58, size: 64, align: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !53, file: !54, line: 259, baseType: !58, size: 64, align: 64, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !53, file: !54, line: 261, baseType: !58, size: 64, align: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !53, file: !54, line: 262, baseType: !58, size: 64, align: 64, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !53, file: !54, line: 263, baseType: !58, size: 64, align: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !53, file: !54, line: 265, baseType: !70, size: 64, align: 64, offset: 768)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !54, line: 161, size: 192, align: 64, elements: !72)
!72 = !{!73, !74, !76}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !71, file: !54, line: 162, baseType: !70, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !71, file: !54, line: 163, baseType: !75, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !71, file: !54, line: 167, baseType: !50, size: 32, align: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !53, file: !54, line: 267, baseType: !75, size: 64, align: 64, offset: 832)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !53, file: !54, line: 269, baseType: !50, size: 32, align: 32, offset: 896)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !53, file: !54, line: 273, baseType: !50, size: 32, align: 32, offset: 928)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !53, file: !54, line: 275, baseType: !81, size: 64, align: 64, offset: 960)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !22, line: 140, baseType: !23)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !53, file: !54, line: 279, baseType: !83, size: 16, align: 16, offset: 1024)
!83 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !53, file: !54, line: 280, baseType: !85, size: 8, align: 8, offset: 1040)
!85 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !53, file: !54, line: 281, baseType: !87, size: 8, align: 8, offset: 1048)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, align: 8, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 1)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !53, file: !54, line: 285, baseType: !91, size: 64, align: 64, offset: 1088)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !54, line: 155, baseType: null)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !53, file: !54, line: 294, baseType: !94, size: 64, align: 64, offset: 1152)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !22, line: 141, baseType: !23)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !53, file: !54, line: 303, baseType: !96, size: 64, align: 64, offset: 1216)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !53, file: !54, line: 304, baseType: !96, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !53, file: !54, line: 305, baseType: !96, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !53, file: !54, line: 306, baseType: !96, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !53, file: !54, line: 307, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !53, file: !54, line: 309, baseType: !50, size: 32, align: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !53, file: !54, line: 311, baseType: !106, size: 160, align: 8, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 160, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !26, file: !13, line: 343, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !13, line: 316, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!11, !11, !58}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !26, file: !13, line: 344, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !13, line: 318, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!50, !11, !58, !11}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !26, file: !13, line: 345, baseType: !96, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !26, file: !13, line: 346, baseType: !121, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !13, line: 320, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!11, !11}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !26, file: !13, line: 350, baseType: !126, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !13, line: 278, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 236, size: 2176, align: 64, elements: !129)
!129 = !{!130, !135, !136, !137, !138, !139, !144, !146, !147, !148, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !128, file: !13, line: 241, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !13, line: 166, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!11, !11, !11}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !128, file: !13, line: 242, baseType: !131, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !128, file: !13, line: 243, baseType: !131, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !128, file: !13, line: 244, baseType: !131, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !128, file: !13, line: 245, baseType: !131, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !128, file: !13, line: 246, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !13, line: 167, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!11, !11, !11, !11}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !128, file: !13, line: 247, baseType: !145, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !13, line: 165, baseType: !122)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !128, file: !13, line: 248, baseType: !145, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !128, file: !13, line: 249, baseType: !145, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !128, file: !13, line: 250, baseType: !149, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !13, line: 168, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!50, !11}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !128, file: !13, line: 251, baseType: !145, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !128, file: !13, line: 252, baseType: !131, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !128, file: !13, line: 253, baseType: !131, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !128, file: !13, line: 254, baseType: !131, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !128, file: !13, line: 255, baseType: !131, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !128, file: !13, line: 256, baseType: !131, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !128, file: !13, line: 257, baseType: !145, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !128, file: !13, line: 258, baseType: !96, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !128, file: !13, line: 259, baseType: !145, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !128, file: !13, line: 261, baseType: !131, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !128, file: !13, line: 262, baseType: !131, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !128, file: !13, line: 263, baseType: !131, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !128, file: !13, line: 264, baseType: !131, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !128, file: !13, line: 265, baseType: !140, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !128, file: !13, line: 266, baseType: !131, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !128, file: !13, line: 267, baseType: !131, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !128, file: !13, line: 268, baseType: !131, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !128, file: !13, line: 269, baseType: !131, size: 64, align: 64, offset: 1728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !128, file: !13, line: 270, baseType: !131, size: 64, align: 64, offset: 1792)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !128, file: !13, line: 272, baseType: !131, size: 64, align: 64, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !128, file: !13, line: 273, baseType: !131, size: 64, align: 64, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !128, file: !13, line: 274, baseType: !131, size: 64, align: 64, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !128, file: !13, line: 275, baseType: !131, size: 64, align: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !128, file: !13, line: 277, baseType: !145, size: 64, align: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !26, file: !13, line: 351, baseType: !178, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !13, line: 292, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 280, size: 640, align: 64, elements: !181)
!181 = !{!182, !187, !188, !193, !194, !195, !200, !201, !206, !207}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !180, file: !13, line: 281, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !13, line: 169, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!17, !11}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !180, file: !13, line: 282, baseType: !131, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !180, file: !13, line: 283, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !13, line: 170, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!11, !11, !17}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !180, file: !13, line: 284, baseType: !189, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !180, file: !13, line: 285, baseType: !96, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !180, file: !13, line: 286, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !13, line: 172, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!50, !11, !17, !11}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !180, file: !13, line: 287, baseType: !96, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !180, file: !13, line: 288, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !13, line: 231, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!50, !11, !11}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !180, file: !13, line: 290, baseType: !131, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !180, file: !13, line: 291, baseType: !189, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !26, file: !13, line: 352, baseType: !209, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !13, line: 298, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 294, size: 192, align: 64, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !211, file: !13, line: 295, baseType: !183, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !211, file: !13, line: 296, baseType: !131, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !211, file: !13, line: 297, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !13, line: 174, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!50, !11, !11, !11}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !26, file: !13, line: 356, baseType: !221, size: 64, align: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !13, line: 321, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !11}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !18, line: 186, baseType: !17)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !26, file: !13, line: 357, baseType: !140, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !26, file: !13, line: 358, baseType: !121, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !26, file: !13, line: 359, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !13, line: 317, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !26, file: !13, line: 360, baseType: !231, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !13, line: 319, baseType: !217)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !26, file: !13, line: 363, baseType: !233, size: 64, align: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !13, line: 304, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 301, size: 128, align: 64, elements: !236)
!236 = !{!237, !258}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !235, file: !13, line: 302, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !13, line: 193, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!50, !11, !242, !50}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !13, line: 191, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !13, line: 178, size: 640, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !255, !256, !257}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !244, file: !13, line: 179, baseType: !96, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !244, file: !13, line: 180, baseType: !11, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !13, line: 181, baseType: !17, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !244, file: !13, line: 182, baseType: !17, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !244, file: !13, line: 184, baseType: !50, size: 32, align: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !244, file: !13, line: 185, baseType: !50, size: 32, align: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !244, file: !13, line: 186, baseType: !58, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !244, file: !13, line: 187, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !244, file: !13, line: 188, baseType: !254, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !244, file: !13, line: 189, baseType: !254, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !244, file: !13, line: 190, baseType: !96, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !235, file: !13, line: 303, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !13, line: 194, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !11, !242}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !26, file: !13, line: 366, baseType: !103, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !26, file: !13, line: 368, baseType: !35, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !26, file: !13, line: 372, baseType: !266, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !13, line: 233, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!50, !11, !270, !96}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !13, line: 232, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!50, !11, !96}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !26, file: !13, line: 375, baseType: !149, size: 64, align: 64, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !26, file: !13, line: 379, baseType: !276, size: 64, align: 64, offset: 1600)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !13, line: 322, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!11, !11, !11, !50}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !26, file: !13, line: 382, baseType: !17, size: 64, align: 64, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !26, file: !13, line: 385, baseType: !282, size: 64, align: 64, offset: 1728)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !13, line: 323, baseType: !122)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !26, file: !13, line: 386, baseType: !284, size: 64, align: 64, offset: 1792)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !13, line: 324, baseType: !122)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !26, file: !13, line: 389, baseType: !286, size: 64, align: 64, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 40, size: 256, align: 64, elements: !289)
!288 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 41, baseType: !35, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 18, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 43, baseType: !50, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 45, baseType: !35, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !26, file: !13, line: 390, baseType: !296, size: 64, align: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !13, line: 390, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !26, file: !13, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !58, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!11, !11, !96}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!50, !11, !11, !96}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !58, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !96, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !26, file: !13, line: 392, baseType: !25, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !26, file: !13, line: 393, baseType: !11, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !26, file: !13, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !13, line: 325, baseType: !141)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !26, file: !13, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !13, line: 326, baseType: !217)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !26, file: !13, line: 396, baseType: !17, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !26, file: !13, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !13, line: 327, baseType: !217)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !26, file: !13, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !13, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!11, !25, !17}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !26, file: !13, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !13, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!11, !25, !11, !11}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !26, file: !13, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !13, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !96}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !26, file: !13, line: 401, baseType: !149, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !26, file: !13, line: 402, baseType: !11, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !26, file: !13, line: 403, baseType: !11, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !26, file: !13, line: 404, baseType: !11, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !26, file: !13, line: 405, baseType: !11, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !26, file: !13, line: 406, baseType: !11, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !26, file: !13, line: 407, baseType: !41, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !26, file: !13, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !26, file: !13, line: 412, baseType: !41, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLongObject", file: !352, line: 10, baseType: !353)
!352 = !DIFile(filename: "Include/longobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "_longobject", file: !354, line: 89, size: 256, align: 64, elements: !355)
!354 = !DIFile(filename: "Include/longintrepr.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !353, file: !354, line: 90, baseType: !29, size: 192, align: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ob_digit", scope: !353, file: !354, line: 91, baseType: !358, size: 32, align: 32, offset: 192)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 32, align: 32, elements: !88)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit", file: !354, line: 49, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !361, line: 51, baseType: !348)
!361 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "sdigit", file: !354, line: 50, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !365, line: 196, baseType: !50)
!365 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!366 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "twodigits", file: !354, line: 51, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !361, line: 55, baseType: !103)
!369 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_uintptr_t", file: !18, line: 153, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !361, line: 122, baseType: !103)
!372 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!374 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !377, line: 33, baseType: !378)
!377 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!378 = !DICompositeType(tag: DW_TAG_structure_type, file: !377, line: 25, size: 256, align: 64, elements: !379)
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !378, file: !377, line: 26, baseType: !29, size: 192, align: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !378, file: !377, line: 27, baseType: !382, size: 64, align: 64, offset: 192)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 64, align: 64, elements: !88)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !385)
!385 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !386)
!386 = !{!387, !388, !389, !390, !398}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !385, file: !4, line: 291, baseType: !12, size: 128, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !385, file: !4, line: 292, baseType: !17, size: 64, align: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !385, file: !4, line: 293, baseType: !225, size: 64, align: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !385, file: !4, line: 349, baseType: !391, size: 32, align: 32, offset: 256)
!391 = !DICompositeType(tag: DW_TAG_structure_type, scope: !385, file: !4, line: 294, size: 32, align: 32, elements: !392)
!392 = !{!393, !394, !395, !396, !397}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !391, file: !4, line: 303, baseType: !348, size: 2, align: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !391, file: !4, line: 331, baseType: !348, size: 3, align: 32, offset: 2)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !391, file: !4, line: 336, baseType: !348, size: 1, align: 32, offset: 5)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !391, file: !4, line: 340, baseType: !348, size: 1, align: 32, offset: 6)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !391, file: !4, line: 345, baseType: !348, size: 1, align: 32, offset: 7)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !385, file: !4, line: 350, baseType: !399, size: 64, align: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !102, line: 90, baseType: !50)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !369)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !405)
!405 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !406)
!406 = !{!407, !408, !409, !410}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !405, file: !4, line: 357, baseType: !384, size: 384, align: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !405, file: !4, line: 358, baseType: !17, size: 64, align: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !405, file: !4, line: 360, baseType: !58, size: 64, align: 64, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !405, file: !4, line: 361, baseType: !17, size: 64, align: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !413)
!413 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !414)
!414 = !{!415, !416}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !413, file: !4, line: 369, baseType: !404, size: 576, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !413, file: !4, line: 375, baseType: !417, size: 64, align: 64, offset: 576)
!417 = !DICompositeType(tag: DW_TAG_union_type, scope: !413, file: !4, line: 370, size: 64, align: 64, elements: !418)
!418 = !{!419, !420, !421, !424}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !417, file: !4, line: 371, baseType: !96, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !417, file: !4, line: 372, baseType: !401, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !417, file: !4, line: 373, baseType: !422, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !83)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !417, file: !4, line: 374, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !348)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "stwodigits", file: !354, line: 52, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !365, line: 197, baseType: !23)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_uhash_t", file: !18, line: 189, baseType: !101)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !432, line: 41, baseType: !433)
!432 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!433 = !DICompositeType(tag: DW_TAG_structure_type, file: !432, line: 31, size: 320, align: 64, elements: !434)
!434 = !{!435, !436, !437}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !433, file: !432, line: 32, baseType: !29, size: 192, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !433, file: !432, line: 33, baseType: !225, size: 64, align: 64, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !433, file: !432, line: 34, baseType: !87, size: 8, align: 8, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyByteArrayObject", file: !440, line: 30, baseType: !441)
!440 = !DIFile(filename: "Include/bytearrayobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!441 = !DICompositeType(tag: DW_TAG_structure_type, file: !440, line: 23, size: 448, align: 64, elements: !442)
!442 = !{!443, !444, !445, !446, !447}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !441, file: !440, line: 24, baseType: !29, size: 192, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ob_alloc", scope: !441, file: !440, line: 25, baseType: !17, size: 64, align: 64, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ob_bytes", scope: !441, file: !440, line: 26, baseType: !58, size: 64, align: 64, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ob_start", scope: !441, file: !440, line: 27, baseType: !58, size: 64, align: 64, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ob_exports", scope: !441, file: !440, line: 29, baseType: !50, size: 32, align: 32, offset: 384)
!448 = !{!449, !465, !471, !481, !495, !506, !521, !539, !546, !551, !559, !568, !577, !584, !588, !597, !630, !662, !667, !673, !686, !697, !710, !721, !734, !742, !749, !766, !774, !796, !849, !868, !881, !906, !923, !930, !972, !986, !1000, !1006, !1012, !1019, !1026, !1033, !1089, !1149, !1166, !1176, !1182, !1196, !1209, !1250, !1260, !1271, !1323, !1331, !1346, !1350, !1360, !1370, !1394, !1409, !1417, !1420, !1424, !1432, !1500, !1537, !1560, !1577, !1587, !1595, !1600, !1639, !1652, !1823, !1826, !1829, !1834, !1841, !1863, !1868, !1899, !1908, !1913, !1918, !1922, !1927, !1973, !1981, !1988, !2007, !2027, !2059, !2085, !2088, !2095, !2099, !2105, !2109, !2121}
!449 = !DISubprogram(name: "_PyLong_FromNbInt", scope: !450, file: !450, line: 133, type: !451, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: true, function: %struct._longobject* (%struct._object*)* @_PyLong_FromNbInt, variables: !453)
!450 = !DIFile(filename: "Objects/longobject.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!451 = !DISubroutineType(types: !452)
!452 = !{!350, !11}
!453 = !{!454, !455, !456, !457, !461}
!454 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "integral", arg: 1, scope: !449, file: !450, line: 133, type: !11)
!455 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "nb", scope: !449, file: !450, line: 135, type: !126)
!456 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !449, file: !450, line: 136, type: !11)
!457 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !458, file: !450, line: 161, type: !11)
!458 = distinct !DILexicalBlock(scope: !459, file: !450, line: 161, column: 12)
!459 = distinct !DILexicalBlock(scope: !460, file: !450, line: 157, column: 81)
!460 = distinct !DILexicalBlock(scope: !449, file: !450, line: 157, column: 9)
!461 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !462, file: !450, line: 170, type: !11)
!462 = distinct !DILexicalBlock(scope: !463, file: !450, line: 170, column: 12)
!463 = distinct !DILexicalBlock(scope: !464, file: !450, line: 169, column: 40)
!464 = distinct !DILexicalBlock(scope: !449, file: !450, line: 165, column: 9)
!465 = !DISubprogram(name: "_PyLong_New", scope: !450, file: !450, line: 184, type: !466, isLocal: false, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: true, function: %struct._longobject* (i64)* @_PyLong_New, variables: !468)
!466 = !DISubroutineType(types: !467)
!467 = !{!350, !17}
!468 = !{!469, !470}
!469 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 1, scope: !465, file: !450, line: 184, type: !17)
!470 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !465, file: !450, line: 186, type: !350)
!471 = !DISubprogram(name: "_PyLong_Copy", scope: !450, file: !450, line: 207, type: !472, isLocal: false, isDefinition: true, scopeLine: 208, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._longobject*)* @_PyLong_Copy, variables: !474)
!472 = !DISubroutineType(types: !473)
!473 = !{!11, !350}
!474 = !{!475, !476, !477, !478}
!475 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "src", arg: 1, scope: !471, file: !450, line: 207, type: !350)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !471, file: !450, line: 209, type: !350)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !471, file: !450, line: 210, type: !17)
!478 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ival", scope: !479, file: !450, line: 217, type: !363)
!479 = distinct !DILexicalBlock(scope: !480, file: !450, line: 216, column: 16)
!480 = distinct !DILexicalBlock(scope: !471, file: !450, line: 216, column: 9)
!481 = !DISubprogram(name: "PyLong_FromLong", scope: !450, file: !450, line: 232, type: !482, isLocal: false, isDefinition: true, scopeLine: 233, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i64)* @PyLong_FromLong, variables: !484)
!482 = !DISubroutineType(types: !483)
!483 = !{!11, !23}
!484 = !{!485, !486, !487, !488, !489, !490, !491}
!485 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ival", arg: 1, scope: !481, file: !450, line: 232, type: !23)
!486 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !481, file: !450, line: 234, type: !350)
!487 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "abs_ival", scope: !481, file: !450, line: 235, type: !103)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !481, file: !450, line: 236, type: !103)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !481, file: !450, line: 237, type: !50)
!490 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !481, file: !450, line: 238, type: !50)
!491 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !492, file: !450, line: 286, type: !494)
!492 = distinct !DILexicalBlock(scope: !493, file: !450, line: 285, column: 26)
!493 = distinct !DILexicalBlock(scope: !481, file: !450, line: 285, column: 9)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!495 = !DISubprogram(name: "PyLong_FromUnsignedLong", scope: !450, file: !450, line: 301, type: !496, isLocal: false, isDefinition: true, scopeLine: 302, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i64)* @PyLong_FromUnsignedLong, variables: !498)
!496 = !DISubroutineType(types: !497)
!497 = !{!11, !103}
!498 = !{!499, !500, !501, !502, !503}
!499 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ival", arg: 1, scope: !495, file: !450, line: 301, type: !103)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !495, file: !450, line: 303, type: !350)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !495, file: !450, line: 304, type: !103)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !495, file: !450, line: 305, type: !50)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !504, file: !450, line: 317, type: !494)
!504 = distinct !DILexicalBlock(scope: !505, file: !450, line: 316, column: 26)
!505 = distinct !DILexicalBlock(scope: !495, file: !450, line: 316, column: 9)
!506 = !DISubprogram(name: "PyLong_FromDouble", scope: !450, file: !450, line: 330, type: !507, isLocal: false, isDefinition: true, scopeLine: 331, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (double)* @PyLong_FromDouble, variables: !509)
!507 = !DISubroutineType(types: !508)
!508 = !{!11, !366}
!509 = !{!510, !511, !512, !513, !514, !515, !516, !517}
!510 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "dval", arg: 1, scope: !506, file: !450, line: 330, type: !366)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !506, file: !450, line: 332, type: !350)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "frac", scope: !506, file: !450, line: 333, type: !366)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !506, file: !450, line: 334, type: !50)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndig", scope: !506, file: !450, line: 334, type: !50)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "expo", scope: !506, file: !450, line: 334, type: !50)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "neg", scope: !506, file: !450, line: 334, type: !50)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bits", scope: !518, file: !450, line: 359, type: !359)
!518 = distinct !DILexicalBlock(scope: !519, file: !450, line: 358, column: 32)
!519 = distinct !DILexicalBlock(scope: !520, file: !450, line: 358, column: 5)
!520 = distinct !DILexicalBlock(scope: !506, file: !450, line: 358, column: 5)
!521 = !DISubprogram(name: "PyLong_AsLongAndOverflow", scope: !450, file: !450, line: 392, type: !522, isLocal: false, isDefinition: true, scopeLine: 393, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*, i32*)* @PyLong_AsLongAndOverflow, variables: !525)
!522 = !DISubroutineType(types: !523)
!523 = !{!23, !11, !524}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!525 = !{!526, !527, !528, !529, !530, !531, !532, !533, !534, !535}
!526 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vv", arg: 1, scope: !521, file: !450, line: 392, type: !11)
!527 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "overflow", arg: 2, scope: !521, file: !450, line: 392, type: !524)
!528 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !521, file: !450, line: 395, type: !350)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !521, file: !450, line: 396, type: !103)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !521, file: !450, line: 396, type: !103)
!531 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !521, file: !450, line: 397, type: !23)
!532 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !521, file: !450, line: 398, type: !17)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !521, file: !450, line: 399, type: !50)
!534 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "do_decref", scope: !521, file: !450, line: 400, type: !50)
!535 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !536, file: !450, line: 462, type: !11)
!536 = distinct !DILexicalBlock(scope: !537, file: !450, line: 462, column: 12)
!537 = distinct !DILexicalBlock(scope: !538, file: !450, line: 461, column: 20)
!538 = distinct !DILexicalBlock(scope: !521, file: !450, line: 461, column: 9)
!539 = !DISubprogram(name: "PyLong_AsLong", scope: !450, file: !450, line: 471, type: !540, isLocal: false, isDefinition: true, scopeLine: 472, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyLong_AsLong, variables: !542)
!540 = !DISubroutineType(types: !541)
!541 = !{!23, !11}
!542 = !{!543, !544, !545}
!543 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !539, file: !450, line: 471, type: !11)
!544 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overflow", scope: !539, file: !450, line: 473, type: !50)
!545 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !539, file: !450, line: 474, type: !23)
!546 = !DISubprogram(name: "_PyLong_AsInt", scope: !450, file: !450, line: 488, type: !151, isLocal: false, isDefinition: true, scopeLine: 489, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @_PyLong_AsInt, variables: !547)
!547 = !{!548, !549, !550}
!548 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !546, file: !450, line: 488, type: !11)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overflow", scope: !546, file: !450, line: 490, type: !50)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !546, file: !450, line: 491, type: !23)
!551 = !DISubprogram(name: "PyLong_AsSsize_t", scope: !450, file: !450, line: 506, type: !185, isLocal: false, isDefinition: true, scopeLine: 506, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyLong_AsSsize_t, variables: !552)
!552 = !{!553, !554, !555, !556, !557, !558}
!553 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vv", arg: 1, scope: !551, file: !450, line: 506, type: !11)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !551, file: !450, line: 507, type: !350)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !551, file: !450, line: 508, type: !101)
!556 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !551, file: !450, line: 508, type: !101)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !551, file: !450, line: 509, type: !17)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !551, file: !450, line: 510, type: !50)
!559 = !DISubprogram(name: "PyLong_AsUnsignedLong", scope: !450, file: !450, line: 561, type: !560, isLocal: false, isDefinition: true, scopeLine: 562, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyLong_AsUnsignedLong, variables: !562)
!560 = !DISubroutineType(types: !561)
!561 = !{!103, !11}
!562 = !{!563, !564, !565, !566, !567}
!563 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vv", arg: 1, scope: !559, file: !450, line: 561, type: !11)
!564 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !559, file: !450, line: 563, type: !350)
!565 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !559, file: !450, line: 564, type: !103)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !559, file: !450, line: 564, type: !103)
!567 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !559, file: !450, line: 565, type: !17)
!568 = !DISubprogram(name: "PyLong_AsSize_t", scope: !450, file: !450, line: 605, type: !569, isLocal: false, isDefinition: true, scopeLine: 606, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyLong_AsSize_t, variables: !571)
!569 = !DISubroutineType(types: !570)
!570 = !{!101, !11}
!571 = !{!572, !573, !574, !575, !576}
!572 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vv", arg: 1, scope: !568, file: !450, line: 605, type: !11)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !568, file: !450, line: 607, type: !350)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !568, file: !450, line: 608, type: !101)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !568, file: !450, line: 608, type: !101)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !568, file: !450, line: 609, type: !17)
!577 = !DISubprogram(name: "PyLong_AsUnsignedLongMask", scope: !450, file: !450, line: 678, type: !560, isLocal: false, isDefinition: true, scopeLine: 679, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyLong_AsUnsignedLongMask, variables: !578)
!578 = !{!579, !580, !581, !582}
!579 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !577, file: !450, line: 678, type: !11)
!580 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lo", scope: !577, file: !450, line: 680, type: !350)
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !577, file: !450, line: 681, type: !103)
!582 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !583, file: !450, line: 697, type: !11)
!583 = distinct !DILexicalBlock(scope: !577, file: !450, line: 697, column: 8)
!584 = !DISubprogram(name: "_PyLong_Sign", scope: !450, file: !450, line: 702, type: !151, isLocal: false, isDefinition: true, scopeLine: 703, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*)* @_PyLong_Sign, variables: !585)
!585 = !{!586, !587}
!586 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vv", arg: 1, scope: !584, file: !450, line: 702, type: !11)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !584, file: !450, line: 704, type: !350)
!588 = !DISubprogram(name: "_PyLong_NumBits", scope: !450, file: !450, line: 713, type: !569, isLocal: false, isDefinition: true, scopeLine: 714, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @_PyLong_NumBits, variables: !589)
!589 = !{!590, !591, !592, !593, !594}
!590 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vv", arg: 1, scope: !588, file: !450, line: 713, type: !11)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !588, file: !450, line: 715, type: !350)
!592 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !588, file: !450, line: 716, type: !101)
!593 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !588, file: !450, line: 717, type: !17)
!594 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msd", scope: !595, file: !450, line: 724, type: !359)
!595 = distinct !DILexicalBlock(scope: !596, file: !450, line: 723, column: 22)
!596 = distinct !DILexicalBlock(scope: !588, file: !450, line: 723, column: 9)
!597 = !DISubprogram(name: "_PyLong_FromByteArray", scope: !450, file: !450, line: 744, type: !598, isLocal: false, isDefinition: true, scopeLine: 746, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i64, i32, i32)* @_PyLong_FromByteArray, variables: !602)
!598 = !DISubroutineType(types: !599)
!599 = !{!11, !600, !101, !50, !50}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64, align: 64)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!602 = !{!603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !616, !617, !619, !620, !622, !623, !624, !625, !626}
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bytes", arg: 1, scope: !597, file: !450, line: 744, type: !600)
!604 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !597, file: !450, line: 744, type: !101)
!605 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "little_endian", arg: 3, scope: !597, file: !450, line: 745, type: !50)
!606 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "is_signed", arg: 4, scope: !597, file: !450, line: 745, type: !50)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pstartbyte", scope: !597, file: !450, line: 747, type: !600)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "incr", scope: !597, file: !450, line: 748, type: !50)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pendbyte", scope: !597, file: !450, line: 749, type: !600)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "numsignificantbytes", scope: !597, file: !450, line: 750, type: !101)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !597, file: !450, line: 751, type: !17)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !597, file: !450, line: 752, type: !350)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idigit", scope: !597, file: !450, line: 753, type: !17)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !615, file: !450, line: 776, type: !101)
!615 = distinct !DILexicalBlock(scope: !597, file: !450, line: 775, column: 5)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !615, file: !450, line: 777, type: !600)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pincr", scope: !615, file: !450, line: 778, type: !618)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!619 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "insignficant", scope: !615, file: !450, line: 779, type: !601)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !621, file: !450, line: 813, type: !101)
!621 = distinct !DILexicalBlock(scope: !597, file: !450, line: 812, column: 5)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "carry", scope: !621, file: !450, line: 814, type: !367)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "accum", scope: !621, file: !450, line: 815, type: !367)
!624 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "accumbits", scope: !621, file: !450, line: 816, type: !348)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !621, file: !450, line: 817, type: !600)
!626 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thisbyte", scope: !627, file: !450, line: 820, type: !367)
!627 = distinct !DILexicalBlock(scope: !628, file: !450, line: 819, column: 62)
!628 = distinct !DILexicalBlock(scope: !629, file: !450, line: 819, column: 9)
!629 = distinct !DILexicalBlock(scope: !621, file: !450, line: 819, column: 9)
!630 = !DISubprogram(name: "_PyLong_AsByteArray", scope: !450, file: !450, line: 855, type: !631, isLocal: false, isDefinition: true, scopeLine: 858, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._longobject*, i8*, i64, i32, i32)* @_PyLong_AsByteArray, variables: !633)
!631 = !DISubroutineType(types: !632)
!632 = !{!50, !350, !373, !101, !50, !50}
!633 = !{!634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !652, !655, !659, !660}
!634 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !630, file: !450, line: 855, type: !350)
!635 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "bytes", arg: 2, scope: !630, file: !450, line: 856, type: !373)
!636 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 3, scope: !630, file: !450, line: 856, type: !101)
!637 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "little_endian", arg: 4, scope: !630, file: !450, line: 857, type: !50)
!638 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "is_signed", arg: 5, scope: !630, file: !450, line: 857, type: !50)
!639 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !630, file: !450, line: 859, type: !17)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !630, file: !450, line: 860, type: !17)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "accum", scope: !630, file: !450, line: 861, type: !367)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "accumbits", scope: !630, file: !450, line: 862, type: !348)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "do_twos_comp", scope: !630, file: !450, line: 863, type: !50)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "carry", scope: !630, file: !450, line: 864, type: !359)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !630, file: !450, line: 865, type: !101)
!646 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !630, file: !450, line: 866, type: !373)
!647 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pincr", scope: !630, file: !450, line: 867, type: !50)
!648 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "thisdigit", scope: !649, file: !450, line: 904, type: !359)
!649 = distinct !DILexicalBlock(scope: !650, file: !450, line: 903, column: 35)
!650 = distinct !DILexicalBlock(scope: !651, file: !450, line: 903, column: 5)
!651 = distinct !DILexicalBlock(scope: !630, file: !450, line: 903, column: 5)
!652 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !653, file: !450, line: 921, type: !359)
!653 = distinct !DILexicalBlock(scope: !654, file: !450, line: 917, column: 31)
!654 = distinct !DILexicalBlock(scope: !649, file: !450, line: 917, column: 13)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "msb", scope: !656, file: !450, line: 963, type: !369)
!656 = distinct !DILexicalBlock(scope: !657, file: !450, line: 958, column: 44)
!657 = distinct !DILexicalBlock(scope: !658, file: !450, line: 958, column: 14)
!658 = distinct !DILexicalBlock(scope: !630, file: !450, line: 945, column: 9)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign_bit_set", scope: !656, file: !450, line: 964, type: !50)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "signbyte", scope: !661, file: !450, line: 974, type: !369)
!661 = distinct !DILexicalBlock(scope: !630, file: !450, line: 973, column: 5)
!662 = !DISubprogram(name: "PyLong_FromVoidPtr", scope: !450, file: !450, line: 990, type: !663, isLocal: false, isDefinition: true, scopeLine: 991, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*)* @PyLong_FromVoidPtr, variables: !665)
!663 = !DISubroutineType(types: !664)
!664 = !{!11, !96}
!665 = !{!666}
!666 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !662, file: !450, line: 990, type: !96)
!667 = !DISubprogram(name: "PyLong_AsVoidPtr", scope: !450, file: !450, line: 1010, type: !668, isLocal: false, isDefinition: true, scopeLine: 1011, flags: DIFlagPrototyped, isOptimized: true, function: i8* (%struct._object*)* @PyLong_AsVoidPtr, variables: !670)
!668 = !DISubroutineType(types: !669)
!669 = !{!96, !11}
!670 = !{!671, !672}
!671 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vv", arg: 1, scope: !667, file: !450, line: 1010, type: !11)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !667, file: !450, line: 1013, type: !23)
!673 = !DISubprogram(name: "PyLong_FromLongLong", scope: !450, file: !450, line: 1052, type: !674, isLocal: false, isDefinition: true, scopeLine: 1053, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i64)* @PyLong_FromLongLong, variables: !676)
!674 = !DISubroutineType(types: !675)
!675 = !{!11, !374}
!676 = !{!677, !678, !679, !680, !681, !682, !683}
!677 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ival", arg: 1, scope: !673, file: !450, line: 1052, type: !374)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !673, file: !450, line: 1054, type: !350)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "abs_ival", scope: !673, file: !450, line: 1055, type: !372)
!680 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !673, file: !450, line: 1056, type: !372)
!681 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !673, file: !450, line: 1057, type: !50)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "negative", scope: !673, file: !450, line: 1058, type: !50)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !684, file: !450, line: 1082, type: !494)
!684 = distinct !DILexicalBlock(scope: !685, file: !450, line: 1081, column: 26)
!685 = distinct !DILexicalBlock(scope: !673, file: !450, line: 1081, column: 9)
!686 = !DISubprogram(name: "PyLong_FromUnsignedLongLong", scope: !450, file: !450, line: 1096, type: !687, isLocal: false, isDefinition: true, scopeLine: 1097, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i64)* @PyLong_FromUnsignedLongLong, variables: !689)
!687 = !DISubroutineType(types: !688)
!688 = !{!11, !372}
!689 = !{!690, !691, !692, !693, !694}
!690 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ival", arg: 1, scope: !686, file: !450, line: 1096, type: !372)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !686, file: !450, line: 1098, type: !350)
!692 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !686, file: !450, line: 1099, type: !372)
!693 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !686, file: !450, line: 1100, type: !50)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !695, file: !450, line: 1112, type: !494)
!695 = distinct !DILexicalBlock(scope: !696, file: !450, line: 1111, column: 26)
!696 = distinct !DILexicalBlock(scope: !686, file: !450, line: 1111, column: 9)
!697 = !DISubprogram(name: "PyLong_FromSsize_t", scope: !450, file: !450, line: 1125, type: !698, isLocal: false, isDefinition: true, scopeLine: 1126, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i64)* @PyLong_FromSsize_t, variables: !700)
!698 = !DISubroutineType(types: !699)
!699 = !{!11, !17}
!700 = !{!701, !702, !703, !704, !705, !706, !707}
!701 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ival", arg: 1, scope: !697, file: !450, line: 1125, type: !17)
!702 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !697, file: !450, line: 1127, type: !350)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "abs_ival", scope: !697, file: !450, line: 1128, type: !101)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !697, file: !450, line: 1129, type: !101)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !697, file: !450, line: 1130, type: !50)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "negative", scope: !697, file: !450, line: 1131, type: !50)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !708, file: !450, line: 1151, type: !494)
!708 = distinct !DILexicalBlock(scope: !709, file: !450, line: 1150, column: 26)
!709 = distinct !DILexicalBlock(scope: !697, file: !450, line: 1150, column: 9)
!710 = !DISubprogram(name: "PyLong_FromSize_t", scope: !450, file: !450, line: 1165, type: !711, isLocal: false, isDefinition: true, scopeLine: 1166, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i64)* @PyLong_FromSize_t, variables: !713)
!711 = !DISubroutineType(types: !712)
!712 = !{!11, !101}
!713 = !{!714, !715, !716, !717, !718}
!714 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ival", arg: 1, scope: !710, file: !450, line: 1165, type: !101)
!715 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !710, file: !450, line: 1167, type: !350)
!716 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !710, file: !450, line: 1168, type: !101)
!717 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ndigits", scope: !710, file: !450, line: 1169, type: !50)
!718 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !719, file: !450, line: 1181, type: !494)
!719 = distinct !DILexicalBlock(scope: !720, file: !450, line: 1180, column: 26)
!720 = distinct !DILexicalBlock(scope: !710, file: !450, line: 1180, column: 9)
!721 = !DISubprogram(name: "PyLong_AsLongLong", scope: !450, file: !450, line: 1195, type: !722, isLocal: false, isDefinition: true, scopeLine: 1196, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyLong_AsLongLong, variables: !724)
!722 = !DISubroutineType(types: !723)
!723 = !{!374, !11}
!724 = !{!725, !726, !727, !728, !729, !730}
!725 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vv", arg: 1, scope: !721, file: !450, line: 1195, type: !11)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !721, file: !450, line: 1197, type: !350)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !721, file: !450, line: 1198, type: !374)
!728 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !721, file: !450, line: 1199, type: !50)
!729 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "do_decref", scope: !721, file: !450, line: 1200, type: !50)
!730 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !731, file: !450, line: 1233, type: !11)
!731 = distinct !DILexicalBlock(scope: !732, file: !450, line: 1233, column: 12)
!732 = distinct !DILexicalBlock(scope: !733, file: !450, line: 1232, column: 20)
!733 = distinct !DILexicalBlock(scope: !721, file: !450, line: 1232, column: 9)
!734 = !DISubprogram(name: "PyLong_AsUnsignedLongLong", scope: !450, file: !450, line: 1247, type: !735, isLocal: false, isDefinition: true, scopeLine: 1248, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyLong_AsUnsignedLongLong, variables: !737)
!735 = !DISubroutineType(types: !736)
!736 = !{!372, !11}
!737 = !{!738, !739, !740, !741}
!738 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vv", arg: 1, scope: !734, file: !450, line: 1247, type: !11)
!739 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !734, file: !450, line: 1249, type: !350)
!740 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "bytes", scope: !734, file: !450, line: 1250, type: !372)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !734, file: !450, line: 1251, type: !50)
!742 = !DISubprogram(name: "PyLong_AsUnsignedLongLongMask", scope: !450, file: !450, line: 1312, type: !735, isLocal: false, isDefinition: true, scopeLine: 1313, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*)* @PyLong_AsUnsignedLongLongMask, variables: !743)
!743 = !{!744, !745, !746, !747}
!744 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "op", arg: 1, scope: !742, file: !450, line: 1312, type: !11)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lo", scope: !742, file: !450, line: 1314, type: !350)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !742, file: !450, line: 1315, type: !372)
!747 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !748, file: !450, line: 1331, type: !11)
!748 = distinct !DILexicalBlock(scope: !742, file: !450, line: 1331, column: 8)
!749 = !DISubprogram(name: "PyLong_AsLongLongAndOverflow", scope: !450, file: !450, line: 1346, type: !750, isLocal: false, isDefinition: true, scopeLine: 1347, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._object*, i32*)* @PyLong_AsLongLongAndOverflow, variables: !752)
!750 = !DISubroutineType(types: !751)
!751 = !{!374, !11, !524}
!752 = !{!753, !754, !755, !756, !757, !758, !759, !760, !761, !762}
!753 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vv", arg: 1, scope: !749, file: !450, line: 1346, type: !11)
!754 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "overflow", arg: 2, scope: !749, file: !450, line: 1346, type: !524)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !749, file: !450, line: 1349, type: !350)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !749, file: !450, line: 1350, type: !372)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "prev", scope: !749, file: !450, line: 1350, type: !372)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !749, file: !450, line: 1351, type: !374)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !749, file: !450, line: 1352, type: !17)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !749, file: !450, line: 1353, type: !50)
!761 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "do_decref", scope: !749, file: !450, line: 1354, type: !50)
!762 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !763, file: !450, line: 1416, type: !11)
!763 = distinct !DILexicalBlock(scope: !764, file: !450, line: 1416, column: 12)
!764 = distinct !DILexicalBlock(scope: !765, file: !450, line: 1415, column: 20)
!765 = distinct !DILexicalBlock(scope: !749, file: !450, line: 1415, column: 9)
!766 = !DISubprogram(name: "_PyLong_Format", scope: !450, file: !450, line: 1896, type: !767, isLocal: false, isDefinition: true, scopeLine: 1897, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i32)* @_PyLong_Format, variables: !769)
!767 = !DISubroutineType(types: !768)
!768 = !{!11, !11, !50}
!769 = !{!770, !771, !772, !773}
!770 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 1, scope: !766, file: !450, line: 1896, type: !11)
!771 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 2, scope: !766, file: !450, line: 1896, type: !50)
!772 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "str", scope: !766, file: !450, line: 1898, type: !11)
!773 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !766, file: !450, line: 1899, type: !50)
!774 = !DISubprogram(name: "_PyLong_FormatWriter", scope: !450, file: !450, line: 1910, type: !775, isLocal: false, isDefinition: true, scopeLine: 1913, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._PyUnicodeWriter*, %struct._object*, i32, i32)* @_PyLong_FormatWriter, variables: !791)
!775 = !DISubroutineType(types: !776)
!776 = !{!50, !777, !11, !50, !50}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64, align: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "_PyUnicodeWriter", file: !4, line: 917, baseType: !779)
!779 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 897, size: 448, align: 64, elements: !780)
!780 = !{!781, !782, !783, !784, !785, !786, !787, !788, !789, !790}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !779, file: !4, line: 898, baseType: !11, size: 64, align: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !779, file: !4, line: 899, baseType: !96, size: 64, align: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !779, file: !4, line: 900, baseType: !3, size: 32, align: 32, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "maxchar", scope: !779, file: !4, line: 901, baseType: !426, size: 32, align: 32, offset: 160)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !779, file: !4, line: 902, baseType: !17, size: 64, align: 64, offset: 192)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !779, file: !4, line: 903, baseType: !17, size: 64, align: 64, offset: 256)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "min_length", scope: !779, file: !4, line: 906, baseType: !17, size: 64, align: 64, offset: 320)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "min_char", scope: !779, file: !4, line: 909, baseType: !426, size: 32, align: 32, offset: 384)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "overallocate", scope: !779, file: !4, line: 912, baseType: !369, size: 8, align: 8, offset: 416)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !779, file: !4, line: 916, baseType: !369, size: 8, align: 8, offset: 424)
!791 = !{!792, !793, !794, !795}
!792 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "writer", arg: 1, scope: !774, file: !450, line: 1910, type: !777)
!793 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "obj", arg: 2, scope: !774, file: !450, line: 1911, type: !11)
!794 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 3, scope: !774, file: !450, line: 1912, type: !50)
!795 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "alternate", arg: 4, scope: !774, file: !450, line: 1912, type: !50)
!796 = !DISubprogram(name: "PyLong_FromString", scope: !450, file: !450, line: 2021, type: !797, isLocal: false, isDefinition: true, scopeLine: 2022, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i8**, i32)* @PyLong_FromString, variables: !800)
!797 = !DISubroutineType(types: !798)
!798 = !{!11, !35, !799, !50}
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!800 = !{!801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !814, !815, !816, !817, !818, !819, !820, !821, !822, !825, !826, !830, !836, !840, !842, !844, !847}
!801 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !796, file: !450, line: 2021, type: !35)
!802 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "pend", arg: 2, scope: !796, file: !450, line: 2021, type: !799)
!803 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 3, scope: !796, file: !450, line: 2021, type: !50)
!804 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sign", scope: !796, file: !450, line: 2023, type: !50)
!805 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "error_if_nonzero", scope: !796, file: !450, line: 2023, type: !50)
!806 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "start", scope: !796, file: !450, line: 2024, type: !35)
!807 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "orig_str", scope: !796, file: !450, line: 2024, type: !35)
!808 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !796, file: !450, line: 2025, type: !350)
!809 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "strobj", scope: !796, file: !450, line: 2026, type: !11)
!810 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slen", scope: !796, file: !450, line: 2027, type: !17)
!811 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !812, file: !450, line: 2153, type: !367)
!812 = distinct !DILexicalBlock(scope: !813, file: !450, line: 2067, column: 10)
!813 = distinct !DILexicalBlock(scope: !796, file: !450, line: 2065, column: 9)
!814 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size_z", scope: !812, file: !450, line: 2154, type: !17)
!815 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !812, file: !450, line: 2155, type: !50)
!816 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "convwidth", scope: !812, file: !450, line: 2156, type: !50)
!817 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "convmultmax", scope: !812, file: !450, line: 2157, type: !367)
!818 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "convmult", scope: !812, file: !450, line: 2157, type: !367)
!819 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pz", scope: !812, file: !450, line: 2158, type: !494)
!820 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pzstop", scope: !812, file: !450, line: 2158, type: !494)
!821 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "scan", scope: !812, file: !450, line: 2159, type: !35)
!822 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "convmax", scope: !823, file: !450, line: 2166, type: !367)
!823 = distinct !DILexicalBlock(scope: !824, file: !450, line: 2165, column: 41)
!824 = distinct !DILexicalBlock(scope: !812, file: !450, line: 2165, column: 13)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !823, file: !450, line: 2167, type: !50)
!826 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "next", scope: !827, file: !450, line: 2172, type: !367)
!827 = distinct !DILexicalBlock(scope: !828, file: !450, line: 2171, column: 22)
!828 = distinct !DILexicalBlock(scope: !829, file: !450, line: 2171, column: 13)
!829 = distinct !DILexicalBlock(scope: !823, file: !450, line: 2171, column: 13)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !831, file: !450, line: 2244, type: !350)
!831 = distinct !DILexicalBlock(scope: !832, file: !450, line: 2243, column: 22)
!832 = distinct !DILexicalBlock(scope: !833, file: !450, line: 2239, column: 21)
!833 = distinct !DILexicalBlock(scope: !834, file: !450, line: 2237, column: 20)
!834 = distinct !DILexicalBlock(scope: !835, file: !450, line: 2237, column: 17)
!835 = distinct !DILexicalBlock(scope: !812, file: !450, line: 2209, column: 28)
!836 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !837, file: !450, line: 2249, type: !11)
!837 = distinct !DILexicalBlock(scope: !838, file: !450, line: 2249, column: 28)
!838 = distinct !DILexicalBlock(scope: !839, file: !450, line: 2248, column: 44)
!839 = distinct !DILexicalBlock(scope: !831, file: !450, line: 2248, column: 25)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !841, file: !450, line: 2255, type: !11)
!841 = distinct !DILexicalBlock(scope: !831, file: !450, line: 2255, column: 24)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !843, file: !450, line: 2293, type: !11)
!843 = distinct !DILexicalBlock(scope: !796, file: !450, line: 2293, column: 8)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !845, file: !450, line: 2293, type: !11)
!845 = distinct !DILexicalBlock(scope: !846, file: !450, line: 2293, column: 93)
!846 = distinct !DILexicalBlock(scope: !843, file: !450, line: 2293, column: 59)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !848, file: !450, line: 2301, type: !11)
!848 = distinct !DILexicalBlock(scope: !796, file: !450, line: 2301, column: 8)
!849 = !DISubprogram(name: "_PyLong_FromBytes", scope: !450, file: !450, line: 2311, type: !850, isLocal: false, isDefinition: true, scopeLine: 2312, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i64, i32)* @_PyLong_FromBytes, variables: !852)
!850 = !DISubroutineType(types: !851)
!851 = !{!11, !35, !17, !50}
!852 = !{!853, !854, !855, !856, !857, !858, !859, !861, !864}
!853 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !849, file: !450, line: 2311, type: !35)
!854 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !849, file: !450, line: 2311, type: !17)
!855 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 3, scope: !849, file: !450, line: 2311, type: !50)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !849, file: !450, line: 2313, type: !11)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "strobj", scope: !849, file: !450, line: 2313, type: !11)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !849, file: !450, line: 2314, type: !58)
!859 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !860, file: !450, line: 2319, type: !11)
!860 = distinct !DILexicalBlock(scope: !849, file: !450, line: 2319, column: 8)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !862, file: !450, line: 2319, type: !11)
!862 = distinct !DILexicalBlock(scope: !863, file: !450, line: 2319, column: 98)
!863 = distinct !DILexicalBlock(scope: !860, file: !450, line: 2319, column: 64)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !865, file: !450, line: 2325, type: !11)
!865 = distinct !DILexicalBlock(scope: !866, file: !450, line: 2325, column: 12)
!866 = distinct !DILexicalBlock(scope: !867, file: !450, line: 2321, column: 31)
!867 = distinct !DILexicalBlock(scope: !849, file: !450, line: 2321, column: 9)
!868 = !DISubprogram(name: "PyLong_FromUnicode", scope: !450, file: !450, line: 2331, type: !869, isLocal: false, isDefinition: true, scopeLine: 2332, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i32*, i64, i32)* @PyLong_FromUnicode, variables: !873)
!869 = !DISubroutineType(types: !870)
!870 = !{!11, !871, !17, !50}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64, align: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UNICODE", file: !4, line: 93, baseType: !400)
!873 = !{!874, !875, !876, !877, !878, !879}
!874 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "u", arg: 1, scope: !868, file: !450, line: 2331, type: !871)
!875 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "length", arg: 2, scope: !868, file: !450, line: 2331, type: !17)
!876 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 3, scope: !868, file: !450, line: 2331, type: !50)
!877 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !868, file: !450, line: 2333, type: !11)
!878 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "unicode", scope: !868, file: !450, line: 2333, type: !11)
!879 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !880, file: !450, line: 2337, type: !11)
!880 = distinct !DILexicalBlock(scope: !868, file: !450, line: 2337, column: 8)
!881 = !DISubprogram(name: "PyLong_FromUnicodeObject", scope: !450, file: !450, line: 2342, type: !767, isLocal: false, isDefinition: true, scopeLine: 2343, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i32)* @PyLong_FromUnicodeObject, variables: !882)
!882 = !{!883, !884, !885, !886, !887, !888, !889, !890, !894, !899, !901, !903}
!883 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "u", arg: 1, scope: !881, file: !450, line: 2342, type: !11)
!884 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 2, scope: !881, file: !450, line: 2342, type: !50)
!885 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !881, file: !450, line: 2344, type: !11)
!886 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "asciidig", scope: !881, file: !450, line: 2344, type: !11)
!887 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !881, file: !450, line: 2345, type: !58)
!888 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "end", scope: !881, file: !450, line: 2345, type: !58)
!889 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buflen", scope: !881, file: !450, line: 2346, type: !17)
!890 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !891, file: !450, line: 2353, type: !11)
!891 = distinct !DILexicalBlock(scope: !892, file: !450, line: 2353, column: 12)
!892 = distinct !DILexicalBlock(scope: !893, file: !450, line: 2352, column: 31)
!893 = distinct !DILexicalBlock(scope: !881, file: !450, line: 2352, column: 9)
!894 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !895, file: !450, line: 2360, type: !11)
!895 = distinct !DILexicalBlock(scope: !896, file: !450, line: 2360, column: 16)
!896 = distinct !DILexicalBlock(scope: !897, file: !450, line: 2359, column: 84)
!897 = distinct !DILexicalBlock(scope: !898, file: !450, line: 2359, column: 13)
!898 = distinct !DILexicalBlock(scope: !893, file: !450, line: 2357, column: 10)
!899 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !900, file: !450, line: 2363, type: !11)
!900 = distinct !DILexicalBlock(scope: !898, file: !450, line: 2363, column: 12)
!901 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !902, file: !450, line: 2364, type: !11)
!902 = distinct !DILexicalBlock(scope: !898, file: !450, line: 2364, column: 12)
!903 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !904, file: !450, line: 2364, type: !11)
!904 = distinct !DILexicalBlock(scope: !905, file: !450, line: 2364, column: 102)
!905 = distinct !DILexicalBlock(scope: !902, file: !450, line: 2364, column: 68)
!906 = !DISubprogram(name: "_PyLong_Frexp", scope: !450, file: !450, line: 2583, type: !907, isLocal: false, isDefinition: true, scopeLine: 2584, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct._longobject*, i64*)* @_PyLong_Frexp, variables: !909)
!907 = !DISubroutineType(types: !908)
!908 = !{!366, !350, !254}
!909 = !{!910, !911, !912, !913, !914, !915, !916, !917, !918, !922}
!910 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !906, file: !450, line: 2583, type: !350)
!911 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "e", arg: 2, scope: !906, file: !450, line: 2583, type: !254)
!912 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a_size", scope: !906, file: !450, line: 2585, type: !17)
!913 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a_bits", scope: !906, file: !450, line: 2585, type: !17)
!914 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shift_digits", scope: !906, file: !450, line: 2585, type: !17)
!915 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shift_bits", scope: !906, file: !450, line: 2585, type: !17)
!916 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x_size", scope: !906, file: !450, line: 2585, type: !17)
!917 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rem", scope: !906, file: !450, line: 2587, type: !359)
!918 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x_digits", scope: !906, file: !450, line: 2587, type: !919)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 96, align: 32, elements: !920)
!920 = !{!921}
!921 = !DISubrange(count: 3)
!922 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !906, file: !450, line: 2588, type: !366)
!923 = !DISubprogram(name: "PyLong_AsDouble", scope: !450, file: !450, line: 2696, type: !924, isLocal: false, isDefinition: true, scopeLine: 2697, flags: DIFlagPrototyped, isOptimized: true, function: double (%struct._object*)* @PyLong_AsDouble, variables: !926)
!924 = !DISubroutineType(types: !925)
!925 = !{!366, !11}
!926 = !{!927, !928, !929}
!927 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !923, file: !450, line: 2696, type: !11)
!928 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exponent", scope: !923, file: !450, line: 2698, type: !17)
!929 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !923, file: !450, line: 2699, type: !366)
