; ModuleID = 'programs_new/Python-new/marshal.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !10, subprograms: !467, globals: !1139)
!1 = !DIFile(filename: "marshal.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PyUnicode_Kind", file: !4, line: 451, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "Include/unicodeobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!5 = !{!6, !7, !8, !9}
!6 = !DIEnumerator(name: "PyUnicode_WCHAR_KIND", value: 0)
!7 = !DIEnumerator(name: "PyUnicode_1BYTE_KIND", value: 1)
!8 = !DIEnumerator(name: "PyUnicode_2BYTE_KIND", value: 2)
!9 = !DIEnumerator(name: "PyUnicode_4BYTE_KIND", value: 4)
!10 = !{!11, !12, !59, !101, !350, !18, !38, !358, !370, !51, !378, !379, !397, !400, !408, !399, !24, !424, !432, !441, !466, !459, !367}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !14, line: 109, baseType: !15)
!14 = !DIFile(filename: "Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !14, line: 105, size: 128, align: 64, elements: !16)
!16 = !{!17, !25}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !15, file: !14, line: 107, baseType: !18, size: 64, align: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !19, line: 177, baseType: !20)
!19 = !DIFile(filename: "Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !21, line: 102, baseType: !22)
!21 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !23, line: 181, baseType: !24)
!23 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!24 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !15, file: !14, line: 108, baseType: !26, size: 64, align: 64, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !14, line: 334, size: 3200, align: 64, elements: !28)
!28 = !{!29, !35, !39, !40, !41, !46, !109, !114, !119, !120, !125, !177, !208, !220, !226, !227, !228, !230, !232, !263, !264, !265, !274, !275, !280, !281, !283, !285, !295, !298, !316, !317, !318, !320, !322, !323, !325, !330, !335, !340, !341, !342, !343, !344, !345, !346, !347, !349}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !27, file: !14, line: 335, baseType: !30, size: 192, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !14, line: 114, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 111, size: 192, align: 64, elements: !32)
!32 = !{!33, !34}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !31, file: !14, line: 112, baseType: !13, size: 128, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !31, file: !14, line: 113, baseType: !18, size: 64, align: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !27, file: !14, line: 336, baseType: !36, size: 64, align: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !27, file: !14, line: 337, baseType: !18, size: 64, align: 64, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !27, file: !14, line: 341, baseType: !42, size: 64, align: 64, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !14, line: 308, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !12}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !27, file: !14, line: 342, baseType: !47, size: 64, align: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !14, line: 314, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !12, !52, !51}
!51 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !21, line: 48, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !55, line: 246, size: 1728, align: 64, elements: !56)
!55 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!56 = !{!57, !58, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !78, !79, !80, !81, !83, !85, !87, !91, !94, !96, !97, !98, !99, !100, !104, !105}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !54, file: !55, line: 247, baseType: !51, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !54, file: !55, line: 252, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !54, file: !55, line: 253, baseType: !59, size: 64, align: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !54, file: !55, line: 254, baseType: !59, size: 64, align: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !54, file: !55, line: 255, baseType: !59, size: 64, align: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !54, file: !55, line: 256, baseType: !59, size: 64, align: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !54, file: !55, line: 257, baseType: !59, size: 64, align: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !54, file: !55, line: 258, baseType: !59, size: 64, align: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !54, file: !55, line: 259, baseType: !59, size: 64, align: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !54, file: !55, line: 261, baseType: !59, size: 64, align: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !54, file: !55, line: 262, baseType: !59, size: 64, align: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !54, file: !55, line: 263, baseType: !59, size: 64, align: 64, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !54, file: !55, line: 265, baseType: !71, size: 64, align: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !55, line: 161, size: 192, align: 64, elements: !73)
!73 = !{!74, !75, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !72, file: !55, line: 162, baseType: !71, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !72, file: !55, line: 163, baseType: !76, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !72, file: !55, line: 167, baseType: !51, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !54, file: !55, line: 267, baseType: !76, size: 64, align: 64, offset: 832)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !54, file: !55, line: 269, baseType: !51, size: 32, align: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !54, file: !55, line: 273, baseType: !51, size: 32, align: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !54, file: !55, line: 275, baseType: !82, size: 64, align: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !23, line: 140, baseType: !24)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !54, file: !55, line: 279, baseType: !84, size: 16, align: 16, offset: 1024)
!84 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !54, file: !55, line: 280, baseType: !86, size: 8, align: 8, offset: 1040)
!86 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !54, file: !55, line: 281, baseType: !88, size: 8, align: 8, offset: 1048)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, align: 8, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 1)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !54, file: !55, line: 285, baseType: !92, size: 64, align: 64, offset: 1088)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !55, line: 155, baseType: null)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !54, file: !55, line: 294, baseType: !95, size: 64, align: 64, offset: 1152)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !23, line: 141, baseType: !24)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !54, file: !55, line: 303, baseType: !11, size: 64, align: 64, offset: 1216)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !54, file: !55, line: 304, baseType: !11, size: 64, align: 64, offset: 1280)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !54, file: !55, line: 305, baseType: !11, size: 64, align: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !54, file: !55, line: 306, baseType: !11, size: 64, align: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !54, file: !55, line: 307, baseType: !101, size: 64, align: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 62, baseType: !103)
!102 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!103 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !54, file: !55, line: 309, baseType: !51, size: 32, align: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !54, file: !55, line: 311, baseType: !106, size: 160, align: 8, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, align: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !27, file: !14, line: 343, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !14, line: 316, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!12, !12, !59}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !27, file: !14, line: 344, baseType: !115, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !14, line: 318, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!51, !12, !59, !12}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !27, file: !14, line: 345, baseType: !11, size: 64, align: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !27, file: !14, line: 346, baseType: !121, size: 64, align: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !14, line: 320, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!12, !12}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !27, file: !14, line: 350, baseType: !126, size: 64, align: 64, offset: 768)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !14, line: 278, baseType: !128)
!128 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 236, size: 2176, align: 64, elements: !129)
!129 = !{!130, !135, !136, !137, !138, !139, !144, !146, !147, !148, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !128, file: !14, line: 241, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !14, line: 166, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!12, !12, !12}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !128, file: !14, line: 242, baseType: !131, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !128, file: !14, line: 243, baseType: !131, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !128, file: !14, line: 244, baseType: !131, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !128, file: !14, line: 245, baseType: !131, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !128, file: !14, line: 246, baseType: !140, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !14, line: 167, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!12, !12, !12, !12}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !128, file: !14, line: 247, baseType: !145, size: 64, align: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !14, line: 165, baseType: !122)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !128, file: !14, line: 248, baseType: !145, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !128, file: !14, line: 249, baseType: !145, size: 64, align: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !128, file: !14, line: 250, baseType: !149, size: 64, align: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !14, line: 168, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!51, !12}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !128, file: !14, line: 251, baseType: !145, size: 64, align: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !128, file: !14, line: 252, baseType: !131, size: 64, align: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !128, file: !14, line: 253, baseType: !131, size: 64, align: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !128, file: !14, line: 254, baseType: !131, size: 64, align: 64, offset: 832)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !128, file: !14, line: 255, baseType: !131, size: 64, align: 64, offset: 896)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !128, file: !14, line: 256, baseType: !131, size: 64, align: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !128, file: !14, line: 257, baseType: !145, size: 64, align: 64, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !128, file: !14, line: 258, baseType: !11, size: 64, align: 64, offset: 1088)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !128, file: !14, line: 259, baseType: !145, size: 64, align: 64, offset: 1152)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !128, file: !14, line: 261, baseType: !131, size: 64, align: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !128, file: !14, line: 262, baseType: !131, size: 64, align: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !128, file: !14, line: 263, baseType: !131, size: 64, align: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !128, file: !14, line: 264, baseType: !131, size: 64, align: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !128, file: !14, line: 265, baseType: !140, size: 64, align: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !128, file: !14, line: 266, baseType: !131, size: 64, align: 64, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !128, file: !14, line: 267, baseType: !131, size: 64, align: 64, offset: 1600)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !128, file: !14, line: 268, baseType: !131, size: 64, align: 64, offset: 1664)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !128, file: !14, line: 269, baseType: !131, size: 64, align: 64, offset: 1728)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !128, file: !14, line: 270, baseType: !131, size: 64, align: 64, offset: 1792)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !128, file: !14, line: 272, baseType: !131, size: 64, align: 64, offset: 1856)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !128, file: !14, line: 273, baseType: !131, size: 64, align: 64, offset: 1920)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !128, file: !14, line: 274, baseType: !131, size: 64, align: 64, offset: 1984)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !128, file: !14, line: 275, baseType: !131, size: 64, align: 64, offset: 2048)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !128, file: !14, line: 277, baseType: !145, size: 64, align: 64, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !27, file: !14, line: 351, baseType: !178, size: 64, align: 64, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !14, line: 292, baseType: !180)
!180 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 280, size: 640, align: 64, elements: !181)
!181 = !{!182, !187, !188, !193, !194, !195, !200, !201, !206, !207}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !180, file: !14, line: 281, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !14, line: 169, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!18, !12}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !180, file: !14, line: 282, baseType: !131, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !180, file: !14, line: 283, baseType: !189, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !14, line: 170, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!12, !12, !18}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !180, file: !14, line: 284, baseType: !189, size: 64, align: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !180, file: !14, line: 285, baseType: !11, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !180, file: !14, line: 286, baseType: !196, size: 64, align: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !14, line: 172, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!51, !12, !18, !12}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !180, file: !14, line: 287, baseType: !11, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !180, file: !14, line: 288, baseType: !202, size: 64, align: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !14, line: 231, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!51, !12, !12}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !180, file: !14, line: 290, baseType: !131, size: 64, align: 64, offset: 512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !180, file: !14, line: 291, baseType: !189, size: 64, align: 64, offset: 576)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !27, file: !14, line: 352, baseType: !209, size: 64, align: 64, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !14, line: 298, baseType: !211)
!211 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 294, size: 192, align: 64, elements: !212)
!212 = !{!213, !214, !215}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !211, file: !14, line: 295, baseType: !183, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !211, file: !14, line: 296, baseType: !131, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !211, file: !14, line: 297, baseType: !216, size: 64, align: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !14, line: 174, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64, align: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{!51, !12, !12, !12}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !27, file: !14, line: 356, baseType: !221, size: 64, align: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !14, line: 321, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{!225, !12}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !19, line: 186, baseType: !18)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !27, file: !14, line: 357, baseType: !140, size: 64, align: 64, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !27, file: !14, line: 358, baseType: !121, size: 64, align: 64, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !27, file: !14, line: 359, baseType: !229, size: 64, align: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !14, line: 317, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !27, file: !14, line: 360, baseType: !231, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !14, line: 319, baseType: !217)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !27, file: !14, line: 363, baseType: !233, size: 64, align: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !14, line: 304, baseType: !235)
!235 = !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 301, size: 128, align: 64, elements: !236)
!236 = !{!237, !258}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !235, file: !14, line: 302, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !14, line: 193, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!51, !12, !242, !51}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !14, line: 191, baseType: !244)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !14, line: 178, size: 640, align: 64, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !255, !256, !257}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !244, file: !14, line: 179, baseType: !11, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !244, file: !14, line: 180, baseType: !12, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !244, file: !14, line: 181, baseType: !18, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !244, file: !14, line: 182, baseType: !18, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !244, file: !14, line: 184, baseType: !51, size: 32, align: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !244, file: !14, line: 185, baseType: !51, size: 32, align: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !244, file: !14, line: 186, baseType: !59, size: 64, align: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !244, file: !14, line: 187, baseType: !254, size: 64, align: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !244, file: !14, line: 188, baseType: !254, size: 64, align: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !244, file: !14, line: 189, baseType: !254, size: 64, align: 64, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !244, file: !14, line: 190, baseType: !11, size: 64, align: 64, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !235, file: !14, line: 303, baseType: !259, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !14, line: 194, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !12, !242}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !27, file: !14, line: 366, baseType: !103, size: 64, align: 64, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !27, file: !14, line: 368, baseType: !36, size: 64, align: 64, offset: 1408)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !27, file: !14, line: 372, baseType: !266, size: 64, align: 64, offset: 1472)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !14, line: 233, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!51, !12, !270, !11}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !14, line: 232, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64, align: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!51, !12, !11}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !27, file: !14, line: 375, baseType: !149, size: 64, align: 64, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !27, file: !14, line: 379, baseType: !276, size: 64, align: 64, offset: 1600)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !14, line: 322, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64, align: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!12, !12, !12, !51}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !27, file: !14, line: 382, baseType: !18, size: 64, align: 64, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !27, file: !14, line: 385, baseType: !282, size: 64, align: 64, offset: 1728)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !14, line: 323, baseType: !122)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !27, file: !14, line: 386, baseType: !284, size: 64, align: 64, offset: 1792)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !14, line: 324, baseType: !122)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !27, file: !14, line: 389, baseType: !286, size: 64, align: 64, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !288, line: 40, size: 256, align: 64, elements: !289)
!288 = !DIFile(filename: "Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!289 = !{!290, !291, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !287, file: !288, line: 41, baseType: !36, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !287, file: !288, line: 42, baseType: !292, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !288, line: 18, baseType: !132)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !287, file: !288, line: 43, baseType: !51, size: 32, align: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !287, file: !288, line: 45, baseType: !36, size: 64, align: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !27, file: !14, line: 390, baseType: !296, size: 64, align: 64, offset: 1920)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !14, line: 390, flags: DIFlagFwdDecl)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !27, file: !14, line: 391, baseType: !299, size: 64, align: 64, offset: 1984)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !301, line: 11, size: 320, align: 64, elements: !302)
!301 = !DIFile(filename: "Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!302 = !{!303, !304, !309, !314, !315}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !301, line: 12, baseType: !59, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !300, file: !301, line: 13, baseType: !305, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !301, line: 8, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!12, !12, !11}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !300, file: !301, line: 14, baseType: !310, size: 64, align: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !301, line: 9, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64, align: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!51, !12, !12, !11}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !300, file: !301, line: 15, baseType: !59, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !300, file: !301, line: 16, baseType: !11, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !27, file: !14, line: 392, baseType: !26, size: 64, align: 64, offset: 2048)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !27, file: !14, line: 393, baseType: !12, size: 64, align: 64, offset: 2112)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !27, file: !14, line: 394, baseType: !319, size: 64, align: 64, offset: 2176)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !14, line: 325, baseType: !141)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !27, file: !14, line: 395, baseType: !321, size: 64, align: 64, offset: 2240)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !14, line: 326, baseType: !217)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !27, file: !14, line: 396, baseType: !18, size: 64, align: 64, offset: 2304)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !27, file: !14, line: 397, baseType: !324, size: 64, align: 64, offset: 2368)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !14, line: 327, baseType: !217)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !27, file: !14, line: 398, baseType: !326, size: 64, align: 64, offset: 2432)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !14, line: 329, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!12, !26, !18}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !27, file: !14, line: 399, baseType: !331, size: 64, align: 64, offset: 2496)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !14, line: 328, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!12, !26, !12, !12}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !27, file: !14, line: 400, baseType: !336, size: 64, align: 64, offset: 2560)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !14, line: 307, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64, align: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !11}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !27, file: !14, line: 401, baseType: !149, size: 64, align: 64, offset: 2624)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !27, file: !14, line: 402, baseType: !12, size: 64, align: 64, offset: 2688)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !27, file: !14, line: 403, baseType: !12, size: 64, align: 64, offset: 2752)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !27, file: !14, line: 404, baseType: !12, size: 64, align: 64, offset: 2816)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !27, file: !14, line: 405, baseType: !12, size: 64, align: 64, offset: 2880)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !27, file: !14, line: 406, baseType: !12, size: 64, align: 64, offset: 2944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !27, file: !14, line: 407, baseType: !42, size: 64, align: 64, offset: 3008)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !27, file: !14, line: 410, baseType: !348, size: 32, align: 32, offset: 3072)
!348 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !27, file: !14, line: 412, baseType: !42, size: 64, align: 64, offset: 3136)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBytesObject", file: !352, line: 41, baseType: !353)
!352 = !DIFile(filename: "Include/bytesobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!353 = !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 31, size: 320, align: 64, elements: !354)
!354 = !{!355, !356, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !353, file: !352, line: 32, baseType: !30, size: 192, align: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ob_shash", scope: !353, file: !352, line: 33, baseType: !225, size: 64, align: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ob_sval", scope: !353, file: !352, line: 34, baseType: !88, size: 8, align: 8, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLongObject", file: !360, line: 10, baseType: !361)
!360 = !DIFile(filename: "Include/longobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "_longobject", file: !362, line: 89, size: 256, align: 64, elements: !363)
!362 = !DIFile(filename: "Include/longintrepr.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !361, file: !362, line: 90, baseType: !30, size: 192, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ob_digit", scope: !361, file: !362, line: 91, baseType: !366, size: 32, align: 32, offset: 192)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 32, align: 32, elements: !89)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit", file: !362, line: 49, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !369, line: 51, baseType: !348)
!369 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFloatObject", file: !372, line: 18, baseType: !373)
!372 = !DIFile(filename: "Include/floatobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!373 = !DICompositeType(tag: DW_TAG_structure_type, file: !372, line: 15, size: 192, align: 64, elements: !374)
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !373, file: !372, line: 16, baseType: !13, size: 128, align: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ob_fval", scope: !373, file: !372, line: 17, baseType: !377, size: 64, align: 64, offset: 128)
!377 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyASCIIObject", file: !4, line: 351, baseType: !381)
!381 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 217, size: 384, align: 64, elements: !382)
!382 = !{!383, !384, !385, !386, !394}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !381, file: !4, line: 291, baseType: !13, size: 128, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !381, file: !4, line: 292, baseType: !18, size: 64, align: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !381, file: !4, line: 293, baseType: !225, size: 64, align: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !381, file: !4, line: 349, baseType: !387, size: 32, align: 32, offset: 256)
!387 = !DICompositeType(tag: DW_TAG_structure_type, scope: !381, file: !4, line: 294, size: 32, align: 32, elements: !388)
!388 = !{!389, !390, !391, !392, !393}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "interned", scope: !387, file: !4, line: 303, baseType: !348, size: 2, align: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !387, file: !4, line: 331, baseType: !348, size: 3, align: 32, offset: 2)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "compact", scope: !387, file: !4, line: 336, baseType: !348, size: 1, align: 32, offset: 5)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !387, file: !4, line: 340, baseType: !348, size: 1, align: 32, offset: 6)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !387, file: !4, line: 345, baseType: !348, size: 1, align: 32, offset: 7)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "wstr", scope: !381, file: !4, line: 350, baseType: !395, size: 64, align: 64, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !102, line: 90, baseType: !51)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS1", file: !4, line: 134, baseType: !399)
!399 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCompactUnicodeObject", file: !4, line: 363, baseType: !402)
!402 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 356, size: 576, align: 64, elements: !403)
!403 = !{!404, !405, !406, !407}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !402, file: !4, line: 357, baseType: !380, size: 384, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_length", scope: !402, file: !4, line: 358, baseType: !18, size: 64, align: 64, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !402, file: !4, line: 360, baseType: !59, size: 64, align: 64, offset: 448)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "wstr_length", scope: !402, file: !4, line: 361, baseType: !18, size: 64, align: 64, offset: 512)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyUnicodeObject", file: !4, line: 376, baseType: !410)
!410 = !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 368, size: 640, align: 64, elements: !411)
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !410, file: !4, line: 369, baseType: !401, size: 576, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !410, file: !4, line: 375, baseType: !414, size: 64, align: 64, offset: 576)
!414 = !DICompositeType(tag: DW_TAG_union_type, scope: !410, file: !4, line: 370, size: 64, align: 64, elements: !415)
!415 = !{!416, !417, !418, !421}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "any", scope: !414, file: !4, line: 371, baseType: !11, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "latin1", scope: !414, file: !4, line: 372, baseType: !397, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ucs2", scope: !414, file: !4, line: 373, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS2", file: !4, line: 129, baseType: !84)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ucs4", scope: !414, file: !4, line: 374, baseType: !422, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_UCS4", file: !4, line: 121, baseType: !348)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyTupleObject", file: !426, line: 33, baseType: !427)
!426 = !DIFile(filename: "Include/tupleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!427 = !DICompositeType(tag: DW_TAG_structure_type, file: !426, line: 25, size: 256, align: 64, elements: !428)
!428 = !{!429, !430}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !427, file: !426, line: 26, baseType: !30, size: 192, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !427, file: !426, line: 27, baseType: !431, size: 64, align: 64, offset: 192)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, align: 64, elements: !89)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyListObject", file: !434, line: 40, baseType: !435)
!434 = !DIFile(filename: "Include/listobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!435 = !DICompositeType(tag: DW_TAG_structure_type, file: !434, line: 23, size: 320, align: 64, elements: !436)
!436 = !{!437, !438, !440}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !435, file: !434, line: 24, baseType: !30, size: 192, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ob_item", scope: !435, file: !434, line: 26, baseType: !439, size: 64, align: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !435, file: !434, line: 39, baseType: !18, size: 64, align: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCodeObject", file: !443, line: 33, baseType: !444)
!443 = !DIFile(filename: "Include/code.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!444 = !DICompositeType(tag: DW_TAG_structure_type, file: !443, line: 11, size: 1152, align: 64, elements: !445)
!445 = !{!446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !460, !461, !462, !463, !464, !465}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !444, file: !443, line: 12, baseType: !13, size: 128, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "co_argcount", scope: !444, file: !443, line: 13, baseType: !51, size: 32, align: 32, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "co_kwonlyargcount", scope: !444, file: !443, line: 14, baseType: !51, size: 32, align: 32, offset: 160)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "co_nlocals", scope: !444, file: !443, line: 15, baseType: !51, size: 32, align: 32, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "co_stacksize", scope: !444, file: !443, line: 16, baseType: !51, size: 32, align: 32, offset: 224)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "co_flags", scope: !444, file: !443, line: 17, baseType: !51, size: 32, align: 32, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "co_code", scope: !444, file: !443, line: 18, baseType: !12, size: 64, align: 64, offset: 320)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "co_consts", scope: !444, file: !443, line: 19, baseType: !12, size: 64, align: 64, offset: 384)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "co_names", scope: !444, file: !443, line: 20, baseType: !12, size: 64, align: 64, offset: 448)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "co_varnames", scope: !444, file: !443, line: 21, baseType: !12, size: 64, align: 64, offset: 512)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "co_freevars", scope: !444, file: !443, line: 22, baseType: !12, size: 64, align: 64, offset: 576)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "co_cellvars", scope: !444, file: !443, line: 23, baseType: !12, size: 64, align: 64, offset: 640)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "co_cell2arg", scope: !444, file: !443, line: 25, baseType: !459, size: 64, align: 64, offset: 704)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "co_filename", scope: !444, file: !443, line: 26, baseType: !12, size: 64, align: 64, offset: 768)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "co_name", scope: !444, file: !443, line: 27, baseType: !12, size: 64, align: 64, offset: 832)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "co_firstlineno", scope: !444, file: !443, line: 28, baseType: !51, size: 32, align: 32, offset: 896)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "co_lnotab", scope: !444, file: !443, line: 29, baseType: !12, size: 64, align: 64, offset: 960)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "co_zombieframe", scope: !444, file: !443, line: 31, baseType: !11, size: 64, align: 64, offset: 1024)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "co_weakreflist", scope: !444, file: !443, line: 32, baseType: !12, size: 64, align: 64, offset: 1088)
!466 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!467 = !{!468, !492, !505, !513, !520, !534, !541, !551, !577, !582, !589, !597, !604, !628, !694, !708, !714, !721, !726, !731, !739, !759, !766, !808, !835, !1014, !1021, !1032, !1070, !1079, !1092, !1103, !1118, !1122, !1128}
!468 = !DISubprogram(name: "PyMarshal_WriteLongToFile", scope: !469, file: !469, line: 552, type: !470, isLocal: false, isDefinition: true, scopeLine: 553, flags: DIFlagPrototyped, isOptimized: true, function: void (i64, %struct._IO_FILE*, i32)* @PyMarshal_WriteLongToFile, variables: !472)
!469 = !DIFile(filename: "Python/marshal.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!470 = !DISubroutineType(types: !471)
!471 = !{null, !24, !52, !51}
!472 = !{!473, !474, !475, !476}
!473 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !468, file: !469, line: 552, type: !24)
!474 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !468, file: !469, line: 552, type: !52)
!475 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "version", arg: 3, scope: !468, file: !469, line: 552, type: !51)
!476 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wf", scope: !468, file: !469, line: 554, type: !477)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "WFILE", file: !469, line: 79, baseType: !478)
!478 = !DICompositeType(tag: DW_TAG_structure_type, file: !469, line: 65, size: 704, align: 64, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !478, file: !469, line: 66, baseType: !52, size: 64, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !478, file: !469, line: 67, baseType: !51, size: 32, align: 32, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !478, file: !469, line: 68, baseType: !51, size: 32, align: 32, offset: 96)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "readable", scope: !478, file: !469, line: 70, baseType: !12, size: 64, align: 64, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !478, file: !469, line: 71, baseType: !12, size: 64, align: 64, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "current_filename", scope: !478, file: !469, line: 72, baseType: !12, size: 64, align: 64, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !478, file: !469, line: 73, baseType: !59, size: 64, align: 64, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !478, file: !469, line: 74, baseType: !59, size: 64, align: 64, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !478, file: !469, line: 75, baseType: !59, size: 64, align: 64, offset: 448)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !478, file: !469, line: 76, baseType: !18, size: 64, align: 64, offset: 512)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !478, file: !469, line: 77, baseType: !12, size: 64, align: 64, offset: 576)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !478, file: !469, line: 78, baseType: !51, size: 32, align: 32, offset: 640)
!492 = !DISubprogram(name: "PyMarshal_WriteObjectToFile", scope: !469, file: !469, line: 564, type: !493, isLocal: false, isDefinition: true, scopeLine: 565, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, %struct._IO_FILE*, i32)* @PyMarshal_WriteObjectToFile, variables: !495)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !12, !52, !51}
!495 = !{!496, !497, !498, !499, !500, !502}
!496 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !492, file: !469, line: 564, type: !12)
!497 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 2, scope: !492, file: !469, line: 564, type: !52)
!498 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "version", arg: 3, scope: !492, file: !469, line: 564, type: !51)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wf", scope: !492, file: !469, line: 566, type: !477)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !501, file: !469, line: 577, type: !12)
!501 = distinct !DILexicalBlock(scope: !492, file: !469, line: 577, column: 8)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !503, file: !469, line: 577, type: !12)
!503 = distinct !DILexicalBlock(scope: !504, file: !469, line: 577, column: 99)
!504 = distinct !DILexicalBlock(scope: !501, file: !469, line: 577, column: 65)
!505 = !DISubprogram(name: "PyMarshal_ReadShortFromFile", scope: !469, file: !469, line: 1388, type: !506, isLocal: false, isDefinition: true, scopeLine: 1389, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._IO_FILE*)* @PyMarshal_ReadShortFromFile, variables: !508)
!506 = !DISubroutineType(types: !507)
!507 = !{!51, !52}
!508 = !{!509, !510, !512}
!509 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !505, file: !469, line: 1388, type: !52)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rf", scope: !505, file: !469, line: 1390, type: !511)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "RFILE", file: !469, line: 580, baseType: !477)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !505, file: !469, line: 1391, type: !51)
!513 = !DISubprogram(name: "PyMarshal_ReadLongFromFile", scope: !469, file: !469, line: 1405, type: !514, isLocal: false, isDefinition: true, scopeLine: 1406, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._IO_FILE*)* @PyMarshal_ReadLongFromFile, variables: !516)
!514 = !DISubroutineType(types: !515)
!515 = !{!24, !52}
!516 = !{!517, !518, !519}
!517 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !513, file: !469, line: 1405, type: !52)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rf", scope: !513, file: !469, line: 1407, type: !511)
!519 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !513, file: !469, line: 1408, type: !24)
!520 = !DISubprogram(name: "PyMarshal_ReadLastObjectFromFile", scope: !469, file: !469, line: 1440, type: !521, isLocal: false, isDefinition: true, scopeLine: 1441, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._IO_FILE*)* @PyMarshal_ReadLastObjectFromFile, variables: !523)
!521 = !DISubroutineType(types: !522)
!522 = !{!12, !52}
!523 = !{!524, !525, !527, !530, !533}
!524 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !520, file: !469, line: 1440, type: !52)
!525 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "filesize", scope: !520, file: !469, line: 1445, type: !526)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !21, line: 92, baseType: !95)
!527 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pBuf", scope: !528, file: !469, line: 1448, type: !59)
!528 = distinct !DILexicalBlock(scope: !529, file: !469, line: 1447, column: 49)
!529 = distinct !DILexicalBlock(scope: !520, file: !469, line: 1447, column: 9)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !531, file: !469, line: 1450, type: !101)
!531 = distinct !DILexicalBlock(scope: !532, file: !469, line: 1449, column: 33)
!532 = distinct !DILexicalBlock(scope: !528, file: !469, line: 1449, column: 13)
!533 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !531, file: !469, line: 1451, type: !12)
!534 = !DISubprogram(name: "PyMarshal_ReadObjectFromFile", scope: !469, file: !469, line: 1467, type: !521, isLocal: false, isDefinition: true, scopeLine: 1468, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._IO_FILE*)* @PyMarshal_ReadObjectFromFile, variables: !535)
!535 = !{!536, !537, !538, !539}
!536 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !534, file: !469, line: 1467, type: !52)
!537 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rf", scope: !534, file: !469, line: 1469, type: !511)
!538 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !534, file: !469, line: 1470, type: !12)
!539 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !540, file: !469, line: 1481, type: !12)
!540 = distinct !DILexicalBlock(scope: !534, file: !469, line: 1481, column: 8)
!541 = !DISubprogram(name: "PyMarshal_ReadObjectFromString", scope: !469, file: !469, line: 1488, type: !542, isLocal: false, isDefinition: true, scopeLine: 1489, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i8*, i64)* @PyMarshal_ReadObjectFromString, variables: !544)
!542 = !DISubroutineType(types: !543)
!543 = !{!12, !36, !18}
!544 = !{!545, !546, !547, !548, !549}
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "str", arg: 1, scope: !541, file: !469, line: 1488, type: !36)
!546 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "len", arg: 2, scope: !541, file: !469, line: 1488, type: !18)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rf", scope: !541, file: !469, line: 1490, type: !511)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !541, file: !469, line: 1491, type: !12)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !550, file: !469, line: 1503, type: !12)
!550 = distinct !DILexicalBlock(scope: !541, file: !469, line: 1503, column: 8)
!551 = !DISubprogram(name: "PyMarshal_WriteObjectToString", scope: !469, file: !469, line: 1510, type: !552, isLocal: false, isDefinition: true, scopeLine: 1511, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, i32)* @PyMarshal_WriteObjectToString, variables: !554)
!552 = !DISubroutineType(types: !553)
!553 = !{!12, !12, !51}
!554 = !{!555, !556, !557, !558, !560, !563, !566, !570, !574}
!555 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !551, file: !469, line: 1510, type: !12)
!556 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "version", arg: 2, scope: !551, file: !469, line: 1510, type: !51)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "wf", scope: !551, file: !469, line: 1512, type: !477)
!558 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !559, file: !469, line: 1530, type: !12)
!559 = distinct !DILexicalBlock(scope: !551, file: !469, line: 1530, column: 8)
!560 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !561, file: !469, line: 1530, type: !12)
!561 = distinct !DILexicalBlock(scope: !562, file: !469, line: 1530, column: 99)
!562 = distinct !DILexicalBlock(scope: !559, file: !469, line: 1530, column: 65)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !564, file: !469, line: 1532, type: !59)
!564 = distinct !DILexicalBlock(scope: !565, file: !469, line: 1531, column: 31)
!565 = distinct !DILexicalBlock(scope: !551, file: !469, line: 1531, column: 9)
!566 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !567, file: !469, line: 1534, type: !12)
!567 = distinct !DILexicalBlock(scope: !568, file: !469, line: 1534, column: 16)
!568 = distinct !DILexicalBlock(scope: !569, file: !469, line: 1533, column: 62)
!569 = distinct !DILexicalBlock(scope: !564, file: !469, line: 1533, column: 13)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !571, file: !469, line: 1543, type: !12)
!571 = distinct !DILexicalBlock(scope: !572, file: !469, line: 1543, column: 12)
!572 = distinct !DILexicalBlock(scope: !573, file: !469, line: 1542, column: 24)
!573 = distinct !DILexicalBlock(scope: !551, file: !469, line: 1542, column: 9)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !575, file: !469, line: 1543, type: !12)
!575 = distinct !DILexicalBlock(scope: !576, file: !469, line: 1543, column: 102)
!576 = distinct !DILexicalBlock(scope: !571, file: !469, line: 1543, column: 68)
!577 = !DISubprogram(name: "PyMarshal_Init", scope: !469, file: !469, line: 1752, type: !578, isLocal: false, isDefinition: true, scopeLine: 1753, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyMarshal_Init, variables: !580)
!578 = !DISubroutineType(types: !579)
!579 = !{!12}
!580 = !{!581}
!581 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mod", scope: !577, file: !469, line: 1754, type: !12)
!582 = !DISubprogram(name: "w_long", scope: !469, file: !469, line: 129, type: !583, isLocal: true, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: true, function: void (i64, %struct.WFILE*)* @w_long, variables: !586)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !24, !585}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!586 = !{!587, !588}
!587 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !582, file: !469, line: 129, type: !24)
!588 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !582, file: !469, line: 129, type: !585)
!589 = !DISubprogram(name: "w_more", scope: !469, file: !469, line: 86, type: !590, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: true, function: void (i8, %struct.WFILE*)* @w_more, variables: !592)
!590 = !DISubroutineType(types: !591)
!591 = !{null, !38, !585}
!592 = !{!593, !594, !595, !596}
!593 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "c", arg: 1, scope: !589, file: !469, line: 86, type: !38)
!594 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !589, file: !469, line: 86, type: !585)
!595 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !589, file: !469, line: 88, type: !18)
!596 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "newsize", scope: !589, file: !469, line: 88, type: !18)
!597 = !DISubprogram(name: "w_object", scope: !469, file: !469, line: 280, type: !598, isLocal: true, isDefinition: true, scopeLine: 281, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, %struct.WFILE*)* @w_object, variables: !600)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !12, !585}
!600 = !{!601, !602, !603}
!601 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !597, file: !469, line: 280, type: !12)
!602 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !597, file: !469, line: 280, type: !585)
!603 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flag", scope: !597, file: !469, line: 282, type: !38)
!604 = !DISubprogram(name: "w_ref", scope: !469, file: !469, line: 226, type: !605, isLocal: true, isDefinition: true, scopeLine: 227, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct._object*, i8*, %struct.WFILE*)* @w_ref, variables: !607)
!605 = !DISubroutineType(types: !606)
!606 = !{!51, !12, !59, !585}
!607 = !{!608, !609, !610, !611, !612, !613, !616, !618, !620, !621, !623, !625}
!608 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !604, file: !469, line: 226, type: !12)
!609 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flag", arg: 2, scope: !604, file: !469, line: 226, type: !59)
!610 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 3, scope: !604, file: !469, line: 226, type: !585)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "id", scope: !604, file: !469, line: 228, type: !12)
!612 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !604, file: !469, line: 229, type: !12)
!613 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "w", scope: !614, file: !469, line: 244, type: !24)
!614 = distinct !DILexicalBlock(scope: !615, file: !469, line: 242, column: 28)
!615 = distinct !DILexicalBlock(scope: !604, file: !469, line: 242, column: 9)
!616 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !617, file: !469, line: 245, type: !12)
!617 = distinct !DILexicalBlock(scope: !614, file: !469, line: 245, column: 12)
!618 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ok", scope: !619, file: !469, line: 255, type: !51)
!619 = distinct !DILexicalBlock(scope: !615, file: !469, line: 254, column: 12)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "s", scope: !619, file: !469, line: 256, type: !18)
!621 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !622, file: !469, line: 264, type: !12)
!622 = distinct !DILexicalBlock(scope: !619, file: !469, line: 264, column: 12)
!623 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !624, file: !469, line: 265, type: !12)
!624 = distinct !DILexicalBlock(scope: !619, file: !469, line: 265, column: 12)
!625 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !626, file: !469, line: 265, type: !12)
!626 = distinct !DILexicalBlock(scope: !627, file: !469, line: 265, column: 99)
!627 = distinct !DILexicalBlock(scope: !624, file: !469, line: 265, column: 65)
!628 = !DISubprogram(name: "w_complex_object", scope: !469, file: !469, line: 314, type: !629, isLocal: true, isDefinition: true, scopeLine: 315, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._object*, i8, %struct.WFILE*)* @w_complex_object, variables: !631)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !12, !38, !585}
!631 = !{!632, !633, !634, !635, !636, !637, !640, !643, !645, !653, !655, !660, !662, !668, !670, !672, !677, !678, !679, !682, !683, !686, !688, !691}
!632 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "v", arg: 1, scope: !628, file: !469, line: 314, type: !12)
!633 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flag", arg: 2, scope: !628, file: !469, line: 314, type: !38)
!634 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 3, scope: !628, file: !469, line: 314, type: !585)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !628, file: !469, line: 316, type: !18)
!636 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !628, file: !469, line: 316, type: !18)
!637 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !638, file: !469, line: 319, type: !24)
!638 = distinct !DILexicalBlock(scope: !639, file: !469, line: 318, column: 56)
!639 = distinct !DILexicalBlock(scope: !628, file: !469, line: 318, column: 9)
!640 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ob", scope: !641, file: !469, line: 321, type: !358)
!641 = distinct !DILexicalBlock(scope: !642, file: !469, line: 320, column: 44)
!642 = distinct !DILexicalBlock(scope: !638, file: !469, line: 320, column: 13)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !644, file: !469, line: 327, type: !24)
!644 = distinct !DILexicalBlock(scope: !642, file: !469, line: 325, column: 14)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !646, file: !469, line: 342, type: !650)
!646 = distinct !DILexicalBlock(scope: !647, file: !469, line: 341, column: 29)
!647 = distinct !DILexicalBlock(scope: !648, file: !469, line: 341, column: 13)
!648 = distinct !DILexicalBlock(scope: !649, file: !469, line: 340, column: 62)
!649 = distinct !DILexicalBlock(scope: !639, file: !469, line: 340, column: 14)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 64, align: 8, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 8)
!653 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !654, file: !469, line: 352, type: !59)
!654 = distinct !DILexicalBlock(scope: !647, file: !469, line: 351, column: 14)
!655 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !656, file: !469, line: 367, type: !650)
!656 = distinct !DILexicalBlock(scope: !657, file: !469, line: 366, column: 29)
!657 = distinct !DILexicalBlock(scope: !658, file: !469, line: 366, column: 13)
!658 = distinct !DILexicalBlock(scope: !659, file: !469, line: 365, column: 64)
!659 = distinct !DILexicalBlock(scope: !649, file: !469, line: 365, column: 14)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !661, file: !469, line: 383, type: !59)
!661 = distinct !DILexicalBlock(scope: !657, file: !469, line: 382, column: 14)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "is_short", scope: !663, file: !469, line: 413, type: !51)
!663 = distinct !DILexicalBlock(scope: !664, file: !469, line: 412, column: 96)
!664 = distinct !DILexicalBlock(scope: !665, file: !469, line: 412, column: 13)
!665 = distinct !DILexicalBlock(scope: !666, file: !469, line: 411, column: 64)
!666 = distinct !DILexicalBlock(scope: !667, file: !469, line: 411, column: 14)
!667 = distinct !DILexicalBlock(scope: !659, file: !469, line: 407, column: 14)
!668 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "utf8", scope: !669, file: !469, line: 432, type: !12)
!669 = distinct !DILexicalBlock(scope: !664, file: !469, line: 431, column: 14)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !671, file: !469, line: 444, type: !12)
!671 = distinct !DILexicalBlock(scope: !669, file: !469, line: 444, column: 16)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !673, file: !469, line: 470, type: !18)
!673 = distinct !DILexicalBlock(scope: !674, file: !469, line: 469, column: 61)
!674 = distinct !DILexicalBlock(scope: !675, file: !469, line: 469, column: 14)
!675 = distinct !DILexicalBlock(scope: !676, file: !469, line: 461, column: 14)
!676 = distinct !DILexicalBlock(scope: !666, file: !469, line: 447, column: 14)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !673, file: !469, line: 471, type: !12)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !673, file: !469, line: 471, type: !12)
!679 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "value", scope: !680, file: !469, line: 482, type: !12)
!680 = distinct !DILexicalBlock(scope: !681, file: !469, line: 481, column: 112)
!681 = distinct !DILexicalBlock(scope: !674, file: !469, line: 481, column: 14)
!682 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "it", scope: !680, file: !469, line: 482, type: !12)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !684, file: !469, line: 503, type: !12)
!684 = distinct !DILexicalBlock(scope: !685, file: !469, line: 503, column: 16)
!685 = distinct !DILexicalBlock(scope: !680, file: !469, line: 501, column: 57)
!686 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !687, file: !469, line: 505, type: !12)
!687 = distinct !DILexicalBlock(scope: !680, file: !469, line: 505, column: 12)
!688 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "co", scope: !689, file: !469, line: 513, type: !441)
!689 = distinct !DILexicalBlock(scope: !690, file: !469, line: 512, column: 61)
!690 = distinct !DILexicalBlock(scope: !681, file: !469, line: 512, column: 14)
!691 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "view", scope: !692, file: !469, line: 533, type: !243)
!692 = distinct !DILexicalBlock(scope: !693, file: !469, line: 531, column: 120)
!693 = distinct !DILexicalBlock(scope: !690, file: !469, line: 531, column: 14)
!694 = !DISubprogram(name: "w_PyLong", scope: !469, file: !469, line: 183, type: !695, isLocal: true, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true, function: void (%struct._longobject*, i8, %struct.WFILE*)* @w_PyLong, variables: !699)
!695 = !DISubroutineType(types: !696)
!696 = !{null, !697, !38, !585}
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64, align: 64)
!698 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !359)
!699 = !{!700, !701, !702, !703, !704, !705, !706, !707}
!700 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ob", arg: 1, scope: !694, file: !469, line: 183, type: !697)
!701 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "flag", arg: 2, scope: !694, file: !469, line: 183, type: !38)
!702 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 3, scope: !694, file: !469, line: 183, type: !585)
!703 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !694, file: !469, line: 185, type: !18)
!704 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !694, file: !469, line: 185, type: !18)
!705 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !694, file: !469, line: 185, type: !18)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "l", scope: !694, file: !469, line: 185, type: !18)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "d", scope: !694, file: !469, line: 186, type: !367)
!708 = !DISubprogram(name: "w_short", scope: !469, file: !469, line: 122, type: !709, isLocal: true, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: true, function: void (i32, %struct.WFILE*)* @w_short, variables: !711)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !51, !585}
!711 = !{!712, !713}
!712 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !708, file: !469, line: 122, type: !51)
!713 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !708, file: !469, line: 122, type: !585)
!714 = !DISubprogram(name: "w_string", scope: !469, file: !469, line: 108, type: !715, isLocal: true, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i64, %struct.WFILE*)* @w_string, variables: !717)
!715 = !DISubroutineType(types: !716)
!716 = !{null, !36, !18, !585}
!717 = !{!718, !719, !720}
!718 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !714, file: !469, line: 108, type: !36)
!719 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !714, file: !469, line: 108, type: !18)
!720 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 3, scope: !714, file: !469, line: 108, type: !585)
!721 = !DISubprogram(name: "w_pstring", scope: !469, file: !469, line: 153, type: !715, isLocal: true, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i64, %struct.WFILE*)* @w_pstring, variables: !722)
!722 = !{!723, !724, !725}
!723 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !721, file: !469, line: 153, type: !36)
!724 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !721, file: !469, line: 153, type: !18)
!725 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 3, scope: !721, file: !469, line: 153, type: !585)
!726 = !DISubprogram(name: "w_short_pstring", scope: !469, file: !469, line: 160, type: !715, isLocal: true, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: true, function: void (i8*, i64, %struct.WFILE*)* @w_short_pstring, variables: !727)
!727 = !{!728, !729, !730}
!728 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "s", arg: 1, scope: !726, file: !469, line: 160, type: !36)
!729 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !726, file: !469, line: 160, type: !18)
!730 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 3, scope: !726, file: !469, line: 160, type: !585)
!731 = !DISubprogram(name: "r_short", scope: !469, file: !469, line: 676, type: !732, isLocal: true, isDefinition: true, scopeLine: 677, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.WFILE*)* @r_short, variables: !735)
!732 = !DISubroutineType(types: !733)
!733 = !{!51, !734}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64, align: 64)
!735 = !{!736, !737, !738}
!736 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !731, file: !469, line: 676, type: !734)
!737 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !731, file: !469, line: 678, type: !466)
!738 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !731, file: !469, line: 679, type: !459)
!739 = !DISubprogram(name: "r_string", scope: !469, file: !469, line: 583, type: !740, isLocal: true, isDefinition: true, scopeLine: 584, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i64, %struct.WFILE*)* @r_string, variables: !742)
!740 = !DISubroutineType(types: !741)
!741 = !{!59, !18, !734}
!742 = !{!743, !744, !745, !746, !749, !750, !753, !754, !755}
!743 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !739, file: !469, line: 583, type: !18)
!744 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 2, scope: !739, file: !469, line: 583, type: !734)
!745 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "read", scope: !739, file: !469, line: 585, type: !18)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !747, file: !469, line: 589, type: !59)
!747 = distinct !DILexicalBlock(scope: !748, file: !469, line: 587, column: 31)
!748 = distinct !DILexicalBlock(scope: !739, file: !469, line: 587, column: 9)
!749 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left", scope: !747, file: !469, line: 590, type: !18)
!750 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "res", scope: !751, file: !469, line: 622, type: !12)
!751 = distinct !DILexicalBlock(scope: !752, file: !469, line: 620, column: 10)
!752 = distinct !DILexicalBlock(scope: !739, file: !469, line: 616, column: 9)
!753 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mview", scope: !751, file: !469, line: 622, type: !12)
!754 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !751, file: !469, line: 623, type: !243)
!755 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !756, file: !469, line: 634, type: !12)
!756 = distinct !DILexicalBlock(scope: !757, file: !469, line: 634, column: 16)
!757 = distinct !DILexicalBlock(scope: !758, file: !469, line: 632, column: 32)
!758 = distinct !DILexicalBlock(scope: !751, file: !469, line: 632, column: 13)
!759 = !DISubprogram(name: "r_long", scope: !469, file: !469, line: 692, type: !760, isLocal: true, isDefinition: true, scopeLine: 693, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct.WFILE*)* @r_long, variables: !762)
!760 = !DISubroutineType(types: !761)
!761 = !{!24, !734}
!762 = !{!763, !764, !765}
!763 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !759, file: !469, line: 692, type: !734)
!764 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !759, file: !469, line: 694, type: !24)
!765 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !759, file: !469, line: 695, type: !459)
!766 = !DISubprogram(name: "getfilesize", scope: !469, file: !469, line: 1423, type: !767, isLocal: true, isDefinition: true, scopeLine: 1424, flags: DIFlagPrototyped, isOptimized: true, function: i64 (%struct._IO_FILE*)* @getfilesize, variables: !769)
!767 = !DISubroutineType(types: !768)
!768 = !{!526, !52}
!769 = !{!770, !771}
!770 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "fp", arg: 1, scope: !766, file: !469, line: 1423, type: !52)
!771 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "st", scope: !766, file: !469, line: 1425, type: !772)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !773, line: 46, size: 1152, align: 64, elements: !774)
!773 = !DIFile(filename: "/usr/include/bits/stat.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!774 = !{!775, !777, !779, !781, !783, !785, !787, !788, !789, !790, !792, !794, !802, !803, !804}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !772, file: !773, line: 48, baseType: !776, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !23, line: 133, baseType: !103)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !772, file: !773, line: 53, baseType: !778, size: 64, align: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !23, line: 136, baseType: !103)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !772, file: !773, line: 61, baseType: !780, size: 64, align: 64, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !23, line: 139, baseType: !103)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !772, file: !773, line: 62, baseType: !782, size: 32, align: 32, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !23, line: 138, baseType: !348)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !772, file: !773, line: 64, baseType: !784, size: 32, align: 32, offset: 224)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !23, line: 134, baseType: !348)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !772, file: !773, line: 65, baseType: !786, size: 32, align: 32, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !23, line: 135, baseType: !348)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !772, file: !773, line: 67, baseType: !51, size: 32, align: 32, offset: 288)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !772, file: !773, line: 69, baseType: !776, size: 64, align: 64, offset: 320)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !772, file: !773, line: 74, baseType: !82, size: 64, align: 64, offset: 384)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !772, file: !773, line: 78, baseType: !791, size: 64, align: 64, offset: 448)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !23, line: 162, baseType: !24)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !772, file: !773, line: 80, baseType: !793, size: 64, align: 64, offset: 512)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !23, line: 167, baseType: !24)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !772, file: !773, line: 91, baseType: !795, size: 128, align: 64, offset: 576)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !796, line: 120, size: 128, align: 64, elements: !797)
!796 = !DIFile(filename: "/usr/include/time.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!797 = !{!798, !800}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !795, file: !796, line: 122, baseType: !799, size: 64, align: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !23, line: 148, baseType: !24)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !795, file: !796, line: 123, baseType: !801, size: 64, align: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !23, line: 184, baseType: !24)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !772, file: !773, line: 92, baseType: !795, size: 128, align: 64, offset: 704)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !772, file: !773, line: 93, baseType: !795, size: 128, align: 64, offset: 832)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !772, file: !773, line: 106, baseType: !805, size: 192, align: 64, offset: 960)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !801, size: 192, align: 64, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 3)
!808 = !DISubprogram(name: "fstat64", scope: !809, file: !809, line: 517, type: !810, isLocal: false, isDefinition: true, scopeLine: 518, flags: DIFlagPrototyped, isOptimized: true, function: i32 (i32, %struct.stat64*)* @fstat64, variables: !832)
!809 = !DIFile(filename: "/usr/include/sys/stat.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!810 = !DISubroutineType(types: !811)
!811 = !{!51, !51, !812}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64, align: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !773, line: 119, size: 1152, align: 64, elements: !814)
!814 = !{!815, !816, !818, !819, !820, !821, !822, !823, !824, !825, !826, !828, !829, !830, !831}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !813, file: !773, line: 121, baseType: !776, size: 64, align: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !813, file: !773, line: 123, baseType: !817, size: 64, align: 64, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !23, line: 137, baseType: !103)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !813, file: !773, line: 124, baseType: !780, size: 64, align: 64, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !813, file: !773, line: 125, baseType: !782, size: 32, align: 32, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !813, file: !773, line: 132, baseType: !784, size: 32, align: 32, offset: 224)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !813, file: !773, line: 133, baseType: !786, size: 32, align: 32, offset: 256)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !813, file: !773, line: 135, baseType: !51, size: 32, align: 32, offset: 288)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !813, file: !773, line: 136, baseType: !776, size: 64, align: 64, offset: 320)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !813, file: !773, line: 137, baseType: !82, size: 64, align: 64, offset: 384)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !813, file: !773, line: 143, baseType: !791, size: 64, align: 64, offset: 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !813, file: !773, line: 144, baseType: !827, size: 64, align: 64, offset: 512)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !23, line: 168, baseType: !24)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !813, file: !773, line: 152, baseType: !795, size: 128, align: 64, offset: 576)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !813, file: !773, line: 153, baseType: !795, size: 128, align: 64, offset: 704)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !813, file: !773, line: 154, baseType: !795, size: 128, align: 64, offset: 832)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !813, file: !773, line: 164, baseType: !805, size: 192, align: 64, offset: 960)
!832 = !{!833, !834}
!833 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__fd", arg: 1, scope: !808, file: !809, line: 517, type: !51)
!834 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "__statbuf", arg: 2, scope: !808, file: !809, line: 517, type: !812)
!835 = !DISubprogram(name: "r_object", scope: !469, file: !469, line: 841, type: !836, isLocal: true, isDefinition: true, scopeLine: 842, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct.WFILE*)* @r_object, variables: !838)
!836 = !DISubroutineType(types: !837)
!837 = !{!12, !734}
!838 = !{!839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !856, !857, !858, !860, !861, !863, !864, !871, !873, !874, !876, !880, !882, !884, !891, !898, !902, !903, !907, !911, !913, !915, !917, !921, !926, !930, !937, !941, !943, !945, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !969, !971, !974, !976, !979, !981, !984, !986, !989, !991, !994, !996, !999, !1001, !1004, !1006, !1009, !1011}
!839 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 1, scope: !835, file: !469, line: 841, type: !734)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !835, file: !469, line: 845, type: !12)
!841 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v2", scope: !835, file: !469, line: 845, type: !12)
!842 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !835, file: !469, line: 846, type: !18)
!843 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !835, file: !469, line: 847, type: !24)
!844 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !835, file: !469, line: 847, type: !24)
!845 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "type", scope: !835, file: !469, line: 848, type: !51)
!846 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "code", scope: !835, file: !469, line: 848, type: !51)
!847 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "flag", scope: !835, file: !469, line: 849, type: !51)
!848 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "is_interned", scope: !835, file: !469, line: 849, type: !51)
!849 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "retval", scope: !835, file: !469, line: 850, type: !12)
!850 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !851, file: !469, line: 917, type: !853)
!851 = distinct !DILexicalBlock(scope: !852, file: !469, line: 916, column: 9)
!852 = distinct !DILexicalBlock(scope: !835, file: !469, line: 874, column: 19)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 2048, align: 8, elements: !854)
!854 = !{!855}
!855 = !DISubrange(count: 256)
!856 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !851, file: !469, line: 917, type: !59)
!857 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !851, file: !469, line: 918, type: !377)
!858 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !859, file: !469, line: 940, type: !459)
!859 = distinct !DILexicalBlock(scope: !852, file: !469, line: 939, column: 9)
!860 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !859, file: !469, line: 941, type: !377)
!861 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !862, file: !469, line: 955, type: !853)
!862 = distinct !DILexicalBlock(scope: !852, file: !469, line: 954, column: 9)
!863 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !862, file: !469, line: 955, type: !59)
!864 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !862, file: !469, line: 956, type: !865)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_complex", file: !866, line: 13, baseType: !867)
!866 = !DIFile(filename: "Include/complexobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!867 = !DICompositeType(tag: DW_TAG_structure_type, file: !866, line: 10, size: 128, align: 64, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !867, file: !866, line: 11, baseType: !377, size: 64, align: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !867, file: !866, line: 12, baseType: !377, size: 64, align: 64, offset: 64)
!871 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buf", scope: !872, file: !469, line: 992, type: !459)
!872 = distinct !DILexicalBlock(scope: !852, file: !469, line: 991, column: 9)
!873 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "c", scope: !872, file: !469, line: 993, type: !865)
!874 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !875, file: !469, line: 1013, type: !59)
!875 = distinct !DILexicalBlock(scope: !852, file: !469, line: 1012, column: 9)
!876 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !877, file: !469, line: 1026, type: !12)
!877 = distinct !DILexicalBlock(scope: !878, file: !469, line: 1026, column: 20)
!878 = distinct !DILexicalBlock(scope: !879, file: !469, line: 1025, column: 36)
!879 = distinct !DILexicalBlock(scope: !875, file: !469, line: 1025, column: 17)
!880 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !881, file: !469, line: 1058, type: !59)
!881 = distinct !DILexicalBlock(scope: !852, file: !469, line: 1057, column: 9)
!882 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "buffer", scope: !883, file: !469, line: 1076, type: !59)
!883 = distinct !DILexicalBlock(scope: !852, file: !469, line: 1075, column: 9)
!884 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !885, file: !469, line: 1128, type: !12)
!885 = distinct !DILexicalBlock(scope: !886, file: !469, line: 1128, column: 20)
!886 = distinct !DILexicalBlock(scope: !887, file: !469, line: 1124, column: 37)
!887 = distinct !DILexicalBlock(scope: !888, file: !469, line: 1124, column: 18)
!888 = distinct !DILexicalBlock(scope: !889, file: !469, line: 1122, column: 33)
!889 = distinct !DILexicalBlock(scope: !890, file: !469, line: 1122, column: 9)
!890 = distinct !DILexicalBlock(scope: !852, file: !469, line: 1122, column: 9)
!891 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !892, file: !469, line: 1155, type: !12)
!892 = distinct !DILexicalBlock(scope: !893, file: !469, line: 1155, column: 20)
!893 = distinct !DILexicalBlock(scope: !894, file: !469, line: 1151, column: 37)
!894 = distinct !DILexicalBlock(scope: !895, file: !469, line: 1151, column: 18)
!895 = distinct !DILexicalBlock(scope: !896, file: !469, line: 1149, column: 33)
!896 = distinct !DILexicalBlock(scope: !897, file: !469, line: 1149, column: 9)
!897 = distinct !DILexicalBlock(scope: !852, file: !469, line: 1149, column: 9)
!898 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "key", scope: !899, file: !469, line: 1170, type: !12)
!899 = distinct !DILexicalBlock(scope: !900, file: !469, line: 1169, column: 18)
!900 = distinct !DILexicalBlock(scope: !901, file: !469, line: 1169, column: 9)
!901 = distinct !DILexicalBlock(scope: !852, file: !469, line: 1169, column: 9)
!902 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "val", scope: !899, file: !469, line: 1170, type: !12)
!903 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !904, file: !469, line: 1176, type: !12)
!904 = distinct !DILexicalBlock(scope: !905, file: !469, line: 1176, column: 20)
!905 = distinct !DILexicalBlock(scope: !906, file: !469, line: 1175, column: 36)
!906 = distinct !DILexicalBlock(scope: !899, file: !469, line: 1175, column: 17)
!907 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !908, file: !469, line: 1180, type: !12)
!908 = distinct !DILexicalBlock(scope: !909, file: !469, line: 1180, column: 20)
!909 = distinct !DILexicalBlock(scope: !910, file: !469, line: 1179, column: 50)
!910 = distinct !DILexicalBlock(scope: !899, file: !469, line: 1179, column: 17)
!911 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !912, file: !469, line: 1181, type: !12)
!912 = distinct !DILexicalBlock(scope: !909, file: !469, line: 1181, column: 20)
!913 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !914, file: !469, line: 1184, type: !12)
!914 = distinct !DILexicalBlock(scope: !899, file: !469, line: 1184, column: 16)
!915 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !916, file: !469, line: 1185, type: !12)
!916 = distinct !DILexicalBlock(scope: !899, file: !469, line: 1185, column: 16)
!917 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !918, file: !469, line: 1188, type: !12)
!918 = distinct !DILexicalBlock(scope: !919, file: !469, line: 1188, column: 16)
!919 = distinct !DILexicalBlock(scope: !920, file: !469, line: 1187, column: 31)
!920 = distinct !DILexicalBlock(scope: !852, file: !469, line: 1187, column: 13)
!921 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_tmp", scope: !922, file: !469, line: 1212, type: !12)
!922 = distinct !DILexicalBlock(scope: !923, file: !469, line: 1212, column: 20)
!923 = distinct !DILexicalBlock(scope: !924, file: !469, line: 1211, column: 17)
!924 = distinct !DILexicalBlock(scope: !925, file: !469, line: 1206, column: 16)
!925 = distinct !DILexicalBlock(scope: !852, file: !469, line: 1204, column: 13)
!926 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !927, file: !469, line: 1212, type: !12)
!927 = distinct !DILexicalBlock(scope: !928, file: !469, line: 1212, column: 109)
!928 = distinct !DILexicalBlock(scope: !929, file: !469, line: 1212, column: 86)
!929 = distinct !DILexicalBlock(scope: !922, file: !469, line: 1212, column: 63)
!930 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !931, file: !469, line: 1223, type: !12)
!931 = distinct !DILexicalBlock(scope: !932, file: !469, line: 1223, column: 20)
!932 = distinct !DILexicalBlock(scope: !933, file: !469, line: 1219, column: 37)
!933 = distinct !DILexicalBlock(scope: !934, file: !469, line: 1219, column: 18)
!934 = distinct !DILexicalBlock(scope: !935, file: !469, line: 1217, column: 33)
!935 = distinct !DILexicalBlock(scope: !936, file: !469, line: 1217, column: 9)
!936 = distinct !DILexicalBlock(scope: !852, file: !469, line: 1217, column: 9)
!937 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !938, file: !469, line: 1228, type: !12)
!938 = distinct !DILexicalBlock(scope: !939, file: !469, line: 1228, column: 20)
