; ModuleID = 'irs-onlybc/mathmodule.bc'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PyModuleDef = type { %struct.PyModuleDef_Base, i8*, i8*, i64, %struct.PyMethodDef*, i32 (%struct._object*)*, i32 (%struct._object*, i32 (%struct._object*, i8*)*, i8*)*, i32 (%struct._object*)*, void (i8*)* }
%struct.PyModuleDef_Base = type { %struct._object, %struct._object* ()*, i64, %struct._object* }
%struct._object = type { i64, %struct._typeobject* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.1 (https://github.com/llvm-mirror/clang.git 0dbefa1b83eb90f7a06b5df5df254ce32be3db4b) (git@github.com:kim-yoonseung/llvm.git e8e68907a8135028089af4d924da468e2b7257fa)", isOptimized: true, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !365, globals: !869)
!1 = !DIFile(filename: "mathmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!2 = !{}
!3 = !{!4, !5, !343, !344, !17, !11, !94, !351, !44, !352, !353}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyObject", file: !7, line: 109, baseType: !8)
!7 = !DIFile(filename: "./Include/object.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!8 = !DICompositeType(tag: DW_TAG_structure_type, name: "_object", file: !7, line: 105, size: 128, align: 64, elements: !9)
!9 = !{!10, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "ob_refcnt", scope: !8, file: !7, line: 107, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_ssize_t", file: !12, line: 177, baseType: !13)
!12 = !DIFile(filename: "./Include/pyport.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !14, line: 102, baseType: !15)
!14 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !16, line: 181, baseType: !17)
!16 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "ob_type", scope: !8, file: !7, line: 108, baseType: !19, size: 64, align: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "_typeobject", file: !7, line: 334, size: 3200, align: 64, elements: !21)
!21 = !{!22, !28, !32, !33, !34, !39, !102, !107, !112, !113, !118, !170, !201, !213, !219, !220, !221, !223, !225, !256, !257, !258, !267, !268, !273, !274, !276, !278, !288, !291, !309, !310, !311, !313, !315, !316, !318, !323, !328, !333, !334, !335, !336, !337, !338, !339, !340, !342}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !20, file: !7, line: 335, baseType: !23, size: 192, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyVarObject", file: !7, line: 114, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 111, size: 192, align: 64, elements: !25)
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !24, file: !7, line: 112, baseType: !6, size: 128, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ob_size", scope: !24, file: !7, line: 113, baseType: !11, size: 64, align: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tp_name", scope: !20, file: !7, line: 336, baseType: !29, size: 64, align: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "tp_basicsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "tp_itemsize", scope: !20, file: !7, line: 337, baseType: !11, size: 64, align: 64, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dealloc", scope: !20, file: !7, line: 341, baseType: !35, size: 64, align: 64, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "destructor", file: !7, line: 308, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !5}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tp_print", scope: !20, file: !7, line: 342, baseType: !40, size: 64, align: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "printfunc", file: !7, line: 314, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !5, !45, !44}
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !14, line: 48, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !48, line: 246, size: 1728, align: 64, elements: !49)
!48 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!49 = !{!50, !51, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !71, !72, !73, !74, !76, !78, !80, !84, !87, !89, !90, !91, !92, !93, !97, !98}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !47, file: !48, line: 247, baseType: !44, size: 32, align: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !47, file: !48, line: 252, baseType: !52, size: 64, align: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !47, file: !48, line: 253, baseType: !52, size: 64, align: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !47, file: !48, line: 254, baseType: !52, size: 64, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !47, file: !48, line: 255, baseType: !52, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !47, file: !48, line: 256, baseType: !52, size: 64, align: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !47, file: !48, line: 257, baseType: !52, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !47, file: !48, line: 258, baseType: !52, size: 64, align: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !47, file: !48, line: 259, baseType: !52, size: 64, align: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !47, file: !48, line: 261, baseType: !52, size: 64, align: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !47, file: !48, line: 262, baseType: !52, size: 64, align: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !47, file: !48, line: 263, baseType: !52, size: 64, align: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !47, file: !48, line: 265, baseType: !64, size: 64, align: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !48, line: 161, size: 192, align: 64, elements: !66)
!66 = !{!67, !68, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !65, file: !48, line: 162, baseType: !64, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !65, file: !48, line: 163, baseType: !69, size: 64, align: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !65, file: !48, line: 167, baseType: !44, size: 32, align: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !47, file: !48, line: 267, baseType: !69, size: 64, align: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !47, file: !48, line: 269, baseType: !44, size: 32, align: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !47, file: !48, line: 273, baseType: !44, size: 32, align: 32, offset: 928)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !47, file: !48, line: 275, baseType: !75, size: 64, align: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !16, line: 140, baseType: !17)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !47, file: !48, line: 279, baseType: !77, size: 16, align: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !47, file: !48, line: 280, baseType: !79, size: 8, align: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !47, file: !48, line: 281, baseType: !81, size: 8, align: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, align: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !47, file: !48, line: 285, baseType: !85, size: 64, align: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !48, line: 155, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !47, file: !48, line: 294, baseType: !88, size: 64, align: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !16, line: 141, baseType: !17)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !47, file: !48, line: 303, baseType: !4, size: 64, align: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !47, file: !48, line: 304, baseType: !4, size: 64, align: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !47, file: !48, line: 305, baseType: !4, size: 64, align: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !47, file: !48, line: 306, baseType: !4, size: 64, align: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !47, file: !48, line: 307, baseType: !94, size: 64, align: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 62, baseType: !96)
!95 = !DIFile(filename: "/opt/devel/yoonseung.kim/llvm_work/build/bin/../lib/clang/3.7.1/include/stddef.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!96 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !47, file: !48, line: 309, baseType: !44, size: 32, align: 32, offset: 1536)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !47, file: !48, line: 311, baseType: !99, size: 160, align: 8, offset: 1568)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, align: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 20)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattr", scope: !20, file: !7, line: 343, baseType: !103, size: 64, align: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrfunc", file: !7, line: 316, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!5, !5, !52}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattr", scope: !20, file: !7, line: 344, baseType: !108, size: 64, align: 64, offset: 576)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrfunc", file: !7, line: 318, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64, align: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!44, !5, !52, !5}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tp_reserved", scope: !20, file: !7, line: 345, baseType: !4, size: 64, align: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tp_repr", scope: !20, file: !7, line: 346, baseType: !114, size: 64, align: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "reprfunc", file: !7, line: 320, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!5, !5}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_number", scope: !20, file: !7, line: 350, baseType: !119, size: 64, align: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyNumberMethods", file: !7, line: 278, baseType: !121)
!121 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 236, size: 2176, align: 64, elements: !122)
!122 = !{!123, !128, !129, !130, !131, !132, !137, !139, !140, !141, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_add", scope: !121, file: !7, line: 241, baseType: !124, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "binaryfunc", file: !7, line: 166, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!5, !5, !5}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subtract", scope: !121, file: !7, line: 242, baseType: !124, size: 64, align: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "nb_multiply", scope: !121, file: !7, line: 243, baseType: !124, size: 64, align: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_remainder", scope: !121, file: !7, line: 244, baseType: !124, size: 64, align: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_divmod", scope: !121, file: !7, line: 245, baseType: !124, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_power", scope: !121, file: !7, line: 246, baseType: !133, size: 64, align: 64, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ternaryfunc", file: !7, line: 167, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!5, !5, !5, !5}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_negative", scope: !121, file: !7, line: 247, baseType: !138, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "unaryfunc", file: !7, line: 165, baseType: !115)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nb_positive", scope: !121, file: !7, line: 248, baseType: !138, size: 64, align: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nb_absolute", scope: !121, file: !7, line: 249, baseType: !138, size: 64, align: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bool", scope: !121, file: !7, line: 250, baseType: !142, size: 64, align: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "inquiry", file: !7, line: 168, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!44, !5}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_invert", scope: !121, file: !7, line: 251, baseType: !138, size: 64, align: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_lshift", scope: !121, file: !7, line: 252, baseType: !124, size: 64, align: 64, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_rshift", scope: !121, file: !7, line: 253, baseType: !124, size: 64, align: 64, offset: 768)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_and", scope: !121, file: !7, line: 254, baseType: !124, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_xor", scope: !121, file: !7, line: 255, baseType: !124, size: 64, align: 64, offset: 896)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_or", scope: !121, file: !7, line: 256, baseType: !124, size: 64, align: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_int", scope: !121, file: !7, line: 257, baseType: !138, size: 64, align: 64, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_reserved", scope: !121, file: !7, line: 258, baseType: !4, size: 64, align: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_float", scope: !121, file: !7, line: 259, baseType: !138, size: 64, align: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_add", scope: !121, file: !7, line: 261, baseType: !124, size: 64, align: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_subtract", scope: !121, file: !7, line: 262, baseType: !124, size: 64, align: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_multiply", scope: !121, file: !7, line: 263, baseType: !124, size: 64, align: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_remainder", scope: !121, file: !7, line: 264, baseType: !124, size: 64, align: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_power", scope: !121, file: !7, line: 265, baseType: !133, size: 64, align: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_lshift", scope: !121, file: !7, line: 266, baseType: !124, size: 64, align: 64, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_rshift", scope: !121, file: !7, line: 267, baseType: !124, size: 64, align: 64, offset: 1600)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_and", scope: !121, file: !7, line: 268, baseType: !124, size: 64, align: 64, offset: 1664)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_xor", scope: !121, file: !7, line: 269, baseType: !124, size: 64, align: 64, offset: 1728)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_or", scope: !121, file: !7, line: 270, baseType: !124, size: 64, align: 64, offset: 1792)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_floor_divide", scope: !121, file: !7, line: 272, baseType: !124, size: 64, align: 64, offset: 1856)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "nb_true_divide", scope: !121, file: !7, line: 273, baseType: !124, size: 64, align: 64, offset: 1920)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_floor_divide", scope: !121, file: !7, line: 274, baseType: !124, size: 64, align: 64, offset: 1984)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inplace_true_divide", scope: !121, file: !7, line: 275, baseType: !124, size: 64, align: 64, offset: 2048)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "nb_index", scope: !121, file: !7, line: 277, baseType: !138, size: 64, align: 64, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_sequence", scope: !20, file: !7, line: 351, baseType: !171, size: 64, align: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PySequenceMethods", file: !7, line: 292, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 280, size: 640, align: 64, elements: !174)
!174 = !{!175, !180, !181, !186, !187, !188, !193, !194, !199, !200}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sq_length", scope: !173, file: !7, line: 281, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "lenfunc", file: !7, line: 169, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!11, !5}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sq_concat", scope: !173, file: !7, line: 282, baseType: !124, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sq_repeat", scope: !173, file: !7, line: 283, baseType: !182, size: 64, align: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeargfunc", file: !7, line: 170, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!5, !5, !11}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "sq_item", scope: !173, file: !7, line: 284, baseType: !182, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_slice", scope: !173, file: !7, line: 285, baseType: !4, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "sq_ass_item", scope: !173, file: !7, line: 286, baseType: !189, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssizeobjargproc", file: !7, line: 172, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!44, !5, !11, !5}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "was_sq_ass_slice", scope: !173, file: !7, line: 287, baseType: !4, size: 64, align: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sq_contains", scope: !173, file: !7, line: 288, baseType: !195, size: 64, align: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjproc", file: !7, line: 231, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!44, !5, !5}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_concat", scope: !173, file: !7, line: 290, baseType: !124, size: 64, align: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sq_inplace_repeat", scope: !173, file: !7, line: 291, baseType: !182, size: 64, align: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_mapping", scope: !20, file: !7, line: 352, baseType: !202, size: 64, align: 64, offset: 896)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyMappingMethods", file: !7, line: 298, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 294, size: 192, align: 64, elements: !205)
!205 = !{!206, !207, !208}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mp_length", scope: !204, file: !7, line: 295, baseType: !176, size: 64, align: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mp_subscript", scope: !204, file: !7, line: 296, baseType: !124, size: 64, align: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mp_ass_subscript", scope: !204, file: !7, line: 297, baseType: !209, size: 64, align: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "objobjargproc", file: !7, line: 174, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!44, !5, !5, !5}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tp_hash", scope: !20, file: !7, line: 356, baseType: !214, size: 64, align: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashfunc", file: !7, line: 321, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !5}
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_hash_t", file: !12, line: 186, baseType: !11)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tp_call", scope: !20, file: !7, line: 357, baseType: !133, size: 64, align: 64, offset: 1024)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tp_str", scope: !20, file: !7, line: 358, baseType: !114, size: 64, align: 64, offset: 1088)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getattro", scope: !20, file: !7, line: 359, baseType: !222, size: 64, align: 64, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "getattrofunc", file: !7, line: 317, baseType: !125)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tp_setattro", scope: !20, file: !7, line: 360, baseType: !224, size: 64, align: 64, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "setattrofunc", file: !7, line: 319, baseType: !210)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tp_as_buffer", scope: !20, file: !7, line: 363, baseType: !226, size: 64, align: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyBufferProcs", file: !7, line: 304, baseType: !228)
!228 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 301, size: 128, align: 64, elements: !229)
!229 = !{!230, !251}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bf_getbuffer", scope: !228, file: !7, line: 302, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "getbufferproc", file: !7, line: 193, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!44, !5, !235, !44}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "Py_buffer", file: !7, line: 191, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "bufferinfo", file: !7, line: 178, size: 640, align: 64, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !248, !249, !250}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !237, file: !7, line: 179, baseType: !4, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !237, file: !7, line: 180, baseType: !5, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !237, file: !7, line: 181, baseType: !11, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "itemsize", scope: !237, file: !7, line: 182, baseType: !11, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "readonly", scope: !237, file: !7, line: 184, baseType: !44, size: 32, align: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ndim", scope: !237, file: !7, line: 185, baseType: !44, size: 32, align: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !237, file: !7, line: 186, baseType: !52, size: 64, align: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !237, file: !7, line: 187, baseType: !247, size: 64, align: 64, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "strides", scope: !237, file: !7, line: 188, baseType: !247, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "suboffsets", scope: !237, file: !7, line: 189, baseType: !247, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !237, file: !7, line: 190, baseType: !4, size: 64, align: 64, offset: 576)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bf_releasebuffer", scope: !228, file: !7, line: 303, baseType: !252, size: 64, align: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "releasebufferproc", file: !7, line: 194, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !5, !235}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "tp_flags", scope: !20, file: !7, line: 366, baseType: !96, size: 64, align: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tp_doc", scope: !20, file: !7, line: 368, baseType: !29, size: 64, align: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tp_traverse", scope: !20, file: !7, line: 372, baseType: !259, size: 64, align: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "traverseproc", file: !7, line: 233, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!44, !5, !263, !4}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "visitproc", file: !7, line: 232, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!44, !5, !4}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "tp_clear", scope: !20, file: !7, line: 375, baseType: !142, size: 64, align: 64, offset: 1536)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tp_richcompare", scope: !20, file: !7, line: 379, baseType: !269, size: 64, align: 64, offset: 1600)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "richcmpfunc", file: !7, line: 322, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!5, !5, !5, !44}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklistoffset", scope: !20, file: !7, line: 382, baseType: !11, size: 64, align: 64, offset: 1664)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iter", scope: !20, file: !7, line: 385, baseType: !275, size: 64, align: 64, offset: 1728)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "getiterfunc", file: !7, line: 323, baseType: !115)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tp_iternext", scope: !20, file: !7, line: 386, baseType: !277, size: 64, align: 64, offset: 1792)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "iternextfunc", file: !7, line: 324, baseType: !115)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tp_methods", scope: !20, file: !7, line: 389, baseType: !279, size: 64, align: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMethodDef", file: !281, line: 40, size: 256, align: 64, elements: !282)
!281 = !DIFile(filename: "./Include/methodobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!282 = !{!283, !284, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ml_name", scope: !280, file: !281, line: 41, baseType: !29, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ml_meth", scope: !280, file: !281, line: 42, baseType: !285, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyCFunction", file: !281, line: 18, baseType: !125)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flags", scope: !280, file: !281, line: 43, baseType: !44, size: 32, align: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ml_doc", scope: !280, file: !281, line: 45, baseType: !29, size: 64, align: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tp_members", scope: !20, file: !7, line: 390, baseType: !289, size: 64, align: 64, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyMemberDef", file: !7, line: 390, flags: DIFlagFwdDecl)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "tp_getset", scope: !20, file: !7, line: 391, baseType: !292, size: 64, align: 64, offset: 1984)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64, align: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyGetSetDef", file: !294, line: 11, size: 320, align: 64, elements: !295)
!294 = !DIFile(filename: "./Include/descrobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!295 = !{!296, !297, !302, !307, !308}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !293, file: !294, line: 12, baseType: !52, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !293, file: !294, line: 13, baseType: !298, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "getter", file: !294, line: 8, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!5, !5, !4}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !293, file: !294, line: 14, baseType: !303, size: 64, align: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "setter", file: !294, line: 9, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!44, !5, !5, !4}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "doc", scope: !293, file: !294, line: 15, baseType: !52, size: 64, align: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "closure", scope: !293, file: !294, line: 16, baseType: !4, size: 64, align: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tp_base", scope: !20, file: !7, line: 392, baseType: !19, size: 64, align: 64, offset: 2048)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dict", scope: !20, file: !7, line: 393, baseType: !5, size: 64, align: 64, offset: 2112)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_get", scope: !20, file: !7, line: 394, baseType: !312, size: 64, align: 64, offset: 2176)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrgetfunc", file: !7, line: 325, baseType: !134)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tp_descr_set", scope: !20, file: !7, line: 395, baseType: !314, size: 64, align: 64, offset: 2240)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "descrsetfunc", file: !7, line: 326, baseType: !210)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tp_dictoffset", scope: !20, file: !7, line: 396, baseType: !11, size: 64, align: 64, offset: 2304)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tp_init", scope: !20, file: !7, line: 397, baseType: !317, size: 64, align: 64, offset: 2368)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "initproc", file: !7, line: 327, baseType: !210)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tp_alloc", scope: !20, file: !7, line: 398, baseType: !319, size: 64, align: 64, offset: 2432)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocfunc", file: !7, line: 329, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!5, !19, !11}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tp_new", scope: !20, file: !7, line: 399, baseType: !324, size: 64, align: 64, offset: 2496)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "newfunc", file: !7, line: 328, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!5, !19, !5, !5}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tp_free", scope: !20, file: !7, line: 400, baseType: !329, size: 64, align: 64, offset: 2560)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "freefunc", file: !7, line: 307, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64, align: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !4}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tp_is_gc", scope: !20, file: !7, line: 401, baseType: !142, size: 64, align: 64, offset: 2624)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tp_bases", scope: !20, file: !7, line: 402, baseType: !5, size: 64, align: 64, offset: 2688)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tp_mro", scope: !20, file: !7, line: 403, baseType: !5, size: 64, align: 64, offset: 2752)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tp_cache", scope: !20, file: !7, line: 404, baseType: !5, size: 64, align: 64, offset: 2816)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tp_subclasses", scope: !20, file: !7, line: 405, baseType: !5, size: 64, align: 64, offset: 2880)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tp_weaklist", scope: !20, file: !7, line: 406, baseType: !5, size: 64, align: 64, offset: 2944)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tp_del", scope: !20, file: !7, line: 407, baseType: !35, size: 64, align: 64, offset: 3008)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tp_version_tag", scope: !20, file: !7, line: 410, baseType: !341, size: 32, align: 32, offset: 3072)
!341 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tp_finalize", scope: !20, file: !7, line: 412, baseType: !35, size: 64, align: 64, offset: 3136)
!343 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyFloatObject", file: !346, line: 18, baseType: !347)
!346 = !DIFile(filename: "./Include/floatobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!347 = !DICompositeType(tag: DW_TAG_structure_type, file: !346, line: 15, size: 192, align: 64, elements: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !347, file: !346, line: 16, baseType: !6, size: 128, align: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ob_fval", scope: !347, file: !346, line: 17, baseType: !343, size: 64, align: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyLongObject", file: !355, line: 10, baseType: !356)
!355 = !DIFile(filename: "./Include/longobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "_longobject", file: !357, line: 89, size: 256, align: 64, elements: !358)
!357 = !DIFile(filename: "./Include/longintrepr.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!358 = !{!359, !360}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ob_base", scope: !356, file: !357, line: 90, baseType: !23, size: 192, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ob_digit", scope: !356, file: !357, line: 91, baseType: !361, size: 32, align: 32, offset: 192)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 32, align: 32, elements: !82)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit", file: !357, line: 49, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !364, line: 51, baseType: !341)
!364 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!365 = !{!366, !372, !376, !386, !399, !405, !409, !413, !417, !421, !425, !440, !444, !448, !456, !461, !465, !469, !473, !478, !482, !490, !495, !504, !522, !526, !531, !535, !539, !543, !565, !593, !599, !625, !629, !637, !646, !652, !685, !699, !703, !716, !722, !728, !737, !742, !747, !752, !761, !765, !770, !787, !799, !802, !806, !810, !813, !817, !820, !826, !836, !841, !845, !849, !853, !857, !861}
!366 = !DISubprogram(name: "PyInit_math", scope: !367, file: !367, line: 1994, type: !368, isLocal: false, isDefinition: true, scopeLine: 1995, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* ()* @PyInit_math, variables: !370)
!367 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/mathmodule.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!368 = !DISubroutineType(types: !369)
!369 = !{!5}
!370 = !{!371}
!371 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !366, file: !367, line: 1996, type: !5)
!372 = !DISubprogram(name: "math_acos", scope: !367, file: !367, line: 873, type: !126, isLocal: true, isDefinition: true, scopeLine: 873, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_acos, variables: !373)
!373 = !{!374, !375}
!374 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !372, file: !367, line: 873, type: !5)
!375 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !372, file: !367, line: 873, type: !5)
!376 = !DISubprogram(name: "math_1", scope: !367, file: !367, line: 811, type: !377, isLocal: true, isDefinition: true, scopeLine: 812, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, double (double)*, i32)* @math_1, variables: !382)
!377 = !DISubroutineType(types: !378)
!378 = !{!5, !5, !379, !44}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64, align: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!343, !343}
!382 = !{!383, !384, !385}
!383 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 1, scope: !376, file: !367, line: 811, type: !5)
!384 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 2, scope: !376, file: !367, line: 811, type: !379)
!385 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "can_overflow", arg: 3, scope: !376, file: !367, line: 811, type: !44)
!386 = !DISubprogram(name: "math_1_to_whatever", scope: !367, file: !367, line: 730, type: !387, isLocal: true, isDefinition: true, scopeLine: 733, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, double (double)*, %struct._object* (double)*, i32)* @math_1_to_whatever, variables: !392)
!387 = !DISubroutineType(types: !388)
!388 = !{!5, !5, !379, !389, !44}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!5, !343}
!392 = !{!393, !394, !395, !396, !397, !398}
!393 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 1, scope: !386, file: !367, line: 730, type: !5)
!394 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 2, scope: !386, file: !367, line: 730, type: !379)
!395 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "from_double_func", arg: 3, scope: !386, file: !367, line: 731, type: !389)
!396 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "can_overflow", arg: 4, scope: !386, file: !367, line: 732, type: !44)
!397 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !386, file: !367, line: 734, type: !343)
!398 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !386, file: !367, line: 734, type: !343)
!399 = !DISubprogram(name: "is_error", scope: !367, file: !367, line: 664, type: !400, isLocal: true, isDefinition: true, scopeLine: 665, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double)* @is_error, variables: !402)
!400 = !DISubroutineType(types: !401)
!401 = !{!44, !343}
!402 = !{!403, !404}
!403 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !399, file: !367, line: 664, type: !343)
!404 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !399, file: !367, line: 666, type: !44)
!405 = !DISubprogram(name: "math_acosh", scope: !367, file: !367, line: 875, type: !126, isLocal: true, isDefinition: true, scopeLine: 875, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_acosh, variables: !406)
!406 = !{!407, !408}
!407 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !405, file: !367, line: 875, type: !5)
!408 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !405, file: !367, line: 875, type: !5)
!409 = !DISubprogram(name: "math_asin", scope: !367, file: !367, line: 877, type: !126, isLocal: true, isDefinition: true, scopeLine: 877, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_asin, variables: !410)
!410 = !{!411, !412}
!411 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !409, file: !367, line: 877, type: !5)
!412 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !409, file: !367, line: 877, type: !5)
!413 = !DISubprogram(name: "math_asinh", scope: !367, file: !367, line: 879, type: !126, isLocal: true, isDefinition: true, scopeLine: 879, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_asinh, variables: !414)
!414 = !{!415, !416}
!415 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !413, file: !367, line: 879, type: !5)
!416 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !413, file: !367, line: 879, type: !5)
!417 = !DISubprogram(name: "math_atan", scope: !367, file: !367, line: 881, type: !126, isLocal: true, isDefinition: true, scopeLine: 881, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_atan, variables: !418)
!418 = !{!419, !420}
!419 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !417, file: !367, line: 881, type: !5)
!420 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !417, file: !367, line: 881, type: !5)
!421 = !DISubprogram(name: "math_atan2", scope: !367, file: !367, line: 883, type: !126, isLocal: true, isDefinition: true, scopeLine: 883, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_atan2, variables: !422)
!422 = !{!423, !424}
!423 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !421, file: !367, line: 883, type: !5)
!424 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !421, file: !367, line: 883, type: !5)
!425 = !DISubprogram(name: "math_2", scope: !367, file: !367, line: 823, type: !426, isLocal: true, isDefinition: true, scopeLine: 824, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, double (double, double)*, i8*)* @math_2, variables: !431)
!426 = !DISubroutineType(types: !427)
!427 = !{!5, !5, !428, !52}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!343, !343, !343}
!431 = !{!432, !433, !434, !435, !436, !437, !438, !439}
!432 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 1, scope: !425, file: !367, line: 823, type: !5)
!433 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 2, scope: !425, file: !367, line: 823, type: !428)
!434 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "funcname", arg: 3, scope: !425, file: !367, line: 823, type: !52)
!435 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ox", scope: !425, file: !367, line: 825, type: !5)
!436 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oy", scope: !425, file: !367, line: 825, type: !5)
!437 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !425, file: !367, line: 826, type: !343)
!438 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !425, file: !367, line: 826, type: !343)
!439 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !425, file: !367, line: 826, type: !343)
!440 = !DISubprogram(name: "m_atan2", scope: !367, file: !367, line: 525, type: !429, isLocal: true, isDefinition: true, scopeLine: 526, flags: DIFlagPrototyped, isOptimized: true, function: double (double, double)* @m_atan2, variables: !441)
!441 = !{!442, !443}
!442 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "y", arg: 1, scope: !440, file: !367, line: 525, type: !343)
!443 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 2, scope: !440, file: !367, line: 525, type: !343)
!444 = !DISubprogram(name: "math_atanh", scope: !367, file: !367, line: 886, type: !126, isLocal: true, isDefinition: true, scopeLine: 886, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_atanh, variables: !445)
!445 = !{!446, !447}
!446 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !444, file: !367, line: 886, type: !5)
!447 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !444, file: !367, line: 886, type: !5)
!448 = !DISubprogram(name: "math_ceil", scope: !367, file: !367, line: 889, type: !126, isLocal: true, isDefinition: true, scopeLine: 889, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_ceil, variables: !449)
!449 = !{!450, !451, !452, !453, !454}
!450 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !448, file: !367, line: 889, type: !5)
!451 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "number", arg: 2, scope: !448, file: !367, line: 889, type: !5)
!452 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "method", scope: !448, file: !367, line: 891, type: !5)
!453 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !448, file: !367, line: 891, type: !5)
!454 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !455, file: !367, line: 900, type: !5)
!455 = distinct !DILexicalBlock(scope: !448, file: !367, line: 900, column: 8)
!456 = !DISubprogram(name: "math_1_to_int", scope: !367, file: !367, line: 817, type: !377, isLocal: true, isDefinition: true, scopeLine: 818, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, double (double)*, i32)* @math_1_to_int, variables: !457)
!457 = !{!458, !459, !460}
!458 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 1, scope: !456, file: !367, line: 817, type: !5)
!459 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 2, scope: !456, file: !367, line: 817, type: !379)
!460 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "can_overflow", arg: 3, scope: !456, file: !367, line: 817, type: !44)
!461 = !DISubprogram(name: "math_copysign", scope: !367, file: !367, line: 908, type: !126, isLocal: true, isDefinition: true, scopeLine: 908, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_copysign, variables: !462)
!462 = !{!463, !464}
!463 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !461, file: !367, line: 908, type: !5)
!464 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !461, file: !367, line: 908, type: !5)
!465 = !DISubprogram(name: "math_cos", scope: !367, file: !367, line: 912, type: !126, isLocal: true, isDefinition: true, scopeLine: 912, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_cos, variables: !466)
!466 = !{!467, !468}
!467 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !465, file: !367, line: 912, type: !5)
!468 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !465, file: !367, line: 912, type: !5)
!469 = !DISubprogram(name: "math_cosh", scope: !367, file: !367, line: 914, type: !126, isLocal: true, isDefinition: true, scopeLine: 914, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_cosh, variables: !470)
!470 = !{!471, !472}
!471 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !469, file: !367, line: 914, type: !5)
!472 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !469, file: !367, line: 914, type: !5)
!473 = !DISubprogram(name: "math_degrees", scope: !367, file: !367, line: 1865, type: !126, isLocal: true, isDefinition: true, scopeLine: 1866, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_degrees, variables: !474)
!474 = !{!475, !476, !477}
!475 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !473, file: !367, line: 1865, type: !5)
!476 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !473, file: !367, line: 1865, type: !5)
!477 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !473, file: !367, line: 1867, type: !343)
!478 = !DISubprogram(name: "math_erf", scope: !367, file: !367, line: 916, type: !126, isLocal: true, isDefinition: true, scopeLine: 916, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_erf, variables: !479)
!479 = !{!480, !481}
!480 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !478, file: !367, line: 916, type: !5)
!481 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !478, file: !367, line: 916, type: !5)
!482 = !DISubprogram(name: "math_1a", scope: !367, file: !367, line: 768, type: !483, isLocal: true, isDefinition: true, scopeLine: 769, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, double (double)*)* @math_1a, variables: !485)
!483 = !DISubroutineType(types: !484)
!484 = !{!5, !5, !379}
!485 = !{!486, !487, !488, !489}
!486 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 1, scope: !482, file: !367, line: 768, type: !5)
!487 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 2, scope: !482, file: !367, line: 768, type: !379)
!488 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !482, file: !367, line: 770, type: !343)
!489 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !482, file: !367, line: 770, type: !343)
!490 = !DISubprogram(name: "m_erf", scope: !367, file: !367, line: 483, type: !380, isLocal: true, isDefinition: true, scopeLine: 484, flags: DIFlagPrototyped, isOptimized: true, function: double (double)* @m_erf, variables: !491)
!491 = !{!492, !493, !494}
!492 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !490, file: !367, line: 483, type: !343)
!493 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "absx", scope: !490, file: !367, line: 485, type: !343)
!494 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cf", scope: !490, file: !367, line: 485, type: !343)
!495 = !DISubprogram(name: "m_erf_series", scope: !367, file: !367, line: 421, type: !380, isLocal: true, isDefinition: true, scopeLine: 422, flags: DIFlagPrototyped, isOptimized: true, function: double (double)* @m_erf_series, variables: !496)
!496 = !{!497, !498, !499, !500, !501, !502, !503}
!497 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !495, file: !367, line: 421, type: !343)
!498 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x2", scope: !495, file: !367, line: 423, type: !343)
!499 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "acc", scope: !495, file: !367, line: 423, type: !343)
!500 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "fk", scope: !495, file: !367, line: 423, type: !343)
!501 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !495, file: !367, line: 423, type: !343)
!502 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !495, file: !367, line: 424, type: !44)
!503 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "saved_errno", scope: !495, file: !367, line: 424, type: !44)
!504 = !DISubprogram(name: "m_erfc_contfrac", scope: !367, file: !367, line: 451, type: !380, isLocal: true, isDefinition: true, scopeLine: 452, flags: DIFlagPrototyped, isOptimized: true, function: double (double)* @m_erfc_contfrac, variables: !505)
!505 = !{!506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518}
!506 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !504, file: !367, line: 451, type: !343)
!507 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x2", scope: !504, file: !367, line: 453, type: !343)
!508 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "a", scope: !504, file: !367, line: 453, type: !343)
!509 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "da", scope: !504, file: !367, line: 453, type: !343)
!510 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !504, file: !367, line: 453, type: !343)
!511 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p_last", scope: !504, file: !367, line: 453, type: !343)
!512 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !504, file: !367, line: 453, type: !343)
!513 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q_last", scope: !504, file: !367, line: 453, type: !343)
!514 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !504, file: !367, line: 453, type: !343)
!515 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !504, file: !367, line: 453, type: !343)
!516 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !504, file: !367, line: 454, type: !44)
!517 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "saved_errno", scope: !504, file: !367, line: 454, type: !44)
!518 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "temp", scope: !519, file: !367, line: 465, type: !343)
!519 = distinct !DILexicalBlock(scope: !520, file: !367, line: 464, column: 30)
!520 = distinct !DILexicalBlock(scope: !521, file: !367, line: 464, column: 5)
!521 = distinct !DILexicalBlock(scope: !504, file: !367, line: 464, column: 5)
!522 = !DISubprogram(name: "math_erfc", scope: !367, file: !367, line: 918, type: !126, isLocal: true, isDefinition: true, scopeLine: 918, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_erfc, variables: !523)
!523 = !{!524, !525}
!524 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !522, file: !367, line: 918, type: !5)
!525 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !522, file: !367, line: 918, type: !5)
!526 = !DISubprogram(name: "m_erfc", scope: !367, file: !367, line: 501, type: !380, isLocal: true, isDefinition: true, scopeLine: 502, flags: DIFlagPrototyped, isOptimized: true, function: double (double)* @m_erfc, variables: !527)
!527 = !{!528, !529, !530}
!528 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !526, file: !367, line: 501, type: !343)
!529 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "absx", scope: !526, file: !367, line: 503, type: !343)
!530 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cf", scope: !526, file: !367, line: 503, type: !343)
!531 = !DISubprogram(name: "math_exp", scope: !367, file: !367, line: 920, type: !126, isLocal: true, isDefinition: true, scopeLine: 920, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_exp, variables: !532)
!532 = !{!533, !534}
!533 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !531, file: !367, line: 920, type: !5)
!534 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !531, file: !367, line: 920, type: !5)
!535 = !DISubprogram(name: "math_expm1", scope: !367, file: !367, line: 922, type: !126, isLocal: true, isDefinition: true, scopeLine: 922, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_expm1, variables: !536)
!536 = !{!537, !538}
!537 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !535, file: !367, line: 922, type: !5)
!538 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !535, file: !367, line: 922, type: !5)
!539 = !DISubprogram(name: "math_fabs", scope: !367, file: !367, line: 926, type: !126, isLocal: true, isDefinition: true, scopeLine: 926, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_fabs, variables: !540)
!540 = !{!541, !542}
!541 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !539, file: !367, line: 926, type: !5)
!542 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !539, file: !367, line: 926, type: !5)
!543 = !DISubprogram(name: "math_factorial", scope: !367, file: !367, line: 1408, type: !126, isLocal: true, isDefinition: true, scopeLine: 1409, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_factorial, variables: !544)
!544 = !{!545, !546, !547, !548, !549, !550, !551, !554, !555, !557, !561, !563}
!545 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !543, file: !367, line: 1408, type: !5)
!546 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !543, file: !367, line: 1408, type: !5)
!547 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !543, file: !367, line: 1410, type: !17)
!548 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !543, file: !367, line: 1411, type: !5)
!549 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "odd_part", scope: !543, file: !367, line: 1411, type: !5)
!550 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "two_valuation", scope: !543, file: !367, line: 1411, type: !5)
!551 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lx", scope: !552, file: !367, line: 1414, type: !5)
!552 = distinct !DILexicalBlock(scope: !553, file: !367, line: 1413, column: 129)
!553 = distinct !DILexicalBlock(scope: !543, file: !367, line: 1413, column: 9)
!554 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "dx", scope: !552, file: !367, line: 1415, type: !343)
!555 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !556, file: !367, line: 1425, type: !5)
!556 = distinct !DILexicalBlock(scope: !552, file: !367, line: 1425, column: 12)
!557 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !558, file: !367, line: 1449, type: !5)
!558 = distinct !DILexicalBlock(scope: !559, file: !367, line: 1449, column: 12)
!559 = distinct !DILexicalBlock(scope: !560, file: !367, line: 1448, column: 38)
!560 = distinct !DILexicalBlock(scope: !543, file: !367, line: 1448, column: 9)
!561 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !562, file: !367, line: 1453, type: !5)
!562 = distinct !DILexicalBlock(scope: !543, file: !367, line: 1453, column: 8)
!563 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !564, file: !367, line: 1454, type: !5)
!564 = distinct !DILexicalBlock(scope: !543, file: !367, line: 1454, column: 8)
!565 = !DISubprogram(name: "factorial_odd_part", scope: !367, file: !367, line: 1343, type: !566, isLocal: true, isDefinition: true, scopeLine: 1344, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i64)* @factorial_odd_part, variables: !568)
!566 = !DISubroutineType(types: !567)
!567 = !{!5, !96}
!568 = !{!569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !583, !585, !587, !589, !591}
!569 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !565, file: !367, line: 1343, type: !96)
!570 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !565, file: !367, line: 1345, type: !17)
!571 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !565, file: !367, line: 1346, type: !96)
!572 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lower", scope: !565, file: !367, line: 1346, type: !96)
!573 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "upper", scope: !565, file: !367, line: 1346, type: !96)
!574 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "partial", scope: !565, file: !367, line: 1347, type: !5)
!575 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tmp", scope: !565, file: !367, line: 1347, type: !5)
!576 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inner", scope: !565, file: !367, line: 1347, type: !5)
!577 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outer", scope: !565, file: !367, line: 1347, type: !5)
!578 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !579, file: !367, line: 1371, type: !5)
!579 = distinct !DILexicalBlock(scope: !580, file: !367, line: 1371, column: 12)
!580 = distinct !DILexicalBlock(scope: !581, file: !367, line: 1356, column: 46)
!581 = distinct !DILexicalBlock(scope: !582, file: !367, line: 1356, column: 5)
!582 = distinct !DILexicalBlock(scope: !565, file: !367, line: 1356, column: 5)
!583 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !584, file: !367, line: 1374, type: !5)
!584 = distinct !DILexicalBlock(scope: !580, file: !367, line: 1374, column: 12)
!585 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !586, file: !367, line: 1383, type: !5)
!586 = distinct !DILexicalBlock(scope: !580, file: !367, line: 1383, column: 12)
!587 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !588, file: !367, line: 1386, type: !5)
!588 = distinct !DILexicalBlock(scope: !565, file: !367, line: 1386, column: 8)
!589 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !590, file: !367, line: 1390, type: !5)
!590 = distinct !DILexicalBlock(scope: !565, file: !367, line: 1390, column: 8)
!591 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !592, file: !367, line: 1391, type: !5)
!592 = distinct !DILexicalBlock(scope: !565, file: !367, line: 1391, column: 8)
!593 = !DISubprogram(name: "bit_length", scope: !367, file: !367, line: 1199, type: !594, isLocal: true, isDefinition: true, scopeLine: 1200, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i64)* @bit_length, variables: !596)
!594 = !DISubroutineType(types: !595)
!595 = !{!96, !96}
!596 = !{!597, !598}
!597 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !593, file: !367, line: 1199, type: !96)
!598 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "len", scope: !593, file: !367, line: 1201, type: !96)
!599 = !DISubprogram(name: "factorial_partial_product", scope: !367, file: !367, line: 1290, type: !600, isLocal: true, isDefinition: true, scopeLine: 1292, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (i64, i64, i64)* @factorial_partial_product, variables: !602)
!600 = !DISubroutineType(types: !601)
!601 = !{!5, !96, !96, !96}
!602 = !{!603, !604, !605, !606, !607, !608, !609, !610, !611, !614, !615, !617, !620, !622}
!603 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "start", arg: 1, scope: !599, file: !367, line: 1290, type: !96)
!604 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "stop", arg: 2, scope: !599, file: !367, line: 1290, type: !96)
!605 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "max_bits", arg: 3, scope: !599, file: !367, line: 1291, type: !96)
!606 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "midpoint", scope: !599, file: !367, line: 1293, type: !96)
!607 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num_operands", scope: !599, file: !367, line: 1293, type: !96)
!608 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "left", scope: !599, file: !367, line: 1294, type: !5)
!609 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "right", scope: !599, file: !367, line: 1294, type: !5)
!610 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !599, file: !367, line: 1294, type: !5)
!611 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !612, file: !367, line: 1317, type: !96)
!612 = distinct !DILexicalBlock(scope: !613, file: !367, line: 1316, column: 43)
!613 = distinct !DILexicalBlock(scope: !599, file: !367, line: 1315, column: 9)
!614 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "total", scope: !612, file: !367, line: 1317, type: !96)
!615 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !616, file: !367, line: 1335, type: !5)
!616 = distinct !DILexicalBlock(scope: !599, file: !367, line: 1335, column: 8)
!617 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !618, file: !367, line: 1335, type: !5)
!618 = distinct !DILexicalBlock(scope: !619, file: !367, line: 1335, column: 96)
!619 = distinct !DILexicalBlock(scope: !616, file: !367, line: 1335, column: 62)
!620 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_xdecref_tmp", scope: !621, file: !367, line: 1336, type: !5)
!621 = distinct !DILexicalBlock(scope: !599, file: !367, line: 1336, column: 8)
!622 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !623, file: !367, line: 1336, type: !5)
!623 = distinct !DILexicalBlock(scope: !624, file: !367, line: 1336, column: 97)
!624 = distinct !DILexicalBlock(scope: !621, file: !367, line: 1336, column: 63)
!625 = !DISubprogram(name: "count_set_bits", scope: !367, file: !367, line: 1210, type: !594, isLocal: true, isDefinition: true, scopeLine: 1211, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i64)* @count_set_bits, variables: !626)
!626 = !{!627, !628}
!627 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 1, scope: !625, file: !367, line: 1210, type: !96)
!628 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "count", scope: !625, file: !367, line: 1212, type: !96)
!629 = !DISubprogram(name: "math_floor", scope: !367, file: !367, line: 929, type: !126, isLocal: true, isDefinition: true, scopeLine: 929, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_floor, variables: !630)
!630 = !{!631, !632, !633, !634, !635}
!631 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !629, file: !367, line: 929, type: !5)
!632 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "number", arg: 2, scope: !629, file: !367, line: 929, type: !5)
!633 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "method", scope: !629, file: !367, line: 931, type: !5)
!634 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !629, file: !367, line: 931, type: !5)
!635 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !636, file: !367, line: 940, type: !5)
!636 = distinct !DILexicalBlock(scope: !629, file: !367, line: 940, column: 8)
!637 = !DISubprogram(name: "math_fmod", scope: !367, file: !367, line: 1700, type: !126, isLocal: true, isDefinition: true, scopeLine: 1701, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_fmod, variables: !638)
!638 = !{!639, !640, !641, !642, !643, !644, !645}
!639 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !637, file: !367, line: 1700, type: !5)
!640 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !637, file: !367, line: 1700, type: !5)
!641 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ox", scope: !637, file: !367, line: 1702, type: !5)
!642 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oy", scope: !637, file: !367, line: 1702, type: !5)
!643 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !637, file: !367, line: 1703, type: !343)
!644 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !637, file: !367, line: 1703, type: !343)
!645 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !637, file: !367, line: 1703, type: !343)
!646 = !DISubprogram(name: "math_frexp", scope: !367, file: !367, line: 1493, type: !126, isLocal: true, isDefinition: true, scopeLine: 1494, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_frexp, variables: !647)
!647 = !{!648, !649, !650, !651}
!648 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !646, file: !367, line: 1493, type: !5)
!649 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !646, file: !367, line: 1493, type: !5)
!650 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !646, file: !367, line: 1495, type: !44)
!651 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !646, file: !367, line: 1496, type: !343)
!652 = !DISubprogram(name: "math_fsum", scope: !367, file: !367, line: 1063, type: !126, isLocal: true, isDefinition: true, scopeLine: 1064, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_fsum, variables: !653)
!653 = !{!654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !670, !671, !672, !673, !674, !676, !677, !678, !683}
!654 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !652, file: !367, line: 1063, type: !5)
!655 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "seq", arg: 2, scope: !652, file: !367, line: 1063, type: !5)
!656 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "item", scope: !652, file: !367, line: 1065, type: !5)
!657 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "iter", scope: !652, file: !367, line: 1065, type: !5)
!658 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sum", scope: !652, file: !367, line: 1065, type: !5)
!659 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !652, file: !367, line: 1066, type: !11)
!660 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "j", scope: !652, file: !367, line: 1066, type: !11)
!661 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !652, file: !367, line: 1066, type: !11)
!662 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !652, file: !367, line: 1066, type: !11)
!663 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !652, file: !367, line: 1067, type: !343)
!664 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !652, file: !367, line: 1067, type: !343)
!665 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !652, file: !367, line: 1067, type: !343)
!666 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ps", scope: !652, file: !367, line: 1067, type: !667)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 2048, align: 64, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 32)
!670 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !652, file: !367, line: 1067, type: !351)
!671 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "xsave", scope: !652, file: !367, line: 1068, type: !343)
!672 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "special_sum", scope: !652, file: !367, line: 1068, type: !343)
!673 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "inf_sum", scope: !652, file: !367, line: 1068, type: !343)
!674 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "hi", scope: !652, file: !367, line: 1069, type: !675)
!675 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !343)
!676 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "yr", scope: !652, file: !367, line: 1069, type: !675)
!677 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lo", scope: !652, file: !367, line: 1069, type: !675)
!678 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !679, file: !367, line: 1089, type: !5)
!679 = distinct !DILexicalBlock(scope: !680, file: !367, line: 1089, column: 12)
!680 = distinct !DILexicalBlock(scope: !681, file: !367, line: 1077, column: 13)
!681 = distinct !DILexicalBlock(scope: !682, file: !367, line: 1077, column: 5)
!682 = distinct !DILexicalBlock(scope: !652, file: !367, line: 1077, column: 5)
!683 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !684, file: !367, line: 1174, type: !5)
!684 = distinct !DILexicalBlock(scope: !652, file: !367, line: 1174, column: 8)
!685 = !DISubprogram(name: "_fsum_realloc", scope: !367, file: !367, line: 1006, type: !686, isLocal: true, isDefinition: true, scopeLine: 1008, flags: DIFlagPrototyped, isOptimized: true, function: i32 (double**, i64, double*, i64*)* @_fsum_realloc, variables: !689)
!686 = !DISubroutineType(types: !687)
!687 = !{!44, !688, !11, !351, !247}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!689 = !{!690, !691, !692, !693, !694, !695, !696}
!690 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "p_ptr", arg: 1, scope: !685, file: !367, line: 1006, type: !688)
!691 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "n", arg: 2, scope: !685, file: !367, line: 1006, type: !11)
!692 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ps", arg: 3, scope: !685, file: !367, line: 1007, type: !351)
!693 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "m_ptr", arg: 4, scope: !685, file: !367, line: 1007, type: !247)
!694 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !685, file: !367, line: 1009, type: !4)
!695 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "m", scope: !685, file: !367, line: 1010, type: !11)
!696 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !697, file: !367, line: 1014, type: !351)
!697 = distinct !DILexicalBlock(scope: !698, file: !367, line: 1013, column: 74)
!698 = distinct !DILexicalBlock(scope: !685, file: !367, line: 1013, column: 9)
!699 = !DISubprogram(name: "math_gamma", scope: !367, file: !367, line: 948, type: !126, isLocal: true, isDefinition: true, scopeLine: 948, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_gamma, variables: !700)
!700 = !{!701, !702}
!701 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !699, file: !367, line: 948, type: !5)
!702 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !699, file: !367, line: 948, type: !5)
!703 = !DISubprogram(name: "m_tgamma", scope: !367, file: !367, line: 227, type: !380, isLocal: true, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: true, function: double (double)* @m_tgamma, variables: !704)
!704 = !{!705, !706, !707, !708, !709, !710, !711, !714}
!705 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !703, file: !367, line: 227, type: !343)
!706 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "absx", scope: !703, file: !367, line: 229, type: !343)
!707 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !703, file: !367, line: 229, type: !343)
!708 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !703, file: !367, line: 229, type: !343)
!709 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "z", scope: !703, file: !367, line: 229, type: !343)
!710 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "sqrtpow", scope: !703, file: !367, line: 229, type: !343)
!711 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !712, file: !367, line: 285, type: !343)
!712 = distinct !DILexicalBlock(scope: !713, file: !367, line: 280, column: 38)
!713 = distinct !DILexicalBlock(scope: !703, file: !367, line: 280, column: 9)
!714 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "q", scope: !715, file: !367, line: 289, type: !343)
!715 = distinct !DILexicalBlock(scope: !713, file: !367, line: 288, column: 10)
!716 = !DISubprogram(name: "sinpi", scope: !367, file: !367, line: 70, type: !380, isLocal: true, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: true, function: double (double)* @sinpi, variables: !717)
!717 = !{!718, !719, !720, !721}
!718 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !716, file: !367, line: 70, type: !343)
!719 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !716, file: !367, line: 72, type: !343)
!720 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !716, file: !367, line: 72, type: !343)
!721 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "n", scope: !716, file: !367, line: 73, type: !44)
!722 = !DISubprogram(name: "lanczos_sum", scope: !367, file: !367, line: 198, type: !380, isLocal: true, isDefinition: true, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: true, function: double (double)* @lanczos_sum, variables: !723)
!723 = !{!724, !725, !726, !727}
!724 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !722, file: !367, line: 198, type: !343)
!725 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num", scope: !722, file: !367, line: 200, type: !343)
!726 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "den", scope: !722, file: !367, line: 200, type: !343)
!727 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "i", scope: !722, file: !367, line: 201, type: !44)
!728 = !DISubprogram(name: "math_hypot", scope: !367, file: !367, line: 1734, type: !126, isLocal: true, isDefinition: true, scopeLine: 1735, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_hypot, variables: !729)
!729 = !{!730, !731, !732, !733, !734, !735, !736}
!730 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !728, file: !367, line: 1734, type: !5)
!731 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !728, file: !367, line: 1734, type: !5)
!732 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ox", scope: !728, file: !367, line: 1736, type: !5)
!733 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oy", scope: !728, file: !367, line: 1736, type: !5)
!734 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !728, file: !367, line: 1737, type: !343)
!735 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !728, file: !367, line: 1737, type: !343)
!736 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !728, file: !367, line: 1737, type: !343)
!737 = !DISubprogram(name: "math_isfinite", scope: !367, file: !367, line: 1891, type: !126, isLocal: true, isDefinition: true, scopeLine: 1892, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_isfinite, variables: !738)
!738 = !{!739, !740, !741}
!739 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !737, file: !367, line: 1891, type: !5)
!740 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !737, file: !367, line: 1891, type: !5)
!741 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !737, file: !367, line: 1893, type: !343)
!742 = !DISubprogram(name: "math_isinf", scope: !367, file: !367, line: 1917, type: !126, isLocal: true, isDefinition: true, scopeLine: 1918, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_isinf, variables: !743)
!743 = !{!744, !745, !746}
!744 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !742, file: !367, line: 1917, type: !5)
!745 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !742, file: !367, line: 1917, type: !5)
!746 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !742, file: !367, line: 1919, type: !343)
!747 = !DISubprogram(name: "math_isnan", scope: !367, file: !367, line: 1904, type: !126, isLocal: true, isDefinition: true, scopeLine: 1905, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_isnan, variables: !748)
!748 = !{!749, !750, !751}
!749 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !747, file: !367, line: 1904, type: !5)
!750 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !747, file: !367, line: 1904, type: !5)
!751 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !747, file: !367, line: 1906, type: !343)
!752 = !DISubprogram(name: "math_ldexp", scope: !367, file: !367, line: 1520, type: !126, isLocal: true, isDefinition: true, scopeLine: 1521, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_ldexp, variables: !753)
!753 = !{!754, !755, !756, !757, !758, !759, !760}
!754 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !752, file: !367, line: 1520, type: !5)
!755 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !752, file: !367, line: 1520, type: !5)
!756 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !752, file: !367, line: 1522, type: !343)
!757 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !752, file: !367, line: 1522, type: !343)
!758 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oexp", scope: !752, file: !367, line: 1523, type: !5)
!759 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "exp", scope: !752, file: !367, line: 1524, type: !17)
!760 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overflow", scope: !752, file: !367, line: 1525, type: !44)
!761 = !DISubprogram(name: "math_lgamma", scope: !367, file: !367, line: 950, type: !126, isLocal: true, isDefinition: true, scopeLine: 950, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_lgamma, variables: !762)
!762 = !{!763, !764}
!763 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !761, file: !367, line: 950, type: !5)
!764 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !761, file: !367, line: 950, type: !5)
!765 = !DISubprogram(name: "m_lgamma", scope: !367, file: !367, line: 328, type: !380, isLocal: true, isDefinition: true, scopeLine: 329, flags: DIFlagPrototyped, isOptimized: true, function: double (double)* @m_lgamma, variables: !766)
!766 = !{!767, !768, !769}
!767 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !765, file: !367, line: 328, type: !343)
!768 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !765, file: !367, line: 330, type: !343)
!769 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "absx", scope: !765, file: !367, line: 330, type: !343)
!770 = !DISubprogram(name: "math_log", scope: !367, file: !367, line: 1650, type: !126, isLocal: true, isDefinition: true, scopeLine: 1651, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_log, variables: !771)
!771 = !{!772, !773, !774, !775, !776, !777, !778, !779, !783, !785}
!772 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !770, file: !367, line: 1650, type: !5)
!773 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !770, file: !367, line: 1650, type: !5)
!774 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "arg", scope: !770, file: !367, line: 1652, type: !5)
!775 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "base", scope: !770, file: !367, line: 1653, type: !5)
!776 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "num", scope: !770, file: !367, line: 1654, type: !5)
!777 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "den", scope: !770, file: !367, line: 1654, type: !5)
!778 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ans", scope: !770, file: !367, line: 1655, type: !5)
!779 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !780, file: !367, line: 1666, type: !5)
!780 = distinct !DILexicalBlock(scope: !781, file: !367, line: 1666, column: 12)
!781 = distinct !DILexicalBlock(scope: !782, file: !367, line: 1665, column: 28)
!782 = distinct !DILexicalBlock(scope: !770, file: !367, line: 1665, column: 9)
!783 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !784, file: !367, line: 1671, type: !5)
!784 = distinct !DILexicalBlock(scope: !770, file: !367, line: 1671, column: 8)
!785 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !786, file: !367, line: 1672, type: !5)
!786 = distinct !DILexicalBlock(scope: !770, file: !367, line: 1672, column: 8)
!787 = !DISubprogram(name: "loghelper", scope: !367, file: !367, line: 1612, type: !788, isLocal: true, isDefinition: true, scopeLine: 1613, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, double (double)*, i8*)* @loghelper, variables: !790)
!788 = !DISubroutineType(types: !789)
!789 = !{!5, !5, !379, !52}
!790 = !{!791, !792, !793, !794, !797, !798}
!791 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 1, scope: !787, file: !367, line: 1612, type: !5)
!792 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "func", arg: 2, scope: !787, file: !367, line: 1612, type: !379)
!793 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "funcname", arg: 3, scope: !787, file: !367, line: 1612, type: !52)
!794 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !795, file: !367, line: 1616, type: !343)
!795 = distinct !DILexicalBlock(scope: !796, file: !367, line: 1615, column: 77)
!796 = distinct !DILexicalBlock(scope: !787, file: !367, line: 1615, column: 9)
!797 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !795, file: !367, line: 1616, type: !343)
!798 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "e", scope: !795, file: !367, line: 1617, type: !11)
!799 = !DISubprogram(name: "m_log", scope: !367, file: !367, line: 560, type: !380, isLocal: true, isDefinition: true, scopeLine: 561, flags: DIFlagPrototyped, isOptimized: true, function: double (double)* @m_log, variables: !800)
!800 = !{!801}
!801 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !799, file: !367, line: 560, type: !343)
!802 = !DISubprogram(name: "math_log1p", scope: !367, file: !367, line: 952, type: !126, isLocal: true, isDefinition: true, scopeLine: 952, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_log1p, variables: !803)
!803 = !{!804, !805}
!804 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !802, file: !367, line: 952, type: !5)
!805 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !802, file: !367, line: 952, type: !5)
!806 = !DISubprogram(name: "math_log10", scope: !367, file: !367, line: 1691, type: !126, isLocal: true, isDefinition: true, scopeLine: 1692, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_log10, variables: !807)
!807 = !{!808, !809}
!808 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !806, file: !367, line: 1691, type: !5)
!809 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !806, file: !367, line: 1691, type: !5)
!810 = !DISubprogram(name: "m_log10", scope: !367, file: !367, line: 637, type: !380, isLocal: true, isDefinition: true, scopeLine: 638, flags: DIFlagPrototyped, isOptimized: true, function: double (double)* @m_log10, variables: !811)
!811 = !{!812}
!812 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !810, file: !367, line: 637, type: !343)
!813 = !DISubprogram(name: "math_log2", scope: !367, file: !367, line: 1682, type: !126, isLocal: true, isDefinition: true, scopeLine: 1683, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_log2, variables: !814)
!814 = !{!815, !816}
!815 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !813, file: !367, line: 1682, type: !5)
!816 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !813, file: !367, line: 1682, type: !5)
!817 = !DISubprogram(name: "m_log2", scope: !367, file: !367, line: 592, type: !380, isLocal: true, isDefinition: true, scopeLine: 593, flags: DIFlagPrototyped, isOptimized: true, function: double (double)* @m_log2, variables: !818)
!818 = !{!819}
!819 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "x", arg: 1, scope: !817, file: !367, line: 592, type: !343)
!820 = !DISubprogram(name: "math_modf", scope: !367, file: !367, line: 1575, type: !126, isLocal: true, isDefinition: true, scopeLine: 1576, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_modf, variables: !821)
!821 = !{!822, !823, !824, !825}
!822 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !820, file: !367, line: 1575, type: !5)
!823 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !820, file: !367, line: 1575, type: !5)
!824 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !820, file: !367, line: 1577, type: !343)
!825 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !820, file: !367, line: 1577, type: !343)
!826 = !DISubprogram(name: "math_pow", scope: !367, file: !367, line: 1781, type: !126, isLocal: true, isDefinition: true, scopeLine: 1782, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_pow, variables: !827)
!827 = !{!828, !829, !830, !831, !832, !833, !834, !835}
!828 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !826, file: !367, line: 1781, type: !5)
!829 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !826, file: !367, line: 1781, type: !5)
!830 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ox", scope: !826, file: !367, line: 1783, type: !5)
!831 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "oy", scope: !826, file: !367, line: 1783, type: !5)
!832 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !826, file: !367, line: 1784, type: !343)
!833 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !826, file: !367, line: 1784, type: !343)
!834 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "y", scope: !826, file: !367, line: 1784, type: !343)
!835 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "odd_y", scope: !826, file: !367, line: 1785, type: !44)
!836 = !DISubprogram(name: "math_radians", scope: !367, file: !367, line: 1878, type: !126, isLocal: true, isDefinition: true, scopeLine: 1879, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_radians, variables: !837)
!837 = !{!838, !839, !840}
!838 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !836, file: !367, line: 1878, type: !5)
!839 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "arg", arg: 2, scope: !836, file: !367, line: 1878, type: !5)
!840 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "x", scope: !836, file: !367, line: 1880, type: !343)
!841 = !DISubprogram(name: "math_sin", scope: !367, file: !367, line: 955, type: !126, isLocal: true, isDefinition: true, scopeLine: 955, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_sin, variables: !842)
!842 = !{!843, !844}
!843 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !841, file: !367, line: 955, type: !5)
!844 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !841, file: !367, line: 955, type: !5)
!845 = !DISubprogram(name: "math_sinh", scope: !367, file: !367, line: 957, type: !126, isLocal: true, isDefinition: true, scopeLine: 957, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_sinh, variables: !846)
!846 = !{!847, !848}
!847 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !845, file: !367, line: 957, type: !5)
!848 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !845, file: !367, line: 957, type: !5)
!849 = !DISubprogram(name: "math_sqrt", scope: !367, file: !367, line: 959, type: !126, isLocal: true, isDefinition: true, scopeLine: 959, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_sqrt, variables: !850)
!850 = !{!851, !852}
!851 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !849, file: !367, line: 959, type: !5)
!852 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !849, file: !367, line: 959, type: !5)
!853 = !DISubprogram(name: "math_tan", scope: !367, file: !367, line: 961, type: !126, isLocal: true, isDefinition: true, scopeLine: 961, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_tan, variables: !854)
!854 = !{!855, !856}
!855 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !853, file: !367, line: 961, type: !5)
!856 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !853, file: !367, line: 961, type: !5)
!857 = !DISubprogram(name: "math_tanh", scope: !367, file: !367, line: 963, type: !126, isLocal: true, isDefinition: true, scopeLine: 963, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_tanh, variables: !858)
!858 = !{!859, !860}
!859 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !857, file: !367, line: 963, type: !5)
!860 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "args", arg: 2, scope: !857, file: !367, line: 963, type: !5)
!861 = !DISubprogram(name: "math_trunc", scope: !367, file: !367, line: 1464, type: !126, isLocal: true, isDefinition: true, scopeLine: 1465, flags: DIFlagPrototyped, isOptimized: true, function: %struct._object* (%struct._object*, %struct._object*)* @math_trunc, variables: !862)
!862 = !{!863, !864, !865, !866, !867}
!863 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "self", arg: 1, scope: !861, file: !367, line: 1464, type: !5)
!864 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "number", arg: 2, scope: !861, file: !367, line: 1464, type: !5)
!865 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "trunc", scope: !861, file: !367, line: 1467, type: !5)
!866 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !861, file: !367, line: 1467, type: !5)
!867 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "_py_decref_tmp", scope: !868, file: !367, line: 1483, type: !5)
!868 = distinct !DILexicalBlock(scope: !861, file: !367, line: 1483, column: 8)
!869 = !{!870, !893, !897, !901, !905, !909, !913, !917, !921, !925, !929, !937, !941, !945, !949, !953, !955, !959, !960, !964, !965, !967, !971, !975, !980, !984, !985, !989, !993, !997, !1001, !1002, !1003, !1004, !1008, !1012, !1013, !1017, !1021, !1025, !1029, !1033, !1035, !1036, !1037, !1041, !1045, !1049, !1050, !1054, !1058, !1059, !1060, !1064, !1068, !1072, !1076, !1077, !1078}
!870 = !DIGlobalVariable(name: "mathmodule", scope: !0, file: !367, line: 1981, type: !871, isLocal: true, isDefinition: true, variable: %struct.PyModuleDef* @mathmodule)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "PyModuleDef", file: !872, line: 47, size: 832, align: 64, elements: !873)
!872 = !DIFile(filename: "./Include/moduleobject.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!873 = !{!874, !883, !884, !885, !886, !889, !890, !891, !892}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "m_base", scope: !871, file: !872, line: 48, baseType: !875, size: 320, align: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "PyModuleDef_Base", file: !872, line: 38, baseType: !876)
