; ModuleID = 'programs_new/Python-new/memory.bc.ll'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.mpd_t = type { i8, i64, i64, i64, i64, i64* }
%struct.mpd_context_t = type { i64, i64, i64, i32, i32, i32, i32, i32, i32 }

@MPD_MINALLOC = hidden global i64 2, align 8
@mpd_mallocfunc = hidden global i8* (i64)* @malloc, align 8
@mpd_reallocfunc = hidden global i8* (i8*, i64)* @realloc, align 8
@mpd_callocfunc = hidden global i8* (i64, i64)* @calloc, align 8
@mpd_free = hidden global void (i8*)* @free, align 8

; Function Attrs: nounwind
declare noalias i8* @malloc(i64) #0

; Function Attrs: nounwind
declare i8* @realloc(i8*, i64) #0

; Function Attrs: nounwind
declare noalias i8* @calloc(i64, i64) #0

; Function Attrs: nounwind
declare void @free(i8*) #0

; Function Attrs: nounwind uwtable
define hidden i8* @mpd_callocfunc_em(i64 %nmemb, i64 %size) #1 {
entry:
  %retval = alloca i8*, align 8
  %nmemb.addr = alloca i64, align 8
  %size.addr = alloca i64, align 8
  %ptr = alloca i8*, align 8
  %req = alloca i64, align 8
  %overflow = alloca i64, align 8
  %cleanup.dest.slot = alloca i32
  store i64 %nmemb, i64* %nmemb.addr, align 8, !tbaa !173
  call void @llvm.dbg.declare(metadata i64* %nmemb.addr, metadata !20, metadata !177), !dbg !178
  store i64 %size, i64* %size.addr, align 8, !tbaa !173
  call void @llvm.dbg.declare(metadata i64* %size.addr, metadata !21, metadata !177), !dbg !179

!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpd_uint_t", file: !5, line: 149, baseType: !12)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !13, line: 55, baseType: !8)
!13 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!14 = !{!15, !25, !33, !38, !52, !61, !81, !84, !106, !115, !121, !127, !137, !147}
!15 = !DISubprogram(name: "mpd_callocfunc_em", scope: !16, file: !16, line: 49, type: !17, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i64, i64)* @mpd_callocfunc_em, variables: !19)
!16 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_decimal/libmpdec/memory.c", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!17 = !DISubroutineType(types: !18)
!18 = !{!9, !6, !6}
!19 = !{!20, !21, !22, !23, !24}
!20 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nmemb", arg: 1, scope: !15, file: !16, line: 49, type: !6)
!21 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !15, file: !16, line: 49, type: !6)
!22 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ptr", scope: !15, file: !16, line: 51, type: !9)
!23 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "req", scope: !15, file: !16, line: 52, type: !6)
!24 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overflow", scope: !15, file: !16, line: 53, type: !4)
!25 = !DISubprogram(name: "mpd_alloc", scope: !16, file: !16, line: 81, type: !26, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i64, i64)* @mpd_alloc, variables: !28)
!26 = !DISubroutineType(types: !27)
!27 = !{!9, !4, !4}
!28 = !{!29, !30, !31, !32}
!29 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nmemb", arg: 1, scope: !25, file: !16, line: 81, type: !4)
!30 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !25, file: !16, line: 81, type: !4)
!31 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "req", scope: !25, file: !16, line: 83, type: !4)
!32 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overflow", scope: !25, file: !16, line: 83, type: !4)
!33 = !DISubprogram(name: "mpd_calloc", scope: !16, file: !16, line: 95, type: !26, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i64, i64)* @mpd_calloc, variables: !34)
!34 = !{!35, !36, !37}
!35 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nmemb", arg: 1, scope: !33, file: !16, line: 95, type: !4)
!36 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 2, scope: !33, file: !16, line: 95, type: !4)
!37 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overflow", scope: !33, file: !16, line: 97, type: !4)
!38 = !DISubprogram(name: "mpd_realloc", scope: !16, file: !16, line: 109, type: !39, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i8*, i64, i64, i8*)* @mpd_realloc, variables: !44)
!39 = !DISubroutineType(types: !40)
!40 = !{!9, !9, !4, !4, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !13, line: 48, baseType: !43)
!43 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!44 = !{!45, !46, !47, !48, !49, !50, !51}
!45 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ptr", arg: 1, scope: !38, file: !16, line: 109, type: !9)
!46 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nmemb", arg: 2, scope: !38, file: !16, line: 109, type: !4)
!47 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 3, scope: !38, file: !16, line: 109, type: !4)
!48 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "err", arg: 4, scope: !38, file: !16, line: 109, type: !41)
!49 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "new", scope: !38, file: !16, line: 111, type: !9)
!50 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "req", scope: !38, file: !16, line: 112, type: !4)
!51 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overflow", scope: !38, file: !16, line: 112, type: !4)
!52 = !DISubprogram(name: "mpd_sh_alloc", scope: !16, file: !16, line: 131, type: !53, isLocal: false, isDefinition: true, scopeLine: 132, flags: DIFlagPrototyped, isOptimized: true, function: i8* (i64, i64, i64)* @mpd_sh_alloc, variables: !55)
!53 = !DISubroutineType(types: !54)
!54 = !{!9, !4, !4, !4}
!55 = !{!56, !57, !58, !59, !60}
!56 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "struct_size", arg: 1, scope: !52, file: !16, line: 131, type: !4)
!57 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nmemb", arg: 2, scope: !52, file: !16, line: 131, type: !4)
!58 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "size", arg: 3, scope: !52, file: !16, line: 131, type: !4)
!59 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "req", scope: !52, file: !16, line: 133, type: !4)
!60 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "overflow", scope: !52, file: !16, line: 133, type: !4)
!61 = !DISubprogram(name: "mpd_qnew_size", scope: !16, file: !16, line: 152, type: !62, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: true, function: %struct.mpd_t* (i64)* @mpd_qnew_size, variables: !78)
!62 = !DISubroutineType(types: !63)
!63 = !{!64, !70}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpd_t", file: !5, line: 379, baseType: !66)
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "mpd_t", file: !5, line: 372, size: 384, align: 64, elements: !67)
!67 = !{!68, !69, !74, !75, !76, !77}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !66, file: !5, line: 373, baseType: !42, size: 8, align: 8)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !66, file: !5, line: 374, baseType: !70, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpd_ssize_t", file: !5, line: 157, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !72, line: 197, baseType: !73)
!72 = !DIFile(filename: "/usr/include/sys/types.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!73 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !66, file: !5, line: 375, baseType: !70, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !66, file: !5, line: 376, baseType: !70, size: 64, align: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !66, file: !5, line: 377, baseType: !70, size: 64, align: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !66, file: !5, line: 378, baseType: !10, size: 64, align: 64, offset: 320)
!78 = !{!79, !80}
!79 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nwords", arg: 1, scope: !61, file: !16, line: 152, type: !70)
!80 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !61, file: !16, line: 154, type: !64)
!81 = !DISubprogram(name: "mpd_qnew", scope: !16, file: !16, line: 181, type: !82, isLocal: false, isDefinition: true, scopeLine: 182, flags: DIFlagPrototyped, isOptimized: true, function: %struct.mpd_t* ()* @mpd_qnew, variables: !2)
!82 = !DISubroutineType(types: !83)
!83 = !{!64}
!84 = !DISubprogram(name: "mpd_new", scope: !16, file: !16, line: 189, type: !85, isLocal: false, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: true, function: %struct.mpd_t* (%struct.mpd_context_t*)* @mpd_new, variables: !103)
!85 = !DISubroutineType(types: !86)
!86 = !{!64, !87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpd_context_t", file: !5, line: 270, baseType: !89)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "mpd_context_t", file: !5, line: 260, size: 384, align: 64, elements: !90)
!90 = !{!91, !92, !93, !94, !97, !98, !99, !101, !102}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "prec", scope: !89, file: !5, line: 261, baseType: !70, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "emax", scope: !89, file: !5, line: 262, baseType: !70, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "emin", scope: !89, file: !5, line: 263, baseType: !70, size: 64, align: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "traps", scope: !89, file: !5, line: 264, baseType: !95, size: 32, align: 32, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !13, line: 51, baseType: !96)
!96 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !89, file: !5, line: 265, baseType: !95, size: 32, align: 32, offset: 224)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "newtrap", scope: !89, file: !5, line: 266, baseType: !95, size: 32, align: 32, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "round", scope: !89, file: !5, line: 267, baseType: !100, size: 32, align: 32, offset: 288)
!100 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "clamp", scope: !89, file: !5, line: 268, baseType: !100, size: 32, align: 32, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "allcr", scope: !89, file: !5, line: 269, baseType: !100, size: 32, align: 32, offset: 352)
!103 = !{!104, !105}
!104 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 1, scope: !84, file: !16, line: 189, type: !87)
!105 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "result", scope: !84, file: !16, line: 191, type: !64)
!106 = !DISubprogram(name: "mpd_switch_to_dyn", scope: !16, file: !16, line: 209, type: !107, isLocal: false, isDefinition: true, scopeLine: 210, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.mpd_t*, i64, i32*)* @mpd_switch_to_dyn, variables: !110)
!107 = !DISubroutineType(types: !108)
!108 = !{!100, !64, !70, !109}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!110 = !{!111, !112, !113, !114}
!111 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "result", arg: 1, scope: !106, file: !16, line: 209, type: !64)
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nwords", arg: 2, scope: !106, file: !16, line: 209, type: !70)
!113 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 3, scope: !106, file: !16, line: 209, type: !109)
!114 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !106, file: !16, line: 211, type: !10)
!115 = !DISubprogram(name: "mpd_switch_to_dyn_zero", scope: !16, file: !16, line: 238, type: !107, isLocal: false, isDefinition: true, scopeLine: 239, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.mpd_t*, i64, i32*)* @mpd_switch_to_dyn_zero, variables: !116)
!116 = !{!117, !118, !119, !120}
!117 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "result", arg: 1, scope: !115, file: !16, line: 238, type: !64)
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nwords", arg: 2, scope: !115, file: !16, line: 238, type: !70)
!119 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 3, scope: !115, file: !16, line: 238, type: !109)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !115, file: !16, line: 240, type: !10)
!121 = !DISubprogram(name: "mpd_realloc_dyn", scope: !16, file: !16, line: 273, type: !107, isLocal: false, isDefinition: true, scopeLine: 274, flags: DIFlagPrototyped, isOptimized: true, function: i32 (%struct.mpd_t*, i64, i32*)* @mpd_realloc_dyn, variables: !122)
!122 = !{!123, !124, !125, !126}
!123 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "result", arg: 1, scope: !121, file: !16, line: 273, type: !64)
!124 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "nwords", arg: 2, scope: !121, file: !16, line: 273, type: !70)
!125 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "status", arg: 3, scope: !121, file: !16, line: 273, type: !109)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "err", scope: !121, file: !16, line: 275, type: !42)
!127 = !DISubprogram(name: "mul_size_t_overflow", scope: !128, file: !128, line: 637, type: !129, isLocal: true, isDefinition: true, scopeLine: 638, flags: DIFlagPrototyped, isOptimized: true, function: i64 (i64, i64, i64*)* @mul_size_t_overflow, variables: !132)
!128 = !DIFile(filename: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1/Modules/_decimal/libmpdec/typearith.h", directory: "/home/yoonseung.kim/top/research/pythons/Python-3.4.1")
!129 = !DISubroutineType(types: !130)
!130 = !{!4, !4, !4, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, align: 64)
!132 = !{!133, !134, !135, !136}
!133 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 1, scope: !127, file: !128, line: 637, type: !4)
!134 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "b", arg: 2, scope: !127, file: !128, line: 637, type: !4)
!135 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "overflow", arg: 3, scope: !127, file: !128, line: 637, type: !131)
!136 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "lo", scope: !127, file: !128, line: 639, type: !11)
